{
    "id": "ervw8g",
    "score": 63369,
    "title": "Gun-rights advocates pick-up trash after protesting peacefully in Richmond | 8News",
    "author": "randyjm",
    "date": 1579619455.0,
    "url": "https://www.reddit.com/r/UpliftingNews/comments/ervw8g",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Regardless of a protest, why is there always so much trash and why no one actually tries to take their shit back with them?",
            "score": 5820,
            "author": "m1ndcrash",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 2300,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Except in Japan",
                            "score": 2545,
                            "author": "GiveHerDPS",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The whole country is trained from a young age to pick up after themselves, and they make a point of not having public trash bins so you take your trash home with you... I can't imagine that working in any place other than Japan",
                                    "score": 1394,
                                    "author": "WedgeTurn",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Unlike the theater during a children's movie where the parents are just like \"Eh, let the ushers do their job\" and that's how they end up breaking out leaf blowers to clean the theater in 20 minutes because of the mountains of fucking garbage everywhere. Fuck parents who don't teach their children manners.",
                                            "score": 870,
                                            "author": "_breadpool_",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Fuck being an usher.  Did that for about 2 weeks.  Never again.  You'd be surprised how many people sneak chicken wings into the theatre.",
                                                    "score": 385,
                                                    "author": "rodneycolemanstove",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Having a flashback :Trying clean harden nachos soaked in soda that been sitting there for 3+ hours in less than 5 mins because of the back to back Harry Potter movies",
                                                            "score": 229,
                                                            "author": "savagedragon22",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Hardened or soaked? I'm confused",
                                                                    "score": 66,
                                                                    "author": "DaveJahVoo",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "It's both, man.",
                                                                            "score": 113,
                                                                            "author": "sevenut",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "So soda-soaked nachos that later hardened?",
                                                                                    "score": 16,
                                                                                    "author": "DaveJahVoo",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Shit. It's not even just children. I was at a theater a year ago and some mid 20-30 year olds snuck into the back of the theater with popcorn, candy, drinks and flung that shit all over the place for about 30 mins. Also made a buncha noise. Eventually my sister went out to let an usher know. Usher walks to the back, stands there for ~5 minutes eyeing them. Of course they were chill til the moment the usher was out of sight then they acted up again. Someone else complained and the usher stuck around much longer. The group eventually left but they tossed their cups on the floor and popcorn was literally *everywhere*.",
                                                    "score": 38,
                                                    "author": "defacedlawngnome",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "My mate used you to work at a theatre and he said children movies were the worse to clean up after.",
                                                    "score": 29,
                                                    "author": "Kieooot",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I worked at one too. Your mate was right.",
                                                            "score": 18,
                                                            "author": "gorkgriaspoot",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Leaf blowers ? For real?",
                                                    "score": 15,
                                                    "author": "PooSmellsGoot",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "This is a common misconception.\n\nThe real reason they don't have public trash cans is the sarin gas attacks of the 90's.\n\nThe gas bombs were dropped into trash cans in the subways. So the government did away with the trash cans.\n\nThey are a very clean and orderly society though. The lack of trash cans just isn't a part of it.",
                                            "score": 159,
                                            "author": "Shartsoftheallfather",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Similar reason why there are [no lockers in US subways.](https://www.nytimes.com/1974/05/11/archives/following-dogs-nose-police-uncover-explosives-in-subway-locker.html)",
                                                    "score": 28,
                                                    "author": "WildSauce",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Reactionary policies are weird. Japan has tons of lockers in their train and subway stations. The US has trash cans almost always in arms reach.",
                                                            "score": 12,
                                                            "author": "Nothing2Unusual",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "They don't have trash cans because of the sarin gas attacks of '95",
                                            "score": 87,
                                            "author": "meistermichi",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "True to that. However they also vacuum clean train station floors and change slippers 3 times around the house.",
                                                    "score": 35,
                                                    "author": "m1ndcrash",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Japanese companies even wash their entire delivery truck, wheels and all, before going out to deliver packages. It's like a different world where everyone cares the basic amount to keep society clean.",
                                                            "score": 64,
                                                            "author": "p1-o2",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I mean I wouldn't call it trained more like teaching manners",
                                            "score": 33,
                                            "author": "Uranium_Isotope",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Is there an important distinction between being trained and being taught that I'm unaware of?",
                                                    "score": 19,
                                                    "author": "lucidusdecanus",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Probably a lack of trash cans or over flowing trash cans that are there. Unfortunately when there isnt proper planning on a site there will be trash left by people who wont just hold on to it until they can find a suitable place to put it in.",
                    "score": 235,
                    "author": "Tr3vz",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Can confirm, I was a camera operator covering this event, crew members had some protein bars as a quick snack midday. There was nowhere to throw the trash out. One of our PA’s had to be sent out to go find a trash can and couldn’t. After being at a few of these city protests, i wonder if they remove them to lose the potential of people lighting fire to trash cans in riot behavior.",
                            "score": 60,
                            "author": "Coflo16",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "A protein bar wrapper? Didn’t they have pockets?",
                                    "score": 62,
                                    "author": "pedrotecla",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Our pockets were pretty much filled with spare batteries, media cards, and other camera tools. Don’t want to mix trash with that gear. In the end we through it all in a backpack but the initial reaction was, “hey can you go find a trash can”",
                                            "score": 20,
                                            "author": "Coflo16",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Now you know to add a small trash bag to your list of supplies. I usually have part of a roll of those dog poop bags in my purse or car, they've come in handy so many times in all kinds different situations.",
                                                    "score": 24,
                                                    "author": "edie_the_egg_lady",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt; After being at a few of these city protests, i wonder if they remove them to lose the potential of people lighting fire to trash cans in riot behavior.\n\nLong history of bombings using trash cans. I can understand removing them before a large event, even if it is expected to be peaceful they would make a tempting target (like the Boston Marathon).",
                                    "score": 24,
                                    "author": "Enchelion"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I've seen a common theme of \"I don't have to be responsible for any mess - even if I'm the cause of it - because someone else is being paid to take care of it.\" (It's fairly consistent across locations from McDonalds to concerts to protests. Except, for some reason, this gun rights protest. )\n\nYeah... and that money would not have to be spent if you took a little responsibility and expended a little effort.",
                    "score": 13,
                    "author": "amishbill",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "That's how it should happen, awesome",
            "score": 7208,
            "author": "cornustim",
            "replies": [
                {
                    "level": 1,
                    "comment": "Honestly a win win strategy. You help the environment and better your public opinion. The moment protest gets disorderly and violent, the opposition propagandize it to make it harder for people to side with them.",
                    "score": 1259,
                    "author": "TheNephilims",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Protesters said cleanup would take 20 minutes, awesome.",
                    "score": 37,
                    "author": "bill_ohs"
                },
                {
                    "level": 1,
                    "comment": "The interesting thing is that most peaceful protests would be just that but it takes only 1 stupid fuck to ruin it. Are you going to be that stupid fuck when every single person there is packing ? This is one thing the gun owners have right .",
                    "score": 76,
                    "author": "skatchawan",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1011,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "try this https://outline.com/nuVjFP\n\nif not\n\nRICHMOND, Va. (WRIC) — Thousands flooded the surrounding streets of the Capitol Monday for a gun-rights rally, however, some locals in the area say the roads are the cleanest they’ve seen in quite some time.\n\nThere’s a reason for that, says Matthew Keisling, a protester who made sure that once he shared his message, he went above and beyond to protect it.\n\n“I’ve been in the area when there have been other protests and demonstrations and people leave a lot of trash behind and it waters down the message,” Keisling said.\n\n\nAdvocates told 8News they made sure to clean up after the rally because they felt leaving trash behind “represents the group and the movement very poorly.”\n\nLocals in the city appreciated the gesture, even if it was unexpected.\n\n“They picked everything up and made it look nice,” said Richmond resident Jack Hamilton. “It was really good for them to do that and it looks a lot better and good job.”\n\nAround 22,000 pro-gun activists took the streets of downtown Richmond. The protest was peaceful, with most of the controversy stemming from the fact that participants cleaned up after themselves.\n\n“There’s just cans and you know boxes and trash on the corners and like sidewalks but it looks a lot better,” Hamilton said. “It really does.”",
                    "score": 193,
                    "author": "uhp787",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Why would a local paper give a shit about whether EU citizens can read it?",
                    "score": 60,
                    "author": "Sexbanglish101",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They can't collect/sell our data, so they just made the site non-eu",
                            "score": 10,
                            "author": "t1lewis",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "So a protest occurred, there was no notable (or perhaps any kind of) violence, and then everyone pitched in to help clean up the mess that comes with having thousands upon thousands of people gather together. \n\nThis is the most positive American news and thing I have heard in a long time and it makes me happy.",
            "score": 693,
            "author": "bvanbove",
            "replies": [
                {
                    "level": 1,
                    "comment": "No arrests either.",
                    "score": 100,
                    "author": "JonnyBeanBag",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There was a single arrest, (edit) to clarify, it was a counter protestor harassing the police.\n\nhttps://reddit.com/r/VAGuns/comments/eryglh/the_only_arrest_yesterday/\n\nEdit: sorry for the PM, though this was r\\news",
                            "score": 74,
                            "author": "MowMdown",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Fair enough, hadn't heard that until now. Still, pretty good for what we:re used to.",
                                    "score": 24,
                                    "author": "JonnyBeanBag",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah, masks in public are illegal here in VA. You can find my comment in that thread quoting the law.",
                                            "score": 27,
                                            "author": "MowMdown",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "\\&gt;  The protest was peaceful, with most of the controversy stemming from the fact that participants cleaned up after themselves. \n\nWhat part of picking up trash is \"controversial\"?",
            "score": 4407,
            "author": "GooberMcNutly",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm going with the fact that people thought it would be a) violent b) only filled with straight, cis, white males, c) have racists or nationalists overtones, and d) leave the area disturbed, trashed, or otherwise fucked up.\n\nTurns out that I believe only one person was arrested, for refusing to remove a mask, there were several people who were not straight or cis or white or male, I've heard no reports of any racist or nationalist bullshit (and have heard counter reports of people openly rejecting that), and things were not damaged and cleaned up.",
                    "score": 360,
                    "author": "a_cute_epic_axis",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Plus the reporting from the mainstream journos that this was a white supremacist rally and that others shouldn’t mischaracterize it as anything else. And retweets of the same lie posted on hundreds of thousands of accounts.",
                            "score": 163,
                            "author": "olaisk",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Some people honestly and unironically think most gun owners are on the verge of violence at any given moment (because what normal/sane person would possibly own a gun), so a group of aggravated gun owners obviously equals mass violence. \n\nAlso the media was basically foaming at the mouth hoping for violence to further the anti-gun narrative.",
                    "score": 4383,
                    "author": "byerss",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm a progressive in the Pacific northwest that supports gun rights (and proper background checks) and the number of people who either cant understand how that's possible or that think you are a closet right wing Confederate is mildly astounding. I tend to never mention it anymore lol",
                            "score": 1367,
                            "author": "Skeletor_418",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I feel you. \n\nI’m the daughter of a middle eastern immigrant, I am left leaning, want healthcare, and support gun rights, and it blows peoples minds for some reason. I just don’t see how anything like that is mutually exclusive.\n\nNo joke I was literally yelled at one time by a friend who said “HOW CAN YOU SUPPORT GUNS?! YOUR DAD IS AN IMMIGRANT!” 🤷🏻‍♀️",
                                    "score": 541,
                                    "author": "JayRock_87",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I feel this. I'm pretty Independent and lean left/right on a variety of issues. People legitimately think you need to pick one side or the other.\n\nThe view that people get of you and what you're supposed to be is crazy. If you break their idea of what they think you are its like a glitch in the matrix.",
                                            "score": 111,
                                            "author": "djm2491",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "What gets me are the people who will call you a centrist / independent, but as a legitimate derogatory term. As if the very idea of someone being open to hear both sides of an argument before forming an opinion is both offensive and unreasonable to them. Just... How? How does one even become that way?\n\n&amp;#x200B;\n\n It is truly an enigma to me.",
                                                    "score": 75,
                                                    "author": "nekoshey",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "That’s 99% of reddit.",
                                                            "score": 39,
                                                            "author": "testa12",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Meh if your not a left leaning progressive your basically the enemy to them.",
                                                            "score": 7,
                                                            "author": "Archangelus87"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 15,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "That person sounds like a doofus lol. And that’s the problem with politics now a days . A small percentage of people with loud barks who can’t come up with a rational thought to save their lives are the ones screaming at the top of their lungs.",
                                            "score": 143,
                                            "author": "joeanthony93",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "We need to bring back doofus.  I'm gonna use it a few times and see how it feels.",
                                                    "score": 27,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "My step mom is an immigrant and has her pistol permit. I think it’s awesome.",
                                            "score": 64,
                                            "author": "Beerfarts69",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[\"Armed minorities are harder to oppress,\"](https://twitter.com/alec_sears/status/1219273971537010690) or something like that.",
                                                    "score": 11,
                                                    "author": "PM_ME_SSH_LOGINS"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 163,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Buying a gun automatically turned me into a white man.",
                                                    "score": 67,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Holding my gun sideways turned me into a black man.",
                                                            "score": 46,
                                                            "author": "sdfgh23456",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Tell me about it.  \n\nThe second my wrist started tilting... I could hear the HOA footsteps coming to my front door.  \n\nI didn’t even add pepper to the chicken that night in penance.",
                                                                    "score": 21,
                                                                    "author": "JayArlington"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "We've done such a good job dehumanizing each other that when someone you generally agree with suddenly has a divergent view it feels like a \"mask off\" betrayal.",
                                    "score": 496,
                                    "author": "royal23",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 148,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Also without the Patriot act part.",
                                                    "score": 54,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "And on Reddit if you make comments like this you'll be called an eNlIgHtEnEd CeNtRiSt.",
                                                    "score": 130,
                                                    "author": "Needyouradvice93",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yeah I really hate that shit as an independent. It’s like they’re shaming you for not being fucking brainwashed.",
                                                            "score": 90,
                                                            "author": "Hawkmooclast",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "That's exactly what they're doing. \n\n-'OH you're not 100% on our side, that makes you the enemy'",
                                                                    "score": 70,
                                                                    "author": "Needyouradvice93",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "This is what happens in a 2 party system. It becomes \\*Us\\* vs \\*Them\\*. The lion's share of funding for state wildlife conservation programs comes from the sale of guns, ammunition, and other hunting supplies, thanks to an 80-year-old piece of legislation called the Federal Aid in Wildlife Restoration Act, also known as the Pittman-Robertson Act.",
                                    "score": 52,
                                    "author": "Needyouradvice93",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "The issue is that through the news and other echo chamber sources, gun rights has been made into a partisan issue, and it shouldn’t be. The stereotype that rednecks from Alabama are the only people who want guns has been pushed so hard, and believed, that some think it preposterous that anyone else wants guns.",
                                    "score": 34,
                                    "author": "Bad_Jimbob",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "You’d probably like the sub r/liberalgunowners",
                                    "score": 40,
                                    "author": "csdspartans7",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 88,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "There's more of us than you think!",
                                            "score": 9,
                                            "author": "Rhino4910"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt; I tend to never mention it anymore\n\nUnfortunately, that's getting to be the only sane policy. You never know who's going to file a \"red flag\" report on you because you differed from *their* prejudices.",
                                    "score": 168,
                                    "author": "txstoploss",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Start mentioning it. People need to see normal gun owners who are just like them, so the ridiculous stereotypes don't get any traction. Best thing I've found is take them shooting. Seeing the obsessive safety at a lot of ranges and people just having fun tends to take a lot of fear out of it.",
                                            "score": 48,
                                            "author": "Bringing_Wenckebach",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That's it. It's final. I'm finally going to come out of the gun closet and admit who I truly am!",
                                                    "score": 16,
                                                    "author": "kleep",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Same here. Raised by hippies and hillbillies both and both sides agree that guns have some reasons, but not everyone needs them and some people shouldn't have them. Funnily enough around where I'm from more people leaning right think that there should be more training accociated with ownership like driving. Most likely since people who go out shooting more often see others do dumb stuff more often.",
                                    "score": 7,
                                    "author": "dognus88",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt; Some people honestly and unironically think most gun owners are on the verge of violence at any given moment\n\nEveryone else remember how hard media outlets were stroking their dicks for a potential shooting the weekend of the Joker premier? They're *begging* for blood.",
                            "score": 187,
                            "author": "Gingevere",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Because blood and murder/death/kill gets clicks and Twitter all a-twittering.",
                                    "score": 60,
                                    "author": "Evil_Merlin",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Yeah that's what it reminded me of.",
                                    "score": 34,
                                    "author": "gun-nut"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 52,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Fascinating isn't it?  We're being told that the government is slowly devolving into a dictatorship under the current president by the same people who believe that only the government needs access to guns.",
                                    "score": 58,
                                    "author": "iushciuweiush",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "My favorite is the \"wow if you have all that stuff why don't you go to Afghanistan\".  As if having a gun and plate carrier but not wanting to kill anyone makes me more of an unhinged lunatic than the person claiming that if you have a gun you \\*have\\* to kill people.",
                            "score": 613,
                            "author": "h00paj00ped",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "People can support gun ownership and be anti-imperialist",
                                    "score": 358,
                                    "author": "czarnick123",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I agree. You can be a gun owner and support 2A, but be against war and imperialism.",
                                            "score": 174,
                                            "author": "GF8950",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Such as I, I don’t currently own a firearm but I support the right to do so, and the historical and mechanical interest of weapons, but I’m a pacifist",
                                                    "score": 58,
                                                    "author": "Butternades",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It's kind of like herd immunity.  If there is a large percentage of people in your city that have self defense guns, the number of violent robberies tends to be less.  \n\nI have guns locked away from the ammo, because I have small kids that know how to use them.  I trust them to be safe at the range, but i'm not stupid enough to leave them where they can get at them.",
                                                            "score": 50,
                                                            "author": "bertcox",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Marx himself advocated for the workers to be well-armed.",
                                            "score": 215,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The people willing to give up the right to arms are the people that trust the government will protect them. Usually because they never had to rely on the police to actually keep them safe",
                                                    "score": 250,
                                                    "author": "beetard",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "When seconds count, the police are only minutes away.\n\n^or ^hours/days ^if ^you're ^not ^in ^a ^good ^neighborhood.\n\n^^or ^^they're ^^the ^^ones ^^shooting ^^you.",
                                                            "score": 105,
                                                            "author": "Gingevere",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "or they’re the ones planting evidence or beating up disabled people",
                                                                    "score": 20,
                                                                    "author": "DM_ME_CUTE_PICS_PLZ",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "FUCKING THIS. RIGHT HERE. THIS GUY GETS IT.\n\n“jUsT cAlL tHe PoLiCe!” Oh fucking yea, and during the 15 minutes before they (maybe) show up, how about I have my fucking maid make them a sandwich and the Valet pull their fucking car around.",
                                                            "score": 188,
                                                            "author": "DickVanSprinkles",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I was moderately anti gun (if Im being honest, I didnt really have much of an opinion either way and was fairly uneducated) until I experienced this first hand. \n\nThe cops (who arrived around 14 minutes after calling 911) looked me dead in the eye and said \"its not our job to keep you alive, that's your job. Our job is to keep the peace\".",
                                                                    "score": 124,
                                                                    "author": "Kytoaster",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Heller Vs DC was a Supreme Court case laying out that very fact. I used to live in an unincorporated part of town, and I had to wait while a meth head who I managed to trap in my garage after he had broken into my house tore my garage up, for the police to turn down my request for aid an call the sheriff instead of sending a closer officer.\n\nEdit: I have been informed that it’s Warren Vs DC which established the police’s responsibility to uphold the law rather than protect the people.",
                                                                            "score": 52,
                                                                            "author": "DickVanSprinkles",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Heller v DC was about the right to possess a handgun in your home.\n\nYou're thinking of Warren v DC.",
                                                                                    "score": 21,
                                                                                    "author": "texag93",
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "\"I fashioned a spear from a kitchen knife and mop and stabbed him\" \n  \n\"I lit the garage on fire and called the fire department\" \n  \nGuaranteed swift arrival.",
                                                                                    "score": 13,
                                                                                    "author": "El_Stupido_Supremo",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "One of my favourite pasta courses:\n\n\nListen here you retarded limpdick motherfucker. I’m going to try to explain this so that you can understand it.\n\n\nYou cannot control an entire country and its people with drones, tanks, jets, battleships or any of that shit that you so stupidly believe will triumph over citizen ownership of firearms. A drone, jet, tank, battleship or whatever, cannot stand on street corners and enforce “no assembly” edicts. A drone cannot kick down your door at 3AM and search your house for contraband materials or propaganda.\nNone of those things can maintain the needed police state to completely subjugate and enslave the people of a nation. Drones and those other weapons are for decimating, flattening, glassing large areas, killing many people at once, and fighting other state militaries. The government does not want to kill all of its people and blow up its own infrastructure. These are the very things they need to be tyrannical assholes in the first place. If they decided to turn everything outside of Washington D.C. into glowing green glass, they would be the absolute rulers of a big, worthless, radioactive pile of shit.\nDrones are useless for maintaining a police state. Police are needed to maintain a police state. Boots on the ground. No matter how many police or soldiers you have on the ground, they will always be vastly outnumbered by civilians. Which is why in a police state it is vital that your police have automatic weapons while the people have nothing but their limp dicks.\n\n\nBut when every random pedestrian could have a Glock jammed in their waistband and every random homeowner has an AR-15, all of that gets thrown out the fucking window because now the police and military are outnumbered and kicking down those doors becomes a lot fucking riskier, lest you catch a bullet on your way in and face the reality of bullets coming back at them.\n\n\nIf you want living examples of this look at every insurgency that the U.S. military has ever tried to destroy. They’re all still kicking with nothing but AK-47s, pick up trucks, and improvised explosives. Because these big scary military monsters you keep alluding to are all but fucking useless for dealing with them.\n\n\nDumb. Fuck.",
                                                                    "score": 70,
                                                                    "author": "Suicidal_Ferret",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "These people must not be closely watching current politics or the news.\n\nI get numb and queasy holding a gun but I still support our right to bear arms.  Trusting others to protect you while you go virtually incapable of protecting yourself is basically placing your entire life in someone else's hands.\n\nAnd I'm not convinced they're willing to lift a finger in my defense.",
                                                            "score": 59,
                                                            "author": "Littleman88",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "They are not legally obligated to defend you. \n\nProtect and Serve is marketing.",
                                                                    "score": 63,
                                                                    "author": "MrHorseHead",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "&gt; Protect and Serve is marketing.\n\nInvented by the LAPD ... in the 70s ... which was the height of their corruption.",
                                                                            "score": 9,
                                                                            "author": "gslavik",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[deleted]",
                                                                    "score": 61,
                                                                    "author": "[deleted]",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Some very progressive places in northern Europe are also pro gun. People just put themselves into boxes here in the us where they vehemently believe and defend the cookie cutter definitions of \"liberal\" or \"conservative\" laid out for them by politicians with corporate agendas instead of thinking for themselves",
                                                    "score": 55,
                                                    "author": "Skeletor_418",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "This is a “reporter attended event and there was no story” story.",
                            "score": 18,
                            "author": "JosephGordonLightfoo"
                        },
                        {
                            "level": 2,
                            "comment": "The media kept warning us of \"another Charlottesville\". Funny how they try to group actual Nazis, and legal gun owners, in the same category.",
                            "score": 210,
                            "author": "Aushwitzstic",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "In their eyes it's all the same. You can't be a gun owner or you're alt-right, etc.",
                                    "score": 37,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "News organizations want you to be mad about something so you’ll be hooked. \n\nThe real reason left hates right and the other way  is cherry picked examples to enrage us and motivate us to share more stories and dial in. \n\nMeaning more clicks and more advertisement and more products sold.",
                    "score": 37,
                    "author": "bradtwo",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "It’s controversial because reddit was foaming at the mouth for violence",
                    "score": 772,
                    "author": "Azh1aziam",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s like when you could practically hear the heartbreak coming from the media when there were no shootings linked to the new Joker movie.",
                            "score": 347,
                            "author": "IHateNaziPuns",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "“DAY 17 OF JOKER WATCH!  WE’RE EXPECTING SHOOTINGS TO BREAK OUT ACROSS THE COUNTRY ANY MINUTE NOW!”\n\n“...any minute now...”",
                                    "score": 198,
                                    "author": "Ice_Liesidon",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "YEP, AT ANY MOMENT WE'LL HAVE A NEW FACE TO PLASTER ALL OVER THE TV AND INTERNET MAKING THIS PERSON AN OVERNIGHT CELEBRITY AND HOUSEHOLD NAME.  WE'LL MAKE SURE NOTHING IS TALKED ABOUT OR FOCUSED ON AS MUCH AS THIS DERANGED PERSON.  OH BOY, WE HOPE IT DOESN'T HAPPEN, THOUGH.",
                                            "score": 13,
                                            "author": "KingLiberal"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This thread is full of rational people expressing the actual truth about the rally, am I still on reddit?",
            "score": 1232,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "r/politics hasn't brigaded yet.",
                    "score": 286,
                    "author": "Drumpfeatsmyass",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Fuck I hate that sub. Such a cesspool of circlejerking idiots.",
                            "score": 199,
                            "author": "testa12",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You're experiencing a thread full of conservative moderates for the first time. Welcome.",
                    "score": 489,
                    "author": "piss-and-shit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Don’t forget us liberal moderates. Also welcome.",
                            "score": 436,
                            "author": "superkirb8",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hey now, us on the far left support the 2a too. Do you think seizing the means of production happens via strongly worded letters?\n\n/S (kinda)",
                                    "score": 212,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Pretty sure Marx said that any movement to disarm the working class should be met with violence and prejudice.\n\nNot /s",
                                            "score": 155,
                                            "author": "piss-and-shit",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 34,
                                            "author": "[deleted]",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "This without sarcasm\n\n/r/socialistRA\n\nMarx himself said all people should be armed.",
                                            "score": 34,
                                            "author": "itty53",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "UNDER NO PRETEXT 🤝 SHALL NOT BE INFRINGED",
                                                    "score": 16,
                                                    "author": "Thorbinator"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I vote Dem and own assault rifles! We exist dammit!",
                                    "score": 55,
                                    "author": "scratchnsniffy",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm not surprised, lots of those in attendance are also going to be conservationists due to their outdoorsmanship.  One of the first rules of the outdoors is \"pack it in, pack it out\" so I'd expect most of the people at that rally to be living by that value.",
            "score": 1649,
            "author": "GlumImprovement",
            "replies": [
                {
                    "level": 1,
                    "comment": "Leave no trace. One of the biggest things I've taken from scouts.",
                    "score": 635,
                    "author": "Orinaj",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yup. Leave nothing but footprints, take nothing but pictures.",
                            "score": 307,
                            "author": "spaghettiThunderbalt",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "...and any trash you might come across.  Leave it BETTER than when you arrived!",
                                    "score": 167,
                                    "author": "27thStreet",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I never come out of the woods without some trash I picked up. I really hate balloons.",
                                            "score": 63,
                                            "author": "Jojo2700",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Balloons suck. Second only to glitter. That shit gets everywhere.",
                                                    "score": 9,
                                                    "author": "poutineisheaven"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "The comments above this one are all you need to know (besides personal preparedness) about being a responsible outdoorsman.",
                                            "score": 27,
                                            "author": "SaltyTree"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "We always had \"kill nothing but time\" tacked on in our troop, but that was more of a \"don't fuck around ripping up plants/saplings,\" because we ate a looooot of fish",
                                    "score": 10,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Went over this with my cub scouts last night. Very important to teach young one's this in my opinion.",
                            "score": 13,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "What's really funny about \"Leave No Trace\" is that the people I see littering the most are hipsters who don't think it \"counts\" as littering. In my several decades of being in a national forest, I have seen huge uptick in recent years of so-called \"Influencers\" going way off trail, making weird campsites with a van involved usually, and then burning their non-compostable trash, throwing the organic material all over the place, and leaving rock stacks *near trails* confusing the hell out of hikers. The worst case I saw was a dude who went into a very secluded spot *cut down several trees* to make a teepee like structure, then illegally fished a nearby lake. When we caught him he was taking photos of himself in front of his hut. His defense \"The natives lived like this so what does that say about you to callout their lifestyle!?\"\n\nIt did not help his case that 3 of 5 people there were Native American, including myself.",
                    "score": 242,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Those rock stackers make me irrationally angry. If they are not the ones personally mapping and maintaining the trail, then they have no business marking it.",
                            "score": 65,
                            "author": "SuchRoad",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It gets worse than that. It ruins habitats for wildlife and causes artificial geomorphology. Don’t stack rocks it’s kinda dorky anyway.",
                                    "score": 9,
                                    "author": "tenthousandtatas"
                                },
                                {
                                    "level": 3,
                                    "comment": "I’ve seen these a few times while hiking and I still don’t know why it’s a thing. I just assumed it’s for taking pictures. Why is it bad? If I find one should I take it down?",
                                    "score": 13,
                                    "author": "Futurames",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "In Missouri it is typically used on glades and fields so that you can see where the  trail starts up again on the other side, but at some point it became popular to just stack rocks anywhere just for the hell of it. People also mark their own cheater trails with police tape or spray paint.  \n\nMaybe I am getting too worked up about this.",
                                            "score": 14,
                                            "author": "SuchRoad"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 45,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I drove through there about an hour after most of the protesters left, and was shocked at the pristine condition the area was in. It honestly looked better than it usually does.",
            "score": 265,
            "author": "limbictides",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Americans are good people overall and not nearly as evil or divided as the media and politicians wants us.\n\nWow! Thanks for the Karma! I knew we were all good people!",
            "score": 2099,
            "author": "Ohnoyoudont1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Canadian. Been travelling in and out of the US most my life. Always had good times. Only thing(s) I don't like is how open people are about their religion and politics. I don't want to discuss Trudeau/Trump with you, or share my religious views. \n\nOtherwise, people in ever state I have visited have been wonderful.",
                    "score": 473,
                    "author": "TargetQ2",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I agree, good people all over. My experience is that depending on where you are in the US people either will or will not openly discuss politics and religion. Where I live we do not openly engage in those discussions. Somewhat of an unwritten rule and it's considered impolite to bring it up.",
                            "score": 119,
                            "author": "Ohnoyoudont1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ya anywhere in the south/ pre-coast west it's really taboo",
                                    "score": 48,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "In NY people of all political stripes bash the state government. I've never seen anyone disagree that the state legislature is deeply corrupt. We recently (well, in the last five years) have had the leaders of both houses indicted for pretty egregious fraud.",
                                            "score": 37,
                                            "author": "wafflesareforever",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Ya know I noticed when traveling abroad I rarely have any political conversations with Canadians but (especially recently) I’m consistently asked my political views by Europeans. I try to avoid those convos",
                            "score": 24,
                            "author": "acompletemoron",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I live in CA and I actually know very few people who advocate gun control. Most people dont really care or are kind of on the “guns scare me so I’m not buying one” side of the fence. \n\nThen again my old boss did call me a danger to society and I laughed in his face. Didnt go over too well.",
                    "score": 178,
                    "author": "19fiftythree",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Guns are scary. They are weapons. But go to a range and test one out and you might find yourself in love.",
                            "score": 120,
                            "author": "lurkermothertruck",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Problem is how many people have no idea what they're talking about when it comes to firearms or what laws actually exist.",
                            "score": 56,
                            "author": "Darkmetroidz",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "To compound, those are generally the people writing the laws.",
                                    "score": 31,
                                    "author": "19fiftythree",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 33,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "People should be disgusted with the media.  They were practically willing something to happen.  Much like the Joker premiere.  These bloodthirsty vultures want people to get hurt.",
            "score": 1255,
            "author": "DewDurtTea",
            "replies": [
                {
                    "level": 1,
                    "comment": "Quit Fox News. Quit CNN.",
                    "score": 232,
                    "author": "scratchnsniffy",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "How dare you take away their first amendment rights to strike fear into people to sell clicks!",
                    "score": 219,
                    "author": "Theeclat",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Not just the media but the mentally ill blue checks on twitter calling these people \"racist white-males who never served a day in their lives.\" You just can't take anything at face value anymore which is very sad.",
                    "score": 250,
                    "author": "MetalKotei",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A redditor said I was as bad as moon hoaxers and anti-vaxxers for being pro-2A.",
                            "score": 144,
                            "author": "scratchnsniffy",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thousands of armed people.\n\nNo gunfire.\n\nNo violence.\n\nNo destruction of public or private property.\n\nNo trash left behind.\n\nTAKE FUCKING NOTES PORTLAND, OR",
            "score": 463,
            "author": "Bourbonium",
            "replies": [
                {
                    "level": 1,
                    "comment": "\"Thousands of armed people.\n\nNo gunfire.\"\n\nAs I've said before, the GUNS are not the problem.  A gun has no more propensity to kill someone than a knife or a baseball bat.\n\nIt's the asshole murderer holding the item.  Banning one or the other doesn't ban murder.",
                    "score": 193,
                    "author": "MrValdemar",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Maybe we should make murder illegal, that will stop it. /s",
                            "score": 102,
                            "author": "Mike_Hunt_69___",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Media was building it up to be the Apocalypse.",
            "score": 655,
            "author": "Uberjeagermeiter",
            "replies": [
                {
                    "level": 1,
                    "comment": "You mean the media misled me? No way! /s",
                    "score": 288,
                    "author": "pm_me_ur_gaming_pc",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "But remember: actually calling them out for being massive liars and trying to *create* news instead of reporting on what happens makes *you* the bad guy, apparently.",
                            "score": 92,
                            "author": "GlumImprovement",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[This is Extremely Dangerous to our Democracy.](https://youtu.be/B6cX7Lv-BUc)",
                                    "score": 12,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They didn't get their joker shooter so they were hoping for one yesterday.",
                    "score": 149,
                    "author": "NaturallyNasty",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "One day they'll get it. Then they can reference a murder that happened less than 38,745 murders ago in every article about an upcoming rally they disagree with.",
                            "score": 60,
                            "author": "iushciuweiush",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I live literally 5 floors above where this event was taking place. Few items \n\n1.\tThe notion these were racist or otherwise white supremacist was so outrageous it's basically the laughing stock of jokes in RVA right now. Even the \"militia\" dressed and geared individuals were making fun of themselves calling it alittle like cosplaying.  \n2.\tthere were members from all races as well as females and LGBQ carrying at this event. In all situations members all interacted with each other in complete positivity.  Example BGM (black guns matter) and other white individuals got together, traded info on guns, compared gear, invited each other shooting and to ranges, traded stories etc.  \n3.\twe in RVA universally hate infowars and Alex Jones. So much so that there was an actual threat to his stupid MRAP vehicle here in the area and it was spray painted (attempted).\n4.\tlocal businesses in the area of the rally (downtown Richmond is very small) had a record breaking sales day. Even with the huge lines everyone was kind and super nice to the local businesses. \n5.\tstop calling it a protest, it was a rally. It's held once a year. Every year. Also with the same individuals carrying just as many and type of firearms. Yes this exact thing happened last year. And the year before. And the year before. This simply had much more individuals due to the recent bills being presented (and some passed) regarding gun control. \n6.\tlocally it has been noticed (and not to bring up anything about the trump inauguration) pictures of the event are definitely, without a doubt, skewed smaller. Much more showed up at the rally than many of the sky photos on MSM. Check local sources for pictures such as nbc12.com",
            "score": 240,
            "author": "Daemonrealm",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s amazing to see so much unity over an issue that the media wants division. It feels like almost every situation on every side of politics is pitting people vs each other. We need to learn that we can stand united on many issues.",
                    "score": 31,
                    "author": "sirmayham"
                }
            ]
        },
        {
            "level": 0,
            "comment": "lol Reddit and the media were practically begging for something horrible to happen at this event, just like when the media was begging for someone to shoot up a theater during the Joker premier. This is why the media truly is the enemy of the people.",
            "score": 172,
            "author": "GeneralTyler",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Good for them. Protests can be really rude to sanitation workers so it's nice to see. Maybe cities should charge a deposit that's refunded if and when groups clean up after the event.\n\nEdit: Spelling",
            "score": 434,
            "author": "adeiner",
            "replies": [
                {
                    "level": 1,
                    "comment": "That would be abused unfortunately. It’s every Americans right to protest and there should be the least amount of barriers possible for them to exercise those rights.",
                    "score": 256,
                    "author": "passwordsarehard_3",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ugh yeah I could see it hurting poorer groups from protesting.",
                            "score": 108,
                            "author": "adeiner",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes, and also, some would then feel they paid not to clean up.",
                                    "score": 61,
                                    "author": "dukeocanada",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wow, reddit allowed this to be upvoted? Color me surprised... good form...",
            "score": 137,
            "author": "BANGSBASS",
            "replies": [
                {
                    "level": 1,
                    "comment": "Almost 11 years on reddit and this shocked me. What is happening?",
                    "score": 27,
                    "author": "simohayha",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Here in mexico guns are illegal, there are no stores selling them, but have you seen the crime rates involving guns in my country? \n\nIt amazes me",
            "score": 495,
            "author": "darkuser93",
            "replies": [
                {
                    "level": 1,
                    "comment": "Pretty sure guns are also highly illegal in Brazil but I guess the gangs in the Favela’s didn’t get the memo.",
                    "score": 263,
                    "author": "newmoneyblownmoney",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "it's almost impossible to buy a gun legally in brazil (i've tried).\n\nshocking news: criminals don't follow the law.",
                            "score": 141,
                            "author": "fernandotakai",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Can't you just become a Brazilian off duty cop?",
                                    "score": 12,
                                    "author": "Schonke"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Everyone freaking out because the rally doesn’t fit preconceived notions on gun activists. (Maybe not freaking out, but it’s cool to see people being educated to the fact not everything is cut and dry.)",
            "score": 101,
            "author": "timetravelwasreal",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Enjoy this post for the 4-5h it will stay on top before mod intervention",
            "score": 463,
            "author": "Maso_del_Saggio",
            "replies": [
                {
                    "level": 1,
                    "comment": "Y'ALL",
                    "score": 123,
                    "author": "WeekendImmuneSystem",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "CAN'T",
                            "score": 118,
                            "author": "CohnJunningham",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "BEHAVE",
                                    "score": 121,
                                    "author": "lightningbadger",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 36,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don’t agree with them, but that’s damn respectable. Well done.",
            "score": 1307,
            "author": "SgtRed196",
            "replies": []
        },
        {
            "level": 0,
            "comment": "The way we get our news is designed to highlight conflict and difference, which is a shame because any dialogue without charity or understanding, that is ruled by impulsive anger or fear, is not a dialogue.  When there’s no dialogue, everything goes to shit.  \n\nMaybe we watch the bad stuff thrown out (or “cancelled”) and celebrate, but the good stuff gets thrown out too.  We become blind to any chances of things working out without violence.",
            "score": 76,
            "author": "gking407",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Weird, all I heard from r/politics was that it was a literal Nazi rally",
            "score": 48,
            "author": "Dave_Matthews_Jam",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 20,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I didn't know I could be Asian and a nazi...\n\n&amp;#x200B;\n\n^(someone post that one picture of the Asian girl with the sign saying \"Do I look like a white supremacist?\" at the rally)",
                            "score": 15,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’ve seen so many articles specifically on how they protested peacefully. Are gun rallies usually violent?",
            "score": 174,
            "author": "jovial_jack",
            "replies": [
                {
                    "level": 1,
                    "comment": "Do you remember how a lot of news outlets were talking about there was almost certainly going to be a mass shooting at one of the The Joker screenings and it never happened? This is pretty much the same thing.",
                    "score": 427,
                    "author": "JohnTheDropper",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yup. \n\nIt's like the media is pushing a narrative over things it doesn't like.",
                            "score": 262,
                            "author": "NitzMitzTrix",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "People were spotted playing empty casings on the ground and taking photos of them. Expect to see those on r/news in a few days.",
                                    "score": 106,
                                    "author": "KorianHUN",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 34,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[Yup.](https://i.imgur.com/UfktNLU.jpg)",
                            "score": 29,
                            "author": "Work-Safe-Reddit4450",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "No. But the media was hoping it would be.",
                    "score": 18,
                    "author": "lookatmeimwhite",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "No, not at all. In the weeks leading up to Lobby Day. The media painted the event as a white supremacist rally aimed at spreading violence. In reality it was law abiding Virginia gun owners protesting government overreach. 95% of Virginia counties have declared themselves second amendment sanctuaries and will not enforce the proposed laws. This was an effort to stop these new laws from being signed by the governor.",
                    "score": 129,
                    "author": "northbud",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "There were articles predicting this to be a kind of violent white supremacy rally.",
                    "score": 85,
                    "author": "link_maxwell",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "&gt; Are gun rallies usually violent?\n\nNo but anti-2A folks want you to think they are.",
                    "score": 37,
                    "author": "Xumayar"
                },
                {
                    "level": 1,
                    "comment": "The media was pushing the white nationalist narrative. Gun rallies are usually peaceful, because guns. If things started to go south, everyone with a lick of good sense would quickly get out of there.",
                    "score": 66,
                    "author": "TinyFugue",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Isn't this the protest where people said it would get violent, dangerous, and people were told not to go to? Violent dangerous people don't pick up after themselves.",
            "score": 53,
            "author": "FO_Steven",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Meanwhile, r/politics is having a breakdown over the fact nothing bad happened.\n\n[https://www.reddit.com/r/PoliticalHumor/comments/ertxgu/gun\\_rights\\_rally\\_virginiarally/?utm\\_source=share&amp;utm\\_medium=web2x](https://www.reddit.com/r/PoliticalHumor/comments/ertxgu/gun_rights_rally_virginiarally/?utm_source=share&amp;utm_medium=web2x)\n\nEdit: my mistake, r/PoliticalHumor",
            "score": 54,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I lost braincells reading that thread",
                    "score": 24,
                    "author": "ChosenCourier13"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is awesome!",
            "score": 115,
            "author": "LordZombie14",
            "replies": []
        }
    ]
}