{
    "id": "fkei63",
    "score": 70883,
    "title": "Trader Joe's is paying bonuses to store employees amid an 'unprecedented' sales increase",
    "author": "Crohnies",
    "date": 1584484244.0,
    "url": "https://www.reddit.com/r/UpliftingNews/comments/fkei63",
    "media_urls": [
        "https://www.businessinsider.com/trader-joes-will-pay-bonuses-amid-coronavirus-sales-spike-2020-3"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "My mom works at Trader Joe’s. She went through a pretty heavy depression phase last winter and TJ’s was there with her every step of the way, reducing her hours and giving her paid time off whenever needed. They really do care for their workers and provide a positive environment.",
            "score": 1600,
            "author": "NeatEmergency",
            "replies": [
                {
                    "level": 1,
                    "comment": "As a crewmember, I’ve been through some things. Whether or not I take them up on their offers, TJ’s made so much available to me. I’m glad your mom is in our family. It’s a good home.",
                    "score": 419,
                    "author": "icrossedtheroad",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 72,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This was part of my Master's thesis. Raise the skill levels of the employees so that they can participate in the day to day operational decision making processes. Reduce mid level management while growing self led teams. Pay for performance.",
                                    "score": 34,
                                    "author": "Zonekid",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's not necessarily about skill. It's about power.\n\nGrunts are powerless and often snuffed at when making suggestions. Then they settle in and realize making suggestions is a waste of energy at best, or considered \"not following management,\" at worse. Managers don't want your ideas; it undermines their utility and job security. Just do your job and stop asking questions.",
                                            "score": 9,
                                            "author": "Ellice909"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They were pretty nice when I was there but I also got pulled aside and told I should go home for times when I wasn’t “peppy” enough at the registers or demo. Not everyone wants done one shouting about how they ALSO love the Mac and cheese here. Some just wanna get their shit and go. I was never rude or looked too depressing, i just didn’t blast “fun guy vibes” into their faces and they really didn’t like me for it.",
                    "score": 46,
                    "author": "KingoftheUgly",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I frankly am weirded out by the trader Joe's peppiness and find it creepy when the cashier comments on my purchases. My fiancee loves their pot pies and when I go I stock up for him since I only go like once a month and every time I get some weird remark about how I must be made of pot pie or something. Just let me buy my groceries in peace.",
                            "score": 21,
                            "author": "smughippie",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "employees that act artificially happy genuinely bug me. i appreciate you",
                            "score": 29,
                            "author": "Drab_baggage",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I sometimes do it just because it can turn into real happiness. The whole 'fake it til you make it'. It's so much better to work in an environment where people at the very least aren't pissed off. But I don't expect people to be chipper 24/7 I have bad days/hours where I'm just hanging on...",
                                    "score": 9,
                                    "author": "Needyouradvice93"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I just went to a trader Joe's and they had their system down pat. Person standing in the door with hand sanitizer spritzing every customer's hands and wiping down their cart or basket for them before they go inside. Friendly sign in the front asking everyone to keep their purchases minimal for the sake of other customers. I felt a lot more at ease knowing that they were taking such precautions.",
            "score": 5019,
            "author": "karikit",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wow, every store should hire a sanitizing greeter like this. I keep seeing story after story of service workers losing their jobs this week. There are so many positions like this they could fill.",
                    "score": 1241,
                    "author": "HicJacetMelilla",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "FYI, everyone at Trader Joe's does every job. We stock your produce, receive shipments, work registers, spritz hands... You gotta do it all.",
                            "score": 930,
                            "author": "pro_forma_life",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "How does the scheduling get decided? Just a weekly rotation?",
                                    "score": 190,
                                    "author": "fourAMrain",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "We set our availability and preference. Those of us who WANT full time (38 hours scheduled) generally get it. Some people only want part time and they generally get it. We also give preferences to when we work and that is generally honored. Those of us physically able and willing to receive trucks and do the super heavy lifting for the hours after it arrives required to go from 10 50lb cases to 500 units of carrots on a shelf are usually more likely to get full, regular hours with harder work.",
                                            "score": 368,
                                            "author": "pro_forma_life",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 140,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I work for a totally unrelated company but got emails saying we hired 3 people today. Companies are still hiring, just got to find the right ones.",
                                                            "score": 101,
                                                            "author": "kbuck30",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "One of the grocery stores out here (either Vons or Ralph’s) literally has a want ad on their online shopping page. \n\nMy guess is that supermarkets are doing extremely well right now and are also extremely short-handed - it’s probably a really good time to try to get hired. \n\n(Good luck!)",
                                                            "score": 15,
                                                            "author": "swarleyknope"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Our local Kroger in MS had a dedicated person advising people to use their wipes and he was wiping down baskets and carts. He was a young kid. Props to him and the other service workers. I just got out of the he retail industry a year ago. Counting my blessings.",
                            "score": 79,
                            "author": "theninjaamongyou",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Mine didn't have any out for customer use cause the rednecks kept stealing it. Also got to see someone have a mental breakdown cause they were. Limited to buy 3 packs of any combination of toilet paper, flushable wet wipes, or paper towels for the day. Like for fuck sacks it's a respiratory disease not one that makes you shit uncontrollably. If people really have a shit they'd stop smoking.",
                                    "score": 25,
                                    "author": "ShitSharter",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Why not an automated sanitiser pump, why expose an employee to thousands of strangers a day when there are machines that will do it for free. I guess you need someone around to stop someone stealing the sanitizer still.",
                            "score": 13,
                            "author": "CollectableRat",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "They've put someone at our local Target doing that",
                            "score": 19,
                            "author": "qalejaw"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Note to self for when I can go outside again: Trader Joe's is better then whole foods for their workers.",
            "score": 7622,
            "author": "wittbrij",
            "replies": [
                {
                    "level": 1,
                    "comment": "I work at Whole Foods. I am in self quarantine because of fever. \n\nWhen I reported my symptoms to my bosses they seemed super upset with me. HR told me I will only get paid when I prove to test positive for corona. However tests are in short supply.\n\nI don’t know what to do. Luckily I don’t have many bills.",
                    "score": 4091,
                    "author": "Darkstar197",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This sounds like classic /r/MaliciousCompliance\n\nFirst thing is I would get everything in writing from my higher ups and HR. I would ask them for directions on what to do next, and if they told me what you described then I would get one last confirmation that they “want you to get back to work (while you can), and risk infection of others because you’re financially compromised if you don’t get that paycheck.”\n\nHopefully people will catch on and will make a fuss out of it, exposing the shitty management.\n\nMay be unpopular opinion, but sadly, you have to do whatever you deem is best for you at the given moment. \n\nCan’t always take the fall for shitty managers’ decisions, and it always helps to get everything in writing once shit hits the fan...",
                            "score": 2753,
                            "author": "jlnunez89",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 1416,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I work for a casino that was still open until today. I emailed our VP of operations yesterday regarding our protocol for dealing with guests that are obviously sick and coughing. He called me because \"he didn't want to discuss over email\" and gave me some bullshit response. We're closed down for at least two weeks effective noon today.",
                                            "score": 634,
                                            "author": "RIMS_REAL_BIG",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt;He called me because \"he didn't want to discuss over email\"\n\nPisses me off when they pull that shit. I always just email them back with everything we talked about asking for confirmation.",
                                                    "score": 585,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Excellent. Passive-aggressive malicious compliance. \n\n“Hey Chief, just wanted to recap what we talked about, so I could be sure we were on the same page”\n\nLol, gottem",
                                                            "score": 397,
                                                            "author": "TheAtomicBum",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Its not even passive-aggressive or malicious compliance. Its just being honest and transparent. How far we must fallen to be where this is considered malicious",
                                                                    "score": 298,
                                                                    "author": "CHAD_J_THUNDERCOCK",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "It would be to the boss who doesn’t want to do this over email.",
                                                                            "score": 74,
                                                                            "author": "TheAtomicBum",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Yeah, and fuck that person.",
                                                                                    "score": 22,
                                                                                    "author": "Hvarfa-Bragi"
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "We have fallen into the US of fuckin A baby",
                                                                            "score": 42,
                                                                            "author": "BigbooTho",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "You do that and you get stuck in an infinite loop.\n\n\"I don't want to confirm the recap over the email, come on in to discuss\"",
                                                                    "score": 36,
                                                                    "author": "madalienmonk",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Then just say “I want in writing.”",
                                                                            "score": 29,
                                                                            "author": "king-heroin",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "\"You're fired\"\n\nYou broke the infinite loop!",
                                                                                    "score": 31,
                                                                                    "author": "madalienmonk",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "It’s fun to “correct” the policy so they have to respond too.",
                                                                    "score": 7,
                                                                    "author": "nphased"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I had a compliance training and they said it really well. Anything someone says they don't want to discuss over email is definitely something you should make them discuss over email.",
                                                            "score": 210,
                                                            "author": "__slamallama__",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "\"I'm just emailing you to thank you for your prompt phone call outlining… If I misunderstood any of that, please let me know.\"\n\n\"It was a pleasure speaking to you on the phone to discuss… Now that I understand that our company's policy is … , you can rest assured I will pass on that information from you.\"\n\nI put my name in white text with a white background on all the Word docs I submitted to my boss....  I was dropped on my head as a child, but I still have a few brain cells left.",
                                                    "score": 23,
                                                    "author": "tenzin",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Fuck, if you're in a one party consent state I would've installed a call recorder and not told them.",
                                                    "score": 43,
                                                    "author": "Kerbal634",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I'm not trying to bring anyone down. I just wanted them to do the right thing and close up shop for the time being.",
                                                            "score": 28,
                                                            "author": "RIMS_REAL_BIG",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Sometimes you need a big ol spotlight to make people do the right thing, sometimes just the threat of that spotlight is enough.",
                                                                    "score": 38,
                                                                    "author": "cheaptrainride"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Definitely this. I had a supervisor that would only discuss things in person.  Even if the discussion started with an email I sent. I eventually learned to send follow up emails referring to the face to face conversations and cc-ing my union rep!",
                                            "score": 18,
                                            "author": "pdxmhrn"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Yep. The classic “just to be clear, you’re telling me to [insert ethical thing here]? I just wanted to be sure.” It’s funny how rewording something makes people rethink.\n\nMy partner and I went to buy a house recently, and had an approved offer with some contingencies. One of the contingencies was allowing our dog, but at the last moment we were told our dog was not allowed. The selling agent said if he was a therapy dog it wouldn’t be a problem and we could get a certification online. Asking “just to be clear, are you recommending we commit medical fraud to fulfill this condition of sale?” made him back off pretty damn fast.",
                                    "score": 114,
                                    "author": "notnotaginger",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Wait. You were buying a house, and somehow you were not allowed to bring your dog. In your own house. That you bought?",
                                            "score": 82,
                                            "author": "TheWarmGun",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Oops, Condo. I should have specified. In my market everyone knows “buying a house” = condo.",
                                                    "score": 58,
                                                    "author": "notnotaginger",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Ah. Makes more sense.",
                                                            "score": 18,
                                                            "author": "TheWarmGun"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "If there has ever been a year for covering your own ass its 2020. I'd practically carry a voice recorder around on my person at all times. If it's not in writing, an email that is backed up with pictures or screen shots, or recorded you should rethink your approach right now. Shits going to get wicked in the next month. Almost all companies are going to be looking at reasons to fire workers if they get too far in the red. Protect yourself.",
                                    "score": 28,
                                    "author": "redditingatwork23",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "If they make you come back to work while sick, go straight to your management and shake their hands thanking them for letting you come back so soon.",
                                    "score": 21,
                                    "author": "AverageAlien",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Make sure your hands are wet.\n\n\"Oh, sorry! I forgot to dry my hands in the bathroom. Or wash them.\"\n#KOFF KOFF KOFFIN",
                                            "score": 10,
                                            "author": "Tinsel-Fop"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "If person one puts person two in an impossible situation in which their only survival is to hurt others, the hurting of those others is on person one, not two.",
                                    "score": 19,
                                    "author": "nosleepforthedreamer",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I got some Nuremberg trials that may disagree.",
                                            "score": 16,
                                            "author": "Hochules",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "This sounds like classic r/LateStageCapitalism",
                                    "score": 111,
                                    "author": "furry-burrito",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 82,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yep. I have a slight cough and my asthma is flaring up, but it always does that this time of year. Especially with the extremely high pollen count here in Houston. I don't know if it's normal seasonal allergies/ asthma or something more. Luckily my work lets me work from home as much as possible, but a lot of people don't have that option.",
                                    "score": 12,
                                    "author": "theeastwood",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Did you courteously remind them that no one is fucking testing anyone?",
                            "score": 204,
                            "author": "Dekklin",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yep.  I was just told a doc I assisted last month in NY tested positive.  \n\nSince that exposure I have assisted clinics in several Florida locations. Texas. Louisiana, NY, and Connecticut.\n\nI was told testing is mandatory.  But in Texas where I’m going home tomorrow.  You have to be symptomatic.  Have recently travelled. And have tested negative for the flu. Before they’ll test you. \n\nSure.  I’ve potentially exposed dozens of doctors and nurses plus all the clinic staff in a dozen clinics in several states. But I’m not coughing or running fever so I don’t qualify for a test.  \n\nAnd so without a test I can’t return to work.  Plus the clinics won’t know about exposure since... I haven’t tested positive.  \n\nBut I’m glad the actors and politicians not showing symptoms have gotten tested.   I was so worried about that sitcom getting delayed.",
                                    "score": 106,
                                    "author": "BookwyrmsRN",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "In Houston we don’t have the ability to test our first responders, they are not being prioritized and not being tested as they continue to work, being exposed and exposing countless others. \n\nWe’re almost out of personal protection for them too—less than 10 days worth left for the entire fire department/EMS.",
                                            "score": 10,
                                            "author": "TeeManyMartoonies"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Unless you're rich* \nFTFY",
                                    "score": 82,
                                    "author": "Robot_Penguins",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yep, I’m in Utah, as of a few days ago, the Utah Jazz was responsible for 58 out of like 140 something people tested in Utah.",
                                            "score": 106,
                                            "author": "TripleSecretSquirrel",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That’s because Rudy Gobert (Jazz player) was a tool and proceeded to intentionally touch everything he could at a press conference thinking corona was all a hoax. \n\nHe later texted positive for COVID-19. If I were a press agent and got it because of that I would have sued the f out of the team.",
                                                    "score": 107,
                                                    "author": "GoodOmens",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Seriously. I’m frustrated and worried I might be a borderline asymptomatic carrier. Had unusual cold sweats last night, yesterday and today I had a weird breathing feeling that follows “shortness of breath” descriptions but not very severe at all, and my throat has itched for a few days until it stopped this afternoon. I could easily just be a hypochondriac, but my idiot college roommates went out and partied at crowded bars on last Thursday and Saturday nights in my college town that has cases and I’d like to rule out the possibility that I am sick. Maybe looking way to far into it, but it’s also explain why my runs for the last 5 days (before yesterday) were getting slower despite putting in the same or more effort. \n\n\nWe’ve already established a number of people are asymptomatic. I’m hoping they ramp up test availability for people.",
                                    "score": 43,
                                    "author": "thirdAccountIForgot",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "If you’re concerned your a carrier you’re supposed to be quarantining yourself",
                                            "score": 27,
                                            "author": "somerandomguy_7788",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "That’s not true. They’re opening drive thru testing everywhere!\n\nThen quickly closing them for various reasons. I do think there’s a shortage of the tests so they’re trying to ration them to high risk and healthcare workers but don’t worry. You just have to get famous and you’re all good!",
                                    "score": 23,
                                    "author": "Imthejuggernautbitch",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Hey! That’s not true! The US has enough tests for 74/1,000,000 people!! Clearly somebody is testing anyone.",
                                    "score": 22,
                                    "author": "Just_One_Umami"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I'm sorry you're going through this. You're being responsible and trying to protect your coworkers and the public and they're penalizing you. You should publicize your story - shame them into giving you sick-leave pay.",
                            "score": 40,
                            "author": "dembowthennow"
                        },
                        {
                            "level": 2,
                            "comment": "yep, sounds like a Bezos-owned operation",
                            "score": 33,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's exactly why a lot of former employees got out of Dodge asap.",
                                    "score": 9,
                                    "author": "Trunkfullaamps"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt;  HR told me I will only get paid when I prove to test positive for corona. \n\nLet them know you're coming down to their office to talk with them about it in person and get any required paper work from them.",
                            "score": 25,
                            "author": "flargenhargen"
                        },
                        {
                            "level": 2,
                            "comment": "Are you in CA ? If you are in quarantine you qualify for short term disability.",
                            "score": 16,
                            "author": "Bayare1984",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Call the media. Seriously, it's the way to put pressure on these companies.",
                            "score": 15,
                            "author": "inthe801",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "&gt; When I reported my symptoms to my bosses they seemed super upset with me. HR told me I will only get paid when I prove to test positive for corona. However tests are in short supply\n\nask them to shake on that deal, see how they feel about that.",
                            "score": 17,
                            "author": "ridik_ulass"
                        },
                        {
                            "level": 2,
                            "comment": "You could use the dictatorship of the proletariat and seize the means of production!",
                            "score": 10,
                            "author": "JueJueBean"
                        },
                        {
                            "level": 2,
                            "comment": "Tell them that you will show up to work, but that you expect a 30 minute, closed door meeting with your manager to detail your symptoms and to discuss the current policy.  See if that changes his opinion.",
                            "score": 8,
                            "author": "snorlover"
                        },
                        {
                            "level": 2,
                            "comment": "Have you been to any huddles recently where sales are discussed? I would love to know what percentage YOY you're seeing right now (ex WFM myself)",
                            "score": 8,
                            "author": "tomios010",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I check sales every day in my role.  Our average on a weekday is 125k. We’re doing 450k on weekdays and 550k on weekends.",
                                    "score": 25,
                                    "author": "Darkstar197",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Wait your average *daily sales* are 125k? At Whole Foods? That's impressive in its own right.  And HO LY SHIT that's even more than I expected. \n\nRIP next years comparative numbers though.",
                                            "score": 19,
                                            "author": "tomios010",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah I’m at one of the busier stores in the company. Always understaffed. Very stressful, now when we are in a pandemic they expect some loyalty from me.",
                                                    "score": 16,
                                                    "author": "Darkstar197",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "My busy costco location does about 1 mil a day, for comparison.",
                                                    "score": 8,
                                                    "author": "Hinastorm",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I used to work for whole\nFoods as well and called out sick because of intense back pain and flu symptoms. They wanted me to come to work even though I handled raw seafood. They ended up firing me because I could provide a doctors note. But they wouldn’t provide me insurance to go see a doctor. So ass backwards. Fuck that company.",
                            "score": 8,
                            "author": "Andrewmo808"
                        },
                        {
                            "level": 2,
                            "comment": "Just go to work!\n\nWhat's the worst that could happen, infect your boss?",
                            "score": 13,
                            "author": "Dark_Tsar_Chasm",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'd be so happy to see my boss I'd probably spend ten minutes giving him a bro-hug.",
                                    "score": 11,
                                    "author": "I_make_things",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Maybe even go Italian style with a big kiss on each cheek!",
                                            "score": 8,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You should tweet about this tagging them. Hopefully it would blow. This is no way a store giant should behave like that at this time. They are not even affected by quarantine. Absolutely disgusting 😠",
                            "score": 5,
                            "author": "Rut3103"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "As a TJs employee, I can tell you this company is amazing in what they do for us. I took the last two days off with a cold, and they paid me to stay home and keep everyone safe. This is what they do, I'm glad people get to know how awesome this company is.",
                    "score": 122,
                    "author": "KozmoKibble",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s normal for a.... German company. I’m happy to see Aldi and Lidl treating their employees decent around the globe.",
                            "score": 70,
                            "author": "HimikoHime",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "German owned but all Trader Joe's corporate management is US based.",
                                    "score": 25,
                                    "author": "darshfloxington",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "I live in the US and just got hired by Aldi and I am pumped. They need all the help they can get right now and offered me a full time position starting at $13.50 an hour (which is almost twice the minimum wage in my state). They also offer health insurance, dental, vision, paid time off, vacation days, basically more than I’ve ever gotten anywhere else. They also are offering 2 weeks off, paid, if you think you’re infected and don’t want to come in. \n\nI’m looking forward to finally working for a company that doesn’t treat people like shit.",
                                    "score": 13,
                                    "author": "Axisnegative",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That sounds great. Even though Aldi/Lidl is seen more low tier supermarket here they pay pretty decent as far as I can compare. May I ask how many days off you get? And do you have extra sick days? Working full time, minimum vacation days in Germany are 24, most have 27-30 days. When you’re sick (with doctors notice of course) you get up to 6 weeks full pay, after that health insurance will keep paying 60%.",
                                            "score": 7,
                                            "author": "HimikoHime",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "have an uncle that has worked at trader Joe's for the last four years.\nhe literally loves it. never shuts up about how good the benefits are. i think they get a raise every 90 days. paid time off, disability, etc.\n\nhe just went back Monday after being off two months for a hand surgery. \n\nedit - he was on paid leave for two months, I should add!",
                    "score": 180,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "We get a raise every 6 months. It used to be every 90 days years ago. Still it’s really nice. I went 4 years without a raise at my last job. Tell you uncle hi for me from store #166!",
                            "score": 76,
                            "author": "Gabs7901",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "#736 checking in!",
                                    "score": 38,
                                    "author": "Magus_Incognito",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Today I learned that if you put a pound sign at the start of your post you get big obnoxious letters!",
                                            "score": 74,
                                            "author": "Magus_Incognito",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Put a backslash before the # (or any other character that causes a text modifier) to cancel the effect of it. That would let you do\n\n\\#736 checking in!",
                                                    "score": 8,
                                                    "author": "PokecheckHozu",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I've been avoiding Trader Joe's because there's an hour long line to get in and they don't deliver. \n\nOnce the panic-buying stops, I'm definitely going back. \n\nFunny how Trader Joe's and Costco both treat their employees like human beings and are two of the best grocery stores around.",
                            "score": 44,
                            "author": "HamburgerEarmuff",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They both have incredibly loyal customers for that reason though. Treat employees well makes shopping there a nice experience this repeat customers. Trader Joe’s employees are also helpful at knowing all the products they sell. Costco is just more about efficiency and value but similarly their employees are knowledgeable and efficient. Can’t same the same thing about places like Wally World.",
                                    "score": 18,
                                    "author": "thelaziest998"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "That makes me really happy, I genuinely like talking to the people who work there at check out. They always seem so chipper and happy to be there.",
                            "score": 9,
                            "author": "thekamenman"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I work at a bank. ******. 80% of our branches are going drive through only. 20% will remain full service with the lobby open. We will be getting something like “hazard pay” because our branch is among the 20% staying open. \n\nThey also gave everyone 10 extra sick days if they are affected by the virus or quarantine. They will pay 10 days of day care coverage if your day care closes too. \n\nMy peers in other banks are barely getting Clorox wipes. \n\nConsider where you bank folks",
                    "score": 48,
                    "author": "WWDubz",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Our CEO graciously informed us to feel free and go negative the total 80hrs of accrued PTO that we are allowed to go negative on if we get sick and need to self-quarantine but dont have the PTO for it.",
                            "score": 13,
                            "author": "AKA_A_Gift_For_Now",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I have two banks, one doesn't have any physical branches, and the other I have never set foot in one nor would I ever have any need to .",
                            "score": 6,
                            "author": "buildallthethings",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Whole Foods is giving their employees $2/hr differential pay for all hours worked through April. Unlimited overtime. Specialized hours to allow them to shop stocked shelves. 2 weeks paid if the employee needs to be quarantined. Attendance policy is being waived for the month of March and no terminations will happen due to attendance during that time too. \n\nIs it a bonus? Nope. Is it something? Yes.",
                    "score": 119,
                    "author": "sosqueee",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I work there, i can safely say its less than we deserve but more than i expected.",
                            "score": 82,
                            "author": "Shrekquille_Oneal",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I work there too. Well said.",
                                    "score": 14,
                                    "author": "JayYesBe"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "REI is paying my part time worker friend during their shutdown. There are good corporations out their.",
                    "score": 17,
                    "author": "GoodOmens",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I've honestly never been to a whole foods. Trader Joe's is amazing. Their food is good and their employees dont have the mercy kill me look.",
                    "score": 15,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Whole Foods is also implementing 2/hr retro to last week in addition to as much OT you can handle till the end of April. They’re not the best but they are offering up “some” hazard pay",
                    "score": 14,
                    "author": "kaiser_soze_72"
                },
                {
                    "level": 1,
                    "comment": "I just wanted to mention in the top comment, because I see so much false info here.\n\nI work at Whole Foods and have for 11 years. We only Monday got any info on the ongoing issue. Every single employee is getting a 2 dollar raise during these hard times  until at least the end of April. All employees are allowed any sick time they need, without it effecting their job status, and anyone who contracts the virus is due their usual pay plus two addition weeks pay. No one is being over worked, and no one is being punished for calling out.\n\nWhole Foods is a company that has given me so much, I've been trained to be an effective leader, I have learned so many skills and things I'll take with me everyone I go in life. I have amazing insurance and amazing pay that afforded me to start a family. Whole foods is an easy company to pick on, but I'll tell you what I'd rather work here than any other grocery store in the US, and in the small town I live in there is no other options that pay and treat their employees with as much respect as they do here.\n\nObviously every store is different, I've worked at some locations with bad leadership, but stories like this always just feel so exaggerated. There are so many levels of leadership and ways to go around a situation like this. If your management is truly acting the way listed here in the comments, you should have approached your store team leaders, or HR group, or any of the many anonymous lines the company offers for mistreatment like this.",
                    "score": 68,
                    "author": "CXXXS",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "As a former shifty 👍",
                            "score": 14,
                            "author": "crazycatchdude"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Trader Joe’s: our stores are not constantly on fire.",
                    "score": 11,
                    "author": "pac-men",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Fyi whole foods temporarily bumped everybody up $2 an hour this morning as their form of hazard pay. \n\nBut like someone else mentioned below HR isnt handling sick days very well. Even when somebody got strep throat and brought in a doctors note, our HR told them it doesnt excuse their absence.\n\nEdit: Overtime is now double pay instead of time and a half, at least for a month.",
                    "score": 11,
                    "author": "BureaucratDog",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I still find that statement hilarious. “Please share your vacation time with people who need it more” says the billionaire who runs a “liberal” grocery store.",
                    "score": 30,
                    "author": "Eyy_Dooga",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Trader Joe's already pays its people more than any other grocer.",
            "score": 492,
            "author": "Itdidnt_trickle_down",
            "replies": [
                {
                    "level": 1,
                    "comment": "Is this true in comparison to Costco? Genuinely curious.",
                    "score": 71,
                    "author": "chainmailexpert",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "With no job experience at all as a college student I started at 15 an hour, well above minimum wage, and we get two possible raises every year.",
                            "score": 139,
                            "author": "meopelle",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Damn. I make 14.25 as a 911 EMT in so cal and don’t really have opportunities for raises but I’m glad some companies are paying their employees well and I hope others follow suit.",
                                    "score": 53,
                                    "author": "Immortalmarble",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You're the one we call for help when grandma has a seizure or a baby is choking or 10,000 other nightmare scenarios and you're only getting $14? That's unfair and wrong.",
                                            "score": 19,
                                            "author": "PercivalGoldstone",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Paramedics at my company start at 20/hr after spending 10-15k and 1.5years at medic school :(",
                                                    "score": 10,
                                                    "author": "ThatSmallAsianBoy"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It’s not true. Most Trader Joe’s employees I know start at 11 or 12 an hour. Regular reviews every 6 months with the option of a raise. I’m currently at 13.",
                            "score": 37,
                            "author": "sixdollargrapes",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It varies state to state. Depending on the cost of living. Washington, California and I believe New York start at $15/hr.\nI work at at TJs in Washington.",
                                    "score": 33,
                                    "author": "redlateralus",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Trader Joe's has always been one of the most worker-friendly chains I've experienced. I knew multiple people who work there, and they said it was great. I'm sure there are some bad cases, but this seems par for the course for them.",
            "score": 1919,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "A friend of mine worked at Stop &amp; Shop for about 5 years throughout high school and college. She was making just over $8/hour (near minimum wage at the time). She applied to Trader Joe's, and they asked in the interview how much Stop &amp; Shop paid her. She told them, and then they genuinely asked \"Is $13/hour okay?\". She was so happy.",
                    "score": 120,
                    "author": "LazerBarracuda",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Damn, a five buck an hour increase, is it okay? Hmm let me think haha.",
                            "score": 38,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "And meanwhile Whole Foods is asking their employees to donate their sick time to one another. During a pandemic. Fuck Whole Foods.",
                    "score": 824,
                    "author": "sross43",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What do you expect.... It's owned by Amazon",
                            "score": 384,
                            "author": "CanIGetAPaycheckBuff",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The CEO of Whole Foods has always been insane, even before they were bought by Amazon.",
                                    "score": 208,
                                    "author": "Vaeku",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Can confirm. Worked there thru college before the merger. John Mackey is as big a piece of shit as Bezos. They had these sham \"elections\" where you would vote on which of your benefits would be cut. They worded it in a way to say you were deciding what was important to you, but every year the options they gave you were worse than the year prior. It was atrocious.",
                                            "score": 20,
                                            "author": "raiderkev",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "No surprise they got into business together",
                                            "score": 45,
                                            "author": "meep_meep_creep"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "The sharing policy predates Amazon. Amazon didn’t change it but it’s existed for decades.",
                                    "score": 76,
                                    "author": "protronic",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "My housemate works at whole foods. They had a bad start, but they seem to be fixing their innital response. They all got an immediate $2hr raise and we're told they're covering any missed time. I don't know if this is everywhere, we're in the bay area under stay in place orders.",
                            "score": 105,
                            "author": "nvrmndtheruins",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Because of bad press. Don’t give them shit, they don’t deserve any praise. They and all companies like them only do that as a PR move.",
                                    "score": 113,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "And Kroger is asking its warehouse employees to work 18 hour shifts every single night",
                            "score": 12,
                            "author": "RoundysPicker",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Worked there for 3 years while I finished college. Made some life long friends (and married one of them!). I'm in accounting now and apply for open positions in the corp offices whenever they come up. No luck yet but some day. \n\nIf they offered me a Captain position I'd quit my job tomorrow. It was a really great company to work for.",
                    "score": 19,
                    "author": "BaffleTheRaffle",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Costco deserves an honorable mention",
                    "score": 41,
                    "author": "su5",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Costco is doing nothing. There is an alarming lack of response from corporate other than what feels like the minimum. Workers are not getting paid extra, there is nothing being done to increase social distancing from employees to members. The only thing they have offered employees is UNPAID leave, and that's only for a maximum of 4 weeks.\n\nCostco is treating its employees like shit right now.",
                            "score": 58,
                            "author": "BledsoeForMVP",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yup! As a Costco employee, they’re seeing some of their best days, if not THE VERY BEST days in sales and we receive none of the fruit of it. \n\nThey’re not increasing any precautions, gloves aren’t mandatory, they don’t have hand sanitizer available for members, nor are they giving any more paid sick time other than the one you’ve earned prior to all of this.\n\nFortunately many employees have paid sick time stocked up because of the strongest time off policies but they’re asking us to work much more and we’re some of the most vulnerable to all of this happening. \n\nCostco is applauded as a company who takes great care of their employees because they pay slightly above minimum wage (unless you’re in the Bay Area, this isn’t true) but they overwork and over push their employees beyond reasonable expectations.\n\nPlease be nice to us lowly employees during this trying times. And in general. Thank you!\n\nEdit: correcting some missed words",
                                    "score": 78,
                                    "author": "chainmailexpert",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "This is what happens when u get a new ceo and it's all about spreadsheet not humans also costco gave everyone a small raise so it needs to grab it from somewhere and it decided payment would be in blood and sweat.",
                                            "score": 18,
                                            "author": "yoshix003",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "One hundred percent this. As soon as the new CEO stepped in, all of the benefits to workers went down and restrictions went up. That’s why there’s such a high turnover rate now compared to the culture of the past. \n\nTrader Joe’s continues to be a great company (as far as I’m aware) and that’s why I’ve seen previous Costco employees make the change to TJ’s.",
                                                    "score": 7,
                                                    "author": "chainmailexpert",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "You guys are herding cattle in there!  I appreciate what you're doing for the general public!",
                                            "score": 6,
                                            "author": "vinnyj",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Shopping at Trader Joe's today, the staff gave me a bouquet of flowers because they saw my RN work badge. I love TJ's and the staff!",
            "score": 1026,
            "author": "thefourthsolo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Also that was probably the only thing they had left. \n\nI went in yesterday and it was completely ransacked aside from tiramisu and those Greek cheese pastry wheels.",
                    "score": 135,
                    "author": "Imthejuggernautbitch",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;\taside from tiramisu and those Greek cheese pastry wheels.\n\nI guess people don’t like DELICIOUS THINGS",
                            "score": 219,
                            "author": "seimc",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "For real. I’ll quarantine binge some motherfucking tiramisu.",
                                    "score": 63,
                                    "author": "lecorbeauLC",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "And the packaging can double as toilet paper!",
                                            "score": 14,
                                            "author": "seimc"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thank you for what you do. My sis is a RN too. Good luck to you all.",
                    "score": 48,
                    "author": "WakingRage",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "We are getting pallets of flowers because we can donate them in store but not at the warehouses.",
                    "score": 19,
                    "author": "TheRyverMan",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I worked grocery retail for a while - I would LOVE to see weekly sales reports and a YOY comparison. It's gotta be insane.\n\nEDIT: Wow I was speaking more hypothetically at first but these reports are great! Keep me coming. Super interesting.",
            "score": 231,
            "author": "tomios010",
            "replies": [
                {
                    "level": 1,
                    "comment": "We were up 142% one day alone. We did 20k in sales in one hour yesterday from 9-10am. It’s been insane. We’re pulling numbers higher than holidays but with less product. My store looks like it got robbed.",
                    "score": 230,
                    "author": "Gabs7901",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That is bananas.",
                            "score": 60,
                            "author": "tomios010",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If we even have any lol 😝",
                                    "score": 144,
                                    "author": "Gabs7901",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "P4011",
                                    "score": 10,
                                    "author": "morethanmacaroni",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "My store did $496 THOUSAND dollars last Friday alone. A standard Friday is between $180k and $200k...",
                            "score": 54,
                            "author": "whatdoineedaname4",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I just can't even fathom what those numbers feel like in the store. The stores just aren't equipped to handle that sort of volume in any way. Hats off to you and your teams.",
                                    "score": 28,
                                    "author": "tomios010",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Great team, only reason we survived it. We hold up well top about $250k. That's where we start to see areas getting torn up. Sales floor is equipped but no company ever planned a back room to be functional to volume",
                                            "score": 14,
                                            "author": "whatdoineedaname4",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Mine was up by 140% as well. The last thing to go was the cereal aisle- which ironically can be consumed without milk (very snackable) and lasts for years, great source of vitamins despite lots of sugar and calories/carbs. It's just a great apocalypse food.",
                            "score": 21,
                            "author": "wheresmystache3",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My warehouse did two million dollar days in a row.  We doubled our sales projections and were absolutely slammed. Those numbers are normally reserved for snow scares or major holiday deadlines.",
                    "score": 27,
                    "author": "I_am_enough",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "My store was up over %100 from last years sales, last Thursday Friday and Saturday. I work in one of the larger grocery chains, but as of now sales are sort normalizing since we haven't gotten fully stocked up yet.",
                    "score": 39,
                    "author": "DefinitelyNotSloth",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Damn 100% is no joke. I do wonder how long it can be sustained. Thanks for putting in the hard work though you're on the front lines and I know how taxing it must be.",
                            "score": 21,
                            "author": "tomios010",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The mad rush is over from what we can see, Friday was just a perfect storm of events that caused the panic. As much as it sucks to have gone through it, I am fortunate to know my income source will remain open.",
                                    "score": 14,
                                    "author": "DefinitelyNotSloth",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "My store broke 1m in a single sales day for the first time ever for our location...",
                                    "score": 25,
                                    "author": "sinstralpride"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "In my department sales are literally double what they normally would be.",
                    "score": 11,
                    "author": "Bassmaster_General"
                },
                {
                    "level": 1,
                    "comment": "On Thursday, the store I work at was up 232% in the fresh meat department.",
                    "score": 7,
                    "author": "PNHeGzvrqy",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Last week our store did triple its usual amount.",
                    "score": 7,
                    "author": "Videoboysayscube"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I work at frys and we got a 25 dollar store credit to buy food we don’t even have as thanks for killing ourselves with a skeleton crew all week. Yaaaaaay\n\n\n\nEdit: seeing kroger treat everyone else like shit too somehow is both uplifting AND depressing. \nAt least it isnt just me.  I mean *we ARE a family after all.*",
            "score": 183,
            "author": "Ionsife",
            "replies": [
                {
                    "level": 1,
                    "comment": "I work at Publix. Our corporate overlords sent out an email to all the store managers that no associates were allowed to wear any masks or gloves because it might scare customers.\n\nAnd we had some chips and soda in the break room, thanks that really makes up for having customers bust my balls for being out of chicken and ground beef and doing 3x as much business as normal.",
                    "score": 93,
                    "author": "AntiSqueaker",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "We had the same request, and some other weird measures as well, like our indoor starbucks  covered the glass around their counter with black paper because a customer complained about handwashing frequency yesterday,now you just cant see.  Seems entirely ethical.",
                            "score": 32,
                            "author": "Ionsife",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "As a customer, it would make me feel better if I saw grocery store employees wearing masks and gloves. I had to shop for food yesterday, and I was worried for the people I saw working there. I would feel so much less guilty if I saw y’all actively protecting yourselves. This is insane.",
                            "score": 23,
                            "author": "Windystar",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Me too, fuck Kroger.",
                    "score": 15,
                    "author": "mommysoscarry",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Hey, we work at frys too!! Yay 25 dollars. I'm surprised we got anything at all with all the people that was let go last year",
                    "score": 7,
                    "author": "Punkskunk927",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Used to work at Fry’s... good for you for going down with the ship! Lol jk... prepare your resume if you haven’t already",
                    "score": 7,
                    "author": "samaelsayswhat",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I live in walking distance to a whole foods and a trader Joe's.\n\nI'll remember this.",
            "score": 180,
            "author": "Bac0nLegs",
            "replies": [
                {
                    "level": 1,
                    "comment": "Plus, it’s cheaper to shop at Trader Joe’s and I find most of their items are usually solid in terms of quality. \n\nI only go to Whole Foods now for their slice of pizza or their hot food bar. Maybe an occasional Oatly milk.",
                    "score": 57,
                    "author": "ajokester",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If the trader joes line is too long, I'll go to Whole Foods in a pinch but I find that I get so much more for WAY less money at TJs so I'll always prioritize TJs. I like their snacks more, too.",
                            "score": 21,
                            "author": "Bac0nLegs",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I fucking love TJs. I can buy 3+ days worth of groceries for 2 and come out $50-60 every time. I buy 5-6 things at Whole Foods and I’m already at this amount. TJs for LIFE",
            "score": 126,
            "author": "samb811",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes dude TJ’s is the best.",
                    "score": 26,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My local Trader’s was offering Hand Sanitizer squirts at the entrance and at the exit :,). They had two employees do that all day, just standing there and making sure people don’t get sick. I was pretty taken aback, but in a pleasant way! \n\nTJ’s will always be the GOAT.",
            "score": 53,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Good.  they fucking deserve it.  It's been hell",
            "score": 89,
            "author": "mlc2475",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 39,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 23,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wish I had a Trader Joe's close to me, my zip code cannot support such a wonderful store!",
            "score": 32,
            "author": "eskiedog",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Our little bit of tragedy has turned into a bit of a blessing in this shit storm. My wife had an accident in work that wasn't her fault two weeks ago.\n She broke her foot so she is on full wages for the next 5 weeks. Her job is safe because she works in food retail and it's an essential business. Still glad she out now because Ireland is in high risk mode.\n Thanks assholes that went to the races at Cheltenham in England and the Italian's that came to Ireland because they had flights paid for a match that was cancelled anyway.\n I'm a goldsmith. That's about as non essential as you can get right now, so I'm out of work. My boss has stepped up. He will pay me what the social welfare would give me if I was actually unemployed and can claim that back off the government till we get some semblance of normality back and start working again. It's not a lot but, it will cover the mortgage and we have her wages to cover everything else.\n Our banks are stepping up too. I can get a 3 month mortgage deferral without penalties if I need it and can pay just the interest after that if things are still down the toilet.\n I really feel for you guys in the US. From what I can see, you have everything stacked against you at the best of times and don't have a social welfare system to help that seems to care about the average Joe. \n Stay safe guys and do your best to take care of each other.\n\nEDIT: Did format for easier reading but my phone ignored it. Sorry",
            "score": 151,
            "author": "AnyDamnThingWillDo",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s awesome of your boss. I’m curious what happens to me in the near future as I was self-employed for 3 years before about two months ago and so I wouldn’t qualify for EI in Canada. I’m in construction so if I get word my site is shut down, no idea what happens. I don’t know how the government plans to handle small business owners/people in my situation.",
                    "score": 14,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is how we keep our shit together. People who work in this industry need to be compensated to make sure they keep coming to work.",
            "score": 12,
            "author": "Red-eleven"
        },
        {
            "level": 0,
            "comment": "I'm a Grocery Store worker and sales have been up around 150% 😬",
            "score": 13,
            "author": "Zorn277"
        },
        {
            "level": 0,
            "comment": "Trader Joe's is owned by Aldi, a European brand.  They're much better about worker rights than your average American company.  Aldi even lets workers sit at the register, unheard of in America but common for Europe.",
            "score": 20,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Trader Joe’s. Always.  ALWAYS a class act. 👏🏿👏🏿👏🏿",
            "score": 17,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Fuck Whole Foods / Amazon",
            "score": 42,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "But what if I need some $9 asparagus water?",
                    "score": 18,
                    "author": "Imthejuggernautbitch",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "But yet I just searched for jobs in my area on their site and they are not hiring in my state. One would think that they might hire extra help to ease a bit of the burden on their current employees, but that does not seem to be the case so far from my perspective.  I wish they were hiring, I need a job. I’m a bartender that has been “laid off” and I am sooo bored.",
            "score": 69,
            "author": "Tiffany_Pratchett",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sorry man.  I read that Amazon was hiring 100k to help with increase of demand.  Maybe try them in your area?",
                    "score": 76,
                    "author": "Crohnies",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you.",
                            "score": 26,
                            "author": "Tiffany_Pratchett",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Don't go work for Amazon, if you can help it. I worked there for 4 years, did a little time in management and quit last month. It was truly a depressing and bad time",
                                    "score": 25,
                                    "author": "MissTwatney",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "People working most entry level jobs can't help it and take what they can get. Amazon warehouse is top of that list next to Walmart associate.",
                                            "score": 8,
                                            "author": "Critonurmom",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My girlfriend and I are in the same boat. I still have my day job for the moment, but as for the bar we are unemployed until further notice.  Hopefully it opens back up once this is over, but as the owner has like 4 restaurants closing down they may go out of business. Shit times to enjoy marking drinks for people",
                    "score": 18,
                    "author": "snowman93",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Seriously look into applying at an Aldi warehouse for temporary work. They need it, and they’re a good company to work for, it’s the other brother in Trader Joe’s.  Even restocking in Aldi stores is in high demand. Store or warehouse, can’t hurt to try.",
                            "score": 10,
                            "author": "LadyBuxton",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Check with Costco. Saw a post where they are looking for help right now.",
                    "score": 13,
                    "author": "Duffmanlager"
                },
                {
                    "level": 1,
                    "comment": "same\n\nbut more broke than bored tbh",
                    "score": 8,
                    "author": "esterator"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Go check out /r/tjcrew to see how actual Trader Joe's workers feel about it.",
            "score": 14,
            "author": "TheArchaeologist",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This is how you're supposed to run a business",
            "score": 5,
            "author": "Haxertommy"
        }
    ]
}