{
    "id": "m2t781",
    "score": 65885,
    "title": "Jeffrey Epstein mansion sells for $51m with abused women to receive the money",
    "author": "[deleted]",
    "date": 1615477625.0,
    "url": "https://www.reddit.com/r/UpliftingNews/comments/m2t781",
    "media_urls": [
        "https://www.independent.co.uk/news/world/americas/jeffrey-epstein-mansion-price-sale-b1815846.html"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "This subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nNegative comments will be removed and will possibly result in a ban.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Some actual good news coming from the terrible events. \n\nI'm sure theres more where that came from. The man was filthy rich probably from all his stealing and blackmailing. Hopefully the survivors feel a little semblance of healing even though this isn't nearly close to the full justice they deserve.\n\nEdit: Also to add, to all people who worked with him and paid him. They need their court dates in hell. Probably worth billions combined. Would be nice if the victims could take from them as well.",
            "score": 4256,
            "author": "DesignatedJiver",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hopefully there is some action taken towards preventing stuff like this from happening in the future. It's good to hear that there is some healing, but money only goes so far and it would obviously be best if we made sure that there wasn't harm in the first place.\n\nI think getting corporate money out of politics is a good first step. Obviously easier said than done, but nevertheless I think it's a necessary step towards a lot of progress.\n\n[Here's a dashboard](https://www.quiverquant.com/lobbyingsearch/) I've been building tracking corporate lobbying, if anyone is interested. Sorry if you've seen it already, I think it's important data on an important issue and I've been trying to get as many eyes on it as possible.",
                    "score": 963,
                    "author": "pdwp90",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 290,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ghislaine Maxwell is still alive.\n\nWhy isn't she being treated as harshly as Epstein? She helped him with all of this. Where are the asnwers?",
                                    "score": 283,
                                    "author": "PUBLICLY-SHARED-ACC",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I read a filing that Maxwell's brother filed yesterday stating that she is in a 6.5' by 9' cell and that she has 10 cameras and 4 guards watching her every move. The filing stated that she couldn't sleep because the guards would shine a light into her room every 15 mins all night. He stated that she is to the point that she doesn't have mental capacity to defend herself. It was a pretty comforting read to know that she wasn't in Martha Stewart prison.",
                                            "score": 65,
                                            "author": "pulpandlumber",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I really hope any of that is even remotely true, because she deserves all of that and so much more.\n\nI wouldn't be surprised to find out her brother is lying for her, he seems to be defending her and claiming she's innocent, which is a huge red flag. What a family of fucking creeps, Jeez.\n\nI really hope the thing about her cell, and her being minitored closely is true. Hearing a judge say \"No one likes Prison, But she can still prepare just fine from there, she will remain where she is now\". - was nice..\n\nJust can't help but feel like this is all a show sometimes. How do we know she's not just in a mansion somewhere? Look at the influence these people had.\n\nI want to believe that there will be Justice, but my gut is telling me to trust no one around Ghislaine Maxwell.",
                                                    "score": 29,
                                                    "author": "PUBLICLY-SHARED-ACC",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I really hope it’s not true. Rights are for everyone. That’s why they’re called rights.",
                                                            "score": 11,
                                                            "author": "tickingboxes",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "There’s actually a good chance Ghislaine ran the show. Epstein was given the heat as the fall guy but she’s the one linked up.",
                                            "score": 220,
                                            "author": "MaKeWoN",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I also get this impression, based on not only evidence, but just the way they behaved.\n\nI think Ghislaine was the ringleader too, which makes it all the more weirder that she's been in custody all this time, and the public hasn't heard word 1 about any of this. Wtf is that about?!",
                                                    "score": 183,
                                                    "author": "PUBLICLY-SHARED-ACC",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "The investigation and questioning of Maxwell is still going on. This is probably something the public won't hear about for years",
                                                            "score": 66,
                                                            "author": "LimeMime565",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "The case implicates so many high level people through out the world, I doubt it's ever gonna be really investigated properly.",
                                                                    "score": 20,
                                                                    "author": "[deleted]"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "If at all.",
                                                                    "score": 23,
                                                                    "author": "scorchcore"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I thought that Bill Clinton’s ex-body man turned state’s witness against Maxwell",
                                                            "score": 35,
                                                            "author": "Stonem1989",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "https://imgur.com/a/voicq7w\n\nI don't think that turned up anything. Probably a misdirection, red herring, or someone who had good intentions but didn't, or couldn't  follow through. Wouldn't be surprised if he was threatened to keep quiet. Look who Ghislaine hangs with.",
                                                                    "score": 15,
                                                                    "author": "PUBLICLY-SHARED-ACC",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[deleted]",
                                                                            "score": 15,
                                                                            "author": "[deleted]",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "I couldn't agree more. They should all be forced to sit through extensive questioning and searches. So many politicians and actors that were well known friends of him, why aren't they being talked to at all?\n\nThis shit makes me sick.",
                                                                                    "score": 9,
                                                                                    "author": "PUBLICLY-SHARED-ACC",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I saw that but the original organization that’s broke that story retracted it, so not sure if something bigger is at play or it was fake.",
                                                                    "score": 27,
                                                                    "author": "Jezza_18",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "What? Her arrest and incarceration was literally all over the news and reddit for weeks...",
                                                            "score": 21,
                                                            "author": "RushXAnthem",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "When is the last time you heard someone talk about Ghislaine Maxwell before seeing this thread?",
                                                                    "score": 24,
                                                                    "author": "PUBLICLY-SHARED-ACC",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "The other day when her lawyer and brother once again asked her to be placed under house arrest rather than solitary confinement. Judge keeps saying no.\n\nFrom yesterday\n[(https://www.knoe.com/2021/03/10/ghislaine-maxwell-jail-conditions-degrading-says-brother/)]",
                                                                            "score": 42,
                                                                            "author": "props_to_yo_pops",
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Probably the last time her appeal was denied, when details on her implications with epstein and her toke were discussed, or when her suicide watch conditions were discussed. She was arrested last year, and it was all over at the time. If there hadn't been any major developments why should people still be reporting on it? I'm not really understanding the issue you are having with this.",
                                                                            "score": 9,
                                                                            "author": "RushXAnthem",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Ghislaine was the procurer, but Epstein absolutely was sexually abusing underage women and pimping them out to other powerful men to blackmail them.",
                                                    "score": 32,
                                                    "author": "Kraz_I",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "She also raped some victims under the guise of teaching them. She is not innocent in any way. She committed all the same crimes.",
                                                            "score": 12,
                                                            "author": "Daddyssillypuppy"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 20,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Never forget Epstein and Trump's Attorney General Bill Barr go back over 40 years.  \n  \nBill Barr's dad, Donald Barr, was headmaster of a school in New York and hired a young Epstien as a teacher - even though he was completely unqualified. Donald Barr was a perv and even published a fantasy book about teen sex slavery.  \n  \nBill Barr basically 'grew up' professionally with Epstein, and legally represented him. Epstien trafficked kids to Donald and Bill Barr. Epstein was the connection between Barr and Trump - and scads of high-level GOP persons.  \n  \nThe Republican party is rife with pedophiles who patronized Epstein and Maxwell - which is why Trump's Labor Secretary pardoned him of all charges when US Attorney in Florida.  \n  \nI hope Merrick Garland re-opens the Epstien/Maxwell case and does a full court press into the Barr/Trump/Acosta conspiracy which pretty obviously included the murder of Epstein in custody. It stinks to high heaven.  \n  \nThere are sitting Republican Senators and Representatives that serially raped kids furnished by Epstien and Maxwell and that Kompromat - to which Russia is a party - is a national security risk that represents a clear and present danger to the United States.   \n  \nNot to mention the thousands of women and kids raped in ICE custody and the hundreds of children stripped from parents that have been 'lost' (i.e., trafficked) during the Trump/Barr administration.",
                                                    "score": 41,
                                                    "author": "SCP-173-Keter",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "This shit is past being one side or the other as all those involved should be called out, publicly shamed, and justice dealt with rather swiftly regardless of political affiliation and whatever team you prefer them to be on. Be it left, right, center, etc. doesn't make a shit. These fucks are on all sides, including whichever one you choose to subscribe to. If you can't point out that fact and only defer to your side and whatever you have been led to believe, you should rethink your decisions before spewing this one sided bullshit that you're obviously blinded by or have convinced yourself of. Any piece of shit, even those you choose to be on the side of, that's caught up in this, should go down. Basing your thoughts and decisions around which side of the aisle you're on doesn't make you any better than those that you speak out against, as even those at the top who you think are on your side and are trying to convince you, are all mostly cut from the cloth and don't give fuck about any one of us below them. This shit isn't some game where one side wins and the other loses. If it were, it's us the people, who may not all agree with each other, that have lost before the game even started. The reality is that these people view the world and us differently than the views we all have. The only \"team\" that anyone should be on, regardless of beliefs, is the team that can put differences aside and stand together against shit like this, or anything for that matter, that goes against the very fabric of our society. The ones you seem to put trust in are the same ones that are able to get away with this shit because of the naivete of the people that put that trust into them. It's not them who struggle with life in the same way you or I do. It's not them who suffer the consequences of whatever actions that have been put forth by them and are out of our control, much less if a crime was committed. They are not like you and me, and although we may have differences, we have more in common than you may think. Remember, there's more us than them. The sooner you realize that, the better off you'll be.",
                                                            "score": 16,
                                                            "author": "Un_Registered",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Paragraphs, my man...   But yes.  Thank you for saying this.  It was obviously not just one side of the political spectrum here.",
                                                                    "score": 15,
                                                                    "author": "Nikkolios",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Because they run the planet. You can't get in trouble when you have all the power. It's the way it's always been.",
                                            "score": 19,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 36,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 37,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "As a person who works in a jail.... \n\nI hate to say, everything you listed here happens *routinely*.\n\nJailers are overworked, understaffed, and ignored when problems are reported.\n\n Inmates are added onto 30 minute suicide watch for extremely minor incidences (Saying something like \"I'm going to kill myself if we have to watch the same movie for the third time this week!\") and end up staying on suicide watch for months because medical staff don't clear them. This leads to alarm fatigue where officers end up too lazy to perform every 30 minute check because many inmates don't need them.\n\nJail Administrators pile on a huge amount of responsibility onto jail staff that they know is unattainable to cover their own ass that way when incidences like this happen, they can say \"See! It's the officer's fault this didn't get done!\" - so they have someone to throw under the buss.\n\nIt's very easy for a \"No isolation\" flag to be overlooked when you are moving hundreds of inmates around a day, and many inmates have 10+ notes on their file. \n\nWorking the night shift, I've come across officers that have fallen asleep at their station a few times, especially if it's 2 in the morning and there is nothing to do but cell checks. I always wake them up and report the incident if it happens multiple times, but nothing is done.\n\nI'm not saying this is okay, or should be condoned - I'm just saying it's a fact of working in corrections. What you guys see as blatant conspiracy, I see as the status quo.\n\nIf you want this to change, petition for more transparency and higher wages for corrections staff - *and campaign to reduce prison overpopulation*",
                                                    "score": 65,
                                                    "author": "GFrohman",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 58,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Yeah, and I've been to units with well known serial killers housed in them. I didn't pay them any more attention than any other inmate because they were \"Celebrities\". \n\nThey were treated - and given as much attention - as all the others.",
                                                                    "score": 18,
                                                                    "author": "GFrohman",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "If I recall correctly one of the guards was working their third shift and the other guard wasn't even normally a guard and was working their second shift. People act like its some grand conspiracy that these people did a shit job.",
                                                            "score": 6,
                                                            "author": "randomaccount178"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt;petition for more transparency and higher wages for corrections staff - and campaign to reduce prison overpopulation\n\nPetition for a complete overhaul of the penal system and the ridiculous laws that are used purposely flood the jails with cattl...err...inmates",
                                                            "score": 14,
                                                            "author": "VaATC",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "The best way to stop a mass injustice is obviously to hire more injustice enforcers and pay them better!\n\n(comment OP, I get what you're saying about being overworked/underpaid, but the solution to COs being stretched thin isn't more COs, it's fewer prisoners).",
                                                                    "score": 11,
                                                                    "author": "richpeoplefeelings",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I agree that prison population needs to go down drastically, but COs also should get higher wages. Not more COs, but higher wages for the necessary COs for a reduced prison population.",
                                                                            "score": 5,
                                                                            "author": "gjgidhxbdidheidjdje",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "There was also a toxicology report that claimed 2 of the guards tested positive for a very specific sedative. That’s why the some of the federal charges against the guards were dropped. Nothing adds up and who knows what’s been doctored at this point",
                                                    "score": 3,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 12,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Not that I believe his death was definitely suicide, but every one of those \"coincidences\" can be explained by overworked, underpaid, barely trained ~~psychopaths~~ assholes not giving a fuck about the welfare of people they're guarding.",
                                                    "score": 14,
                                                    "author": "TripperDay",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "as long as psychopathic creeps run countries forget it.",
                            "score": 39,
                            "author": "cj802",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Psychopathic creeps have always largely run countries/tribes/whatever throughout history. There unfortunately isn’t a big overlap of people who are attracted to power and those with truly pure, selfless intentions.\n\nBut that’s not an absolute rule, there are good people in government and we need to support them and support newcomers like them. Change doesn’t happen overnight.",
                                    "score": 26,
                                    "author": "Zaalbaarbinks",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Meanwhile, [Maxwell is still worth $20 million](https://www.celebritynetworth.com/richest-businessmen/business-executives/ghislaine-maxwell-net-worth/). Take her money, too",
                    "score": 28,
                    "author": "Petsweaters",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was honestly surprised by that $20M number. I know it sounds like a lot of money … but to the type of people in those circles, it’s peanuts. I was expecting it to be much more. \n\nSpecifically, I had expected that some of Jeffrey’s assets would have been held in some sort of secret manner that both he and Ghislane would have access to… of course, if that’s true, they might have just not found it yet.",
                            "score": 8,
                            "author": "randompersonx"
                        },
                        {
                            "level": 2,
                            "comment": "And she's known to have helped Epstein set all of this up.\n\nWhy has not 1 answer been gotten out of Ghislaine? Why has everyone stopped talking about this? \n\n/r/Ghislaine/",
                            "score": 14,
                            "author": "PUBLICLY-SHARED-ACC",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And she raped girls herself",
                                    "score": 14,
                                    "author": "Petsweaters",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "100%.\n\nEvery victim's story I've heard; Ghislaine is the one that \"Discovered them\" in a park, a library, etc, just walked up to them and offered a great job in the massage industry.\n\nMost of them also say she was there, and either initiated, or joined in on the assault of these young girls. \n\nHow many women and underage girls did she do this too!? Hundreds? Thousands over the years, in how many countries?  It's so disgusting, and it really bothers me that the entire world just seems to give her a pass or forgotten about her because.. why Again? Vagina? Why does that even matter?\n\nShe's a known child rapist, groomer, sex trafficker, and no one seems to care. That fucks me up.\n\nI hope she lives a very long life full of guilt and constant pain, while she is forced to tell the truth.",
                                            "score": 18,
                                            "author": "PUBLICLY-SHARED-ACC",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Ivana Trump (mother, not daughter Ivanka) is accused of accompanying Ghislaine on her recruiting outings.",
                                                    "score": 9,
                                                    "author": "theswampisdeep2"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It will never happen, but I really would like to see a detailed and truthful account, by Ghislaine, Wexner, and anyone else involved, on how Epstein got his money.  Ghislaine won't as it would implicate her, Wexner probably won't as it might have involved blackmail, and so on.  But it would be a good read.",
                    "score": 59,
                    "author": "topasaurus",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Probably not just blackmail.  You don't think he charged through the nose to visit his island and use/abuse his girls?  You don't think he arranged prices to bring young girls to rich men?",
                            "score": 37,
                            "author": "Living-Complex-1368",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It was an intelligence operation. He wasn’t just charging rich people for sex. The whole point was to have a recording for blackmail\n\nHe was given billions from wexner and others. He didn’t need money.",
                                    "score": 34,
                                    "author": "whowasonCRACK2",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Seriously. The dude came out of nowhere &amp; nobody can explain why. Then suddenly hes hanging out with the most powerful people in the world.",
                                            "score": 15,
                                            "author": "BRUCE-JENNER",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "He actually got his start from former Attorney General Barr’s father. He hired Epstein to be a tutor at an elite new york prep school even though Epstein didn’t even have a college degree. \n\nThat was the first of many jobs/ board memberships that Epstein got despite having zero necessary qualifications. I found it interesting that no journalism outlets felt the need to ask Barr about that when given the chance.",
                                                    "score": 13,
                                                    "author": "whowasonCRACK2",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Explain why the hell a billionaire (Wexner) randomly decided to give Epstein power of attorney and a mansion worth tens of millions if not blackmail.",
                                    "score": 7,
                                    "author": "translatepure"
                                },
                                {
                                    "level": 3,
                                    "comment": "The price was probably influence and protection, mainly. \"Keep me rich and fancy-free, and you can bang all the high school girls you want\"",
                                    "score": 12,
                                    "author": "blithetorrent"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The guy was sleazy from top to tail but there's not much mystery to it beyond standard white collar sleaze. He was a Wall Street style big shot for a long time.\n\nMaybe there was other stuff as well but why he was wealthy isn't unexplained.\n\nRead his Wikipedia article :/ Pretty wild ride for a guy who started as a schoolteacher. Probably one of the rare occasions children were better off if he was.",
                            "score": 8,
                            "author": "ChunkyLaFunga",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "But.. who bought it?",
            "score": 358,
            "author": "Tessarvo",
            "replies": [
                {
                    "level": 1,
                    "comment": "The buyer appears to be anonymous. Probably a trust or LLC.",
                    "score": 64,
                    "author": "mackenzieb123",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Or Jared Leto",
                            "score": 51,
                            "author": "holdingonforyou",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I know it's a joke, but I could see that happening.",
                                    "score": 30,
                                    "author": "tanis_ivy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It’s a cool island .. if .. you can ignore the tons and tons and absolute tons of past abuse",
                                            "score": 11,
                                            "author": "OterXQ",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's the kind of place McAfee would buy",
                    "score": 272,
                    "author": "Iohet",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He took one look at it and said to himself “what a dump!”",
                            "score": 57,
                            "author": "PlasticPaulBunyan",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "To be fair, John McAfee *loves* shit",
                                    "score": 26,
                                    "author": "LordDongler",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Who is in jail...again.",
                            "score": 21,
                            "author": "NationalGeographics",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What’s he in jail for now? That guy has had one hell of a life path",
                                    "score": 21,
                                    "author": "ACEasterling",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The crazy thing is, it could be fucking anything, and I’d believe it. He’s the Hunter S. Thompson of programming.",
                                            "score": 29,
                                            "author": "OneFreamon",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I got to see him and Steve Wozniak speak during college and it was great. He was way more interesting than woz, had some funny stories",
                                                    "score": 8,
                                                    "author": "Abasia",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Man, I’m very jealous. He might fucking reprehensible but he might just be a genius.",
                                                            "score": 5,
                                                            "author": "OneFreamon",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Exactly. He’s definitely a special breed and I believe has a few more twists and turns left in life",
                                                                    "score": 7,
                                                                    "author": "ACEasterling"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "If I remember correctly, he's sitting in a Spanish jail on fake internet coin shenanigans. He might have been selling weird jungle drug cures as well. \n\nIt's almost like quitting drinking ruined his life.",
                                            "score": 11,
                                            "author": "NationalGeographics",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Nah, normal tax evasion because he refused to pay tax on crypto claiming it was itself currency. He was on the lam for years and fucked up.",
                                                    "score": 10,
                                                    "author": "FluffySmasher",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Thanks for the update. He's a squirrely one.",
                                                            "score": 3,
                                                            "author": "NationalGeographics",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "The most recent time he really opened up was on the Forehead Fables podcast. He got tricked into appearing as a guest thinking that it was serious and once he realized what was going on after the cameras started rolling he just went with it. The reality of McAfee is that he knows damn well how things work and has a lot of self control, but consciously decides to game every system possible because fuck you. It’s a really good watch, [here.](https://m.youtube.com/watch?v=dajjuH4LFjY)",
                                                                    "score": 4,
                                                                    "author": "FluffySmasher",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "he had a whole private island and shit, and I would wager it sold for a ton less than it was worth because of its history.",
                    "score": 109,
                    "author": "sno_cone_thehomeloan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The $51M is for his New York mansion, not his island.",
                            "score": 71,
                            "author": "Meep-meep-meep-",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Crazy they still have 3 insane, insane mega mansions left to liquidate.\n\n- The New Mexico Ranch\n- The Palm Beach Mansion\n- Little St James Island (I believe he also owns a neighboring island)\n\nThat’s not including the giant penthouse flat in Paris, his airplanes, and whatever else he has.",
                                    "score": 80,
                                    "author": "ajmartin527",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "How much of it will go victims?",
                                            "score": 13,
                                            "author": "Peeping_thom",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Not much. It will go to his estate (aka family).",
                                                    "score": 13,
                                                    "author": "Kartageners"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Where do you go if you’re interested in buying this type of thing? \n\nOr is it just like anybody who would be able to buy it already knows how anyway",
                                            "score": 9,
                                            "author": "zvug",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Most likely the latter. Pretty sure that most public auctions like this are posted publicly by the state/country prior to sale. That doesn’t mean you don’t need connections to get them though.",
                                                    "score": 6,
                                                    "author": "ajmartin527"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I would wager that a person buying an island doesn't give a shit about the ethical and moral history of the island.",
                            "score": 157,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm worried that some shady molestation sanctuary might be something that person actually gave a shit about.",
                                    "score": 69,
                                    "author": "Tessarvo",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Let’s hope not. One of the few situations where I’d be glad it was someone who didn’t care",
                                            "score": 13,
                                            "author": "Schirenia",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 27,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "There’s always wackos who idolize the worst people in society. I sure hope this isn’t a case like that.",
                                            "score": 4,
                                            "author": "Capernikush"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I honestly don't know if the history of the island matters. This isn't **L O S T**",
                                    "score": 12,
                                    "author": "Appropriate_Fold_923",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It matters if you want peace and quiet. There are literally thousands private islands.",
                                            "score": 7,
                                            "author": "fqpgme",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Dint blame the island, it's not its fault a piece of shit decided to live there",
                                                    "score": 10,
                                                    "author": "throwawaylovesCAKE"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "In New York, there's not much you can do that would devalue the land the mansion sits on.",
                            "score": 18,
                            "author": "HHyperion"
                        },
                        {
                            "level": 2,
                            "comment": "The pedo-island with the hollow mountain they filled with concrete before it could be investigated? (From what I've heard at least, I haven't followed this case much)",
                            "score": 9,
                            "author": "tanis_ivy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Holy fuck i haven’t heard about the mountain but that’s insane. Got a source (doesn’t have to be official, it can be a well-written r/conspiracy post or whatever)",
                                    "score": 7,
                                    "author": "sno_cone_thehomeloan",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;Got a source (doesn’t have to be official, it can be a well-written r/conspiracy post or whatever)\n\nHuh, first you ask for the improbable and then you ask for the impossible",
                                            "score": 11,
                                            "author": "46-and-3",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "There is no hard evidence from what I can see, but there is a lot of circumstantial evidence:\n\nhttps://www.dailymail.co.uk/news/article-7361297/Jeffrey-Epstein-shipped-50K-cement-truck-Pedophile-Island-cover-evidence.html\n\nhttps://www.youtube.com/watch?v=zrqI5kmoKvc&amp;t=0s\n\nhttps://www.dailystar.co.uk/news/latest-news/prince-andrews-fugitive-pal-ghislaine-21607199\n\nhttps://www.telegraph.co.uk/news/science/stephen-hawking/11340494/Stephen-Hawking-pictured-on-Jeffrey-Epsteins-Island-of-Sin.html\n\nA few weeks prior to his arrest he priority shipped an industrial cement truck to his island. In 2020 footage of people sneaking on to his island it appears that certain parts have been altered and/or covered with the cement, such as 2 specific electric boxes in a shed. In addition, it's well known that he had a submarine and GM was/is a licensed sub operator. Lastly, I can't find the source RN but I remember reading a quote from one of his maids in 2003 that alleged there was an underground tunnel network with a map. Couple these facts with the nature of what he was doing, and the theory that he literally buried the evidence in cement is pretty damn plausible.",
                                            "score": 7,
                                            "author": "grimbloodyfable_",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "There’s enough demand in the market. And if someone has apprehensions, those will go away the moment they see that there are other interested buyers.\n\nI think the real question is how much money the buyer would spend to debug the place and remove all spy cameras. I don’t know what it would take to build that assurance.",
                    "score": 15,
                    "author": "madlabdog",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A bulldozer",
                            "score": 7,
                            "author": "Jason1143"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Every woman that was abused because of him will receive an equal share. A Cheque for $10 each",
            "score": 1229,
            "author": "Yoguls",
            "replies": [
                {
                    "level": 1,
                    "comment": "I mean if he abused 200 (which I doubt, I think it was a lower number but he kept them around for a long time to minimize risk of word getting out) that’s still $250k+ each.\n\nEdit: was very wrong about the number, it was probably at least 500-1k",
                    "score": 287,
                    "author": "sno_cone_thehomeloan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Shit's been going for 20+ years, it's a lot more than 200 imo. Didn't only one of them bring another 50-60?",
                            "score": 335,
                            "author": "Nananahx",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think most of the victims were never identified. They are probably foreign and don't even speak English.",
                                    "score": 216,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Also a lot of it took it place on his island, he had a yacht, plane and even access to a submarine.\n\nhttps://www.mirror.co.uk/news/world-news/stephen-hawking-paid-visit-island-4968224\n\nHow we will ever know that some of his victims are at the bottom of the ocean?",
                                            "score": 159,
                                            "author": "fqpgme",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 82,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Do you have a source on that? As far as I know all of Gacy’s killings didn’t occur on an island.",
                                                            "score": 17,
                                                            "author": "ThePrussianGrippe",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[deleted]",
                                                                    "score": 11,
                                                                    "author": "[deleted]",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; Also a lot of it took it place on his island, he had a yacht, plane and even access to a submarine.\n\nSo that’s what the plot of LOST was about…",
                                                    "score": 22,
                                                    "author": "SkyJohn",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "The REAL pedophiles were the... Friends.. we made..along.... You know what? Nevermind.",
                                                            "score": 8,
                                                            "author": "Gandalfthefabulous"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 15,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 22,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Oh it's you",
                                                    "score": 19,
                                                    "author": "[deleted]"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Nice new identity Jeffrey, we can all see through that underscore",
                                                    "score": 6,
                                                    "author": "BewareTheMoonLads"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "They were just 1400 year old demon spirits inhabiting the bodies of 13 year old girls. It's different!!",
                                                    "score": 3,
                                                    "author": "Gandalfthefabulous"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "True, a lot of them were likely from Haiti after the earthquake",
                                            "score": 5,
                                            "author": "sno_cone_thehomeloan"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "As terrible as it is... how would we know? If we are only aware of 200ish, how can we identify more? Obviously they should all be compensated, but if we don't know who they are...",
                                    "score": 15,
                                    "author": "iamthewhatt",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You can only help who you can, I suppose.",
                                            "score": 8,
                                            "author": "DrMobius0",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Not to mention them constantly aging out",
                                    "score": 3,
                                    "author": "Money_Calm"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Courtney Wild, one of the victims, says that in just two years she alone brought him \"70 to 80 girls\".\n\n\"Other witnesses have testified in civil court that hundreds of girls were brought to Epstein’s homes.\"\n\nhttps://www.thecut.com/2019/07/how-many-jeffrey-epstein-victims-are-there.html",
                            "score": 39,
                            "author": "fqpgme",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No doubt. Those creeps love young, innocent girls and they're no longer innocent once they rape them for a week",
                                    "score": 12,
                                    "author": "Petsweaters",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Terrible thing to read but it's sum up their crazy mind so well",
                                            "score": 5,
                                            "author": "Teenypea"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It's not just women he abused but the women he allowed to be abused by others",
                            "score": 36,
                            "author": "Yoguls"
                        },
                        {
                            "level": 2,
                            "comment": "It’s more than 200. Probably thousands. But mostly unidentifiable",
                            "score": 7,
                            "author": "dylangolfcode360"
                        },
                        {
                            "level": 2,
                            "comment": "You expect the lawyer not to take a cut? It'll be $250 each when the legal fees have been deducted.",
                            "score": 6,
                            "author": "load_more_comets"
                        },
                        {
                            "level": 2,
                            "comment": "This guy divides. ^",
                            "score": 5,
                            "author": "Appropriate_Fold_923"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Oh boy, this is actually great news but the wording in the headline makes it sounds like they sold the abused women with the mansion.",
            "score": 853,
            "author": "pausingthekids",
            "replies": [
                {
                    "level": 1,
                    "comment": "“...to receive the money”. \n\nIt is even worse, it sounds like a kidnap :(",
                    "score": 191,
                    "author": "gitty7456",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Read it the same and was wondering why they hadn't freed them yet in this time.",
                    "score": 37,
                    "author": "poopellar",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Right? Depreciating assets and all.",
                            "score": 14,
                            "author": "Mementose"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "\"Abused women to receive $51m from the sale of Jefferey Epstein's mansion\"\n\nLike, that's not that hard. I have to assume they have an editor that day drinks.",
                    "score": 34,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Or:  \n&gt; Jeffrey Epstein mansion sells for $51m, abused women will receive the money",
                            "score": 12,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I feel terrible for thinking the same the first read. YOUR RESPONSIBILITY NOW!!",
                    "score": 7,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "That’s exactly how I read it too. I was concerned for half a second",
                    "score": 9,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "The pre-tenderized women are a feature build into the basements manacles attached to the stone walls, in iron cells.",
                    "score": 6,
                    "author": "Adeepersleep"
                },
                {
                    "level": 1,
                    "comment": "I saw what sub it was posted in and was like “OP, you sick motherfucker”\n\nThat’ll learn me not to go on Reddit before I have my wakey juice",
                    "score": 8,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Where the hell is all his friends and collaborators is my question",
            "score": 79,
            "author": "xsethx",
            "replies": [
                {
                    "level": 1,
                    "comment": "Piers Morgan is still making news...",
                    "score": 47,
                    "author": "533-331-8008",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Did he just quit?",
                            "score": 5,
                            "author": "callmethejudge",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I guess so?  I believe he’ll probably have a job waiting for him with some sort of foreign Steve Bannon type.",
                                    "score": 3,
                                    "author": "533-331-8008"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "One just got kicked out of the White House, that's something",
                    "score": 24,
                    "author": "lic05",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Epstein didn't kill himself.",
            "score": 144,
            "author": "CommunismIsForLosers",
            "replies": [
                {
                    "level": 1,
                    "comment": "Correction, he commited assisted involuntary suicide.",
                    "score": 48,
                    "author": "BicephalousFlame",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Dude got suicided",
                    "score": 38,
                    "author": "TimmyTesticles",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He might not even be dead",
                            "score": 23,
                            "author": "GalacticSenateLaw",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "We’ve got a blurry pic, and all cameras malfunctioning at the same time. It’s not out of the question.",
                                    "score": 13,
                                    "author": "historywasrewritten",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Was anyone reading that headline and was expecting the second half to go more along the lines of “with abused women still inside”",
            "score": 120,
            "author": "slopezski",
            "replies": [
                {
                    "level": 1,
                    "comment": "I would be careful digging on that property",
                    "score": 22,
                    "author": "seamus_mc",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "minus lawyer and real estate broker fees at... 30%?",
            "score": 50,
            "author": "beep_check",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s a conservative estimate",
                    "score": 28,
                    "author": "magnoliamouth",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh don't tell me Bill Bar's the conservative handing the sale. Come on!",
                            "score": 10,
                            "author": "Appropriate_Fold_923"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I just watched the Netflix special on this last night.  (Still need to watch the last installment.) It truly freaked me out because I had no idea the full extent of his crimes.  So much pain caused by this man. So glad for the few in law enforcement that kept pushing for justice in the face of such opposition and corruption.",
            "score": 9,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Ok. How about the people who made billions off of him and protected him? How about the politicians he rolled with and brought to pedo Island? How about the people who killed him to cover up their involvement?\n\n*Crickets.*",
            "score": 44,
            "author": "Nethervex",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This title could use a comma.",
            "score": 24,
            "author": "x0lan",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Seriously. Who writes these titles?",
            "score": 14,
            "author": "onlycodered",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Great now let’s lock up everyone else involved in his despicable crime ring",
            "score": 12,
            "author": "SimpleYA"
        },
        {
            "level": 0,
            "comment": "Yet no word about Clinton or Trumps connections, flight logs or Ghislaine Maxwell. This is all just a show at this point. Pedos have infiltrated a lot of the top spots, left and right...",
            "score": 236,
            "author": "farleycatmuzik",
            "replies": [
                {
                    "level": 1,
                    "comment": "Prince Andrew too",
                    "score": 180,
                    "author": "bingoflaps",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "But he can’t sweat ...\n\n(͡•_ ͡• )",
                            "score": 53,
                            "author": "_Diskreet_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "How can that picture be real if sweat isn't real? \n\nCheckmate atheists",
                                    "score": 12,
                                    "author": "snizarsnarfsnarf"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Harry and Meghan get publicly called out by the Royal family... Prince Andrew being a pedo gets swept under the rug...\n\n[For reference about Harry and Meghan being called out ](https://www.bbc.co.uk/news/uk-56360671)",
                            "score": 56,
                            "author": "STINKYnobCHEESE",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I know I have a tendency to be really oblivious, but I didn't realize she wasn't white until these articles started showing up everywhere.",
                                    "score": 21,
                                    "author": "7937397"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Since Epstein is dead he can just be the scapegoat.  Unfortunately we probably won’t hear about others.\n\nHarvey Weinstein is another example.  There are a lot of other rapists abusers and pedos in Hollywood but we can all ignore that and rest easy since Harvey Weinstein went to jail.",
                    "score": 100,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Racism is gone in America because we had Obama, and rapist abusers are gone from Hollywood because Harvey is in jail.\n\nIt is human nature to find a single data point and use that to justify your worldview and your biases, but it takes hard work and time to actually make the changes needed to make society better.",
                            "score": 33,
                            "author": "prefer-to-stay-anon",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What are some historical examples of well rooted-out social evils like this?\n\nDoesn't have to be on the same scale but can at least provide some precedence that society was able to combat it and make wholesale changes.",
                                    "score": 6,
                                    "author": "themerinator12",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The murder of Emmett Till",
                                            "score": 8,
                                            "author": "SadAslyf"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Most of the examples I can come up with are super old.\n\nChattel slavery, cattle rustling, Rush Limbaugh.",
                                            "score": 7,
                                            "author": "Saint_Consumption"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 26,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I have serious doubts that a real and honest investigation can occur without certain protections for certain people.",
                            "score": 11,
                            "author": "dericiouswon"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Maxwell is currently remanded in jail - she’s been in  there 9 months now , and the legal proceedings against her have began. She’s facing 6 federal charges dealing with procuring and abusing minors.\n\nI’m surprised you haven’t heard about it, it’s a pretty big case.",
                    "score": 10,
                    "author": "newaccount"
                },
                {
                    "level": 1,
                    "comment": "Jizzlane is awaiting trial still.  The rest perhaps will be part of the trial in some way.  This particular piece is about the victims, not the evidence.",
                    "score": 5,
                    "author": "Iohet",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I know, the lack of action is gross. I have some hope that they're keeping quiet because the investigation is still underway.",
                    "score": 5,
                    "author": "BigbunnyATK"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is exactly what should happen when the rich use their power to abuse other people. They should have all their possessions taken away from them and it should be distributed amongst their victims.",
            "score": 7,
            "author": "oldfrancis"
        },
        {
            "level": 0,
            "comment": "Journalists still misrepresenting the story. Sexual child abuse survivors.\n\nThe title reads like they were adults when it happened.",
            "score": 40,
            "author": "Andrenachrome",
            "replies": []
        },
        {
            "level": 0,
            "comment": "The real assets are whatever compromising info he had on the power elites.",
            "score": 18,
            "author": "JK_NC"
        },
        {
            "level": 0,
            "comment": "You know that place has to be haunted as fuck.",
            "score": 6,
            "author": "lonelysaurusrex"
        },
        {
            "level": 0,
            "comment": "This headline is oddly written",
            "score": 6,
            "author": "Alan_Scott_Davis"
        },
        {
            "level": 0,
            "comment": "They need to use Commas. The first time I read that it sounded like the mansion sells with abused women.",
            "score": 3,
            "author": "Peachmuffin91"
        },
        {
            "level": 0,
            "comment": "It's not going to be officially uplifting News until some of the Rich and powerful men who are still in positions of control around the world see Justice for their use of his services.\n\nStill too many sick sons of b****** getting away with this!",
            "score": 8,
            "author": "Northman67"
        },
        {
            "level": 0,
            "comment": "There's not enough money in the world to fix the kind of fucked physical and psychological torture those poor children and young people went though. \nI don't belive in karma or hell. I really believe he(Jeffrey) got away with it and the only justice is to hold accountable all of the people who are living and involved. Donald Trump, Prince Andrew, Clinton ect.... All those slimy bastard's are literally alive and thriving so excuse me if I'm not over the moon at the payouts.",
            "score": 5,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "who bought him that $51m mansion? [Les Wexner](https://old.reddit.com/r/Epstein/comments/lh5q0y/leslie_wexner_needs_to_be_indicted_for_sexual/). He has clear ties to the epstein scandal, so he should be under scrutiny from Mainstream Media(MSM) and the FBI. But he isn't.\n\nhe released a BS story about how epstein scammed him shortly after epstein was caught, media didn't question such a bs story and then shortly after Epstein was killed/suicided.\n\nWe also know shortly after Epstein got caught for the final time, the media really tried hard to clean his image. \n\n&gt;[\"Many media outlets referred to Epstein’s victims, both acknowledged and newly alleged, as “underage women.” The New York Times used the term. So did New York magazine. Jezebel counted 90 instances of it aired on broadcast news in the days after Epstein’s arrest alone.\nThe phrase is wrong in every sense: There is no such thing as an “underage woman.” Underage women are girls. \"](https://www.theatlantic.com/entertainment/archive/2019/08/jeffrey-epstein-and-the-myth-of-the-underage-woman/596140/)\n\nSo why has the media tried so hard to [clean](https://www.usatoday.com/story/news/nation/2019/07/12/jeffrey-epsteins-sex-trafficking-case-what-do-you-call-his-crimes/1713172001/) and downplay the epstein scandal. and why has Wexner been free of any scrutiny?",
            "score": 4,
            "author": "jumjum888",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Who would want to buy the home of a sexual predator? Sitting in your new living room thinking “I wonder how many girls got raped in here?”",
            "score": 8,
            "author": "patchward"
        },
        {
            "level": 0,
            "comment": "How is this uplifting at all? This is pittance and most of that money is going to lawyers anyway. The global pedophile rings are still in place and the kingpin was murdered in front of us with no consequences",
            "score": 3,
            "author": "MushyRedMushroom"
        },
        {
            "level": 0,
            "comment": "Someone should buy it and turn it into a battered women's home and retreat.",
            "score": 3,
            "author": "Cactusjuice2"
        },
        {
            "level": 0,
            "comment": "Ummm, who bought that place?? That’s like buying a famous murder house...",
            "score": 3,
            "author": "harvisturnip",
            "replies": []
        },
        {
            "level": 0,
            "comment": "That’s awesome fuck that piece of trash.",
            "score": 3,
            "author": "Systemfailedv13"
        },
        {
            "level": 0,
            "comment": "This is great news, but seriously, who the fuck would want to live there",
            "score": 3,
            "author": "promofaux"
        },
        {
            "level": 0,
            "comment": "The fund that got the money was established by his estate to give peanuts to the victims while the vast majority of his wealth goes.... where? Who inherited his estate?",
            "score": 3,
            "author": "D1Foley"
        },
        {
            "level": 0,
            "comment": "Shame money won't give back kids innocents or take away the horror they had to endure at this and his elitist friends hands. How about busting the pedophile ring that is the rich and famous as well and help prevent this shit happening to more people.",
            "score": 3,
            "author": "Valuable_Evidence723"
        },
        {
            "level": 0,
            "comment": "Every single wall needs to be torn down to get all the hidden cameras removed.",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "When I first read the title I thought it was selling with the women",
            "score": 6,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Good. Now do Mar-a-Lago.",
            "score": 5,
            "author": "OldMudBottom"
        },
        {
            "level": 0,
            "comment": "\"Annnnd over here in the atrium is where president clinton came on a 17yr olds face, notice how the sunlight compliments the structure?\"",
            "score": 7,
            "author": "PraeyngMaentis",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh yeah I can still see the cum stains \"shoots pic with phone\"",
                    "score": 3,
                    "author": "curiouz_mole"
                }
            ]
        }
    ]
}