{
    "id": "ngfb6x",
    "score": 78168,
    "title": "Good news! The DEA quietly announced ending their monopoly on cannabis grown for scientific purposes. And that means American researchers can, for the first time ever, conduct studies using real-world cannabis instead of the terrible low-THC they’ve been forced to use for decades....",
    "author": "Oneiric19",
    "date": 1621453998.0,
    "url": "https://www.reddit.com/r/UpliftingNews/comments/ngfb6x",
    "media_urls": [
        "https://www.leafly.com/news/politics/dea-finally-ends-fed-monopoly-on-schwaggy-research-grade-cannabis"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "DEA been growing reggie this whole time smh.",
            "score": 5735,
            "author": "Patrollerofthemojave",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nah they just cut the front lawn and bagged it\n\nEdit: holy shit thanks for the upvotes everybody",
                    "score": 1244,
                    "author": "areglis",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Spinach from someone’s sandwich",
                            "score": 435,
                            "author": "VDubDJ",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Michael did you put caprese salad in my desk?",
                                    "score": 463,
                                    "author": "tannerthemess28",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yea, you can see the mozzarella right there..",
                                            "score": 145,
                                            "author": "assidreemz",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "All my feds have a low rider",
                                                    "score": 45,
                                                    "author": "clueless_as_fuck",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 75,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Just the fact that he tells Michael it’s 2 pounds and Michael totally believes it. Like that bag is a few ounces at most",
                                                    "score": 31,
                                                    "author": "jflan1118",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "You think I framed you and you’re mad I wasted the cops time?",
                                                            "score": 15,
                                                            "author": "heresyohnny"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Since when is it illegal to put caprese salad...anywhere",
                                            "score": 28,
                                            "author": "AsstToTheMrManager",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "r/unexpectedoffice",
                                                    "score": 8,
                                                    "author": "crankyblanky",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "That’s what the pic looks like",
                            "score": 3,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "In my state, there's a medical marijuana program but the weed can't be higher that 0.9% THC. It's a joke",
                    "score": 226,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's essentially cbd",
                            "score": 143,
                            "author": "PortableFlatBread",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Unless it's for CBD?\n\nNah. That's just shitty pot.\n\nYou can get quality pot that tastes good and is just for (mainly) CBD.\n\nBut you can also get shitty pot that has low THC and none CBD. That Middie shit.",
                                    "score": 59,
                                    "author": "WaitTilUSeeMyDuck",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah CBD flower is just federally legal if it's below 0.3% d9-THC. If 0.9% was enough to get relief we wouldn't really need legal \"marijuana\" we could just smoke more. Even the best CBD flower you  can get is really obviously what it is, you can tell by smelling it that it's not gonna get you high if you've been around the stuff enough. Although, I will say, it does kind of make strains like Harlequinn obsolete or at least way less cost-effective than buying an lb of CBD flower for $100 and just mixing it with your regular weed. I make my own oil too.",
                                            "score": 11,
                                            "author": "Fistulord",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 37,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I think even worse than that. I’ve heard stories of the research samples being filled with mold and other issues too.",
                    "score": 20,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Create a problem sell the solution, basic mafia 101",
                    "score": 55,
                    "author": "syl3n",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "They were the ones (and cia) flying in cocaine in the us during the 80s. They were one of pablos good customers. Which brought the crack problem.",
                    "score": 82,
                    "author": "snakeyfish",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Money under the radar for non approved ops..",
                            "score": 36,
                            "author": "cbri",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Olllie North! Olllllie North!",
                                    "score": 17,
                                    "author": "MediocreProstitute",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "He's a soldier!\n\nAnd a hero!\n\nAnd a novelist!\n\nAnd now-\n\nHE'S\n\nON\n\nFOX\n\nNEWWWWS",
                                            "score": 4,
                                            "author": "Taco4Wednesdays"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m a biomedical researcher. Some of our projects are on opioid abuse. It’s surprisingly easy to obtain provided your institution has a DEA license and you maintain good compliance. A colleague does similar research to us. You wouldn’t believe the insane obstacles to gaining small amounts of the research ditch weed grown in Kentucky. When we talk about the drug war, we often think of the casualties, the incarceration rates and the financial burden. There is also a very pressing research cost that doesn’t get talked about much. What the DEA have done over the years is drastically limit how much we know about the biological responses of one of the most used substances in the world, and it’ll take a while yet to make up for this loss. They really have a lot of atoning to do. Hopefully rescheduling, pardoning, and reparations are next.",
            "score": 258,
            "author": "Clever_Userfame",
            "replies": [
                {
                    "level": 1,
                    "comment": "It makes sense in a capitalist nightmare sort of way.\n\nLots of business and government people make money from pushing opioids on people, and up until now they've not made squat directly from weed. From that they make more money from the prison system so it's in their best interest to make sure that there is no quality research because it would largely say that it's harmless (smoking risks notwithstanding) and their rules are based on red scare era nonsense.\n\nWe have a similar problem in the UK. MPs will stand up in the Commons and say weed is a terrible blight, causes crime, mental illness of all kinds, puts good kids on the path to injecting crack and snorting heroin and whatnot, all while they own gigantic farms and export companies which sell enormous amounts of weed everywhere except inside the UK. We're the biggest exporter of the stuff and yet it's a class B drug here, possession of which carries 5 years in jail or an unlimited fine *or both*. Dealing can get you 14 years!",
                    "score": 42,
                    "author": "QuantumWarrior",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "The 2017 article linked in the OP article that describes the DEA weed:\n\n&gt; That bowl of what looks like stuff you might dig out of an old lawnmower is actually government-approved medical marijuana. Since the 1960s, the United States has required that  all cannabis used for research be sourced through the government.\n\nLol",
            "score": 1206,
            "author": "tosil",
            "replies": [
                {
                    "level": 1,
                    "comment": "Does this mean that all the studies looking at the long term effects of THC were done with low quality weed?\n\nDoes this invalidate the research? or is it okay cause they just used a lot more of it?",
                    "score": 512,
                    "author": "stockmasterflex",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It invalidates the research in the sense that it can’t be directly comparable to real world weed in 2021. You can still come to conclusions on the effects of that low THC weed used in the trials, and then you can speculate on what the higher THC weed might do based on those results, but at that point it is still just speculation.",
                            "score": 439,
                            "author": "Depression-Boy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I volunteer as tribute. Or some shit.",
                                    "score": 163,
                                    "author": "Shakeyshades",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Right?\n\nInject me with *all* the weeds.",
                                            "score": 67,
                                            "author": "boomboy8511",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "eh be careful injecting THC, worst case was a week or two coma",
                                                    "score": 18,
                                                    "author": "smurficus103",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "is this something that could actually be possible?\n\nive heard of possibly using milk in a bong to possibly absorb thc and then drinking it, which is fucking disgusting",
                                                            "score": 8,
                                                            "author": "Mining_elite222",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Hell yeah and since it's a study they'll pay me to get high AF. Fucking yes sir I will smoke the fat spliff of the highest grade in the name of science.",
                                                    "score": 37,
                                                    "author": "Shakeyshades",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I'll take it up the ass if i have to.",
                                                    "score": 9,
                                                    "author": "ChurrObscuro",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It introduces a larger error in the trials because they’re extrapolating. So they can get a general idea, but don’t know for sure.\n\nThis doesn’t invalidate old research, but it will help to clarify it.",
                            "score": 66,
                            "author": "Wwolverine23"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The plan all along was to make the ~~free~~ black market take the botanical art to the next level.",
                    "score": 49,
                    "author": "imgonnabutteryobread",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "The DEA was forcing American Scientists to smoke that garbage in the picture? That’s despicable.",
            "score": 1809,
            "author": "Complete-Low-6429",
            "replies": [
                {
                    "level": 1,
                    "comment": "That picture brings me back to the 90's, man. My younger cousins who smoke had no clue what a \"weed plate\" was. Told them how we had to pick out seeds and stems before we smoked, and they thought it was hilarious.",
                    "score": 661,
                    "author": "Nasty2017",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "These damn youngsters don't know how good they have it with their usb vape pens with super thc oil. Those things don't even smell. We used to have to break out the weed plate and a smoke out of a Pepsi can or an apple.",
                            "score": 369,
                            "author": "SpiralTap304",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And then exhale through a toilet paper tube stuffed with dryer sheets to keep from stinking up the house before your parents got home",
                                    "score": 368,
                                    "author": "RearEchelon",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Haha \"sploofs\". Did that shit ever work for you? It just made my room smell like the Snuggle bear from the fabric softener commercials got high in it.",
                                            "score": 248,
                                            "author": "SpiralTap304",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I doubt it. My parents probably knew what was going on and just never gave me shit for it",
                                                    "score": 108,
                                                    "author": "RearEchelon",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "As a parent you’re correct I did the same shit just don’t be dumb and you’ve got leeway",
                                                            "score": 59,
                                                            "author": "Rockonfoo"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Real pros would shove a hose down the toilet and blow the smoke through it :D",
                                                    "score": 42,
                                                    "author": "FCalleja",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Wtf are you serious?",
                                                            "score": 19,
                                                            "author": "SpiralTap304",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Yup, did this in a hospital once, minus the tube. Flush the toilet, once the bowl is empty blow your hit into the tube and the water filling the bowl keeps it from leaking out. 9/10.",
                                                                    "score": 58,
                                                                    "author": "FudgeRubDown",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Holy shit. We’ve got a stoner genius among us! Never in all my years did I think of that tactic lol. Even though I don’t need to worry about smell anymore, maybe I’ll still try it just to check it out and see what younger me missed out on.",
                                                                            "score": 30,
                                                                            "author": "ExceptionHandlr",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "I mean YES this works however you still have ambient smoke from whatever you’re smoking from though.",
                                                                                    "score": 13,
                                                                                    "author": "OnlyNeverAlwaysSure",
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "You can use it if you ever stay in a hotel",
                                                                                    "score": 9,
                                                                                    "author": "libertybell2k"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "This actually sounds pretty smart for a high thought",
                                                            "score": 11,
                                                            "author": "ShadyNite"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "That's fucking genius.",
                                                            "score": 9,
                                                            "author": "Oobutwo"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Tagging on to this to say please don't smoke in hospitals. Cannabis or tobacco. Not bashing either, it's just the oxygen concentration is much higher throughout, and it's not worth the risk of blowing up a whole facility. \n\nIf you're admitted to the hospital, please talk to your doctors if your pain is being inadequately treated or you don't have an order in for a nicotine patch to help you with withdrawal symptoms. If you don't get a positive response from them, request to speak to the house coordinator. \n\nBeing in a response team to shut off all active oxygen and emergently switching all patients on ventilators to manual tanks is not enjoyable at the least, when 15 seconds or so of non-oxygenated air is enough to send many of them into cardiac arrest.",
                                                            "score": 24,
                                                            "author": "Nubbacus",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "My friend's Dad used to just eat the cigarettes when we visited him in the hospital. He was a drunken mess, so he was in the hospital a lot.",
                                                                    "score": 6,
                                                                    "author": "KernelAureliano",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "It don’t work. You’re only blowing your smoke through it, but not the smoke that’s coming from the bowl/joint that’s on fire",
                                                    "score": 58,
                                                    "author": "JumboKraken",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "That is why my one hitter  painted like a cigarette, and its dugout, has been my primary piece for the better part of a quarter century.",
                                                            "score": 49,
                                                            "author": "VaATC",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Had one of those in college, it would last like a week before it would clog up and need to be cleaned. Then after it was clean burning embers would hit the back of my throat just about every hit. Used that fucker every day for a year lmao",
                                                                    "score": 59,
                                                                    "author": "BlakBanana",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Same here. I have gotten better a controlling my inhalation after cleaning. The worst though was when I was doing something that I technically should not have been doing whole smoking. The one hitter was clogged but I could not handle trying to clean it and continue the other activity safely, so I torched that sucker as much as I could. Then, all of a sudden, the resin hit that special melting point and it jettisoned a very warm glob of resin onto the very back of my throat. Needless to say gagging initiated and it took all my composure to not throw up. I have not used that clearing technique again as it was pretty close being as bad as picking up a cup you think is your beer and then taking a drink without visual confirmation only to realize it was a cup of dip 'juice'.",
                                                                            "score": 30,
                                                                            "author": "VaATC",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "We would always use a q tip to clean it. Pull the cotton mostly off the ends first so it'll push through. It leaves enough stickyness inside the bat to avoid issue.",
                                                                                    "score": 7,
                                                                                    "author": "ShannonGrant",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Oh man my Altoids mini tin in my left hand pocket and my one hitter in my back pocket in the small gap left under my wallet, all day every day.\n\nI found a whole dugout was too chunky for pocket comfort.\n\nBonus: my tolerance is super low.",
                                                                    "score": 4,
                                                                    "author": "zedthehead"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Are you just letting your bowl roast?  wtf?\n\n\nLearn 2 carb.  Easier still, only pack 1 hit in the bowl at a time. \n\nI can't believe kids today can't figure that out.",
                                                            "score": 5,
                                                            "author": "Taco4Wednesdays"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "And it never fooled anyone. Place still stunk like skunk.",
                                            "score": 26,
                                            "author": "weatherseed",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Like fresh scented skunk!",
                                                    "score": 7,
                                                    "author": "SnowdenX"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Oof that brings me back, ha!",
                                            "score": 10,
                                            "author": "the_fit_hit_the_shan",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 61,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Even more fucked up when you realize there are people still serving their years in prison for having weed on them while others are ordering it on their phone to be delivered to their doorstep.",
                                            "score": 54,
                                            "author": "thefreshscent"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "A couple decades ago? Some of us are still in the dark ages bud. It's definitely as illegal here in South Carolina as ever.",
                                            "score": 15,
                                            "author": "TheWolphman",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I have an adapter so I can charge my weed pipe with my phone while posting on the internet. This would be a mind blowing concept in the 90s.",
                                            "score": 43,
                                            "author": "SpiralTap304",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The technology in a Pax device seriously blows my mind.",
                                                    "score": 4,
                                                    "author": "mybeachlife"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Imagine what getting high 30 years from now will be like.",
                                    "score": 25,
                                    "author": "DigBick616",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I would download the fuck out of getting high.",
                                            "score": 52,
                                            "author": "the_crouton_",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You wouldn't download a nug, would you?",
                                                    "score": 26,
                                                    "author": "SnowdenX",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "The fuck I won’t",
                                                            "score": 9,
                                                            "author": "KushKong420"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Couple weeks ago I learned what an e-nail is: \"E-nails are the newest way to heat the nail on your dab rig.\" Sounds like gibberish to an old man like me, and I'm in my 30s.",
                                    "score": 18,
                                    "author": "guesswho135",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Enails are bomb.\n\nAm 50.",
                                            "score": 7,
                                            "author": "Own_Range_2169",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I mean, speaking for myself, the fact I can get absolutely toasted very quickly inside my apartment with no hassle is something I contemplate and appreciate pretty often. If I could time travel and bring a bunch of pens and carts back to the OG stoners I would. They walked so that we could fly to freaking Jupiter.",
                                    "score": 9,
                                    "author": "[deleted]",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "i once made a  pipe out of one of those rubber tubes you add to a tub to give it a shower head. just took the shower head part off then put tinfoil in the funnel part with some holes. smoking weed in the early 2000's at 13 years old when you lived in the country was hard times. papers could get you into a sesh just because kids would get weed and have nothing to smoking out of and didn't wanna risk the can.",
                                    "score": 8,
                                    "author": "Apprehensive_Thing_1",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "We used to roll with receipt paper. That's a fuckin harsh burn, probably took a few years off my life lol",
                                            "score": 5,
                                            "author": "Anrikay",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Or a water bottle with tinfoil to hold the weed. Must have been absolutely horrible for our lungs.",
                                    "score": 4,
                                    "author": "Uga1992"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "And it cost the same 25 years ago as they pay today.",
                            "score": 109,
                            "author": "CaptainKink",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Maybe it's just my experience but a gram in 2012 was $20 and now I can get it for $10 or under. Somethin happened between 2012 and 2016 where street prices went way down in my area. Eighths were 40-45, now I pay 30-35. Then there's the dispensaries where an eighth with tax is like $60",
                                    "score": 126,
                                    "author": "Deadfishfarm",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Rural Oklahoma here, graduated 2009... in high school, we had nothing but \"reggie,\" which was essentially mexican brick weed. $20/quarter, $80/ounce. Sometimes you'd get lucky and find some \"popcorn,\" and the idea was that it popped when you smoked it, which meant it was good or something.\n\nIt wasn't till freshman year of college when I moved away that I had \"real\" weed, or that kind of weed that you might associate with the kind of weed you can get today in recreational / medical states. Blew my fucking mind how good it was, and I was happy paying $20/gram. \n\nFast forward 12 years, and I can now drive a few blocks down the road and buy some 25% flower or glass or crystal or diamond or whatever the fuck it's called and consume more THC in a single hit than I ever did smoking an entire ounce of reggie. I can get an ounce of mids for the same price we used to pay for an ounce of mexican brick weed. \n\nHigh school me wouldn't believe it.",
                                            "score": 17,
                                            "author": "[deleted]",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Medi legal?",
                                            "score": 31,
                                            "author": "cbri",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Fully legal in ma. But medical is cheaper than recreational",
                                                    "score": 35,
                                                    "author": "Deadfishfarm",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I figure it was because the amount of legally sold goods on the street increased dramatically starting in 2012 and many illicit dealers had to drop prices to keep customers that had access to 'more legal' sources.",
                                            "score": 21,
                                            "author": "VaATC",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah could be it. Though now that it's fully legal I've seen street prices increase a bit  because they're \"doing you a favor\" by not charging as much as dispensaries, even though they're still charging more than usual. Luckily I can usually get it from closer friends that aren't stingey",
                                                    "score": 8,
                                                    "author": "Deadfishfarm",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "The market changed.\n\nGrowers can get licensed and legally grow and sell, but that's super expensive. Or, they can sell illegally, but the risk is higher than it was before because there's fewer illegal grow ops, higher chance you'll be the one who gets busted. \n\nThen you add in the cost of inflation and the requirements of grow ops now. People expect a higher quality product, so even illegal ops are switching to hydro and testing their soil. \n\nOn top of that, the shwag and mids are almost always sold off to make oil/edibles. So the cheapest options that helped bring the average cost down are eliminated from the market. Someone coming and buying an 80L garbage bag full of mids is a better customer than you buying 1/2oz for $40. \n\nYou can still get the hookup from someone who either isn't looking for a huge profit per pound or is close to a grower. But the baseline costs of growing weed have skyrocketed, as have customer expectations, and the market has changed overall. Can't expect the same prices you got ten years ago in a new market.",
                                                            "score": 10,
                                                            "author": "Anrikay",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I still live in an illegal state, and my local connections apparently dried up completely. I can get weed for $10, but it's harsh and rarely does anything for me, and $15 a g, which is what I would expect $10 a g to be.\n\n3-4 years ago, it was possible to get HIGH quality bud for $10 a g in my area, but now it's all dogshit. I have to travel 2+ hours to get decent stuff now.",
                                            "score": 12,
                                            "author": "Calypsosin",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "My uncle wanted to try his hand at growing it, and thought I had an abundance of seeds laying around from my weed. I had to explain that's not a thing anymore.",
                            "score": 19,
                            "author": "me_nigma",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Old man here with an old man question. In states where people can legal grow a plant, where do they get the seeds to grow it?",
                                    "score": 6,
                                    "author": "BeerCheeseNPretzels",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I think you can order seeds online",
                                            "score": 7,
                                            "author": "Funkit"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "When I walked into my shop before pandemic, they had a shelf full of potted clones you could buy, already growing and everything. \n\nThey were like 10-15 bucks, fantastic deal if you keep it healthy.",
                                            "score": 6,
                                            "author": "qxxxr"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I can see why people called it “grass.”",
                            "score": 8,
                            "author": "StickInMyCraw",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 123,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "DEA: You like Pot, huh? Well, (tosses a pack onto the table) if you like it so much, smoke this whole pack then!\n\n&amp;#x200B;\n\nScientist: But-\n\n&amp;#x200B;\n\nDEA: No BUTS! You will NOT leave this lab until you do!",
                            "score": 82,
                            "author": "krashlia",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Being forced to smoke a pound of brickweed sounds like a real bad day",
                                    "score": 63,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "id still take that day over most",
                                            "score": 26,
                                            "author": "No_Locksmith8037",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I mean, if it’s that or nothing? Obviously. I’m just glad I got better choices.",
                                                    "score": 8,
                                                    "author": "Ner0Zeroh"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Some ppl just love smoking schwag",
                                                    "score": 8,
                                                    "author": "dbddnmdmxlx"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I'm getting a headache thinking about it",
                                            "score": 19,
                                            "author": "69_jumpstreet"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Some of us are still in brick weed territory. When I was a teenager I had a constant headache.",
                                            "score": 7,
                                            "author": "fistofwrath",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Start puffing boy",
                                            "score": 6,
                                            "author": "MooseMoosington"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That looks like actual oregano mixed with some weeds from the backyard.",
                    "score": 19,
                    "author": "ban_Anna_split",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Lol looks like the garbage left over after trimming. You think they were testing with this? I sure hope not.",
                    "score": 40,
                    "author": "Attheendofmyropee",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This was grown outdoors by the University of Mississippi, not a professional grower. They basically planted cannabis outdoors and left it alone until harvest time.",
                            "score": 50,
                            "author": "123DRP",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They call it weed for a reason, if you dgaf about output this still works…",
                                    "score": 27,
                                    "author": "123bpd",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah from personal experience weed grows like well a weed. Even if you neglect it it'll grow well enough but I guess they had super shitty genetics or the ones available to the market have exceptional genes.",
                                            "score": 13,
                                            "author": "Attheendofmyropee",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It’s mostly how they grow/care for it would be my guess. Genetics play a part sure but even shitty brick weed seeds can grow into to pretty good quality flower but it needs to be cared for like you would a vegetable or fruit plant.",
                                                    "score": 15,
                                                    "author": "420blazeit69nubz",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Fun fact I’ve driven by those weed fields many times! It really is just big ass weed plants being grown outdoors, hilarious really. It also has some very intimidating security features surrounding it.",
                                    "score": 7,
                                    "author": "NastyWideOuts"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "They 100% were. That’s why this is big news.",
                            "score": 26,
                            "author": "OXil35",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The war on drugs was a complete failure and needs to end.",
            "score": 762,
            "author": "joesixers",
            "replies": [
                {
                    "level": 1,
                    "comment": "If the goal was to have the highest incarceration rates in the world, and to demolish the polices public reputation then its been a huge success. \n\nIf the goal was to curb drug use then its absolute dog water.",
                    "score": 332,
                    "author": "SeaOdeEEE",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think it was Nixon who pretty much admitted that it was made to target minorities",
                            "score": 94,
                            "author": "FrankieNukNuk",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Allegedly it was John ehrlichman, Nixon’s advisor, who said that. But the quote was published long after he died so it’s questionable",
                                    "score": 52,
                                    "author": "yiffing_for_jesus",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 16,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "There's a reason the 13th legalized slavery for prisoners only, and a reason there were suddenly so many laws applying to only one group (jim crowe), then laws targeting all minorities and leftists (the drug war)",
                            "score": 40,
                            "author": "PsychedelicPourHouse",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Drug laws don't target minorities. They are only *enforced* on minorities. Plenty of rich white kids are out there smoking weed and doing coke and even if they do get caught it's a slap on the wrist.",
                                    "score": 9,
                                    "author": "SPQR191",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt; and to demolish the polices public reputation then its been a huge success. \n\nHey, now, they don't need drugs to do that.",
                            "score": 21,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "at this point it's pretty safe to say the private prison *industry* is one of a few main driving forces.",
                            "score": 5,
                            "author": "Hongo-Blackrock",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yes, also drug addiction should be treated as a health issue and not a crime.",
                    "score": 91,
                    "author": "tc1972",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Exactly. Making drug use and abuse a crime has lead to increased violent crimes and people suffering who don't have access to social programs for help. Some of  that money going towards the WoD should be reallocated to universal rehab and drug addiction counseling services.\n\nEven when citizens get a drug charge and aren't thrown in jail they may be forced into drug counseling services that they have to pay for, if they don't want to go to jail. Not everyone can afford that, or take time off from work to comply with the court orders.",
                            "score": 22,
                            "author": "SeaOdeEEE",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "There’s a tightwad buzzcut career DEA guy that put a bunch of people in jail over a plant in his career, and he’s eye-popping angry punching a wall about this. \n\nIf you’re reading this and I’m describing you: kick rocks, fuckface. Your life was a detriment to the world. I hope you lose your pension.",
                    "score": 7,
                    "author": "NSAagent1",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "What are you talking about? It went exactly according to plan. \n\nIt was never about stopping drug use, it was about throwing as many black and brown people in jail as possible.",
                    "score": 52,
                    "author": "SitDown_BeHumble",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 36,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Correct me if this is wrong, but doesn’t this imply that the purported health benefits of marijuana have only been tested on highly unrepresentative strains? Should we expect now some level of concerning “cannabis is less healthy than you think” backpedaling when they start testing the newest ultra-high THC strains that are being sold today, in longitudinal studies?",
            "score": 1057,
            "author": "tensorpudding",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thinking the same thing.  Then again, this is just the DEA so I wonder what other studies done in different countries are using.  Those might already exist with more modern strains.",
                    "score": 441,
                    "author": "MohawkElGato",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That last part totally. My health class many years ago talked about it being a gateway drug. The real ‘gateway’ was misinformation. (Not to mention with it being illegal it would many times have me associating with folks who consumed or tried to peddle other illegal substances at the time)",
                            "score": 227,
                            "author": "OXil35",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Whenever I hear the gateway argument, I ask them which happened first, their first sip of a beer or their first puff of a joint? Most people started with alcohol.",
                                    "score": 188,
                                    "author": "ShittingOutPosts",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I literally tried Alcohol, weed, and tobacco for the first time in the same night.\n\nDorms are the gateway drug.",
                                            "score": 265,
                                            "author": "Talanaes",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 55,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Hey, not so loud. That’s how some of us make a living.",
                                                            "score": 42,
                                                            "author": "Talanaes",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "How my wife makes a living, and how I continue living",
                                                                    "score": 12,
                                                                    "author": "Malicious__Mudkip"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Chocolate, sugar, fats... lots of things we ingest regularly have addictive physiological effects on the body. We just tend to differentiate between chemicals we ingest as 'food stuffs', those that are used as medications, and those that are illicit because we want to control people. It is almost like we should be treating addiction to illicit chemicals the same way we treat regular addictions.",
                                                            "score": 15,
                                                            "author": "VaATC",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Everything is a substance you can become addicted to. Besides air probably. No actually u can get high on pure oxygen.",
                                                                    "score": 5,
                                                                    "author": "mortified_observer",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Haha I bet that was a fun night!",
                                                    "score": 65,
                                                    "author": "ShittingOutPosts",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "&gt;Dorms are the gateway drug\n\nDamn if that ain’t the truth",
                                                    "score": 15,
                                                    "author": "L-methionine"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I started with weed because as a teenager you could buy weed from other kids in the neighborhood, whereas to get Alcohol you needed an adult to buy for you.",
                                            "score": 11,
                                            "author": "Rinzack",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "same. One of the biggest reasons why keeping weed illegal is so actively harmful",
                                                    "score": 5,
                                                    "author": "SometimesAGr8_Notion"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Ha! Why have I never thought of that? I would engage in much more riskier behavior because of booze compared to any other substance I’ve ever consumed.",
                                            "score": 20,
                                            "author": "OXil35",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It literally lowers inhibitions and makes you more willing to do things you wouldn't normally. It's insane that they don't consider it ***the*** gateway drug. \n\nThis coming from someone who would kill a handle in a night with his roommate in college.",
                                                    "score": 8,
                                                    "author": "NotablyNugatory"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I started with sugar, then caffeine, then alcohol, then weed and stopped so for me at least it was the opposite of a gateway.",
                                            "score": 18,
                                            "author": "MacMac105",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Literally same. Wow.",
                                                    "score": 5,
                                                    "author": "mortified_observer"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "For me it was trying weed, realizing the DEA and school lied to me about it, and wondering what else they lied to me about other substances. Led to pretty heavy experimental phase way too young in life",
                                    "score": 22,
                                    "author": "CurseofLono88",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "DARE is the real gateway drug",
                                            "score": 4,
                                            "author": "Heistlyfe"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Alcohol is more of a gateway drug than anything imo.\n\nGot drunk. Tried \"horrible will kill you and ruin your life drug called cannabis\"\n\nGot high and loved it. Realized DARE was a big lie. Now I'm more open to trying things than I ever was (but I've only tried weed. I'm more than happy sticking to it)",
                                    "score": 43,
                                    "author": "Spoiledtomatos",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Mushrooms are worth a go. Great for a sunny day at a cottage with friends",
                                            "score": 36,
                                            "author": "peoplewhoexist",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah, agreed. I don’t remember the study but the LD50 of psilocybin was really fuckin high. Like, very rare cases of harm in any amounts. Most deaths attributed to “magic mushrooms” were from people picking the wrong mushrooms and getting sick from consuming them. Also the “natural” attribute is really appealing to some people especially when psilocybin is compared to LSD. I don’t know why. Plenty of natural shit is real fuckin bad for you.",
                                                    "score": 14,
                                                    "author": "Ner0Zeroh",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I think in moderate amounts, you feel more in control than what you might with LSD, and that is appealing. I also got a lot 'gigglier' on shrooms than LSD, which was super fun.",
                                                            "score": 6,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "It really is because it's a drug that reduces your inhibitions to the point you'll try stuff you normally wouldn't. Almost everyone I know did coke their first time while drunk.",
                                            "score": 4,
                                            "author": "MagicalChemicalz",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Isreal is one of the few places to have actual research on Cannabis",
                            "score": 10,
                            "author": "Madman4sale"
                        },
                        {
                            "level": 2,
                            "comment": "I think I remember hearing a while back that Israel has years of medical cannabis research. Could look into that if you want to know more.",
                            "score": 7,
                            "author": "KadenKraw",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Technically, we can't even definitively say that cannabis has beneficial effects. This [paper's](https://static1.squarespace.com/static/55862101e4b04f6516e14908/t/5ab7c1f2f950b7f8f164bcda/1521992178722/Medical+update+march+2018.pdf) helpful if you're interested. Most studies don't use flower to test \"cannabis\", with the vast majority (&gt;95%) using isolates or edibles and most are sloppily conducted with questionable methods such as not recording dosage, method of administration, and using questionnaires to gather any \"results\" that can't be physically measured. The latter isn't really their fault since most cannabis effects are subjective and have opposite effects of other people. This is a long way of saying none of the research that's been done up till now can be taken seriously, and it'll take another long while before well-designed studies are actually conducted.",
                    "score": 65,
                    "author": "failure68",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 13,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The ratios of isolates can be just as important as the effect of each of them alone. There are a lot of CBDs and such. Like even studies on THC; is it just delta 9 THC? Or the whole full spectrum THC profile?",
                                    "score": 2,
                                    "author": "Funkit",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yeah, I'm wondering how studies will deal with the subjective effects, never mind the health effects that are going to be hard to pin down (probably more significant results than \"nutrition science\", but still enough uncertainty to push the psychology of the week about the effects). I don't think any scientific source is going to argue that cannabis is amazing for you, but I think compared to so many of it's contemporaries it's going to be hard to link it with any obvious adverse health affects in any but the heaviest users.\n\nWhat I'm more interested in are any overlooked side effects, like what feels to me like a \"hair of the dog\" problem, where a fun evening with cannabis is followed by a subtle \"bummed out\" feeling the next few days, that can be alleviated by more weed! I think some people prone to anxiety might be self-medicating and not realizing they've given themselves the equivalent of a coffee addiction for something they smoke. Or the second time I had some I had a \"depersonalization episode\", which I'd learned was documented, but not widely discussed. I've gone on to find out one of my friends also had one, and they can be deeply unsettling.\n\nOf course any and all of this is pure speculation, which is why I'm so excited to see what well documented research can uncover.",
                            "score": 6,
                            "author": "mrthescientist"
                        },
                        {
                            "level": 2,
                            "comment": "It will also, like any other major product, have a $billion+ industry that would prefer you say one thing and not another, both lobbying for limitations on the research or putting out their own to control the narrative (much like I think is happening with vaping right now).",
                            "score": 21,
                            "author": "businessbusinessman",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Multiple studies not funded by vaping companies have found that the dangers of vaping are about 5-10% that of smoking, most on the lower end.\n\nWhich is still bad, but to people who quit smoking cigarettes' by using a vape, that is quitting cigarettes and is a huge step.",
                                    "score": 5,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I would imagine so. We are well aware that marijuana has a tangible effect on memory, learning, and concentration just by seeing these improve following a month of abstinence in heavy smokers. I resent the DEA for lying to us and not allowing real science. I wish I never started smoking weed but there was no real science I could find as a teen saying it was bad for you. All I knew was that DARE was full of scare tactics and lies and I attribute that partially to my lax attitude towards drugs during a time when my brain was developing.",
                    "score": 128,
                    "author": "godlords",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "100% this. If \"drugs\" had been normalized and not stigmatized while I was younger, and I was actually informed on the real effects, I probably wouldn't have started using anything at all. Of course once I tried weed and found out DARE was wrong, I wondered what else they were wrong about...",
                            "score": 79,
                            "author": "ThatNustaBusta",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Comon. I mean I get what you're saying, but could you imagine if they really told us what it feels like to be on MD, cocaine, mushrooms or acid. You wouldn't have wanted to try it? \n\nIf someone told me, \"guys, mushies make you feel a little sick at first, then a wonderful feeling of euphoria comes over you. Followed by, mild hallucinations, laughing and amazing body buzz.\"\n\nI'd be first in line for that shit.\n\nNow if they taught you how to dose properly. That would be some helpful advice.",
                                    "score": 38,
                                    "author": "sumalumadingdng",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You raise a fair point. Maybe if they focused on just telling the facts without trying to be ultra descriptive? Really a difficult question to answer.",
                                            "score": 14,
                                            "author": "ThatNustaBusta",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Conversely, it may be that the thc/cbd/\"canabanoins\" might actually be the medicinal component and the heath benefits might be significantly better when you  have a better quality sample. The problem is that we don't know either way as they have kneecapped the studies.",
                    "score": 33,
                    "author": "hatchard9",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "FYI, people have been making the claim that cannabis is way more potent than it used to be since the 50s. Some guy put together these claims over the years and found that cannabis potency increased over 12,000 times over, which is ridiculous.\n\nYes, you can grow and breed strains to be more potent, however you cant selectively breed a strain to go from .01% THC to 30% THC without introducing another strain. Cannabis has always been potent. People in the 60s and 70's used to get Colombian gold and other strains that were grown well and way more potent than anything on the street. It comes down to growing methods and genetics. A well grown plant (lots of light, good environment, good care) will always be more potent than a plant stressed/stunted plant, like the \"reggie\" we see from Mexico.\n\nAt the end of the day though, basing potency only on THC is incomplete. There are other cannabinoids that cause the \"high\" we feel. This explains why certain strains have different effects and why extracted THC has a much different effect than flower. This research hopefully will untangle some of these misconceptions. We have some states trying to limit cannabis by THC content, which is just misguided and unscientific, and genetically problematic.",
                    "score": 52,
                    "author": "123DRP",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A few years ago brother in law would only buy and smoke hydro. Saying the hydroponics always produced better weed. Then I had him try some homegrown from someone that Knew what he was doing. He wouldn't believe me when I said it was an indoor soil grow.  It all comes down to the growers. If they don't understand what they're doing, it's not going to reach it's full potential.",
                            "score": 10,
                            "author": "CrazyBakerLady"
                        },
                        {
                            "level": 2,
                            "comment": "You can selectively inbreed to get higher thc. Same reason why our OG Kush f6(s6) is higher THC % than the OG Kush we had 10-15 years ago. No need to introduce another strain:)",
                            "score": 15,
                            "author": "Gushing69Granny"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Maybe researches can finally learn more about Cannabinoid Hyperemesis Syndrome. That shit sucks!",
            "score": 156,
            "author": "TheRedEyedSamurai",
            "replies": [
                {
                    "level": 1,
                    "comment": "Omg THIS. I came here to say the same thing I'm so glad there are others. Worse I've ever felt in my entire life I just hope it can be prevented for others",
                    "score": 67,
                    "author": "mtheory7",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "For real! I had my first episode after smoking for almost 2 decades just this past weekend, aaaaand now I don't smoke lol",
                            "score": 48,
                            "author": "TheRedEyedSamurai",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 27,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Hahaha fuuuuuck",
                                            "score": 9,
                                            "author": "TheRedEyedSamurai"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Literally the worst. Went to the E.R twice after horrific vomiting for days while I was smoking away the pain not realising it was the causeLOL",
                            "score": 7,
                            "author": "xxx_izzy_xx"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Same. Worst experience of my life, and the only time I'm grateful I don't currently own any firearms; as I would've blown my brains out. I've two episodes; both times hospitalized. 1st time was because I had no idea what was going on, and was so extremely dehydrated my kidneys were working to the max almost causing a seizure. I didn't know what to do. It was impossible to keep anything down; including water. 2nd episode was way worse, and through the sheer force of vomiting uncontrollably for 14+ hours I caused a pneumothorax (collapsed lung; requires a chest tube to reinflate). Anti-nausea meds aren't effective ( 7 dissolvable Zofran, and 3 Phenergan suppositories over 14hrs didn't do jack shit ).\n\nIt's been know since the '70s but it used to be referred to as \"Scromiting\". The act of screaming uncontrollably while vomiting. This shit is real and I feel betrayed by the one thing that has helped me soooo much over the years. Bud.",
                    "score": 7,
                    "author": "Belfastscum",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "CHS gang checking in 🤙",
                    "score": 5,
                    "author": "DICK_SIZED_TREE",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Gang gang, brotha 🖖",
                            "score": 5,
                            "author": "TheRedEyedSamurai",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I had a friend who had cyclic vomiting syndrome and started using weed to help. Then she started all over again and would smoke more and more and it only got worse. We even lost contact for a while. Then at some point she gave up smoking and both were gone. Turns out it was CHS. It was crazy. I'd love to know the why's behind it, and for people to not have to go through that.",
                    "score": 6,
                    "author": "Career_Much",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "This would be fantastic if they could find a way to treat this. When I smoked daily (I no longer do) I’d wake up every morning vomiting but when I cut it to weekends only I’m fine. Would be nice to be able to find some remedies as it’s extremely uncomfortable.",
                    "score": 26,
                    "author": "uLoveTW",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sounds like the remedy is not smoking every day...\n\nI mean if you drink every day, you get sick too.",
                            "score": 65,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "What’s that?",
                    "score": 4,
                    "author": "IHaveNoHoles",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I've been conducting studies in real-world cannabis since 2007.",
            "score": 23,
            "author": "captainpicard6912",
            "replies": []
        },
        {
            "level": 0,
            "comment": "The lab rats are gonna be like god damn this is some good shit",
            "score": 69,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "This is one of those baby steps and personally I think they need to just rip off the bandaid.",
            "score": 116,
            "author": "TheDeadlySquid",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 18,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "That looks like the grass that gets caked under my lawnmower.",
            "score": 81,
            "author": "lynivvinyl",
            "replies": [
                {
                    "level": 1,
                    "comment": "Gets you blazed just the same too, if not more than the rabbit food above.",
                    "score": 20,
                    "author": "MidnightMath"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That’s great for the researchers.",
            "score": 11,
            "author": "TerranOrSolaran"
        },
        {
            "level": 0,
            "comment": "Damn lol you couldn't pay anybody I know to smoke that shit",
            "score": 11,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "It’s about FUCKING TIME",
            "score": 8,
            "author": "DankNerd97"
        },
        {
            "level": 0,
            "comment": "I wonder if this means they'll loosen handling procedures for cannabis. \n\nI work at a preclinical research lab (in a support role). They have a space in the building where they keep schedule 1 substances, and if you're doing anything with them you have to fill out paperwork, which includes weighing the dose before and after administration.",
            "score": 9,
            "author": "necroman12g",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Can we please just legalize already and stop this stupid reefer madness bullshit? The war on drugs is over, drugs won",
            "score": 6,
            "author": "coreyosb",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Boomers smoked yard trimmings i s2g",
            "score": 44,
            "author": "sweetperdition",
            "replies": [
                {
                    "level": 1,
                    "comment": "We accelerated the plant’s evolution by selecting for increasingly higher THC content. \n\n[The mids they smoked looked like this.](https://www.reddit.com/r/trees/comments/72jv1q/high_times_top_strains_of_1977/)",
                    "score": 23,
                    "author": "123bpd",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "The way this is",
            "score": 5,
            "author": "GueyLou"
        },
        {
            "level": 0,
            "comment": "where's that original MMJ patient who has been smoking the shake the DEA has been growing for decades",
            "score": 5,
            "author": "whochoosessquirtle",
            "replies": [
                {
                    "level": 1,
                    "comment": "2 are still alive, but only 1 is still in the program. Elvy Mussika lives in Oregon now, so she goes to the dispensaries, but Irvin Rossenfield still gets his giant tin every month lol.\n\nhttps://www.celebstoner.com/blogs/steve-bloom/2021/03/16/federal-cannabis-patients-elvy-musikka-irvin-rosenfeld/",
                    "score": 7,
                    "author": "rml23",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Great. Now dismiss the convictions next 🙌🏼",
            "score": 4,
            "author": "aLittleKrunchy"
        },
        {
            "level": 0,
            "comment": "Finally. We will actually have more reliable data on the impact of weed because there is not as much danger as people say there is. \n\nThe biggest issue is being under influence while doing something you shouldn’t do like driving, which doesn’t make sense to have banned weed for so long. You criminalize the action based on their poor choices at the time. Weed may have been the cause but so is alcohol for drunk driving yet we don’t dare to criminalize alcohol again.",
            "score": 5,
            "author": "waitmyhonor"
        },
        {
            "level": 0,
            "comment": "Imagine that, the DEA being shit at growing weed...",
            "score": 3,
            "author": "TheBravan"
        },
        {
            "level": 0,
            "comment": "We’re all fucked when scientific researchers find negativity on smoking weed",
            "score": 3,
            "author": "Mcallrobert"
        },
        {
            "level": 0,
            "comment": "Now as long as they don't find out that high THC makes your dick shrink or something",
            "score": 4,
            "author": "Jim_Dickskin"
        }
    ]
}