{
    "id": "p93hr9",
    "score": 59584,
    "title": "U.S. Administers 1 Million Vaccine Doses For Third Straight Day!",
    "author": "BlazingSaint",
    "date": 1629595768.0,
    "url": "https://www.reddit.com/r/UpliftingNews/comments/p93hr9",
    "media_urls": [
        "https://news.yahoo.com/u-administers-1-million-vaccine-170531503.html"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "This [submission](https://news.yahoo.com/u-administers-1-million-vaccine-170531503.html) by /u/BlazingSaint has been automatically locked, since it has passed it's 48 hour thread participation time. No further comments can be made by users. \n\n#^I ^am ^a ^bot ^and ^this ^action ^was ^performed ^automatically. ^Contact ^the ^moderators ^instead!",
            "score": 1,
            "author": "upliftingnewsbot"
        },
        {
            "level": 0,
            "comment": "I personally know 2 people who got their first shot this week.  I don't know exactly what changed their minds, but I'm glad they are finally on board!",
            "score": 4450,
            "author": "foxfiregrrl",
            "replies": [
                {
                    "level": 1,
                    "comment": "A lot of college students are getting shots.\n\nKids who weren't really anti-vax but just didn't interact much with the healthcare system.  Mandates for starting classes, or even just being on a campus and walking past a location offering on-the-spot shots...\n\nI know that's how I got my first flu shots years ago.  I just walked past a table with people giving them out for free and I was like ok why not?",
                    "score": 1672,
                    "author": "pinniped1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is how I convinced a coworker.  He wouldn't be bothered to schedule an appointment back in the early days.  I asked if he would get the shot the first time he saw it available walkup with no line and he agreed and got it done :-)",
                            "score": 537,
                            "author": "WaffleFoxes",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I got my second one at the local grocery store. I waited longer in line to pay for my 3 items than I did for the whole procedure to get my shot.",
                                    "score": 242,
                                    "author": "OutWithTheNew",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Same! I called to see if they had Pfizer (it was low supply here for second dose), she said they did and had time the following day. Went down, grocery shopped while I waited the 15 minutes, then waited longer in line to pay then I had for the shot lol",
                                            "score": 22,
                                            "author": "LeafsChick",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Feels ridiculous but I had a great experience in a grocery store too.",
                                                    "score": 7,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It's so weird that there are so many countries who either lack the vaccines or lack the infrastructure to distribute the vaccines, but here we are throwing out thousands of doses a day, about a million doses since the vaccination started. We can walk into a grocery store, which I ought to say sounds bat shit insane for what less privileged people need to do to get a shot, and just get a shot while we are on a grocery trip. Oh, and I'm getting $100 just because I got fully vaccinated, like I'm putting forth an effort to get my arm pricked and to not kill my parents inadvertently.",
                                                            "score": 10,
                                                            "author": "PM_ME_CLEVER_STUFF"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "My kid's future college is offering $250 and entry in prize drawings if you submit a copy of your vaccine card to health services. Good prizes - a Keurig, tv, airpods, etc. What student isn't going to take advantage of that deal? *edit: apparently are now adding $5k in scholarships to the prize list.",
                            "score": 214,
                            "author": "smom",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I won a free ipod shuffle by filling out a campus survey. I figured no one else would be bothered to fill it out and I won.",
                                    "score": 58,
                                    "author": "subscribedToDefaults",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Lol ours is just forcing everyone as they should.",
                                    "score": 161,
                                    "author": "MoveInside",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 72,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 30,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "My college is giving out 160 raffled laptops to students and employees who get vaccinated(we have grant money that can only be used for tech like this).",
                                    "score": 26,
                                    "author": "zerotorque84"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Must be weird for Americans to experience getting free medicine for like the first time ever.",
                            "score": 556,
                            "author": "spankingasupermodel",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It was tbh. Just kinda show up somewhere and get medicine for free?\n\nAnd I visited Canada and had to get a COVID test prior to entry and *that* was free too.",
                                    "score": 266,
                                    "author": "bdonvr",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You know what’s weird? I’m a Canadian who has been travelling back and forth to America for work. I need to get a Covid test every time I get on a plane. In Canada I have to pay $140 to get the test, yet in America it’s free. That seems really odd to me",
                                            "score": 153,
                                            "author": "Swazimoto",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It's also complete nonsense that Americans can drive or fly into Canada for pretty much any reason now, but Canadians can only fly in (edit: into the US) unless they have an essential purpose. \n\nLike what's the point of letting Canadian tourists fly in but not drive in? Especially if Americans can go the other way",
                                                    "score": 87,
                                                    "author": "bdonvr",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt; but Canadians can only fly in unless they have an essential purpose.\n\nThey can fly back for any reason and I think they always could as long as they could get a flight, they just have had to follow procedures like a quarantine time, as do people who drive back. Most of those are now rescinded.\n\nCurrent situation: https://travel.gc.ca/returning\n\nFor an earlier example: https://www.snowbirdadvisor.ca/canadian-snowbirds-checklist-everything-you-need-do-heading-home\n\nSome assholes were even going on holiday to Mexico during the pandemic. I know of a few who got stuck there for weeks after they tested positive before their return flight.",
                                                            "score": 16,
                                                            "author": "EverythingIsNorminal",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "American made tests imported to Canada? I know import fees are kinda crazy US to Canada",
                                                    "score": 8,
                                                    "author": "solerex"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Congress passed a law that made Covid tests and vaccines free. It’s pretty much the only thing free in our healthcare system. I assume many uninformed Americans don’t even realize this even though it’s been said often. They are so used to sticker shock when getting medical treatment that it’s hard to believe.\n\nIn not sure how normal it is, but all vaccines are free under my insurance. Last year I was getting a flu shot at my local pharmacy and they asked me if I wanted shingles and a couple of other vaccines. I asked how much and they said it was free with my insurance. I got everything they were offering.",
                                                    "score": 9,
                                                    "author": "SummerLover69",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Some people are suspicious of the vaccine cuz of this...",
                                    "score": 51,
                                    "author": "farshnikord",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yeah I didn’t get any flu shots during college. Not because anti vaxx, but because I was just incredibly lazy. Still am, if my primary care physician didn’t ask and offer every free visit I get I wouldn’t get them now either probably. And I’m the only one of my coworkers that actually goes to their doctor once year for a checkup, lots of people like me but even lazier.\n\nThat’s not to detract, I’ve had the flu shot every year since starting a job, but really that’s because for whatever reason these are more accessible to adults. My job will bring people in to do it, yet that never happened in college that I remember.\n\nSometimes people will do it but you have to basically not make them go out of their way",
                            "score": 63,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Think I convinced a guy who recently started working with me.",
                    "score": 1819,
                    "author": "lastMinute_panic",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not all heroes wear condoms!",
                            "score": 858,
                            "author": "Muthafuckaaaaa",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They say condoms keep you and your partner safe.\n\nDidn't work at all. We both just got robbed and we always wear them.",
                                    "score": 133,
                                    "author": "FirstEvolutionist",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You're supposed to throw them at the robbers, and yell \"guess that smell!\"\n\nYou silly goose, you.",
                                            "score": 57,
                                            "author": "B-BoyStance",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Common misconception. \n\nYou are supposed to put them over your head, down to the nose, inflating it between yells and waiving your arms in the air, this is to make you seem bigger and more intimidating to any would be robbers.",
                                                    "score": 28,
                                                    "author": "lockon345",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Sounds like a common *miscontraception* to me",
                                                            "score": 28,
                                                            "author": "the_grAyLIEN"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 150,
                                    "author": "[deleted]",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Really? \n\n*takes off condom*",
                                    "score": 6,
                                    "author": "5starkarma",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Hospitals all across California are requiring their workers to get vaccinated or be suspended without pay, and after some elapsed time, termination. This is from Kaiser and this is what the union agreed too. My place of work requires vaccination with only exceptions to religious beliefs or medical exemptions. But they get to have things shoved way into their noses twice a week. How fun.",
                    "score": 76,
                    "author": "DNxLB",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I know my work said to get the shot or start looking for another job",
                    "score": 244,
                    "author": "Sped_monk",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Same, I had a virtual meeting with my HR rep last Thursday to show her my vaccine card. Either a lot of the older conservative employees are going to get their shot, or all of those sweet promotional opportunities are going to start showing up on the job board.",
                            "score": 73,
                            "author": "flailypichu",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I wish you luck in your new supervisory role!",
                                    "score": 37,
                                    "author": "GiraffeGlove"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Mine too and couldn’t be happier about increasing the proportion of people I encounter being vaxxed. However they’re allowing for “reasonable religious exemptions.”  Not sure how an employer (or anyone for that matter) is supposed to determine what’s a “reasonable” religious exemption is for placing your own and other’s lives at risk.",
                            "score": 89,
                            "author": "DP4Insurrectionists",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "As far as I am aware there are only a handful of faiths that hold any sort of anti-vaccination beliefs:\n\nhttps://www.vumc.org/health-wellness/news-resource-articles/immunizations-and-religion\n\nNotably Jehovah's Witnesses stopped being against vaccination many years ago, leaving almost no religion strictly against all vaccines and most simply having issues with certain ingredients.\n\nEven the Jains (who preach non-violence at the bacterial level) admit that vaccines are necessary.",
                                    "score": 79,
                                    "author": "Korlus",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Do Jains also care about Viruses?  Cause that's a level bellow bacteria.",
                                            "score": 11,
                                            "author": "sirxez",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "To quote the article linked:\n\n&gt;Jainism - Jains follow a path of non-violence toward all living beings including microscopic organisms. Jains do allow cooking, the use of soap and antibiotics, and vaccination, because this destruction of microorganisms, even though regretted, is necessary to protect other lives.\n\nI am not an expert in Jainism, so cannot elaborate further.",
                                                    "score": 29,
                                                    "author": "Korlus",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Interesting. Technically, a virus isn’t a microorganism; in fact, they can infect microorganisms, and bacteriophages are a thing, so one could argue that eliminating viruses actually helps life at every level.",
                                                            "score": 6,
                                                            "author": "mittenciel"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "The religious exemption form for my university (public) doesn't even ask you what religion you are. You don't even have to write a statement. They have a pre-written statement that you just sign and it gets approved.\n\nYou don't have to give any information and you don't have to give any proof. It is just a catch-all for anyone who doesn't want the mandated vaccine, making the mandate useless.",
                                            "score": 9,
                                            "author": "Psmpo",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I know some employers are making sure it is a real religious exemption based on doctrine within the employee’s faith. To do this as part of the exemption form they are asking for a personal letter from their clergy member along with the specific notation of the doctrine that prohibits vaccinations.",
                                    "score": 40,
                                    "author": "PersnicketyHazelnuts",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "One of my employers has Catholic affiliation and the boss has the pope’s speech about vaccines being necessary and the Catholic thing to do ready to go anytime someone tries to tell him it’s a religious exemption because people are bizarre. Funnily enough once confronted, about a week later most have gotten vaxxed.",
                                            "score": 34,
                                            "author": "Stromboli61"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "My partner explained to me, at least in  our state/area, that background checks are being done to discover established customs and adherence to their proclaimed religion when folks by her claim religious exemptions for the vaccine.",
                                    "score": 44,
                                    "author": "Zaemz",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I saw a woman online complaining about getting discharged from the marines for not getting the vaccine and not wearing a mask. She said it was against her religion. Well, apparently didn't prevent her from getting vaccines before when she signed up (strike one) and marines wear masks all the time for all sorts of protective reasons (strike two) plus there's no religion that has \"don't wear masks\" as a tenet so if she converted to a religion that forbade vaccines then she could still wear a mask (strike three).",
                                            "score": 37,
                                            "author": "HarpersGhost"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My best friend is getting hers on Monday. She messaged me that she was considering it and wanted some info. I did my best, and she has decided to go Monday. So happy to see people changing their minds. I’m from Tennessee and lots of friends and family still aren’t vaccinated.",
                    "score": 81,
                    "author": "delij",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Same here. Had at 2 of 4 different people at my work who were antivax go get their shots. One of the other two already had Covid and the last one is a smoker who won't go because it gave her mom bells palsy. Lady is a smoker and is going to a trade show soon for 3 days, but won't be vaccinated. I don't want to be around her when she gets back.",
                    "score": 9,
                    "author": "Hillbilly_Boozer"
                },
                {
                    "level": 1,
                    "comment": "A friend of mine owed me 100 bucks, I told him to forget he owed me if he got the vaccine. A week later he sent me his vaccine card for proof. Gotta get everyone on board!",
                    "score": 49,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Damn, thank you for your service!",
                            "score": 11,
                            "author": "ScorchedUrf"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "If I didn’t get my second one I would have lost my job, can’t really afford that",
                    "score": 8,
                    "author": "shotmaster217",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "A guy on my FB feed who was anti-vax said he got one to make his life easier to go to bars and concerts. If more places make it hard on individuals who aren’t vaccinated, they will definitely be broken down after enough of their life is made hard. I hope more leisure and work places continue to mandate it.",
                    "score": 100,
                    "author": "dat-dudes-dude",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "France went from 40% to 70% fully vaccinated in the few weeks following the announcement that a  vaccine passport would be government mandated to do basically anything. The appointment booking site crashed immediately following Macron's announcement lol. Im quite pleased with it and feel slightly relieved that another lockdown is starting to seem less likely.",
                            "score": 80,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "A lot of anti-vaxxers \"deeply\" held beliefs go away or go into the background with modest inconvenience. Giving some credence to the idea that a big part of the faction are just people who are afraid of needles and want a framework to justify that. Without saying it's a fear of needles.",
                                    "score": 36,
                                    "author": "kingmanic",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My buddy was against getting the vaccine, until yesterday.  He got a girlfriend and she likes going to raves/ raves are requiring vacccine to get in. 😂 he’s getting the vaccine to keep his girlfriend happy and be able to join her at this upcoming rave",
                    "score": 69,
                    "author": "SharkTankBets",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Same with a bro of mine, but he's looking to fake the vaccine card. I really hope they don't let people get away with this purely because I'm an ignorant person who abides by laws. I don't like that others don't have to play by the same rules that I do in America.",
                            "score": 4,
                            "author": "Jumpi95",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I got my first shot on Friday after moving out of my parents place. Mainly, I was super busy these last few months and was worried about the symptoms killing a few days of productivity. Didn't help that my parents are against getting the vaccine for themselves and their children.",
                    "score": 49,
                    "author": "reactor_core"
                },
                {
                    "level": 1,
                    "comment": "Vaccine passports.\n\nAnd the daily news of some antivax radio host dying.",
                    "score": 85,
                    "author": "neuroticandobscene",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "My wife and I’s entire friend group wasn’t vaccinated until a week or so ago. My wife is a nurse and she brought up a good point, a lot of corporate jobs are requiring it now just like the hospitals are",
                    "score": 26,
                    "author": "PmMeYourNiceBehind",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I only recently got my first.  I tried getting a few appointments months ago and it was booked up for such a long time I stopped trying.  I don't interact with many people so it was not a huge concern so I waited and maybe forgot about it a little bit.\n\n\nI'm pro-vax.  People infinitely smarter than me invented it and it's such an obvious benefit for \"society\" with 0.000....0001 risk of complications and next to no effort on my part.\n\nIt's not like my opinion changed or I only did it because my employer demanded it.  There are 16 million medical related jobs.  Those should probably been the first vaxxed.  22%  of the usa are under 18 and 17% are over 65.  Together almost 40% of the total population are outside working age in the usa.  The young ones can't get it and the old ones should.  I'm outside of both those categories.   All my grandparents have been dead 20+ years even though I'm only 36.  I'm not risking anyone by delaying it.  The handful of people I interact with aren't terribly at risk sorts.\n\nI don't interact with eldery or children or even that many ordinary adults.  Don't go bar hopping.  I go to the grocery store, and that's about it.  I'm not completely incompetent and if I could get a syringe mailed to me I'd be able to inject myself with the vaccine.",
                    "score": 54,
                    "author": "Luxpreliator",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 27,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Booster shots have only recently been cleared for immunocompromised individuals. Although I suspect that might also be a reason we're seeing an uptick in shots too. That just went live in a lot of places that just had open availability.",
                                    "score": 12,
                                    "author": "Notsurehowtoreact",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[Houston offers $100 Incentive for people receiving their 1st dose ](https://abc13.com/how-to-get-100-cash-incentive-paid-for-vaccines-covid-lina-hidalgo/10957081/)",
            "score": 2474,
            "author": "Qtqp_Alma",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was just about to comment, we got a couple grand a piece out of this thing and the world didn't collapse. Why not just bribe morons with like 3 grand each to just get vaccinated? \n \nAlso hook it up for those of us who aren't dipshits and already got vaccinated..",
                    "score": 1471,
                    "author": "Gandalfthefabulous",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There should be one more round of stimulus checks for vaccinated adults.",
                            "score": 1487,
                            "author": "LingeringSentiments",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm having trouble finding issue with this.",
                                    "score": 575,
                                    "author": "TenderizedVegetables",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Using the carrot, and the stick.\n\n\"If you don't claim your check, the allocated amount will be donated to feed hungry children, their medical care, green energy or something. Get the jab, claim your check, or else we'll fund socialism with your cut.\"",
                                            "score": 735,
                                            "author": "RussianRenegade69",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "\"if you don't claim your check, the funds will be allocated to LGBTQ+ charities\"\n\nI'm sure there's more than a few homophobes in the unvaccinated population.",
                                                    "score": 397,
                                                    "author": "flapadar_",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Or Planned Parenthood!",
                                                            "score": 174,
                                                            "author": "rnmba",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "The only issue is that it unfairly excludes the very few people that legitimately cannot get the vaccine due to known allergies. You can fix that, but it's tricky to do that in a way that doesn't let the bozos exploit it.",
                                            "score": 103,
                                            "author": "squid_actually",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "For people who can’t get the vaccine themselves, other people around them getting vaccinated is worth much more than a stimulus",
                                                    "score": 101,
                                                    "author": "silversurfer-1"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "It doesn't matter if it's fair. Especially if it's a small percentage of the population.\n\nIt can be unfair to a small part of the population and still be good public policy that benefits everybody. \n\nAs a single person, I don't get any tax credits/rebates for food benefits for children, but I still benefit from having a society where kids have enough food to eat. \n\nThe people that can't get vaccinated would benefit by having hospitals stay available.",
                                                    "score": 80,
                                                    "author": "fuzzyp44",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt; As a single person, I don't get any tax credits/rebates for food benefits for children, but I still benefit from having a society where kids have enough food to eat. \n\n\nAh, a person who's happy when others receive benefits that they don't, simply because it creates a better world for everyone. \n\n\nThat's always uplifting news",
                                                            "score": 46,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Some people would call him a sucker.\n\nMost would call him a good person.",
                                                                    "score": 16,
                                                                    "author": "[deleted]"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "If they don't it'll just incentivize people to wait for payment during the next crisis.",
                                    "score": 36,
                                    "author": "HereIGoGrillingAgain",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "They've already set that standard with these $100 payouts",
                                            "score": 11,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "With a lot of companies it's now becoming required for work. The new standard will be keeping your job, not the $100 or lottery ticket.",
                                                    "score": 17,
                                                    "author": "LowSkyOrbit",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Honestly, the mere fact that it's necessary to pay/offer shit to some people to get vaccinated is mind-boggling, but at the same time, I see a fuck ton of dumb comments about it or masks, or even covid in general in social media from your folks, that makes it scary how dumb some people are. The amount of disinformation is just out of this world.",
                            "score": 120,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I just lead a vaccine drive on Friday in a rural Missouri town. We had grant money to give out $100 to each person. Ended up doing 60 people in a tiny town, 95% were African American which is awesome because that demographic is one of the least vaccinated. Offer money and people will dive at that shit!",
                    "score": 48,
                    "author": "Barnaby_Jones",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I got my months ago. They're going to mail the $100 to those who got it earlier too, right?\n\n... Right?.. 😩",
                    "score": 93,
                    "author": "Betorange",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hey, at least you didn't need to be bribed into doing the right thing",
                            "score": 34,
                            "author": "DextrosKnight",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Nah but your many months of extra immunity is worth not getting that $100",
                            "score": 49,
                            "author": "DebentureThyme",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Nyc has this too. I hate it. Rewarding the dummies and making the paranoid even more paranoid.",
                    "score": 270,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not really. NYC is giving $100 per person for community and faith organizations who refer people to get the vaccine. Basically, if a church or an community center gets it's members to the vaccine, and include the referral code in their appointment, then that church or community center gets the $100 per person. Houston is just straight up giving the money to people who go.",
                            "score": 74,
                            "author": "OreoCupcakes",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This isn't true. They have an additional referral reward program for organizations like you're describing, but anyone getting their first shot at a city run vaccine site personally receives a $100 prepaid debit card (or one of the other rewards on the list).\n\nThis [city government site](https://www1.nyc.gov/site/coronavirus/vaccines/vaccine-incentives.page) has details on both programs.",
                                    "score": 31,
                                    "author": "fafalone",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 73,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Astros cheated.\nOn the other hand, it's $100 to not potentially be on a ventilator and having regrets on your dying breath.",
                    "score": 215,
                    "author": "vguy72",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 51,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The payoff for getting the vaccine early is worth way more than $100.",
                                    "score": 17,
                                    "author": "matt_mv",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Say what you will but I play games with a dude who isn't a anti Vax but just lazy as fuck , the 100$ got him off his ass to do because he figured it was a good way to buy a bunch of shit in gneshin impact . If bribing idiots works I say do it",
            "score": 376,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 40,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You can’t expect everyone to be a contributing and useful participant of society.",
                            "score": 25,
                            "author": "IlIlIIIllllIlIllIlII",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I just spent some time with my conservative side of the family. About half of them just recently got the shot for various reasons but I'm encouraged by that.",
            "score": 449,
            "author": "JackWright13",
            "replies": [
                {
                    "level": 1,
                    "comment": "unfortunately the closest grocery store to me is a Walmart and I live in Tennessee. Last week, masking inside the store was probably at about 10%. Yesterday, without any new mandates in the store, it was at about 30%. Maybe reality is finally sinking in for some people who realize they’re afraid to die and that it’s a nonzero chance.",
                    "score": 65,
                    "author": "biIIyshakes",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Same here. Last year they were vehemently against it. They all are now either fully vaccinated or have appointments to go. \n\nMy mom got covid and it nearly killed her. She isn’t out of the woods yet. She got the first dose a week before she got sick and says that she honestly thinks had she not gotten it, she’d be dead.",
                    "score": 27,
                    "author": "anonymoose_octopus"
                },
                {
                    "level": 1,
                    "comment": "I got my conservative roommate vaccinated. Felt pretty good about that",
                    "score": 28,
                    "author": "degenerati1",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "That's so cool bro!",
                    "score": 36,
                    "author": "Tightgary"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I got mine so long ago I forgot people in this country were still getting them tbh",
            "score": 1575,
            "author": "eman00619",
            "replies": [
                {
                    "level": 1,
                    "comment": "I got mine so long ago I have to get a booster soon.",
                    "score": 647,
                    "author": "ReservoirDog316",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Same. Come Monday morning I'll have to ask my nursing supervisor when we can get our boosters. I got my first shot in December.",
                            "score": 127,
                            "author": "dm_me_kittens",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "September. 8 months after your second dose",
                                    "score": 18,
                                    "author": "jesszillaa"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Remember to keep an eye out for booster shots!",
                    "score": 121,
                    "author": "ThePelicanWalksAgain",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They're going to be available next month",
                            "score": 7,
                            "author": "UniqueElectron"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "A million a day keeps the pandemic at bay",
            "score": 583,
            "author": "thrownoutta",
            "replies": [
                {
                    "level": 1,
                    "comment": "Or you have 1.3 bn people, hit 4mn a day for 45 days and still aren't even barely at 40% for one dose.\n\n*Sad India noises*\n\nThough our surge from Sept mid when production catches up is going to be super impressive, 7-8 mn is the daily number projected going up to 10mn daily by Dec",
                    "score": 81,
                    "author": "RajaRajaC",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The dip in deaths in India is the hope I’m clinging to her in the US. I wish people who are so anti vaccine realized how awful it is to turn your nose up at what everyone else would stand in line for days to get. \n\nIt hurts the soul but this is so very encouraging. The hesitant (young, students) are protecting themselves. Good and thank you.",
                            "score": 29,
                            "author": "LongNectarine3"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "A couple of friends of mine are getting their last shot next week. They went to orientation for their son's school, there were no masks and everyone was all up on each other. That changed their minds and they got the first jab that day.\n\nMeanwhile my district is looking at an emergency meeting to reverse the opt out option on masks. In the first 10 days of school there have been 589 cases, compared to 20 this time last year with a mask mandate. Masks help. Get vaccinated please.",
            "score": 996,
            "author": "hotwife24",
            "replies": [
                {
                    "level": 1,
                    "comment": "School is starting in a week here and it will be interesting to see what happens since we are extremely rural, haven't seen many deaths at all, and almost always a couple of months behind everyone else in terms of what happens in the world. If we get hit hard enough, it could be devastating for my entire county.",
                    "score": 181,
                    "author": "LostWoodsInTheField",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Fingers crossed for you and your county. Hope everyone stays healthy. My county is one of the worst in the state. Our kids should be protected but our governor failed them.",
                            "score": 60,
                            "author": "hotwife24",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My county's schools have been in session for 2 weeks. 640 cases. They just closed the schools for two weeks. No virtual, no work sent home, just shut it down. No mask mandates either.",
                    "score": 129,
                    "author": "JaRoc",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm waiting for that to happen here this year. My county is one of the worst in the state. Our governor has a whole lot of blood on his hands.",
                            "score": 59,
                            "author": "hotwife24",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I love* how this does not actually narrow down where you live.\n\n*hate",
                                    "score": 48,
                                    "author": "bonnenuitbouillie",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You're right. I'm sorry about that. I'm in Duval County, Florida. Hopefully the school board here will give DeSatan the bird soon.",
                                            "score": 21,
                                            "author": "hotwife24",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[Yeah..](https://www.youtube.com/watch?v=RAPcSVeLKoE)",
                                            "score": 8,
                                            "author": "AmbushIntheDark"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Stay safe.",
                            "score": 6,
                            "author": "somethingwholesomer"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "A University near me has decided to prevent mask mandates and no hybrid options for classes. I'm pretty sure every student at that school is going to get Covid in the next 2 weeks.",
                    "score": 31,
                    "author": "Robinhood_Pumper",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Tell them to add it to the dress code. School has authority over what kids wear.",
                    "score": 6,
                    "author": "ByTheHammerOfThor",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "My work started an initiative to get 100% vaccination rate at our company. The options were provide proof of vaccination or have to wear masks everywhere.\n\nI know of at least 7 people getting their first shots this weekend!",
            "score": 167,
            "author": "EvenNoobier",
            "replies": [
                {
                    "level": 1,
                    "comment": "In my workplace they required proof of vaccination or required weekly testing submitted to HR. Its a hassle for the like 7 employees that have to do it. Everyone wears masks the full day too. One person left.",
                    "score": 5,
                    "author": "Moofabulousss"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was the one from Alabama\n\nEdit: whoa, my first award ever! Thanks!",
            "score": 353,
            "author": "Benoit239",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 47,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Nothing, I'm also the one liberal in Alabama",
                            "score": 67,
                            "author": "Benoit239",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What took so long to get it done?",
                                    "score": 20,
                                    "author": "Senior_Nebula_1308",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Did my third-shot Thursday (immunocompromised)",
            "score": 27,
            "author": "facw00",
            "replies": []
        },
        {
            "level": 0,
            "comment": "A person on my team got their first dose last week. They are immune-compromised and have allergy issues. They are mid 30s and healthy so their doctor recommended against it until now with delta. They got their shot at the allergists office just in case. It was a lot of extra steps but worth it to them now. I’m happy I will be able to worry about them less in a month.",
            "score": 22,
            "author": "VetPetManager",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I know someone who got it this week! They finally got the okay from their doctor (they were at risk, but with delta their doc was like \"do it now\")\n\nEdit: more context, they already had a BAD case of covid, almost died. Lungs and permanently damaged. So there was other reasons their doctor wanted them to wait",
            "score": 293,
            "author": "BeardedAnglican",
            "replies": [
                {
                    "level": 1,
                    "comment": "My sister was told by her doctor not to get them as she’s allergic to ingredients in them, has multiple circulatory issues, and her lungs are fucked from some kinda mold getting in them and getting pneumonia multiple times. She just works from home and stays away from people but she can’t do that forever. I tell people about her all the time cause they’re like ‘if you’re so worried about covid you can get the vaccine but I’m not worried.’ I’m not worried about me I’m worried about accidentally killing my sister cause some dipshit came to work with a ‘cold’",
                    "score": 9,
                    "author": "fae_forge",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Wondering what held their doctor back? I know people who are very immunocompromised who were still told to get it",
                    "score": 77,
                    "author": "BooksIsPower",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "One of my friends got told to wait by his doctor because his lungs are still heavily scarred from his bout of Covid and it sounds like his doctor wanted him stronger before dealing with the possible side effects. The idea was to let him heal and let the antibodies he acquired the hard way do their job. I haven’t asked if his doctor cleared him yet or delta changed anything but that was one situation. \n\nAlso I have no idea if his doctor was following best practices or not so don’t at me saying he’s wrong. Maybe he is. It’s still what he advised.",
                            "score": 67,
                            "author": "Findinganewnormal",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Physician here. The only time I would wait 90 days is if he got convalescent plasma or monoclonal antibodies as treatment to neutralize the virus. It unfortunately can neutralize the efficacy of the vaccine as well.",
                                    "score": 36,
                                    "author": "IronBatman"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "For a lot of immunocompromised people it's more uncertainty that the vaccine will actually do any good as their immune systems struggle to create the antibodies.",
                            "score": 90,
                            "author": "jordan853",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I predict a massive vaccine mandate once FDA officially approves the vaccine next week. Having a positive result for an employer is just a nightmare to deal with.",
            "score": 120,
            "author": "iTroLowElo",
            "replies": []
        },
        {
            "level": 0,
            "comment": "If we take the dismissive denialist talking point of \"only 1% die!\" and assume 90% protection that means today we saved \n\n500,000 first doses * \" only 1% fatality!!!\" = 5,000 deaths * 90% protection = 4,500 lives saved today thanks to vaccines.\n\nHurray for modern medicine.",
            "score": 419,
            "author": "im_thatoneguy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Get your fancy libtards math outta my Reddits",
                    "score": 120,
                    "author": "Relandis",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "According to this model it absolutely sucks to be part of the 500",
                    "score": 11,
                    "author": "aconditionner",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is because businesses are starting to require vaccinations so that you don't put your coworkers at risk. It is unfortunate that this is what it took.",
            "score": 265,
            "author": "vgacolor",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, I don't think people realize how many businesses are going to require it. \n \nWe've had a Dunkin Donut have to shut down twice due to COVID outbreaks among the staff. \n \nTwice. \n \nFor well over a week each time. \n \nImagine you're a business manager.  \n \nYou think fucking corporate is going to want unvaccinated workers?",
                    "score": 137,
                    "author": "friendlyfire",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "That’s business doing some business, baby!",
                    "score": 23,
                    "author": "BlazingSaint"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 5,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 6,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "My girlfriend and I both got ours Friday. \n\nI’ve put it off so long only because I’m a pussy when it comes to needles. \n\nI almost passed out, but I got it done. \n\nIf anything, it’s better than a $100,000 hospital bill.",
            "score": 1335,
            "author": "BRollins08",
            "replies": [
                {
                    "level": 1,
                    "comment": "My dad has a very real fear of needles. Like you can't even sew in the same house. Its the only shot I've ever known him to get. He had to be taken to a special room with people to pretty much hold him down. But he did it.",
                    "score": 552,
                    "author": "CharistineE",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I got my shot in a local pharmacy. Thought maybe they would have a room with a chair/table..\n\nNope.. I sat in one of the waiting room chairs with a newspaper in front of my face and a Gatorade in my lap.\n\nThe couple minutes after the shot were the worst part, that’s when I get flush and dizzy etc\n\nThankfully the pharmacy staff was awesome and they talked my through my white as a ghost phase.",
                            "score": 235,
                            "author": "BRollins08",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My parents went to a mass vaccination event at the convention center the week they were eligible last spring. My dad at first sat down as everyone did in the spaced out tables but it was clear that he would make a scene so they moved to an office. My mom was surprised he got it. And then repeated it a month later.",
                                    "score": 145,
                                    "author": "CharistineE",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Every one of these are feel good stories and it just shows you the type of character all these folks have. They put themselves directly in terrifying situations TWICE in a short period because it was so important. \n\nAnyone with a fear of needles or vaccines that goes through with getting one should seriously be applauded. As a fellow human, I thank you for doing what's right even though it was very difficult for you. It helps restore my faith in humanity a bit.",
                                            "score": 132,
                                            "author": "PMmeyourSchwifty",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Agree, my father is very needle phobic, he's 59 and I've never known him to get any sort of shot. Got his second jab this weekend. After the first one he kept saying \"I just couldn't believe how small it was, they kept showing this huge needle on the news!!\" He only watches Fox news.... Fucking vultures. \n   \n\nHe also only got the shot bc he cannot go to go the hospital or be around my son when he's born.",
                                                    "score": 9,
                                                    "author": "MotherOfCatses"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I’m sort of a classic low blood-pressure, high propensity for fainting type and at different times it manifests as an adverse reaction to blood or gore or discussions of medical procedures and quite often a fear of needles. BUT I could not wait to get my Covid shots, took them with a smile, sweaty palms, but a smile. Fuck it, when the time came I stepped up, whatever the future holds, I at least got that.",
                                                    "score": 22,
                                                    "author": "Whyevenbotherbeing"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I received both of mine at a mass vax clinic back in May, except it was a _drive through_ clinic in the local speedway parking lot. \n\nDrove in, never left the driver’s seat.\n\nThrew my arm out the window, jabby jabby, pull forward, wait 10 minutes in my car with a bunch of other people in their cars, drive away. \n\nPretty damn effective.",
                                            "score": 53,
                                            "author": "why_yer_vag_so_itchy",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Honestly as someone who is terrified of needles the drive thru method was great. I think it had to do with being in my car and it feeling way less clinical than going into an office",
                                                    "score": 33,
                                                    "author": "imawampus",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Needles are better than a possible breathing hole in your neck.",
                    "score": 110,
                    "author": "BABarracus",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Can confirm 200%. Had complications during my surgery and they had to vent me. Holy hell it was scarry as f waking up with tubes in my mouth. Also the weird as hell feeling as they pulled the seemingly long tube out of my throat. \n\nCan't even imagine if they had to go through neck.",
                            "score": 49,
                            "author": "____-is-crying"
                        },
                        {
                            "level": 2,
                            "comment": "Or 2 needles now better than the countless IV sticks and blood draws if you end up in the hospital.",
                            "score": 23,
                            "author": "half-agony-half-hope"
                        },
                        {
                            "level": 2,
                            "comment": "For those of us with an actual phobia of needles, it doesn't matter. It's irrational to begin with. It's not any comparisons or tricks to get over it. We just have to bite the bullet because we know we need to. It's an awful several days leading up to it, especially the second dose since the first experience was fresh in our minds from a few weeks ago. I'm glad my work just scheduled everything out for me so I didn't have to think too much about it.",
                            "score": 31,
                            "author": "raven12456",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Congrats! I too hate needles and got mine early on (frontline healthcare worker).\n\nHere to tell others that, even though I frickin cried, it was super worth it! I didn’t even feel my first shot, the administrator was that good! Just stay really hydrated - it seems to make most patients way thirsty for the first 24hrs, then some dizziness or nausea is common. You got this!!",
                    "score": 23,
                    "author": "NinjaMcGee",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I used to be one of you. Then my allergies got so bad, I started getting allergy shots. 3 shots *per week*. \n\nThe covid needle literally felt like nothing to me compared to the allergy shots. Although, the allergy shots are subcutaneous so they didn't hurt after the shots, like the covid shots did, being intramuscular.",
                    "score": 17,
                    "author": "mistaken4strangerz",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Got my second dose yesterday 😊😊😊",
            "score": 10,
            "author": "bxcawasp89MX",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Ayyye got my first shot on thursday.",
            "score": 66,
            "author": "Anarchopunk123",
            "replies": [
                {
                    "level": 1,
                    "comment": "Congrats!\n\nMind if I ask what held you off and then what changed your mind?",
                    "score": 22,
                    "author": "0hmyscience",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Depression and apathy. Thursday I was picking up my meds, and they were offering walk in vaccinations at the pharmacy so I got one. \n\nI have every other vaccine I'm able to get though. I even got the pneumonia vaccine at 22 bc I had it.",
                            "score": 55,
                            "author": "Anarchopunk123",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Good for you bud. We'll take a small win over depression anytime you can get one!",
                                    "score": 11,
                                    "author": "ScottieRobots"
                                },
                                {
                                    "level": 3,
                                    "comment": "Well I'm glad you beat depression on this one. Because God knows, this is one of those times when depression apathy can actually kill you.",
                                    "score": 17,
                                    "author": "WarmOutOfTheDryer"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yay!!",
                    "score": 6,
                    "author": "house-of-tigers"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Straight outta braces. Has to wear a mask. Lol.",
            "score": 11,
            "author": "Adam_2017"
        },
        {
            "level": 0,
            "comment": "My dad who is glued to fox news finally got one, there might be some hope left",
            "score": 69,
            "author": "Desperate-Promotion1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Fox News has started to urge viewers to get\nvaccinated this past month. It’s still mixed messages, but it’s at least moving in the right direction. Trump also said people should get vaccinated in his most recent speech.",
                    "score": 22,
                    "author": "Rev_Up_Those_Reposts",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;Trump also said people should get vaccinated in his most recent speech.\n\nHis cult loved hearing that so much there were boos. That will be the last time Trump mentions vaccines.",
                            "score": 7,
                            "author": "buchlabum"
                        },
                        {
                            "level": 2,
                            "comment": "Fox news host: Please get vaccinated, And up next Have vaccines killed more people than Hitler?",
                            "score": 5,
                            "author": "fc3sbob"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yup. Hell froze over and my FIL got his too!",
                    "score": 6,
                    "author": "commoncheesecake"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It seems the disbelievers are seeing the light?",
            "score": 387,
            "author": "artcook32945",
            "replies": [
                {
                    "level": 1,
                    "comment": "I imagine that immunocompromised people like myself getting their third shots is also having some impact on vaccine stats, this past week was the first week those third doses were allowed thanks to a new amendment to the mRNA vaccines' emergency use authorization.",
                    "score": 409,
                    "author": "g3t0nmyl3v3l",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I thought they weren't starting 3rd booster shots until September?",
                            "score": 82,
                            "author": "mandalore237",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "for all people yes, but for immunocompromised it has started already",
                                    "score": 163,
                                    "author": "anr22",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's for ALL people in September?! This is wonderful news, I thought I'd have to wait until November!",
                                            "score": 41,
                                            "author": "Sardukar333",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "They’re saying 8 months after your second shot.",
                                                    "score": 42,
                                                    "author": "nyokarose"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "It’s 8 months after your second. So if you got your second dose in May, you don’t need your third until January.",
                                                    "score": 22,
                                                    "author": "edwhittle",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I have a friend who just received her booster as she’s immunocompromised, she’s also a teacher",
                                    "score": 27,
                                    "author": "Brownbear97"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "That would be a very small part of the population though.",
                            "score": 40,
                            "author": "_AlreadyTaken_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You would be surprised. Anyone who has had an organ transplant is immunosuppressed. Anyone on chemo (cancer is unfortunately quite common). And many drugs to treat autoimmune disorders like rheumatoid arthritis and lupus which are relatively common also cause immunosuppression. Plus any congenital disorders that cause immunosuppression. That's just off the top of my head. I'm sure there are more.",
                                    "score": 49,
                                    "author": "wofulunicycle",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "So you got me to look it up and the best I can find is 2.7% of the adult population.\n\nhttps://jamanetwork.com/journals/jama/fullarticle/2572798",
                                            "score": 35,
                                            "author": "_AlreadyTaken_",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Wow, that's actually even more than I thought. That's 9 million people in the U.S., and I imagine a good chunk are being diligent with getting their vaccines.",
                                                    "score": 38,
                                                    "author": "wofulunicycle",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "A little lower at 5.6 million because this only counted adults",
                                                            "score": 20,
                                                            "author": "_AlreadyTaken_",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "A couple conservative friends of mine just switched from anti-vax to pro-vax too.  Unfortunately but took catching COVID.",
                    "score": 9,
                    "author": "Tinidril",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Here in Alabama. We’re dead last for vaccination last I checked but from what I’ve seen it’s improving. Went to get my TDAP two weeks ago and there were many lined up for their shots, so many that I had to leave and come back the next week because of the line and still ended up waiting an hour and a half the second time.",
            "score": 38,
            "author": "TheOneChooch",
            "replies": []
        },
        {
            "level": 0,
            "comment": "School mandates coming in clutch! I'll be so excited to see how good we start doing once its fully approved (monday?!) And every business can require it.",
            "score": 117,
            "author": "Sea_of_Blue",
            "replies": [
                {
                    "level": 1,
                    "comment": "My campus required it and we're up to 96% vaccinated, including faculty and staff. Aside from the masks and new zoom office hours everything just feels normal, it's incredible.",
                    "score": 15,
                    "author": "Blitz_314",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I hesitated for quite awhile, but I did some reading and began to think about the options:  \n\nrisk catching it 'in the wild' and trust my immune system to fight it off or voluntarily introduce it to my body and not worry about it anymore.\n\nFirst dose was fine, second dose hit me like a ton of bricks.  Looking at the data across the states, were doing pretty good.  We got this 💪",
            "score": 31,
            "author": "reddit4getit",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Congratulations! \n\nIn India, we've been doing between 8-10 million a day for a month now.\n\nUpdate: we just did around 13 million jabs in a single day! By December, the govt estimates that India will be 100% vaccinated with at least one dose!",
            "score": 89,
            "author": "bobothekodiak98",
            "replies": [
                {
                    "level": 1,
                    "comment": "holy fuck that’s good to hear. I have a few friends there and I just straight up avoided looking at indian vax rates cause I really thought theyd be pretty bad off. I had no idea they were administering that many!",
                    "score": 28,
                    "author": "Survivors_Envy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The weekly average is somewhere between 5 to 6 million shots per day, with 8.813 being the highest mark achieved. However, we may begin averaging the stated numbers by October, with ZyCov-D and Corbevax coming in.\n\nhttps://dashboard.cowin.gov.in/\n\nhttps://twitter.com/COVIDNewsByMIB/status/1429300249336553475?s=19\n\n(The numbers are down today due to several states restricting/suspending vaccination to allow healthcare workers to celebrate the festival of Rakshabandhan. Also, statistics are updated a bit late on CoWIN.)",
                            "score": 8,
                            "author": "EmeraldMeetsAuburn",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "India doesn't vaccinate on Sundays.",
                                    "score": 6,
                                    "author": "Familiar_Internet",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "this might be due to the approval of booster shots instead of people just now deciding to get vaxxed",
            "score": 206,
            "author": "timshel42",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 265,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 56,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "We have not bounced back. The latest spike in COVID cases is quickly becoming on par with the peak in 2020.\n\nStates like Florida and Texas are near full capacity for emergency rooms and ICU’s. It’s fucked right now.\n\nEdit: look at the data for Florida. COVID deaths are currently rising there, and they are *already* past their previous record for daily COVID deaths. They’re reaching all time highs for COVID cases and deaths *right now.*",
                    "score": 21,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 9,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "What country?",
                    "score": 13,
                    "author": "Bootyblastastic",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thailand",
                            "score": 15,
                            "author": "ContributionOk5599",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Approximately 3% of the US is immunocompromised. 3% of 330 million is 9,900,000. As someone who is immunosuppressed, I made a plan to stop my medication last week so I could get my booster. I bet you a decent majority in my shoes did too…",
            "score": 12,
            "author": "maciCatgrey",
            "replies": []
        },
        {
            "level": 0,
            "comment": "My pregnant bestie got hers Friday night. A 40 yr old teacher at her school died and it sealed her decision on getting it. Sad for the life lost but 2 lives saved!",
            "score": 17,
            "author": "anotherredditvirgin",
            "replies": [
                {
                    "level": 1,
                    "comment": "Delta can be very bad for pregnant women",
                    "score": 5,
                    "author": "LeanderT"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Defintely uplifting news",
            "score": 30,
            "author": "_AlreadyTaken_"
        }
    ]
}