{
    "id": "st1t95",
    "score": 107959,
    "title": "Belgium approves four-day week and gives employees the right to ignore their bosses after work",
    "author": "tomb8man",
    "date": 1644927979.0,
    "url": "https://www.reddit.com/r/UpliftingNews/comments/st1t95",
    "media_urls": [
        "https://www.euronews.com/next/2022/02/15/belgium-approves-four-day-week-and-gives-employees-the-right-to-ignore-their-bosses"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "My company has the “can’t get in trouble for not replying after office hours” rule and it’s pretty nice.  My boss doesn’t even have my cell phone number",
            "score": 8124,
            "author": "HighOnGoofballs",
            "replies": [
                {
                    "level": 1,
                    "comment": "If we get a work related phone call while we're off the clock, its considered overtime and we get 1.5 pay for it.\n&amp;#x200B;\n\n\nAlso, if we get called into the plant, its a minimum 4hrs of OT and we calculate from the time we leave where we are until the time we reach our post-work destination.",
                    "score": 3409,
                    "author": "Elmodipus",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Good thing I’m driving cross country after getting called in. No stops.",
                            "score": 1252,
                            "author": "Tree_painter",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "CANNONBALL RUUUUUUN",
                                    "score": 213,
                                    "author": "insomniacpyro",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I only found out last year what a cannonball run is and it seems like a cool concept. But getting payed by work to do it is fucking sick. Only sad thing is that you probably have to drive alone.",
                                            "score": 29,
                                            "author": "Djaakie"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Paid by the hour? More like Cannonball Slow Meandering Drive With Plenty of Rest Stops.",
                                            "score": 9,
                                            "author": "PrinceWith999Enemies",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Stop to shit even if you don’t have to shit many many times",
                                                    "score": 5,
                                                    "author": "One-eyed-snake"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Funny enough, I had a version of this happen in a prior role. I was an hourly employee that was asked to travel 900miles, the company did not spring for air travel, I was on the clock from the time I stepped out my front door and walked over to get the rental car, to when I got to my hotel that night.",
                                    "score": 131,
                                    "author": "admiralgeary",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Who got the better deal? Curious if your employer thought they'd save some money.",
                                            "score": 65,
                                            "author": "oversettDenee",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It was something about a director over my manager not wanting to look silly for not asking for the appropriate approvals for the spend 2 weeks prior, even though we knew this trip was occurring for at least 5weeks prior to it occurring. \n\nI found out about the car rental thing maybe 4days before I departed.\n\nI made more money off the deal -- though I think if I would have gotten in a car accident, almost surely my managers would have gotten in quite a bit of trouble.",
                                                    "score": 96,
                                                    "author": "admiralgeary",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Sometimes I dream about having to travel for work and getting in a fatal accident. My family would be set (or at least be able to pay off the house and a chunk to invest) as the life insurance for death during work related travel is something like 8x my salary.",
                                                            "score": 51,
                                                            "author": "Questfreaktoo",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "What an odd dream",
                                                                    "score": 61,
                                                                    "author": "WellitsTheBigShoe",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I mean, they gets the best of both worlds. Stops existence and constant thinking, and their loved ones are looked after far better than any normal people can attain in life...",
                                                                            "score": 41,
                                                                            "author": "hungr612",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "8x my salary would cover my family's needs for about 7 years what are you talking about better than normal people can attain",
                                                                                    "score": 5,
                                                                                    "author": "iOnlyDo69",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Isn't that the American dream? Dying on work time so your family can have a decent life?",
                                                                            "score": 4,
                                                                            "author": "thedarkarmadillo"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I am in a similar boat. A phone call is 1.5x pay and it's automatically a minimum of .5 hrs even if the call lasts 30 seconds. Going in is automatically 3 hrs, drive time is calculated, and we can submit mileage reimbursement for going to and from.",
                            "score": 57,
                            "author": "Longshot726",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Man I wish I had those OT terms. I work for a relatively small company and I'm under direct command of the boss/owner.\nI've worked a considerable amount of overtime and the most I've gotten is a $50 bonus at the end of the month.",
                                    "score": 20,
                                    "author": "Artifact-Imaginator",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Damn that is a really good policy, glad to see it",
                            "score": 149,
                            "author": "drawfanstein",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The sad thing is this should be the bare minimum requirements for everyone",
                                    "score": 15,
                                    "author": "LtDanUSAFX3"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 18,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh man. I hope you can find something that treats you better, no one should have to deal with that.",
                                    "score": 10,
                                    "author": "Elmodipus"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Seems fair.",
                            "score": 25,
                            "author": "Blueskies777"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 307,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah our corporate \"legal drug and alcohol policy\" is \"use your best judgement\"",
                            "score": 174,
                            "author": "HighOnGoofballs",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "\"Can you do your job and not embarrass yourself/the company?  Fine, I don't need to know\" - basically my policy.   Unless you're literally being paid to be sober/on call, what you do in your own time is your business, not the companies.",
                                    "score": 37,
                                    "author": "Daxx22",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "This makes sense for an accountant, maybe not for a forklift driver.",
                                    "score": 100,
                                    "author": "dryhumpback",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "See, and that's neat - Available to work after hours? We'll pay you well! Not available? Don't worry.",
                            "score": 30,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "In a previous gig, if one of my employees was on call, they were expected to be sober enough to perform their work. But everyone rotated through the on call schedule and it was posted 4-6 months in advance, so it wasn't like we were springing it on them at the last minute.  If they had an event or couldn't do on-call some day during their rotation, they were expected to get coverage from someone else.",
                            "score": 38,
                            "author": "Eccohawk",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I worked in sports for a long time. The hours are weird and all over the place, but the best part about my last job in sports was that they provided us company cell phones. I only gave my personal number to people I liked. My first boss never got it. The PA guy did. And my second boss did, because he had the same mindset I did. \n\nNow I work for a nonprofit that just reimburses my personal cell phone bill. Calls and texts at 7am on a Tuesday, 8pm on a Sunday, and all times in between. It sucks. That said, it’s usually volunteers and not my boss. Usually, I just ignore them. Still sucks.",
                    "score": 60,
                    "author": "GlassEyeMV",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "This is why I declined the offer to also use my work phone as my private phone with a cheaper company rate for private calls. No thanks. You can call me for work related stuff on my work phone, which will be turned off outside my working hours. You want to call me for private stuff and I've given you my private number, call me on my private phone. Nobody at work has my private number except HR which is only allowed to use it for (medical) emergencies.",
                    "score": 128,
                    "author": "--dontmindme--",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; a cheaper company rate for private calls\n\nWas that in the 90s or something like that?",
                            "score": 32,
                            "author": "AMViquel",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Lol yeah, I’m on a company phone and just use it as my personal too.",
                                    "score": 14,
                                    "author": "Bopshidowywopbop",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Be careful with that. Since it’s considered company property, they can scan your phone and see what you’re doing with it. They can also track your location and remotely wipe your device. \n\nAlways keep your personal information separate from work information. It avoids scandals and should you voluntarily leave or get fired, there goes all of your data.",
                                            "score": 54,
                                            "author": "Dfiggsmeister",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "They can and it’s certainly company policy to be able to do all that but I work for a very small company where I’ve been for 9 years and I don’t see a lot of risk.\n\nIf I was employed at a larger publicly traded company I would have more caution.",
                                                    "score": 7,
                                                    "author": "Bopshidowywopbop",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "If you haven’t done so, back up your data then. Never know when the company will decide to shutdown for good or they get sued and your device is confiscated as evidence in a trial. \n\nThat’s just me being paranoid because I have worked for both large and small companies where shit hits the fan.",
                                                            "score": 16,
                                                            "author": "Dfiggsmeister",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Worksite demanded my house # &amp; after refusing got called into a meeting for it.  Big argument but I gave them the # to “Paddles” (NYC BDSM club).\n\nNever came up again.",
                    "score": 113,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Probably going to take more effort than it's worth to get your voicemail messages.",
                            "score": 25,
                            "author": "SCREW-IT",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "What’s that number? Honestly want to use it at the next job",
                            "score": 4,
                            "author": "MuteWhale",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They asked for mine then posted it on every directory they have",
                    "score": 78,
                    "author": "chockobarnes",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That is exactly why I use throw away Google voice numbers when they ask for stuff like that.\n\nI can still get the calls, but I can cut access whenever I want and just ditch the number.",
                            "score": 56,
                            "author": "Emerald_Flame",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I've recently adopted this practice as well. The number of spam calls that end up hitting the \"public\" number is shocking.",
                                    "score": 5,
                                    "author": "jsylvis"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yep, I had a corporate job where they asked for my number and then gave it to 800 people. About three years of no peace.",
                            "score": 8,
                            "author": "UtherofOstia"
                        },
                        {
                            "level": 2,
                            "comment": "I’m sure it’s in a directory somewhere but we do everything over slack or zoom so no one uses it",
                            "score": 25,
                            "author": "HighOnGoofballs"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Neither does mine, but my customers do. I just tell them if they call me after hours I might be a few beers deep. I've only gotten a couple of after hour calls from them and each time I put a beer can up to the phone and crack it open so they hear that I'm drinking. Then I always get the, \"Oh sorry, I'll make this quick!\"\n\nEdit: I did mention that this is after hours. I will always be available to help and they know that, but I have a life too. My relationship with my customers is great btw because I'm real with them and they are with me.",
                    "score": 136,
                    "author": "Dhh05594",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Uhhh, Bob, it's 11am on a Tuesday. \n\n\n*crackkkkk*",
                            "score": 236,
                            "author": "justfordrunks",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Bob...  you're on call.  You're a pediatric surgeon...\n\n*crackkkkk*",
                                    "score": 154,
                                    "author": "grellgraxer",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Don’t worry, that’s just the sound of this kid’s bones",
                                            "score": 62,
                                            "author": "astro124",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That's cool Bob but you're in the wrong hospital",
                                                    "score": 24,
                                                    "author": "insomniacpyro",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "hospital?",
                                                            "score": 17,
                                                            "author": "AMViquel",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "It's a big building with patients. But that's not important right now. Tell the Captain I need to speak to him.",
                                                                    "score": 13,
                                                                    "author": "insomniacpyro",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "\"I don't judge your life, you don't judge mine!\"",
                                    "score": 26,
                                    "author": "BigDisk"
                                },
                                {
                                    "level": 3,
                                    "comment": "I used to be a bit of a pisshead and this one place I worked at accidentally scheduled me in on the wrong day and as they didn't need 3 kitchen porters the head chef offered to drop me home (since it was quite a walk back especially after just walking there) without thinking I just say \"can you just drop us to the pub\" cue the whole kitchen bursting into laughter and the chef going \"For fuck sake N64crusader4 it's only 9 in the morning\" 😂",
                                    "score": 17,
                                    "author": "N64crusader4",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "And yet, here you are, sober, calling me for help \"burp!\" It's troubling, isn't it?",
                                    "score": 17,
                                    "author": "bond___vagabond"
                                },
                                {
                                    "level": 3,
                                    "comment": "Oh I’m about 2 hours late for this then",
                                    "score": 8,
                                    "author": "YetisInAtlanta"
                                },
                                {
                                    "level": 3,
                                    "comment": "I'm drunk now. 9:17am Tuesday.",
                                    "score": 6,
                                    "author": "guinness5",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "\"Uh Bob, it's breakfast.\"\n\n\"And a piece of toast.\"",
                                    "score": 6,
                                    "author": "thedude37",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "We have moved to a 4 day workweek with reduced hours but it comes with some caveats. All client responsibilities must be handled. If clients have things due or want to set a meeting on Friday then we have to oblige. Otherwise we tell people to enjoy Friday. It started with just summer fridays but we have moved to the policy year round. Everyone seems happier. \n\nI think it’s more about treating employees like responsible human beings than the number of days. We don’t have set work hours and offer unlimited PTO. Basically you have a responsibility to get your job done but otherwise go enjoy life. So far no one has really abused the policy.",
            "score": 2950,
            "author": "Parikh1234",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 163,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah it’s surely industry dependent. Not like you can be a doctor and tell your patients don’t get sick in Fridays.",
                            "score": 100,
                            "author": "Parikh1234",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Or basically anything in customer services/support/sales.",
                                    "score": 29,
                                    "author": "Daxx22",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Solution to that is more employees to cover more shifts but obviously employers don't want to do increase overhead",
                                            "score": 28,
                                            "author": "IReallyCantTalk",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Yup.",
                                            "score": 7,
                                            "author": "Parikh1234"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Hey, it worked for Sundays and Saturdays",
                                    "score": 15,
                                    "author": "[deleted]",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Wish someone would tell the dentist this.  Near impossible to find one in my area when I had a tooth abscess on a Thursday.  Only place I could find was a place for welfare cases, only interested in pulling teeth. \n\nEnded up in the ER by Sunday to get an IV with antibiotics, numb me up to get through the pain. By Sunday I wish I would have had it pulled.",
                                    "score": 7,
                                    "author": "HighTechButter",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "True but then you theoretically have rotating coverage - someone gets Fri, Sat, Sun off, someone else Sat  Sun, Mon, and so on and so forth so everyone has four days and the workplace is always staffed.",
                                    "score": 5,
                                    "author": "a_panda_named_ewok",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You need great managers and operations people at every level. Very hard to scale but worth it for our employees mental health. It’s very important to me.",
                                            "score": 7,
                                            "author": "Parikh1234",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;So far no one has really abused the policy\n\nI usually see people use abusing the policy as an argument against it, but they would just get fired or have appropriate actions taken to remedy it, no? If you break or abuse any policy a company will have grounds to terminate you was my understanding.",
                    "score": 858,
                    "author": "BlackAnalFluid",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "We have fairly strong legal language built around out policies. It’s a trust thing from both parties but we as a business need to protect ourselves.",
                            "score": 294,
                            "author": "Parikh1234",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, get that shit in writing, US democracy may die just because a huge chunk of our Senate procedural rules were based a gentleman's agreement.",
                                    "score": 127,
                                    "author": "howigottomemphis",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah it’s for the protection of both sides. I think people like knowing exactly what the deal is. When companies try to do shady stuff it leads to problems.",
                                            "score": 39,
                                            "author": "Parikh1234",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Right, when I hear “unlimited PTO” I really want to know who is keeping score and what the current “high score” is. If it’s truest unlimited, I’m getting my shit done Monday and maybe I’ll check in Thursday.",
                                                    "score": 6,
                                                    "author": "SharkAttackOmNom",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt;  If you break or abuse any policy a company will have grounds to terminate you was my understanding.\n\nThing is, most companies (as an entity, obviously there are dumb managers) don't actually want to fire people.  Training people is hella expensive.  A revolving door of employees is the surest sign that the company's a dumpsterfire.",
                            "score": 23,
                            "author": "Zefirus"
                        },
                        {
                            "level": 2,
                            "comment": "I've read that it actually results in the company saving money as people use less PTO when it's unlimited since there's no longer any clearly defined rules. It's much easier to take 10 PTO days when it's specifically outlined as only being unacceptable once you exceed those 10 vs unlimited as long as you don't \"abuse\" the policy. It also makes it more difficult for employees to compare compensation packages when one company offers 10 days but another offers \"unlimited\".",
                            "score": 8,
                            "author": "ntsp00",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They say unlimited PTO actually leads to using less PTO and then you don’t get any extra compensation when leaving a company so company actually saves money on that.",
                    "score": 30,
                    "author": "mrmo24",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "This sounds really nice. Have you noticed improved well-being in your employees?",
                    "score": 18,
                    "author": "giglio_di_tigre",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah everyone likes the fact that they have this sign of trust. They just have to clear it with their manager so that we know to make sure we have cover for them or that they aren’t hurt or missing.",
                            "score": 20,
                            "author": "Parikh1234"
                        },
                        {
                            "level": 2,
                            "comment": "Trust in employees results in trust in the company. People will be less against overtime and deadlines if their other time is well spent. Its added benefit for all parties, as long as agreements get uphold.",
                            "score": 5,
                            "author": "Kayshin"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My company did something KIND of like this. It's technically a 5 day work week, but fridays are \"take off when you want\"\n\nWe found most people still show up, get what they need done, and bounce.",
                    "score": 11,
                    "author": "soonerguy11",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Unlimited PTO is one of those things that sounds good, but is usually a pretty shitty policy in practice.  Studies have shown that people with unlimited PTO take less time off than people that receive a set number of days because they're always wary of that \"Abuse\" you're talking about.  It's basically a way to guilt people into taking less time off than they normally would.  There's also no vacation time to pay out at the end of the year if they didn't use their vacation time.",
                    "score": 40,
                    "author": "Zefirus",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Our company had unlimited PTO and people weren’t using it appropriately so we changed it to 8 weeks a year and you get a bonus if you use more than 3 weeks a year. Use your PTO folks.  Not all companies are shitty.",
                            "score": 16,
                            "author": "xder345",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Yeah, I worked in a place with unlimited PTO.\n\nIt was great at first. If you needed to take a day here or there, no problem.\n\nI usually took one week or so vacation a year.  \n\nThen one year they needed people to cover during Xmas week when the company shut down to a skeleton crew.  I wasn't going anywhere so I volunteered.  They said I could make-up the xmas week some other time.\n\nSo the next year I took my \"Xmas week\", then months later I tried to book my regular vacation and got called by HR for trying to \"abuse\" the \"unlimited\" PTO.  I had to bring up the old emails etc. about Xmas - they still weren't happy but it was approved.",
                            "score": 38,
                            "author": "geeky_username",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt; unlimited PTO\n\nThis is a curse in disguise. People end up taking even less time off as they dont want to look bad.",
                    "score": 5,
                    "author": "WFOpizza",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "The only time my boss can contact me outside work hours is to tell me the plant shutdown because of snow.",
            "score": 1328,
            "author": "TaiDavis",
            "replies": [
                {
                    "level": 1,
                    "comment": "My boss called me on my PTO to tell me to sign the papers he sent me in the inbox for a promotion before a certain date so I could get the pay increase sooner than later. I told him he can call me anytime on my PTO for news like that!",
                    "score": 97,
                    "author": "redditapi_botpract",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "The only time my boss talks to me outside working hours is to ask me about Marvel movies.",
                    "score": 159,
                    "author": "Wild_Marker",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'd love it when people want to talk about my hobbies and interests, I'd be so excited lol",
                            "score": 40,
                            "author": "lamboat2019",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "-phone rings\n\n'Hang on, it's my boss!'",
                                    "score": 15,
                                    "author": "Allidoischill420",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I love my bosses explanation when I asked about receiving texts after hours during my final interview\n\n\"I'll be honest,  you'll receive texts to your slack past your working hours. It's because I'll remember something I wanted to tell you and probably would forget by morning. [laughs] Just ignore them til next day.\"",
            "score": 504,
            "author": "FoxFourTwo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, there's nothing wrong with getting emails or texts or whatever outside of work hours. The issue is when you're expected to read/reply to them.",
                    "score": 242,
                    "author": "TitaniumDragon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I personally do a lot of my work after hours when it's nice and quiet, sometimes even at 2 or 3 am. If I need to email or text someone though I will always schedule send it to 10am the following day - just because I choose to work at ungodly hours doesn't mean you need to be bothered by it. \nI Really hate apps that still don't have schedule sending (looking at you WhatsApp, you shitty shitty app).",
                            "score": 46,
                            "author": "AxlLight",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is exactly what I do except I add something like, “this isn’t remotely urgent, I’m just sending this now so I don’t forget tomorrow!”. Because there’s a decent chance I will forget that following morning if I don’t send it right away",
                    "score": 53,
                    "author": "Prophet2Nations"
                },
                {
                    "level": 1,
                    "comment": "most phones have the ability to schedule text message deliveries.   I'll type the whole thing out and schedule it for delivery the next day.   I do it to my wife all the time when she says \"I need you to remind me . . . .\"",
                    "score": 28,
                    "author": "definework",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I bet you that most people don’t know this. Myself included until now and I’m in my 20s and consider myself relatively tech-savvy.",
                            "score": 9,
                            "author": "ruth1ess_one"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "They are turning a 38 hour, 5 day work week (8 hours a day) to a 38 hour, 4 day work week (10 hours a day). No changes in performed hours.\n\nWould this affect added daily bonuses such as meal aid (\"maaltijdcheques\") and ecology aid (\"Eco-cheques\")? Because technically, you are working one day less.",
            "score": 1758,
            "author": "gamma_gamer",
            "replies": [
                {
                    "level": 1,
                    "comment": "This will also effect how much of their lives workers spend commuting, as well as reduce urban pollution",
                    "score": 1169,
                    "author": "DarthCloakedGuy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'd be interested to see any studies on how this explicitly affects gridlock and rush hour traffic.  Does it just shift back two hours or is any of it alleviated?",
                            "score": 245,
                            "author": "ffxivthrowaway03",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well I imagine not everyone will be working the same 4 days so in theory there should be less traffic most of the week.",
                                    "score": 106,
                                    "author": "Pool_Shark",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "And also, start and end times will vary depending on the company.  Some will add 2 hours onto the start, some onto the end, and others will split and add an hour to each.",
                                            "score": 22,
                                            "author": "[deleted]"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "It won't be most jobs that switch to a 4 day workweek. At least not for the foreseeable future.\n\nBesides, the kinds of job that will offer this new regimes wildly overlap with the jobs that are already telework (the intent of the reform is to adapt to the \"new way of working\"). 10 hour days are alright if you don't have a regular commute, but would suck ass with 2 hours of daily commute on top.\n\nWhether you're teleworking on a 5 or 4 day work week doesn't change much for rush hour.",
                                    "score": 56,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "If my commute is 2 hours I’d rather do that 4x a week than 5x, absolutely no question. Make the work days slightly longer if it means I have another day totally off.",
                                            "score": 22,
                                            "author": "Jewrisprudent",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Technically 8 hours a day 5 days a week is 40 hours, so they can have 2 10 hour days and 2 9 hour days. I'm not sure how the 38-hour workweek worked before though. Do they just start later on Mondays or go home earlier on Fridays?",
                    "score": 36,
                    "author": "Ultimatedream",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "In Denmark it has to do with unpaid lunch breaks. Unless you have responsibilities during that break, such as answering phones.",
                            "score": 31,
                            "author": "-Daetrax-",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 18,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Belgian here, usually it's earlier fridays.",
                            "score": 13,
                            "author": "FunLifeStyle",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "But it is such a change for work life balance. Two extra hours a day isn’t much but an extra day off is.",
                    "score": 179,
                    "author": "Ragingbagers",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Depends on the job and personal preference. I have a job that requires a lot of focus and I tend to lose mental capacity before 8 hours are up. Two hours would be a big difference for me. I do like the idea of 80 hours in 9 days though.",
                            "score": 95,
                            "author": "RedSpikeyThing",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I work in customer service. 10hrs of being “on” and “socialising”, I’d be drained.",
                                    "score": 15,
                                    "author": "OldSpiceSmellsNice",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'd be in jail.",
                                            "score": 10,
                                            "author": "RedSpikeyThing"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I’ve waited tables and 10 hours sounds like mentally mind numbing, I wouldn’t trust people to be in their right facilities after say 7-8 hours either, let alone in a pandemic.\n\nAlthough less commuting might be good for the environment so at least that’s good.",
                                    "score": 26,
                                    "author": "ThePu55yDestr0yr",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt; Two extra hours a day isn’t much but an extra day off is.\n\nIt really is though.  I currently work 4/10s.  During those 4 work days, you have no time for anything else.  And on Friday you feel obligated to catch up on all the things you missed M-Th so it doesn't feel like that much of a day off either.\n\nThe real push needs to be for 4/32 with equal pay.",
                            "score": 135,
                            "author": "valarinar",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I seriously question any company that claims they’re getting productive work out of an office worker for 10 hours a day. That’s wasteful and inane. Judge work, not hours. \n\nI would put forth that no less than 3 hours of the average office worker at the office is wasted “pretending to work” or just passed talking to coworkers. Why are they even there that long?\n\nEDIT: FWIW working from home for 3 years, My stats at work are better than they’ve ever been. If I’m being perfectly honest I’m productive in about 2 2-hours bursts a day. I’m reading Reddit, laying down, playing video games, doing house chores for the rest. From the perspective an “old-school” (read: useless moron) manager, I’m stealing more than half the company’s time. From a much smarter manager’s perspective: who actually fucking cares if the work is done on time and done well?",
                                    "score": 58,
                                    "author": "BIT-NETRaptor",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah it actually ends up leading to even more stress, because of course the official line is *always*, \"why yes, I'm working every single minute I'm on the clock, because not doing so would be mischarging company time!\"  But everyone knows it's bullshit, but you can't *say* it's bullshit, even in jest, even behind closed doors, because all it takes is HR getting a whiff to send you out on the street.",
                                            "score": 6,
                                            "author": "valarinar"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "This!\n\nI'm on 4/10 and I only really have enough time at home to cook, eat, watch maybe 1 show or do a chore and it's bedtime.\n\nFriday off is spent running errands because there are lower crowds and I'm done by about 5pm. \n\nI do essentially have 2 days off to relax which is nice, but 4/32 would be significantly better.",
                                    "score": 36,
                                    "author": "Tolwenye",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Big time. I'm always surprised at the push-back Reddit gives this model. I've never tried it myself, but as someone who has worked some 50hr weeks of 5 days at 10hrs/day, yeah I would take this in a heartbeat.",
                            "score": 46,
                            "author": "BigDenverGuy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I work at a veterinary hospital and this is how we work. 4, ten hour days with typically Wednesdays and weekends off. It can suck working a few of your 10 hour days in a row but im able to do so much more with my time off.",
                                    "score": 5,
                                    "author": "pinheadloserr",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Because it's a fucking bullshit bait and switch. The **whole fucking point** is that it's perfectly possible to accomplish all the necessary work in less hours, and so we should get paid the same for doing the same work in less time.",
                                    "score": 17,
                                    "author": "crisprefresher",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Eh, I disagree. Don't get me wrong I'd love a 32hr work week at 4 days a week, but I see plenty of progress in a country or company realizing that we DON'T need to be at our jobs 5+ days a week. That's huge to me.",
                                            "score": 3,
                                            "author": "BigDenverGuy",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "A lot of jobs don't require that kind of time, that's one part of it. I could do my job in a six hour four day work week. \n\nThe other thing is if you leave for work at 8:30 and don't get home until 7:30, between chores and dinner your free time disappears. With an 8:30 to 5:30 you stand a chance of hanging out with friends on a weekday.",
                                    "score": 8,
                                    "author": "Yesica-Haircut",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I've worked 4/10's and I like it.",
                            "score": 10,
                            "author": "series_hybrid"
                        },
                        {
                            "level": 2,
                            "comment": "Way over generalized statement you made here. 2 hours per day is more than the total free time a lot of people have on a work day as it is. This would actually destroy the work life balance that some people have during the work week.",
                            "score": 3,
                            "author": "AbsolutelyUnlikely"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I really hated 4 10s compared to 5 8s personally.",
                    "score": 40,
                    "author": "PM_ME_PCP",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Same. When I did 4 10s I would basically work, make dinner, relax a tiny bit then go to bed and that's all I'd do for 4 days straight. I can't imagine doing that if I had kids and trying to exercise. \nI'd rather have 2 extra hours per day than a full Friday.",
                            "score": 29,
                            "author": "Peeeeeps",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "10 hrs is a loooong fucking day.\n\nI would prefer a six hour day, 30 hours a week. Have breaks but skip lunch. Get in, get into a flow, and get out.\n\nHow does a company pay for that? You stack three shifts. \n\n\n5 am to 11 am, \n10:30 to 4:30, \n4 pm to 10:30 pm.\n\nEvery shift has amazing advantages. \n\nWant to go back to school and get a degree, but don't want to do the night school thing? Plenty of time if you do the late shift? Maybe you're a night owl?\n\nHave kids? Mid shift works.\n\nMorning owl? Easy. You'll have the rest of the afternoon for yourself!\n\nHow does the company do? They get fresh thinking, energized, content workers from 5 am to 10:30 pm. Way more than any 10 hour shift company can do.\n\nThere are so many intangible benefits to this. You'll never have to wait in traffic or long lines at the grocery store again.\n\nI've been talking about this modality for 20 years to no avail.\n\nI guess people want to waste time eating lunch. Ah well.\n\nEdit: The reason you stack shifts with 30 min overlap so that work can be discussed and transferred to the next incoming shift. Productivity would be through the roof because everyone is fresh to knock it out.",
                    "score": 210,
                    "author": "rondeline",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm 4x 10hrs. Some days it's a real grind but overall better than 5x 8hrs. I get 2 days with the wife and kids and 1 day when they are at school and it's just us (she's a stay at home mom). We get to go for a meal and spend some quality time.",
                            "score": 142,
                            "author": "rabes81",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I work a 9/80 schedule, so M-Th are 9 hour days, we have a working Friday and we get every other Friday off, so I 3 day weekend every other week.\n\nWhile spending even less hours at work a week is the obvious overall goal, even with the longer days, having a 3 day weekend every other week is so worth it. It's so much better for my overall mental health and work life balance than working a standard 5 day weekend.\n\nI've only had one job that was a standard 5 day week and I never want to go back to that.",
                                    "score": 47,
                                    "author": "_game_over_man_",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I’m working a 9/80 too and it’s pretty fantastic. Honestly it’s the biggest thing keeping me at my current job even though I’m super bored of the work and could  probably get paid more.\n\nBut those Friday's off man…",
                                            "score": 9,
                                            "author": "thoeoe",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "The three day weekend is very nice.",
                                    "score": 12,
                                    "author": "rondeline",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "As I get older too I find I need more time off to avoid burn out and it's a big help.",
                                            "score": 5,
                                            "author": "rabes81",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Sure but two extra hours a day for an extra day off sign me up.",
                            "score": 15,
                            "author": "80cartoonyall"
                        },
                        {
                            "level": 2,
                            "comment": "God, 10:30-4:30 would be such a great schedule. Get up, have breakfast with the kids, get them to school, and chill for a little bit before heading into work. Then, be off in time to spend quality time with the family before going to bed. The American work week makes you have to choose between providing a decent life for your family, and actually spending time with them, and it sucks.",
                            "score": 39,
                            "author": "amesbelle7",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "It's not that bad. 2 extra hours for an extra day off is well worth it. I'm currently on 3-12h days 4 days off and it's glorious.",
                            "score": 31,
                            "author": "corbear007",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Best shift hours I ever had. But then I did it with my RN wife with a similar workload and just a newborn and both our grand parents for support. Not sure how we’d make it work with older (school aged) kids and no family support.",
                                    "score": 4,
                                    "author": "Grimkok",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt; I would prefer a six hour day, 30 hours a week.\n\n\"I would prefer working less.\"",
                            "score": 69,
                            "author": "Careless_Bat2543",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes, people like to work less.  \n\nOne of the major points of advancing as a society is supposed to be the reduction of work, instead we just used that new leeway to fit in even more work in the same period of time in pursuit of higher profits.\n\nThroughout modern history advancements in efficiency haven't been equally met by increasing pay or reducing hours, we've been conditioned to accept that you're supposed to work this long every day and only be paid this much no matter the level of productivity.",
                                    "score": 41,
                                    "author": "Enunimes",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Exactly. People always bring up \"but back in the day you'd work literally whole day, cutting wheat, feeding animals, fixing house\" yadda yadda. But it wasn't so stressfutand fast paced.\n\nWe can look at primitive tribes that are still around the world. They weave baskets, and there isn't any manager standing above them telling them to work faster, and when they do faster, they increase the minimum needed, and they're told to work *even faster*. People could take breaks when they wanted, not when their boss told them to. \n\nWhen I look at some simple tribes it's unthinkable to me that they're the same humans as us. They are made the same way, they have the sama abilities, yet they fish and weave baskets while singing meanwhile we spend 7 years learning books by heart to be lawyers, or to program websites. we expect so much from ourselves and I don't believe we are made for it.",
                                            "score": 7,
                                            "author": "Zaurka14"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You guys don't ignore any calls from work anyways? Once the day is done and if work calls me, I ignore the hell out of it",
            "score": 149,
            "author": "singleguy79",
            "replies": [
                {
                    "level": 1,
                    "comment": "They can call me outside hours all they like. If it suits me I'll pick up the phone. If I feel it's urgent enough, I may help them out, but there are no consequences if I don't.\n\nNow, my employer certainly doesn't have the habit of calling people after work or on their days off, but not everybody is always aware of your days off. We have an excellent work life balance and lots of flexibility, so for me that flexibility goes both ways.",
                    "score": 29,
                    "author": "GORbyBE",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Man, I feel lucky for having a job where no-one would dream of calling me after work hours. That is some weird ass unwelcome shit.",
            "score": 40,
            "author": "Goseki1",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I'm required to respond to my boss and any client any hour of the day. 45 hours a week is expected. Gotta love architecture and engineering. As if me responding at 11pm and working overtime to hit self-imposed deadlines is going to make or break some developer's cheap-ass building. It takes 2+ years to build anyways and my design fee is like 0.5% of the construction budget.",
            "score": 458,
            "author": "newurbanist",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m an engineer.  I have countless stories of staying until 10pm or much later for some bullshit that had to be done right now.  I once stayed until 5:30 am (I start at 7:00 am) to heat treat a piece of equipment that had to get done right now. That piece set untouched for a month after I heat treated it.  The worst thing about most of my overtime work is that usually my boss would wait until the end of the day to tell me so there was always hope that the day would be normal but it never was.  At my job now I make less money but I rarely work overtime (3 times in  13 months).  When things are slow I sometimes leave a couple of hours early and no ones cares.",
                    "score": 209,
                    "author": "repwin1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If something needs to happen right now, they can add it to the backlog. We will get to it after we finish all the other stuff that needs to be happen right now (everything). If you have left something open for 3 weeks, then it has to be finished in a day, it doesn't need to be finished in a day.",
                            "score": 35,
                            "author": "Kayshin"
                        },
                        {
                            "level": 2,
                            "comment": "&gt;I once stayed until 5:30 am (I start at 7:00 am) to heat treat a piece of equipment that had to get done right now. That piece set untouched for a month after I heat treated it.\n\nThis kind of thing infuriates me the most. If something can't be done today then it shouldn't be done today. Period. You have your shift, you should be expected to work that shift and just that shift. \n\nUnless you have a job that requires emergency shifts for a damn good reason, they shouldn't be taken.",
                            "score": 22,
                            "author": "GodAwfulForumDesign"
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 10,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "2 out of the 3 professional jobs I’ve had has been like this. The first one was a small company where the owners were really involved  and they expected you to work like they did even though you didn’t get any of the benefits.  I soon learned that appearing to look busy was key at that place.  The second one was just a mess of a place.  I don’t know if it was true but I was told they had a 97% turnover rate among managers and salaried employees.  In my 18 months I personally had 6 bosses in 2 departments but only 2 was there when I started and only 1 was there when I left.  The plant went through 3 general managers.",
                                    "score": 6,
                                    "author": "repwin1"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Same. I’m in marketing. Our whole office runs on hurry up! We need this thing yesterday! Just to sit in the clients hands for 2 weeks before they even look at it",
                    "score": 4,
                    "author": "throwy_6",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I work in IT and while I like the idea of 4-day week, but 10 hours would be completely inefficient in my industry. 8 hours is already a stretch, those 2 additional hours would bring little to no value to a company in most cases.\nLike you could schedule some meetings for those hours, but their efficiency is also a question.",
            "score": 243,
            "author": "_Mage_",
            "replies": [
                {
                    "level": 1,
                    "comment": "I work in IT (development) as a manager and former developer and I see this could be working quite nicely, though. It's mainly about planning - so it would be a problem letting everyone off on Fridays, of course, but a minimum crew rotation every Friday is feasible.\n\nWhere I am we have 40 hour work week (including breaks) so instead of 8x5 weeks, I would see 4x9 weeks for those who want as the days are somewhat tolerable and it's only a minor reduction in salary.\n\nThe improvement in wellbeing alone will probably pay the investment back in full for the company, though.",
                    "score": 22,
                    "author": "EspectroDK"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm waiting to see if this is confirmed (couldn't find belgian news outlets in french at this point to confirm this, probably a question of time), and especially I'm interested to see how this would be put in place in practice.\n\nI'm all for it, let's make this real!\n\nEdit: u/beriz found another source confirming this in Belgian news.",
            "score": 139,
            "author": "Incorect_Speling",
            "replies": [
                {
                    "level": 1,
                    "comment": "https://www.rtbf.be/article/reforme-du-marche-du-travail-comment-fonctionnera-la-semaine-de-quatre-jours-10935298",
                    "score": 25,
                    "author": "beriz",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks!! Didn't find this one in my earlier search, really fresh news.",
                            "score": 5,
                            "author": "Incorect_Speling"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "what part of the 'put into practice' are you referring to?\n\ngenerally, this gives the employees the legal right to complain and sue if their employer violates any of these laws, which seems relatively straightforward to me. The issue i can see is that it might be hard to prove that an employer fired you for requesting a 4-day work week, but this is the case for all other illegal reasons for which someone might be fired.",
                    "score": 27,
                    "author": "padraig_oh",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Basically anything that happens between the law being passed and this being a reality for employees like me. Concerns like the one you raised.",
                            "score": 13,
                            "author": "Incorect_Speling",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Lol Belgian here, can't believe I heard this news on reddit first.",
                    "score": 8,
                    "author": "SeenB4",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "TIL; People take calls from their bosses out of hours.",
            "score": 43,
            "author": "Nomad2k3",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think it’s job specific, I rarely communicate with my team after hours unless a real emergency pops up, or if a team member is at a customer doing a trial and that’s bc trials normally run over multiple shifts.",
                    "score": 10,
                    "author": "Bananasharkz"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have always ignored work (and all aspects and personnel thereof) after-hours. It never occurred to me that I needed this particular “right” enumerated. And I have had some shit jobs in the past.",
            "score": 14,
            "author": "deltwalrus",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Important to note that it's a 4 day week but with the same amount of hours (the norm is 38 a week). So it means longer days. I live in Belgium and have a 40 hour a week job and 8 hours is already more than i can bare. No way am i going for this.\nIt's good that the choice is there though. I sure other people will be very happy with this and some job might be well suited for it too.",
            "score": 659,
            "author": "Fat_Suffices",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’d gladly make that sacrifice to have more full days off",
                    "score": 422,
                    "author": "MadRonnie97",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I do 12s and its a little much, but I think four 10s would be the sweet spot",
                            "score": 183,
                            "author": "kermitdafrog21",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I haven’t been under 55 hours a week in over a year so I’ll take anything at this point lol",
                                    "score": 76,
                                    "author": "MadRonnie97",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I worked 65 hrs per week for 3 years and got two promotions and a great paycheck. \n\nWhat I didn't like was the physical and mental outcome: almost lost my shoulder muscles to atrophy, constant migraines, hair falling out when showering (I'm bald now even without family history), extremely low libido (low testosterone) and a bunch of others.\n\nI now have a 40 hr week in a very laid back job, and looking back .. I don't know if I would do it all over again, probably not.",
                                            "score": 8,
                                            "author": "Antherios"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Can confirm, 4 10s is juuuuust right. I often have an option to work Fridays for OT, but for the most part I get so much personal shit done on those Fridays, it's great.",
                                    "score": 46,
                                    "author": "Jak_ratz",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I’d absolutely do 4 10s, but I’d prefer to do them M, T , Th, F with the option of switching out days to W if the family wanted to take a long weekend somewhere.",
                                            "score": 15,
                                            "author": "Captain_Wompus",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That's the best because every day that you work is immediately before or after an off day.",
                                                    "score": 14,
                                                    "author": "Medtiddygothgf"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Currently do 12 hour days, 4 on 4 off. Longer work days seem like a small price to pay when I work half the year and that's without any holiday days. But flexibility is the name of the game, everyone has their sweet spot of productivity, any employer willing to engage with that fact could find themselves with a solid team real quick.",
                                    "score": 13,
                                    "author": "TheLastBlowfish",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I understand perfectly. I wish I could. I just know I won't be able to. My project manager talked about it this morning and just can't wait because he'll be able to play golf on wednesdays and keep his days off.\nI wonder how it'll go for days of by the way. If you keep the same amount, it means it's now worth 2 hours more every day (for a 4 day week of 40 hours).",
                            "score": 20,
                            "author": "Fat_Suffices",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "We need to get away from the 40 hour concept altogether.",
                            "score": 5,
                            "author": "Devadander"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;I live in Belgium and have a 40 hour a week job and 8 hours is already more than i can bare.\n\nHave you tried working while wearing clothes?",
                    "score": 8,
                    "author": "Zaphanathpaneah",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I don't know which I'd choose but we really just need a 32 hour week.  4 days, same length, same pay.",
                    "score": 19,
                    "author": "Kyanpe",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I dislike the idea of having the same amount of hours in less days. I thought the original idea was that having less hours would mean more productivity and motivation.",
                    "score": 118,
                    "author": "czcc_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I wish it were. This is something i'm so hoping for to be the norm one day (before i retire would be better).",
                            "score": 16,
                            "author": "Fat_Suffices"
                        },
                        {
                            "level": 2,
                            "comment": "I think that this allows for productivity data to be collected and later for less hours to be fought for. If we move the cultural position to the idea of having 3 days a week off, later we can fight for lower hours.\n\nIt is long past that the benefits of automation have been realised for the working class.",
                            "score": 13,
                            "author": "-robert-",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Those two added hours really do make a difference for the worst. When I worked at Amazon, our regular days were four 10 hour shifts. Technically 11 hours and 30 minutes due to lunch. By the 7th hour of hauling boxes all day, I was mentally checked out and was ready to go. It didn't help that time moved slow in there and that I was miserable in that hell hole. Then with all the traffic, I'd only have enough time to shower, go to bed, wake up and immediately get ready for work. Mandatory overtime during peak was horrible too. Sometimes we did five 12 hour shifts or six 10 hour shifts. Depended on the building you worked at. \n\nI know part of the solution is to find something that you enjoy doing, but I hate our work system. 5 on and 2 off just seems like a rip off. That's not including the commute, traffic, getting ready for work, etc. Then again, I'm also an idealistic dreamer who hates working for other people.",
                    "score": 50,
                    "author": "Protein_and_Vinyl",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I do something I love and even I check out after 6-7 hours. As much fun as design is, I'd still much rather be hanging with my girlfriend or doing hobbies.",
                            "score": 7,
                            "author": "SoggyMattress2"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Does this apply both ways? My wife is the director of her department at a hospital, and every night she is answering what sometimes feels like non-stop texts from employees asking about their schedule the next day. Could she ignore them under this law?",
            "score": 70,
            "author": "JamesXX",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s a software problem.  They need a schedule online, which will reduce her calls to the 50% of employees that forgot their password.",
                    "score": 89,
                    "author": "hpy110",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I can assure you they have something because she's always complaining they could have looked up the information themselves! I guess that's a user problem she needs to deal with instead, getting them to do that before texting. (Though as you say, she'd still have those password people texting!)\n\nStill, how would this apply to employees with questions after work? I assume they'd be out of luck too?",
                            "score": 20,
                            "author": "JamesXX",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They keep doing it cause they keep getting results from her. Have her text them a link to where they can get the info themselves each time they ask until they become self sufficient.",
                                    "score": 27,
                                    "author": "[deleted]"
                                },
                                {
                                    "level": 3,
                                    "comment": "Tell her to text then the link to the schedule instead of their hours.\n\nShould help a bit.",
                                    "score": 11,
                                    "author": "Hefty-Brother584"
                                },
                                {
                                    "level": 3,
                                    "comment": "I think that it's better for those few employees to be out of luck (or just check things in time) than it is for your wife to have to be 24/7 close to her work phone just in case some dude can't check their schedule or something.",
                                    "score": 19,
                                    "author": "Efeverscente"
                                },
                                {
                                    "level": 3,
                                    "comment": "Oof, that’s crap.  My solution would be to stop giving them the answer and instead call the employee and waste 30 minutes of their time “helping” them use the system.  In the short term, your wife is twice as annoyed, in the long term those people will be retrained that it’s easier to do it themselves than use her for a crutch.  Don’t forget the super pedantic tone of voice, “like I showed you last time, click on the green button”.",
                                    "score": 5,
                                    "author": "hpy110"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "She is employed too, so she could argue that she isn‘t going to answer anything outside working time. If she does, she can track OT. \n\nIf she is, like me, self employed, and has employees texting all the time, no one cares :)",
                    "score": 17,
                    "author": "sirjimtonic",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "America's response: 6 day work week, constant contact with bosses, and you must thank you boss for letting you breathe the same air as them",
            "score": 241,
            "author": "UncleRicosArm",
            "replies": [
                {
                    "level": 1,
                    "comment": "Jokes on them I filled that air with my farts, and savor my own flavor.",
                    "score": 22,
                    "author": "P-Dub",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "The part \"gives employees the right to ignore their bosses after work\"\n\nIs so weird to me. I don't think I have ever felt like I needed to take a call from work when I was off. Some times they text but even then they always apologize for bothering me on my day off. Even as a teenager when I worked for McDonalds I never felt that I was going to get fired of they called me during off hours.",
            "score": 9,
            "author": "okarnando",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Fun fact, we have law that says they need to be able to contact you. During working hours. Nowhere does is say what type of contact.\n\nSo I gave them my e-mail. They wanted my private phone phone number, and at one point gave it to them. In good trust.\n\nI work irregular shifts, and sometimes they want to change the hours I work or add a few. But they need to contact me first and have my approval.\n\nThey became really stalky. Sometimes calling me 5 times in a row. Got fed up with it, and told them I a retracting my phone number and it was to be removed from all systems. They had to do so in accordance to our privacy laws. From then on, email contact only. When I am not at work, I ignore their emails completely\n\nSuffice to say, they were not amused. But they can't do jack shit about it.",
            "score": 7,
            "author": "9gagiscancer"
        },
        {
            "level": 0,
            "comment": "I'm personally not a fan of 10-hour days. I would have no time to do anything for myself after work, not to mention I'm pretty mentally tired after work already. Working from home certainly improved my situation though. I'm still advocating for a reduction in overall hours. \n\nThat said, I think this is definitely progress for employees. If there are people out there who'd rather get everything done like this, I'm glad they have the option to do so now. More flexibility in how you spend your current working hours is still good.",
            "score": 5,
            "author": "Leandir"
        },
        {
            "level": 0,
            "comment": "You don't need to be told you have the right to ignore your boss after work.  You inherently have the right to ignore your boss after work regardless of what anyone says.",
            "score": 3,
            "author": "guitarzan212",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Having an extra 4 days a month off doesn't sound like much..but when you put it in terms of a year, thats 52 days a year of less work, that is pretty significant.",
            "score": 49,
            "author": "psychoticworm",
            "replies": [
                {
                    "level": 1,
                    "comment": "Since when does an extra four days a month not sound like much? 4 weekends in a month if 8 days. 4 extra days is 50% more days off per month.",
                    "score": 38,
                    "author": "Lindvaettr",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This thread has [Dumbest Boy Alive](https://youtu.be/eECjjLNAOd4) potential",
                            "score": 3,
                            "author": "lamboat2019"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Read the article. It’s not less work, they’re moving from 8 to 10 hour work days.",
                    "score": 9,
                    "author": "skjcicoeldopcvjj"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I read that as “ignore their bosses at work” and I started packing...",
            "score": 12,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Given the right to ignore bosses after work?  Shit I do that now without issue.",
            "score": 5,
            "author": "PhilosophicalScandal"
        },
        {
            "level": 0,
            "comment": "Hail Belgium",
            "score": 5,
            "author": "DiscretePolitician"
        },
        {
            "level": 0,
            "comment": "4 day work weeks rock!",
            "score": 4,
            "author": "Few_Paleontologist75"
        }
    ]
}