{
    "id": "13wkwya",
    "score": 3,
    "title": "Need some advice (Hobby Genki not responding)",
    "author": "Neaeran",
    "date": 1685536142.0,
    "url": "https://www.reddit.com/r/animefigures/comments/13wkwya",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey guys,\n\nso like the title says, i need some advice since i pre-ordered a figure from Hobby Genki almost a year ago, paid for it but still have not received it yet. I tried to reach out to them multiple times over e-mail and on their website in the last 5 month without receiving any reply from them.\n\nThe figure is Barbara from Genshin Impact which was already released in december iirc. It's only my second order over the site and i had only heard good things about them beforehand (the second order arrived without any issues) so i'm really confused to what the problem is.\n\nThanks in advance for any replies!",
    "comments": [
        {
            "level": 0,
            "comment": "Are you leaving a message under your order details? That's the only way I can get them to ever reply and even then it takes like 3 days for them to.",
            "score": 6,
            "author": "PotatoTango4892",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, that's what i did. Two times already. The first one was in January but so far ... nothing.",
                    "score": 2,
                    "author": "Neaeran",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "thats unfortunate :( i ordered from them for the first time recently and it looks like they have shipped my order and just didnt tell me about it when i check my account, i hope they ship yours soon",
                            "score": 1,
                            "author": "Solarstormflare"
                        },
                        {
                            "level": 2,
                            "comment": "Just got an update on one of my orders from HG:\n\n \"Dear valued customers,  \n \n\nWe hope this message finds you well. We wanted to inform you that due to  recent events, we are currently experiencing a shortage in staffing. As  a result, there may be a slight delay in the processing and shipping of  your orders.  \n \n\nPlease accept our sincerest apologies for any inconvenience this may  cause. Rest assured that we are doing our best to fulfill your orders as  soon as possible and keep you updated on the status of your order.  \n \n\nThank you for your understanding and continued support.  \n \n\nBest regards\"",
                            "score": 1,
                            "author": "PotatoTango4892"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "They can be very inconsistent with their response times. A few days ago they replied to me only after 10 hours. Other times it's days or weeks. Continue with trying the messaging board on the order detail page. Send them a message every day, if you must. If they still don't respond try reaching them through their twitter, instagram or facebook. Just a warning, but I've heard they can be quite rude when contacted this way, but if there is no other way, that doesn't matter.",
            "score": 2,
            "author": "IxianNavigator",
            "replies": [
                {
                    "level": 1,
                    "comment": "Okay, thanks for the suggestion. I'll try messaging them some more. \nAnd well ... i don't even care if they'd ban me afterwards, i doubt i'll order there again after this experience.",
                    "score": 2,
                    "author": "Neaeran",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I also had some bad experiences with them.\n\nActually the reason for me contacting them this last time was that they didn't ship a paid order even after one month. When I contacted them they said that the order was stuck somehow. At least after this they already shipped the figure today.\n\nSome time before this I had a bunch of items sitting in the \"private warehouse\", and I asked them to group these into packages in a way that none of them should exceed the duty fee limit for EU (if the value goes over that I'd need to pay extra fees). They said nothing to this, but went and grouped the items somehow. However they made only two packages (they sent two separate payment requests for shipping fees). Knowing the values of the items, it was simply impossible with just two packages to go under the value limit. When I asked them to regroup the items into more packages, they said that's impossible, because the packages are ready to ship, together with shipping labels, and they simply won't break open the boxes. At this point I didn't even paid for the shipping, let alone select the shipping method, so what they said just didn't make any sense. After some back and forth I just asked to cancel all the orders. Btw they also weren't willing to say which items ended up in which package, saying the simply don't know that.\n\nAnd before this I also had an order where at first they tried to give me a higher shipping fee. Fortunately they lowered it after asking about it.\n\nI still have some preorders with them, but I don't intend to pay and go through with those. (I already reordered those at other shops.) Btw I don't really know how to get banned by them. For example as it seems nothing happens after you don't pay for your preorders. They will cancel it after some time, but if there is still stock you can just reorder it.",
                            "score": 3,
                            "author": "IxianNavigator",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Damn, that sounds awful. I hope the rest of your orders arrive without problems. I usually order over Big in Japan and never had a problem with them. Guess i'll keep ordering there ...\n\nBtw, yesterday i messaged them again and asked for a refund and lo and behold ... the package is on the way now. Apparently the \"invoice was stuck in the process\".",
                                    "score": 1,
                                    "author": "Neaeran",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah, that's the same thing they responded to me as well. It's already shipped for me as well. This order was the one before the last.\n\nThe last one is an order that still worth not giving up, it also needed to be paid immediately at the time of ordering. It's a GSC Online exclusive Nendoroid, which type of preorder usually only can be gotten more expensive from alternative places, but for some reason it had a serious discount at Hobby Genki from the start for a very short while. So I will go through with this last one, and that's it. I simply won't pay the rest of my preorders with them.\n\nI also have lots of preorders with Big in Japan, I primarily used them before I had the great idea to transfer what I can to Hobby Genki. So I also returned to preorder with them primarily.\n\nBut honestly lately Big in Japan too doesn't seem to worth it, at least for me. For one thing now more often they have slightly more expensive prices than AmiAmi. Secondly, they stopped offering Surface Parcel shipping to my country. Their reasoning is that because other type of parcel shipping got to be available. But those are more expensive. \n\nAmiAmi still has Surface, so I probably will place my new orders only there.",
                                            "score": 1,
                                            "author": "IxianNavigator"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}