{
    "id": "13zaxb0",
    "score": 203,
    "title": "Prettified the pretty boy BL shelf with accessories!",
    "author": "CirrocumulusCloud",
    "date": 1685794209.0,
    "url": "https://www.reddit.com/r/animefigures/comments/13zaxb0",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "I really think the yellow flowers add a lot to the shelf. It looks very good with the Banana fish figures.\n\nOof the koto ash and eiji. 😍 At this point, I can only hope a rerelease would happen because the aftermarket is horrible. 😵",
            "score": 11,
            "author": "_coco_8",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you! I definitely structured it in a way that benefits the Banana Fish boys. \n\nUgh yeah, that aftermarket is insane. I got them when they first released, best decision I ever made. I am still hoping beyond hope that Megahouse will give us Eiji to fit Ash, because that staircase-shootout scene totally had Eiji being protected by Ash in the manga.",
                    "score": 8,
                    "author": "CirrocumulusCloud"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I like the top left one a lot",
            "score": 6,
            "author": "IndividualChart6016",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you! That's the Ash + Eiji figure from Kotobukiya. Unfortunately the aftermarket for this one is straight up evil.",
                    "score": 4,
                    "author": "CirrocumulusCloud",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh damn",
                            "score": 1,
                            "author": "IndividualChart6016"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Still waiting on the day to be able to afford the Kotobukiya—\n\n…Especially since I just bought the new Vash Kotobukiya and Statue Ring Style Ash from GSC. 💀 As a fellow BL enthusiast, I love this shit.",
            "score": 4,
            "author": "badguywindow",
            "replies": [
                {
                    "level": 1,
                    "comment": "Honestly the Koto figure isn't worth anything upwards of 300$ in the aftermarket. As amazing as the pair figure is, the details pale in comparison to Megahouse Ash. \n\nAhhh I pre-ordered the new Vash as well!!! If I had more space in my BL section I would have gotten the Ring Style Ash as well; it looks beautiful in pictures.",
                    "score": 1,
                    "author": "CirrocumulusCloud",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s valid, glad you said something. In my head I worked it up to this incredible thing but okay, noted. Maybe I’ll save my $700 haha. Hence why I have the Megahouse Ash like god*damn* it’s beautiful. \n\nI hope the Statue Ring Ash looks just as good as the Megahouse, it’ll be exciting!\n\n*Also okay yes Koto fucking killed it on that Vash I’m losing it he looks gorgeous.*",
                            "score": 2,
                            "author": "badguywindow",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The biggest draw of the Koto figure is definitely the fact that it is the ONLY non-chibi Eiji we have. The scene with Ash sitting mirrors the picture Eiji took, but it's only really accurate if you got the bonus face (which I don't have). Props to the overall flow of the figure though, it's really well constructed and keeps your interest. It's just *not* worth the 700$+ the aftermarket asks.\n\nI'd love to see your display once your Ring Style Ash gets to you! =) Always enjoy seeing Banana Fish shrines.\n\nThey diiid. I was fortunate enough to pre-order the bonus smiling face one; Trigun Stampede was my favourite recent anime and all the other Vash figures are so hard to come by now. I gotta have him!",
                                    "score": 2,
                                    "author": "CirrocumulusCloud",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I didn’t get the bonus faces by choice: I *always* lose the additional faces / poses. *Always.* So I save my money and go with one. Though Statue Ring will have multiple hands and I’m sweating bullets bro. 💀",
                                            "score": 1,
                                            "author": "badguywindow"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hello fellow BL enthusiast 😏 love your collection ❤️",
            "score": 6,
            "author": "Patient_Constant3854",
            "replies": [
                {
                    "level": 1,
                    "comment": "Heya~ It's pride month so it only felt right to post a lil BL shelf update. ♡ Any series you'd recommend? I'm currently reading MDZS. And do you have any BL figures yourself?",
                    "score": 3,
                    "author": "CirrocumulusCloud",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I read mostly Korean BL:\n1. Low tide in twilight \n2. Painter of the night \n3. Back to school \n4. Limited run\n\n5.Roses and champagne \n\nThose are the ones I can think on top of my head. I read so many haha 😅\nI used to own a couples, such as Aoba from dramatical murder, the Max factory ver and the Native version. Ren from Good Smile company as well. I’m not sure if I should count “Free!” as BL but I had so many of them too. But I sold it all because I don’t find joy in the series anymore, now mostly obsessed with Korean BL haha\n\nEdit: omg I just noticed you have a bunch of Hitman reborn figures too, it’s rare to find someone who likes that series because it’s so underrated!!",
                            "score": 1,
                            "author": "Patient_Constant3854",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's a lot of Korean BL! I'm not suuuper big into Manwha, but I'd love to check those out eventually! \n\nAww I'm sad that you got rid of your Dramatical Murder ones. I'm hunting for the fancy Aoba figure but the aftermarket is hell, and I have the Native Aoba x Koujaku on pre-order.\n\nYeees KHR! got me into Anime! Tsuna is super special to me, which is why KHR! is the only series in my collection that has a whole shelf just by itself which I bought in preparation for the 1/6 Tsuna Resin Statue by Taka Corp Studio.",
                                    "score": 0,
                                    "author": "CirrocumulusCloud",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Super jealous of your shelf!! Ash and Eiji look so good together + the flowers are cute! Are you thinking to get the Freeing Ash as well?\n\nTagging on to add for Korean BL Under the Green Light is spicy as well\\~ \\*edit to add On and Off is fluffier less smut ish\n\nFor JP BL I love Twittering Birds Never Fly, Blue Morning, Classmates, and a whole bunch of other series hehe.\n\nFrom the same author as MDZS I like their series Tian Guan Ci Fu (Heaven Official's Blessing) if you haven't read that yet!",
                                            "score": 1,
                                            "author": "helpmewithmyskinlems",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Thank you so much! &lt;3 I'd love to get the Freeing Ash, but I doubt I have room for him in this shelf (and some other figures like the Aoba x Koujaku by Native have higher priority for me). Would totally grab another Eiji if any company ever makes one, though!\n\nOhhh I've seen Twittering Birds Never Fly mentioned quite a bit on twitter, I think I'll definitely check that one out, then. &lt;3 \n\nI heard lots of good things about Heaven Official's Blessing! =) But I haven't read it (yet)!",
                                                    "score": 1,
                                                    "author": "CirrocumulusCloud",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Haha totally understand! I also have the Aoba x Koujaku also on PO and keep needing to remind myself to not be tempted by other figures otherwise I won't have space lol. Yes please!! Any Eiji would be great.\n\nHave fun reading!! &lt;3",
                                                            "score": 1,
                                                            "author": "helpmewithmyskinlems"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is that a pin Towa is standing on?  For a second there, I thought I might've thrown out my own towa nendoroid's stand 😬.  It fits him just right.",
            "score": 3,
            "author": "myst_fende",
            "replies": [
                {
                    "level": 1,
                    "comment": "It is actually a can badge from a Slow Damage Kuji! It also doubles as a mirror - the underside has the mirror, kept safe from scratches by tape, and I decided to just repurpose it as a stand for him! I think it was a D price - I bought it in a lot together with the really cool Euphoria Wallscroll from the newest Slow Damage Kuji. I have a white one as well, guess it came in all of the boys' main colors or at least various ones.",
                    "score": 2,
                    "author": "CirrocumulusCloud"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Nice!",
            "score": 2,
            "author": "Disastrous_Phrase_74"
        },
        {
            "level": 0,
            "comment": "amazing, love this!!!",
            "score": 2,
            "author": "Solarstormflare"
        },
        {
            "level": 0,
            "comment": "What’s the name of that anime figure on top shelf, standing up with grey pants and pink shirt?",
            "score": 2,
            "author": "LackEnvironmental187",
            "replies": [
                {
                    "level": 1,
                    "comment": "That is Eiji from the anime/manga Banana Fish! He and Ash (blonde sitting next to him) are the protagonists. Banana Fish is less a Romance than it is a story about drugs, war and child abuse however - it is an amazing narrative but I wouldn't recommend it if you cannot handle such subjects. Ash and Eiji have a romantic relationship, though the depth of it is not of sexual nature and more akin to a soul mate type of romance.",
                    "score": 2,
                    "author": "CirrocumulusCloud"
                }
            ]
        }
    ]
}