{
    "id": "140nqkr",
    "score": 6,
    "title": "any Canadians which store would you recommend ordering from?",
    "author": "Familiar-Clothes8116",
    "date": 1685907378.0,
    "url": "https://www.reddit.com/r/animefigures/comments/140nqkr",
    "media_urls": [
        "https://i.redd.it/ectnqy5wz14b1.png"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Avoid US-based stores whenever possible. The conversion is god-awful. My primary sites are AmiAmi, GoodSmile Global, and Mandarake for pre-owned. \n\nThe yen to cad conversion has been pretty good lately, the only downside is how much the shipping is. There are Canadian stores like Navito World (Ontario) and Hobby Bee (BC) but I have found the markup to be too much for my preference. \n\nIf you're ever looking for China-exclusive figures, there's an Australian site (cant remember the name) that didn't seem that bad but I've never used it personally.\n\nTokyo Otaku Mode can be good for the points/cashback programs if it's the only/main site you use, but again, usd to cad.",
            "score": 3,
            "author": "DisposeGray",
            "replies": [
                {
                    "level": 1,
                    "comment": "This figure is not available from amiami and is not a good smile product. It’s available from hobbie bee but it’s 200cad",
                    "score": 1,
                    "author": "Familiar-Clothes8116",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Whoops completely missed that it's a limited pre-order, my bad. So converting 116 usd is (currently) 155 cad. I'd see how much shipping would be from a US based site and judge based on that",
                            "score": 3,
                            "author": "DisposeGray",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I hadn’t heard about navito world even though I live in Toronto. I’ll give them a look also in the future but this one is even more expensive, 215CAD from their store. TOM offered me a $10 off coupon so I’ll probably order from them. \n\nThanks for the help",
                                    "score": 1,
                                    "author": "Familiar-Clothes8116"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'd recommend Tokyo Otaku Mode out of these three.\n\nIf you register for the Premium Plan at purchase, you'll save 13$ - so it'd be 103.99 US$. Since the order is over 100$, you can get free shipping (and when you do free shipping- they'll mark the value of the figure at a low amount, normally 30$- so you won't get hit with customs / fees / taxes.) Free Shipping is via boat, though - so a few months.\n\nIf you don't want the free shipping- you can still register Premium and put your Birthday as a day in June - you'll get a 10% Off Coupon you can apply to it as well.\n\nYou can't apply the Birthday &amp; Premium Discount with free shipping - unless you add something else - because the total cost would drop below 100$. So the free shipping wouldn't be available.",
            "score": 2,
            "author": "aiKaiz",
            "replies": [
                {
                    "level": 1,
                    "comment": "They also offered me $10 off first time buyer so I’ll order it there. Thanks",
                    "score": 2,
                    "author": "Familiar-Clothes8116"
                }
            ]
        },
        {
            "level": 0,
            "comment": " the ichiban kuji one is better though. the head on this abit disproportionate \n\nhttps://myfigurecollection.net/item/1707935",
            "score": 2,
            "author": "VaIentineX",
            "replies": [
                {
                    "level": 1,
                    "comment": "It looks like it’s 1/4th scale and Probably won’t fit my 6’ action figure collection tho",
                    "score": 1,
                    "author": "Familiar-Clothes8116"
                },
                {
                    "level": 1,
                    "comment": "it’s 30cm. so about it’s about 1/5.5 size",
                    "score": 1,
                    "author": "VaIentineX"
                }
            ]
        }
    ]
}