{
    "id": "142w4pk",
    "score": 148,
    "title": "My Small Figure Collection after 1 Year",
    "author": "LazyLavaLizard",
    "date": 1686092260.0,
    "url": "https://www.reddit.com/r/animefigures/comments/142w4pk",
    "media_urls": [],
    "other_urls": [],
    "postText": "Thought I'd share my \"small\" figure collection with you guys. I'm not sure what to do about the ugly background though, the house I live in is pretty old to be honest. But yes, I'm horribly addicted to Pop Up Parades 😄",
    "comments": [
        {
            "level": 0,
            "comment": "If only GSC kept the bases the same for this series. The inconsistency is bothering me. 😭",
            "score": 14,
            "author": "SylphSeven"
        },
        {
            "level": 0,
            "comment": "I'm a tiny bit worried about how many I'll have in Year Two. You guys weren't kidding about Figure Collecting being truly addicting!",
            "score": 7,
            "author": "LazyLavaLizard",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ive been collecting for 8 month's now and currently have 13 figured, its is extremely addicting.",
                    "score": 3,
                    "author": "Lilcloddot"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think Weiss looks the best out of the Ice Queendom PuPs",
            "score": 6,
            "author": "CliveTolnay",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, she's my favorite of the new designs from the anime. Also, you wouldn't believe how heavy her PUP is compared to others.",
                    "score": 3,
                    "author": "LazyLavaLizard"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Oh, how the changing of the PUP bases within the same line of figures just breaks my heart. Still gorgeous collection, though!",
            "score": 3,
            "author": "SpeechLegacy"
        },
        {
            "level": 0,
            "comment": "Your collection looks amazing so far! It's so hard for me to pick any favorites! (Although I suppose they'd have to go to Rimuru and the characters from Gurren Lagann!) You have good taste. (:",
            "score": 3,
            "author": "SagetheWise2222",
            "replies": [
                {
                    "level": 1,
                    "comment": "🙂",
                    "score": 2,
                    "author": "LazyLavaLizard"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Looks great! If you’re not happy with your wall you could always try hanging some posters or tapestries!",
            "score": 3,
            "author": "MegaShinkiri",
            "replies": [
                {
                    "level": 1,
                    "comment": "Of course, I'm not sure why I forgot that was an option.  xD",
                    "score": 1,
                    "author": "LazyLavaLizard"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Love this, recently started rwby. Currently on season 5",
            "score": 2,
            "author": "mm41806",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nice, let me know who your favorite characters are!\n\n I pretty much like them all, but Weiss, Jaune, and Ruby are my favorites. And then there's Qrow, how can anyone not like Qrow? Haha.",
                    "score": 2,
                    "author": "LazyLavaLizard",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Same, I like all of them. Out of the main 4, weiss is my favorite. And yeah qrow is such a badass oh and can't forget about pyrrha",
                            "score": 3,
                            "author": "mm41806",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "RIP best girl",
                                    "score": 3,
                                    "author": "eebie90"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I like that you got the best version of each RWBY PUP; regular Ruby and Yang with IQ Weiss and Blake",
            "score": 2,
            "author": "DarkAres02",
            "replies": [
                {
                    "level": 1,
                    "comment": "Haha, yeah. As soon as the Ice Queendom PUPs were announced, I knew what needed to be done xD",
                    "score": 1,
                    "author": "LazyLavaLizard"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That’s awesome! Love the rwby and Pokémon figures, where did ya get them? (Also started watching rwby recently)",
            "score": 2,
            "author": "Waluigiwarrior",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks!\n\n Ruby was from Goodsmile US. Nate, Rosa, Blake, Yang, &amp; Weiss were from Ami-Ami. Some of them may be out of stock on those websites though now.",
                    "score": 2,
                    "author": "LazyLavaLizard"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I've got all the main show rwby ones but I'm torn on the ice queendom ones.\n\nThe character designs and therefore the figures are gorgeous but I really didn't enjoy the show:/\n\nStill looking for kamina and Simon :(",
            "score": 2,
            "author": "HopelessJune13",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, the new anime didn't seem to please everyone. But Weiss is one of my favorite characters, so it was hard not to like an entire show basically about her. (&amp; Blake sorta)",
                    "score": 1,
                    "author": "LazyLavaLizard"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Looks amazing! I love the way u arrange the figures, a lovely presentation UwU!!",
            "score": 2,
            "author": "nik0rela"
        },
        {
            "level": 0,
            "comment": "If you want to change the background, a long tapestry may help. Or a couple normal B2 sized.",
            "score": 2,
            "author": "TallDrinkOSuntea"
        },
        {
            "level": 0,
            "comment": "On the 3rd pic, who's the girl in the top left?",
            "score": 2,
            "author": "Sneaky_42",
            "replies": [
                {
                    "level": 1,
                    "comment": "She's an Original Character Figure from Funny Knights/Aoshima made in 2012. \"Ichigo-chan\" I think? I saw her on AmiAmi Pre-owned early this year and just had to pick her  up. \n\nWarning: She's semi-cast off: https://myfigurecollection.net/item/108832",
                    "score": 2,
                    "author": "LazyLavaLizard",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks!",
                            "score": 1,
                            "author": "Sneaky_42"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What retailer did you order Blake from? Mine is still in Pre-order limbo on GoodSmile US and is expected to come this month🥲",
            "score": 1,
            "author": "Youngst3rCalvin",
            "replies": [
                {
                    "level": 1,
                    "comment": "Last time I got a PUP from Goodsmile US it took many extra months than if I had ordered it elsewhere",
                    "score": 1,
                    "author": "SpeechLegacy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, I’ve started to look into AmiAmi seeing that their release dates (and pricing) are much earlier/better, depending on what shipping type I choose, but the shipping price concerns me.",
                            "score": 2,
                            "author": "Youngst3rCalvin",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Honestly, I reached a point where I'd rather wait for the extra shipping than see a US release get delayed for an additional year. I live in the US and I mostly order PUPs and prize figures (usually older ones from the preowned section). \n\nMy last shipment that was just a PUP alone (it was toge inumaki) was 5,900JPY total (3300 jpy figure + 2600 JPY shipping). And I think that was DHL. DHL price is based on box size and SAL is usually always the cheapest but not available after a certain size and will take longer bc big boat is slow. DHL delivers in under 2 weeks as long as there are no holidays. I've actually received packages within like 4 days before. And you get a cute postcard. \n\nIf you ever see something you want that's labeled as in stock you can actually ask them what the estimated shipping would be.",
                                    "score": 1,
                                    "author": "SpeechLegacy"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I pre-ordered mine off of BigBadStore first. But I then canceled and pre-ordered her off of Ami-Ami when they had her in-stock again, since they ship earlier.",
                    "score": 1,
                    "author": "LazyLavaLizard"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Where did you get Esdeath?",
            "score": 1,
            "author": "One-Goose98",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh, you mean the Nightmare Weiss? I pre-ordered her off of Ami-Ami. I remember her selling out pretty quickly though.",
                    "score": 1,
                    "author": "LazyLavaLizard"
                }
            ]
        }
    ]
}