{
    "id": "1437386",
    "score": 17,
    "title": "Any good way to track new releases?",
    "author": "SamuSeen",
    "date": 1686125247.0,
    "url": "https://www.reddit.com/r/animefigures/comments/1437386",
    "media_urls": [
        "https://i.redd.it/fany4qwzzj4b1.png"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Besides MFC and their alerts?\n\nI also follow GSC on Twitter",
            "score": 16,
            "author": "sleeplessowlette",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not really a twitter user in any capacity :(\n\nI'll try out MFC alerts tho.",
                    "score": 2,
                    "author": "SamuSeen"
                },
                {
                    "level": 1,
                    "comment": "Genuine question, how do you set up those alerts on MFC?",
                    "score": 1,
                    "author": "Johnnydude912",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Do you can setup general alerts for lists but if you want individual alerts you can go on the item page and hit any notification button you want (it looks like a bell and it's usually near the top right of the part you want alerts for). For example, if you want alerts for comments you hit the notification button on the comment section. If you want alerts for updates to the item description (eg the release date gets updated when it gets delayed or the exact release date gets announced etc), you go to the bottom and hit the button for the changes section",
                            "score": 2,
                            "author": "sleeplessowlette"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "buyfriend.moe is what I typically use for amiami. Really easy to use",
            "score": 5,
            "author": "AlterTree",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;buyfriend.moe\n\nAlso works with Mandarake, sounds great and I will definitely try it out.",
                    "score": 1,
                    "author": "SamuSeen"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sign up for email alerts at Tokyo Otaku Mode and tag every category or series you're interested in.  Even if you shop elsewhere, TOM usually is fast with the notices.",
            "score": 3,
            "author": "Draken_Zero"
        },
        {
            "level": 0,
            "comment": "I'm currently obessed with checking amiami for a certain figure multiple times a day for the next few months untill december when she's getting her release.\n\nonly because I missed her pre order window by one day. on the day I wanted to pre order her, they closed it. \n\n\nI am so determend to catch her on the next chance. Somebody will eventually drop their pre order. I am sure of it.\n\nBut if you find a better way than daily checking then lmk please.",
            "score": 2,
            "author": "PridePurrah",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ami ami updates preorder stock at around 4am edt, it won’t update any other time in the day",
                    "score": 1,
                    "author": "TheAnimeBox"
                }
            ]
        },
        {
            "level": 0,
            "comment": "https://www.hpoi.net/hobby\n\nIf you scroll down to Latest Information, it shows you all the latest updates including delays, things going to for preorder, and announcements. \n\nIf you go to the fourth tab in that section, it only shows what has opened up to preorders. It's great for tracking what's coming out, ready for preorders.",
            "score": 2,
            "author": "Jolly_Green_Giant"
        },
        {
            "level": 0,
            "comment": "If you have twitter I highly recommend following @Ruru_Berryz they are amazing when it comes to keeping up with new figure releases and are great for keeping up with events like Wonder Fest and Mega Hobby Expo. As for websites I would recommend [nekomagic](https://www.nekomagic.com/) they have weekly blogs that shows all the upcoming figures that were announced/released that week, and for each figure they show the Manufacturer, Scale, Product Type, Announcement,\nRelease Date, and Price. They are also great with covering events like stated previously. Hope this helps!",
            "score": 1,
            "author": "AceRapidGamer"
        }
    ]
}