{
    "id": "144y9kb",
    "score": 2,
    "title": "Question about AmiAmi",
    "author": "Shiroisinsane",
    "date": 1686295091.0,
    "url": "https://www.reddit.com/r/animefigures/comments/144y9kb",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi everyone, I had a question of why AmiAmi seems so behind on orders lately? I haven’t bought from them in awhile but it seems like they’re having trouble fulfilling orders (I’ve mainly seen it be a issue for surface shipping) for others and now I’m hesitant if I should order from them again. I heard of people apparently waiting months even after release until their order finally shipped. What’s your experience lately with AmiAmi? The last time I ordered from them was in 2021.",
    "comments": [
        {
            "level": 0,
            "comment": "They were much much more behind shippings just until a very few months ago, when they visibly changed something. Before then in my experience it almost became the norm that they shipped packages 30 days after payment. But just now they shipped out a surface package of mine after 8 days, but I had some other recent packages that were shipped more quickly. \nBtw the trend of lengthening shipping times started to become really noticeable around summer last year.\n\nI also keep track all of my order data, so I made a graph out of it:\n\n[AmiAmi: Days untils shipping after payment](https://i.imgur.com/h7hv9zJ.png)\n\nUpdate: [same kind of graph for Mandarake](https://i.imgur.com/ulK0Yy8.png)",
            "score": 30,
            "author": "IxianNavigator",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yikes, looks like it really was pretty bad months before but is substantially better now. Thanks for the graph though, really helps give a better perspective.",
                    "score": 4,
                    "author": "Shiroisinsane"
                },
                {
                    "level": 1,
                    "comment": "I love that you tracked this data and graphed it. So many upvotes!",
                    "score": 3,
                    "author": "CyberFawlty"
                },
                {
                    "level": 1,
                    "comment": "looks like surface is going faster, my surface package that shipped a couple weeks ago took 2 weeks to ship.\n\nI am assuming my surface premium is on a boat, or pending processing on land in the US somewhere.",
                    "score": 2,
                    "author": "carenard",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, shipping times also could vary by destination. My data is only for my country in the EU. For me older data suggests that surface generally takes longer to ship out, but recent data largely eliminated that difference.\n\nBtw I always thought it's weird that for Surface Premium they can't even send notification about when the package leaves their hands (that is AmiAmi/Japan). I mean that's how it works, right? You in the US only get update once it got there.",
                            "score": 3,
                            "author": "IxianNavigator"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It has definitely improved over the past few months. Multiple stores seemed to be moving slower than in the past back at the beginning of the year, but I think AmiAmi had the worst time of it. I think they just didn't have enough people to pack and ship the orders. If they hired more over the spring, that would explain the improvement.",
                    "score": 1,
                    "author": "cyborg_spaceman"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It'll arrive eventually. With regular Surface Shipping, they also have to wait until JP Post fills up an entire shipping container and for it to be slotted in and shipped out. With Surface Premium, it has to wait for amiami to accumulate enough orders to fill a shipping container on their own, so it can take longer. In my (years) of ordering from amiami, there's always been a delay between order paid-for and then shipped (via surface).",
            "score": 5,
            "author": "CliveTolnay"
        },
        {
            "level": 0,
            "comment": "Not just lately. They have been late for months now. Personally I can confirm that this was already the case in November 2022.",
            "score": 2,
            "author": "This_Seal"
        },
        {
            "level": 0,
            "comment": "The delays between payment and shipment are mainly an issue with surface shipping. If you use DHL/EMS, the delays aren’t as bad. I usually use DHL and my packages have been shipped out within one to three days lately.",
            "score": 2,
            "author": "SamuelsWeebAccount"
        },
        {
            "level": 0,
            "comment": "Hi! Im from Manila, ive twice ordered in the past three months. It took4 to 5 days for my order to be shipped plus 4 days when I got the tracking number.total days almost 8 to 9 days overall.",
            "score": 1,
            "author": "yourINFJTguy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh, ahipping both cases via EMS.",
                    "score": 1,
                    "author": "yourINFJTguy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I paid my surface shipping order during a weekend and they sent it out as soon as Monday hit . Could’ve been a lucky batch but it surprised me lol \n\nEvery other order before that has taken them at least 3-5 weeks to ship maybe they’re doing better who knows 🙅🏻‍♀️",
            "score": 1,
            "author": "Yumeari"
        },
        {
            "level": 0,
            "comment": "Miami has never failed me. If I had this issue I would still give them my money. I have bought pre-owned and new. Never gotten a broken fig and shipping prices are okay.",
            "score": 1,
            "author": "RiaFeira"
        },
        {
            "level": 0,
            "comment": "dunno made 8 orders last month and everything is shipping on date!",
            "score": 1,
            "author": "Bliksem89"
        }
    ]
}