{
    "id": "145ac23",
    "score": 134,
    "title": "Anna &amp; Megumi by Dishwasher1910, what do you think?",
    "author": "Reiss81",
    "date": 1686329296.0,
    "url": "https://www.reddit.com/r/animefigures/comments/145ac23",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "They look great!\n\nAlthough, if I had to mention a negative, it’s the fact that Megumi’s hands aren’t grasping her own thighs like in the illustration. I find that incredibly sexy and it’s a shame that the figure itself lacks this particular detail. That, and the fact that they added socks when she’s barefoot in the illustration for whatever reason. Bare feet and painted toenails in that pose would’ve been hot af, but that’s probably the foot fetishist in me speaking, lol",
            "score": 13,
            "author": "Judgment526",
            "replies": [
                {
                    "level": 1,
                    "comment": "I wasn't aware of this figure, and tbh if they've make the exact same as the illustration ( barefoot ) i was already on my way to get this figure even at high price. With the socks it's kinda meh imo.",
                    "score": 2,
                    "author": "Namiriu"
                }
            ]
        },
        {
            "level": 0,
            "comment": "They gotta start making the beauty marks more natural they just look like spots 😭",
            "score": 8,
            "author": "Verifieddumbass76584"
        },
        {
            "level": 0,
            "comment": "The most explicit item yet in my collection, those ladies are looking forward to some action (even if Anna is a bit intimidated)!\n\nThinking about it, I must be really naively confident that I spent so much money on an unproven manufacturer.\n\nWhether it paid off or not, I'll let you forge your own opinion, but I had a lot of fun taking pictures of them.",
            "score": 3,
            "author": "Reiss81"
        },
        {
            "level": 0,
            "comment": "I think my room is all ready Rated-R without this in my display as is. 😆",
            "score": 2,
            "author": "Theoretical_Grey"
        },
        {
            "level": 0,
            "comment": "Looks nice. Can the skirts be removed?",
            "score": 2,
            "author": "SiHtranger",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thechnically the one from Megumi can but they are required otherwise there would be a huge gap.",
                    "score": 1,
                    "author": "Reiss81",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I see thanks. A pity, but still nice pair nonetheless",
                            "score": 1,
                            "author": "SiHtranger"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would solely go for Anna. The MFC pages for them had comments saying the project was cancelled making me think they have been scrapped. So I missed the chance to pre-order.",
            "score": 2,
            "author": "Tokitokisayuki"
        },
        {
            "level": 0,
            "comment": "What I think about it? Well.\n\n\n\nSir Dishwasher1910 is one of the best names ever. May his water tubes and filters always be clean.\n\n\nDid I just click on this for the name and only the name? Yes.",
            "score": 1,
            "author": "PridePurrah"
        }
    ]
}