{
    "id": "gvhre8",
    "score": 1402,
    "title": "It wasn't a huge collection but it was mine.",
    "author": "aralim4311",
    "date": 1591138036.0,
    "url": "https://www.reddit.com/r/animefigures/comments/gvhre8",
    "media_urls": [
        "https://i.redd.it/nanfrxcrsk251.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Not sure if this post is allowed, but I wanted to mourn what was left after the fire. Lost both shelves. Nothing super nice. Mostly cheaper Monogatari figures, and some Figma Fate and Evangelion stuff but it hurts to see.\n\nEdit\nEveryone here is so sweet it's making my cry a bit.",
            "score": 432,
            "author": "aralim4311",
            "replies": [
                {
                    "level": 1,
                    "comment": "It does not matter  if they were \"cheap\" or if they were \"expensive\", they meant something to you and that's something you can't put a price on. That is such a horrible thing to see. My condolences.",
                    "score": 311,
                    "author": "SuperToaster67"
                },
                {
                    "level": 1,
                    "comment": "Collecting “cheap” figures pulled me out of depression and eventually led me to meeting my fiancée. Don’t discredit your collection because of the cost. They meant something to you and that’s what matters. Rest In Peace",
                    "score": 72,
                    "author": "Sum-Duck",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah they were definitely helping with my depression I'd been dealing with at the time",
                            "score": 38,
                            "author": "aralim4311",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm glad it sounds like you've moved on from that place in the past, and I hope you come back stronger in future with some progress pics.",
                                    "score": 12,
                                    "author": "moguu83",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Oh definitely.",
                                            "score": 4,
                                            "author": "aralim4311"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Well you got a nice car and a cool lizard, so yeh proves that :p No i also started off in a bad mental state collecting prize figures actually, it motivated me to start working hard for money because i needed to have those really expensive ones, and i did",
                            "score": 3,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My condolences man.... This is a hard sight to see and those aren't even my figures. I feel and mourn for you man",
                    "score": 52,
                    "author": "CrimsonPlayhouse"
                },
                {
                    "level": 1,
                    "comment": "Dude it doesn't matter even if it's those Bandai. They're yours and clearly important to you. I only have figmas and Nendoroids, less than 10 in total. Not those expensive scales but I can't imagine the pain of losing those. I hope you get back soon, can be slow but it doesn't matter.",
                    "score": 8,
                    "author": "ThisWorldIsAMess"
                },
                {
                    "level": 1,
                    "comment": "Never say cheap that way when it comes to figures, like you said, no matter how small or how \"cheap\"; but it's yours . That's all that matters :)\n\nSorry to see it like that man. That maybe last in the priority list right now, but I hope you get your collection back .",
                    "score": 4,
                    "author": "YukhoChan"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Dude I’m so sorry to see this. I really hope you’re in a position soon where you can recover the things you’ve lost. I’m sorry this happened to you",
            "score": 166,
            "author": "noxiian",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you. Not sure how long it will be before I can replace everything. Insurance is giving us grief over everything but yeah I lost pretty much everything. It can all be replaced eventually but yeah it sucks.",
                    "score": 113,
                    "author": "aralim4311",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I had a lot of issues with insurance whenever I was robbed but if you’re patient with them, they’ll eventually get it together and help y’all out. I hope everything goes smoother soon for you, stranger. Stay positive through all of this and things will get better eventually &lt;3",
                            "score": 29,
                            "author": "noxiian",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you. I'm doing my best all things considered.",
                                    "score": 20,
                                    "author": "aralim4311"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I understand that! Our insurance had our backs (and I’m grateful for it) but holy crap did they fight us and try to short change us for every single item. We had a flood caused by city maintenance workers hitting a water line that poured uncontrollably for several days downhill and into our backyard.\n\nWas fun waking up to 4.5 ft of water in my basement as well as our storage room completely submerged. After the evaluation from our insurer we were given a 80-page booklet double sided with everything that was damaged. A lot of my collector items were rare and hard to find so they tried to just write a quick msrp for something and be done with it, many many revisions for done, but worth it.\n\nIn the end the house ended up sinking due to the amount of water that had flooded our property which cracked the foundation..... took 6-months for that payout too as well as living with a house partially covered... sorry your post made me rant. It gets better and I hope everyone was safe! It also hurts for people loose things they enjoy even if it’s something smaller.",
                            "score": 22,
                            "author": "Dyn-Mp"
                        },
                        {
                            "level": 2,
                            "comment": "Insurance companies are garbage. They're about making money and nothing else.\n\nBest of luck bro.",
                            "score": 7,
                            "author": "kemando"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Are u open to taking donations i have a few fate figure i could send u no clue whos ur favorite but i might have one or two u might like and to help cheer you up",
            "score": 132,
            "author": "MamaOppai",
            "replies": [
                {
                    "level": 1,
                    "comment": "That is incredibly kind of you",
                    "score": 61,
                    "author": "aralim4311",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hi OP, as someone who’s been collecting figures for like 10 years this crushes me to see. I’ve got a few Monogatari/Fate related figures that are just laying around that I’d be happy to send you, if you’re ever interested let me know.",
                            "score": 51,
                            "author": "tonyz723",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you, I'll definitely take you up on that. That is incredibly kind of you",
                                    "score": 15,
                                    "author": "aralim4311"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "If you're into vocaloid at all, I have a couple extra prize figures bnib I can donate. This picture embodies one of my greatest fears. My collection is pretty much irreplaceable.",
                            "score": 35,
                            "author": "Juleamun",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you very much, that is so very sweet of you.",
                                    "score": 14,
                                    "author": "aralim4311"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Don’t have any monogatari but I got a fate/extra prize figure of Rani if you are interested. I have no problem just sending it your way.  :3",
                            "score": 21,
                            "author": "HpyGoat",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you that is so sweet of you.",
                                    "score": 8,
                                    "author": "aralim4311"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Hey, I have [two Evangelion figures by Grimrock](https://gamesandcomics.it/catalog/8166-large_default/neon-genesis-evangelion-statues-ayanami-rei-sohryu-asuka-langrey-grimrock-mix-edition.jpg) and [a LoZ nendoroid](https://figurehouse.ru/wp-content/uploads/2019/12/1-1-8-2.jpg) that I can send your way if you want. PM me with your address and I will get to it sometime by the end of June. Hugs.",
                            "score": 7,
                            "author": "meteor_stream"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Same here. I have some Monogatari prize figures I could donate. Feel free to DM me, u/aralim4311.",
                    "score": 48,
                    "author": "kyzzyle",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Samesies. I have a few I need to purge to make room for new ones I want anyway :) You can DM me and I can send pics to see if ur interested",
                            "score": 20,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 8,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you I appreciate it",
                            "score": 2,
                            "author": "aralim4311"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This hurt my soul, I’m sorry you experienced this 😞",
            "score": 107,
            "author": "figuresnfunkos"
        },
        {
            "level": 0,
            "comment": "So sorry for that. What happened?",
            "score": 55,
            "author": "Quantum_Exia",
            "replies": [
                {
                    "level": 1,
                    "comment": "My brother committed suicide by burning down my home while me and the kids were asleep. We got out okay but yeah the house was lost.",
                    "score": 219,
                    "author": "aralim4311",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Jesus fucking christ. That's horrific. I'm so sorry... I'm glad you and your kids are safe at least.",
                            "score": 120,
                            "author": "cozyvanillabean",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you I am as well. Like I told them it's okay to feel sad about everything we lost but it can all be replaced what's important is that they were alive an unharmed.",
                                    "score": 79,
                                    "author": "aralim4311",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I’m sorry for your loss and I’m glad you and your family are safe. I wanted to point out that there are a few posts regarding how to describe things to the insurance company to make sure you don’t get screwed. Here’s the one that I read a few years ago (https://www.reddit.com/r/personalfinance/comments/43iyip/our_family_of_5_lost_everything_in_a_fire/cziljy3/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf), but I saw a few others that could help. Good luck.",
                                            "score": 68,
                                            "author": "pm-me-neurons",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Thank you for this",
                                                    "score": 35,
                                                    "author": "aralim4311"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Holy fucking shit, I'm so sorry :(",
                                            "score": 1,
                                            "author": "meteor_stream"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Sorry for your loss hope you're able to rebuild. \n\nAlthough it does seem somewhat questionable to burn down a home with you inside. Not only that but quite a painful death.",
                            "score": 27,
                            "author": "Slynthos",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He was suffering pretty badly from his delusions . It had been getting worse and worse over the last two years. I guess he couldn't take it anymore or he didn't even know where he was. That was fairly frequent where he would be so confused he had no idea where or what was going on around him.",
                                    "score": 35,
                                    "author": "aralim4311",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Hope you’re doing well man",
                                            "score": 4,
                                            "author": "Erratic_Penguin",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I'm doing as well as can be considering everything.",
                                                    "score": 4,
                                                    "author": "aralim4311"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I’m so sorry for your loss. I hope you and your loved ones are alright.",
                            "score": 23,
                            "author": "orionnebula54"
                        },
                        {
                            "level": 2,
                            "comment": "Figures are replaceable. A life is not",
                            "score": 41,
                            "author": "Mindless_Rage05",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Absolutely.",
                                    "score": 27,
                                    "author": "aralim4311"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I'm glad you and your kid are safe. Take care.",
                            "score": 8,
                            "author": "dumdau"
                        },
                        {
                            "level": 2,
                            "comment": "I am so sorry for your loss. I was hoping it was a candle or cigarette situation gone wrong.",
                            "score": 9,
                            "author": "Quantum_Exia"
                        },
                        {
                            "level": 2,
                            "comment": "It got so much worse do fast jesus dude.",
                            "score": 3,
                            "author": "GenuineSteak"
                        },
                        {
                            "level": 2,
                            "comment": "what an asshole",
                            "score": -29,
                            "author": "fapiholic",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not sure why people are downvoting you. It may be a sensitive topic, but he's certainly not wrong. Committing suicide is one thing, but trying to take out the entire rest of the family and their home at the same time is so much worse.",
                                    "score": 3,
                                    "author": "CommanderZx2",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yea he almost killed an entire family and destroyed a whole house. \n\nReddit sucks sometimes",
                                            "score": 3,
                                            "author": "fapiholic"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey OP, it's important to take care of yourself mentally too. Please seek out someone to talk with. I'm so sorry for your loss.",
            "score": 34,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you. I'm planning on getting myself and the kids into some therapy here very soon. I've been having pretty bad anxiety right before bed and haven't been doing well with the being in the dark.",
                    "score": 30,
                    "author": "aralim4311",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hope it gets better for you guys OP",
                            "score": 8,
                            "author": "LivingHazard"
                        },
                        {
                            "level": 2,
                            "comment": "Hold up, the being in the dark?! I hope that was a typo. Either way, so sorry for you, hope you get back on your feet quickly and forget all of this.",
                            "score": 3,
                            "author": "Tirfing88",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not a typo. I went back in trying to get my brother out. It was bad and I couldn't see. Being in complete darkness makes me feel like I'm back feeling my way in the hallway again unable to see. A dark room doesn't bother me if there is some ambient light but pitchblack gives me anxiety right now.",
                                    "score": 4,
                                    "author": "aralim4311",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The way it was written thought you said you weren't comfortable with \"the being (as in creature) in the dark\" D:  \n\n\nI feel you and I feel sorry for you, I kinda know how that feels. Thought I didn't experience the level of trauma you did, there was one night where I was l laid down trying to sleep and then I began feeling like I was about to die. My heart was racing, felt dizzy and had cold sweats, thought I was having a heart attack. It was later diagnosed as a severe panic attack, that was it.\n\nFor a year I could not sleep with lights off for some reason, I felt uneasy. I also slept with the door unlocked and fully dressed in case I felt like that again and needed to bolt up quickly to go to the ER. Anxiety is horrible and I wish you overcome it.",
                                            "score": 2,
                                            "author": "Tirfing88"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I got sick to my stomach looking at this. So sorry for your loss.",
            "score": 21,
            "author": "Eyle"
        },
        {
            "level": 0,
            "comment": "That sucks, man. I truly am sorry for your loss. But, at least the best pieces of your collection (your kids) are okay :)\n\nI hope you all can recover mentally. Once you do, I hope you can rebuild your collection. What kind of figures do you like?",
            "score": 29,
            "author": "emets31",
            "replies": [
                {
                    "level": 1,
                    "comment": "So very true. Yeah the mental recovery is no joke. I have severe anxiety at bed time right now.\n\nI was never particular on the types of figures but mostly got characters from the franchises I liked. Mostly Monogatari, Evangelion, Fate and Fgo, some Gundam builds and Haruhi stuff.",
                    "score": 24,
                    "author": "aralim4311",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was going to send a figure your way as a gift, but I don't have anything from any of those franchises.",
                            "score": 1,
                            "author": "emets31",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Understandable. Thank you for the thought though I really do appreciate it.",
                                    "score": 2,
                                    "author": "aralim4311",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "If you wanna send me your address, though, I'll see what I can muster up.",
                                            "score": 1,
                                            "author": "emets31"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Jesus.\n\nI'm really sorry this has happened, Utterly terrible and tragic for you and your family.",
            "score": 13,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "That's heartbreaking man. But you can start all over, at least.",
            "score": 7,
            "author": "Borsch3JackDaws"
        },
        {
            "level": 0,
            "comment": "At first I was wondering what I was looking at and after reading the comments, oh man that suxs! So sorry for u n the kids but glad u guys made it out safe!",
            "score": 7,
            "author": "Happik79"
        },
        {
            "level": 0,
            "comment": "Sorry to hear this, hope your safe dude",
            "score": 4,
            "author": "Kaito913"
        },
        {
            "level": 0,
            "comment": "Sorry for your losses.\n\nLook at it as maybe an opportunity to build something greater for your new collection after your family and yourself have recovered from everything.",
            "score": 7,
            "author": "naplex"
        },
        {
            "level": 0,
            "comment": "This genuinely hurts. A collection is a collection no matter the size. Heart goes out to ya dude",
            "score": 4,
            "author": "Blozzard779"
        },
        {
            "level": 0,
            "comment": "God bless.",
            "score": 5,
            "author": "mobile-nightmare"
        },
        {
            "level": 0,
            "comment": "Goddamn that sucks.\n\nCURSE YOU, 2020!",
            "score": 6,
            "author": "Equinoqs"
        },
        {
            "level": 0,
            "comment": "F\n\n\nThis is terrible my friend :(",
            "score": 4,
            "author": "RabiPOPshoo7erX",
            "replies": [
                {
                    "level": 1,
                    "comment": "F",
                    "score": 2,
                    "author": "pokeboi01",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "F mega",
                            "score": 1,
                            "author": "Mikko087"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sorry to hear about your brother. I'd also be deviated if this happened to my collection😰",
            "score": 4,
            "author": "LostTurtleB"
        },
        {
            "level": 0,
            "comment": "Oh my, so sad. You would have collected those figures with so much love. I have mine on a bookshelf which is generally a background for my YouTube videos.. I know how you feel. 😢",
            "score": 5,
            "author": "vinayak_nair"
        },
        {
            "level": 0,
            "comment": "i'm so sorry... all the figures are your figures, and they are all special! &lt;3",
            "score": 5,
            "author": "tacobellisadrugfront"
        },
        {
            "level": 0,
            "comment": "Sorry for your loss bro. It pains me see this, but losing a family is the most painful experience. Hope you and your family are safe.",
            "score": 6,
            "author": "labo2002"
        },
        {
            "level": 0,
            "comment": "Sorry for your loss man, as long as you and your family are safe.",
            "score": 4,
            "author": "alsenan"
        },
        {
            "level": 0,
            "comment": "Awful",
            "score": 4,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "It's really hurt...but a good news is you still alive! Keep safe anyway.",
            "score": 3,
            "author": "lam101aa"
        },
        {
            "level": 0,
            "comment": "Condolences to you bro :( Sucks for this to happen in general, but it sucks even more that it happened in the middle of a stressful pandemic. Hope you get to collect again in the future. Stay safe, i hope all goes well for you guys. God bless.",
            "score": 4,
            "author": "TradeOfJacks_"
        },
        {
            "level": 0,
            "comment": "Dude it hurts right in the meow meow.\nJokes apart, it's great that you and the kids are safe. I hope you recover soon.",
            "score": 4,
            "author": "amitrahi0404"
        },
        {
            "level": 0,
            "comment": "I’m so sorry for your loss. I wish you nothing but the best in these hard times. &lt; 3",
            "score": 3,
            "author": "Lynx_123"
        },
        {
            "level": 0,
            "comment": "I’m so sorry to see that this happened to you...I hope you can recover some of your losses. I’m very very sorry this is terrible.",
            "score": 3,
            "author": "melodramatic-fujoshi"
        },
        {
            "level": 0,
            "comment": "Yeah, stuff like this is why I submitted a list of figures and values to my insurance company. My collection has its own rider for up to $30k",
            "score": 3,
            "author": "Tornadodash"
        },
        {
            "level": 0,
            "comment": "I lost all my stuff in a wild fire a couple years ago so I know how this feels. It still bothers me every day. I hope you're doing alright.",
            "score": 3,
            "author": "SonnoMaku"
        },
        {
            "level": 0,
            "comment": "Hey OP. I live in Japan and I can check some second hand shops around where I am for any replacements. Just let me know what you're looking for. Happy to send a few your way on the house.",
            "score": 3,
            "author": "Hinote21"
        },
        {
            "level": 0,
            "comment": "Aww man i'm sorry :(. I've always feared something like this could happen to me. Mainly that a big earthquake could break my figures since I'm in California.",
            "score": 2,
            "author": "noimdirtyd4n"
        },
        {
            "level": 0,
            "comment": "Thats why I'm working on some renters insurance. Sorry for your loss though I fear for situations like that 24/7",
            "score": 2,
            "author": "Darth-Buldge",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes please get yourself renters insurance.",
                    "score": 2,
                    "author": "aralim4311"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Oooooooof. Seeing this physically pains me. My condolences.",
            "score": 2,
            "author": "GenuineSteak"
        },
        {
            "level": 0,
            "comment": "Dude I'm really sorry. hope you can recover especially in this hard times.",
            "score": 2,
            "author": "kym111"
        },
        {
            "level": 0,
            "comment": "F",
            "score": 2,
            "author": "fixing13"
        },
        {
            "level": 0,
            "comment": "F",
            "score": 2,
            "author": "Empress_Rach"
        },
        {
            "level": 0,
            "comment": "I am so sorry man :( it honestly sucks when something that meant something to you is destroyed.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Dang, I'm really sorry to see that. :(\nI hope you and everyone are okay. And I hope you can rebuild the collection too. &lt;3",
            "score": 2,
            "author": "trippycookie"
        },
        {
            "level": 0,
            "comment": "Damn.  Sorry to see this, pal - especially after reading the comments.  What an absolutely shitty day.   My condolences.\n\nF",
            "score": 2,
            "author": "CaptEvilStomper"
        },
        {
            "level": 0,
            "comment": "Some one get this man an F!!",
            "score": 2,
            "author": "Mmack64"
        },
        {
            "level": 0,
            "comment": "If you pm me your address I'll take a look at my collection and see what I can ship you. It won't be able to replace your collecton but it'll be a start :)",
            "score": 1,
            "author": "oquin70"
        },
        {
            "level": 0,
            "comment": "I'm sorry to hear something that brought you some joy turned out like that. I hope things start looking up",
            "score": 1,
            "author": "kaijubaum"
        },
        {
            "level": 0,
            "comment": "This is hurtful to see :( sorry man. A collection is a collection u collet with heart  and losing that it hurts",
            "score": 1,
            "author": "Black_nightstar"
        },
        {
            "level": 0,
            "comment": "God I dunno what I'd do in your position...\n\nI feel for ya man.",
            "score": 1,
            "author": "lowtier4life"
        },
        {
            "level": 0,
            "comment": "This hurts my soul. My collection isn't necessarily large either but it's mine and i'd be devastated if i lost it. so sorry to this happened to you man",
            "score": 1,
            "author": "Kennedyjf91"
        },
        {
            "level": 0,
            "comment": "This makes me really sad. I'm really sorry for your loss.",
            "score": 1,
            "author": "brwntwn123"
        },
        {
            "level": 0,
            "comment": "....I gotta get some insurance. So sorry to see this.",
            "score": 1,
            "author": "ExtremisEdge"
        },
        {
            "level": 0,
            "comment": "Sorry for your loss",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I’m so sorry this happened, I’m glad your kids are alright. Hopefully you can replace some pieces of your collection... I don’t have anything I can donate at the moment, but if I find anything I’ll let you know",
            "score": 1,
            "author": "linkxzelda"
        },
        {
            "level": 0,
            "comment": "I am so sorry for all you've gone through. I'm sure the figures are extremely symbolic of that struggle. I have a huge fear of fire and this would be my nightmare in so many ways. Please take care of yourself and your family! \n\nI'm not sure if you like Love Live at all (didn't see any mention in your previous posts/comments), but I have an extra Aozora Jumping Heart Dia figure sitting around from my last trip to Japan. It's just a cheap Sega figure, but I'd be happy to send it your way if it would help. No pressure if it's not up your alley! Stay safe. &lt;3",
            "score": 1,
            "author": "Pogaf"
        },
        {
            "level": 0,
            "comment": "F",
            "score": 1,
            "author": "NebbyChan"
        },
        {
            "level": 0,
            "comment": "I'm so sorry. :C",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "oh fuck 😭",
            "score": 1,
            "author": "cthellis"
        },
        {
            "level": 0,
            "comment": "My condolences, friend. Loss is a bitter pill to swallow. &lt;/3",
            "score": 1,
            "author": "Enethar"
        },
        {
            "level": 0,
            "comment": "This is real pain.",
            "score": 1,
            "author": "Moralrn0958"
        },
        {
            "level": 0,
            "comment": "This is horrific, I hope you’re doing well now",
            "score": 1,
            "author": "The_Young_Otaku"
        },
        {
            "level": 0,
            "comment": "What the hell happened? Rioters or something?",
            "score": 1,
            "author": "Dra9onDemon23"
        },
        {
            "level": 0,
            "comment": "Showed this to my friend, his reaction: Karma for buying fate merch, the cold bastard lol. RIP tho man, its literally my worst nightmare to come home and find out a cable overloaded and sparked or something.",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Haha that honestly made me laugh a bit.",
                    "score": 4,
                    "author": "aralim4311",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Glad to hear, maybe astolfo actually is cursed eh?",
                            "score": 2,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Turn it into modern art.",
            "score": 1,
            "author": "Bytemin"
        },
        {
            "level": 0,
            "comment": "F",
            "score": 0,
            "author": "rayman327"
        },
        {
            "level": 0,
            "comment": "Cursed İmage",
            "score": 0,
            "author": "NekoHuner"
        },
        {
            "level": 0,
            "comment": "F",
            "score": -2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "looks like the rioters got you too",
            "score": -8,
            "author": "Jdkickz"
        },
        {
            "level": 0,
            "comment": "The cards against humanity started the fire",
            "score": -41,
            "author": "NoNewTomodachi",
            "replies": [
                {
                    "level": 1,
                    "comment": "No, my brother did sadly.",
                    "score": 10,
                    "author": "aralim4311",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "brother against humanity",
                            "score": -2,
                            "author": "Jdkickz"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Stupid comment is stupid\n\nTake your downvote and gtfo, someone took their life in this...",
                    "score": -22,
                    "author": "Mindless_Rage05",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This was posted before the tragic update.",
                            "score": 8,
                            "author": "NoNewTomodachi",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "#OP'S BROTHER DIED IN THE FIRE. HUMOR IS COMPLETELY IRRELEVANT RIGHT NOW, REGARDLESS.\n\n\nYou were in the wrong to even post something attempting to be comical....I understand the context but in this given situation, just.......no",
                                    "score": -27,
                                    "author": "Mindless_Rage05",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Username checks out",
                                            "score": 5,
                                            "author": "FrostyMcNuggets",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "How? The fact that someone died?\n\nReal mature of you all....downvote away, shows how immature you all are. Figures are replaceable, a human life isn't",
                                                    "score": -7,
                                                    "author": "Mindless_Rage05"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "you really need to clean your place and those don't even look like fi----\n\nthat's really bad huh, i'm so sorry :(\n\ni really hope you get everything sorted, smoke damage and possibly fire and water damage is no joke",
            "score": -24,
            "author": "heart_under_blade"
        }
    ]
}