{
    "id": "pcpnvn",
    "score": 1592,
    "title": "Has anyone else seen this dude? He’s hella creative w/ figure bases!",
    "author": "[deleted]",
    "date": 1630078350.0,
    "url": "https://www.reddit.com/r/animefigures/comments/pcpnvn",
    "media_urls": [
        "https://v.redd.it/sug3xqcb6xj71"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Why cry about bland bases when you could take it as a opportunity to make a masterpiece like that",
            "score": 123,
            "author": "ALWAYS-WACHING"
        },
        {
            "level": 0,
            "comment": "Just judging off what he's doing I feel like this guy must make warhammer/tabletop fields or something, I watched videos of people making them out of sheer curiosity and the people making them have the same level of resourcefulness and painting.\n\nIt's actually pretty interesting what everyday objects they'll use to make a nice/convincing terrain.",
            "score": 84,
            "author": "putmeincoachkittyplz",
            "replies": [
                {
                    "level": 1,
                    "comment": "You'd be surprised the insane things simple everyday objects can turn into with just a simple coat of paint.  I seen people make custom scale model guns for gundams from bic pens, legos and some plastic card.",
                    "score": 20,
                    "author": "BT9154",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hell, even model makers for movies do the same thing. Like the models used in Star Wars were kit bashed together from a variety of plastic model kits as well as random objects",
                            "score": 4,
                            "author": "Spaceguy5"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This guy just got a new subscriber.",
            "score": 32,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Found his [youtube channel](https://youtube.com/channel/UC6bCc-UJ2pstixgBHXFZbjQ) for those who don't use Tiktok. The custom base videos are on a playlist called ジオラマ (diorama).",
            "score": 14,
            "author": "SilenoZ_"
        },
        {
            "level": 0,
            "comment": "That bass is huge",
            "score": 11,
            "author": "captinfapin"
        },
        {
            "level": 0,
            "comment": "Does he have a YouTube Channel?",
            "score": 8,
            "author": "ezj_w",
            "replies": [
                {
                    "level": 1,
                    "comment": "He does! Check his TikTok page for the YT channel link!",
                    "score": -13,
                    "author": "Kreos642",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "wtf",
                            "score": 8,
                            "author": "Durbdichsnsf",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[I got you](https://www.youtube.com/channel/UC6bCc-UJ2pstixgBHXFZbjQ/videos)",
                                    "score": 9,
                                    "author": "deon_",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thanks Bro. Sadly i already used Up all my coins.\nI cant even reward U :(",
                                            "score": 1,
                                            "author": "ezj_w"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "See tiktok, that the content I want to see, and not the trends you show me, ffs.",
            "score": 23,
            "author": "Barlowan",
            "replies": [
                {
                    "level": 1,
                    "comment": "Like his video and you will see more like it. That is how the algorithm works :)",
                    "score": 9,
                    "author": "JustinGiam"
                },
                {
                    "level": 1,
                    "comment": "Couldn't sound more like a boomer.",
                    "score": -3,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Step one 1. Be ridiculously good at prop art.",
            "score": 8,
            "author": "Chippai_Fan"
        },
        {
            "level": 0,
            "comment": "I been following this dude for a while he’s dope",
            "score": 3,
            "author": "Maleficent_Ad_3168"
        },
        {
            "level": 0,
            "comment": "Oh yes! I follow him and keep up to date with it. I love his stuff. I don't think he is a tabletop dude though, which others are wondering. Strikes me more as a Gunpla by what he has on the shelves. He's done this with so many figures and has even painted on certain ones directly (All Might, for example). \n\nTbh his most disappointing one was Red Riot and Uravity. One was lackluster, and the other looked too much like Hajime's powers.",
            "score": 3,
            "author": "Kreos642"
        },
        {
            "level": 0,
            "comment": "I wish I was creative lol this is spectacular!",
            "score": 3,
            "author": "ogkorey"
        },
        {
            "level": 0,
            "comment": "Where's the video of someone dropping the paint on the styrofoam platform and it falling over and spilling?",
            "score": 3,
            "author": "Kagamid"
        },
        {
            "level": 0,
            "comment": "All purchased from the local Daiso for 300円",
            "score": 3,
            "author": "wolfieboi92"
        },
        {
            "level": 0,
            "comment": "I love how it looks like he's just throwing materials and haphazardly putting them together.",
            "score": 8,
            "author": "luminous_mirage"
        },
        {
            "level": 0,
            "comment": "Looks like some giant robot fusion was happening. 😆",
            "score": 2,
            "author": "SylphSeven"
        },
        {
            "level": 0,
            "comment": "You know he could probably make a pretty decent living these things",
            "score": 2,
            "author": "suddenly_ponies"
        },
        {
            "level": 0,
            "comment": "Great base/terrain maker and great video edits, love it when people show their work in progress",
            "score": 2,
            "author": "BT9154"
        },
        {
            "level": 0,
            "comment": "So cool!!!",
            "score": 2,
            "author": "Nyahchi_64"
        },
        {
            "level": 0,
            "comment": "Real creative!",
            "score": 2,
            "author": "ChicoDusty_Da3rd"
        },
        {
            "level": 0,
            "comment": "It’s nice but gigantic",
            "score": 2,
            "author": "FluffyBeech"
        },
        {
            "level": 0,
            "comment": "Yep! Hes all over my following page lol. He should let people commission him, the bases are mind-blowing",
            "score": 2,
            "author": "nachyochiz"
        },
        {
            "level": 0,
            "comment": "Definitely gonna follow him on tiktok now",
            "score": 2,
            "author": "Eastern-Design"
        },
        {
            "level": 0,
            "comment": "Try Warhammer or any wargames",
            "score": 1,
            "author": "Eschaumburg"
        },
        {
            "level": 0,
            "comment": "He’s definitely a warhammer or gunpla fan with those skills",
            "score": 1,
            "author": "Xex051"
        },
        {
            "level": 0,
            "comment": "can i gwt a link?",
            "score": 1,
            "author": "Fenix1121"
        },
        {
            "level": 0,
            "comment": "Talk about DIY master holy shit",
            "score": 1,
            "author": "Deltacious"
        },
        {
            "level": 0,
            "comment": "Nice, I was gonna start doing this, but then remembered I'm not good for shit at making anything artistic",
            "score": 1,
            "author": "Hentai_Hulk"
        },
        {
            "level": 0,
            "comment": "I wouldn't call that creative. Skill and experience, yes.",
            "score": -53,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think you are mixing up \"cleverness\" with \"creativity\".\n\nCreativity involves conception of idea and more importantly, the end result in making something.  This often requires skill and experience.",
                    "score": 12,
                    "author": "asianwaste",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Creativity comes from being imaginative; like for example I was watching a YouTube video of a guy converting a cheap plastic water pistol into a sci-fi water tank &amp; platform.\n\nWhat the guy in this TikTok video is doing is using his skill and experience to build the scenery piece almost entirely from scratch. you don't have to be imaginative to build a model based on a scene from an anime/manga; you just look at the picture and copy it. That's why I say skill and experience rather than creativity.",
                            "score": -2,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just downloaded tiktok because i was genuinely curious about his base transformation videos. \nHe has videos of him unboxing the figures as well and god damn, I guess this is what you'd call \"cringe\".",
            "score": -10,
            "author": "Alexander0202",
            "replies": [
                {
                    "level": 1,
                    "comment": "The guys just making the content he enjoys, sure it’s a little annoying but who isn’t? Leave it be",
                    "score": 9,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I am leaving it be. I just stated my opinion on part of his content, lmao. \nNot saying he should stop, it's just cringe to me and it's something I'd only expect a child to find entertaining.",
                            "score": -9,
                            "author": "Alexander0202"
                        }
                    ]
                }
            ]
        }
    ]
}