{
    "id": "r5ivp7",
    "score": 1652,
    "title": "Over 20k worth of my collection destroyed because my so's step father \"thinks it's weird for a 30 y/o to collect toys\" . This is only one box. I wasnt home and he broke into my office after we broke up without her knowledge.",
    "author": "Stickmeimdonut",
    "date": 1638261637.0,
    "url": "https://www.reddit.com/r/animefigures/comments/r5ivp7",
    "media_urls": [
        "https://i.redd.it/io3dtwnf3p281.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Wow im so sorry this happened. I would definitely be taking pictures of them. The room, the locks, all of it, and be suing him.",
            "score": 670,
            "author": "LadyEluna",
            "replies": [
                {
                    "level": 1,
                    "comment": "Unfortunately in the state of Florida once you are off the premises for 30 days it's counted as abandonment. Literally nothing can be done. It's a super long story but we don't have video or any physical proof he did it... My so would rather pay me back than testify against \"blood\". Take my advise and never date a Cuban with insane parents.",
                    "score": 420,
                    "author": "Stickmeimdonut",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Disclaimer: not a lawyer, $20k is definitely real lawyer territory.\n\n&gt; once you are off the premises for 30 days it's counted as abandonment\n\nWhile I don't know your specific situation, it's a bit more complicated than that (abandoned property still has processes to go through): https://www.nolo.com/legal-encyclopedia/handling-tenants-abandoned-property-florida.html\n\nThe actual law: http://www.leg.state.fl.us/Statutes/index.cfm?App_mode=Display_Statute&amp;URL=0700-0799/0715/0715.html\n\n&gt; 715.104 Notification of former tenant of personal property remaining on premises after tenancy has terminated.—\n(1) When personal property remains on the premises after a tenancy has terminated or expired and the premises have been vacated by the tenant, through eviction or otherwise, the landlord shall give written notice to such tenant and to any other person the landlord reasonably believes to be the owner of the property.\n(2) The notice shall describe the property in a manner reasonably adequate to permit the owner of the property to identify it. The notice may describe all or a portion of the property, but the limitation of liability provided by s. 715.11 does not protect the landlord from any liability arising from the disposition of property not described in the notice, except that a trunk, valise, box, or other container which is locked, fastened, or tied in a manner which deters immediate access to its contents may be described as such without describing its contents. The notice shall advise the person to be notified that reasonable costs of storage may be charged before the property is returned, and the notice shall state where the property may be claimed and the date before which the claim must be made. ***The date specified in the notice shall be a date not fewer than 10 days after the notice is personally delivered or, if mailed, not fewer than 15 days after the notice is deposited in the mail.***\n(3) The notice shall be personally delivered or sent by first-class mail, postage prepaid, to the person to be notified at her or his last known address and, if there is reason to believe that the notice sent to that address will not be received by that person, also delivered or sent to such other address, if any, known to the landlord where such person may reasonably be expected to receive the notice.\n\nYou have 10 days after receiving notice to pick up your shit.\n\n&gt; My so would rather pay me back than testify against \"blood\n\nIf y'all broke up, does it matter who's money it is?\n\nAlternatively, do you have renter's insurance? (The insurance company may file a subrogation claim, meaning they'd sue on your behalf to recover the damage they paid you).\n\n&gt; It's a super long story but we don't have video or any physical proof he did it.\n\nCivil cases have _much_ laxer evidence standards than criminal cases. The standard is met if the proposition is more likely to be true than not true. I would at the very least consult a lawyer to see if you have a reasonable chance of winning a civil suit.",
                            "score": 498,
                            "author": "nucleartime",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Op you need to pursue this, if for nothing more than Rikka there on top of the stack.",
                                    "score": 253,
                                    "author": "[deleted]"
                                },
                                {
                                    "level": 3,
                                    "comment": "u/Stickmeimdonut\n\nYou should take a look at this, definitely go see a lawyer 20k is not nothing. Even if you think it's not worth it. I highlighted the comment because its really important",
                                    "score": 43,
                                    "author": "Z3_PhiResNik"
                                },
                                {
                                    "level": 3,
                                    "comment": "Biggest problem is I don't have money for a lawyer to pursue the case. All the information I was given was from the officer who showed up and dispatch that I had to call back to find out what went into the report. Its all still very fresh at the moment I have no clue what I'm going to do as of yet. I still need to make an itemized list of everything that was devalued/damaged beyond repair. I haven't even made it home yet. I am staying 300 miles from where this happened. So I'm over a 3 hour drive from the storage unit I had to move everything into. It's just a massive cluster fuck.",
                                    "score": 83,
                                    "author": "Stickmeimdonut",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Consider coming back and looking at this post/comments in a few days after you've had time to sleep on it. Figures aside, I'm sure this is incredibly stressful in many ways. Solutions and steps forward will seem a lot more manageable once you have a little emotional distance. I hope everything works out for you, OP.",
                                            "score": 53,
                                            "author": "lestatistics"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I'm not the most informed on the law, but  most attorneys will at least do a free consultation, and many of them will accept payment from whatever is awarded. Seems like a pretty slam dunk case, and even if a lawyer charges 25%, 15k is still better then 0. I would at least meet with a reputable civil attorney, and worst comes to worst, they tell you your case doesn't have legs and send you away.\n\nEdit: I would also post this on r/legaladvice as way to learn your options, but take everything there with a massive grain of salt since there tend to be a lot of armchair lawyers",
                                            "score": 35,
                                            "author": "Rufus_king11"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "You don't need money to press charges. Most cases you go to a consultation appointment and the legal team agrees to take on the case or not. You pay in the form of lawyer fees if you win (how much percent is that depends on your state).",
                                            "score": 9,
                                            "author": "Kreos642"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "You absolutely need to not trust that officer. I mean don't trust the police at all in general because they don't care about people. They won't pursue anything that doesn't look good for them on their record and I absolutely will make selfishly incorrect judgement calls about what they can't do because they really just don't want to be bothered. Quite frankly this abandoned property B is way more complex than you're treating it as. Even when property may be abandoned there are still custodial and notification requirements. If the damages are really close to $20,000 it is absolutely worth pursuing a civil case. And there are absolutely ways to find the initial stages of that lawsuit",
                                            "score": 7,
                                            "author": "RevengencerAlf"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Breathe, keep making the list and taking photos. You don't have to make a decision right this second.",
                                            "score": 3,
                                            "author": "katzohki"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "At the very least you should give the dad and ex the impression that you're taking legal action, they'll probably be too freaked out to think \"he's too poor for it\", if you genuinely can't get a lawyer, maybe you can trick them into thinking you were about to but giving them an out by having them pay for damages.\n\nAlso, might be talking nonsense here, but I've thought I've seen ads about lawyers that don't charge unless they win the case. might want to keep that in mind",
                                            "score": 2,
                                            "author": "DotHase"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Had I not scrolled through, I would have posted this exact subpoena.\n\nu/stickmeimdonut really should go after this considering it's 20k. If he wasn't given a written notice then the landlord broke the law regardless.\n\nSo essentially there is a case, abandonment law or not. If this were a few hundred dollars then eh. But 20k isn't an amount to ignore.",
                                    "score": 19,
                                    "author": "admiral_kikan"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Dont give up just because you think you know the law, talk to a lawyer, $20k is a lot of money",
                            "score": 44,
                            "author": "UltimateToa"
                        },
                        {
                            "level": 2,
                            "comment": "\"Blood is thicker than water, that's why it stains\" that's my motto. Shame about everything it really is, even the detolfs are irreplaceable now a days. Took me 9 months here in Southern WI to get 2 more",
                            "score": 41,
                            "author": "Darth-Buldge",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Cuban here. While my mom can be special, and she never approved of my hobby of figures, she'd never do this, nor the rest of my uptight family.\nThat girl got a violent father, period. Those can come from any nationality. \n\nDid you actually consult a lawyer? I doubt nothing can be done and that assault of property can be called abandonment of the premises when 30 days is a perfectly normal amount of time to take vacations.\nGet legal advise from a professional before settling on that nothing can be done. You need to at least get a restraining order from that violent asshole.",
                            "score": 73,
                            "author": "_LaChancla_"
                        },
                        {
                            "level": 2,
                            "comment": "Don't put this shit on Cubans, my mom and some of my extended Cuban family have seen my collection and even though they might not \"get it\" they compliment my organization and arrangement of my figures my mom has even gotten me to buy her some figures that she likes because \"they're pretty\". My family would never do this, and they understand the time, money and care that I put into my collection. That's the end of my rant I'm sure you must just be blowing off steam as I also would be devastated if this happened to me. You should really try to seek a legal avenue to amend this and maybe look into modeling and gunpla subreddits to see if you can repair the harder to find figures.",
                            "score": 15,
                            "author": "StickyIkky"
                        },
                        {
                            "level": 2,
                            "comment": "&gt; It's a super long\n\nWe have time.",
                            "score": 4,
                            "author": "Static147"
                        },
                        {
                            "level": 2,
                            "comment": "Get her to pay you back, then exhaust all legal avenues. I'm sure something can be done. And if not, break his face. This is not ok. Doesn't matter what it is, he destroyed valuable property. Man, if I lived in Florida I'd gladly go down to his home with a bat for you. Sorry this happened.",
                            "score": 33,
                            "author": "DeathPercept10n"
                        },
                        {
                            "level": 2,
                            "comment": "so’s “step father”… that ain’t blood! LMAO",
                            "score": 3,
                            "author": "snesxrp"
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": -19,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Unfortunately he was allowed to be on the premises and in the eyes of the law I abandoned my belongings because I left them with my so longer than 30 day. The cops literally wouldn't do a thing.",
                                    "score": 24,
                                    "author": "Stickmeimdonut",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Stop saying unfortunately and at least consult a lawyer about suing this man. The girl is not your girlfriend anymore so it’s your decision.\n\nThis is honestly heartbreaking. The man was violent and damaged your property. The police were unhelpful. It’s unfair to you. \n\nIf the situation was slightly different… If an older man broke into his step daughters office and broke 20k$ worth of her computer equipment… isn’t that enough grounds to at least try to sue??",
                                            "score": 42,
                                            "author": "pupelarajaka"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I highlighted a comment higher have a look at it please. Dont assume its the end this is definitely worth pushing.",
                                            "score": 3,
                                            "author": "Z3_PhiResNik"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Plz, plz, plz, give us the tea. You can't blue ball us like this without giving us the full tea party. I haven't been this invested in a post for a long time.",
                            "score": -6,
                            "author": "luffy1301"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Those are all scales btw with 4 more boxes just like this one. Knocked over all of my detolfs and they shattered and damaged everything beyond repair. I'm still in shock.",
            "score": 251,
            "author": "Stickmeimdonut",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm so sorry, that must hurt a lot. But don't give up on repairing them yet - of course you won't end up with brand new figurines, but a lot of them look salvageable. Super glue is fine, I also used epoxy putty to connect parts when the glue wouldn't work. Drill holes and use wire to connect parts. You can use epoxy putty to smooth over gaps, and acrylic paints to color match and repair paint damage.\n\nIf you know people who built Gundams, paint minis, or mod figurines, they can probably help you with the repairs.",
                    "score": 111,
                    "author": "OctagonalOctopus",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I second this. I have repaired a bunch of figures for an acquaintance after her shelf collapsed. Minipainting and modeling subs can help you out. If any larger things are broken you can pin them with a modeling drill and pieces of wire.",
                            "score": 45,
                            "author": "Izzyrion_the_wise"
                        },
                        {
                            "level": 2,
                            "comment": "I third  this, at least try fixing them up, and you might be able to save most of them. I imagine the pegs are the things that got broken the most. There should be guides on how to get them out and fix them. This is a really messed up situation. Regardless of how the break up went. It’s really immature of the father to break your things out of anger like that.",
                            "score": 21,
                            "author": "isagoodkitty"
                        },
                        {
                            "level": 2,
                            "comment": "I've never used epoxy or paint but the holes for wire or other metal I can definitely say works like a charm. Sometimes even better than glue",
                            "score": 8,
                            "author": "Darth-Buldge",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Wire is best for support for force along the break, glue for force perpendicular to the break. Both together may be needed for heavy figures.\n\nBut the main thing is that there are plenty of people who balk at drilling holes and running wire/rods inside their figure.",
                                    "score": 2,
                                    "author": "Akamesama",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's definitely scary for the first few",
                                            "score": 2,
                                            "author": "Darth-Buldge"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "What the fuck is wrong with some people. You are handling so much better then I would be.",
                    "score": 33,
                    "author": "HamsterJuices"
                },
                {
                    "level": 1,
                    "comment": "He sounds like a real piece of shit. Destroying everything because he doesn't like your collection? Beyond immature.\n\nHope you're able to sue him for damages.",
                    "score": 21,
                    "author": "dle13"
                },
                {
                    "level": 1,
                    "comment": "Sounds like felony destruction of property.",
                    "score": 7,
                    "author": "Zilveari"
                },
                {
                    "level": 1,
                    "comment": "DM me and I can try to teach you how to repair your figures and/or walk you through repairing them one by one.",
                    "score": 3,
                    "author": "meteor_stream"
                },
                {
                    "level": 1,
                    "comment": "Did they admit they did it?",
                    "score": 3,
                    "author": "PracticalPlastic4123"
                },
                {
                    "level": 1,
                    "comment": "I can help you repair them for free. I’ve been working on airbrushing and stuff lately!",
                    "score": 3,
                    "author": "Itchy_Cloud309"
                },
                {
                    "level": 1,
                    "comment": "Oh my god this man deserves every punishment imaginable that’s not okay one single bit and I give you my full support good sir",
                    "score": 2,
                    "author": "Advanced-Minute-9963"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Oh god I’m horrified on your behalf. What a bitter busybody…let people enjoy their hobbies ffs\n\n\nHe destroyed your property, hopefully you can take action against him and he won’t get away with this.",
            "score": 106,
            "author": "Ser-Pouncealot",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'd be taking no names and the father would be getting an assbeating for the ages",
                    "score": 57,
                    "author": "Mindless_Rage05",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Who the fuck downvoted this?",
                            "score": 19,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Satan. Is that you?!",
                                    "score": 5,
                                    "author": "Mindless_Rage05"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Listen to me. The police didn't do anything because they were lazy. Itemize everything that was destroyed. Take him to court. This sounds like A LOT in damages. You will EASILY be able to get a judgment for the amount of destroyed property. Name everyone in the home as a named party (defendant). It will be on them to prove who didn't destroy the figures, not you proving who did in fact destroy them (since you are roping them all into the lawsuit). Your legal theory is this: \"My personal property was destroyed by XYZ persons. My damages are $X. Thus, I am entitled to relief in $X amount.\" You can try small claims court, but if the damage is in the thousands, I recommend speaking to an attorney to at least get a consultation.\n\nThis is not ok and you CAN get relief. Please pursue your rights. Keep us updated.\n\nEdit: I just noticed you mentioned $20,000 in damage. This is super serious, PLEASE PLEASE PLEASE get a consultation from an attorney!!! I have not looked it up but I can almost guarantee 30 days whatever bs the police mentioned will not cover a situation like this. This is probably a very fact specific scenario that an attorney can walk you through to get you relief. This was your personal property that was not abandoned due to the break-up. There was a reasonable expectation that you were going to retrieve your stuff. They destroyed your property. You are entitled to relief for your property that they destroyed in retaliation against you.",
            "score": 305,
            "author": "shadowhawkz",
            "replies": [
                {
                    "level": 1,
                    "comment": "This and try and get in a form of text from your ex that \"you had intention to get your property\" just a casual conversation, but it can do wonders for evidence that you DIDN'T abandon it, a bit of a stretch but could also try to ask \"I still can't believe your father would do this, why would he do this?\" and if she replies acknowledging it even with an \"I don't know\" it may help.  \n\n\nEdit: Above all else, SEEK LEGAL ADVICE FIRST. Even if you think nothing can be done, exhaust your options.",
                    "score": 65,
                    "author": "MemoryXion"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Time to file police charges and get him to replace them at curent value. Im so sorry for your loss home there is a happy ending to this",
            "score": 89,
            "author": "Nocab_evol"
        },
        {
            "level": 0,
            "comment": "What a lunatic.",
            "score": 74,
            "author": "wallCrawleri386",
            "replies": [
                {
                    "level": 1,
                    "comment": "Seriously, no matter what happen, no sane person just can broke in and smash other people's stuff",
                    "score": 14,
                    "author": "GodOfBoiiiii"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Looked back and saw your collection post from awhile ago...so sorry to hear this. Such a shame people out there find justification in ruining someone’s hobby",
            "score": 60,
            "author": "RaptorProductions"
        },
        {
            "level": 0,
            "comment": "Lawyer up. It is absolutely worth pursuing. People have successfully sued for much less, with considerably less evidence. \n\nIt would be helpful to screenshot, record, and backup anything that may be helpful onto another device. Extensive pictures of the damage and mess included. \n\nBegin making a spreadsheet of your entire collection + your destroyed detolfs, detail the total cost of each figure (retail + what you ended up paying w/ shipping and import + if the figure is more valuable now due to resale/rarity) and detail the level of damage. If you have access to any invoices, I would aggregate them in a folder. Treat it as if you were documenting everything for an insurance claim, be incredibly thorough. \n\nI would also prepare something to show how damage is proven to devalue the figures, not everyone understands they are treated more like collectible cards rather than kids toys or action figures.\n\nA lay person may see some scratches or a snapped base piece and not understand the big deal, they may dismiss it as something fixable and trivial. They may not realize it would be like taking one of those $100-500 cards and folding, creasing or tearing it. \n\nReference the rigid grading systems used by places such as AmiAmi to help get this point across to a lawyer, they may not immediately understand the high cost of your collection or the magnitude of the damage. It is a niche hobby and obviously carries a degree of stigma with it. \n\nFinally, let an attorney decide whether the \"abandonment\" of property is really an issue. Lawyers don't typically pursue what isn't profitable, but do not expect to get 100% of your collection's value back. It is difficult to get people to pay up when they lose in court, and your lawyer will still need their payment for representing you. If you are strapped for cash, see if you can find  a lawyer with a reasonable retainer fee or one that is flexible about paying for their time. Some lawyers work on a gimmick of not getting paid unless they win and you are awarded damages by the court. However, do not rely on this purely hypothetical payout to carry your legal fees - it's not guaranteed.  \n\nAlso, if you were not allowed or prevented from access to your property it is important to provide proof. Being intimidated or asked not to come over counts. Any proof that you reached out and communicated that you wanted your property and had no intent to abandon it would also be great. \n\nI am horrified that you had to experience this, but hopeful that you will receive some level of justice.\n\n*Edited for phrasing*",
            "score": 33,
            "author": "BloodReflux"
        },
        {
            "level": 0,
            "comment": "Goodness so many gems in that box alone. Poor Rikka!!",
            "score": 35,
            "author": "kj54322"
        },
        {
            "level": 0,
            "comment": "Consult an attorney immediately. The police won't do shit because they don't want to. You need a lawyer.",
            "score": 28,
            "author": "sharlayan"
        },
        {
            "level": 0,
            "comment": "Fucking insane. Holy shit. OP, pursue this in court - listen too the suggestions here and post over on r/legaladvice for more help.\n\nEdit: It doesn't matter if it is figures you collect, or commemorative plates. This is still your property destroyed and you need to look into your options. Take lots of pictures of everything - the detolfs, figures, and door. Consult with a lawyer and figure out an estimate for the total loss. You deserve to have restitution for this, and no matter how bad a breakup is, this is unacceptable behavior - also by a third party, who intentionally and deliberately meant to cause you emotional and financial harm. Fuck.",
            "score": 24,
            "author": "kisuriurisan"
        },
        {
            "level": 0,
            "comment": "That is such bullshit to have to deal with.  I fucking hate people that do those things.  They ruin thousands upon thousands of dollars, and god knows how many hours, and years of someone's life taken to procure said things...  All because they have some preconceived notion that \"adults shouldn't\" or \"men don't\" or \"my invisible sky daddy doesn't like that\".  Sorry for your loss.  I hope you're able to salvage some of it, and able to replace at least a large portion of your collection.  Honestly with the amount of loss sustained there you might be able to still press charges under federal law.  If someone stole as much as he destroyed it would be considered a felony.",
            "score": 53,
            "author": "Funky_Gaijin"
        },
        {
            "level": 0,
            "comment": "I'm so sorry this happened to you! I'm going to jump on the \"sue him\" train. File the police report even though they do nothing just so it's official. Then lawyer up. Good luck!",
            "score": 14,
            "author": "CyberFawlty"
        },
        {
            "level": 0,
            "comment": "IS THAT THE ALTER SHINOBU? What in the fuck isn't this considered property damage? I see some figures in there that are not cheap...",
            "score": 46,
            "author": "omegazx00",
            "replies": [
                {
                    "level": 1,
                    "comment": "No it’s the Funny Knights one",
                    "score": 13,
                    "author": "Sula_leucogaster"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That's fucked up. Call the cops? Or sue the man for property damage and breaking in",
            "score": 16,
            "author": "SiHtranger"
        },
        {
            "level": 0,
            "comment": "Shucks, some people doesn’t really have any idea about the value of the figures. Why would they even consider these as just “toys”. The intricacy and beauty on some of those figures can even be considered as art pieces that have value. I hope you can still fix them.",
            "score": 14,
            "author": "Eicee"
        },
        {
            "level": 0,
            "comment": "This is reportable to the police. Sue her",
            "score": 12,
            "author": "Flmdsfr"
        },
        {
            "level": 0,
            "comment": "Keep all communications you have regarding this. If you don't have anything with your ex admitting to the step parent doing it. GET IT. Text messages, emails or whatever you can get.\n\nThis has been stated numerous times already in this thread but\n\nTHE POLICE DO NOT CARE AND WILL DO AS LITTLE AS POSSIBLE REGARDING PROPERTY CRIMES.\n\nCALL A LAWYER IMMEDIATELY TO SUE IN CIVIL COURT",
            "score": 12,
            "author": "AlgoStarSystem"
        },
        {
            "level": 0,
            "comment": "If the cops don't do anything after you file a report, you can try and find out where he works and tell management about it and show them the report, they probably won't care but if you frame the whole ordeal correctly it wouldn't hurt I guess. If you can't get reparations, go take him down with you. \n\nOtherwise the rest is out of your hands and the only thing to do is make the whole thing go viral. Maybe an overreach but maybe you can contact the local news station. Some stations will pick up any story and \"20k worth of toys destroyed\" is probably gonna make for an interesting headline.\n\n(And maybe r/legaladvice can chip in...YMMV)",
            "score": 34,
            "author": "toxicSTRYDR",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;if you can get reparations, go take him down with you \n\n\nsounds like a sweet revenge",
                    "score": 8,
                    "author": "Celineno"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lawyer up, take photos of destruction as evidence, keep yer yapper shut, and STAY OFF SOCIAL MEDIA.",
            "score": 53,
            "author": "Mindless_Rage05",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yep - I don't like being that person on here normally but OP, you NEED to press charges. Even as someone who doesn't collect scales, I know how precious these things can be to you and that is valuable property on top of that. It makes me sad that these people were so unstable that they felt they had to hurt you",
                    "score": 19,
                    "author": "Cosmocall"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Damn that is such a messed up thing to do, you don't mess with someone's hobby. My family doesn't understand why I collect figures as well. But they at least understand I enjoy collecting figures.",
            "score": 12,
            "author": "toumakanata"
        },
        {
            "level": 0,
            "comment": "I agree with the others here. Talk to a lawyer, and file a civil suit. The police won't help you because it's just extra work for them. A lawyer will be doing their job. Regardless of \"abandonment\" in sure you don't automatically relinquish ownership of your property after 30 days.\n\nSue this man. Keep every text and record conversations where either he or his family admit to him doing this. Sue them for compensation you deserve.",
            "score": 9,
            "author": "pedun42"
        },
        {
            "level": 0,
            "comment": "I am sorry for your loss.\n\nSue him. He is your stepfather, he has no blood ties with you. So w/e. I mean it, is your money and your hobby, no one should interfere on it or break it.",
            "score": 9,
            "author": "scary__monsters"
        },
        {
            "level": 0,
            "comment": "Sue them OP, if you could get pictures of the destroyed detolf and you said he broke into your office, find some evidence that it did happened. \n\nLastly inspect all  your figures and document the damages that it cost them by putting a valuable collectible item in an unsafe and negligible manner. Then report everything to the PD, the sooner the better, keep us updated and I'm sorry for that this happened to you.",
            "score": 6,
            "author": "acezone"
        },
        {
            "level": 0,
            "comment": "Talk to a lawyer for the love of god. Ya dont need cameras to fuck em. This goes past figures. This pos just broke into ur office and fucked you for 20k bro. Jesus fuck call a lawyer.",
            "score": 9,
            "author": "ZealousidealKing6"
        },
        {
            "level": 0,
            "comment": "Good fucking Lord how petty and stupid do you have to be these days? Surely there is something you can do sue this guy for damages as even just from that box that's gotta be over $1000 easy. I'm so sorry OP",
            "score": 8,
            "author": "Jazs1994"
        },
        {
            "level": 0,
            "comment": "So you and your gf still lived together and he broke into your locked office or you two lived apart and he broke down your front door AND the locked office?\n\nBecause this is so heart breaking. I can not imagine how angry and heart broken I would be if someone broke my door just to destroy my figures.",
            "score": 5,
            "author": "vietnoboi"
        },
        {
            "level": 0,
            "comment": "This requires justice.\n\nPrepare a detailed list of all damaged goods and value, then sue him.",
            "score": 3,
            "author": "supreme_tyrant"
        },
        {
            "level": 0,
            "comment": "OP I hope you at least talk to a lawyer. $20k is a hell of a loss, and as others have said, well into lawyer territory. Also I feel like a lot of people assume that criminal and civil cases go the same way--they do not. Even if your ex is unwilling to testify, there is still less 'burden' of undeniable proof than you typically think of when looking at criminal cases where you see people often get off for things because of 'reasonable doubt' when there's so little doubt to begin with. Many lawyers have free consultations even, so it really does not cost you anything to try.",
            "score": 4,
            "author": "kyuuei"
        },
        {
            "level": 0,
            "comment": "I saw some of your older posts and all I can say is I'm so sorry. I can tell you felt a lot of pride and happiness about your collection and it was all thrown away over something so stupid. It makes me upset that someone could throw that all away so easily without even discussing it with you first. I hope you're able to sue him, at that point I wouldn't care if it causes a war between you and your so's family, he deserves it 100%",
            "score": 5,
            "author": "_stardustx"
        },
        {
            "level": 0,
            "comment": "Im just going to say it as a lot of ppl are pussyfooting around it.  You are in your 30s, man up or else why come on reddit in the first place to complain then say your thinking of not pursuing legal action, blood thicker blah blah, your not together. They broke your things now take pictures, consult a lawyer. 20k is a lot of money, half a down payment for a house. You shouldn't have to go through this but you really need to pursue it and not let this slide.  Its way too much money.",
            "score": 6,
            "author": "BlooBMO"
        },
        {
            "level": 0,
            "comment": "holy shit this is so horrifying i can’t believe they treat your precious scales like that! i honestly feel sad and angry for you. that person better be replacing all of them! this is so heartbreaking you don’t deserve this at all op",
            "score": 3,
            "author": "kyou-kai"
        },
        {
            "level": 0,
            "comment": "Yo this FAR from being ok. So sorry that this happened to you. Maybe pour some sugar down someone's gas tank to make it run more efficient. Or maybe add some water to the engine to help cool it off.",
            "score": 4,
            "author": "Crimson-Ranger-119"
        },
        {
            "level": 0,
            "comment": "I'm pretty sure he did thinking all of them were cheap toys that you find on kid's section at Wal-Mart. I'd like to see his face realizing this is worth 20k usd",
            "score": 2,
            "author": "elav92"
        },
        {
            "level": 0,
            "comment": "If your $20,000 estimate on the value of your collection is accurate, why the hell are you not going to lawyer? Stop talking to the people who led your stuff to being broken and don't give them any ammo lmao.",
            "score": 3,
            "author": "rarelywritten"
        },
        {
            "level": 0,
            "comment": "It's r/legaladvice time! 20k is no small chunk. Compile as much evidence as possible. Photos of the damages, the scene, E V E R Y T H I N G. Make a list with each figure and price per. Keep ALL text messages/online interactions with them saved as well and if there's a phone call, record it. A lot of lawyers will do free consultations and if they think you have a decent case they'll agree to work with you. The police might not do shit but lawyers are a whole different game. I'm so sorry this happened.:(",
            "score": 4,
            "author": "kittyblanket"
        },
        {
            "level": 0,
            "comment": "If you’re not going to seek legal action, then what’s the endgame here? I’m sorry that this happened to you and hope your figures are okay, but unless you do something about the situation, nothing is gonna change and you’re going to be out money and figures \n\nIt doesn’t hurt to at least consult a lawyer",
            "score": 4,
            "author": "MadisonJFlowers"
        },
        {
            "level": 0,
            "comment": "Break his fingers",
            "score": 20,
            "author": "lolis_arent_real",
            "replies": [
                {
                    "level": 1,
                    "comment": "More like break his neck",
                    "score": 20,
                    "author": "Mindless_Rage05"
                },
                {
                    "level": 1,
                    "comment": "He should take his nails off , then puncture the nervs with a cold pointy screw, take off his teeth and apply low electricity , of course incrementing the current each time with every shock , he could also take his eyes out of his socket and do the same as he slowly but surely loose his sight, the he could also cut his aquiles to avoid him from running , he could cut a hole in his arm aproximately 2.2cmx5.3 and drop alcohol and other substances, after he's done with his teeths he could reatach them in a really bizarre way (that's really painful)   open a hole in his troat just to burn it ( of course the hole is to drain the chemicals, we don't want him dead ...yet),etc , i have more tips if op wants to do some of that ....i would really really reaaaaallyyyyyyyy see some good o'l drama.\n\n\n\n\n\n\n\n\nDon't take it seriously, but....it's of course.....a possibility.",
                    "score": 2,
                    "author": "ScaryClock1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Aw dude, Thats awful. I hope you can get justice. He broke into your home and destroyed your private property. He needs to get punished. I hope things get better for you",
            "score": 3,
            "author": "Qrowrosewine"
        },
        {
            "level": 0,
            "comment": "That’s a lawsuit",
            "score": 3,
            "author": "AbysmalVixen"
        },
        {
            "level": 0,
            "comment": "Did you insure them by chance? I know it won’t help at the moment, but if you didn’t you can get coverage through an insurance provider for your collections. Especially if you’ve shelled out this kind of cash. I’m sorry this happened to you",
            "score": 3,
            "author": "crystalvelociraptor"
        },
        {
            "level": 0,
            "comment": "Looks like they were placed in the box...like the wings, hair, bunny ears should snap off if it was really rough",
            "score": 3,
            "author": "SumyungNam",
            "replies": []
        },
        {
            "level": 0,
            "comment": "that sounds like a lawsuit\n\nit doesnt matter that they were “toys”, its your property",
            "score": 3,
            "author": "sylv3r"
        },
        {
            "level": 0,
            "comment": "Sucks that this happened, I would be beyond pissed if someone destroyed $20k worth of my shit. If you can't take lawful action see if you can have him arrested for damaging personal property, this is bullshit.",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "This is a civil issue. Asking police for advice is like asking McDonald's how to make sushi.",
            "score": 3,
            "author": "Oroera"
        },
        {
            "level": 0,
            "comment": "The title confuses me a little, who did you break up with and without who’s knowledge?",
            "score": 5,
            "author": "GoldenMercy",
            "replies": [
                {
                    "level": 1,
                    "comment": "SO = significant other. Basically their partner (without revealing gender).\n\nThe stepfather is the one who broke into OP's office, which I'm assuming is the room they stayed at while living with their SO. Since they hadn't returned to their SO's place for more than 30 days after their breakup, under Floridian law, they \"abandoned\" their property, so they cannot file charges against anyone who causes direct damage to it (which is f\\*\\*ked up).",
                    "score": 14,
                    "author": "MikuEd"
                },
                {
                    "level": 1,
                    "comment": "His ex's father destroyed his figure collection valued at $20k or more\n\nI'd be going to JAIL if that were my collection....",
                    "score": 16,
                    "author": "Mindless_Rage05"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What the...",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "This is awful! I am so sorry for your loss. Well it’s time to pick up the pieces and start anew in another state.",
            "score": 2,
            "author": "Xikkiwikk"
        },
        {
            "level": 0,
            "comment": "I'm sorry for this, but if I were you I wouldn't let this one pass, consider taking this to court and if possible don't live with him",
            "score": 2,
            "author": "dark_abyss94"
        },
        {
            "level": 0,
            "comment": "Dude I’m so sad to hear that, my condolences goes out to you. I know that a lot of people are telling you to press charges and get your money back. If you can, you definitely should 100%.\n\nBut just in case you won’t be able to for whatever reasons, just know that at the very least, it’s all behind you now. \n\nI hope you can build up your collection again, I would love to see what you can rebuild in a year or two. Keep your heads up high my dude. We in this subreddit, is all with you. Just know we all share a bit of your heart ache.",
            "score": 2,
            "author": "TheMentalOut"
        },
        {
            "level": 0,
            "comment": "And now you can sue him. Hope he enjoys the court fees.",
            "score": 2,
            "author": "HotCatholicMoms"
        },
        {
            "level": 0,
            "comment": "Jesus, he broke into your house? WTF?",
            "score": 2,
            "author": "yumeimi"
        },
        {
            "level": 0,
            "comment": "Did Mio and Mugi make it?",
            "score": 2,
            "author": "SherbertSherpa"
        },
        {
            "level": 0,
            "comment": "Do you have renters insurance if you don’t want to go the legal route you\nShould at least be able to file a claim with renters/home insurance. 30K is a lot of money (I don’t think my collection even with my games is even worth that amount) that’s more than what some people make in a year definitely go the legal route if you don’t have insurance. And for anybody else reading it I highly recommend you to get renters insurance if you have a collection over 5k you can claim them under “fine art” and get a payout to rebuild your collection itemize your list and update the amount base off the current price for that figure in the after market",
            "score": 2,
            "author": "Engi3Piece"
        },
        {
            "level": 0,
            "comment": "Take him to court for destruction of property",
            "score": 2,
            "author": "Polybius2600"
        },
        {
            "level": 0,
            "comment": "You can easily sue him for that much money, don't give up.\nAlso everyone should get an assurance once your collection is worth a bunch of money.",
            "score": 2,
            "author": "pataprout"
        },
        {
            "level": 0,
            "comment": "I'm so sorry this happened to you, OP. No one deserves to have their things treated like this. IANAL, but I would look into going to court and making him pay for damages. He shouldn't get away with treating people like this.",
            "score": 2,
            "author": "OmegaZero55"
        },
        {
            "level": 0,
            "comment": "Just destroy him, because you think it's weird, thinking it's weird to collect Figures at 30.🙂💪😂",
            "score": 2,
            "author": "TheRealZelltis"
        },
        {
            "level": 0,
            "comment": "I'm so sorry that happened, thats extremely expensive... You're gonna have to sue your step-father that is too much money. Those aren't toys either he should know more cause not much young folks buy those since some can be NSFW and expensive, I feel really bad for you Goodluck with that :(",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I'm sorry but I would sue. Definetly sue.",
            "score": 2,
            "author": "mangoimoi"
        },
        {
            "level": 0,
            "comment": "FILE A LAWSUIT wtf!!!! destruction of personal property, trespassing, break in, and emotional trauma. THIS SHANT BE FORGIVEN",
            "score": 2,
            "author": "Readty33"
        },
        {
            "level": 0,
            "comment": "I find it weirder for a grown man to feel the need to destroy another man's stuff because he thinks it's weird. Like my family thinks my stuff is weird but they'd never be so bothered by me having it that they'd destroy it.",
            "score": 2,
            "author": "yamask888",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Yo wtf he’s a piece of shit",
            "score": 2,
            "author": "are_youkitty"
        },
        {
            "level": 0,
            "comment": "Yo WTF!!!",
            "score": 2,
            "author": "GhostEV22"
        },
        {
            "level": 0,
            "comment": "This is definitely to the point where you should contact a lawyer. If you do decide to take legal action, keep us updated!",
            "score": 2,
            "author": "Suspicious_Person15"
        },
        {
            "level": 0,
            "comment": "Collecting figures is just a hobby but your stepfather thinks it's weird and uses that as an excuse to destroy your collection, it's unacceptable.  I hope you can get justice for yourself.",
            "score": 2,
            "author": "Hilda9571"
        },
        {
            "level": 0,
            "comment": "I'm so sorry man",
            "score": 2,
            "author": "Upper_Mortgage1731"
        },
        {
            "level": 0,
            "comment": "Document everything. This makes me blood boil.",
            "score": 2,
            "author": "ephryene"
        },
        {
            "level": 0,
            "comment": "I'm getting closer to my 30s, and I will not tolerate any destruction of my property, what someone does with their time and money is of no concern to anyone. You're not hurting no one, so why this destruction of property? I am sorry for what has happened to you. I hope some survived the destruction, and I hope you take them to court and seek reimbursement. I genuinely wish you the best of luck and hope you come out successful.",
            "score": 2,
            "author": "CounterfeitTacos"
        },
        {
            "level": 0,
            "comment": "This is why you actually don't live with a SO, fuck that noise. Are you SURE it wasn't the girlfriend? If you have homeowners insurance you can file it as a break I'm pretty sure. Definitely spend the $250 and get a lawyer consultation asap bro. Do you have the boxes for all of them also? that can help, and you can catalog the eBay price and sue the shit out of them, TIME IS OF THE ESSENCE HERE GET A CONSULTATION THIS WEEK. It hindsight now but always ALWAYS get your stuff together like this before the breakup, or have professional movers on stand by and have them move it that day or while they are at work, I see vindictive ex's do this shit all the time on the anime statue Facebook groups I'm in. Look into the home insurance/renters route also. Sorry this happened bro but if you push hard with lawyers here youll get made more than whole, you can sue them for the market price not what you purchased it for.",
            "score": 6,
            "author": "RobMosaku"
        },
        {
            "level": 0,
            "comment": "God what an asshole boomer. Hope you can recover some stuff. Or press charges for B&amp;E",
            "score": 2,
            "author": "Sum-Duck"
        },
        {
            "level": 0,
            "comment": "I'm so sorry that happened to you. Latin American masculinity is so fucking toxic. Speaking from personal experience, if you're not into sports, cars, or partying and drinking every weekend, they think you're retarded. \n\nIf they see you watching anime, they call you a kiddie for watching cartoons. If they see you collecting figures, they call you feminine for collecting dolls. If they see you playing games, they call you a shut-in or nerd. It doesn't matter if you're more successful than them.\n\nI've been thinking about getting locks for my detolf just in case a crazy family member get any weird ideas",
            "score": 2,
            "author": "WeebDickerson"
        },
        {
            "level": 0,
            "comment": "This mentality that you have to stop collecting \"toys\" after a certain age needs to stop. It's always said by some old loser who thinks we have to live life like they did in their ancient times.",
            "score": 2,
            "author": "Sumire-Yoshizawa-"
        },
        {
            "level": 0,
            "comment": "Aight, eye for an eye, he breaks your figures your break his fucking kneecaps.",
            "score": 2,
            "author": "HOVRS_OF_FVN",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nahhh...breaking his neck is the only reasonable option at this point. That's literally about $20k in damage",
                    "score": 5,
                    "author": "Kellz_The_Mui_Simp",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You seem to know your way around breaking necks... interesting.",
                            "score": 3,
                            "author": "HOVRS_OF_FVN",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "that is so fucked up. maybe ask the mods if you could post a gofundme or donation link here? i’m sure lots of us would want to at least throw a few dollars to try and help you get your collection back. i’m so, so sorry this happened to you",
            "score": 0,
            "author": "sexhomaru"
        },
        {
            "level": 0,
            "comment": "How they were destroyed?",
            "score": 0,
            "author": "Sagi-360",
            "replies": [
                {
                    "level": 1,
                    "comment": "These figures are super fragile. By putting them carelessly in boxes like that, many of them will have minor damages like bruises or have little parts broken. You can see that they are not completely broken, but they lose a lot of value after this kind of minor damage. So Op didn’t lose everything, but it’s very likely that there’s a lot of damage in their value.\n\nEdit: actually OP explained later that they were knocked off the shelves into the boxes, so most of them are very damaged.",
                    "score": 2,
                    "author": "Lsassip"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Do you have PayPal or cashapp? I’ll donate some money to help pay for the damages!",
            "score": 1,
            "author": "Chainsaw-hand888"
        },
        {
            "level": 0,
            "comment": "What is so? And why didn't you educate him that each piece have resell value. My wife is fully aware if I die, each piece can be claimed at the pricr of a play station. She knows it's worth alot",
            "score": 1,
            "author": "rolo512"
        },
        {
            "level": 0,
            "comment": "Your cuban gf's parents are insane. I hate cubans. I've had a cuban friend and he always punches me for fun. That's why I always go to work with patches.",
            "score": 1,
            "author": "FeeProfessional9809",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I would literally beat his ass beyond recognition. Holy shit, this pisses me off and I'm not even the person with the destroyed figures. I'm so sorry for your loss",
            "score": -1,
            "author": "Otake"
        },
        {
            "level": 0,
            "comment": "😥",
            "score": 1,
            "author": "captinfapin"
        },
        {
            "level": 0,
            "comment": "I'm so sorry this happened to you and I hope that you will be able to salvage as much as you can and hopefully be able to get compensation.",
            "score": 1,
            "author": "_Greediness_"
        },
        {
            "level": 0,
            "comment": "Wow that's so fucked up, what a fucking prick.",
            "score": 1,
            "author": "Sirhotness"
        },
        {
            "level": 0,
            "comment": "Damn bro that's sucks, sorry",
            "score": 1,
            "author": "riasbestgirl69"
        },
        {
            "level": 0,
            "comment": "I would definitely fight tooth and nail to make sure who ever broke my shit paid me for damages this is just sickening. Just because he can’t understand the hobby that doesn’t give him the right to destroy other peoples property.",
            "score": 1,
            "author": "Fallenlion2"
        },
        {
            "level": 0,
            "comment": "Good God, thats absolutely heinous. As many others have said, you need to pursue this in some form. If it were a few figures it would still suck, but that would be understandable to write off. 20k worth of damages is absurd and should absolutely not go without any repercussions. At the very least, look into whatever avenues are available to you and then consider what to do moving forward. \n\nI'm so sorry you have to deal with this, OP.",
            "score": 1,
            "author": "krauser8882"
        },
        {
            "level": 0,
            "comment": "Rikka...Morgiana..Beatrice.. NOOOOOOOO. 😭😭😭. Please try to salvage them. Whether it's fixing or selling but i promise they're not trash. I am so sorry your ex's pos step father decided that your belongings were his to destroy. I side with other commenters in saying please get legal help and document current market value for all of your figures. Im so sorry op!!",
            "score": 1,
            "author": "Samichan22"
        },
        {
            "level": 0,
            "comment": "This hurts my heart, what a horrible situation, he sounds fucking deranged",
            "score": 1,
            "author": "kittyboy3434"
        },
        {
            "level": 0,
            "comment": "Oh my…so sorry this happened, I hope u doing well..\nSuch a good collection, so sad..",
            "score": 1,
            "author": "DangerMayer"
        },
        {
            "level": 0,
            "comment": "That living scum of a human.... Fk em up!",
            "score": 1,
            "author": "springfiremonkey"
        },
        {
            "level": 0,
            "comment": "This is absolutely horrible, I’m sure this was a collection of a couple years that you spent time to grow (makes it worse along with the cost). I hope you can repair them as others suggested and get some money back.",
            "score": 1,
            "author": "LemonMIntCat"
        },
        {
            "level": 0,
            "comment": "this is fucked up. Sorry OP.",
            "score": 1,
            "author": "TheOrdoHereticus"
        },
        {
            "level": 0,
            "comment": "Holy shit.. so sorry to see this happen to you man, like others have said here, if you can I’d try and at least got something back from the one who did this. 20k sounds like a lot of time and dedication to collecting, and for it to end up like this.. that ain’t right. Most of the people I meet are open to my hobby and I don’t hide it. But seeing this would definitely make you think twice.",
            "score": 1,
            "author": "Longjumping-Win32"
        },
        {
            "level": 0,
            "comment": "OP, I'm really sorry this happened to youl. No one deserves to be treated this way and have something they treasure destroyed in this manner. Please take care and stay safe",
            "score": 1,
            "author": "nendohunter"
        },
        {
            "level": 0,
            "comment": "WTF",
            "score": 1,
            "author": "CactusCalin"
        },
        {
            "level": 0,
            "comment": "I really feel with you. It is unacceptable how some people think they can act and get away with it. If this would happen where I live, I would make sure to drag him to court for damage to property. I'm livid just thinking about this!",
            "score": 1,
            "author": "jewgeni"
        },
        {
            "level": 0,
            "comment": "Take the mofo down... make him pay out the ass. I don't even know what I would do.  I'm so sorry for your loss.",
            "score": 1,
            "author": "black_whitewolf"
        },
        {
            "level": 0,
            "comment": "Holy crap ! that is so heartbreaking. I'm so so sorry that this happened to you. I hope you can find a way to fix them all. If I were you, I'd probably end up in jail for murder",
            "score": 1,
            "author": "Kellz_The_Mui_Simp",
            "replies": [
                {
                    "level": 1,
                    "comment": "As a fellow figure collector, I am hurting for you. SENDING ALL THE GOOD VIBES AND VIRTUAL HUGS TO YOU",
                    "score": 1,
                    "author": "Kellz_The_Mui_Simp"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Bro…….",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I cant even imagine. You should seek legal council. I can see Law, Boa, Vivi, and Ace in that box and they all look like P.O.Ps. As a fellow One Piece collector my heart goes out to you.",
            "score": 1,
            "author": "TwistBL"
        },
        {
            "level": 0,
            "comment": "100% sue him. Its unacceptable an adult feels lime he can act that way.",
            "score": 1,
            "author": "BakaSamasenpai"
        },
        {
            "level": 0,
            "comment": "O.O I would’ve went freaking nuts!",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Fuck your stepdad",
            "score": 1,
            "author": "Mr_Clasher76-Youtube"
        },
        {
            "level": 0,
            "comment": "I don't know you but I want the person who thinks that it's okay to destroy other people's property to be punished. I want Justice. Make It Happen please.",
            "score": 1,
            "author": "sircraftyhands"
        },
        {
            "level": 0,
            "comment": "I’m sorry OP, hope things get better.",
            "score": 1,
            "author": "sagrado_corazon"
        },
        {
            "level": 0,
            "comment": "pursue charges, put him in prison for burglary, vandalization, intimidation, tresspassing.  Then sue him for the damages once he gets out of prison.",
            "score": 1,
            "author": "JesusCrits"
        },
        {
            "level": 0,
            "comment": "Oh my… I’m sorry to hear that please take legal action",
            "score": 1,
            "author": "Blastoon_"
        },
        {
            "level": 0,
            "comment": "I never say this but that guy seem like a real piece of shit for destroying all your stuff. I'm sorry that this happen to you. Please go after him for the damage that was done.",
            "score": 1,
            "author": "FranXX0016"
        },
        {
            "level": 0,
            "comment": "I feel like you can definitely pursue some kind of legal action for this.",
            "score": 1,
            "author": "GenuineSteak"
        },
        {
            "level": 0,
            "comment": "This is the horrible. Speak with lawyer. 20k of a damage is not a joke and this person should be held accountable",
            "score": 1,
            "author": "FutoMononobe"
        },
        {
            "level": 0,
            "comment": "Omg I’m so sorry this happened! It’s always been a fear of mine with parents and in laws who don’t understand the hobby and the expense that they ruin figures and think it’s no big deal.",
            "score": 1,
            "author": "Jkonbonn"
        },
        {
            "level": 0,
            "comment": "F",
            "score": 1,
            "author": "CHANGESHINKALION"
        },
        {
            "level": 0,
            "comment": "This man has shown an enormous amount of disrespect against you and all the artists who have worked really hard to make these figures.\n\nI hope karma gets his dong bent",
            "score": 1,
            "author": "Left_Dreamer"
        },
        {
            "level": 0,
            "comment": "I'd be throwing hands.  Good luck to you, OP.  Hopefully you'll be able to salvage some.  Good luck organizing accessories for some of the figures, though.",
            "score": 1,
            "author": "khmergodpc"
        },
        {
            "level": 0,
            "comment": "Youre a better man than me, would’ve rained hell on that man",
            "score": 1,
            "author": "miguel_snchz98"
        },
        {
            "level": 0,
            "comment": "Damn that’s fucked up. Best of luck man.",
            "score": 1,
            "author": "baxter0728"
        },
        {
            "level": 0,
            "comment": "Man, words fail to convey how angry I’d be if this happened to me. Good luck getting compensated and I hope you manage to recover all of it.",
            "score": 1,
            "author": "drchia"
        },
        {
            "level": 0,
            "comment": "I hope you called the cops",
            "score": 1,
            "author": "The_Kraken_Wakes"
        },
        {
            "level": 0,
            "comment": "Don't roll over on this. Seek council and sue.",
            "score": 1,
            "author": "MoopyMorkyfeet"
        },
        {
            "level": 0,
            "comment": "I'd get the law involved",
            "score": 1,
            "author": "SkullyEyes"
        },
        {
            "level": 0,
            "comment": "Sue him or fuck his ass up",
            "score": 1,
            "author": "PhenomenalOne27"
        },
        {
            "level": 0,
            "comment": "Might take a while, but you should look into it like everyone says. The lawyer issue and money issue is something you should consult with different firms.\n\n\nDon't let this issue drag on either. As soon as you are capable, you should prepare a story of what happened, and sent it to various lawyer agencies. See how they reply and I would say, pick the one that you feel can help you out the best. In some cases, with property damage, they should be able to make a case of it and get him to pay a percentage of the lawyer's expenses.\n\n\nIt's just an assumption, but definitely worth the try :/\n\n\nAlso by stepfather you meant the GF's stepfather? (Father in law?)",
            "score": 1,
            "author": "Andres_Robo"
        },
        {
            "level": 0,
            "comment": "This is horrible, I’m so sorry that this happened to you, so infuriating to even just hear about, ugh! If the damage surpasses a certain threshold and you’re willing to take the effort, you can 100% take him to court and have a solid case. You can show order history and any receipts to prove the value in damages/losses too aaaaa",
            "score": 1,
            "author": "luluhatchi"
        },
        {
            "level": 0,
            "comment": "So sorry that happened…hope you can sue the hell outta him or at least get ur ex to pay u back",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "What a piece of garbage person. So sorry…",
            "score": 1,
            "author": "Manofculture03"
        },
        {
            "level": 0,
            "comment": "Sue the crap out of the piece of human garbage that he is.",
            "score": 1,
            "author": "AstorReinhardt"
        },
        {
            "level": 0,
            "comment": "Serously....i would beat em up a little bit. They deserve it.",
            "score": 1,
            "author": "Finalnash"
        },
        {
            "level": 0,
            "comment": "You see this is the time when you beat the shit out of that person 🤨 and btw its REALLY easy to buy a gun also easy to get an unlicensed gun the gun part is only if you dont know how to fight or the guy is like 6 ft over 250 pounds and benches like 500 pounds",
            "score": 1,
            "author": "Dick-Burgers"
        },
        {
            "level": 0,
            "comment": "Investigate suing him with a lawyer, the person who posted the specific article you mentioned makes a great point.",
            "score": 1,
            "author": "WaryNIKLAS"
        },
        {
            "level": 0,
            "comment": "Betty nooooooo",
            "score": 1,
            "author": "Emergency-Job-2008"
        },
        {
            "level": 0,
            "comment": "Im so sorry, I hope youre able to get justice somehow. I would NEVER let this go.",
            "score": 1,
            "author": "Mander2019"
        },
        {
            "level": 0,
            "comment": "Pretty sure you can charge him for vandalism of property. Get all your receipts in check and go get that bag",
            "score": 1,
            "author": "ThatSmallBear"
        }
    ]
}