{
    "id": "2p05v5",
    "score": 5,
    "title": "Due to this being an anonymous forum",
    "author": "JerichoDelecroix",
    "date": 1418328362.0,
    "url": "https://www.reddit.com/r/CCU/comments/2p05v5",
    "media_urls": [],
    "other_urls": [
        "http://www.thestate.com/2014/12/10/3866394/chalking-incident-touches-off.html"
    ],
    "postText": "I was wondering what everybody thinks of this incident?\n\nhttp://www.thestate.com/2014/12/10/3866394/chalking-incident-touches-off.html\n\nAlso, what do you like and not like about campus. I want to make this a general bitching session. \n\nI don't like how there is no emphasis on critical thought. Almost everybody I have met on campus either regurgitates talking points from both liberal and conservative mouths, or just dont know what the heck they are talking about.\n\nCampus is charging an extra $40 dollars for Obamacare\n\nTheir are people who have jobs that shouldn't have jobs, specifically in administration\n\nFuck the wall building",
    "comments": [
        {
            "level": 0,
            "comment": "It amazes me how many people misunderstand the First Amendment and free speech.  There is a policy in place that covers having chalk announcements on the sidewalks. There is also policy in place to govern what happens when policies are broken by students. It's all about the process. I doubt very seriously the students will face any punishment, however since Public Safety was involved, the formal process has to proceed. Had the students gone to OSAL and asked for permission to chalk the sidewalks, none of this would have happened this way. \n\nThe $40 charge is because now adjuncts who weren't covered by insurance now are being covered due to the rules of the Affordable Care Act.  ",
            "score": 3,
            "author": "JimYamato"
        },
        {
            "level": 0,
            "comment": "My indifference meter went off about the chalking incident. It's not like they were drawing swastikas or anything. \n\nI think there needs to be more of a focus on academics and less on business and marketing. Asian Studies would be a big plus, as would more Masters and Doctoral programs, but I'm sure there is more to it than \"Let's hand out PhD's!\" ",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "They are working to get a PhD program and more Masters, but there are serious hoops they have to jump through in Columbia in order to get approved. One big hurdle is that the degree has to be unique and not in competition with one at either Clemson or USC.",
                    "score": 1,
                    "author": "JimYamato",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; One big hurdle is that the degree has to be unique and not in competition with one at either Clemson or USC.\n\nWhat?",
                            "score": 3,
                            "author": "IrishPrime",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Degree programs have to be approved by the state. Like boatist said, redundant programs won't be approved.",
                                    "score": 1,
                                    "author": "JimYamato",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I just find it surprising since all three schools offer a lot of the same undergrad degrees, and Clemson and USC both offer a lot of the same graduate degrees. I've never seen/heard any discussion on the issue before.",
                                            "score": 2,
                                            "author": "IrishPrime",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The programs that Coastal had before splitting from USC stayed. So that explains some of the similaritiea. But you'll never see a pure engineering program at Coastal.",
                                                    "score": 1,
                                                    "author": "JimYamato",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Well yeah, Coastal is a liberal arts school, but that doesn't change the fact that we already have multiple public universities which offer the same degrees at different levels (BSc, MSc, and PhD).\n\nEdit: As in, you can get a BSc in philosophy, or math, or computer science, or English, or a dozen other subjects at any of the three schools. You can get an MBA at, I believe, all three schools. I had never heard of any stipulation that degrees must be unique.",
                                                            "score": 2,
                                                            "author": "IrishPrime",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "New degree programs have to be unique.",
                                                                    "score": 1,
                                                                    "author": "JimYamato",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I should have just asked explicitly to begin with. Do you have a source for this? I'd like to read more.",
                                                                            "score": 1,
                                                                            "author": "IrishPrime"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}