{
    "id": "qf9tn",
    "score": 5,
    "title": "98th Percentile",
    "author": "herpderpedia",
    "date": 1330736065.0,
    "url": "https://www.reddit.com/r/CCU/comments/qf9tn",
    "media_urls": [],
    "other_urls": [],
    "postText": "I took the ETS Major Field Test for Business (required exit exam for all business students) today and landed myself in the 98th percentile among tens of thousands of business students across the nation.  I'm representing Coastal well.\n\nThe testing is not done yet, and I don't know if I'll ever find out for sure, but I wonder if I have the best score in the college of business.\n\nAnyway, I just wanted to share my success story.  I hope you enjoyed it and it restored faith in the curriculum at CCU.  Like a boss.",
    "comments": [
        {
            "level": 0,
            "comment": "[*clap*](http://files.sharenator.com/SlowClap_01_Coolest_Way_to_Erase_a_CD-s500x384-165046-535.jpg)",
            "score": 3,
            "author": "crooks5001",
            "replies": [
                {
                    "level": 1,
                    "comment": "slow...fap ",
                    "score": 1,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Congratulations!! You definitely have a right to brag.\n\nI'm definitely not looking forward to that. How was it? Any tips?",
            "score": 3,
            "author": "chrissydee123",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks.  I honestly did not think the test was all that hard, but it probably helps having twice the major courses as everybody else in the room.  You get an hour to do each part.  There are two parts, with 60 questions each.  Once you finish the first part, you can't go back to it.  I finished each part in about 30 minutes.\n\nAs far as tips go:  do the practice questions, then review the ones you missed.  I even went through the practice questions for the MFT Associates in business to look back at the more basic stuff, and that helped.  After I exhausted my practice questions, I went on to [quickmba.com](http://www.quickmba.com) and read through articles.  I'm not sure how much that really helped me, to be honest.  The best way to do well on the MFT is to pay attention throughout your major courses and actually learn.  Sounds like a lame hindsight statement, but it's the facts.\n\nThis year, this test is worth 7% (70 points) of the 478 grade.  I got a 69.36/70 or something like that.  Kinda bullshit, but that's how 478 works.  If it's not perfect, you won't get a perfect.",
                    "score": 2,
                    "author": "herpderpedia"
                }
            ]
        }
    ]
}