{
    "id": "1258d6g",
    "score": 15,
    "title": "Psychology of Evil",
    "author": "umd-dr-evil",
    "date": 1680051516.0,
    "url": "https://www.reddit.com/r/jhu/comments/1258d6g",
    "media_urls": [],
    "other_urls": [
        "https://summer.jhu.edu/programs-courses/undergraduate-courses/online-undergraduate-courses/?query=psychology+of+evil",
        "https://preview.redd.it/ts4gaqr5ukqa1.png?width=1818&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=89c059cb930dff7aa7636d9f2e6019832dd58120"
    ],
    "postText": "I'm excited to bring my course on the [**Psychology of Evil**](https://summer.jhu.edu/programs-courses/undergraduate-courses/online-undergraduate-courses/?query=psychology+of+evil#filter_results) to JHU this summer... what question about evil would you be most interested in asking?\n\nhttps://preview.redd.it/ts4gaqr5ukqa1.png?width=1818&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=89c059cb930dff7aa7636d9f2e6019832dd58120",
    "comments": [
        {
            "level": 0,
            "comment": "Does performing an evil act or multiple evil acts chronically make a person evil? If not - can a person be evil especially if lack of self control can br an underlying cause.",
            "score": 2,
            "author": "paintedfaceless",
            "replies": [
                {
                    "level": 1,
                    "comment": "At the heart of your question is a bigger one... how do we even ***define*** evil? It's not as easy as it sounds, and it's actually the first short writing assignment in the course. Self-control is an interesting aspect to consider, and even that needs a definition. For example, on one extreme our justice system generally includes a caveat that someone cannot be found guilty of a crime that they aren't capable of understanding or controlling. On the other extreme, perhaps you have someone who is simply tempted by their own selfish desire and gives into it even though they know what they're doing is harming another person... did they really lack all self-control, or did them simply decide not to exercise it? In the course I think we'll see examples of both extremes and everything in between, and throughout it I will encourage you to use your own personal definition of evil to address some of these questions as they apply to case studies, your experiences, historical events, and the events that we see unfold in the news each day.",
                    "score": 4,
                    "author": "umd-dr-evil"
                }
            ]
        }
    ]
}