{
    "id": "129wsm2",
    "score": 8,
    "title": "how to survive grade deflation",
    "author": "Asleep-Ad-4099",
    "date": 1680466700.0,
    "url": "https://www.reddit.com/r/jhu/comments/129wsm2",
    "media_urls": [],
    "other_urls": [],
    "postText": "hey, pre-frosh here wanting to know how to get as high of a GPA as possible as a bio major. \n\nfor reference, i did take ap bio and ap chem with 5s on both exams. is there prep that would help bridge the gap between where i am now and where i need to be to get an A in a class like ochem 1?",
    "comments": [
        {
            "level": 0,
            "comment": "Best way to get better grades is to not load up on too many credits in any given semester. If you’re coming in with AP credits, you can afford to take a few semesters under 15 credits which makes things a lot more manageable, especially in your first semester or two.",
            "score": 17,
            "author": "minskyinstability"
        },
        {
            "level": 0,
            "comment": "You sound like you're doing really well right now and is prepared for college. Having taken AP bio  is enough background knowledge for all the bio classes here. Ochem1 is completely different from general chem and there's really nothing you can do to prepare yourself. Maybe you can go over naming principles but enjoy your summer before college! No need to stress about classes atm. High GPAs are very possible... you'll be fine!",
            "score": 6,
            "author": "bossyman300"
        },
        {
            "level": 0,
            "comment": "just be different",
            "score": 5,
            "author": "Alarming-Pin1829",
            "replies": [
                {
                    "level": 1,
                    "comment": "tysm!!!",
                    "score": 0,
                    "author": "Asleep-Ad-4099"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you’re smart with your time and energy, you’ll be just fine. I was in a similar situation with anxiety about my GPA because of my (relatively) low SAT score and I graduated with a 3.9. It’s doable, you just have to be deliberate with how you spend your time",
            "score": 3,
            "author": "Aleck-l2",
            "replies": [
                {
                    "level": 1,
                    "comment": "okay thank you so much for this comment! everyone has been telling me that i’ve screwed up my future by committing to hopkins (which was my dream school). i think i just needed to hear that it’s possible to have a high gpa :)",
                    "score": 1,
                    "author": "Asleep-Ad-4099",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "its really not that bad. esp if you're not taking a lot of credits (15-17 per semester is very doable).",
                            "score": 2,
                            "author": "AgentPenguin92"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I found clutch prep to be super helpful with my intro classes. I also remember it being decently cheap at $60 a semester and it really helped me",
            "score": 2,
            "author": "autkoe"
        }
    ]
}