{
    "id": "12fpwvj",
    "score": 2,
    "title": "Carey Business School opinions?",
    "author": "ApprehensiveEssay515",
    "date": 1680969134.0,
    "url": "https://www.reddit.com/r/jhu/comments/12fpwvj",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey, I’m considering joining the business school at JHU this fall with a ~90% scholarship and wanted to know what’s the general opinion of the school?\nAnd also, if anyone’s studying at Hopkins, what is the general consensus of the business school around campus? \nCurious to know some candid* opinions",
    "comments": [
        {
            "level": 0,
            "comment": "Hey there! I am attending Carey part-time for their graduate program. The education is exactly what I hoped for, I am learning a curated business curriculum and I get to focus on the business of healthcare technology too. The class speakers can be cool, you can hear from people in the industry share their thoughts on a topic and best practices in addition to having an opportunity to ask questions on their journey and challenges they face. \n\nComing from a decade long research career in biotech, I found what I am learning to be super helpful when I got involved at a startup. I regularly apply the leadership, strategy, negotiation, and management skills sets that I have learned to date.  I definitely feel I am better equipped for than I was before attending.  \n\nThere are a number of extracurricular avenues you can get involved in as well for applying your knowledge if you’re full time such as Hexcite or JHTV. I personally would love to get more involved in those but there are not enough hours in the day :)\n\nNow how does it compare to other schools? I am not sure because my experience is only at Carey but I don’t have any regrets. Networking is something I’ve read around as a pain point when I was looking up the school before attending. Happy to say that it is available if you make the effort - and I imagine this is like anywhere else. \n\nI’ve gotten to know and connect with people, while being a part time student, who work in government agencies, Pharma companies, and Big 4 consulting. There’s also a fair amount of recruiters on their handshake service from those organizations and more with multiple internship opportunities throughout the year. \n\nChoice is yours but I would recommend the program for anyone looking to grow as a business professional.",
            "score": 5,
            "author": "paintedfaceless"
        },
        {
            "level": 0,
            "comment": "I heard it’s not a good school lol",
            "score": 6,
            "author": "hop-anon-"
        },
        {
            "level": 0,
            "comment": "Not sure about grad students but among undergrads I’ve never heard anyone talk about it, ever. It’s also in completely different  part of Baltimore, I’ve only ever been for a fancy event and even then it didn’t feel like Hopkins",
            "score": 4,
            "author": "aglifeisgood",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s very helpful to know, thank you",
                    "score": 2,
                    "author": "ApprehensiveEssay515",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The undergrads don’t talk about it bc there’s only a business minor available, so there’s not much to talk about.",
                            "score": 4,
                            "author": "TaterTotz8"
                        },
                        {
                            "level": 2,
                            "comment": "That's because it doesn't have any undergraduate programs. Only graduates.",
                            "score": 2,
                            "author": "NemesisAntigua"
                        }
                    ]
                }
            ]
        }
    ]
}