{
    "id": "12k5yj5",
    "score": 8,
    "title": "Can \"evil\" be justified?",
    "author": "umd-dr-evil",
    "date": 1681346749.0,
    "url": "https://www.reddit.com/r/jhu/comments/12k5yj5",
    "media_urls": [],
    "other_urls": [
        "https://summer.jhu.edu/programs-courses/undergraduate-courses/online-undergraduate-courses/?query=psychology+of+evil",
        "https://www.reddit.com/poll/12k5yj5)"
    ],
    "postText": "As I prep to bring my course on the [**Psychology of Evil**](https://summer.jhu.edu/programs-courses/undergraduate-courses/online-undergraduate-courses/?query=psychology+of+evil#filter_results) to JHU this summer, I'm curious to hear your perspective on a question I ask students to consider...\n\n**Can something that you would define as \"evil\" ever be the \"right\" thing to do?**\n\n[View Poll](https://www.reddit.com/poll/12k5yj5)",
    "comments": [
        {
            "level": 0,
            "comment": "I would like to opt in to receive updates on this topic.",
            "score": 5,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Higher order goods.",
            "score": 2,
            "author": "Mr-Clean415"
        },
        {
            "level": 0,
            "comment": "I do have some of my own take on this question: Was dropping two nukes that killed hundreds of thousands of civilians evil? Hell yeah. Nevertheless, many people believe it was the right way to end a war. \n\nThe ground zero of Hiroshima was a hospital, not a command center or arsenal. I am not convinced that killing civilians with WMD is right and justified. \n\nIf we normalize civilian casualties as acceptable cost to end a war, then what is the point of rules of engagement and Geneva convention?",
            "score": 2,
            "author": "H2TG"
        },
        {
            "level": 0,
            "comment": "Every evil action is done by someone who believes they are doing what’s right.",
            "score": 2,
            "author": "baltebiker"
        },
        {
            "level": 0,
            "comment": "Well, you see, \"good\" is commonly defined as what shareholders like, so as long as your actions impress shareholders, nothing else matters.",
            "score": 1,
            "author": "jobmarketsucks"
        },
        {
            "level": 0,
            "comment": "The way we’ve been exploiting animals for our uses I would consider both evil and justified, or at least was justified at some point in history",
            "score": 1,
            "author": "shy_ivy"
        },
        {
            "level": 0,
            "comment": "How do you define evil? To me, evil is something that is in no way, shape or form justifiable. That’s my definition at least. People can do horrible and terrible things that have reasons behind them. Depending on your perspective, those reasons may or may not justify it. I think it comes down to your unique perspective: is this action justifiable? If it is to you, then I’d argue that you don’t see it as evil. For example: I don’t mean to get political, but I don’t think white supremacists see themselves as evil. They believe, in their own twisted way, that what they are doing is justified. I don’t and I think they’re evil. Their justifications are completely invalid to me. So anyway thanks for coming to my tedtalk (2011 alum)",
            "score": 1,
            "author": "topherbdeal"
        },
        {
            "level": 0,
            "comment": "nah son evil is the worst fucked up shit ever",
            "score": 1,
            "author": "interik10"
        }
    ]
}