{
    "id": "13myx3f",
    "score": 5,
    "title": "General questions about JHU physics and astronomy",
    "author": "Slight-Contest-1568",
    "date": 1684598900.0,
    "url": "https://www.reddit.com/r/jhu/comments/13myx3f",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi all,\n\nI'm a rising senior who's deciding where to ED, and JHU is one of my top choices. I had a couple of questions I'm hoping you guys can answer about JHU. For context, I'm a huge astrophysics nerd, but I also like math and CS. \n\nI searched this sub for posts like this, and what I've determined about the physics department so far is:\n\n* Very good courses and profs\n* good community (physics majors)\n* lot of research opportunities for undergrads\n* research in the physics department is focused on astro (this is the part that especially appeals to me)\n\nMy first question is how accurate is what I said above? Specifically the parts about undergrad research and astro research. Obviously, this came from people attending JHU but I just wanted to confirm. \n\n2. Is it easy to double major or minor at JHU (CS specifically)? I'm not talking about if the actual work is easy, but the process itself (i.e. will they let you, is it just a form you have to do, etc)\n\n3. Sort of an extension of #2, but how good is JHU CS? In terms of courses, profs, and most importantly job prospects. \n\n4. What jobs do physics majors do after undergrad? How much do they make? I know some other colleges post this data, and I was wondering if JHU does too (I tried searching on google but I couldn't find anything, I'm probably not searching the right terms). \n\n5. In terms of social life, I mostly consider myself to be an introvert except when I'm with my closest friends. I'm definitely not a party guy, but I do enjoy just hanging out with my friends at random places. Based on this, would JHU be a good fit for me? (or rather, a \"not bad\" or \"acceptable\" fit). \n\nThanks!",
    "comments": [
        {
            "level": 0,
            "comment": "Not a physics major but a mentee of mine was \n\n1. He really liked that the physics community was close and small \n\n2. Yes, the requirements might vary if you change which one is your primary bc CS is in engineering but all you have to do is declare it through SIS. You have to take a good amount of math for physics anyway so minor in math will be easy \n\n3. Unsure, very group project heavy  \n\n4. Unsure, but most physics majors I know go off to grad school, I know two doing stuff at NASA \n\n5. This is exactly what my friends do and I love it! There’s a lot to do in Baltimore and lots of parks so if you just like to hang around mt vernon and fed hill and hampden are all great for those! The blue jay shuttle and JHMI are p extensive and there’s always stuff going on on campus",
            "score": 3,
            "author": "aglifeisgood",
            "replies": [
                {
                    "level": 1,
                    "comment": "thank you!",
                    "score": 1,
                    "author": "Slight-Contest-1568"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I can't speak much to anything in the physics department other than the intro courses are pretty tough for most students. As for double majoring, it's extremely common, most people I know double major and/or take on minors. Specifically with CS, it's one of the more popular options for a double major; not a ton of core requirements, and it has a lot of overlap with any kind of \"computational\" majors (e.g. cognitive science has the \"computational cognitive science\" focus area that can be finished almost entirely with CS major requirements). Administratively, declaring a double major is as easy as going into SIS (where you pay your tuition, see your grades, and sign up for courses) and \"submit a form\" to request a secondary major. KSAS majors can't be declared until your sophomore spring, but WSE majors can be declared whenever. \n\nCS is a pretty good department, the classes are typically easy. I can give more info on specific courses if you want. One note about opportunities, the Applied Physics Lab has a ton of summer internships that are definitely worth looking into (applications open early fall). I know they have several for CS/ECE students working on some pretty cool R&amp;D projects.",
            "score": 2,
            "author": "Birk_Boi",
            "replies": [
                {
                    "level": 1,
                    "comment": "good to hear, thanks!",
                    "score": 1,
                    "author": "Slight-Contest-1568"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was in a very similar situation! I doubled in Physics and AMS (Applied Math/Stats) with a Math minor, but did a lot of Astro research as an undergrad and am still doing it in grad school. The physics major is very close-knit, with lots of support from the department both in terms of academics and research. Every year we gave them feedback on our experiences, and they took that and actually updated course structure to give the next generation of majors a better experience. The department is officially \"Physics and Astronomy\", so while there's no Astrophysics major, your course profs may be doing astro research and are very willing to talk to students about research opportunities - that's how I initially got involved.\n\nI know less about CS, but my friends who majored there did quite well. I feel JHU CS is pretty well respected and there are lots of internship opportunities for students. I actually started out as a CS minor, but dropped after a few semesters when I realized data analysis was more useful for me (via AMS) more so than software development/computer architecture.\n\nThere's a pretty wide range of what physics majors do. A good amount every year go to grad school, but there are also those who go more towards engineering (aerospace, electrical, etc), or Masters in CS, etc. Finance/econ is also surprisingly popular because of the problem solving skills students get.\n\nI was absolutely not a party guy. The Hopkins party scene is small compared to other schools (as is Greek life as a whole). Hanging out in random places with close friends is pretty much what I did all four years. Honestly if someone's goal was to party all 4 years, there are much easier places to do that than Hopkins. You'll be fine. Second the other comment about using the shuttles/JHMIs/circulators to explore the city. I loved the harbor!",
            "score": 2,
            "author": "Tantalus2102",
            "replies": [
                {
                    "level": 1,
                    "comment": "thanks for the info!",
                    "score": 1,
                    "author": "Slight-Contest-1568"
                }
            ]
        }
    ]
}