{
    "id": "9yaaqf",
    "score": 92,
    "title": "Bloomberg Donating $1.8 Billion to Hopkins for Financial Aid",
    "author": "[deleted]",
    "date": 1542578584.0,
    "url": "https://www.reddit.com/r/jhu/comments/9yaaqf",
    "media_urls": [
        "https://www.nytimes.com/2018/11/18/opinion/bloomberg-college-donation-financial-aid.html#click=https://t.co/zgyD7jDGfI"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "No loans starting next semester. I'm ecstatic and incredibly thankful to Mr. Bloomberg. ",
            "score": 21,
            "author": "LifesCheckmate",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yea seriously. God bless ",
                    "score": 2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wtf I love michael bloomberg now",
            "score": 39,
            "author": "GeneralBearegardLee",
            "replies": [
                {
                    "level": 1,
                    "comment": "Friendship ended with Ronald\n\nMichael is my new best friend",
                    "score": 18,
                    "author": "JediDM99"
                },
                {
                    "level": 1,
                    "comment": "&gt; now\n\nHeretic. ",
                    "score": 20,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "Or he could...support taxing the rich to make education free",
                    "score": 3,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Holy shit that's a lot of money. Does anyone know if this might result in increased financial aid for current students?",
            "score": 12,
            "author": "PeculiarCitrusScent",
            "replies": [
                {
                    "level": 1,
                    "comment": "the email says that all federal loans starting this spring will be forgiven and hopkins will give financial aid in terms of scholarships and grants, not loans",
                    "score": 25,
                    "author": "GeneralBearegardLee",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Serious question: is there any discussion of this applying retroactively? Kind of a slap in the face of people who graduated in the last few years and some have tens of thousands in debt.",
                            "score": 20,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Lol its worth a shot",
                                    "score": 7,
                                    "author": "GeneralBearegardLee"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt; the email says that all federal loans starting this spring will be forgiven and hopkins will give financial aid in terms of scholarships and grants, not loans \n\n&amp;#x200B;\n\nDouble checking (because I'm a paranoid individual). This means if I'm a current senior then all 4 years of my loans will be forgiven, right?\n\n&amp;#x200B;",
                            "score": 1,
                            "author": "iiilll123",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "honestly I have no idea if it's retroactive or not",
                                    "score": 1,
                                    "author": "GeneralBearegardLee",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Probably not. Once they are dispersed to the student you would need to cut people checks.",
                                            "score": 2,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "While I'm happy to see this effort to diversifying Hopkins socioeconomically, I kind of disagree that everything is just going to admissions. I'd like to see more support and community structures for low-income individuals already on campus.",
            "score": 12,
            "author": "WilliamHwdShaft",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ya personally I think money is just part of the battle. There’s everything else that goes along with being low income- class, potentially ethnicity, habits, appearance, etc.. Still overall I think it’s good, and it’s certainly good for the university.",
                    "score": 13,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This. Theres such a stark culture difference between economic classes that is inescapable even if you have a chance to leapfrog the system by going to an amazing university. Senior here and one of the hardest pills I learned to swallow was that much of the upper crust will never see me as nothing more than an opportunistic bottom feeder scraping by on a Billionaires hand out and I could never hope to even reliably fake being a part of that society, from my manners, to my clothes, right down to the crooked teeth I couldnt get braces for. I'm not even dirt poor either(as Dave Chappelle puts it, 'my parents worked enough that I could afford to be poor around white people'). \nThis being said, a chance to overcome struggle is always better than struggle alone. I have always been annoyed by how JHU boasts their diversity, despite the fact that most of the nonwhite students have the same amount of percieved entitlement and privilege as the white students, but this is a great step.",
                            "score": 18,
                            "author": "boooling",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Wouldn't a sign of a truly diverse environment be when everyone has the same amount of entitlement/privilege? What are you looking for?",
                                    "score": 1,
                                    "author": "nah_you_good",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Not at all. An environment where everyone has the same amount of privilege is not diverse if there other kinds of people existing with different amounts of privilege. What im talking about is the difference between when a friend says 'I'm poor' and when I say it. For them it really means that they have money and can survive but are limited by the allowance they get from their parents. In a way, I guess this is poor but it's not the 'I'm poor' I'm used to. Would you argue Hopkins is a truly diverse environment?",
                                            "score": 2,
                                            "author": "boooling"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "There's going to be loan forgiveness for current students.",
                    "score": 2,
                    "author": "TheAsianIsGamin"
                }
            ]
        },
        {
            "level": 0,
            "comment": "if I took out a loan for first semester and it just dispersed, will it be forgiven? ",
            "score": 3,
            "author": "memesap"
        },
        {
            "level": 0,
            "comment": "That does not help me. Full tuition cuts my throat anyway.",
            "score": 6,
            "author": "Ktgisgreat"
        },
        {
            "level": 0,
            "comment": "Does anyone know how this might impact graduate students?",
            "score": 2,
            "author": "tacosandcookies"
        },
        {
            "level": 0,
            "comment": "This is the best tl;dr I could make, [original](https://www.nytimes.com/2018/11/18/opinion/bloomberg-college-donation-financial-aid.html) reduced by 90%. (I'm a bot)\n*****\n&gt; A recent analysis by The Times found that at dozens of America&amp;#039;s elite colleges, more students came from the top 1 percent of the income scale than from the entire bottom 60 percent of that scale - even though many of those lower-income students have the qualifications to get in.\n\n&gt; First, we need to improve college advising so that more students from more diverse backgrounds apply to select colleges.\n\n&gt; Second, we need to persuade more colleges to increase their financial aid and accept more low- and middle-income students.\n\n\n*****\n[**Extended Summary**](http://np.reddit.com/r/autotldr/comments/9ym1vg/michael_bloomberg_why_im_giving_18_billion_for/) | [FAQ](http://np.reddit.com/r/autotldr/comments/31b9fm/faq_autotldr_bot/ \"Version 2.02, ~365152 tl;drs so far.\") | [Feedback](http://np.reddit.com/message/compose?to=%23autotldr \"PM's and comments are monitored, constructive feedback is welcome.\") | *Top* *keywords*: **student**^#1 **more**^#2 **college**^#3 **aid**^#4 **families**^#5",
            "score": 2,
            "author": "autotldr"
        },
        {
            "level": 0,
            "comment": "Bloomberg is our sugar daddy",
            "score": 1,
            "author": "trexkylorenurek"
        }
    ]
}