{
    "id": "i1vyf4",
    "score": 64,
    "title": "Fall 2020 Annoucement Date",
    "author": "JonnyPotter20",
    "date": 1596302845.0,
    "url": "https://www.reddit.com/r/jhu/comments/i1vyf4",
    "media_urls": [],
    "other_urls": [],
    "postText": "Does anyone have any idea when we are actually hearing what is happening this fall. It's gotten to a point where I don't care what is happening I just want answers.",
    "comments": [
        {
            "level": 0,
            "comment": "If it helps, staff have almost no idea what's going on either. It feels like every week we're hearing something different.",
            "score": 37,
            "author": "whathohamlet",
            "replies": [
                {
                    "level": 1,
                    "comment": "If you were to guess based off what you know rn what do you think is going to happen?",
                    "score": 8,
                    "author": "JonnyPotter20",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 16,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Wow. That is an insanely ridiculous plan. Have us online for a third of the semester, on campus for the middle third, and then back online!?!?!?!\n\nI don't think anyone wants that for many, many reasons.",
                                    "score": 11,
                                    "author": "JonnyPotter20"
                                },
                                {
                                    "level": 3,
                                    "comment": "i was told october as well in a meeting on monday.",
                                    "score": 5,
                                    "author": "whathohamlet"
                                },
                                {
                                    "level": 3,
                                    "comment": "Can you elaborate more on what you mean when you say  scuttling starting back on campus until at least October?",
                                    "score": 2,
                                    "author": "Bruhlag",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "my department was told that it means students will not be allowed on campus until oct 1st.",
                                            "score": 1,
                                            "author": "whathohamlet"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'm glad at least we're not alone in this. Just 24 days until freshman are supposed to move in... and a lot of upperclassmen have leases that start sooner. It's time to make a decision.",
                    "score": 9,
                    "author": "celestialViolinist",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "we were told in a meeting this week that students should be getting word “soon” but apparently “soon” didn’t mean any time this week :/",
                            "score": 5,
                            "author": "whathohamlet"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "just want to add to this that staff was told on friday that there is no final decision yet",
                    "score": 3,
                    "author": "whathohamlet",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks for keeping us updated! I personally love when staff join us here on jhu reddit. Wish final fall reopening plans would've come out sooner, but looks like that won't be happening soon",
                            "score": 2,
                            "author": "CatTheCactus",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "no prob! i also wish they would tell us for sure what's going on, haha.",
                                    "score": 1,
                                    "author": "whathohamlet",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Based on what you've been hearing. What would you say the odds are of freshman moving into dorms come August 25th?",
                                            "score": 1,
                                            "author": "JonnyPotter20",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "judging by sais/apl moving to be completely online and the covid numbers in maryland going up, i don't personally think the odds are good",
                                                    "score": 1,
                                                    "author": "whathohamlet"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Some of us are literally moving in next week. If they make us go online, alot of people are gonna be rightfully pissed after signing leases thinking we'll be in person",
            "score": 19,
            "author": "NecessarySafe"
        },
        {
            "level": 0,
            "comment": "Knowing Hopkins, never",
            "score": 13,
            "author": "rapidfinch103"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 5,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "i wouldn't even be surprised if they announced everything a day before classes start",
                    "score": 6,
                    "author": "SimilarGhost"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not to worry, we'll have the best testing. Very fast, very accurate. The best system.",
            "score": 5,
            "author": "bluejay57"
        },
        {
            "level": 0,
            "comment": "I think everyone, and this includes students, staff, faculty, and higher administration, shares your frustration around the situation. \n\nUnfortunately, with cases rising pretty much everywhere, I'm advising everyone I work with to maneuver themselves in a situation where they will feel safe irrespective of what the semester will bring. Faculty were required to develop contingency plans and accommodate remote students even if currently the class is offered in person, so irrespective of where you'll be: you'll get something out of the semester.\n\nWhat I can reassure you is that everyone is trying their best to deliver quality education and experiences. This uncertainty will **not** be the new normal, so let's get through this together.",
            "score": 10,
            "author": "defntly_not_mathias"
        },
        {
            "level": 0,
            "comment": "Thought we were going to get an email today but nope.",
            "score": 4,
            "author": "PlundersPuns"
        },
        {
            "level": 0,
            "comment": "i'm hoping sometime soon, considering how close we are to moving in &amp; starting classes",
            "score": 3,
            "author": "SimilarGhost"
        },
        {
            "level": 0,
            "comment": "Last I heard there was supposed to be an update August 1 (today), barring any significant changes.\n\n&amp;#x200B;\n\nFreshman housing gets assigned on August 10 so I'd guess that's the last day they could possibly announce something or change plans.",
            "score": 3,
            "author": "MediumForm"
        },
        {
            "level": 0,
            "comment": "https://covidinfo.jhu.edu/information-for-undergraduate-students/",
            "score": 1,
            "author": "jusmoren"
        },
        {
            "level": 0,
            "comment": "There was a covid alert on the jh site. At the top in red. Just as I signed a year lease and pretty much packed to head to Baltimore.",
            "score": 1,
            "author": "2Potins",
            "replies": [
                {
                    "level": 1,
                    "comment": "Can you send link?",
                    "score": 2,
                    "author": "JonnyPotter20",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My info is on the Peabody Institute  of John's Hopkins.",
                            "score": -1,
                            "author": "2Potins",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh. Okay. \n\nPeabody closed but us homewood kids still dont have answers.",
                                    "score": 3,
                                    "author": "JonnyPotter20"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Colorado",
            "score": -8,
            "author": "2Potins"
        },
        {
            "level": 0,
            "comment": "100% online. Sadly",
            "score": -7,
            "author": "2Potins",
            "replies": [
                {
                    "level": 1,
                    "comment": "Do you have confirmation for this? And full online for the whole semester?",
                    "score": 2,
                    "author": "JonnyPotter20"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That sucks. Just got confirmation  yesterday.  They COULD let us know before we all signed leases. Geez.",
            "score": -9,
            "author": "2Potins",
            "replies": [
                {
                    "level": 1,
                    "comment": "from where",
                    "score": 3,
                    "author": "MuchLogic"
                }
            ]
        }
    ]
}