{
    "id": "ks0oo0",
    "score": 100,
    "title": "Antisemitic JHU Chem TA tweets about giving lower grades to Jewish students",
    "author": "[deleted]",
    "date": 1609977615.0,
    "url": "https://www.reddit.com/r/jhu/comments/ks0oo0",
    "media_urls": [
        "https://www.standwithus.com/post/letter-to-johns-hopkins-university-regarding-antisemitic-posts-from-graduate-researcher-and-ta"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "The is appalling \n\nPardon my ignorance but can a TA give lower grades in a technical subject like Chemistry because she/he feels like it.\n\ni.e, isn't there a rubric which guides the TA and which can be challenged by the student.\n\nfor e.g. \n\n1 point for stating the variables\n\n1 point for correctly writing the equation\n\n2 points for highlighting the temperature and pressure constraints \n\netc.",
            "score": 22,
            "author": "Throabhay",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, most courses with TAs do have a rubric for grading, especially the large classes. Whether or not that rubric is enforced is up to the professor.",
                    "score": 11,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 4,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hmm... makes sense, thanks",
                            "score": 1,
                            "author": "Throabhay"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "When I was a TA back in the day, most of the general sciences had rubrics which I followed for grading. IF there were any issues, the student would have to individually appeal it to the professor. I've tried by best to follow the rubrics, but some of them are pretty generalized and can be skewed to give a few more or less points depending if I'm generous on that day or not.",
                    "score": 2,
                    "author": "Gulagman",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "thank you, got the picture",
                            "score": 1,
                            "author": "Throabhay"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What a stupid way to ruin your entire career.",
            "score": 35,
            "author": "ProteinEngineer"
        },
        {
            "level": 0,
            "comment": "1. Israel is an apartheid state\n\n2. The TAs actions are appalling and she should be fired for allowing her views to taint her obligation to JHU to grade fairly.\n\nBoth can be true at once.",
            "score": 19,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Disgusting. If these allegations are true hopefully the responsible are kicked out.",
            "score": 15,
            "author": "REM-DM17"
        },
        {
            "level": 0,
            "comment": "Just sayin, every students in that class needs to have their grades re-examined and likely re-graded. Especially anyone who has failed.\n\nTAs often grade together. Who knows if he has influenced other graders with similar mindsets.",
            "score": 5,
            "author": "Gulagman",
            "replies": [
                {
                    "level": 1,
                    "comment": "Just let students who think they were wronged submit a regrade. Don’t create more work for TAs and Profs. My guess is that despite the tough talk on Twitter, she actually graded fairly.",
                    "score": 5,
                    "author": "ProteinEngineer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "When I was a TA, there was one TA who was fired for basically being under the influence while grading. Every student that worked with him in the lab had their submissions re-examined and their grades adjusted. I remember the professor basically convening the rest of the TAs into a room and we hammered it out. It sucked, but it ensured the integrity of the university and the class.",
                            "score": 3,
                            "author": "Gulagman"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm sure I'll get downvoted for this, but as a Jew I will say these tweets are not anti-semitic (read them yourself [here](https://69c36138-3c5b-41a8-9374-92a021ef0240.usrfiles.com/ugd/69c361_e2ff94fffa4649bfbd4491e4a67b6278.pdf) ) . These tweets are from a person who has a problem with the  state of Israel, which is a literal apartheid state. Conflating criticism of Israel antisemitism is a common tactic used used to deflect criticism of Israel's inhumane policies, which is very frustrating as a Jew (who also has many relatives living in Israel) but also has serious problems with the state of Israel. We can have a discussion about whether these tweet cross a line or not, or what political beliefs we should or should not find acceptable, but there is nothing here that is anti-semitic.\n\nEditing this because I don't have the energy to respond to everyone individually: \nNo where in this post did I say 'therefore these tweets are ok'. All I said was these are not anti-semitic. Of course every student should be treated and graded fairly by their TA. I personally read the comments about grading to be a joke, and doubt they actually took action on it, but this is probably not the type of thing to be joking about on twitter. Also, of course you should not immediately assume someones political beliefs nor assign personal blame to someone based on the country they are born in (the US has done lots of terrible things that I am in no position to stop).",
            "score": 24,
            "author": "ozaveggie",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 22,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Couldn't have put it better myself",
                            "score": 6,
                            "author": "MaddSpazz"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I hear, but punishing someone for having been born in israel, or having visited, is pretty far over the line. by analogy: I can critique china's policies and disagree with its human rights abuses, but if I were to use my position as a TA to hurt chinese students, that's definitely racist.",
                    "score": 16,
                    "author": "GildedSnail"
                },
                {
                    "level": 1,
                    "comment": "These tweets tell me that they’re a much worse person than I originally thought. Good riddance",
                    "score": 5,
                    "author": "Misenum"
                },
                {
                    "level": 1,
                    "comment": "Was saying that she didn't want to be paired with \"some Israeli or bitch ass white boy to have to share (her) knowledge with\" a joke? I think you should do some more research on this person and get your facts straight. She has something against Israelies AND white people. That is what you call PREJUDICE and RACIST.",
                    "score": 4,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "THIS^ \nEdit: just because I think Ozaveggie is correct does not mean that I support any of the statements or tweets made by the person he's talking abt.",
                    "score": 4,
                    "author": "MaddSpazz"
                },
                {
                    "level": 1,
                    "comment": "What you are doing is analogous to a black trump supporter claiming Trump is not racist and using the fact that he is a supporter as evidence. You are free to have your opinion, but it is not definitive and you should acknowledge most ppl of your faith do not agree with your opinion. Singling out a person in the class for going on a trip to Israel is anti Semitic. She wasn’t posting nuanced arguments against the politics of Israel-it was basically just anti Semitic twitter trolling.",
                    "score": 3,
                    "author": "ProteinEngineer"
                },
                {
                    "level": 1,
                    "comment": "Exactly—Zionism is an explicit political ideology that this girl has obviously had experience with. Conflating Zionism with Judaism is a politic tactic meant to A. dissuade any criticism of Israel and B. implicate all Jews in Israeli fascism. Zionism itself is incredibly damaging to Jewish people and assaults the lobes and legacy of millions.\n\nAnd besides all that, homegirl is OBVIOUSLY joking. Is it a tasteful joke, no, but white people do not hold a monopoly on being tasteless.",
                    "score": 1,
                    "author": "RecommendationFun786",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The TA identified a Jewish girl in the class and determined she was Zionist for having a picture of Israel on her computer. That is anti Semitic. Imagine a TA identifying a Muslim student in the class with a picture from Iran, who had traveled to Iran, and assuming that person supported their Fascist government and making these same comments/holding it against the student. That would obviously be Islamophobic.",
                            "score": 11,
                            "author": "ProteinEngineer"
                        },
                        {
                            "level": 2,
                            "comment": "Explicit racism and antisemitism is not a joke, \"homegirl.\"",
                            "score": 4,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You should be downvoted - just because you are trying to justify the words of the TA on grounds of the state of Israel's policies/actions. He/She is very evidently a religious nut and his/her opinion/attitude is clouded by hate based on religion. By this person's logic, her/his existence should be governed by Hamas's actions. Stupid and ignorant.",
                    "score": 2,
                    "author": "vajra_"
                },
                {
                    "level": 1,
                    "comment": "Your stance on this is appalling. The tweets are more than just *anti-israel*, which is arguable justifiable, they are ***anti-israeli***; she is targeting people purely for being born in a country, where they may largely have no choice in political decisions",
                    "score": 1,
                    "author": "goatfucker42069"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don’t think this TA realizes that going on vacation with your parents does not equate to supporting genocide.",
            "score": 8,
            "author": "Practical_One_3335"
        },
        {
            "level": 0,
            "comment": "The tweets read like someone who might just be a few steps away from religious intolerance and extremism. Sad.",
            "score": 16,
            "author": "vajra_",
            "replies": [
                {
                    "level": 1,
                    "comment": "Define what Zionism is then if not an exercise in religious supremacy lol.",
                    "score": 5,
                    "author": "RecommendationFun786",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Have you ever considered that someone can be antizionist and in doing so also be antisemitic? or does that nuance escape you\n\nAlso since you’re just going to say some shit like “classical zionist!”, I am not a Zionist and I believe Palestinians have a right to that land but I’m not going to shit on Jewish people I know who live/have family in Israel for the circumstances of their life lmao",
                            "score": 6,
                            "author": "disposable4582",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ignoring your bad faith for just a second, of course anti-Zionism can descend into something far worse. Unfortunately for people on this thread, however, this is so obviously not an example. Palestinians are held to an unfair light where Israel is able to win not just physical wars but also the war of words—they get the land AND excuse fascism by intentionally conflating Zionism with Judaism. Related, but decidedly separate. \n\nWhat this post, this organization does is too intentionally smear any dissent not as criticism but as racism. It’s a tired tactic and one that’s anti-Semitic in and of itself—condemning a connection between ALL Jews and apartheid when this just isn’t the case. Our Jewish allies are smart and discerning enough to spot the difference. Are you?",
                                    "score": 1,
                                    "author": "RecommendationFun786",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The anti semitism was in singling out a student for having visited Israel and immediately castigating her as being \"Zionist\" and worthy of unfair treatment.\n\nWhat if a Jewish TA had said something similar regarding giving poor grades to  Muslim student and had a picture from Palestine? Or from Iran?  Surely that would rightfully be considered Islamophobic.  A TA making a similar assumption-that an Asian student who had traveled to China therefore supports their treatment of the Uighurs or HK residents-would rightly be considered bigoted against Asians.\n\nI think it's unfortunate that this person has basically ruined her career by making these statements public on social media (She is probably unhireable both in industry and academia now).  I don't think that she is actually a bigoted person-the comments were likely just made out of frustration without thinking too deeply about them..and the way comments like this follow people online makes reconciliation and forgiveness way more difficult than it should be. But a failure to recognize that these comments are bigoted, and even encouraging her and others to hold similar beliefs, is a big problem. You can of course be against Israel's politics without being anti semitic, but that sure wasn't an example it.",
                                            "score": 2,
                                            "author": "ProteinEngineer"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Yes you just pointed out the most basic of ideas in Israel-Palestine discourse. Good job",
                                            "score": 1,
                                            "author": "disposable4582"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Shut up with your hate.\n\nEdit. Seems like your profile is a throwaway made specifically for this post. Seems like the TA in question or a friend of his/her.",
                            "score": 4,
                            "author": "vajra_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Typical Zionist response. Sorry there’s no Iron Dome for criticism.",
                                    "score": 2,
                                    "author": "RecommendationFun786",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Well, I'm not a 'Zionist' - whatever the hell you mean by that - or even Jewish. But, you are clearly someone who needs help. Stay away from religious extremism. Go study.",
                                            "score": 3,
                                            "author": "vajra_",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Hitchens was right when he said religion poisons everything.",
                                                    "score": -3,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Expulsion",
            "score": 7,
            "author": "thank_u_stranger"
        },
        {
            "level": 0,
            "comment": "Okay, I'm gonna weigh in here. I worked very closely with the TA in question this past semester. I can tell you with almost absolute certainty that the TA did not, in fact, alter any students' grades. The tweet was obviously a joke, albeit an unprofessional one, and a very stupid one to put up on social media. I can tell you that we were very careful with use of rubrics, and that the TA's concern lay predominantly with academic integrity. In the replies to the poll wherein the majority answered \"Free Palestine! Fail them\" rather than \"Yes, [redacted], be a good TA] the TA also answered \"like I agree, but also, too many of y'all want me fired\". This shows the TA obviously recognized that acting on this would be a serious violation, and so logically would choose not to. The TA was likely making the joke as catharsis, did so in a self-destructive way that lacked forethought, and likely now regrets it deeply. I haven't spoken to the TA in a couple weeks, but this seems pretty obvious to me. So just, lay the fuck off.",
            "score": 1,
            "author": "pr0crasturbatin",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yea all the orgo TAs are just trash. Hasn’t changed since I graduated I guess",
                    "score": 2,
                    "author": "Monfabuleuxdestin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Neither of us were teaching an organic class. And at any rate, it's probably not your organic TA's fault you couldn't get an A for your med school application.",
                            "score": 0,
                            "author": "pr0crasturbatin",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Neither was* \nAnd thanks for proving you’re trash.",
                                    "score": 2,
                                    "author": "Monfabuleuxdestin",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yes because obscure grammatical minutia that you probably had to look up is an airtight case for poor quality of chemistry teaching. Are all ESL teachers who make frequent grammatical mistakes automatically bad educators? Or are you just arguing in bad faith to try to reinforce your own preconceived notions about an education that you feel was wasted (which I'm sure many of your teachers would agree with if your general manner on reddit translates to your attitudes irl) because you decided that getting into Johns Hopkins was validation enough of your own intelligence, rather than something that put a greater burden on you to put in the work to grow intellectually? And is that why you still come into the subreddit for the school you graduated from, presumably about 5 years ago, to trash others for their experiences?",
                                            "score": 0,
                                            "author": "pr0crasturbatin",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Nice soliloquy.",
                                                    "score": 2,
                                                    "author": "Monfabuleuxdestin"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -4,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Removed for rule 2",
                    "score": 1,
                    "author": "Sgt_Ice_Bucket"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": -8,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "First of all the other tweet clearly says “Israeli,” a country where most people are Jewish, please read the entire article before commenting. Secondly, even if it’s all jokes, Hopkins should not tolerate antisemetic jokes **especially** from staff, and I hope they uphold the same harshness that they would if it were a joke about another minority. This is an issue and it is insensitive to undermine the severity, if all claims are true the TA should be fired immediately.\n\nEDIT: the comment I responded to said something along the lines of “the tweet was clearly a joke and it was about zionists and ethic cleansers, not Jews... don’t get so worked up, you are pulling at straws”",
                    "score": 20,
                    "author": "goatfucker42069",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah the poll tweet was def a joke but the others were straight yikes",
                            "score": 3,
                            "author": "iwagl",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Even bigoted jokes should not be tolerated",
                                    "score": 1,
                                    "author": "goatfucker42069",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Neither should forced occupation and extrajudicial killings, but hey, the world is a tolerant place I guess.",
                                            "score": 0,
                                            "author": "iwagl",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I am not defending Israel, I am defending the Israeli people. Your comparison is disgusting. I sure as hell do not agree with all of China’s political decisions, but I am not going to take it out on my Chinese classmates, who had no choice in where they were born or their native governments actions.",
                                                    "score": 1,
                                                    "author": "goatfucker42069",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "You clearly have strong feelings about this so I'm not sure why I'm evening bothering with you, goatfucker, but here we go. It's a comparison to make a point. The world is not black and white; these things have context. The joke in question stated Zionists, not Israelis, and on its face is not anti-semetic. I already stated that the rest of the tweets are the bad ones. The joke is still bad for the optics it puts on the department and school.",
                                                            "score": 0,
                                                            "author": "iwagl",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Wow so you didn’t even read the whole article... if you did you would know that the jokes in question include: “didn’t get pinned with an **israeli** or some bitch white boy”... notice that she said ISRAELI and not Zionist. She is a bigot and she should be fired immediately. As a side not please do not let my name fool you, you are not aware of my accomplishments.\n\nEDIT: I see that you were referring to the poll tweet. One not-bad thing does not mean she should be excused for her bigoted comments.",
                                                                    "score": 1,
                                                                    "author": "goatfucker42069",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I see reading comprehension isn't one of your accomplishments.",
                                                                            "score": 1,
                                                                            "author": "iwagl",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Ya shucks I guess you’re right :( but it’s a good thing I can write well, cause that’s probably the reason that i am a published author with nearly 1000 book sales and featured author for the New York Times.",
                                                                                    "score": 1,
                                                                                    "author": "goatfucker42069",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}