{
    "id": "145et3u",
    "score": 17,
    "title": "I want to stay strong but I keep falling",
    "author": "Callmeold",
    "date": 1686339944.0,
    "url": "https://www.reddit.com/r/depression/comments/145et3u",
    "media_urls": [],
    "other_urls": [],
    "postText": "It sucks, it really does. \n\nI can feel one day \"fuck this I won't let this shitty fucking parasite pull me down\" and than other days \"oh shit, I really can't go on\". \n\nI want to believe that it gets better but it feels like it will never happen. I have tried for years upon years but I keep on falling back down. \n\nI want to stay strong but I keep on laying in my bed not wanting to eat or do anything but sleep and be alone for days. \n\nI know people care but I can't feel it. I don't know what I feel, I just know that I don't really like this feeling that I'm feeling. I have meds but what are they gonna do and even if I try I just get pushed down. It's always \"you haven't done this\" \"just get up and do something\" \"you haven't made any progress\" \" your therapist told you to train more but you just lay around\" \"you know, I was also depressed but I just got myself together and started to work out\". Wow thank you. It really helps.\n\nI want to continue but with all the stress that continues to build up even after I figure out something. It's a never ending suffering. ",
    "comments": [
        {
            "level": 0,
            "comment": "Hey man, (or girl) I know how you feel. When I was growing up a lot of my grandparents started going through severe health problems. I went from watching my grandpa who was skilled at pickle ball barely able to walk around the house without a walker, my step-grandpa who I've known my whole life going from being this vibrant guy who drove around a corvette stuck to walking with a cane and never be able to drive again thanks to brain cancer and the succesful surgery, I watched my grandma who was once a teacher, slowly lose her memory and mind as dementia set in, and my grandpa who was an exercise nut now struggles with maintaining his health while trying to stay physically healthy.\n\nMy whole life I went through watching those I love slowly deteriorate due to old age. And when I was sixteen, the floodgates broke. I broke down, I couldn't handle it anymore, that feeling of dread knowing that they would be gone someday and that I was afraid to lose them.\n\nSome days, I question even getting out of bed at all. Thinking if it's even worth it. But I know they wouldn't want me to get dragged down because of their problems, so I try to move on. But those days and feelings don't go away.\n\n&amp;#x200B;\n\nI don't know if this will help you or not, but I just wanted to tell you that you aren't alone.",
            "score": 1,
            "author": "Important_Ad_3",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's good to know that I'm not alone even though we have a bit different struggles, there  is still understanding \n\nThank you",
                    "score": 1,
                    "author": "Callmeold"
                }
            ]
        },
        {
            "level": 0,
            "comment": "When we work out or go for a run. There is a limit to how much we can push ourselves. The more you do it the further that limit is. But when your life is REALLY on the line you would be surprised how much further you can push beyond what you ever thought was possible. Don’t give up until every last drop is gone and then realize that even then there is more to give. Work hard to progress.",
            "score": 1,
            "author": "thetoadbandit"
        },
        {
            "level": 0,
            "comment": "It's sounds like you are having difficulties with the day to day life happenings. So you have a therapist as well as others whom you know cares for you - that's great that we can recognise them.\n\nI would suggest that if a task seems to much to handle perhaps you can break them do into smaller jobs and work from them. A quick schedule of what you want done and when could also a helpful.\n\nWish you all the best, take care of yourself.",
            "score": 1,
            "author": "MYF20C",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you very much",
                    "score": 1,
                    "author": "Callmeold"
                }
            ]
        }
    ]
}