{
    "id": "1473997",
    "score": 29,
    "title": "What is therapy supposed to do exactly?? (genuine question)",
    "author": "jotspot",
    "date": 1686512666.0,
    "url": "https://www.reddit.com/r/depression/comments/1473997",
    "media_urls": [],
    "other_urls": [],
    "postText": "I was in therapy before, but I want to compare experiences, cuz I don't think I've ever gotten a thing from any of it. I had different people, but most of the time we just talked and I was told frequently I'm too sick for real things, like trauma therapy. I did DBT and didn't understand it cuz of autism and they just assumed everyone understood their emotions but was not able to control them (most of the group had BPD but I'm just autistic and bipolar).... I never could name my emotions. To this day I just know emotions based on symptoms or \"strength\". They have to be extreme to be nameable. I am pretty much depressed every day of my life though. But what's the \"point\" of therapy? what's it for? I never understood it. I did CBT and got a trauma response from it, and DBT I failed too. I haven't done anything else, but every therapist I've had has told me I'm too sick after a while...I was never treated in hospital because I was refused entry. (I went post attempt and they sent me to apply for some autism program instead because I have trouble talking when I'm distressed, but like... 1) I am high functioning and that's for low functioning, and 2) I was there for mental illness instead...)... So I'm rambling, but basically I have no idea what therapy is supposed to do or be. I don't understand it...",
    "comments": [
        {
            "level": 0,
            "comment": "Personally, I think therapy is a basically just a place where you can pay someone to listen to you. It can be helpful to some people who just want someone to listen and pay attention to them. Supposedly, therapy is also a safe place that you can open up and speak your mind. In this world, you have to pretend to be happy all the time or you will be at disadvantage. It is fuck up world that discourages people from showing any sign of weakness, even around the people they trust.",
            "score": 22,
            "author": "LlVED",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s also a place for an impartial person to sense-check your distorted thinking",
                    "score": 12,
                    "author": "Buddystyle42"
                },
                {
                    "level": 1,
                    "comment": "I don't trust basically anyone tbh.... So I feel so ashamed when I can't keep my shit together I often end up hiding inside, which likely makes it worse....",
                    "score": 1,
                    "author": "jotspot"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Therapy is supposed to do a few different things. On the topmost level, a therapist is a type of doctor, and you, as a patient, will tell your doctor \"Doctor, it hurts when I ____\" \n\nAnd your doctor goes \"Okay, lets figure out ways to make it stop hurting so much so you can ____ again.\"\n\nThat's it. They're not going to make your past pain go away. They are not going to magically make you less depressed right away. They're not going to take your \"side\" about conflicts you're in, they're not going to coddle you and tell you you're special. Their goal is to make you able to function like a human. Maybe it will be mental tricks, maybe just a revelation on why you're unhappy/suffering can help with this, or maybe it will take months or years of exercises. Their goal is to get to know a little about you and set up a plan to start giving your brain the tools it needs to make changes to itself. The majority of this is work you will have to do yourself, and your therapist is just your coach in this work. It still comes back to YOU being responsible for your own condition.\n\nI've had a few and honestly, I did not get a *lot* from the experiences. Everyone is different and we can't underestimate how ignorant the majority of people really are about their own minds. Many people really need help figuring out why they feel the way they do, how to identify emotional triggers and how to assign (or un-assign) blame as necessary for our issues.\n\nFor me it felt kind of like returning to the recess playground of mental knowledge, it all seemed pretty repetitive to the things I've already read and educated myself about my own problems, but then... not everyone reads up on their problems and self-examines critically so it's not like there is any failure in the institution as a whole.\n\nHere are some things that you may get from a good therapist:\n\n* An outside perspective. Your problems are unique, and maybe you have no idea that some of the trauma you've experienced is not only unusual, maybe it's *highly* unusual and you need more specialized care. We live in bubbles and it's important that we have someone we can trust and be honest with so they can tell us how fucked we really are.\n\n* Just someone to talk to. It doesn't really matter if they can help, sometimes we just need to talk to someone who isn't a friend or family member or significant-other. Trauma dumping on the same people every day is bad for you and them. If nothing else at all, having someone who will listen and provide feedback and you don't have to worry about how it will effect them, that alone is worth the price of admission.\n\n* Some new tips and tricks. Everyone perceives the world differently, so some mental health tips you read online may work for 80% of people but maybe you're the unlucky 20% that need a different approach. A good therapist will suggest ways to manage your thoughts and feelings that maybe you haven't tried before.",
            "score": 7,
            "author": "tossawayforeasons",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; it's not like there is any failure in the institution as a whole.\n\nI do beg to differ on this, not from a therapy standpoint but from an overall medical care standpoint. I've waited a dozen years for psychiatry.... Even went to the ER while I was psychotic post-attempt and was refused. But therapy just felt like.... I dunno, like I was doing something wrong. I never could pinpoint it.\n\n&gt; maybe you have no idea that some of the trauma you've experienced is not only unusual, maybe it's highly unusual and you need more specialized care. \n\nMost people were abused as kids... I know I'm not special. But I was told I was not capable of doing trauma therapy (IE: too sick for it) by the only therapist I ever had for more than a few sessions....\n\n&gt;  A good therapist will suggest ways to manage your thoughts and feelings that maybe you haven't tried before.\n\nHmmm....But then doesn't that just mean that I am not even in the right place? I don't need thought management. I just need a justifiable reason to exist...\n\nI think everything you've said is good and helpful to understand. I don't really have anyone to talk to ever, on any basis. There is no friends, family or SO, just as it has been that way for more than half my life....but it seems super silly for me to pay someone to \"care\" about things....am I reading that wrong? I'm convinced there is 2 things wrong: 1) I don't have enough brain chemicals (I'm bipolar). and 2) I legitimately have reasons to be depressed. I don't think it's all just some failing of my own. I am not depressed all because of \"triggers\" or something. Sure that can hurt, but depression is caused for me by fundamental unresolvable problems. I've been depressed since I was maybe 5 years old, and all along people always said \"it get's better\" without an explanation as to \"how\" things get better, so it didn't. None of it is my fault, but knowing that doesn't just suddenly make survival worth it. Am I making sense? So if I got this right, you're basically saying there's no point in therapy for someone like me?",
                    "score": 1,
                    "author": "jotspot",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I understand exactly what you're saying because I ask the same question babe🤕 you're not alone at all in your thoughts hunny because I be wondering why else should we be here if we were dealt with such a bad hand in the first place we don't deserve to suffer",
                            "score": 2,
                            "author": "Healthy-Definition91",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That hurts me to read that, because my heart goes out to you... I never want anyone else to feel like I do... And when I read that, it.... makes me cry. I'm so sorry, internet friend.",
                                    "score": 2,
                                    "author": "jotspot",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It makes me sad too internet bud🥺 id hug you in real life if I could.. I don't want anyone else to feel the ways that I do",
                                            "score": 2,
                                            "author": "Healthy-Definition91"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "\n&gt; I don't need thought management. I just need a justifiable reason to exist...\n\nThis line should be your own signpost that you *do* need thought management. The entire point of learning how to manage and guide your own thoughts is so that you generally feel better over longer-term periods, and thus diminish those feelings of not having a reason to exist. A person with healthier thoughts doesn't feel this way most of the time.\n\nYes, you have a \"good\" reason to be depressed and you have some serious challenges in front of you that even someone without bipolar disorder would be challenged to undertake, which is the slow and gradual process of re-paving new pathways in your brain. Little measures of progress daily to get your brain to a happier, healthier place.\n\nKeeping in mind of course I am not a professional nor do I know exactly what bipolar disorder and your own unique situation entails, but you ARE the controller of your brain, you do have will and intent, even if your thoughts aren't going where you want them to be.\n\nAnd this is really the hardest part, at least in my experience, which is the innate resistance to making these changes because the way you think is your identity, your identity is something your brain desperately needs to maintain, and this is why many people with mental health problems, depression and other disorders seem \"stuck\" even with a lot of help and medications. Not all of them are just so severely broken that they can never be happy and healthy, it's that they cannot allow their identity to die and don't see the \"other side\" and rather feel \"authentic\" than try to do fake exercises to pretend to be happy, etc.\n\nNot saying this is what you're experiencing but it is a danger, a pitfall of the therapy journey, that many people go to therapy with specific expectations and if they are not met, then the problem must be incurable so why bother. But in my own experience, therapy is supposed to incrementally increase your quality of thinking - and thus your quality of daily life. Just a little, here and there. This will avoid that pullback that your brain will do to fight change, it will give you a slower avenue to improvements.\n\nIt doesn't get better. Not on its own at least, it actually tends to get worse. People say it will get better because over time most people learn survival tools for getting through the hardships of life that even healthy people suffer through. We all have to cope with things that are very, very hard. And most people figure out ways to stay happy even as their lives burn around them as lives tend to do from time to time.\n\nNow with a mental health disorder this process is much, much harder or maybe needs entirely different approaches for you to get to a better place in your thoughts and feelings.\n\nI think if I could pass on ANYTHING that would help anyone the most, it would be to remember that no matter what your condition, your past, your plans or ideals, your brain works the same way whoever you are: *you experience feelings and your brain assembles a story to explain and justify those feelings.*\n\nCombine that with the knowledge that the more you do or think a thing, the more your brain defaults to that thing more and more. \n\nThose two points together are some of the strongest ideas in all of psychology (IMO) and have been instrumental in helping me get out of a mode of abject, spiraling self-destruction to just a mellow, daily depression, and then gradual improvements since. This wasn't entirely therapy that helped me make this improvement, but it was very helpful to have people trained to listen and analyze my own efforts and reinforce the good things I was doing.\n\n&gt; So if I got this right, you're basically saying there's no point in therapy for someone like me?\n\nI don't think you or I will ever be \"cured\" in any meaningful way, but I don't think that everyone with very set-in and difficult mental health conditions are necessarily incapable of improving their daily life. I do think that we have a very challenging opponent to beat though, which is our own brain and its selfish desire to never change, and the stories it makes up to convince you it's right.\n\nTherapy not working? try something different. Get a different therapist. Take a whole new approach. That's what I would do, and I wouldn't stop trying to find little ways to enjoy existing more, because we don't get a do-over, we have no idea if there's anything at all other than this experience, and I think we need to figure out whatever we can to make it as meaningful as we can and find ways to feel the feelings that we really want.",
                            "score": 2,
                            "author": "tossawayforeasons"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "A place where the objective is stop you from killing yourself./j\nTo be fair it's no entirely a joke. I had 4 years of treatment and this was the conclusion i had.",
            "score": 4,
            "author": "CoeSato",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah... noone ever cared about any of that tbh... You semi-joke, but their objectives always differed from mine and noone cares if I survive....except maybe 1 single friend who lives far away. The therapists sure couldn't care less. I'm pretty convinced I am going to be a number one day. Maybe not today, but one day.",
                    "score": 1,
                    "author": "jotspot"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm in DBT to and I don't get it cause I have a brain  injury and clinical depression and ptsd and ya I heard it's mostly for bpd . Suppose to help you learn to regulate your emotions more I guess",
            "score": 3,
            "author": "CorgiMom2023",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah that's the problem though... I basically told them  I'm neurodivergent and couldn't understand things and all they did was say other neurodivgent people had no trouble so it's basically my fault for being insufficiently medicated.... (despite me crying for meds for years)",
                    "score": 2,
                    "author": "jotspot",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That is messed up! Have you thought about finding an Autism support group instead? Easier to be around people who are like you",
                            "score": 3,
                            "author": "CorgiMom2023",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No... I considered it, back when I was diagnosed but I never did it. There's a few reasons:\n\n1. I think the majority of my problems are mental illness related rather than autism related (even if autism makes us more susceptible). I kind of have always felt like, when I'm better that might be a more effective time to go to something like that.\n2. I've worried I wouldn't fit in properly there either. I have a tendancy to be rather annoying to people accidentally. Maybe it's an autism thing and we all just end up doing that to each other.\n3. I was ... kind of embarrassed.\n4. I do talk and contribute on the autism subreddit which is close I think?\n5. the biggest one of all: almost every single autism \"support group\" is designed for \"caregivers\" (whom I am not, nor do I have one whether I need that or not) to complain all \"woe is me\" about their kids. Those support groups are literally about \"poor parents\" who are \"heros\" for enduring children with special needs. It's fucking disgusting. I hate those people. I wouldn't be surprised if they abuse their kids too, just like my ex-parents did. Noone actually cares about us...Especially adults who never \"overcame\" (aka, did mental damage to themselves attempting to conform and mask rather than have their needs met) the societal expectations we aren't able to do...\n\n&amp;#x200B;\n\nAnyway, I guess the main things are I never felt comfortable, the ones I did find weren't for people who were struggling, and the main problems I suffer are depression and other mental health problems. Autism feels like something I could actually deal with if I wasn't so sick, and I would add, I can only say that because once I was diagnosed I finally gave myself the room and acceptance to allow myself to address those needs, even if noone else would let me. I wear noise cancelling earmuffs now, so the rare \\*rare\\* time I can scavenge and sell enough of my junk to afford to go to the movies, I actually can go and the sound isn't hurting me anymore. That's just 1 example but you get the idea. Hope it all made sense...",
                                    "score": 2,
                                    "author": "jotspot"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "A good therapist should help you construct and demystify why you feel the way you do. They’ll discuss your upbringing and the way you process and react to stuff now. Being selfaware of your innate negative though tendencies is a superpower.",
            "score": 3,
            "author": "Dude4001",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's interesting. I remember my one therapist didn't want me to get into any of that, because you are only allowed like 6 sessions or something...and they told me I was too sick for trauma therapy so we didn't talk about my past.... I wouldn't say I'm selfaware of anything, other than I have an \"insufficiency complex\" due to a part of my childhood abuse....",
                    "score": 1,
                    "author": "jotspot"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It can be a place to manage goals. You may want to improve your life in some way. The therapist would help you keep healthy behavior around these goals. The goals are solution to health problems you experience, so you get to decide what is better.",
            "score": 2,
            "author": "UnjustDuality",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hmmm.... but what if you don't have any goals other than \"feeling better\" and being able to work again? That's literally it for me. I've been at the \"write off point\" for years....I just want to feel like any individual day is worth it. That's my only goal, but I was told that's not an actual goal and was fired basically by my last therapist because I wasn't doing anything....",
                    "score": 2,
                    "author": "jotspot",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Then what does being better mean to you. I mean you can get a job but what do you feel prevents you. I think apologies for using corporate things here but maybe it’d be help to do [SMART](https://asana.com/resources/smart-goals) goals. These goals are more actionable. It doesn’t need to be time bound but it does need to specific. It’ll be more helpful to therapist than an amorphous better that they can’t decide for you.",
                            "score": 4,
                            "author": "UnjustDuality",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; Then what does being better mean to you. I mean you can get a job but what do you feel prevents you.\n\nI have 2 things:\n\n1) I am so depressed that I can't even function half the time. And when I say that, I mean like how can someone work if they can barely feed themselves and is ready to go? I am like that half the time.\n\n2) OCD. holy shit OCD. When you combine depression and OCD into one, it's terrible because OCD requires willpower to overcome and depression robs you of it. The combination is a perfect storm.\n\nBasically my biggest problem is my days are too inconsistent to work, and it's really hard to get hired when you are so depressed that you actually *look* miserable. Who wants to hire and keep the employee that stops midshift to break down and cry for a few mins?\n\nThere's also the fact that even the government wrote me off as permanently disabled and I am banned from ever applying to college or anything ever again. (I had my first bipolar episode in college over a decade ago) The money for that (student loans) cannot be approved either, even with never defaulting cuz they wrote them off as permanently disabled. So I can't even better myself. Plus I'm poor as fuck so I can't save because I practically starve just from paying for medications. So I settled on just working something. But it has to essentially be a perfect fit and somewhere that wouldn't mind me not being at work half the time. (I mean, I used to be very punctual and I missed less than half a dozen days in multiple years combined in most of my jobs).... So I don't have a lot of faith in my ability to ever be a functioning useful human.\n\nYes, it's my depression talking, but there's definitely reasons for it:\n\n1) I know I'll be alone till I die so it all feels worthless and pointless to me. This applies to ex-family, friends, and partners.\n\n2) There never ever was anything I wanted to be in my entire life, and I don't have confidence in anything anymore. I used to be smart but my ability to remember things is gone. So it wouldn't matter if I did go for education, nothing would stay in my brain anyway. My cognitive functions died on the little medication I have.\n\n3) there is no actual goals to have really. I know I'll be just as miserable in any job out there, because the only reason to work is to not starve and starvation isn't even a motivation anymore.\n\n4) there's nothing I even want anymore.\n\n5) with all my court cases going on (I'm fighting the government over transcare) I have to dedicate what little I have to that.\n\n6) even if I managed to get that far, I still wouldn't be happy and it would all be for noone or nothing.\n\n7) I feel too far from things that goals actually feel impossible, as I need to feel better before anything is even functionally actionable.\n\nAm I at least making sense? I do however like your idea of a smart goal, but noone ever tried that thing with me. I was always just demanded to provide them my goals and when I couldn't be specific that was the end of it. My last one fired me specifically because I couldn't name a specific goal for her, not exaggerating.",
                                    "score": 1,
                                    "author": "jotspot"
                                },
                                {
                                    "level": 3,
                                    "comment": "I used smart goals in underwriting as well as the horrible corporate ladder of responsibility and when I used them intentionally on myself in my journal alongside therapy I’m ashamed to say what I thought was corporate nonsense was actually really helpful.",
                                    "score": 1,
                                    "author": "jlsearle89"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I had CBT any ACT and they were mostly towards recognizing emotions and the flow on consequences and then acting to mitigate those, it helped me a lot but I've not got autism so that may be a key factor here",
            "score": 2,
            "author": "Doug_Step",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah what I experience is called alexithymia, and apparently like 90% of autistics have it, but 10% of allistics have it too. The problem is I usually have to focus intently on physical signs to determine emotions. Heart rate is up and I'm shaking I know I have anxiety for example. I wouldn't know till there was a physical sensation though. So it's kind of hard to do the thing they want, which is like \"intercepting\" emotions that are just starting. For me until it's serious enough to have physical feedback, I won't know what is going on. In my teens it was so bad that I couldn't tell the difference between anxiety and depression even. Now later on I know depression because it's the \"more potent\" emotion and I tend to be crying day in day out....So basically, if I legit can't tell most of the time, is there any point of trying those types of therapies? Cuz the therapies I did, they never bothered to help me figure them out. They just expected everyone to be able to name them and then sort them out. (DBT was a group thing)",
                    "score": 2,
                    "author": "jotspot",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well ACT was a lot about figuring out what you're thinking about, how that could effect you and what you can do to mitigate change or combat that.  \nSo if you have a clear thought chain that leads to anxiety or depression it could probably help",
                            "score": 2,
                            "author": "Doug_Step",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I see. Makes sense. I don't really think that's my problem though. Obviously all people have some sort of trigger, but for me, most of my anxiety and depression is like \"ever existing\" without any purpose. The one and only depression related thing that is thematic I would say is like my unresolved dysphoria basically, but otherwise most of my depression seems to be like unrelated to thoughts and environment. Sometimes I just wake up crying without knowing why. Could also be that I'm so unaware of my emotions too that I am kinda \"surprised\" by them too maybe.",
                                    "score": 2,
                                    "author": "jotspot",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "My assumption would be that for therapy to work for you in particular you may need to first learn to feel/find/recognize your emotions before it has a crisis tier impact.   \nIf rather than feeling like you've been ambushed by your feelings every time you can start to recognize them as they're building you may have much more success.  \nOf course in saying this I'm not autistic even if I can relate to feeling ambushed by emotions. I'd imagine it will be much much more difficult for you and I could be completely wrong about everything",
                                            "score": 2,
                                            "author": "Doug_Step",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It's not just autistic people, but it's also not really something I think is possible for me to overcome. it took over nearly 30 years just to realize the difference between depression and anxiety.... it may take the rest of my life to recognize emotions early. To me there is just distress and I have no idea *why* I'm distressed. I even sometimes stop and try and think about it and I don't know what's wrong so I don't know how to avoid it getting worse.... :(",
                                                    "score": 2,
                                                    "author": "jotspot"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’ve done CBT, ABT, DBT and am now working with a trauma therapist she gives me tools to make life easier, a weekly sounding board to gush every thought on my head to without fear of judgement or upsetting people which means I don’t bottle them up and I can examine them. We also go into historical issues currently using EDMR techniques to heal things that happened in the past but I have also done inner child work with the same therapist. I have a double appointment, two therapist hrs I.e 1hr 30 because I’ve got a lot of work to do on myself to make someone with treatment resistant depressions life livable. But you find the right therapist (the pick a letter programmes didn’t work for me as well as general therapy where we can explore what comes up does for me) therapy can be whatever you need it to be, that can change depending on what your goals are.",
            "score": 2,
            "author": "jlsearle89",
            "replies": [
                {
                    "level": 1,
                    "comment": "I appreciate your detailed response. I'm just struggling with the last sentence: I consistently don't have goals. It's almost like depression has so thoroughly swallowed me, that I don't believe I can have a goal to do. I never really had any goal other than just to feel better enough so I can go back to being a work slave for richer society. That's about it... So I really truly struggle on that front and therapists usually get rid of me because of it.... (most are just convinced I'm too sick)",
                    "score": 1,
                    "author": "jotspot",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Even that’s something the therapist can help with. I thought I wanted to be an underwriter, got there and realised how miserable I was. I like you felt like I had no goal because I’d did the things I’d intended (degree, professional qualifications, experience, networking whatever) and I was still miserable even after all the if I achieve x, if I get y, if my relationship was z. I had everything and felt nothing. They talked to me about what aspects I enjoyed of what I was doing, work wise beyond my autonomy there wasn’t much. I needed more of it, less corporate nonsense and more time to do things that used to make me happy like when I was a student I volunteered at the soup kitchen, the soup kitchen lost its funding in the 7yrs since I did it so I volunteered at the food bank instead and take great joy in telling people who say I’m a good person that actually I do it for completely selfish reasons and seeing how puzzled they are because it’s a kind of honesty most people don’t expect but secretly suspect of do gooders. We talked about things I enjoyed in childhood which lead to me taking up creative journaling (like normal journaling but with more cutting and sticking) and that lead to art-I will never sell a thing but it gives me the ultimate calm. I also retrained to be a chattered accountant and work self employed so on the bad days I set my own workload and only appease myself. \n\nIt’s helped me out so much but it’s taken most of my 34yrs to find the right therapist and therapy type, I’m still medicated, but the awful days are fewer. Don’t give up. The downside is the kind of therapy I get is the most expensive, but people I know have done the same thing with a journal and a few over therapized friends like me on board. You can make your life better im happy to provide any help I can because I know how it feels to be were you are. \n\nP.S employment isn’t the only way you can add value to society, my sister found herself too depressed to work, honestly I think she is just as capable but it’s easier to find jobs where you can fly under the radar when you don’t have to interact with the general public, she adds to her community in other ways, there’s no one route to happy.",
                            "score": 2,
                            "author": "jlsearle89",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; Even that’s something the therapist can help with.\n\nbut... they won't though. I could've used that help 15 years ago in high school, and again many times since....you're supposed to \"just know\" stuff, and I never just know....\n\n&gt; I’d did the things I’d intended (degree, professional qualifications, experience, networking whatever) \n\nI think we are very different people though... I never wanted nor did any of these things...\n\n&gt;  I volunteered at the food bank instead and take great joy in telling people who say I’m a good person that actually I do it for completely selfish reasons and seeing how puzzled they are because it’s a kind of honesty most people don’t expect but secretly suspect of do gooders.\n\nThat's weird and good! You should be really proud of yourself though. Something like that is outside my abilities though...last year I tried to get volunteering at places, including the library but they refused me. Eventually I volunteered at the museum, but I was so alone... So I didn't like being in \"the dungeon\" all by myself. I planned to go back this year, but... I can't get past the depression+OCD combo. It's just too much for me.\n\n&gt; I also retrained to be a chattered accountant and work self employed so on the bad days I set my own workload and only appease myself.\n\nThe irony is, I went to college for accounting and went depressed then manic and dropped out. I didn't like the course though, and never went back.\n\n&gt; I’m still medicated\n\nI'm basically not, or not completely. I was never outside of danger range or whatever. They wouldn't even treat me in the ER in a crisis....\n\n&gt; The downside is the kind of therapy I get is the most expensive\n\nBut...how do you afford it!?!?! I am literally on disability from my mental illnesses... I don't have money for food. Especially when you were volunteering before you started accounting, how did you pay for it???\n\n&gt; P.S employment isn’t the only way you can add value to society, my sister found herself too depressed to work, honestly I think she is just as capable but it’s easier to find jobs where you can fly under the radar when you don’t have to interact with the general public, she adds to her community in other ways, there’s no one route to happy.\n\nI haven't found that though... I am so very lonely, and most places won't let me even volunteer (yeah, can you believe it?). I was refused at the library last year and noone is answering me to become a volunteer for pride this year (which is in a few weeks where I live). I have such a hard time, because what job or volunteering even exists that allows you to not physically interact with anything, and yet... somehow heals all the loneliness? I can't do call center stuff anymore (it made me mentally unwell before I ever was unwell), so work from home isn't an option either... I don't think there's any reasonable way for me to contribute. And then there's the other half of things, I can't be happy without the financial ability to afford the basics. So even volunteering, how does one manage that? I straight up don't have the financial means to survive without working (this year I just didn't pay my gas from January to May because I couldn't, so... it's that bad... and before you think I had priorities wrong, consider for half of the year I had no internet at home either).",
                                    "score": 1,
                                    "author": "jotspot",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Like I said it’s ok to be different, these are the things you will have different answers too. \n\nI started volunteering again when I started retraining whilst still working as an underwriter.  As an accountant I’m self employed, so can pick and choose clients many of who carried over from connections I’d made whilst underwriting between maintaining the two professional qualifications I’m lucky with the kind of work I’m doing means once a client is set up it’s a lot of oversight because as long as the system is used properly it works out as only a couple of hours a day on average, I could do more and earn more but 9-5 makes me miserable, which is why accounting despite being incredibly dull compared to my original degree in politics and international relations was the one I chose because it had easy cross over. whilst I was working as an underwriter I was informed enough to take out a good insurance policy with a lifetime employee discount which I only have to pay a top up on for my therapy despite it not being too expensive a policy-worth noting though UK medical insurance is much cheaper has much lower excesses than the uk. \nBut even in the US where I imagine you are there are likely additional services available for those on disability free or discounted. \n\nThe NHS don’t have enough therapy places for patients that need them the plus side of this travesty is when they tell you they can’t get you the help you need in a timely manner unless you can pay for it they hand out antidepressants like sweets at Halloween in the US. Even if you’re about to end it. We have crisis teams but they aren’t great unless you fit very precise criteria which few people do. 15 yrs ago when I started this journey they were also happy to perscribe me daily fluoxetine and diazepam on an as and when needed basis for GAD which I also have but I’m aware that has been maintained because I’m a historic patient. I wouldn’t get the diazepam now only the antidepressants. \n\nMy duties at the food bank involve smiles, hugs and taking people around so they can pick out x amount of items, chat and see what other services they need, maybe give them some leaflets. I only do this one afternoon a week mainly to keep me in contact with society because hermiting feels nice but is bad for my depression. Some days I go in apathetic but because we’re all volunteers we support each other and will swap if someone can’t handle front of house and would rather process forms or stack shelves. There are non people people who volunteer in these kind of roles specifically. I’m only a few years ahead of you, I started working for myself in Jan 2020-not my best timing. \n\nI’ve had to design life to live up to my expectations not those of other people and most of the getting here was torturous can you imagine the discipline it takes to turn up to a job, go home and study and volunteer on weekends whilst depressed because you know it’s the only way to build what you want-if I wasn’t at the point of ending it before there were several stops where it became more of an option, but I have come out the other side. I had the advantage that I wasn’t lonely, but if you can get yourself medicated even if you have to skim over a few things with the gp- I assume you’re not in the UK then once you find the right combo of medication you’ll be amazed what you can do-I came off during the pandemic and was a bit ashamed when I went back on but understanding I need those pills like a diabetic needs insulin because they literally make me function helps. \n\nWhen you were rejected for those volunteer positions what feedback did they give you? I’d also suggest places like food banks without paid employees might be more willing to take you on than places like museums who essentially need/want people with private means to do everything a fte would for free. \nDo you also have physical disabilities? Working out what your hurdles are might help you work out where you can start and I’m willing to help with that if you want that advice but I’m not qualified in any way apart from personal experience and not from the same system. \n\nThe only thing I can see that I had over your current situation was a supportive partner and family but at my worst despite them being the reason I was still here I doing my best to drive them away without knowing it. They wanted to help once I was willing to help myself and that help took many forms.",
                                            "score": 2,
                                            "author": "jlsearle89",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt;good insurance policy with a lifetime employee discount which I only have to pay a top up on for my therapy despite it not being too expensive a policy-worth noting though UK medical insurance is much cheaper has much lower excesses than the uk. But even in the US where I imagine you are there are likely additional services available for those on disability free or discounted.\n\nI had a basic insurance but it went up by like 30% the year I ended up on disability and couldn't afford it. It didn't cover prescriptions or dental, so it became redundant.... I am in Canada. Any pre-existing conditions get excluded from all insurance policies. And since the policies guarantee profit even if you claimed 100% of the limits (with a select few exceptions), it makes it highly irrelevant. It's literally cheaper to not have insurance than to have it. Nowadays I think it would be like $1600-$2000/year (admitedly cheaper than most US plans) but only give about $600 dental and $0 for prescriptions (since all my conditions are ongoing... once you are diagnosed bipolar, mental health meds will not be covered basically)...\n\nAs for additional benefits, only some people can get them. I am lucky my federal disability pension (basically I'm \"retired\" because of mental illness, I had to pay in to get this though) is low enough to still qualify frm the provincial disability program (essentially \"disability welfare\")... but my pension will soon eclipse the provincial one, in about 2 years. At which point I won't have partial medication/dental coverage anymore. Right now, I had to go without 1 of my medications because it's not covered....against doctors orders I cut a different dose in half... of a slow release cap, that they did happen to cover....but I legit couldn't afford the $160/mo it was gonna cost me. I already pay for estradiol out of pocket ($65/mo, they won't cover, but they cover testosterone injections so I'm intending to raise a gender discrimination case when I'm through my other cases)... they would cover glasses but they required a reassessment but wouldn't pay for the assessment, so it was basically a loophole, people too poor for the assessment can't even get glasses. It's really really shit coverage, but it's all I got, and it's better than nothing, because in 2 years I won't have that either unless they raise the limits (the way it works here, is they deduct dollar for dollar any other \"earnings\" such as my pension, so if your pension is $1 over, you lose all benefits, which is like $300/mo worth to me of the things they DO cover). There is zero absolutely *zero* coverage for therapy at any level. Psychiatry is already paid for by the province separately, but there are no psychiatrists and they won't even *let* you pay for one, because if you \"needed it\" you are supposed to just get one, but like 5-10% of the population just never has access (it's not just me). The catch 22 of the system designed to be inclusive is when it fails then there's just no service at all...\n\nThere are zero, absolutely ZERO discounts for people with disabilities for the private insurances. In fact, admitting you have a disability *automatically* raises your rate along with your chances of refusal. And it's entirely legal to do so, even if your coverage is for things entirely unrelated to your condition.",
                                                    "score": 1,
                                                    "author": "jotspot",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Court cases don’t come cheap, whilst that’s a noble, necessary and life saving cause. Could you not divert those funds to your medical care in the short term given how much easier it will be to fight when you’re in a better mental state?",
                                                            "score": 1,
                                                            "author": "jlsearle89",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Not really.... once the money is gone, it's gone for good. I will never be able to regain those savings. I am aware of the costs, hence why I self-represented in the first case for the first part. It caused too much mental stress though, so I decided not to do the rest myself. The thing is, a lot of people appear to have some means to save, but I've never in my life had that, even when I was working. Money just ended up being dumped into my house when it was available, but I only really had any disposable income for a year and a half of my life, wherein it only existed because I had no car. There is no way even if I magically was healthy that I'll ever be able to outrun the system... I learned in my teens that just because you need something, doesn't mean you get it. So I just go without a lot of stuff, whether it's medical care or heat or internet half the time.... Also, I think you are missing the fact that most of the court cases are just simply debt. If I lose the collections cannot touch my income to collect, but if I win everything, then it get's repaid through that. And lastly, I have never had a good mental state, so if I have suffered for 15+ years, genuinely what makes you think I'll ever be well enough? (i don't mean that in a mean or sarcastic way, it's just a genuine question)",
                                                                    "score": 1,
                                                                    "author": "jotspot",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "If you don’t hold hope of/a reason too get better, honestly and I don’t say this cruelly perhaps you never will. I can tell you I know 50 yr olds who’ve turned their lives around when they’ve least expected it who say it was like a switch went off and they could torture themselves forever or they can choose to live and make the most of it. It might not be today or tomorrow but I honestly hope you get their one day. In the words of an excellent musician “you can’t always get what you want, but if you try sometimes, you might find, you get what you ne-ee-ed. I don’t say that flippantly but because you seem to have decided, possibly based on lived experience, you don’t get to be happier. I don’t think anyone living with depression can expect rainbows, lolly pops and sunshine everyday, but I do believe you can chose to make things better for yourself even when it feels like the odds are against you.",
                                                                            "score": 2,
                                                                            "author": "jlsearle89",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "&gt; I don’t say that flippantly but because you seem to have decided, possibly based on lived experience, you don’t get to be happier\n\nI wasn't saying that, I was saying that you don't get to have your needs met. There's quite a difference. In this world noone is entitled to survival, and I believe society's entire purpose is to end as many people as fast as possible.\n\n&gt; I do believe you can chose to make things better for yourself even when it feels like the odds are against you.\n\nAs pessimistic as you likely see my outlook, I will say this: if my issues were to be addressed, and I mean *properly* addressed, I believe with absolute certainty that I could have a tolerable life. Maybe not a good life, but a tolerable one. It took me a very long time to get to that realization. The problem is, my needs aren't met, and I am incapable of resolving those dilemmas on my own.... I would compare it to the mazlo's hierarchy thing. I have not solved the bottom of the pillar (both literally and figuratively), but a lot of people (and it appears you as well) believe I should somehow be able to imagine a world where I am half way up it (I'm not going to say at the top because I don't think anyone ever get's there, except the ghandi types)...",
                                                                                    "score": 1,
                                                                                    "author": "jotspot",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; We have crisis teams but they aren’t great unless you fit very precise criteria which few people do.\n\nSame here.... However it's a problem particular bad in my region. The bigger ones elsewhere are definitely better (I know because there is some overlap between teams in my city and the neighbouring city, and when you talk to theirs, they're all for helping until it comes to services you require locally and then they refer me back to the useless idiots who refuse at all to help).\n\n&gt; at the food bank involve smiles, hugs and taking people around so they can pick out x amount of items\n\nyeah...all of which I could never do... I feel so useless, and envious tbh....\n\n&gt;  I assume you’re not in the UK then once you find the right combo of medication you’ll be amazed what you can do\n\nI've been waiting for treatment for 12 years... it'll never end at this rate. that's why I feel so hopeless... And no, I'm in Canada.\n\n&gt; but understanding I need those pills like a diabetic needs insulin because they literally make me function helps.\n\nI understand your feelings on this exactly. I was recently offered Vyvanse for my inability to concentrate and organize and stuff, and it helped and all I could think of was how embarrassed I was that it actually *helps* me, cuz I feel like a child that I needed that... But I did. I only started it 2 weeks ago, and it's been kind of the best mental health med I ever took, but like, the depression doesn't end with it either (although it supposedly can do that). FYI it only takes 1 week to see a result with stimulant meds, it's not like real antidepressants.\n\n&gt; When you were rejected for those volunteer positions what feedback did they give you?\n\nSome just ignored me, but the library I was pretty persistent with and they told me they weren't allowed to because they were unionized. They said there was some legal conflict that obligated them to pay me if I did the same work as anyone in the building even if it was off the books, and that if they had the bookstore section open again I could volunteer there, but since it was closed and likely will never reopen again, I was told to not hold my breath. or did you mean something else entirely?\n\n&gt; I’d also suggest places like food banks\n\nI can't do that, my OCD won't permit me, and I can't manage anything related to food (it's complicated). I can do like data entry things perhaps, but I'm in no shape for that right now either... I have only been getting worse, which is ironic cuz a year ago I was crazy as fuck but had a lot more \"neutral days\" mixed in with the depressed days. Now I rarely hear any voices or other auditory/visual hallucinations (except when I'm very stressed), but I just happen to be depressed nearly every single day ever instead. I'd rather be crazy again, cuz at least I wasn't crying relentlessly....\n\n&gt; museums who essentially need/want people with private means to do everything a fte would for free.\n\nthat's what I did last year. I was converting/digitizing archives for my local museum. I applied to a lot of places till I got in there... it was the lonely \"dungeon\" I intended to resume this year, but my depression got even worse to the point it is no longer possible to maintain my health, house, or even basics of life, so I have no mental resources left to manage to overcome the OCD problems...and it wasn't very fulfilling being alone in the basement like that.\n\n&gt; Do you also have physical disabilities? \n\nOnly I can't lift heavy things cuz of a tear in my chest, and a bone in my right foot broke at some point without medical care a few weeks ago, so I can't walk consistently since then. I am pretty capable, I'm just weak. My real disabilities are mental health related and Autism related. I can't handle loud noise busy places or weird sensory textural issues (often related to keyboards/mouses, but most places use the good old school ones that don't click wrong which works for me), which is why the library felt like a good fit. I would say OCD is the biggest barrier, even bigger than the bipolar, but like... the bipolar steals my ability to cope with the OCD.\n\n&gt; I’m willing to help with that if you want that advice but I’m not qualified in any way apart from personal experience and not from the same system.\n\nit's okay, I appreciate the time you've already invested, don't worry...\n\n&gt; They wanted to help once I was willing to help myself and that help took many forms.\n\nOIC.... yeah, not like my ex-family. I was told all kinds of awful things. My grandmother tried to get me to finish things off because I'm trans.... yes, my own grandmother. Most of my ex-family has no mercy for mental health and told me they don't want to know me when I'm depressed, because they don't have time for that shit and that I'm supposed to just suck it up, blah blah, and that they have their own problems so mine are irrelevant.... That's part of why they are ex-family now... Frankly one person subtly implied they hope I die so they can inherit my stuff...",
                                                    "score": 1,
                                                    "author": "jotspot"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}