{
    "id": "147cipn",
    "score": 3,
    "title": "Maybe",
    "author": "Keisalius",
    "date": 1686536673.0,
    "url": "https://www.reddit.com/r/depression/comments/147cipn",
    "media_urls": [],
    "other_urls": [],
    "postText": "I find it funny how nothing really changed. I wake up, only to be met by my depression. What even is the reason why i'm alive at this point? My goal? Relationships? Memories? Hope? I don't anymore. One thing's for sure though, it's getting tiring. Life is nothing but disappointments. I can't even be hopeful any more lol. \n\nWhen i was a kid, i did nothing but do things that i found fun, exciting, thrilling. I was adventurous, i was filled with ambitions, and motivation for my desired future. When i turned to twelve, i stopped going to school, since it has become financially impossible for me and my siblings to continue going to school. Around 2017 my mom along woth my sisters went to Philippines. Me, my father, and my brothers were left here in Saudi Arabia. I was lonely. But at the same time i was filled with hatred. Which made me distant towards the people that used to be my friends. Despite their attempts to try and talk to me, i rejected them. I avoided them. Found a game, drowned myself to it. Felt alive. Felt like i had purpose. All of a sudden, living wasn't too bad anymore. Tried talking to my friends back then after a long time of reflection. It was too late. Got ghosted, archived, seen, etc. It made me sad, but i understand why they did it. Started talking to myself more. Realized i only had myself whenever i needed to talk about something. Talked about the past. So much so, that i barely remember anything anymore, other than some memories several years ago. Became more and more lonelier as days passed, so i tried talking to girls that i found attractive on the internet. Didn't go well, of course. One day i realized just how much of a loser i have become. Slowly became socially inept. Barely talked to people. Feels like i've forgotten how to talk to girls now. But oh well, still felt hopeful. Wanted to do a lot of things. Wanted to become a lot of things. Started getting into philosophy more. I was intrigued. Gave me existential crisis when i discovered just how pointless life truly is. Slowly grew an interest as to how pointless my existence is. Learned about other philosophies, such as Stoicism, Cynicism, Existentialism, and Nihilism. Helped me shape who i am now. I felt myself slowly growing as a person. Slowly becoming a better me. Fast forward to the present, i feel like i never truly changed. The only thing that is changing now is the ever-growing depression that i have. Constantly thinking about suicide. \n\nI wasn't really a good person when i was a kid. I was a bully, i always got into a fight, a pervert, had bad grades, threatened people, and so on. When i stopped going to school, and all that things happened, life humbled me. Made me realize just how powerless i truly am. Just how limited my control is on where life will take me. I am now 19, never had a girlfriend, becoming more and more depressed and suicidal, have shitty self-esteem and my confidence is down on the ground. I am much more incompetent compared to others the same age as me, despite trying not to be. \n\nIf i could go back in time, i would. Even if i become the person that i was back then, at least i was happy, right? If this is the cost of becoming a better person, then i don't want it. Hell, i don't even know if i'm relatively good, but i am a much better person compared to my past self, i guess. \n\nTalking to others, especially my siblings used to help, but not anymore. I am aware that i am the only one who can fix myself, but i don't know if i even have the energy to do so. \n\nI was 12 when all of this started, now i'm 19. When i was a kid, i thought about all the things that i could do once i become a teen, and now that i am at the last year of my teenage years, i realized just how much i missed. So many possible memories that i could've made if only my life didn't take a huge turn. Seeing my friends back then achieving so many stuff, i can't help but feel envious. There they are, achieving great things in life, and here i am, still feeling like time didn't really pass. And still feel like i'm still that 12 year old me. It's weird whenever i think about how i'm turning 20 next year. Nearly two decades. I feel like a huge chunk of my life has been wasted. I want to think that things would be better. I like thinking about a life where waking up wouldn't be too bad anymore. But i don't even know if such a time would come. Might die later, tomorrow, in a month or a year. The thought scares me, but it makes me feel a sense of peace just thinking about how i wouldn't feel this way anymore. But hey, things could be worse, right? Maybe there is still some hope in me. Maybe =)",
    "comments": []
}