{
    "id": "147fh5y",
    "score": 6,
    "title": "Is affection and love hard and confusing?",
    "author": "ParticularVoice7330",
    "date": 1686546263.0,
    "url": "https://www.reddit.com/r/depression/comments/147fh5y",
    "media_urls": [],
    "other_urls": [],
    "postText": "My husband of a lot of years (really an amazing relationship) had been going through depression for a little while now. About a year and a half. He’s has good days and a lot of bad days, he’s high functioning, and puts most of his efforts towards his job. Which has him stressed and burnt out on top of everything, When this all started he did tell me to get out of the marriage because he can’t love me the way I deserve. \n\nI didn’t want out because of his depression, I’m his wife, and I want to be here because I do love him. I know things will get easier for him one day. And I’m not going to leave the man I love while he’s at his lowest. He’s an amazing man (minus the depression, but I still love him with depression) \n\nHe doesn’t like affection too much anymore, or kisses, but I do, it makes me feel good. \nIs this how it will always be? Do people ever want affection again, while going through this?",
    "comments": [
        {
            "level": 0,
            "comment": "While obviously I can't speak for everyone, I'd say 85 - 90% of my interest in affection is gone. TBH when it's really bad, it's difficult to even feel love for anybody or anything, because it's difficult to feel *anything* to begin with; other than numbness or anger.  That's the worst part, imo.  The numbness, which is only relieved by an even more negative state, anger.  It's never the other way.  \n\nBeing a spouse or partner to someone suffering with depression is incredibly difficult, and I hate that it's happening to you.  Hopefully your hubby will be able to beat his depression somehow and find his way back to you.  You sound like one of the truly great ones out there for sticking it out!",
            "score": 6,
            "author": "Matuatay",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for saying that! ♥️ I hope he sees me that way when he has a clear mind. What you say about numbness is what he describes he experiences with negativity and anger too",
                    "score": 4,
                    "author": "ParticularVoice7330",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;I hope he sees me that way when he has a clear mind.\n\nI expect he does, and that's probably why he told you to run.  Clearly he appreciates you &amp; wants you to be happy.  I say the same thing to my partner when I'm at my darkest, and in the moment I absolutely mean it because I know it must be miserable living with a miserable shell of a human being.  But when I have the rare \"levelling out\" moments, I'm so glad he hasn't given up on me and is still here.",
                            "score": 2,
                            "author": "Matuatay"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I suffer from depression but also high functioning. I pushed my gf away whom I share a 8 month old daughter with. Gf was much like you, wanted physical touch and affection and being depressed it makes these things meaningless so you don’t want to do them. I hope you husband can overcome it, but please know that it is truly terrible being in a situation with someone whom you love(d) and not being able to return the affection they give you.",
            "score": 2,
            "author": "solcal84"
        },
        {
            "level": 0,
            "comment": "Depending on your relationship",
            "score": 1,
            "author": "boywithnojob80"
        },
        {
            "level": 0,
            "comment": "Depression makes people act in weird ways that don’t line up with their usual behavior. There’s a very good chance he’ll become affectionate again and he might stay that way for a long time. My gf is suffering from depression aswell and she’s been pushing me away. I haven’t seen her in about 4 months. You’re a good person by staying by the person you love. Stay strong!",
            "score": 1,
            "author": "Metaljesus0909"
        }
    ]
}