{
    "id": "147gf1a",
    "score": 6,
    "title": "Depression &amp; euphoria",
    "author": "ElectricalYellow45",
    "date": 1686549649.0,
    "url": "https://www.reddit.com/r/depression/comments/147gf1a",
    "media_urls": [],
    "other_urls": [],
    "postText": "One day I’ll suddenly be feeling great and I’ll be super productive, talkative, happy, exercise a lot and often the whole day, higher energy, higher self esteem. It feels a bit like I’m walking on clouds and I also feel slightly agitated. This usually occurs after several weeks of being depressed and barely or not being able to get out of bed.\n\nHowever my feelings of euphoria never last, and they either crash back down again into depression or ebb away into somewhat normalcy, depression returning shortly after. It feels so cruel to have glimpses of happiness only for them to be quickly stolen from me. Whenever I find myself in a good mood or happy my first thought is to dread when it’s going to plunge back down. I used to not have the euphoria and just the depression and I was significantly more functional although equally miserable. I did have some periods of euphoria, but after I went on antidepressants the euphoric periods became more frequent and intense. \n\nI know it sounds like I’m spoiled because I’m complaining about being happy, although I do enjoy my euphoric times a lot. But honestly it just makes my depression seem way worse in comparison, and dropping from euphoria into depression is an emotional whiplash-inducing experience and makes it more difficult for me to function. \n\nHave any of you guys experienced this? Is this common in depression?",
    "comments": [
        {
            "level": 0,
            "comment": "Sounds like bipolar 2.",
            "score": 2,
            "author": "Anxious_Strategy_366",
            "replies": [
                {
                    "level": 1,
                    "comment": "hmm, that is a possibility, but also I’m wondering if this is a common experience in people with clinical depression (not bipolar)?",
                    "score": 1,
                    "author": "ElectricalYellow45"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think it's called bipolar. Some people with this sleep during the downphase. But if you wanna be sure talk to a doctor about it.",
            "score": 1,
            "author": "MelodieCode",
            "replies": [
                {
                    "level": 1,
                    "comment": "I agree it does sounds like bipolar, but I’m still skeptical, okay tbh I also don’t want to believe it, and my psychiatrist hasn’t diagnosed me with it. Is this just a common experience with (unipolar) depression?",
                    "score": 1,
                    "author": "ElectricalYellow45",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I have been diagnosed with severe depression and this does happen with me from time to time, you’ll have a day of actually wanting to be productive you’ll clean, make plans to do this and that and either by the end of the day or the next few days it all comes crashing down. I know the feeling.",
                            "score": 1,
                            "author": "Boring-Honeydew-6550"
                        },
                        {
                            "level": 2,
                            "comment": "And the feeling of doom knowing it isn’t going to last is something I’ve never been able to put into words but I have the exact same feelings. I’m sorry you’re going through this, you’re not spoiled, it’s a horrible feeling.",
                            "score": 1,
                            "author": "Boring-Honeydew-6550"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Manic depression.",
            "score": 1,
            "author": "Acalthu"
        }
    ]
}