{
    "id": "147tdbf",
    "score": 1,
    "title": "I dint know what to do…help please",
    "author": "Carebear6590",
    "date": 1686592870.0,
    "url": "https://www.reddit.com/r/depression/comments/147tdbf",
    "media_urls": [],
    "other_urls": [],
    "postText": "So much I want to say….\n\nI feel like so much is happening in my life and I dint know what to do it’s causing me anxiety/depression and suicidal thoughts like I just don’t want to be here anymore \n\nI have graduated in 2021 but had worked odd jobs case manager, Macys, call center for early intervention and warehouse (gopuff/ Whole Foods). Makes me feel like shit because I can’t hold down a job and feel less productive and I’m always broke. I don’t know what type of job to do now and I just hate the idea of. Working but I know I have to work to survive. Can I work overnight somewhere like warehouse for now a little while until I get it together (but idk my life is gonna be a living hell I’m always gonna be tired . Are probably work with kids.) I eventually developed a stutter which has got worst lately because of my anxiety I have been going through I can’t barely get my words out like I’m not breathing correctly are something feel like I can’t express myself and it frustrates me I don’t want to go out and talk to anyone and want to seclude myself because of it I’m ashamed.\n\nMy mom has schizophrenia but does not want to go get help she has a YouTube channel doing tarot . And believe her family is against her and want to krill her especially her father . And curses him out every other nightyelling at him and he has huhhh blood pressure and his heart beats fast when she screams at him for no reason and wishes him dead which depresses me when she says that. \n\nMy grandpa told me if I have money for the rent because he might just leave us and my mother because he can’t take anymore of her stuff and he said he might die because of her. It’s is his apartment he paid rent for 50 years here\n\nSo now I’m in the middle got to figure stuff out like job wise becaus my grandpa might leave us and how to get this lady help.\n\nAll at the age of 24, my mom is 46, and I’m grandpa is 84 .\n\nSometimes I just want to sleep it off and pretend this is all a dream to much to think about and do",
    "comments": []
}