{
    "id": "147xygw",
    "score": 1,
    "title": "Finally had an appointment at my therapist’s office today.",
    "author": "nightsideof3den",
    "date": 1686604681.0,
    "url": "https://www.reddit.com/r/depression/comments/147xygw",
    "media_urls": [],
    "other_urls": [],
    "postText": "I have been talking with her on the phone since December of 2018, but was in such a miserable state for such a long time that I was unable to leave the house for several years.  She started coming to see me early last year, once I was starting to feel comfortable around other human beings again.  Then a few months ago we met up at a park near my house, and the next time she drove me to her office just to check it out.  \n\nFinally today I went to her for an appointment, after seeming ages working up to it.  It went well but I am so sad because many of my old symptoms are coming back, and my CFS is starting to get bad enough that leaving the house is difficult.  I’m just not sure how long it’s going to last.  I am proud of my accomplishment, but it just seems like everything falls apart right as it’s coming together — yet again.",
    "comments": [
        {
            "level": 0,
            "comment": "It sounds like you've made a big step today. I'm proud of you too! It would make sense that it might also be a little bit scary as well to have done something you've been working up to for a seemingly long time though. I don't know if that might be aggravating your old symptoms? But, I can understand your sadness right now as well. Still, I'm glad it went well today. How would it feel if you are able to keep getting out like that in the future?",
            "score": 2,
            "author": "fine-bell2",
            "replies": [
                {
                    "level": 1,
                    "comment": "It would feel just lovely, but I’m not sure how long this will all last from here.  I’m a deeply screwed up human being.",
                    "score": 1,
                    "author": "nightsideof3den",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I hear that you are feeling screwed up and that you don't know how long this will last. You've had some really great progress and so it makes sense that it feels like that might not continue, though it might. But then, it also sounds like you have persisted with therapy for quite some time and that over that time you've been making progress despite the obstacles, which is great I think. There may be peaks and valleys but how are you feeling about the overall trend?",
                            "score": 2,
                            "author": "fine-bell2",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I’m happy about it and grateful for these last years, but things really seem like they’re going way downhill again.  Some things are better, but other things are just so, so much worse.",
                                    "score": 1,
                                    "author": "nightsideof3den",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I can understand your concern that some things seem to be going downhill for you, or are notably worse. That can be both scary and disappointing I would imagine. But, I am also happy to hear that at least some aspects are going better for you as well. It sounds like the landscape has changed from what it was anyway. Still, it sounds as if you are having some mixed feelings about where you are at. What were you able to discuss about these feelings with your therapist yesterday?",
                                            "score": 2,
                                            "author": "fine-bell2"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}