{
    "id": "147xw7w",
    "score": 1,
    "title": "Is your Brain like mine? How to forgive yourself for past mistakes",
    "author": "sendmeback2marz",
    "date": 1686604516.0,
    "url": "https://www.reddit.com/r/depression/comments/147xw7w",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey,\n\n\nI’ve always had pretty low self esteem and my brain gets stuck in the past a lot. Like daily. My brain flashes back to the parts of me that were I was at my lowest. When my behavior was awful, cringe or plain sad I suffer from BPD, BP with major depression.  (I’ve been in therapy for 4 years &amp; stable on meds for 2) \n\nMy body was hit with a chronic pain disorder and it’s really awful. I couldn’t even walk for a few weeks. Somehow, I’ve made 2 dreams come true; become a full timer writer and financially support myself. \n\nAs a disabled person it’s a miracle to be functional enough to work a full time job. another miracle that I can work remotely and that my salary is really good (unless you live in an over price city like New York. 🙋🏽‍♀️) \n\nLife is still hard but I’m really lucky, especially given my circumstances. \nBut it’s so hard to be proud of myself and let the past go to the parts of my brain I don’t need to rewind to. I can’t emotionally connect with being proud of myself anymore. I can’t connect my gratitude for certain things to my actions. I’m grateful to have a roof over my head, but I can’t link that back to the positive ways I’m living my life. \n\nYes, Life has been but there are things I’ve done that have made it harder. \n\nBut the way every mistake I’ve made resurfaces is haunting. The scenes are more powerful than my ability to live in the moment. I want to change the way my brain operates and I don’t really know how. Affirmations and scripting has help me to have a base level amount of self respect and love. That’s pretty miraculous but I also don’t credit myself for the change, I say it happened because I refuse to be in constant pain and being disrespected by someone. \n\nI’ve had waves of it being easier to feel pride but it’s just until it the accomplishment become part of the mundane. \n\nI wonder what people without mental illnesses think about every day. \n\nDo they feel so overwhelmed by their thoughts?  Does speaking to people feels like a chore? \n\nI really want to be happy. Live in the moment, embodying the pride I should feel rather than shame. \n\nNormal brained. \n\nHow did you get better?",
    "comments": [
        {
            "level": 0,
            "comment": "I am not a mental health professional. But I do tend to have the same repetitive thoughts about mistakes I’ve made. So I’ll tell you what helped me, though it might not help you… \n\nWhen I first started trying to rid myself of those kinds of thoughts, I would apply the mistakes to someone else. Sometimes a fake person in my head, sometimes a real person I knew. Then I would act out how I would respond to that person if they admitted their mistake to me. This really only works if you care about the ‘person,’ because you are probably more inclined to show empathy. This was a good starting point, though it wouldn’t get rid of that crushing ‘holy fuck I’m going to kill myself’ feeling. Though it would ease it! \n\nNext I tried picking apart every detail of my mistake so that I would get the ‘most’ out of my mistake. Yk, the whole, “I’ll learn from this and never do this again,” thing. Again, it was not the perfect fix, but it would help with some of the embarrassment. \n\nNowadays, and this is probably my favorite, I just say “let it go.” Like a Disney princess. At first this was super hard, and I would find myself thinking about the topic over and over, and I’d just have to keep telling myself to “let it go.” And then throw myself into whatever I knew would distract me right away. (Cleaning is my go to, there is always something to clean.) \n\nI’ve actually gotten pretty good at realizing when my thoughts are going to spiral into something embarrassing, to the point that I now forget what I was thinking about before I can even consciously voice it. Which is actually kinda annoying because I’m left with that embarrassing/guilty feeling, with no idea what thought caused it. Thankfully the feeling doesn’t last long! \n\nSo, you can try all three of those methods and see which works best for you. (I don’t recommend option two if you tend to obsess over morals like I do.) Or you can develop your own method and come back and share it with the class. I know these are words that mean nothing coming from a stranger, but! You are not your past mistakes you deserve just as much love and care as I’m sure you’d give to someone else for those mistakes.\n\nOr, if you are more into ‘logical’ thinking, there is no point in ruminating on the past after a certain point. If you are gaining nothing then you are just wasting precious brain juice.",
            "score": 1,
            "author": "Gold_Bid_1793"
        }
    ]
}