{
    "id": "14807kd",
    "score": 1,
    "title": "My father changed his will after crying out he had depression",
    "author": "jokersup",
    "date": 1686610887.0,
    "url": "https://www.reddit.com/r/depression/comments/14807kd",
    "media_urls": [],
    "other_urls": [],
    "postText": "Long story short.  \n\n2020 my father hands me his will and says he wants me to be his executor.  Ok.  Everything is easy, kids each get 1/3.  \n\nChristmas Day 2020 - he no shows at Christmas.  I call him and he screams “I am so depressed!!!! “. He is out of control on the phone.  \n\nJuly 2021 - he blocks me and my wife out of nowhere.  Next day, I get a message that he is so depressed and he didn’t mean to, it’s just been hard.  He unblocks us.  (He contacts my brother and tells him we blocked him, but nope, this is all him).  \n\nHis behaviour gets more and more wild.  He starts not seeing us.  He basically chooses not to see his own grandkids.  He starts sending messages to an 11 year old in the middle of the night.   He starts contacting our children’s school.  I ask him why he is doing all this, in writing, and he says none of this happened.  He says he will be in touch in a few years.  ?????\n\nWe haven’t talked since.  He took me out of his will completely. I won’t even get to the total smear job he started on after.  \n\nWth.  I know there must be a proper forum for this but I cannot grasp the depression raging through him.  It was a nightmare.  He clearly was and is having severe mental health issues.  \n\nWhat do you do?",
    "comments": [
        {
            "level": 0,
            "comment": "I'm sure this must be really hard on you. But you need to realize that this is not a choice on his part.\n\nFrom what you are describing, his behavior seems psychotic.\n\nIt may be Schizophrenia or a form of dementia, psychotic depression or drug induced psychosis. \n\nIs he in contact with any of your family that you can get in touch with?",
            "score": 3,
            "author": "Apart-Importance-369",
            "replies": [
                {
                    "level": 1,
                    "comment": "Psychotic is a good weird.  To me it feels that way; to him it was depression. \n\nHe is in touch with others where he presents more normal.  He hasn’t told anyone about his severe depression.  \n\nJust not sure what to do when I’m the one person he told over and over it was depression then vanished but to others he says I cut him off.  (I did not).  \n\nWhat do you do?  You’re not the first who has mentioned dementia.",
                    "score": 1,
                    "author": "jokersup",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[https://www.nhs.uk/mental-health/conditions/psychotic-depression/](https://www.nhs.uk/mental-health/conditions/psychotic-depression/)\n\nIf he presents himself as normal, then he feels ashamed and are masking it. Not uncommon with psychosis or dementia.\n\nMaybe in his delusion he thought that confiding in you would lead to something and it didn't, or that he said too much and it would have consequences - paranoid thinking.\n\nWell, I don't have a good advice. In my country, you could try to talk to his GP, not to get any information, but to express a concern.\n\nOtherwise I would suggest to talk to the people around him, and hear what they think, and maybe get them to suggest him seeking professional help.\n\nThis can be hard if he is actively fighting against it, so I would suggest to read a bit on how to approach it.\n\nI would start to google: \n\n*My father has dementia, and refuse to get help.* \n\n*My husband is paranoid, but refuse to seek help.*\n\n*How do we convince out paranoid brother to get help.*\n\n*Etc.*",
                            "score": 1,
                            "author": "Apart-Importance-369"
                        }
                    ]
                }
            ]
        }
    ]
}