{
    "id": "1489p9e",
    "score": 1,
    "title": "idek anymore",
    "author": "kate-page",
    "date": 1686642616.0,
    "url": "https://www.reddit.com/r/depression/comments/1489p9e",
    "media_urls": [],
    "other_urls": [],
    "postText": "idk I’m here thinking ab life and it really fucking sucks. I just feel so empty. no matter what I do I can’t get out of my own head. there’s always this nagging feeling in the back of my mind like something is literally gnawing at the inside my head trying to escape. I’ll have moments when I feel semi-okay and then everything just crumbles again. I feel like a freak. I can’t talk about it with anyone. I have friends but we don’t ever really talk ab anything important, even though most of them are aware I’m depressed af. no one checks in, no one cares. If I disappeared would anyone even notice? Inside my head I feel like I’m constantly screaming at the top of my lungs but no one can hear me. so here I am yelling into this void instead. I guess it also doesn’t help that I can’t really put my feelings into words. I just feel like shit. there’s not really a particular emotions I’m feeling it really feels like nothing but everything at the same time. I feel like it will never end, just an endless string of sleepless nights and unshed tears. I wish I could sleep but I can’t. I wish I could cry but I can’t. I wish I felt better but I don’t. I need to go back to the doctor and get back on my meds but I’m too fucking scared. I’m also too scared to try therapy. There are so many things that have happened in my life that got me to this point and I don’t think I’d be able to unpack all of that. So I guess I’ll do what I always do and bottle it up. It will explode one day and maybe then someone will listen to me.",
    "comments": [
        {
            "level": 0,
            "comment": "Don't have any answers,God knows I've spent too many days lost in the world myself, but if you ever need to spout shit I can try and listen.",
            "score": 1,
            "author": "handonslutsthroat"
        }
    ]
}