{
    "id": "148disi",
    "score": 5,
    "title": "Depression is my own fault",
    "author": "Healthy-Definition91",
    "date": 1686656868.0,
    "url": "https://www.reddit.com/r/depression/comments/148disi",
    "media_urls": [],
    "other_urls": [],
    "postText": "No one cares about your feelings.\nPeople take your niceness for granted even though it's a rarity to be found they'll self sabotage a friendship or relationship that could've worked been something more because they're so fucked up.\nIf you were dealt a bad hand you're expected to figure it all out on your own with no help.\n\n\"You're not supposed to do it on your own no one's expected too\"\n\nWell a lot of people are in that exact situation because some people don't have anyone. Like anyone at all but you wouldn't know that because you're all too focused on being selfish not once thinking about any of what the other people around you are feeling, just only you.\n\nCan't really even blame you though.\n\nNo one understands you nor does anyone want to because everyone in this world is too focused on themselves and competing with one another in this rat race none of us even signed up for.\nPeople think it's so easy to just commit suicide if we think \"life's too hard\" we can just tap out.\n\n(That's why it makes me so sad when people actually do it.. that means they were in so much emotional pain/physical pain that they took it all the way there an ended their life. That's horrible.. lol an then you're still called selfish for that as well once your gone)\n\nTrust me if I could cut my wrists an bleed out an get it over with I would. But I don't wanna suffer an feel pain. I just don't wanna be here on this planet feeling all this emotional pain.\n\nI never asked to be here to have to work to live for a bunch of people that couldn't give less then a rats ass if I died on their doorstep.\n\nI can't believe that people turn this stuff onto me an say stop feeling sorry for yourself, love yourself, find a hobby, get a therapist, take some pills, do some drugs, or just kill yourself.\n\nNo wonder almost everyone on this planet is an asshole .. everyone ends up becoming one because aye if you can't beat em then you might as well join em.\n\nI don't wanna be an asshole. I just wanna be dead.",
    "comments": [
        {
            "level": 0,
            "comment": "don't be an asshole if you don't want to, just be yourself. i wouldn't never join them even if i can't beat them because there's no reason to do so.",
            "score": 2,
            "author": "adomman23"
        }
    ]
}