{
    "id": "148h30k",
    "score": 3,
    "title": "Not fluent in english",
    "author": "Corvo_99",
    "date": 1686667530.0,
    "url": "https://www.reddit.com/r/depression/comments/148h30k",
    "media_urls": [],
    "other_urls": [],
    "postText": "Does someone else feels kinda pathetic sometimes about the way you acts? Like, hating why i cant at least act like everything is fine just to avoid conversation with people that i barely know and they dont know me either but wants to fuckin force to having a talk. I i just pretended better i wouldnt pass for that stuff.\nExplaining better: one person that i know texted me to have a coffee with her yesterday, me being a mooron went, and God i was so umconfortable the whole time, i can see or tell or whatever that maybe the intention was good, but she wouldnt stop talking about how clearly i was not fine, how i could speak whatever i wanted to her that she wouldnt judge, but i was so painfully umconfortable, just waiting to leave and she insisted so fuckin much to me talk to her. \nI dont know, i just hated the moment, hated how i couldnt just say something to please her how i did already so many times with other people, hated how i could have just said no, or how i could just say \"im umconfortable with that, bye\" and leave, i was literally feeling like i was pressed in an imaginary wall while she talked talked talked",
    "comments": [
        {
            "level": 0,
            "comment": "One of the many negative aspects of being depressive, people want to force you to talk with them, they think you are going to open your feelings to them out of nowhere, just for convenience i guess. But depression doesn't work like this, and i hate when people come to me asking everytime how i feel, or what i'm thinking, and don't elaborate about anything at all. I mean, i'm depressive, but i want to be treated as a normal person would for god's sake! It is just so annoying, because in the end, this doesn't help you with anything, and you end up just feeling upset or even thinking you're a nuisance for the person that \"loves\" you.",
            "score": 2,
            "author": "Illustrious_Ad_5453",
            "replies": [
                {
                    "level": 1,
                    "comment": "God i was so fuckin umconfortable, the way she looked at me with pity, like im something she needed to save i hated",
                    "score": 2,
                    "author": "Corvo_99"
                }
            ]
        }
    ]
}