{
    "id": "148ntiv",
    "score": 5,
    "title": "Do u know any depressed ppl, who regained willing to live after avoiding death?",
    "author": "Gluteusys",
    "date": 1686685461.0,
    "url": "https://www.reddit.com/r/depression/comments/148ntiv",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi, f25, I dropped my depression treatment (no results for years, im tired). So I'm just taking my pills to be +- ok. And guess I'm becoming crazier.\nSo I got an inspiration. I've never been in a break of dying. What if I survive in such situation, i will think \"oh, god, it was so scary, life is so precious, I want to live 100 years\" and blah blah blah? If I die, well, thats good outcome too.\nWhat do u think, is it possible?",
    "comments": [
        {
            "level": 0,
            "comment": "So it’s taken me three ish years to move past my failed marriage. Im 31, and I’m actually moving forward more in terms of my depression. I encourage you to not give up. I’ve been on 5 different meds and the class I’m taking now makes me feel better and normal, not in the void anymore.  I took a genetics test at my new treatment place and it helped to see what meds can work and what meds won’t work. Don’t give up! You are important. Good luck",
            "score": 2,
            "author": "SonsofStarlord"
        },
        {
            "level": 0,
            "comment": "I know some people that i believe regained it, but they first became depressed in their adulthood after a traumatic event or something like it.\n\nEdit: i myself regained it for a relative short period after i was released from the icu, but i been depressed since young.",
            "score": 1,
            "author": "Organic-Ad654",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm depressed from childhood, so guess no chances too)",
                    "score": 1,
                    "author": "Gluteusys",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That is not final, like im so sort of expert in the subject, its just observation in my small world.",
                            "score": 1,
                            "author": "Organic-Ad654",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Small observation is good feedback for me too)\nAnyway it's just small \"what if\" for me, I don't have much hope for this. Guess otherwise ppl won't be doing rows of suicides after every failed ones.",
                                    "score": 2,
                                    "author": "Gluteusys"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The thing that is working for me is exercises.",
                            "score": 1,
                            "author": "Organic-Ad654",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Nah, things like exercises or sleeping schedule never worked for me sadly.",
                                    "score": 2,
                                    "author": "Gluteusys",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Sleeping is also the usual recomendation, the others are eating right and daily sunlight, thats why i walk on the street.",
                                            "score": 1,
                                            "author": "Organic-Ad654"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I've tried suicide three or four times now, one attempt being made not two months ago. Two of them almost caused my death, but honestly, when you're fucked up like me, there is no such thing as a will to live, so even when i've faced death two times, i didn't regain any will to live, and i still have the idea of suicide in my head. But people each have their individual experiences and thoughts, so probably, someone must've gained the will to live after almost dying, but that doesn't work for me, and i don't know if it will work for you. But if you want to go ahead with the idea, just do it. \n\nBtw, im sorry if i misspelled something, i'm brazilian, my english is not the best.",
            "score": 1,
            "author": "Illustrious_Ad_5453"
        },
        {
            "level": 0,
            "comment": "I've almost died a few times and it never really helped me. I was also forced into a hospital for a week because I attempted suicide when I was extremely drunk and that week in the hospital was the worst. It scared me enough to not attempt it again because I don't want to go back but I still want to die.",
            "score": 1,
            "author": "Background-Tea-7082"
        },
        {
            "level": 0,
            "comment": "Actually the opposite has happened to me. \n\nI was almost killed in a car accident last year and since then every aspect of my depression has gotten far more severe. The way my thoughts inside my head are formulated now, is just different then before. I’m the same person but just…different. It’s hard to explain. \n\nLike you hear about people who go through traumatic brain injuries and their personality drastically changes. I feel like something similar happened to me. I’m the same person physically and have all my memories. Yet mentally and emotionally I feel extraordinarily different. Far more depressed and unfeeling about life.\n\nSorry for ranting.",
            "score": 1,
            "author": "VanaVisera"
        },
        {
            "level": 0,
            "comment": "It’s not exactly what you’re asking, but I started volunteering in the ICU during the most suicidal time in my life and almost immediately stopped being suicidal. It seriously only took talking to a few patients over a couple shifts. And it wasn’t even a conscious thought of “I’m so thankful for my life because these people are dying!” And it wasn’t like it made me want to live. I was definitely still depressed. It just completely kicked my suicidal ideation for some reason, and I wasn’t suicidal for a good while even after I stopped volunteering. I think subconsciously interacting with people who actually were dying but wanted to live flipped a switch in my brain. I still don’t quite understand it. I often wonder if something like this has happened to anyone else.",
            "score": 1,
            "author": "anythongyouwant"
        }
    ]
}