{
    "id": "ee58qm",
    "score": 3007,
    "title": "I can overhear my mother on the phone laughing and joking about my depression to her friend",
    "author": "fromaustt",
    "date": 1577023701.0,
    "url": "https://www.reddit.com/r/depression/comments/ee58qm",
    "media_urls": [],
    "other_urls": [],
    "postText": "Saying things like “she’s so emotional hahaha” and telling her friend everything I just said that was making me upset.\n\nEverything about me is just a joke to her, just a topic of discussion for her to gawk over.\n\nI don’t even know why I’m crying, what else should I expect from someone who hasn’t ever given me any kind of legitimate emotion support.",
    "comments": [
        {
            "level": 0,
            "comment": "Family is mostly a product of random chance. You don’t owe your family anything except for how they’ve treated you. If your family treats you like this, they don’t have to be a part of your life.",
            "score": 900,
            "author": "tomjazzy",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have no other option. I wish I could just pack up and leave forever I really do.",
                    "score": 360,
                    "author": "fromaustt",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 344,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm waiting to reach the adulthood so I could move somewhere else. My parents are abusive, I hate them.",
                                    "score": 78,
                                    "author": "[deleted]",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "This deserves more upvotes.",
                                    "score": 52,
                                    "author": "michsimm",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "This is very true. My mother constantly marginalized the needs of her children and put herself first. Did the same thing to two spouses and countless boyfriends. \n\nI peaced the moment I could sustain myself and regret nothing. We still talk from time to time but I’m extremely glad I got out of that toxic place.",
                                    "score": 15,
                                    "author": "[deleted]"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "x2 at some point you can and will. Just hang in there til you can. It pays off and you’ll look back on all of this as the reason you are the way you are. Coming from first hand experience",
                            "score": 31,
                            "author": "thenonapus"
                        },
                        {
                            "level": 2,
                            "comment": "You will I promise. You need to wait, I don't know how old are you, but you will soon figure out how to get out of that toxic environment and start again from there. I did, it was hard as hell but worth every damn second and penny. Be patient, it will be worth it.",
                            "score": 15,
                            "author": "manimecker"
                        },
                        {
                            "level": 2,
                            "comment": "I can really relate to that. I hope one day I could manage on my own. Maybe it'd be better than getting treated as failure or unman on almost a daily basis",
                            "score": 9,
                            "author": "John-333",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Me too sending love and best wishes your way ❤️",
                                    "score": 4,
                                    "author": "fromaustt",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thanks! Wish you the best, too.",
                                            "score": 3,
                                            "author": "John-333"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Keep thinking that one day you'll be free from this crap and live a better life.  Use this as a daily motivation to keep going... One day just leave that place where you're treated like shit.",
                            "score": 7,
                            "author": "Sauravbauddh",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I wish more people understood this",
                    "score": 32,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "My god, truer words have never been said",
                    "score": 4,
                    "author": "Thequestin"
                },
                {
                    "level": 1,
                    "comment": "True, My Mother and Brother were extremely abusive to me the entire time I was growing up. Cutting them out of my life altogether was the beginning of my healing. Sometimes family isn't random chance but a cruel act of fate.",
                    "score": 3,
                    "author": "OldSuperhero"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 141,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "She can very manipulative with other people too, she’ll deliberately put me in situations which she knows full well will make me debilitatingly uncomfortable and then get upset at me when I freak out and then tell everyone else how I went “crazy” and seek some sort of comfort from them.",
                    "score": 103,
                    "author": "fromaustt",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 32,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I wish it were that easy",
                                    "score": 21,
                                    "author": "fromaustt",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 5,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It's not that easy for people to just leave any place any time. She could be in between jobs or in a bad financial place, she could be underage and unable to move out yet, she could be depending on her mom financially while she's in school or any number of things. \n\nMy girlfriend took her life when she was stuck like that with a horrible family. It's not that uncommon.",
                                                    "score": 44,
                                                    "author": "_techniker",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[removed]",
                                                            "score": 6,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I'm sorry she passed away. Congratulations on moving out and finishing high school next year though, best wishes",
                                                                    "score": 7,
                                                                    "author": "_techniker"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You should check out the subreddit raisedbynarcissists if you haven't already.",
                            "score": 13,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "F*** that lady. I hope you go far away from her asap. My mom is that way too. I’m happy that we live in separate states now.",
                            "score": 3,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Do you have any kind of relationship with her?",
                                    "score": 3,
                                    "author": "fromaustt",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "We speak on the phone maybe 1-2 times a month, if that. There’s an occasional text. She visits my sister (my sister and I live together) so I see her from time to time but not too much. I avoid making conversation with her and I don’t let her know about my personal life. Its been this way for the last 5 years now and I’m mentally healthier. \n\nMy mom (and yours) are brain terrorists. They suck the good out of the room and anyone in their way can receive damage. I’m okay with the fact that I’ll never be close to that lady. I even call her by her first name. I have for over 5 years now.",
                                            "score": 3,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "She really is! And I cannot wait for the day I’m in a position to be free from her. Thank you ❤️",
                                                    "score": 5,
                                                    "author": "fromaustt",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 112,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I just don’t know what to do. I’ve told her it hurts me when she does this but I it seems to just not register with her. How can people be so cold especially to their own daughter? What have I ever done? It’s just not fair. Thank you for message, it really does mean a lot ❤️",
                    "score": 81,
                    "author": "fromaustt",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 34,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you so much ❤️",
                                    "score": 15,
                                    "author": "fromaustt",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Can't imagine someone's own mother being like this. I'm sorry for your pain. Your parents are supposed to protect you. If hurts you the most them consider staying at your friend's  or any other relative's for a while. Your mother should feel your pain. Do what is best for you. You make your own happiness.",
                                            "score": 8,
                                            "author": "IvaSar11",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Thank you ❤️",
                                                    "score": 2,
                                                    "author": "fromaustt"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Remember you are of no fault!",
                                            "score": 2,
                                            "author": "Cheeseboy21",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Oh and merry Christmas to you too! ❤️",
                                    "score": 4,
                                    "author": "fromaustt"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "2 kinds of people in this world, fake reptilians who have no emotions and humans.",
                            "score": 3,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "Adults I grow up around believe that if you are not an adult, you don't know what stress is and therefore cannot be depressed. Maybe you mom genuinely thinks you are just exaggerating you stess and is joking about it because she is unaware of how you truly feel, or maybe she is just a bad parent; I wouldn't know.",
                            "score": 4,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "She knows exactly how I feel.",
                                    "score": 2,
                                    "author": "fromaustt"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This makes me mad, because I relate to it. My mom would joke about things she said that bothered me to her friend over the phone and basically make fun of me too. \n\nI'm sorry that you have to experience that. I've met strangers on the internet who have more empathy than my entire family put together, so for what it's worth I wouldn't mind talking with you cause friends are the family you choose :)",
            "score": 37,
            "author": "Punloverrrr",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you ❤️",
                    "score": 9,
                    "author": "fromaustt"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My mom does the same thing to this day and I'm 35. It took me a long time to understand that the way she behaves is 100% about her. I mourned the loss of the mother daughter relationship I wanted, and accepted the one I do have. \n\nNow I can see that it is her way of processing things she is u comfortable with. She has her own undiagnosed mental health problems and a lot of it is deflecting.  \n\nThe pain and sting of hearing your mom say things about your mental health is awful and I wish you didn't have to feel it. \n\nJust know that you are enough the way you are. She doesn't define your worth, you do.",
            "score": 27,
            "author": "NarwhalQueenoftheSea",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’ve just always wanted a mother I can talk to and feel comfortable with. I guess I’m beginning to realise I’ll never have that.",
                    "score": 11,
                    "author": "fromaustt",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You will in new friends. Trust me, give it time. Ive spent years of emotional abuse from both parents. Mostly my dad. Sad fact kid is that there will be another adult in your life whom will do more to take care of you then your monster did. When you find that human don't let go.",
                            "score": 4,
                            "author": "Randotek"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Your “mom” isn’t a real mom in the general sense of the word. A mother should be loving and supportive. Not derivative and unkind. Sorry she views you that way. You don’t deserve it. Nobody does. I too, have a worthless excuse for a mom. She walked out on my life then tried to pretend she was/is a real parent.",
            "score": 14,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "It sucks too because everyone thinks she this fun loving person when in reality she’s a classic manipulative narcissist. I feel like I’m asking for the entire world when I just want a little support or just a sign I fcking matter",
                    "score": 16,
                    "author": "fromaustt",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I know a lot of moms like that. It’s honestly shocking how many people just aren’t who they claim to be/who others make them out to be. It’s sad too. But they can only pretend for so long. People will catch on eventually, one way or another.",
                            "score": 3,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "My mother has done the same to me and at this point I just don't care, my whole family treats it like a joke and none of my \"friends\" care. My literally told me I should write my English Essay about crying, she said that while laughing.\n\n\n\n\n\n\n\n\n\nI have nothing but respect and love for you OP 💖",
            "score": 9,
            "author": "GREENBEAN214",
            "replies": [
                {
                    "level": 1,
                    "comment": "What a cruel thing to say. What is seriously wrong with these people. I’m also sick of the “they grew up in a different era” not an excuse to be cruel.",
                    "score": 4,
                    "author": "fromaustt",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Gen Z is the most suicidal generation in history because the previous generations are assholes. I'm 18 and I've felt like kicking the bucket my entire fucking life. \n\n\n\nStay strong",
                            "score": 4,
                            "author": "GREENBEAN214",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm 21 M, in general I am pretty chill with my parents. But there have been so many instances where we had guests at our house, and instead of asking how I am doing/is everything fine, they will ask what I am gonna do in future and stuff I don't want to answer. I either completely fake it, reply with mean words or leave the living room with disgust depending in which state my anxiety shoots me into. My parents will cover it up with 'haha, he's just scared of seeing new faces'. Goddamn it, you all boomers didn't have your shit together until you were in your forties, why the hell are you expecting so much from me. Also if I don't want to answer something I just hope my parents respects it.  \n\nEdit: Grammar",
                                    "score": 3,
                                    "author": "hitman4636"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "While I can't say she is one r/raisedbynarcissists is a good place to go to vent about this kind of behavior",
            "score": 9,
            "author": "MeaninglessFester",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you! Took me too long to scroll down and find this.\n\nOP, please check this place out for some support!",
                    "score": 4,
                    "author": "I_AM_FERROUS_MAN",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks guys, she most definitely is a narcissist and a manipulative one at that.",
                            "score": 3,
                            "author": "fromaustt"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I had a mom like that growing up. Pretty sure it's why I'm the black sheep of the family. My mom always told my business and she always told it wrong. \n\nYou're crying because she's your mom and she should be there for you. A real mom doesn't mock or ignore her children. Especially when they are hurting. It's easier to say then do but work on not letting it get to you. Her words, her actions can't break you if you don't let them. I still struggle with this because every little girl wants their mom deep down. But my life is so much better without her around. I learned to only give her limited info about my life. I learned how to navigate the world on my own rather than reach out to her. It made me stronger as a person. \n\nI completely understand your pain. But trust me, it can get better. Do what you need to better your mental health. Focus on making yourself happy and healthy. You got this.",
            "score": 7,
            "author": "KnifexCalledxLust",
            "replies": [
                {
                    "level": 1,
                    "comment": "Just like mine, she seems to always skew the story, sometimes for no reason other than extra drama.I don’t understand it. I do hope I get to the point when it doesn’t bother me. ❤️",
                    "score": 5,
                    "author": "fromaustt",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It still bothers me sometimes. Mainly because I just want to know why. Why doesn't she like me? But I also know that is pointless. It's not like I could ever ask her. \n\nI hope you find your peace sooner rather than later.  :)",
                            "score": 3,
                            "author": "KnifexCalledxLust",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The thing is, I have asked her why she’s like this and why she does this to me, but typically she blames me and dismisses it as if I’m just too emotional or overacting. \n\nI know that it would kill me if I had a daughter who told me she felt unloved and unsupported by me so it’s mind boggling how this doesn’t effect her. \n\nSending love your way ❤️",
                                    "score": 2,
                                    "author": "fromaustt",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "My mom would mostly likely lie and deny any strain between us. She's good for that.\n\nI have two kids of my own now and I promised myself that I would never be the mother she was. I tell my kids every chance I get that I love them. I hug them and cuddle them. I listen to them even if the topic doesn't interest me. I do all the things she never did with me. I don't want them to ever feel an ounce of what I did. \n\nI wish you all the luck and happiness. ❤",
                                            "score": 2,
                                            "author": "KnifexCalledxLust",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Your mom is trash. Get an internet mom instead. People that act like your mom are toxic and bring everyone down. You are important.",
            "score": 7,
            "author": "needs-more-sleep",
            "replies": [
                {
                    "level": 1,
                    "comment": "How do I get an internet mother, that sounds awesome! Lol",
                    "score": 6,
                    "author": "fromaustt",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "/r/momforaminute\n\nALSO I have Reddit son, not opposed to having a daughter as well 💕",
                            "score": 4,
                            "author": "DepressionsDildo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you ❤️❤️❤️❤️",
                                    "score": 3,
                                    "author": "fromaustt"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sorry some mothers are just terrible people. My mother mocks my depression and bipolar disorder. Try to stay strong and know you're worth life",
            "score": 4,
            "author": "IanWyatt316",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you ❤️",
                    "score": 2,
                    "author": "fromaustt"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Try living with an Eastern European family... When I told them I have social anxiety(explaining what that is in the first place) they started laughing and told me that I need to work more or find a second job. My dad started making jokes that I eat too much and if I knew what hunger was I wouldn't have such \"stupid\" things in my life. On the positive side I am better now, compared to a year ago. I wish you to be strong!",
            "score": 3,
            "author": "Igna5",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wow, that's very abusive.",
                    "score": 2,
                    "author": "fluffymuff6",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Agree with you 100%. It could be one of the reasons why we have one of the highest suicide rates in the world. It is very hard to open up to people when they judge you like that.",
                            "score": 3,
                            "author": "Igna5",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That’s awful to hear, I’m so sorry ❤️",
                                    "score": 2,
                                    "author": "fromaustt"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 4,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I’m not very good with “words of encouragement”.  I think what your Mom is doing sucks!  I also know that when I’m “In The Hole”, my perception of reality is beyond messed up!  Having said that, I say this.....Hang In There!!  I see a lot of people on this Sub rooting for you!  We know what your going thru &amp; we love you!",
            "score": 3,
            "author": "burr-rose",
            "replies": []
        },
        {
            "level": 0,
            "comment": "My mom used to do this too. I was \"too sensitive\" or \"too emotional\".  But at the same time she was as well. When I was around 8/9 I was constantly threatened with doctors because my anger was so out of control. There wasn't much healthy emotional support growing up. It wasn't until I got older and my mental illness was at its worst when she started taking me seriously. At 18 I was terrified to tell her I needed help. I didn't know where to go or what to do. \nI'm so sorry you're going through this. It's a horrible thing to hear your own mother joke about the intense pain your feeling. It makes it worse. Please know there are people here to support you.",
            "score": 3,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "r/raisedbynarcissists",
            "score": 3,
            "author": "damondan",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Man what a piece of fucking shit. \n\nTo hell with her. \n\nWe're your fam (hugs)",
            "score": 3,
            "author": "wellshii18",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Someone told me that others can be \"spiritually sicker\" than other's I realized that about my mother. She was abandoned as a child and treated pretty horrible by my great grandmother, she then went on to do the same to my sister and I. Just recently as we were driving down the highway and arguing after her months of vacancy, which is typically (disappear for months then try to weasel back into my life to control and manipulate) she freaked out because I called her out on things, I also forgave her face to face.\n\nShe proceeded to start yelling and threatens to drop me on the highway to walk, knowing full well I didn't have money let alone a driver's license myself. This statement sums up my childhood \"If I was medicated maybe I would've been a better mother\" and then telling me I was an accident being born. Try and forgive her for your own sake, don't condone the behavior but never forget she's spiritually sicker than you.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Hopefully she can change, it may be that she has her own problems too and doesn't know how to process emotions. That would explain it but doesn't justify the hurt caused. Stay strong and stay true to yourself. You're not a joke and you know it, and please seek support (from friends, Reddit, professionals etc) if you can because it's so important to remember that you're not alone in this. Good luck. xx",
            "score": 2,
            "author": "tariellaaiden",
            "replies": []
        },
        {
            "level": 0,
            "comment": "And then when you get mad at her she’ll blackmail you?\n\n ‘I raised you and this is how you pay me back!’\n\nYeah well it’s not like I asked you to raise me, or give birth to me, that’s your fault don’t bring me into your problems.\n\nMy parents say they care and they worry for me, and then call me useless and lazy. It’s so retarded how people will just lie to you and not even bother to keep it up. Just tell me the truth the first time since obviously, you don’t care about my feelings anyway.\n\nWe’ll be there for you as long as we’re alive. As long as we’re available, I swear we will help you. What was making you sad? You can rant to me :)",
            "score": 2,
            "author": "FandomFailures",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I feel you babe, my mother is the same. She told my suicidal self that people will laugh at me if I end up killing myself or seek help from a psychiatrist.  But rememberthat shows the kind of person they are. Their words might be brutal blows for our mental health but don't let those words define you. \n\nYou matter, your emotions matters and you deserve kindness. If you need a friend or someone to talk to, I am here. ❤️",
            "score": 2,
            "author": "violetdonut",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Wow that's fucked up. I'm so sorry you have to go through this...\n\nSome parents just don't seem to get that you can't just spill everything about your kids life. Sure if your kid got a new job or got admitted to college you can tell people about it, but some things are private and need to stay that way. \n\nI once got caught by my mom when i took xtc and she thought it was a good idea to bring that up around my uncle, aunt and grandma. I was a bit on the younger side as well and they all gave me judging looks and i legitimately lost trust in my mom that day. That trust has been restored now but it took multiple years before i started to confide in her again.\n\nTrust can be lost in a second but can take years to reclaim and it's already really hard for me to trust anyone. Something might be a laughing matter to parents but can scar the kid for life.",
            "score": 2,
            "author": "Kelpie_is_a_Beast",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Fuck her for real",
            "score": 2,
            "author": "s0angelic",
            "replies": []
        },
        {
            "level": 0,
            "comment": "That's just fucked up. Your a human being. You need help!!!!!!!",
            "score": 2,
            "author": "ExpiredxLemon99",
            "replies": []
        },
        {
            "level": 0,
            "comment": "move out as soon as you can, save up and ship out, that's what I did.",
            "score": 2,
            "author": "TinkerTyler8",
            "replies": []
        },
        {
            "level": 0,
            "comment": "That's awful x. I'm sorry youve had to hear that. Poeple can truly be cruel and naive. I wish people could feel like us for a day so they stopped telling us to \"man up\" or to stop \"being an overemotional drama queen\".",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you ❤️",
                    "score": 2,
                    "author": "fromaustt",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No problem : ). I hope you’re doing better right now : )",
                            "score": 2,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Get out as soon as you can. She's not going to change.",
            "score": 2,
            "author": "GoblinTatties",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This is what you do if this happens again. Find your dumbest sounding fake voice and make sure your mom can hear you. I'd look her in the eye and start: HA HA HA My Kid is soooo sad it's soooo funny (cue dumb fake laugh). Show her how dumb she is. Or record her, then play it and ask her why your mental health isn't important to her.",
            "score": 2,
            "author": "Weaversag2",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Omg this is so fucked up! Your mother is not a nice person. I'm sorry that you have to be around her. You have friends here that support you &amp; understand what you're going thru. I've been battling depression for over 20 years &amp; it's still rough sometimes but I've learned some tools to deal with it ❤️",
            "score": 2,
            "author": "fluffymuff6",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you and sending love your way. I’m also always open to learning new methods to help deal with it all ❤️❤️",
                    "score": 2,
                    "author": "fromaustt"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I ve got no good tips for this , except to move out asap . You must move to another state/country to forgive it all . If you are suicidal get a small doggo . If you had a poor childhood , see a therapist or even just talk online to someone dedicated (can help tho) and , while u re having some free time , listen to music (any , but classical can help you the most) and get a small hobby (easy to say hard to do",
            "score": 2,
            "author": "ducky5mai",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Humor is a way for humans to deal with sadness. My guess is she has a massive investment in giving you a good life and is trying to prevent herself from giving up as a failure since you are miserable. \n\nWho supports her? Anybody?",
            "score": 2,
            "author": "OHighThereMo",
            "replies": []
        },
        {
            "level": 0,
            "comment": "She does not understand how you feel because she has little to no knowledge about depression, it hurts, but I really hope you don't take it personally.",
            "score": 2,
            "author": "VW1984",
            "replies": []
        },
        {
            "level": 0,
            "comment": "My mom was the same way about my anxiety. She couldn't comprehend that I physically couldn't be in rooms filled with people I don't know. Kept trying to force me into those situations so I'd \"face my fears,\" which lead to one of the most embarrassing moments of my life when she tried to take me to a (fully chaperoned) party with about a hundred kids from school, maybe 3 of them I felt comfortable around (who were all hanging out with different people.) I walked up to the door, felt dozens of eyes looking at me, and panicked before running back to the car.\nOnly then did she at least stop forcing me into those situations\n\nIt wasn't until my younger brother had the exact same problem that she started to understand, but it still took the convincing from one of his teachers for her to schedule him a counseling session.",
            "score": 2,
            "author": "banditobuster",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s awful, and I’m glad she’s come around and understands the situation a little better. My mother unfortunately is not the same. Yes there is always hope but I’m trying to remain realistic about my mother. Thank you and sending love your way ❤️",
                    "score": 2,
                    "author": "fromaustt"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Surround yourself with people who deserve you. It does not seem your mom is among them at this point of her life.",
            "score": 2,
            "author": "-Gioia",
            "replies": [
                {
                    "level": 1,
                    "comment": "❤️",
                    "score": 2,
                    "author": "fromaustt"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm sorry you had to experience that. It took me almost a decade to be open with my family about it and get help. With time ive learned who to open up with, sometimes family isn't the right choice. But uncomfortable instances I've had with my family led to a whole new level of understanding. Not everyone understands. You can chose to educate or simply not speak to that person about it. If I find something someone does or says in regards to my depression makes me feel like dookie I tell them that they make me feel like dookie. Surrounded yourself with people who are willing to understand. I like to think people do the best they can with what they have",
            "score": 2,
            "author": "RagingBunny_"
        },
        {
            "level": 0,
            "comment": "I'm sorry to hear that. Well I actually experience the same thing except that it's not my mom but most of my friends.",
            "score": 2,
            "author": "Blaeder13",
            "replies": [
                {
                    "level": 1,
                    "comment": "It an awful feeling regardless of who it’s coming from. Sending love your way ❤️",
                    "score": 2,
                    "author": "fromaustt"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wow. Imagine using your daughters mental health as a desperate cry for attention. Ive never been in your exact situation, but I’ve always had my mental health downplayed by those I thought I could call my family. I learnt this from a special person in my life. Family doesn’t require blood, it only requires love. What she did? Was not love. It only shows her inner insecurities which she projects onto you, her daughter. You need people who genuinely care for you. Honestly in my opinion, blood doesn’t matter if they don’t treat you like family. You deserve better than this.. you really do. Sometimes I wish all the pain that people like you feel would just be redirected to those who actually deserve it.",
            "score": 2,
            "author": "Amberthms",
            "replies": []
        },
        {
            "level": 0,
            "comment": "My mom had done the same . I had terrible depression and anxiety in high school . \nOne time I was about 16 or 17 I told her I was depressed and she chuckled and said “You don’t have shit to be depressed about !” “Do you have any bills to pay ?, raising kids by yourself ? You don’t even know what depressed is ! “\nThen she called my aunties and talked about it . All I could do was cry more",
            "score": 2,
            "author": "Rough-Limit",
            "replies": [
                {
                    "level": 1,
                    "comment": "Do we have the same mom? Because that's exactly what my mom said/did when she found out about my depression. It sucks when your own family don't even PRETEND they care :/",
                    "score": 2,
                    "author": "prozacpotatosack"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Well this just sums up my theory that family is just group of selfish people. I kinda understand you, I don't know if I'm depressed but I don't really want to live. I don't have parents so I live with my grandmother and everyday she says how she wants to just leave me and say I'm a bad student when I'm actually good and when I said I don't want to live she said \"go to therapist you psycho\" and know I am searching for ways to be emontionless and it's kinda works outside but not at home. Well i wish you the best, and I hope things will get better for you",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I'm 45 my mother has told lies about me my entire life. Her latest are that she hired a private investigator to find me and that I'm living in a homeless camp in the woods. Which is not true, I live with my wife and kids in a house less then 15 miles from her. What I guess I'm saying is that you can escape it, you can move on from her. You have to be strong just to prove them wrong, then you can do what I did and just walk away from them and never talk to them again if you don't want to. I used that thought  when I was younger too just make it through the days. \nBe strong. We are all stronger then we might think, and while this moment hurts you can do it. I did. I'm still here and I'm thriving. You might not feel it but you got this.",
            "score": 2,
            "author": "angryelectricwaffle",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh wow, why would she do that? What is honestly the point of that, that’s so strange. I’m happy to hear you  are in a better place and hope to one day be in the same position, thank you ❤️",
                    "score": 2,
                    "author": "fromaustt"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Family can be tough sometimes mainly cos you have to see them everyday of your life whatever the situation you're in with them. Hang in there, you'll one day venture off and get your own place and the feeling of independence can be daunting but exhilarating at the same time. My family don't take me seriously at all when it comes to my mental problems so I just decided to never share it with them but rely on a certain group of friends, maybe this could be helpful. You don't choose family but you do choose friends.",
            "score": 2,
            "author": "ItzCW",
            "replies": [
                {
                    "level": 1,
                    "comment": "Very true. I’m done trying to open up to her. I guess I just give her the benefit of the doubt because she’s my mother.",
                    "score": 2,
                    "author": "fromaustt"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Omg my mom does the same thing. I'm so sorry, it hurts a lot to hear that :'(",
            "score": 2,
            "author": "yaboimemegod15",
            "replies": [
                {
                    "level": 1,
                    "comment": "What is wrong with them but thank you ❤️",
                    "score": 2,
                    "author": "fromaustt",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I wish I knew exactly what's wrong with them, I do know they're mean :/",
                            "score": 2,
                            "author": "yaboimemegod15"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Friends become your chosen family. Remember that you have friends, even if you say you don’t. Even if you think we are the only ones. We love you",
            "score": 2,
            "author": "C7_Shade",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I think at that point you can call CPS or something. It counts as purpisful emotional\ntrauma",
            "score": 2,
            "author": "Entity42og",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m not really sure what that is",
                    "score": 2,
                    "author": "fromaustt",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s an ignorant comment. In fact, there is a good possibility that you may be pre-disposed to depression through family genetics. Your surroundings play a factor. It’s the nature/nurture analogy. Nonetheless, it’s no laughing matter. You are not at fault for your body chemistry and how your brain is wired. Your strength comes in how you respond, ability to keep your perspective, no blame game. If it’s possible to use the opportunity to your advantage by discussing family genetics, you might gain greater insight to your situation AND educate her too. Examining both sides of your family can show if there a history/pattern of mental illness, (if so what, etc.). You can gage if your depression is more “situational” in nature or if it may be more long term. \n\nHopefully this response helps and you don’t use her comments to club yourself. Obviously not helpful. Piling on never is. Good luck",
            "score": 2,
            "author": "Willie-Tanner",
            "replies": []
        },
        {
            "level": 0,
            "comment": "It is unfair. But noone can choose their family. Now that youre born into that kind of situation, make the best out of it. Dont let her get you down. Move out as soon as possible. When you abandon the ones you love most who are toxic to you, you have the capacity to reach much more.",
            "score": 2,
            "author": "Cheeseboy21",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Hate her. hate her a lot and learn about the process of hating. She's ignorant and you shouldn't be suffering for her rudeness",
            "score": 2,
            "author": "redmorganQwerty",
            "replies": []
        },
        {
            "level": 0,
            "comment": "You are suffering from someone who is being a poor caretaker for you.\n\nOur parents are supposed to support us and believe us. They are supposed to be in our corner.\n\nIt is clear she doesn't believe in depression. She isn't expecting this is affecting you, but it is. \n\nRemember that your parents come from a time where we clacked rocks together, grunted a lot, and said you have to accept depression is what it is and you were just making it up.\n\nAll of my support to you. I know this is tough. Just remember, there is something redeemable in her.",
            "score": 2,
            "author": "meaton124"
        },
        {
            "level": 0,
            "comment": "I’m so sorry to hear that, a parent should never do that to their child, you can call me and we can laugh about your mom haha, really though I hope that sooner rather than later she sees how shitty that is to do to her child",
            "score": 2,
            "author": "IapetusGT",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ha I’ll take you up on that offer lol ❤️",
                    "score": 2,
                    "author": "fromaustt"
                }
            ]
        },
        {
            "level": 0,
            "comment": "hang in there. while it's not ideal it may be her coping mechanism.. you can always be the bigger adult and try to talk to her about it. Teens being emotional is a stereotype joke in society and she may not even fully understand that you are having serious issues. If you get made fun of after that.. your family can eat a bag of dicks and you can move out when old enough. just know you are not alone in this. :)",
            "score": 2,
            "author": "Mr_Wicket",
            "replies": []
        },
        {
            "level": 0,
            "comment": "i’m sorry to hear that, i know how you feel and can relate and empathize with you, my mom used to do this with her husband when i was in high school and make fun of me going to therapy, it’s a really shitty feeling because you want them to be a part of your support system when in reality sometimes they aren’t, but remember people do care and support you, even if you don’t see it or get it through the people you want to",
            "score": 2,
            "author": "earftolea",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you ❤️",
                    "score": 2,
                    "author": "fromaustt"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I overheard my mom talking on the phone to her brother years ago. “Aww, [me] is going through her own little depression now.”\n\nThanks mom.",
            "score": 2,
            "author": "Warm_metal_revival",
            "replies": [
                {
                    "level": 1,
                    "comment": "How patronising. Sending love your way ❤️",
                    "score": 2,
                    "author": "fromaustt"
                }
            ]
        },
        {
            "level": 0,
            "comment": "i literally had the same thing happen to me. i overheard my mom laughing about how i was so dramatic and that i needed to realize i didn’t have it “as bad as other people.” one time we had a total screaming match and i told her i wanted to kill myself. her response was not to “put that on her.”",
            "score": 2,
            "author": "outrosea",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m sorry to hear that and sending love and strength your way. I have told my mother and her response has always been along the lines of get over it”",
                    "score": 2,
                    "author": "fromaustt",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you so much, I am better now, but it was a long and difficult road. Still fighting.\nI understand how that can be, you’re allowed to feel whatever you need to feel and when you feel it. Your feelings matter and you are not a punchline. Keep fighting for those happier days! You’re in my thoughts.",
                            "score": 2,
                            "author": "UhLayNuh19",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Your feelings are valid. You're allowed to be upset. Depression is real. I absolutely hear you. Nparents are disturbing, diaconnected, and downright insane. IT'S NOT ACCEPTABLE TO SICK SHAME PEOPLE. THIS IS A FORM OF ABUSE.  I stopped all connection with mine for my own safety. Please understand your depression isn't a joke.",
            "score": 2,
            "author": "JenVixen420",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you, I hope to one day be far from them ❤️",
                    "score": 2,
                    "author": "fromaustt",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Soon, friend. Very soon.",
                            "score": 2,
                            "author": "JenVixen420"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 2,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Give your mom a \"HADUUKEN\" and a \"TIGER UPPERCUT\"!  next time she pulls some shit like this!",
            "score": 2,
            "author": "Johns_Jackson",
            "replies": [
                {
                    "level": 1,
                    "comment": "LMAO I burst out laughing when I heard this. Thank you ❤️",
                    "score": 2,
                    "author": "fromaustt",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "😁",
                            "score": 2,
                            "author": "Johns_Jackson"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "She sound's awful, but hey, most people have never had to go to therapy some people have never had depression, it doesn't make them better and they are probably lying. They grew up to just shove it down.... Then you learn you used to have an uncle or aunt later in life and you see your parents hiding it behind walks or drinking or watching sports.  \n\n**Try to volunteer** you will meet really great people hopefully. Volunteering is such a great way to find honest great people who are willing to listen and help you out or vice versa. Also if you do volunteer for a cause it makes the person talking sh\\*t about you look awful. so they tend to stop.\n\nYour mother sounds comfortable and ready for retirement in a home (joke).",
            "score": 2,
            "author": "Kingsley7zissou",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lol unfortunately she’s still young and able. \n\nI do a few volunteering things with church but perhaps I should do more, sounds good, thanks ❤️",
                    "score": 2,
                    "author": "fromaustt",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Time to get out",
            "score": 2,
            "author": "Custard_Mcgavin",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I've dealt with this my whole life. I totally get you and how shit it feels not having your own family understanding. Hang in there amigo",
            "score": 2,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Maybe next time you tell her how you feel tell her how she makes you feel . That’ll give her something to gossip about , being a bad mother . Fight back from her and the way she treats you and maybe you’ll be able to fight back from what your depressions doing to you .",
            "score": 2,
            "author": "dobby_is_freeeee",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Sorry to hear, that's awful. Here is what I would do: say something to her that makes her feel bad about having done this. Ex.: \"I heard you making of me on the phone and it made me feel like trash. Imagine me making fun of you like that.\" Then don't say anything else. She won't immediately apologize, so just let it simmer. Point is to make her feel bad and make that feeling stay with her. Even if she never flat-out says she's sorry, she'll remember how bad she felt on subsequent occasions, and this bad feeling will make it less likely that she'll act this way again.",
            "score": 2,
            "author": "SennheiserPass",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Have you been diagnosed? Go up to her and shove the medical documents in her face.",
            "score": 2,
            "author": "PyrrhicVictory7",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah I have officially diagnosed for a few years now but I’ve been depressed for as long as I can remember. \n\nShe genuinely believes I have nothing to be depressed about because I’m fed and housed. \n\nEven my own suicidal ideation is invalid to her. She’s told me they were just empty threats and I need to stop trying to seek attention.",
                    "score": 2,
                    "author": "fromaustt",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wow she's stubborn. \n\nI have another suggestion to offer, but it's rather dark...",
                            "score": 2,
                            "author": "PyrrhicVictory7",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I have suicidal thoughts everyday",
                                    "score": 2,
                                    "author": "fromaustt",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm so sorry you're being treated so poorly, she's completely disregarding your feelings and I find that repulsive. \n\nIs there anyone you can talk to about her? Maybe another relative might be more sympathetic and try talking to her on your behalf, seeing as she doesn't take you seriously. I hope things get better for you. Depression is hard enough without this shit :/",
            "score": 2,
            "author": "Dels79",
            "replies": [
                {
                    "level": 1,
                    "comment": " Nope. I feel alone in this situation because she’s so different with our family. Everyone thinks she’s wonderful but she’s a manipulative bitch who seems to find joy from my suffering. \n\nWhenever I tell people how she is, they brush it off like I’m being crazy. I have no one.",
                    "score": 2,
                    "author": "fromaustt",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I've felt like this before. I know it's fucked up but I've thought about how good of a revenge it would be if I would just off myself to \"show them\". Having thoughts like \"oh you think this shit is funny and not real?\" \"Let's see how much of a joke it is when you find me dead with a needle sticking out my arm, see who'll be laughing then\" It's fucked up but it makes me feel good for a minute when I have these thoughts in these situations. Makes me feel like I do have a way out if I'm really am ready to go.",
            "score": 2,
            "author": "beenalegend",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’d be a hypocrite if I told you not to kill yourself because I have daily suicidal thoughts. Please if you ever need to talk you can always reach out to me. It may not mean much but I’m sending love your way ❤️❤️❤️❤️❤️",
                    "score": 2,
                    "author": "fromaustt"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm really sorry about your situation. I've heard most of my family make fun of me, calling me gay, \"need to be in a group home\", etc. While they were cause of most of my problems. My mom alone nearly let me (and my siblings) die from various things, with no intention of helping us. Really sucks when the one group od people who are supposed to be there for you, are actually against you.",
            "score": 2,
            "author": "Bacongod239",
            "replies": []
        },
        {
            "level": 0,
            "comment": "It probably does. Non supportive or understanding environment is gonna make things worse, not better. For some, doing detective work on family background can help. Google and YouTube terms like: major depressive disorder, psychomotor retardation (where doing things like getting out of bed feels like work), etc.  It might help to see what’s happening to you vs “I’m a shit, I’m worthless, it’s not going to get better, etc.”. Might help to see family genetics, brain chemistry, environment are all influencing how you are feeling. It’s not YOU but how you are constructed and surrounded. \n\nPS - talking about it helps. Research shows holding it inside puts more stress on your system. It’s a no-win situation so if you can develop outlets, the better off you’ll be",
            "score": 2,
            "author": "Willie-Tanner",
            "replies": []
        },
        {
            "level": 0,
            "comment": "R/raisedbynarcissists or something like that (the name of the sub) can help u, it helps me to see others posts that I can relate to. I can also relate to u as well, my parents both think it's all in my head and that I create it all myself.",
            "score": 2,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Going through something similar so I can relate. I have a toxic abusive mother who had made me want to kill myself several times when I was in highschool. Physically and emotionally abusive. Now, in my early twenties, diagnosed with anxiety and depression, can't wait until I am financially stable enough to leave. You don't have to put up with that, family is not always blood.",
            "score": 2,
            "author": "judyz15",
            "replies": [
                {
                    "level": 1,
                    "comment": "Me too thank you. Sometimes we’ve just gotta find our families elsewhere. I try so hard to just not let it bother me but it’s quite difficult sometimes. Sending love your way ❤️",
                    "score": 2,
                    "author": "fromaustt",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Stay strong 🧡",
                            "score": 2,
                            "author": "judyz15"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I can understand where you're coming from, I've had the samething happen to me. Someone you love and trust, arguably the number one person you should be able to count on, and they betray you. I'm just starting to understand that there's nothing special about parents, that they're just people like everyone else. The worst part is you know how they're but can't help yourself from loving them, they could crush you in an instant and you could forgive them just as fast. Why? I'm still trying to figure it out myself.",
            "score": 2,
            "author": "discountweekend",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Welcome to the 'mums who aren't good at mumming' club",
            "score": 2,
            "author": "LinoLino321",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not too happy to be here I’m sorry",
                    "score": 2,
                    "author": "fromaustt"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lotta comments on here, you might not read this one but I’ll give my two cents nonetheless. \n\nI feel like our parents didn’t grow up knowing how impactful depression and mental illness as whole really is. They believe it’s a mindset, something that can be turned off if we really tried. \n\nI was diagnosed with severe depression and anxiety as a Junior in high school and my dad, to this day, tells me to “keep my mind clear” and to “not think bad thoughts”. He wanted me to get off the anti-depression pills as soon as possible (were pretty well off, I don’t think money was the issue). I ended up lying to my dad and therapist telling them that I’m alright now (I literally told my therapist that watching motivational videos on YouTube is what brought me out of depression and he bought it). I’m not alright LOL. \n\nI’m very sorry to hear that your mother joked about your depression. Our parents are supposed to be the ones who support us no matter what as well as be very focused on our wellbeing. For them to treat your illness as a joke is horrible and it’s obvious that she’d feel horrible if you ended your life early. \n\nI don’t think my father did anything as bad as what your mother did, but it can be said that both parents don’t really understand depression and its effects. Quite possibly, they may never understand. \n\nFrom here you have two options I think: first would be to separate yourself physically mentally emotionally from your mother. Hearing and knowing that she thinks like this is extremely detrimental towards your health and well-being. \nThe second option is what I do, pretend I’m not depressed when I’m with my family. Even if it means being fake as hell, I try to put on a happy face whenver im with my family. This can only be done if you have a strong support group who knows about your issues; good friends (of which I am so grateful to have). The second option is best imo because you never know when you’re gonna need help from someone. \n\nThis wasn’t great advice sorry lol. I hope you can figure this out and I’m sorry again that this happened to you.",
            "score": 2,
            "author": "KevmeloAnthiny",
            "replies": [
                {
                    "level": 1,
                    "comment": "I do appreciate the support and advice, thank you. My mother knows full well the extent of depression, she gets literally gets paid to care for other people.  I’ve also told her numerous times how I feel and how her behaviour hurts me, which has always been dismissed. Iv realised that I just need to seperate myself from her and know that I’ll never be able to count on her emotionally.",
                    "score": 2,
                    "author": "fromaustt"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm sorry that's happening. I've had similar situations with my own family and it still hurts years later.",
            "score": 2,
            "author": "jav545",
            "replies": []
        },
        {
            "level": 0,
            "comment": "My entire twenties were spent desperately trying to find a job that paid enough to get away from my family altogether. It took numerous fails but I finally got away.  You'll be able to do the same",
            "score": 2,
            "author": "OldSuperhero"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sounds similar to my mother, there are certain things she tells us to remain private because they’d make her look bad whereas she has no trouble with blabbing about me. I can’t stand it anymore.",
                    "score": 2,
                    "author": "fromaustt",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 2,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Sending love your way and I’m always a dm away ❤️",
                                    "score": 2,
                                    "author": "fromaustt"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wowwww. Friend, you are definitely not alone in this! This is so familiar to me. I’m sorry :(((( 💗",
            "score": 2,
            "author": "sugarkitten_",
            "replies": [
                {
                    "level": 1,
                    "comment": "I noticed one of these... :( \n\n\n\n So here take this... :D",
                    "score": 2,
                    "author": "smile-bot-2019"
                },
                {
                    "level": 1,
                    "comment": "Thank you and sending love your way ❤️",
                    "score": 2,
                    "author": "fromaustt"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Stay strong and believe in yourself. Fuck them toxic people in your life. You Deserve so much more and I feel very sorry for you like I wanna help you move out and deal with this kind of stuff. I've personally never had anything like that so I Don't really know how it feels but Family is Family and someone Talking down on you who is supposed to be there to support you is a horrible person indeed.",
            "score": 2,
            "author": "yellownarc",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Well, sounds like you don't get respect. So why give it? It sounds like you can't leave right now based on your comments, but you don't have to pretend to enjoy her company or the fact she is your mother either. Stay strong, and keep talking to people here on reddit, until you can get out.",
            "score": 2,
            "author": "Durakus",
            "replies": [
                {
                    "level": 1,
                    "comment": "She’s under the impression that purely based on the fact she’s my mother, she deserves respect. Meanwhile I don’t ever remember a time where she has shown me an ounce of respect. She doesn’t respect my boundaries, my privacy, nothing. I’m done with her. Thank you ❤️",
                    "score": 2,
                    "author": "fromaustt"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Love, atleast to me, isn't something we give but something that kind of just flows from us. I've been trying to get away from my family for years now, and I'm currently at their house and have spent more than I'd like to admit on them for the holidays. It's hard. I may not be able to give you the best advice but just follow you're heart, it will tell you what to do.",
            "score": 2,
            "author": "discountweekend",
            "replies": []
        },
        {
            "level": 0,
            "comment": "In my opinion, there are two different versions of family. Biological and chosen. I only consider Chosen family as real family. When you're able to surround yourself with what you need you end up getting better results. This doesn't mean happiness, god knows how hard happiness is to achieve, but it gives you a good support system.",
            "score": 2,
            "author": "AbundantM",
            "replies": [
                {
                    "level": 1,
                    "comment": "❤️",
                    "score": 2,
                    "author": "fromaustt"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hang in there until you can get out of there, then never look back. Don't fall into the trap of hating her or even caring about her, that'll only hurt you. Just think her like a random housemate you have been living with, you got no choice in the first place, she's crazy and you shouldn't be involved with her for as much as possible, disengage instead of trying to reason or bond with her, it's useless. Have strength and good luck.",
            "score": 2,
            "author": "turnipheadstalk",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Your mother sounds like a horrible person. If you're that much of a joke to her then there is no reason you should care what she says. Ignore her. Don't do shit that she asks you to. If she can't give you respect enough to take your illness seriously, then she doesn't deserve your respect at all.",
            "score": 2,
            "author": "detained-",
            "replies": []
        },
        {
            "level": 0,
            "comment": "My mother is the same. I tell her something important and secret, and say not to tell anyone. The next day her gossip pals will all know. I have no one to confide in.",
            "score": 2,
            "author": "BlessedBigIron",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Thanks for sharing, it's horrible to see how many people relate.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "That's so mean and childish of her. Sorry for You.",
            "score": 2,
            "author": "junior_raman",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I’m so sorry friend, you don’t deserve that treatment at all. I have had a very strained relationship with my mother as well due to her poor treatment of my mental health and it’s only just now getting better because I was able to leave home. The whole “blood is thicker than water” trope is BS. You are not obligated to maintain a relationship with anyone, especially if the said person treats you like shit. Like others said you will be able to leave one day, and the world will be much brighter. Until then try to hang in there, you’re important and strong as hell for going through this.",
            "score": 2,
            "author": "_Hxleigh",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Happened to me too. Still happens most of the time. Probably one of reasons why I don’t share anything with my parents.",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "❤️",
                    "score": 2,
                    "author": "fromaustt"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I highly recommend reading Complex PTSD by Pete Walker. The emotionally absent mother may also offer some interesting insights.  You do not deserve to be treated this way.",
            "score": 2,
            "author": "NickyRosen",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I just want to say that I’m so sorry you’re being treated this way. Your feelings are valid, not something to laugh about. It may not feel possible right now, but someday your mom won’t be able to hurt you anymore.",
            "score": 2,
            "author": "throwawayyyyyyeah",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I remember saying jokingly that I wanted to jump off the bridge. I was treated like a joke and told to do it instead of giving a support.",
            "score": 2,
            "author": "joxxhn",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s so crazy because I wouldn’t ever say that to another person let alone my own child. Which is why I find it so difficult to fathom how another person could say something so cruel. Sending love you way ❤️",
                    "score": 2,
                    "author": "fromaustt"
                }
            ]
        },
        {
            "level": 0,
            "comment": "thats the worst",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Fuck your mom. She is more fucked up then you are and is coping with it by putting you down and minimizing your feelings. It sucks and maybe will never change. The shitty part is that you are worthy and deserve a good parent. Get help for yourself and know you can’t change her",
            "score": 2,
            "author": "blinkrm",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Omg! What kind of mother is that? I have a son who is 21, and 2 girls ages 10 and 6.... I could NEVER do that to one of my babes. I am so sorry OP. You should not have to go through that. Hugs to you.",
            "score": 2,
            "author": "nicswifey",
            "replies": [
                {
                    "level": 1,
                    "comment": "Exactly. I wouldn’t even do this to a stranger. Thank you ❤️",
                    "score": 2,
                    "author": "fromaustt",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "My parents are the same. Any problem I come to them with they always make it seem small and gossip to everyone even after I tell them not to. Now a days I don't tell anyone and just go to the doctors or some other professional without telling anyone.",
            "score": 2,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I'm really sorry sweet, thats honestly horrible look it you need to talk im here.",
            "score": 2,
            "author": "Agorilee"
        },
        {
            "level": 0,
            "comment": "I'm in your exact situation! She makes fun of me with her boyfriend on the phone, saying things like \"she is lazy\" \"she never does anything\" \"she woke up very late\" and when I tell her to stop, she tells me she wasn't making fun of me and I am too susceptible",
            "score": 2,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "For starters, if they dont give you the emotional support or even respect at the least. Then don't expect much from them. Find someone who can fill that gap for you to carry on with your life, maybe a friend, a teacher, a coworker and anyone else, they can be your family in this case.\n\nDon't show them your weakness anymore, wear a facade and just pretend and show them that you're ok, an average person in their eyes enough to give them the benefit of the doubt. And then when the time is right, if you can support yourself, just leave without a trace. You're much stronger than you think. You dont need them in your lifr anyways. But dont decide rashly, they are still your biological family, they are obliged to help you just until you can support yourself. Take that advantage and prepare yourself, study, earn a degree  land a decent job and just cut them off in your life.\n\nImagine yourself in the near future, to the day you have moved out of the house, has a stable job, literally you can do what you want in life, looking back and laughing how you fooled them all these years, thinking that they thought your emotional distress was just a phase, but in reality you beat them all at once, including them.\n\nLet that distress fuel your will to carry on my friend. There are tons of things you can and want to do. Maybe do some spontaneous things like join a club that you least liked, talk to anyone from the class, engage with humanitarian work, randomly pick a hobby and stick to it, play a games that you normally dont play with. Dont be afraid to try something new. The least things you expect are usually the most interesting and rewarding.",
            "score": 2,
            "author": "emosinxrhenz"
        }
    ]
}