{
    "id": "f791jw",
    "score": 3765,
    "title": "The scary part about having depression is when you start to feel down it's hard to know if it's a temporary reaction to life or the start of a relapse",
    "author": "Sin2thevoid",
    "date": 1582279566.0,
    "url": "https://www.reddit.com/r/depression/comments/f791jw",
    "media_urls": [],
    "other_urls": [],
    "postText": "Basically what the title says and my current situation.",
    "comments": [
        {
            "level": 0,
            "comment": "Everytime things gets better i feel that everything will go wrong and will ruin this, its really annoying (sorry for my english)",
            "score": 332,
            "author": "SleepyTalent",
            "replies": [
                {
                    "level": 1,
                    "comment": "The worst thing about it is that this fear almost never fails to become true",
                    "score": 64,
                    "author": "Marvolo_Gaunt",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Almost like a self-fulfilling prophecy :/",
                            "score": 37,
                            "author": "thejaytheory"
                        },
                        {
                            "level": 2,
                            "comment": "Maybe it's like intuition of some sort, or maybe there's a difference between the way we feel down when stressed vs depressed and we get that fear when we can recognize that it is, in fact, a recurrence of depression.",
                            "score": 10,
                            "author": "larch303"
                        },
                        {
                            "level": 2,
                            "comment": "Sadly, this is one of the truest things I've heard in a while..",
                            "score": 3,
                            "author": "LynaaBnS"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Hmm.",
                    "score": 10,
                    "author": "arjungmenon"
                },
                {
                    "level": 1,
                    "comment": "And usually, the feel comes out of nowhere and then BAM depressed (again).",
                    "score": 4,
                    "author": "LambemuNang"
                },
                {
                    "level": 1,
                    "comment": "worse is doing (or not doing) things that make sure that it goes wrong.",
                    "score": 3,
                    "author": "matjam"
                },
                {
                    "level": 1,
                    "comment": "With everything will get better you mean you will get used to the pain",
                    "score": 2,
                    "author": "emme11245"
                },
                {
                    "level": 1,
                    "comment": "Dont worry, your English is nearly perfect.",
                    "score": 1,
                    "author": "reddittreddittreddit"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just be down all the time lol then you never have to relapse\n\n10 years and counting",
            "score": 184,
            "author": "nicklybob",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s what I do. It hurts but it works and it won’t affect you as much as if u felt better for a bit of time. I’m starting antidepressants tho so idk how ill react tbh I don’t want to but whatever.",
                    "score": 27,
                    "author": "Matt2382",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is how I exist. It’s an uncomfortably comfortable reality.",
                            "score": 22,
                            "author": "MissKhloeBare",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "ikr",
                                    "score": 7,
                                    "author": "Matt2382"
                                },
                                {
                                    "level": 3,
                                    "comment": "Reminds me of the song Comfortably Numb by Pink Floyd.",
                                    "score": 6,
                                    "author": "thejaytheory",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Are you gonna do anything abt the numbness",
                                            "score": 2,
                                            "author": "Matt2382",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I’m not sure but I want to.",
                                                    "score": 1,
                                                    "author": "thejaytheory",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "good luck",
                                                            "score": 2,
                                                            "author": "Matt2382",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Thanks",
                                                                    "score": 1,
                                                                    "author": "thejaytheory"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "What type of anti depressant u r taking?",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Lexapro why?",
                                    "score": 1,
                                    "author": "Matt2382",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I didnt take any before\nGonna start some testing maybe",
                                            "score": 1,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "it’s worked for me it just makes me kinda feel bad abt myself. I have to take a pill to fix something in my head",
                                                    "score": 2,
                                                    "author": "Matt2382",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I actually ironically found my root of the problem\nI talked to an old friend and suddenly i felt better how weird is that, ppl better than drugs, it’s weird",
                                                            "score": 2,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "the same thing kinda happened to me. It is weird like I know what could be some of the causes I just don’t know if I can do anything abt them",
                                                                    "score": 1,
                                                                    "author": "Matt2382",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "A big part of it is being lazy, like a draining void u have to get out of, running def made me feel better",
                                                                            "score": 2,
                                                                            "author": "[deleted]"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": " I think this quote sums it up perfectly. \n\n “For a long time in my life, I felt like I'd been living two different lives\nBecause the truth is, in the life that only I see, who I am, who I really am, is someone who struggles intensely with depression\nBecause there's this pretty popular misconception that depression is just being sad when something in your life goes wrong\nWhen you break up with your girlfriend, when you lose a loved one, when you don't get the job you wanted\nBut that's sadness, that's a natural thing, that's a natural human emotion\nReal depression isn't being sad when something in you life goes wrong; real depression is being sad when everything in your life was going right” - Kevin Breel",
            "score": 42,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;Real depression isn't being sad when something in you life goes wrong; real depression is being sad when everything in your life was going right” - Kevin Breel\n\nThis really hits home for me. Not that I take anything in my life for granted, all the good things just don't add up to happiness.",
                    "score": 13,
                    "author": "BujuBad",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Overall my life is kinda good. I got a roof over my head, I have a family that supports me, I'm financial secure, I have a bachelor's degree, I'm intelligent, creative and most people tend to like me, shit I'm even kinda attractive \nYet I still feel like a whole failure, I'm a mess. Most days I only focus on the things I could improve in my life or on all negative things even if it's an unimportant detail. It's like all the good things don't really count",
                            "score": 4,
                            "author": "Iwanttobea10"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Literally everything in my life is improving at the moment and I still feel like shit",
                    "score": 1,
                    "author": "Sin2thevoid"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I also feel you. I’ve found it really helpful to remember what depression is and isn’t (at least in my understanding - I have no medical or psychological training, just going off my own experiences). Feeling sad/down/some other negative emotions are a natural part of life and actually help us navigate the world. Sad/scary/other negative things happen in life and feeling negative emotions is a normal and helpful response. If my feelings correspond to the reality of what’s going on, I’m not too worried that my overall mental health has taken a downward spiral. It’s when my feelings don’t match whats going on that I take special note and maybe start to think about where I can find support if I need it. \n\nWhen my metal health was at its lowest point, I barely felt anything at all. Good things didn’t make feel good, sad things didn’t make me feel sad etc. Spent more of the time feeling numb - but negative feelings were easier to access so I would deliberately dwell on things of try and make myself feel awful, just so I could feel something. I now understand that pattern of thought as being something akin to emotional self harm, I had CBT (as well as being on meds) and it massively helped break the cycle. As I started feeling better, any kind of feeling was evidence that my mind was functioning better and my mental health was improving. Even negative feelings felt weirdly good, as I was able to see that they were appropriate responses to what was going on in my life.\n\nDon’t know if that’s helpful for you OP, but mainly wanted to say that feeling down isn’t necessarily a relapse and so isn’t necessarily something to be scared of. If by relapse you mean that you’ve felt worse in the past but are currently feeling better then it sounds like you will have learnt lots about yourself and your mood, so even if you do have something of a relapse you’re in a much stronger position to manage it well, know how to help yourself and how to ask for help.\n\nHope you’re doing okay :)",
            "score": 70,
            "author": "healsomadethestars",
            "replies": [
                {
                    "level": 1,
                    "comment": "Spot on!",
                    "score": 8,
                    "author": "Mom62"
                },
                {
                    "level": 1,
                    "comment": "Dude really well said!!",
                    "score": 4,
                    "author": "ElusiveGooser"
                },
                {
                    "level": 1,
                    "comment": "Do you have any resources for learning CBT if a therapist isn't accessible?",
                    "score": 3,
                    "author": "Leviosahhh",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 1,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thank you. I take meds now and I definitely have felt worse but this is how it always starts. I am actively trying to get through it and I am also a fan of CBT!",
                    "score": 1,
                    "author": "Sin2thevoid"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 18,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I feel that way constantly, but there are so many addicts in this area doctors won't even touch the benzo class. They just keep wanting to stack anti depressants. Then I get anxiety over wondering how I'm going to handle my next anxiety attack.",
                    "score": 1,
                    "author": "Leviosahhh"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm depressed for over 2 years now, (I am visiting psychiatrist and taking meds, so I suppose it actually is a \"real\" depression) but still every time I somehow menage to do something right, I feel like \"maybe I am overreacting? Do I even have a depression? Do I need those meds?\". And everything starts to look better, and then I am struck by life 2x harder than it should be, and I have no idea what I am doing wrong. Sometimes I feel like it's all pointless, but I know I need to fight. We all need.",
            "score": 14,
            "author": "Ziemniakol",
            "replies": [
                {
                    "level": 1,
                    "comment": "I feel this way too and I blame the meds for robbing me of my natural resilience...at least that's what I feel happened but of course, I can't be sure.",
                    "score": 1,
                    "author": "edtheroach"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I lost my shit recently, my cup literally poured over and I cried hysterically in my car for hours. Then I cried over happiness because I realized it wasn’t my depression, it was actually stress and sadness. As crazy as that sounds, I completely understand you... it’s so hard to decipher what your sadness really is, is it your condition or a natural reaction. From that experience I realized just like someone said in the longer comment- you will start to tell which is which when your sadness doesn’t match your current situation and you take note of it. It just sucks that it takes a couple episodes for trial and error lol. \n\nHope that kinda helps!",
            "score": 8,
            "author": "laurajamine"
        },
        {
            "level": 0,
            "comment": "I suffer from depression and one of the ways I fight back against it is martial arts training.  It's interesting how the body and mind correlate thoughts and feelings.  I bruised a rib a few months back and didn't even realize it for weeks because it felt very similar to the chest pain I feel when I get depressed.  I thought I was getting depressed again and started training even harder to fight it.  I kept pushing through it until it got so bad I couldn't breathe or bend over and I realized it was a physical problem.  My depression feels like a rib injury I guess.",
            "score": 9,
            "author": "Spectral_Crown"
        },
        {
            "level": 0,
            "comment": "I couldn't agree more",
            "score": 4,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I never let myself think that it's the norm. That was something I always told people in group therapy: *\"This is not the new norm\"*\n\nWe're all going to have episodes, but we can always keep going. We love you and support you. :)",
            "score": 3,
            "author": "TheEssentialEscapade",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's well said! It's all ebbs and flows and with that in mind, we keep going",
                    "score": 2,
                    "author": "Kasiana13"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was just thinking about the same thing and then I opened reddit only to see your post. \nI'm someone who is very sensitive and gets upset easily and for a very long time, I didn't believe I was depressed. Now I know that the constant heartache I was having was a big signal that it was indeed depression. For some time the pain is gone and I only feel it from time to time, this reassures me I'm in the clear.\nBut in those moments when it does come back, I get anxious and scared. I just try to remember it's temporary, it will go away, it should..",
            "score": 4,
            "author": "Kasiana13"
        },
        {
            "level": 0,
            "comment": "I feel you, this is was me everyday when things started to seem to be getting better. Best of luck to you bruv",
            "score": 6,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "At this point feeling down is an optimal state for me. When things get better - that’s when I’m on guard cause i know that shit’s gonna go down eventually, sooner or later.",
            "score": 3,
            "author": "Logan7887"
        },
        {
            "level": 0,
            "comment": "same, have I just been having a hard time these past few weeks or am I having a relapse??? The world may never know, good luck",
            "score": 3,
            "author": "kitkat0480"
        },
        {
            "level": 0,
            "comment": "Very relatable to many I suspect.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Literally me rn. Much love and peace to you my dude. Hope it passes quickly.",
            "score": 2,
            "author": "Squishy_3000"
        },
        {
            "level": 0,
            "comment": "i feel this in my soul. Its like living on a knife edge with constant anxiety and fear never knowing if its just an off day or if its the start of something really bad. \n\nif you need someone to talk to i'm here",
            "score": 2,
            "author": "InfinantN1nja74"
        },
        {
            "level": 0,
            "comment": "I’ve just learned to not care anymore",
            "score": 2,
            "author": "OGWhyYouBoolinMe"
        },
        {
            "level": 0,
            "comment": "1000% same, I say this all the time.  Another scary thing is knowing that your happiness is finite and that another relapse is inevitable",
            "score": 2,
            "author": "throwawayLIguy"
        },
        {
            "level": 0,
            "comment": "This is literally how I feel right now. I've been off meds for over a year but recently I feel like I'm relapsing again but at the same I'm not sure if it's just a temporary thing, and I'm terrified because I seriously do not wanna feel like that again.",
            "score": 2,
            "author": "nousername679"
        },
        {
            "level": 0,
            "comment": "I think about this a lot. I have spurts of 'consciousness' where I am happy and almost in third person like, 'this is different'. Problem is, instead of enjoying the natural happiness, I start worrying about when the depression and sadness will hit again.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "This. I recently finally went off meds and have slowed down my therapy but whenever I get down or having a week where I'm too tired to do much, there is a little voice that panics thinking I have relapsed.\n\nSomething that helped was she went over the Mind Over Mood depression test with me. We did that when I was first seeing her, and when I had a really bad spell (after getting better). She did one again with me, pulled out my old ones and we compared them together. With the newest one, yes there was some mild underlying \"depression\" things and 1-2 things to keep and eye on, but she reminded me I was doing way better. Even if there is an underlying here, as long as it doesn't get worse, I'm still on my way to recovery. It made me feel heaps better.",
            "score": 2,
            "author": "Amyishida"
        },
        {
            "level": 0,
            "comment": "It's terrible, I know.\n\nYou feel as if you can never tell what kind of day it's going to be.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I can totally relate to that feeling, and of course we typically go with thinking it’s going to be the worst case. I’ve learned to not question it so much and just go with it, whatever it’s going to be. I try to stay active, distracted, force myself to move and stay connected to the outside world and people that care about me in some way.",
            "score": 2,
            "author": "renfinite"
        },
        {
            "level": 0,
            "comment": "Currently me...i feel like I'm going insane. None of it makes sense. I start counseling again on Sunday. It's hard trying to express this feeling. Only thing that comes to mind is numb. My thoughts and memory is shit. I hate work to the point I haven't been getting there on time, call in. I have no friendships and I'm barely present for my kids. Its an exhausting routine.",
            "score": 2,
            "author": "patc0214"
        },
        {
            "level": 0,
            "comment": "I’m trying to practice living one day at a time.  Mind you a day can start great and one small thing crushes me.  So there’s that.",
            "score": 2,
            "author": "pinkbug76"
        },
        {
            "level": 0,
            "comment": "I like to tell myself if I could make myself get better before, I can do it now. It make take weeks or months but I will do it. Often depression feels like an endless cycle of recovery and relapse, but if those periods of happiness exist I'll stay around for them, and maybe one day that happiness will stay for a long time, and bad moods will just be bad moods instead of relapses.",
            "score": 2,
            "author": "knockdownthewall",
            "replies": [
                {
                    "level": 1,
                    "comment": "It feels like an endless cycle. With meds I stay up longer but I still relapse sometimes and it sucks",
                    "score": 1,
                    "author": "Sin2thevoid"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Oh God I know what you're talking about. I'll be like \"is this just for today or is this the start of a slump that'll last for months?\"",
            "score": 2,
            "author": "ineedtostopcaring"
        },
        {
            "level": 0,
            "comment": "I’m currently in the relapse phase, and it is not a fun place to be.",
            "score": 2,
            "author": "gamergirl10101"
        },
        {
            "level": 0,
            "comment": "I hear this. A year ago I thought my meds weren't working because some stuff had happened and I was getting depressed. Ended up going off those meds and trying 6 different meds that didn't work only to go back to what I was on a year ago and feel better again. It was a temporary reaction to life - not a depressive episode. Next time something like that happens - gosh I hope never of course - I won't be so quick to change meds.",
            "score": 2,
            "author": "stacy_sly"
        },
        {
            "level": 0,
            "comment": "I think my worse is when happiness anxiety kicks in. As in ive had such dreadful events happen not long after a happy one that I get high anxiety from being happy. Like if I'm happy someone I care about will die or meet a bad situation. After I told my therapists all the bad things that happened in chronological order she said \"you've seriously had a streak of unfortunate events\". Couldnt have been more closer to the truth than that.",
            "score": 2,
            "author": "cbunni666"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Removed.  There's even a sticky post right now about inviting private contact.",
                    "score": 1,
                    "author": "SQLwitch"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m forever feeling down so when things go wrong I make sure I try to stay grounded",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I'm currently in this loop right now. Am I sinking into depression due to this being the time of year that my life took a horrible turn back in 2016 and 2012 ooor...am I about to sink into another horrible, suicidal depression despite things being fine. WOO WHO IS EXCITED TO FIND OUT!",
            "score": 1,
            "author": "Sunnyhunnibun"
        },
        {
            "level": 0,
            "comment": "Damn someone said it",
            "score": 1,
            "author": "isolatedleaf"
        },
        {
            "level": 0,
            "comment": "That’s me except for me, when I’m happy is when I get worried. I worry if it’s just a manic episode or if I’m truly getting better.",
            "score": 1,
            "author": "Be_Eze"
        },
        {
            "level": 0,
            "comment": "Omg yes right which in turn can become a violent cycle",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Its like in Mario Brothers. It's a new wall to jump over, a new pipe to slide down. You'll get to the end eventually, and completely intact. Don't worry.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Ahh, my favourite game. Hitting the gym more often, or even just moving can get endorphins going for you, hope things go well",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "And when you feel decent, it seems like a trick.",
            "score": 1,
            "author": "spei180"
        },
        {
            "level": 0,
            "comment": "this hit me hard.",
            "score": 1,
            "author": "wiegehtsss"
        },
        {
            "level": 0,
            "comment": "Currently me.",
            "score": 1,
            "author": "cali1993"
        },
        {
            "level": 0,
            "comment": "Yes!!! I have a permanent fear of relapsing. Depression ruined my world twice. I do not want to go through it again. Although I’m still depressed, I am functional. And I am terrified of becoming unable to function again.",
            "score": 1,
            "author": "doitfortheclout"
        },
        {
            "level": 0,
            "comment": "Every time it gets bad again, it's hard to remember if it'll ever get better. \n\nThen it always does, for at least a little while.",
            "score": 1,
            "author": "BraveLilToes"
        },
        {
            "level": 0,
            "comment": "Scariest part of Deppresion for me, is you cant look back for happy moments because deppresion finds a way to corrupt it\n\n\"Hey there is me and my friend haley\"\n\n\"Haley cut herself for years and you didn't do anything about, its your fault she bled out with slit wrists\"",
            "score": 1,
            "author": "godlyhaxx"
        },
        {
            "level": 0,
            "comment": "i don’t think i have distinguished the difference between depression and reactions to life. they seem to mesh together into one giant ball of shame and despair",
            "score": 1,
            "author": "easyB8"
        },
        {
            "level": 0,
            "comment": "Does anybody else walk around how do I look like a big truck passes by ears think I bet my head could founder there but you only have a thought for like a Split Second and it weird you out",
            "score": 1,
            "author": "ANGULARKILLFACE"
        },
        {
            "level": 0,
            "comment": "Saved",
            "score": 1,
            "author": "Vonte958"
        },
        {
            "level": 0,
            "comment": "The thought of it brings me to tears and I’m not exaggerating. Reading the title has me crying out of fear. I’m so scared of relapsing. I’m terrified. \n\nI’ve been a whole year without antidepressants. A whole year not feeling like everybody would be better off without me. And I’m so scared of relapse.",
            "score": 1,
            "author": "TaurusWoman33"
        },
        {
            "level": 0,
            "comment": "Its always temporary just very hard to see your way out of it. \nI'm struggling with depression too but through consistently trying to improve my point of view the day to day slightly improved. \nSomething about the way we were brought up through our experiences we develop our owne way of perceiving different situations. I feel like we can improve on this by acknowledging where our sadness is coming from and working to improve our reactions. Also exposing yourself to new experiences help to change your point of view. Get out of your regular day to day that might be supporting you negative habits or reactions. \n\nIt's been about 2 years for me where I'm trying hard almost every day to make improvements and I'm only really now seeing slight improvements. \nSo be diligent but remember to love yourself for who you are dont think to much about the past or future and focus of what's making you happy today",
            "score": 1,
            "author": "NoM_Gnarly"
        },
        {
            "level": 0,
            "comment": "I usually know before i start to relapse. But i still freak out if i feel down, if its only a reaction",
            "score": 1,
            "author": "tellmeitsanightmaree"
        },
        {
            "level": 0,
            "comment": "I don't that's really the right or most helpful distinction.  \n\n\nDepression doesn't exactly make you sad. It makes you more VULNERABLE to a downward cycle when something \"triggers\" you. And when you've been down that road multiple times, it's easier to fall back into those patterns. (Of course, this is an oversimplification too)  \n\n\nEvery upset could be the start of a relapse. Practice self-care. Stay active!",
            "score": 1,
            "author": "FlocculentFractal"
        },
        {
            "level": 0,
            "comment": "it’s best not to think about it, thinking about it just feeds it, makes it worse, at least in my experience, doesn’t hurt to try.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I feel that very often. I don't even know the root caught cause but when i'm alone...",
            "score": 1,
            "author": "kev024"
        },
        {
            "level": 0,
            "comment": "I'm 54, 3 bouts of major depression over the last 20 years, and at 1500 hours of therapy. With practise you can actually get pretty good at telling what's an appropriate emotional reaction and what's depression.",
            "score": 1,
            "author": "Thegreatgarbo"
        },
        {
            "level": 0,
            "comment": "There are relapses!?!!! Are you kidding me?! I'm just starting to feel better!",
            "score": 1,
            "author": "ravenclawhouseelf",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yup.  Unfortunately, they tend to get worse each time.  At least in my experience.",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Fuck.  This really is gonna be what ends up killing me, isn't it?",
                            "score": 2,
                            "author": "ravenclawhouseelf",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I struggle with that thought.  I’m 42 and I’ve lived with this since I was 10.  I’ve been through countless relapses, some of them severe.  I’ve gone though countless meds - Zoloft, Wellbutrin, Effexor, etc.  You gotta have a support system. For me that’s my family, my therapist, and my doctor.  I just keep showing up and I think that’s what keeps me alive.",
                                    "score": 1,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I know right!",
            "score": 1,
            "author": "LunaZamora"
        },
        {
            "level": 0,
            "comment": "Can totally relate",
            "score": 1,
            "author": "theWanderer_420"
        },
        {
            "level": 0,
            "comment": "True. And when you start to get better, you question yourself, do you really have depression or are you just lazy.",
            "score": 1,
            "author": "suppressed_howl"
        },
        {
            "level": 0,
            "comment": "And you become weary of your moments of true joy. You can’t even enjoy them because you’re afraid the downfall will be even worse. You question whether you’ve ever genuinely felt happy. \n\nIm making a point of writing down little moments where I have been because it’s impossible to recall from memory apparently.",
            "score": 1,
            "author": "tinathetalkingtumme"
        },
        {
            "level": 0,
            "comment": "I am dealing with this right now. I feel myself sliding down that deep, dark hole.",
            "score": 1,
            "author": "bmomtami"
        },
        {
            "level": 0,
            "comment": "I know!  I always do my best to recognize the early signs and pull myself out.",
            "score": 1,
            "author": "TinkerTyler8"
        },
        {
            "level": 0,
            "comment": "When I start to feel down I have to control my thoughts and not think of other things that will worsen my mood. If I don’t do this, then a “snowball” effect starts to happen and pretty soon I’m depressed about everything and in the middle of a relapse. :\\",
            "score": 1,
            "author": "kenziemay29"
        },
        {
            "level": 0,
            "comment": "It’s like walking a tight rope.  \n\nEvery day.\n\nFor every little thing.\n\nOh, and it’s on fire too.",
            "score": 1,
            "author": "plottingvengeance"
        },
        {
            "level": 0,
            "comment": "The first time I could recognize one of those dark weeks ahead of me, I couldn't avoid repeating the phrase  \"A momentary lapse of reason\" over and over in my head, and remembering that image of a person in front of it self burning alive...",
            "score": 1,
            "author": "AleksandraLisowska"
        },
        {
            "level": 0,
            "comment": "Oh my god this speaks to me on so many levels. I've been hyper vigilant lately. So I feel like it turns into me talking about how I'm sleeping more or how my internal monologue had gotten increasingly darker. Which leads my therapist to treating symptoms I think? IDK. So far I'm still handling it. But it's like propping up a cake with my hands. I get one side but chunks keep slipping. Now I'm getting weird about eating. And dude's probably going to suggest eating healthy or something. Just GAH",
            "score": 1,
            "author": "redbottleofshampoo"
        },
        {
            "level": 0,
            "comment": "Being medicated for the last 6 years or so, I no longer have this fear. I have times of being a bit flat, but no longer any deep depressive episodes.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Haha yeah",
            "score": 1,
            "author": "Adumdabum"
        },
        {
            "level": 0,
            "comment": "I'm at that point right now, I think it's a long way down from here for the foreseeable future.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I feel this very hard. I get angry first and easily agitated. I try not to take it out on people but I try to figure out what's wrong so I can stop it.... it's really hard for me to pinpoint which makes me get reckless, more frustrated with myself, and suicidal, then just lazy cause I dont wanna move. This is me now and I dont wanna be a ball of self hating sadness &amp; fury.",
            "score": 1,
            "author": "rougeCheezit"
        },
        {
            "level": 0,
            "comment": "I think im spiraling down again rn. It happens every semester which means theres a pattern. I know these things i feel are just my brain and do not accurately represent the real world but that doesnt make it hurt less.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "im feeling really down right now, idk what to do.",
            "score": 1,
            "author": "barrerahigh"
        },
        {
            "level": 0,
            "comment": "Since I got it I have had crazy mood swings, mostly crying which is something I don't do very often since I am very closed off emotionally and i only cry when I'm drunk. But after hearing that this stays with you your whole life and you can relapse I cried more than I have my entire life. I have only been depressed for like half a year and I'm already tired of this shit, to think I can be doing great later on and it could just hit me again is not something I wanted to hear.",
            "score": 1,
            "author": "fakenews2323"
        },
        {
            "level": 0,
            "comment": "At this point, I think I'l always be prone to having depressive tendencies. Whenever my friends and I watch a sad movie st the cinema, they cry and shit but get over it real quick, and I'm left with a heavyness in my stomach and an awful fucking feeling of sadness that makes me want to go to bed for a week straight. I can't handle sad songs or films or books. I guess that's just the way I operate, but I don't think it's normal. I already recovered, though, so these episodes aren't that frequent. However, evert time I suffer from one, I wonder if I'll be easily triggered for the rest of my life",
            "score": 1,
            "author": "PoseidonsCoffee"
        },
        {
            "level": 0,
            "comment": "Whenever I think that I am feeling good or happy, I'm scared and automatically think that I'm faking everything and then I get depressed. Not funny at all. It's like I can't enjoy happiness because I think I don't deserve it?",
            "score": 1,
            "author": "Pole-Slut"
        }
    ]
}