{
    "id": "fjthj0",
    "score": 3070,
    "title": "My therapist finally convinced me to start getting out of the house and this shit happens.",
    "author": "morphotomy",
    "date": 1584396584.0,
    "url": "https://www.reddit.com/r/depression/comments/fjthj0",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm never going to get better why the fuck should I even try.",
    "comments": [
        {
            "level": 0,
            "comment": "hey, chin up. you can still go on walks. i’ve been going on walks lately and it’s scientifically proven in several different ways to make you happier. seeing the beauty of nature is great. try to find paths or forests!",
            "score": 516,
            "author": "pp15420",
            "replies": [
                {
                    "level": 1,
                    "comment": "I just want to be social again. I've been isolating myself for almost 3 years. If if do that I'll just be isolated next to a tree.\n\nI had hope this time and I'm beginning to wonder if this is all a joke and what the fucking punchline is.",
                    "score": 382,
                    "author": "morphotomy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Isolated next to a tree made me lol. Too fucking true.",
                            "score": 123,
                            "author": "_meowedith_"
                        },
                        {
                            "level": 2,
                            "comment": "The universe has no consciousness; this isn't a joke or a message. It's just unfortunate timing. Use this time to build up hype for being social. Get yourself psyched, once this is all over, you'll be more than ready.",
                            "score": 130,
                            "author": "Hero667",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This is really interesting, care to elaborate?",
                                    "score": 3,
                                    "author": "KaskyNightblade",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "On which part, the universe or the hype?",
                                            "score": 1,
                                            "author": "Hero667",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The whole thing",
                                                    "score": 3,
                                                    "author": "KaskyNightblade"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Sunlight is scientifically proven to raise your mood, even in small doses. If you can let sunlight hit your skin for just 30 mins a day, over time you may notice a difference in your energy, and chemicals in your brain will start to level out :)",
                            "score": 38,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I started do a run for 30 mins a day, and weights every second day, I take meds also. I haven’t had any benefit other than I lost weight and got a singlet tan. I’m still extremely depressed and unable to socialize.",
                                    "score": 8,
                                    "author": "SnOwYO1"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Maybe it’s the universe telling you you need to gradually integrate yourself back into society.. I mean.. how crazy is it that you get to go outside AND not be surrounded by a shit load of people? I’ve honestly been going on walks too, and it hasn’t been triggering my anxiety at all. It actually feels nice just to get out and breathe some fresh air.. idk.. doesn’t hurt to just do it",
                            "score": 63,
                            "author": "IRLBearsBeetsBSG"
                        },
                        {
                            "level": 2,
                            "comment": "i feel that man and it sucks for all of us but we just gotta push thru the bs",
                            "score": 7,
                            "author": "pp15420"
                        },
                        {
                            "level": 2,
                            "comment": "Feels but I suck at socializing",
                            "score": 4,
                            "author": "Chmilona"
                        },
                        {
                            "level": 2,
                            "comment": "If you’re into games try find a LFG for a team based game. Not just some online casual, but something that REQUIRES teamwork (like a Destiny raid for example) and just find a group of people in LFG. Being forced to work together helps form connections if you’re allowed to deviate from the task (unlike school sometimes where they discourage randomly talking about off topic life).",
                            "score": 5,
                            "author": "-BlueDream-",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No offense but I don't really enjoy video games. I'm a very tactile person. I'm not very good at football but I love playing it.",
                                    "score": 3,
                                    "author": "morphotomy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You can do the same with sports but I’ll wait till COVID is over. Sports games are cool if you like the game itself or social media groups dedicated to sports",
                                            "score": 1,
                                            "author": "-BlueDream-"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I've wondered if I'm already in he'll.",
                            "score": 4,
                            "author": "toomanydiagnoses",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "In hell. Fucking spell chk.",
                                    "score": 3,
                                    "author": "toomanydiagnoses"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I feel this in my soul dude. It's really tough and I'm going thru the same thing. You gotta try ur best to push yourself or it will only get worse. Sometimes I walk in the park w my dog just so I can say hi to strangers and then keep on walking, or talk to the people at the cashier when I get my food at certain places. It's not much but its deff better than isolating completely. Best of luck to you (:",
                            "score": 3,
                            "author": "louied862"
                        },
                        {
                            "level": 2,
                            "comment": "You know that you don't have to ohysically interact with people to be social, right? I mean... Social media - it's in the name",
                            "score": 2,
                            "author": "Netalula"
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 2,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I really love this and needed to hear it. Thank you",
                                    "score": 2,
                                    "author": "[deleted]"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Idk what country you live in, but in the US there is nothing that says you can’t go hangout with a couple friends right now.",
                            "score": 1,
                            "author": "_A_Day_In_The_Life_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hanging out isn’t essential or an emergency. Some\nPlaces only allow travel for work or essentials like getting food",
                                    "score": 6,
                                    "author": "-BlueDream-",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "i'm personally staying home and none of those things you mentioned are happening in the US right now which is why i mentioned the US. If the guy wants to go hangout with one or two friends i don't see the problem. i'm personally not going to, but if this person really feels like they need to to get out of their funk then i understand and wish them well and hope the people they hangout with aren't sick.",
                                            "score": 4,
                                            "author": "_A_Day_In_The_Life_"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Social how? If you want to meet with friends try video chatting, helps me sometimes.\n\nIf you want to meet strangers, you can use bumble friends or something else. I know these aren't ideal, but it's a makeshift solution for now.\n\nNot sure how long this thing will last but better get something done in the meantime. Hope it works out, rooting for ya!",
                            "score": 1,
                            "author": "harsh2193"
                        },
                        {
                            "level": 2,
                            "comment": "Go on the internet and find internet friends to talk to. Yeah it’s not the same as interacting in person but you’ll still be social. If you’re into video games there’s subreddits to find people to game with. I’ll even add you if you’d want. I have everything except pc.",
                            "score": 1,
                            "author": "igotbannedforh8mail"
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "A series of tough relationships and breakups.",
                                    "score": 2,
                                    "author": "morphotomy"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Well trees are good companions for aesthetic comfort.",
                            "score": 1,
                            "author": "AkhenatonTomb",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's true. And trees don't make you feel awkward or ask difficult questions, like \"what's wrong?\"",
                                    "score": 2,
                                    "author": "VoteForBernie2020"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "There is no joke or punchline. Keep trying to get out there. There is no elaborate scheme to keep you from finding happiness. Your time will come! Keep your head up.",
                            "score": 1,
                            "author": "VisitorFromC-137"
                        },
                        {
                            "level": 2,
                            "comment": "         Yeah, I understand how you feel. I’m the same. My mom forces me to do things like go on runs. They do get my endorphins flowing, but my trick is to do it at about 5-7 am and then no one is around. Usually, I don’t have the motivation to though. Everyone who knows me says I’m really fast, but I have no motivation. Just sadness, anger, and anxiety, inside a shell of happiness, optimism and excitement. \n          I have to act happy, or else everyone will worry. My motivation to do things drop more every day. You’re not alone on this, but I encourage you, at least try going outside, early in the morning when no one is around, and you can do whatever you want, walk, run, skip, no one cares. But most importantly, only do it if YOU WANT TO.",
                            "score": 1,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "Another month should be easier for you than the rest of the world right?",
                            "score": 1,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "The same thing happened to me I finally started to get out more and then this happens. I feel like this is some cruel joke haha",
                            "score": 1,
                            "author": "lordfarquad0517"
                        },
                        {
                            "level": 2,
                            "comment": "This is actually a great time to be social.\n\nMessage all your family and friends to let them know that you are thinking about them and they mean a lot to you. Ask them if they need anything. \n\nI hate to say it, but your loved ones might be in worse situations then you. Helping them will make you feel great",
                            "score": 1,
                            "author": "kbwavy"
                        },
                        {
                            "level": 2,
                            "comment": "Ah hush , just some bad luck it will blow over what’s  another few weeks",
                            "score": 1,
                            "author": "rezpector123"
                        },
                        {
                            "level": 2,
                            "comment": "If you've been isolated for 3 years that means you've been preparing for this lol. Sounds like you're just making an excuse out of coronavirus to become bitter and give in on your depression to not socialize.  Call an old friend, you don't even have to go outside.",
                            "score": 1,
                            "author": "RCmies"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yep walks help so much!",
                    "score": 2,
                    "author": "GatitoAnonimo"
                },
                {
                    "level": 1,
                    "comment": "I used to live near a forest, I would walk and map it out. The i found a dead body....I was scared but did it make an excellent manp name and icon...",
                    "score": 1,
                    "author": "KazTheRedditor"
                },
                {
                    "level": 1,
                    "comment": "I agree.  I have been trying. But I have Lyme disease and my last walk made me sick cause everything makes me sick. I got a chill from the wind and that was it for me for 3 days.",
                    "score": 1,
                    "author": "thejadebirdco"
                },
                {
                    "level": 1,
                    "comment": "Chin up? Lol wow I’m cured",
                    "score": 1,
                    "author": "candykappers",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "you’re welcome",
                            "score": 2,
                            "author": "pp15420"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I've started hitting the gym HARD after a few months hiatus and it's done wonders for me. Now of course a fucking global pandemic just happens to shut down every gym in my area until further notice. Weird weird times we're living in right now.",
            "score": 138,
            "author": "IO_you_new_socks",
            "replies": [
                {
                    "level": 1,
                    "comment": "Workout at home. I know u might feel like it's not nearly as effective but look into time under tension. Even a basic pushup u can make ur chest get an amazing workout with if you focus on ^. Dips, pullups, situps and my most favorite.... hand stand pushups against the wall. Literally one of the most under rated exercises.",
                    "score": 45,
                    "author": "YoungLords12",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I actually have a very very old and dusty set of free weights that I’m gonna have to bust out. I can improvise with bench pressing/deadlifting, but I have no way of squatting safely with my equipment. The biggest thing I’ll miss is the routine of actually going to a gym and training, but I’m sure I’ll make do!",
                            "score": 16,
                            "author": "IO_you_new_socks",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Honestly, when I'm forced to workout at home or revert back to body weight exercises, it's kind of nice. Remind me of why I got into lifting. Haha",
                                    "score": 3,
                                    "author": "YoungLords12"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yes! I use the Nike Training App, if anyone is looking for a free app to help find exercises. They have every workout you need.",
                            "score": 1,
                            "author": "draconawarrior"
                        },
                        {
                            "level": 2,
                            "comment": "I am working out at home now but it's just not the same. Can't replicate heavy squats/deadlifts without weights :/",
                            "score": 1,
                            "author": "URETHRAL_DIARRHEA"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Same. Nearly broke my record on bench press the day before every gym had to close. It's tough, because the routine is a big part of what kept me going, I feel so tired and unmotivated to improvise something at home now.",
                    "score": 5,
                    "author": "kmmeerts",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "body weight training is the good shit though!   \n\nyou should try it",
                            "score": 1,
                            "author": "throw-away_catch"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I go to Planet Fitness and they are offering free online live workout classes to members and non-members. If you're interested I can comment the link?",
                    "score": 8,
                    "author": "torma37"
                },
                {
                    "level": 1,
                    "comment": "Buy some dumbells and maybe a cheap bench!",
                    "score": 1,
                    "author": "SwoleKylo"
                },
                {
                    "level": 1,
                    "comment": "Same shit here. It fucked up all my progress. I have no motivation to exercise in house. It's totally different than gym",
                    "score": 1,
                    "author": "khyriah"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Dude, you got this. While everyone else is losing their mind not knowing what to do to stay away from people, you can do two weeks of this standing on your head. \n\nYou’re not cursed, you’re Bane.",
            "score": 52,
            "author": "cleric3648",
            "replies": [
                {
                    "level": 1,
                    "comment": "I actually want to see people I'm just very embarrassed about the extreme lack of self care.\n\nI finally got a haircut and washed my clothed the other week for the first time in god knows how long. Now I guess I don't need to do that ever again.",
                    "score": 24,
                    "author": "morphotomy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Nonsense, you’ve got a couple weeks to try new things. Wear your hair differently, try different outfits, use different grooming stuff. Dye your hair some crazy color, and at the end of the quarantine see what you like the most. This is a practice run. Have fun with it.",
                            "score": 26,
                            "author": "cleric3648",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'll probably end up not showering until i have a reason to see a person again and feel embarrassed about not having clean pants.",
                                    "score": 6,
                                    "author": "morphotomy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Listen. Did getting up this morning to shower feel good to you? It must have, because you were pumped to go out. \n\nassuming it did, imagine how you would feel doing it every other day. When I feel miserable, I purposely take a shower to at least feel somewhat productive and good about myself. It builds my confidence. It makes it easier to socialize. So even tho this pandemic is hitting, it’s a good opportunity to practice self care and self love which in turn will make life easier in the future. You want to have a habit of good hygiene set if you want to engage in relationships. \n\nAlso, if anything, we are all in this together. It might feel lonely, but i’ve noticed that people are banding together in communities more to lift spirits up. Try and find a way (such as a community fb group) to pitch in to support ppl. In my area, people are supporting seniors who need help getting supplies from the store. Once again, your hygiene would need to be top notch for this to prevent spread.\n\nNot being able to go out today doesn’t mean things are over for you. You can work on other parts of your life and figure out how you fit into your community. There’s huge opportunity to build networks and friendships thru this catastrophe thats hitting. We all need one another.",
                                            "score": 16,
                                            "author": "throwitawaybyee",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I didnt shower today",
                                                    "score": 1,
                                                    "author": "morphotomy",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Oh oops sorry i misread your initial post then. Well if you didn’t shower today - then that’s completely ok too though!! Once you create a habit of it, it will get easier but you don’t have to force yourself to do it. Depression sucks. You’ve battled half the demon though by getting a haircut and showering last week....you were able to actually motivate your mind to do that. Once this blows over....you will already have done some of that internal work on yourself and you will be miles ahead of where you used to be. I think you’re simultaneously feeling defeated and anxious, and i don’t blame you. But recognize that these are temporary emotions guided by temporary situations. To put things into perspective - everyone is in lockdown. We have all had to put our lives aside. We all have to part ways with friends. We all have to isolate. This isn’t happening just to you because only bad things happen to you - this is happening to all of us. There are people who were expecting babies, people expecting birthday parties, people expecting new jobs, people who wanted to go on vacation. This is not about you only. And i want to so deeply emphasize that because like I said, our communities are going to have to band together to overcome this. Where i live, people have already begun to be friendlier to one another, more open to helping. It is bringing out our compassion. You will find the helpers in this chaos. Maybe you’ll become one yourself.\n\nPs i hope i wasn’t too harsh in this. I wasn’t trying to offend you in any way shape or form ❤️. I can tell that you are just tired of being alone, rightfully so. Just wanted to provide some feedback that popped into my head. Feel free to ignore if you want to lol!",
                                                            "score": 4,
                                                            "author": "throwitawaybyee",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I feel more than defeated. I feel like my spirit is dead and I'm just going through the motions while I wait for my body to catch up.",
                                                                    "score": 1,
                                                                    "author": "morphotomy",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "This is a really big loss. You feel completely exhausted and disconnected from yourself...and maybe socializing was finally a way to gain some normalcy back in your life. Does that make sense?",
                                                                            "score": 3,
                                                                            "author": "throwitawaybyee",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "I just wanted to get out and start meeting people. My ex left over a year ago and I have barely seen the sun since.",
                                                                                    "score": 1,
                                                                                    "author": "morphotomy",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I've heard that not showering for a bit before using hair dye is a good idea so might actually be a great time to try out a color you've always thought about (:",
                                            "score": 6,
                                            "author": "LongLiveFlaggyFlag"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I've gone without showering for more than a month at one point. Didn't get my clothes washed for 8 months until my contact at Social Services decided I needed to get my entire apartment cleaned and my clothes washed and hired a company to do so.   \n\n\nIt takes time to change things around. But that's what you've got now. Make a little effort each day to take care of yourself, go for a walk in a nearby park and see others doing the same. Slowly build some daily routines and selfcare into your daily habits again and when this whole lockdown thing blows over, you'll hopefully feel better about yourself, already having developed that habit of selfcare that makes it a bit easier to be social.",
                                            "score": 5,
                                            "author": "[deleted]"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "🏅",
                                    "score": 1,
                                    "author": "LongLiveFlaggyFlag"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Same here. I’m so worried it’s gonna negate all the work I’ve put into getting better and I’m gonna have to relearn all this shit",
            "score": 27,
            "author": "ChloriNed16",
            "replies": [
                {
                    "level": 1,
                    "comment": "I really just want to give up. There is literally now nothing I can do.",
                    "score": 6,
                    "author": "morphotomy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well, you're talking to us. And while my outlook my be almost as bleak as your own, I came here looking for something, and it's not much, but at least I know that I'm not the only one feeling this way. I should be socialising (through media, phone, text) with the few people that I actually know and have some kind of connection with, but I don't want to bring them down, and I don't think they can help anyway. But I'll try to keep showering, and doing whatever-I-can-talk-myself-into every day, and if I'm feeling up to it, then I'll talk to somebody, not that that will fix me. I don't know about you, but I feel like I'm in a position that I have to keep trying whether I want to or not. Best of luck my friend",
                            "score": 2,
                            "author": "VoteForBernie2020"
                        },
                        {
                            "level": 2,
                            "comment": "You need to stop talking negatively.\n\nDoesn't your therapist teach you these things?\n\nThe way you speak to yourself, the way you view the world... this CREATES your depression.\n\nLearn about Self-Love, Gratitude, Compassion... it's THEE most important part of learning to stay Happy.\n\nYour world is ENTIRELY designed by your perception of it... if you always look for the bad, that's ALL YOU SEE!\n\nThe truth of this situation is that SOME establishments are closed... but not ALL.\n\nGo find a coffee shop, library, park bench, whatever... just go outside and look for a convo with a stranger... 99% of people ARE really nice &amp; kind y'know.\n\nJust quit telling yourself lies about your situation... they simply aren't true... and your hurting yourself by doing it.\n\nSilver Lining. Look on the Bright Side. Glass Half Full. etc, etc... are all phrases you KNOW already, because the advice works!!\n\nNow go back and read every reply you've written on this thread and see how negative you speak to yourself.\n\nIt feels dumb to try being positive for the first little while... but once you realize it works, nothing can stop you from continuing to stay happy.\n\nJust like going to the gym at first, it takes a couple weeks to get used to it... then it becomes addicting.\n\n✌❤",
                            "score": -4,
                            "author": "ATX33",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "r/wowthanksimcured",
                                    "score": 15,
                                    "author": "atlantisfrost",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "I actually just started going to coffee shops/bars/the gyms etc and they just closed them all.",
                                    "score": 7,
                                    "author": "morphotomy"
                                },
                                {
                                    "level": 3,
                                    "comment": "I realize this is a well-intentioned post but what you’re doing is regurgitating armchair psychology and hallmark card gak. I can summarize it by you telling a depressed person to “pull up your bootstraps” and “get your head on straight”.  If I sound hostile it’s bc I am offended. You start by talking down to OP and follow it up with more of your shitty, ignorant attitude. \n\n “Doesn’t your therapist tell you these things?",
                                    "score": 3,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The point of that comment was to suggest OP look for a new therapist.\n\nI speak from direct experience in HELPING MYSELF out of similar feelings.\n\nNegative speak is rule #1.\n\nOP speaks very negatively at every opportunity. That's the obvious problem to address... not pandering and agreement.\n\nBabying doesn't fix the issue... i'm not here to baby people into suicide. I actually want to help people help themselves.\n\nHELP PEOPLE HELP THEMSELVES.\n\nFocus on building up, not tearing down. That's why you are depressed. \n\nAnyone that just says \"oh i know baby, life is hard\"... is NOT helping you. \n\nThat's type of Mothering is actually just pandering, sympathizing, etc. It feels nice, but it's not a solution. It's a false sense of hope... and it's damaging, as the real problem goes unchecked.\n\nFix your problems. Don't look for sympathy... that just makes it worse in the long run, and will drive you to suicide when you realize that your issues aren't solved by someone pandering to your pain.\n\nPut the work into yourself. Read books. Learn skills. Self-Mastery.\n\nLife is hard. That's the whole point. Stop suffering it by avoiding developing yourself into a better person. Do the work.\n\nI'm not your mother,\nbut I still Love you.\n\nTake action on your own behalf.\nTrust me, it works.\n\n✌❤",
                                            "score": 2,
                                            "author": "ATX33"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "This person sees things\n\nIt's all about perspective. If something bad happens I can either sit here and wallow, wasting countless hours telling myself how unhappy I am and other people about how I can't do anything about it, orrr I can go do something.\n\nThere is literally no consequence that matters, the world isn't going to remember you and as sad as it sounds, it simply makes it all the better. Basically you can do whatever you want to improve yourself and nobody is going to think poorly of you if you fail because everyone in this world is a blip on the radar. What's the worst that could happen? Somebody thinks I'm unkempt? Who cares? Why would that matter? I have an awkward social encounter? So what, even if the other person makes a deal out of it it's their fault for being inconsiderate (no need to say or do anything about this, but it just takes a little pressure off yourself if you're overly analytical) \n\nThings only matter if they help you be a better person. &lt;- this is what I live by now. I don't always follow my rule because I'm not perfect, but I definitely do my damn best to.",
                                    "score": 2,
                                    "author": "alemanimani",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "\"feeling depressed? just stay positive! you're feelings are invalid because I was able to work through my individual problems with this new mindset, that has to work for you!\" And there are many consequences that matter, especially in social situations, because you don't know if that someone going to stay a stranger or not. i see your intention and i know you mean well and no harm and i am happy that this works for you but i am NOT getting any supportive or empathetic vibes.",
                                            "score": 6,
                                            "author": "actually-ace",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Exactly. Someone who wants to feel sad doesn't deserve people's help.\n\nIt isn't just \"stay positive\"\n\nIt's \"this shit takes work and you have to do it\"\n\nAnd frankly there are too many people on this board who hear that and say \"nyehh you're ignorant you aren't being nice, wahhhhh\"\n\nBut as someone who's had real shit happen to them on top of being chronically anxious and depressed, who got mad at myself and started trying to fix things, I can say but one thing. Most depressed people are hoping for a miracle that isn't coming.",
                                                    "score": 4,
                                                    "author": "alemanimani",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "And I agree that you have to work for your mental health and moping around isn't going to do anyhting. But that is exactly what they wanted to do and because of Virus, they can't really the way they wanted to.\nAttacking people is also not helpful as it manifests their thought in not deserving help and therefore not being able to accept the support they need.\nBecause no matter what you do, you're going to be criticized and some people don't do well with that.",
                                                            "score": 3,
                                                            "author": "actually-ace",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I dunno, I mean you can learn online? that's how I started\n\nyou're right, some people just need to be taken care of for a while, but imho when nobody is going to and you realise that, there are things that you can do i.e. instead of playing video games, learn something for 30 minutes then go do your thing. But I know what you're saying aha.",
                                                                    "score": 1,
                                                                    "author": "alemanimani"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "\"Most depressed people are hoping for a miracle that isn't coming.\"\n\nThat's it.\n\n✌❤",
                                                            "score": 3,
                                                            "author": "ATX33"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I totally get it. I was finally starting to break out of my bubble with help from my therapist and this all happens. If you feel lonely and need someone to talk to let me know.",
            "score": 12,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I need someone to explain to me that life is fucking worth living and have it be **convincing** rather than sounding like a fucking placation.\n\nI keep trying to tell myself that it is but because I cannot back it up at all it just feels like a lie.",
                    "score": 15,
                    "author": "morphotomy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I need an explanation too... lol. It all really does seems pointless... But I think the point of life is to make it watever you want it to be, regardless of circumstances that are out of your control. Just do whatever you’re capable of doing and be satisfied with whatever you’re satisfied with, until you die. Finding interests and working with possibilities. Living and loving. Then death.",
                            "score": 3,
                            "author": "wildworld1995",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thats the thing. I don't have control.",
                                    "score": 3,
                                    "author": "morphotomy"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "ProTip: Counterintuitive as it may seem, go take a BEGINNER social dance class--salsa, swing, etc. (after the Corona outbreak cools down).  \n\n\nReason: The average 1-hour dance class pairs up people in a circle and has you switch partners every 1-2 minutes. Each time you're able to say, \"Hi, I'm so &amp; so\" and they do likewise without any subtext, flirtiness or awkwardness. You're both in it together, clumsy, patient, and helpful, and for a very short time in each other's arms in a totally non-sexualized way.   \n\n\nThe warmth of close human contact without the hang-ups and uncertainties of dating is almost miraculous if you've been depressed or socially avoidant. In a beginner class everyone is clumsy with no idea what the hell they're doing and so totally without judgement.   \n\n\nLaughter comes easily and you get to be supportive of THEM as much as enjoying a novel situation without risk of harsh judgment of YOU.  \n\n\nTruly this is by far the BEST, most enjoyable, easily available way I've found to reconnect with human touch and close, nurturing contact when you're feeling low, isolated, dejected, or unloved. No one goes there with an agenda except learning how to dance and have fun doing so. Plus getting out of your head and into your body for an hour feels phenomenal.  \n\n\nWhether you like dance or not, this really is an incredible way to wake up a hibernating side of yourself and plug back into some vitality. And with most 1-hr. classes at about $15, an absolute therapeutic bargain.",
            "score": 10,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;after the Corona outbreak cools down\n\nThats the thing. I doubt my ability to get through this.",
                    "score": 6,
                    "author": "morphotomy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think the big trick to not getting bogged down by existential anxiety is to find things of interest you genuinely look forward to. I used to teach photography to a terminally ill teenager and it was so cool to watch them get totally enamored in fining a cool way to shoot a subject. With all their health issues swirling around their life and the keen awareness they probably wouldn't live long, they still had a tremendous capacity to be interested and engaged in something they liked and look forward to doing it again next week.  \n\n\nIt's natural to hurt and fear and despair--life has much unavoidable suffering. BUT we often convince ourselves that's ALL it has, or that finding moments of joy is denialist, irresponsible, or betrays our fellow suffering humans. But that's not the slightest bit helpful to them and denying oneself the available joys you'd wish for everyone else who can't have them we sometimes embrace a contradiction...that what \"good\" we'd wish for others we don't feel worthy of ourselves. This is as mistaken as if the starving third world child felt they didn't \"deserve\" food as much as you do.   \n\n\nWhile I don't know the details of what you wrestle with personally, I do know that despair can be reduced by finding interests and mustering the willingness to jump into them and swim awhile in fascination. It's every human's birthright regardless of the inescapable pain and mortality among us and within us.  \n\n\nFind something shiny... Something you unapologetically take interest in... And dare to tune out care for what anybody else thinks of it and just drink your fill when you can. Remember: a \"successful\" life isn't about not dying or being admired; it's about enjoying one's limited ride one's own way to the fullest extent available. Free yourself to chase and enjoy yours.",
                            "score": 6,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What happened?",
            "score": 7,
            "author": "OpeningStuff23",
            "replies": [
                {
                    "level": 1,
                    "comment": "All the bars and gyms are closed by government order.",
                    "score": 10,
                    "author": "morphotomy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Try being more active in online communities. Do you have a game you like? There almost certainly a discord for it where you can meet like minded people. That’s a good use of time while everyone’s quarantined.",
                            "score": 5,
                            "author": "OpeningStuff23",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I live on the internet. One of the reasons im in therapy is because im a programmer and I lierally cannot stop programming and even though it earns me money it does not justify the amount of neglect the rest of my life suffers. Now im locked inside with nothing but my fucking computer. Wonderful.\n\nI don't like video games at all.",
                                    "score": 11,
                                    "author": "morphotomy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Wow. Not only do we share careers but we share impacts down to our personal life. \n\nI adopted a dog to get out more. You should consider it. If anything, they will impact your ability to sit at the computer for days on end. \n\nIf you consider adopting a dog, do some research first. I opted for a pug because of their temperament and lazy approach to life plus their social out going nature.",
                                            "score": 7,
                                            "author": "wyllyam1111"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "CoronaVirus",
                    "score": 6,
                    "author": "Wasteofskin50",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 7,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 3,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Me too I had finally started getting hobbies and stuff. Hey you can still go for a walk, just not in crowded places",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I just made friends for the first time in 5 years, 3 weeks ago :) Now we cant go out anywhere.",
            "score": 4,
            "author": "whatsmyredditlogin",
            "replies": [
                {
                    "level": 1,
                    "comment": "I met someone online and we cannot see eachother irl",
                    "score": 1,
                    "author": "Mdead2222"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's alright my guy.\n\nI had severe social anxiety through all of grade school. Just sitting in a room of people (like a library or lounge) maybe me so uncomfortable it felt like I was gonna throw up.\n\nBut I wanted to not be sick anymore so I just sat around and tried my best. It took a long time but now I can go to parties and talk to people and do stuff and it's not so scary anymore.\n\nIt seems really hard but all you gotta do is just try your best and itll get better eventually.",
            "score": 4,
            "author": "mrtibbles32",
            "replies": [
                {
                    "level": 1,
                    "comment": "I want to go out. The government says we can't and honestly I'm feeling really angry and insulted about that.",
                    "score": 5,
                    "author": "morphotomy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Nigga I thought this was a two sentence horror story",
            "score": 13,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "This crisis won't last forever... Don't let it discourage you, do some push ups and pull ups everyday at home, start runniong a few times a week, and when the world gets normal again do the things you were planning to do before..\n\nDon't give up now or you will regret it later. Good luck!",
            "score": 3,
            "author": "Mattssbr"
        },
        {
            "level": 0,
            "comment": "I feel you on a spiritual level",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "In January I was really trying to change myself and be more social. Then I got really sick and had to spend a lot of time at home. And then this all started happening, looks like I'll be at home for the foreseeable future...\n\nJust know a lot of people's struggle with depression and isolation is about to get a whole lot more difficult now. None of us are alone in that, even though it feels so lonely.",
            "score": 3,
            "author": "DaBratatatat",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; Just know a lot of people's struggle with depression and isolation is about to get a whole lot more difficult now. None of us are alone in that, even though it feels so lonely.\n\nThat makes me feel even worse.",
                    "score": 3,
                    "author": "morphotomy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I had a friend who has social anxiety and phobias and on 9\\11 she finally got enough courage to head to NYC and go for that job interview and she was trapped during the attack on World Trade Center. It took her hours to get home to long Island and it was traumatic because she was separated from her young daughter. Life is weird like that sometimes. But the point is, you are stronger than you think so don't give up.",
            "score": 3,
            "author": "californiasunset1972"
        },
        {
            "level": 0,
            "comment": "I'm not sure if you edited the post or what. What happened m8?",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "We're under quarantine and I cannot have any sort of social experience at all. I went from sitting in a ball all day trying not to hang myself to finally giving it a shot and seeing people only to be met with immediate discouragement.",
                    "score": 3,
                    "author": "morphotomy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "We're under quarantine too. Is everyone in the USA quarantined?",
                            "score": 3,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Seems so.",
                                    "score": 3,
                                    "author": "morphotomy"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This may sound cruel - but look for the comedy in things!  I fight depression regularly and I'm a huge stand up comedy fan and it definitely helps me.  The darker the comedy the better.  When I read your title \"My therapist finally convinced me to start getting out of the house and this shit happens\" it genuinely made me tilt my head back and laugh out loud.  Not because I hate you and want you to suffer, but because it's ironic and truly is funny.  That's a line you'd hear on a standup comedy stage.  It's painful and difficult and it sucks but somehow it's also hilarious.",
            "score": 3,
            "author": "intheaterssoon"
        },
        {
            "level": 0,
            "comment": "Same thing happened to me. Been trying to get into a local CBT thing for 4 years. I finally got in in February. 2 days after my 1st, I had an operation for Cancer so needed to recover the next week. Week after that had another hospital appointment, missed last week because of a benefit meeting and this week the person I was seeing is away on holiday. Next week will probably be called off or done on the phone but I hate talking on the phone",
            "score": 2,
            "author": "depressedblondeguy"
        },
        {
            "level": 0,
            "comment": "I feel the same way. It's like whenever I even think about doing things to change my life, the world laughs out loud and is like \"NOPPPPEEEEEE\". Especially now. I think it's time for me to just accept things will never get better.",
            "score": 2,
            "author": "SoulfulYam"
        },
        {
            "level": 0,
            "comment": "I'm SO sorry!!!!!!!! As a fellow isolater I am SO SO SO SO SOOOOOOOOOOOO sorry!!!!!!!!!!!!!!!!! I know EXACTLY how it feels as there have been many times that I finally convince myself to do something after several months or years of agony and isolation, and then I didn't have enough money to go anywhere. I am SOOOO sorry you are living this experience!!!!! I know what it is like and IT SUCKS!!!!!!!!!!!!",
            "score": 2,
            "author": "moneylearner"
        },
        {
            "level": 0,
            "comment": "You gonna feel that way sometimes. Just like money, you may never be a billionaire, but staying in your basement (metaphorically) is going to guarantee that you stay poor. \n\nIt's tough, but you can always try again tomorrow.",
            "score": 2,
            "author": "TheOneTruBob"
        },
        {
            "level": 0,
            "comment": "Yes, I know exactly how you feel. Last week I had plans on doing things I have been waiting to do but couldn’t because of my crippling depression. I’ve been on antidepressants for a few months and have been feeling strong. Then last Monday my son and I were in a severe car crash and got discharged on Friday to find out my city is basically shut down. What the fuck happened??? All I can do is laugh at this point. 2020 is a hell of a year.",
            "score": 2,
            "author": "beergirl27"
        },
        {
            "level": 0,
            "comment": "Gardening is helping me! \nI bought a few packs of flower seeds when I was grocery shopping and planted them. I also have been taking walks and trimmed cuttings from pretty plants I see and trying to grow them. It’s a fun new thing.",
            "score": 2,
            "author": "meowwoofneigh"
        },
        {
            "level": 0,
            "comment": "Wait, I'm confused. What happened?",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Ah man, me too! I remember two weeks ago, the sun was shining, I signed up for a \"Self- Improvement\" Course, I had a bunch of things in my calender for once that I was actually looking forward to. Really thought things were on the up. Nope, been stuck in the house since then, now that feeling of impending doom I've had for years is being confirmed by the news and everywhere else. Fucking life. What is the fucking point.",
            "score": 2,
            "author": "Hulksmashbogies"
        },
        {
            "level": 0,
            "comment": "Same. Have been in isolation for a year then was in psych ward for five weeks and lost job. Am in temporary room somewhere and just found a job and a permanent place to live. I don't know if either of those will happen now and my money is running out. \n\nWas ready to try and make a go of things and now this.",
            "score": 2,
            "author": "Onslow85"
        },
        {
            "level": 0,
            "comment": "Everything is a scam. Life is a pathetic sham, people are disgusting retarded robots running around and being clueless little wankers. I hope everyone dies soon. Just wanna watch this farce of a world burn.",
            "score": 2,
            "author": "throwaway94357932",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don't want to agree but I can't really argue either.",
                    "score": 3,
                    "author": "morphotomy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ok stupid question , but why do we humans wake up in middle in night for no reason ?",
            "score": 1,
            "author": "gunca2111XD",
            "replies": [
                {
                    "level": 1,
                    "comment": "I can't remember where I read this but apparently back in the day people went to sleep at sunset woke up for a few hours in the middle of the night and then went back to sleep until dawn.",
                    "score": 1,
                    "author": "hilfnafl"
                },
                {
                    "level": 1,
                    "comment": "I do it because of insomnia.",
                    "score": 1,
                    "author": "morphotomy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well I don't have it . Probably it is because last night I went to  sleep at 6am",
                            "score": 1,
                            "author": "gunca2111XD"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You don't know if you don't try.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "discord chats",
            "score": 1,
            "author": "sadpostingagain"
        },
        {
            "level": 0,
            "comment": "What happened exactly? In any event, I'm happy for you that you gave it a shot... if it didn't go great thats okay, we just need to get back on the horse",
            "score": 1,
            "author": "HKburner"
        },
        {
            "level": 0,
            "comment": "I've been trying to think of what I can do where I live because a lot of the social activities that I enjoy have been canceled to reduce the spread of the coronavirus. The only reason why I left the house today was to take my dog out for a short walk. The only person that I saw on my street crossed the street to avoid me. I've been thinking about walking my dog to a busier part of my neighborhood to do some people watching. I've also been thinking about grabbing my laptop and finding a place where I can sit and connect to wifi. My city's libraries are closed but I doubt that they shut down the public wifi. I'm sure that you can find a place to sit outside while maintaining social distance even if you just sit on your front steps.",
            "score": 1,
            "author": "hilfnafl"
        },
        {
            "level": 0,
            "comment": "i was planning to go see a movie by myself for the first time but nope.",
            "score": 1,
            "author": "not-aaliyah"
        },
        {
            "level": 0,
            "comment": "God has better plan for you. Don’t stress too much. You might not see it now but I have seen how much better god’s plan is and I could give anything for that.",
            "score": 1,
            "author": "ashraffahim_"
        },
        {
            "level": 0,
            "comment": "I stopped going to school for a month, bcoz of migraine and guess what it was the most fucked up month uk why? Cuz I had dreams and used to get scared of it, had a lot of hallucinations and I even thought of committing suicide, my studies had gone into the gutters(it's still the same), but at the end when I went to school I became more depressed, while some ppl cared for me it didn't lasts for that long uk. I became the same guy being ignored by the people for some reason. But I saw myself deep down inside, that I was becoming mature that's cuz before this I used to be a attention wh*re who used  to do fuck*d up shit to get ppl near me but I told to myself not  anymore. In the first place I started thinking abt it while I was at home the whole month and I realized I have been alone (lonely actually) my whole fu*king life. Some ppl are actually good friends of mine but I try to be with the ppl and help others that has just broken my soul in a way that I am trying to heal myself from it. Ik  I am not a celebrity but even I sometimes need ppl who actually care abt me, not who just wanna know cuz of their Curiousness uk.... \nSo friend if u think u are alone don't think so, if u don't wanna go out that's just cuz of being scared, believe me when I go out I see ppl staring back at me, and I feel like was he staring at me or somebody else, I mean that Kind of feeling should be avoided cuz you are a man of ur own and nobody can take your identity away from u. U can also just go out and stay near ur house to have a good breeze of fresh air(in the morning ofc). At the end I would say ppl get up everyday in the whole world cuz they have hope that something new(or bad which is actually challenging) will happen to them and they will enjoy and fight it respectively, cuz m8 all we have in our lives is to just HOPE that some day our life turns out to be a little better.",
            "score": 1,
            "author": "iron_rocky6999"
        },
        {
            "level": 0,
            "comment": "I’m going through the same problem right now. I live in Philly and EVERYTHING is closed. I’m literally waiting for cops to start patrolling to keep people inside or some shit. IT IS WILD OUT HERE",
            "score": 1,
            "author": "marshmallowvignelli"
        },
        {
            "level": 0,
            "comment": "Unpopular Perception: I feel like there is some sort of cosmic being watching who picks on certain people, and does this kind of thing for fun. I have had dozens of \"similar\" ironies to this one in my life, and I have just gotten to where I say \"f\\*\\*\\* it I guess I believe in some kind of god now, just not it's benevolence.\"\n\nMy advice: Don't be too fun to observe. Don't be outwardly reactive and just display numb indifference. Eventually the Cosmic A-hole will get bored and move on to other stuff. I would say this social distance thing will last 2 weeks to a month before the Cosmic A-Hole finds some other way to mess with the human race.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "You can still go out to parks. But yeah the stress is getting to me too",
            "score": 1,
            "author": "hyacinthgirl95"
        },
        {
            "level": 0,
            "comment": "Yep. I’m borderline agoraphobic. But also I don’t even mind at this point. Been training for this moment all my life 😂",
            "score": 1,
            "author": "flylittlewing"
        },
        {
            "level": 0,
            "comment": "Remember Corona doesn't just effect you, Its effecting everyone so if your mindset is \"why does this have to happen to me\" I would work on that while your in self isolation",
            "score": 1,
            "author": "Literal_abyss"
        },
        {
            "level": 0,
            "comment": "Nothing is impossible. That is not a cheesy slogan, it is a fact. Thing is not possible, just hard.\nWell, but who know? As long as you want something, it might happen. Not certainly, but might. It is just you want it or not.\n\nI am quite depressed myself but it doesn't mean it is not true.",
            "score": 1,
            "author": "robberviet"
        },
        {
            "level": 0,
            "comment": "Hell yeah, like u/pp15420 says, you can totally go on walks.  And, you are being social, by posting here.  :)",
            "score": 1,
            "author": "velohell"
        },
        {
            "level": 0,
            "comment": "Feeling the same.  I was starting to make progress with my physcologist. Then someone close to my family died, mum may have cancer back (scan on sat) and now all this with the virus.   \nFeels like the world is out to get me.",
            "score": 1,
            "author": "Skathi87"
        },
        {
            "level": 0,
            "comment": "If you are not high risk, you can look for neighborhood help groups and the local food banks who need volunteers to take food or shop for those who are high risk.",
            "score": 1,
            "author": "deebeezkneez"
        },
        {
            "level": 0,
            "comment": "\"This too shall pass\" \n\nIt may be a few months, maybe even close to a year, but this will end, seemingly as quickly as it started. When it does, take your therapists advice and go out more. Theres an entire, beautiful world to see, and it will seem so much more amazing once we are all freed from this pandemic.",
            "score": 1,
            "author": "lukethebeard"
        },
        {
            "level": 0,
            "comment": " You've been isolated for 3 years so you basically have to start again from scratch.\n\nIt's like learning how to play guitar or getting good at playing a sport.. Repeated effort and failure over time, equals less effort and less failure over less time to succeed :)\n\nIt's the friggen emotions though that make it gruelling though eh. Eventually the shitty stuff like overbearing feelings &amp; self beatings will occur less frequently, and more mercy and self acceptance will come through. How you feel sounds like shit, it'll pass,just not right now.. Ya just a noob and heaps of it is out of your control. Keep at it dude xo",
            "score": 1,
            "author": "angrychickentitties"
        },
        {
            "level": 0,
            "comment": "Yoo mee too!!! \n\nI keep making this joke that I was self isolating before it was cool.. and now I just want to go outside",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "You're not missing anything. You're more likely to get a cold from some dirty loser than this fake virus. What makes you want to socialize with people anyways?",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Why did you get a therapist? Probably because you want to get better. So don't let some quarantine stop you from getting better, it will last just a few weeks. Meanwhile at least try to keep some routine, shower and dress every day and maybe do some stretching or workout, read a book, keep doing it every day, no excuses.",
            "score": 1,
            "author": "ksck135"
        },
        {
            "level": 0,
            "comment": "i found that just going out for a walk while listening to your favourite music is often enough to feel a little bit better. Just go out when the sun is about to set and maybe it helps you the way it helped me. :)",
            "score": 1,
            "author": "Detectiveleht"
        },
        {
            "level": 0,
            "comment": "Hey, don't let it get you down. This virus has ruined everyone's plans. I wanted to start going to the gym, which obviously isn't safe anymore. But it's fine, I can work around it. You can work around this, too. You can go hiking, or simply walk around the park. \n\nDon't let this unfortunate coincidence hinder your chances of getting better. This isn't your last chance. Keep your head up and do what you need to do.",
            "score": 1,
            "author": "Cold_Panic714"
        },
        {
            "level": 0,
            "comment": "I feel similar. After almost two years of crippling nonstop depression, I finally managed to find a bit of joy in life again, and even found someone to date and feel excited about. My second date already got canceled because my country is in complete lockdown, and I’m not allowed to set foot outside if not for groceries or a pharmacy run. I just went back on anti anxiety meds, after this period of actually feeling stable enough, and it’s terrifying me.",
            "score": 1,
            "author": "PottedGreenPlant"
        },
        {
            "level": 0,
            "comment": "I always say go for a walk ! It’s hard and it’s frustrating and tears may come all the time or anger but those walks ! Those walks start to save your sanity . I am speaking from experience I hope with all my heart it will work for you , or you find your own “thing”",
            "score": 1,
            "author": "RoseyGem98"
        },
        {
            "level": 0,
            "comment": "Listen. I've been depressed my whole life. I only found out at 30 years old what it was. \n\nYou don't want to out? Don't go out. \n\nYou ever feel depressed and sometimes just one word, a song, a phone call, a gesture, etc knocks you right out of it? \n\nThat's the secret to controlling this demon, because you will never beat it, don't even try. It's here to teach you something. Embrace it and learn from it, because it will give you strength like you've never known... if you don't fight it. \n\nFind your own ways of fine tuning it and you'll see what I mean. \n\nI'm depressed and anxious everyday. Sometimes I have the most irrational thoughts, but I force myself to make fun of them and laugh out loud. When I'm down? I nurture myself. \n\nYou don't have to do anything you don't want to. \n\nMany introverts prefer to focus on the mind and not the body. Many geniuses couldn't care less to exercise. \n\nTherapists push you to become a functional person within the system. Do you want to be one? \nI don't. I like the way I am and I own my own house and business. I control my life and my depression helps me lift the bullshit veil on society.",
            "score": 1,
            "author": "theunforgiven666"
        },
        {
            "level": 0,
            "comment": "I'm kinda in the same boat. Didn't have super big plans, but I was making some baby steps to connect with people and now that I CAN'T, I feel even more hopeless than when it was just myself holding me back.  Hang in there. I wish I knew when it would be over, but just keep taking deep breaths and trying to do anything that might help. Speaking to myself as much as to you. Peace ☮️",
            "score": 1,
            "author": "VoteForBernie2020"
        },
        {
            "level": 0,
            "comment": "I feel the same exact freakin way!! I’ve been in a serious funk since September and I finally started improving around last month. I lived like a hermit before always being in the house. But then I finally started breaking out of my shell, going places, inviting people over, partying, etc, then BOOM! Rona hits! Now I’m stuck in the house 24/7 and all social events are cancelled. \n\nSelf-isolation was my main issue in regards to my depression. And the moment I decide to start being more social, the government tells us to practice social distancing lol! It’s frustrating because I finally started being comfortable with people. I just fear that I’m going make 10 steps backward in my progress.",
            "score": 1,
            "author": "JJ-Speed"
        },
        {
            "level": 0,
            "comment": "Take this as an opportunity to go for walks and stuff.  Unless your city is on complete lockdown you should be able to go outside with less people around :)",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Omg this kinda made my day. That shit was funny.  \nJokes aside though you can still be social without leaving the house. Just get outta bed. That’s a huge deal.",
            "score": 1,
            "author": "fermata102"
        },
        {
            "level": 0,
            "comment": "Right! I just started coming out if my shell again. And this happens.",
            "score": 1,
            "author": "thejadebirdco"
        },
        {
            "level": 0,
            "comment": "Want to talk?",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I don’t really leave my house either unless I have to go to work and I really hate leaving my house I get super paranoid.depression is one of those things that people think they understand but nobody can understand it until they have it and in my opinion it never really goes away but it does get easier sometimes it’s really hard but i think it does get easier the longer you have had it because you cope.",
            "score": 1,
            "author": "ohio_2020_k"
        },
        {
            "level": 0,
            "comment": "My therapist said this to me “just know that everything you normally struggle with is going to be on steroids because of this shit”.  Ok he didn’t say “this shit” but I put that in there for you :).  It did help me to know that yes, this is harder than normal.  The feelings of the increased difficulty are real and fact based.  And.  I’m hoping all the best for you my friend.  We got this.",
            "score": 1,
            "author": "bears_in_sweatpants"
        },
        {
            "level": 0,
            "comment": "Dude, you would be so powerful if you had started going out. And because of that the universe had to raise the world difficulty just to match you.",
            "score": 1,
            "author": "BlowBow"
        },
        {
            "level": 0,
            "comment": "You can still call people to the phone or make videocalls, its not the same but at least you can see your close people\nOr you can come to internet, coment in forums like this ankd talk to new people arround the world, keep going, we all together can get out of this.\nSaludos desde españa.\n:)",
            "score": 1,
            "author": "Lotarc98",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thats not enough. I need the feeling of holding someone, and the feeling of being held.\n\nI don't want to watch a video and pretend.\n\nI cannot accept these terms. I will be breaking them until they are changed.\n\nI wish I was given the opportunity cooperate. I wish my needs were at least considered.",
                    "score": 2,
                    "author": "morphotomy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was about to get therapy..now i cant because of covid :( being outside and doing things was the only thing stopping the bad thoughts..now i cant keep busy enough and its all coming back",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Hey I've been reading the comments here quite a bit. I feel you to some extent. My room is a mess because I've pushed off cleaning it since... forever and I always hope it looks better the next day and always gets worse. I'm tired of feeling so helpless. So sorrowful... it fucking blows. I see you're into exercise. I'd be down to Google duo or Skype so we could exercise together. Granted I SUCK at physical fitness I'd try my best. Just to get you back on track with socializing  and exercise at the same time.",
            "score": 1,
            "author": "Princess_nior"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "if that happened to me I would probably never leave the house ever again.",
                    "score": 1,
                    "author": "morphotomy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You will get better. What you speak into this world is what will happen. You speak things into being. \nThe more you say you won’t, you won’t. But once you start speaking positivity and saying you will get better then you will.",
            "score": 1,
            "author": "remysnuts"
        },
        {
            "level": 0,
            "comment": "I emphasize greatly. Don’t let it overwhelm you - I’m in a similar situation myself.. I’m trying to do things at home that, when all the restrictions are over, will help me get a head start on possible activities I can do with others, I.e. trying different types of art, exercising so I will be fit enough to play a sport with another person, trying to get more into playing music, etc. use this time to cultivate interests that you can then translate into in-person activities.\n\nIt sucks tremendously though I hope you find something to interest you until you can get out there, don’t let this dampen your progress ❤️❤️",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": -7,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Fucker.",
                    "score": 0,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "You should be fucking ashamed of yourself.",
                    "score": 0,
                    "author": "[deleted]"
                }
            ]
        }
    ]
}