{
    "id": "i3ajk8",
    "score": 4728,
    "title": "I hate that people don’t understand that i don’t want to kill myself, I just don’t want to be alive anymore",
    "author": "Nathanvic13",
    "date": 1596506258.0,
    "url": "https://www.reddit.com/r/depression/comments/i3ajk8",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Yeah. It would be nice to just disappear for a while",
            "score": 691,
            "author": "Ac_DrAgOn_",
            "replies": [
                {
                    "level": 1,
                    "comment": "Forever *",
                    "score": 354,
                    "author": "Katy5253",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "For a minute at least",
                            "score": 126,
                            "author": "IDespiseTheLetterG",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Why do you despise G?",
                                    "score": 34,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "When September ends",
                                            "score": 43,
                                            "author": "rollinstone23",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "of 3020",
                                                    "score": 13,
                                                    "author": "somethingaboutacliff"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Summer has come- but not passed yet. 20 year’s old it’s gone so fast",
                                                    "score": 5,
                                                    "author": "MaxIsWholesome"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Dun dun dun dun dun dun",
                                                    "score": 3,
                                                    "author": "MaxIsWholesome"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Please we must know",
                                            "score": 3,
                                            "author": "Xxrasierklinge7"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Have you heard of sleep?",
                                    "score": 10,
                                    "author": "ItsAPinkMoon",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I wish i could sleep some days I barely get 3 hours then I'm back up and tired",
                                            "score": 3,
                                            "author": "goku349"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Yessss my favorite",
                                            "score": 2,
                                            "author": "IDespiseTheLetterG"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "It’s kinda weird to think about that if you dissapeared for a minute, you wouldn’t notice if you disappeared for a minute or 5 years",
                                    "score": 2,
                                    "author": "Myself6993",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "?",
                                            "score": 2,
                                            "author": "IDespiseTheLetterG",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Because you’re not existing, and you can’t feel if time passes",
                                                    "score": 5,
                                                    "author": "Myself6993",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I’ve been working on disappearing for years - have cut most friends and family out of my life so its almost like I didn’t even exist. Plus that way I have less people to disappoint so win win. /s",
                    "score": 126,
                    "author": "Rosycheeks2",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is my life , when I get lonely I hop on here or find a temp friend from an online shooter or some shit",
                            "score": 52,
                            "author": "bearboi76",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "For most I would say that everyone is a temp friend. Very few people stay in our lives from birth to death other than family(certain family). &amp; There’s nothing wrong with that, it’s just how some of us choose to live. :)",
                                    "score": 11,
                                    "author": "KredPandak",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I wish I could really talk to someone though",
                                            "score": 11,
                                            "author": "bearboi76",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "My Instagram is @luk3william, I'm only 17 but I've been going through the same shit but I don't wanna die (cus I'm scared of death) so I'm seeing if I can try to help people like me because it sucks not being able to talk to anyone so if you wanna vent I'm down.",
                                                    "score": 8,
                                                    "author": "luk3william"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I hope that im lucky then because im still close with friends ive known for like 10 years, and thats almost half my life.",
                                            "score": 2,
                                            "author": "3kbalam"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "This whole pandemic shit has made my life even more isolated.  I don't know if that's a good thing or a bad thing.  I hear myself talking to myself, wondering when the last time I talked to a human was.",
                            "score": 19,
                            "author": "mulder00",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Me too",
                                    "score": 2,
                                    "author": "geekchic924",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Hi human.",
                                            "score": 2,
                                            "author": "mulder00"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "This is what I’ve been doing for the past 4 years. I gradually started disappearing out of everybody’s lives. I deleted most of my social media accs and changed my mobile number so my friends would have no way of contacting me. I’m sure most of them have forgotten about me by now. Now I’m wallowing in this pit of despair that I dug for myself.",
                            "score": 32,
                            "author": "xAndreaNadia",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I have successfully done what you said I push people away because I am an evil person I am going to hell for sure if I'm not already living in hell already so I just push people away nobody needs to get hurt due to me having bad experiences with people",
                            "score": 3,
                            "author": "10987654321-1"
                        },
                        {
                            "level": 2,
                            "comment": "lol it’s like please continue to stay 2 metres apart from me even after covid times",
                            "score": 3,
                            "author": "No-Emotion1111"
                        },
                        {
                            "level": 2,
                            "comment": "Thanks, disappearing is perfect terminology.\nWhen ppl didn’t notice, that said it all.",
                            "score": 2,
                            "author": "Postitjo"
                        },
                        {
                            "level": 2,
                            "comment": "If you shut everyone out of your life you will have no one to go to when things get bad... or worse depending on what’s going on... I recommend against this but it’s your life",
                            "score": 4,
                            "author": "Luck3y-P0rk",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;I recommend against this but it’s your life \n\nIt’s almost as if you think depressed people actively make this choice. I don’t necessarily want to cut everyone out of my life but one third are dysfunctional/toxic and the reason I’m depressed, the other third don’t know how to handle dealing with someone who has depression, and the rest are carefully selected friends that are there for me no matter how long I withdraw/isolate myself from them. Believe me, those suffering from depression are VERY aware of the inevitability of being alone when shit hits the fan - in fact, that’s the reason we distance ourselves from people - we don’t want to be a burden and the sickness in our head lies to us and tells us we’re unlovable. So we distance ourselves and the shitty cycle continues. \n\nYour comment is so incredibly insensitive and unhelpful in a subreddit such as this. Also did you even see the /s tag in my comment? Smh",
                                    "score": 55,
                                    "author": "Rosycheeks2",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I’m no expert and I’m not trying to offend anybody, especially cause I’m going through it myself, but we have to give ourselves a fighting chance. I know I barely have the motivation to do anything /talk to anybody, but I know if I don’t try at least I’m as good as dead. I’m lost myself man, I’m crawling back to toxic ppl in my life cause, sadly, if I don’t I ain’t got nobody, especially out here in sfl where everybody is fake.",
                                            "score": 12,
                                            "author": "AntiSoberSocialclub"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I have spent 4 years of my miserable life suffering from depression... I know just as much as you what it’s like to think like that... I understand completely why you pull away... my parents are divorced and I ended up having to live with my dad... I felt so guilty that this person had to spend a single cent on me, let alone paying for me to go to a school where I was bullied... I get why... I’m more talking about those that are closest to you... never let them go and never put yourself in a. Position to reject them... that was what I was saying... I apologise severely for offending you",
                                            "score": 2,
                                            "author": "Luck3y-P0rk"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 9,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I think the reason why I don’t want to be alive anymore is mainly because I just want to see my ex again.. that’s the main reason, and once that is somewhat fulfilled I would be at ease with disappearing.",
                                            "score": 2,
                                            "author": "c_yerii"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I wouldn't mind being able to just hibernate for a few decades or so, come back refreshed and so far away from my current troubles that it would be like a fresh start. So many things would be new too; it would be like being a kid again for a time.",
                    "score": 18,
                    "author": "theroguex"
                },
                {
                    "level": 1,
                    "comment": "When I hear people shaming drug addicts I always get a little sad as for many people this is the reason why they get addicted. They struggle with depression and use drugs/booze as a way to take a break from reality but it ends up consuming them.",
                    "score": 5,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "This is why we isolate when we're depressed. Get by on the bare minimum then go home and sleep sleep sleep.",
                    "score": 3,
                    "author": "Toxicological_Gem"
                },
                {
                    "level": 1,
                    "comment": "That's literally why I drink.  It's an escape from myself",
                    "score": 3,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "Bruh disappearing for a while is called going to sleep lmao",
                    "score": 2,
                    "author": "euanmac369",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I agree with that",
                    "score": 2,
                    "author": "FUCKTHEWORLD998"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I just don't wanna commit suicide but I just wish that I didn't exist",
            "score": 219,
            "author": "inzanityzeus",
            "replies": [
                {
                    "level": 1,
                    "comment": "I wish I never existed.",
                    "score": 87,
                    "author": "Tilted_Hat",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Same here mate. Fuck my life",
                            "score": 35,
                            "author": "inzanityzeus",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Just wanna adios you know",
                                    "score": 25,
                                    "author": "muffin_mugger"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Holy shit I can relate to this.",
                    "score": 13,
                    "author": "MacDuffy_1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm glad you can relate to it mate and I don't feel like I'm the only who is suffering from this",
                            "score": 6,
                            "author": "inzanityzeus",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Bro your not alone, and hopefully you wont always feel like this. I know I've not always felt like this. It's just nice that people understand.",
                                    "score": 3,
                                    "author": "MacDuffy_1",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah you're right bro thank you so much for it. Have a good day",
                                            "score": 3,
                                            "author": "inzanityzeus"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 3,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Don't even think about killing someone my friend because its only gonna make your mental worse instead of getting better",
                            "score": 7,
                            "author": "inzanityzeus",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Same here. My existence has been painful and fucked from the very beginning",
                    "score": 2,
                    "author": "geekchic924",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Life feels like agony everyday getting abused both emotionally and physically. I hope you're fine right now mate and I wish you the very best. Have a good day",
                            "score": 2,
                            "author": "inzanityzeus"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hate that I can relate to that. But it's to be expected from people who don't share the same issues.",
            "score": 160,
            "author": "Anarchy_TV"
        },
        {
            "level": 0,
            "comment": "Yeah I decided I'm not really suicidal. I just don't want to live anymore. This life sucks... So maybe I argue with a mugger, or don't pay particularly close attention when crossing the street. That kind if thing.",
            "score": 231,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "This  is called passive suicidal ideation 🦄",
                    "score": 123,
                    "author": "skinnyboidiqk",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Like a 6/7 on the [Emmengard scale](https://emmengard.com/2019/05/07/suicide-scale/) and is higher than some people who don't suffer from suicidal ideation or thoughts might expect. \n\nAs someone who lives between a 6 and an 8 almost all of the time, I had to have a doctor tell me that isn't \"normal\" for most people. /u/Esoteric907 that's something that would be good to keep an eye on.",
                            "score": 57,
                            "author": "Faloopa",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Whoa, I never knew about this scale. Thank you this is very eye opening.",
                                    "score": 18,
                                    "author": "skinnyboidiqk",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Probabaly been a 4 or 5 for a while now but I remember being 8 to 10 for a very long time and if I seriously knew about this earlier it would of been great to show to therapists I've had in the past.",
                                            "score": 16,
                                            "author": "skinnyboidiqk",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Same here: I came across it a few months ago and it helped my wife understand where I am better while giving me a more organized way to share my current feelings with her. \n\nIt also helps me feel less alone because if *someone* else could make this, at *some* point at least someone else felt like I do.",
                                                    "score": 6,
                                                    "author": "Faloopa"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Based on this adorable comic, I've been at a constant 8 for 6 years",
                                    "score": 8,
                                    "author": "avian_corvo",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That's brutal. I hope something changes for us.",
                                            "score": 3,
                                            "author": "Faloopa"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I'm a very high 8.5. If cars werent so safe nowadays I would purposely get into a horrific 1-vehicle crash.",
                                    "score": 2,
                                    "author": "TypeRumad"
                                },
                                {
                                    "level": 3,
                                    "comment": "Wow thank you.  I'm either a 5 or 6 on the scale. Interesting.",
                                    "score": 2,
                                    "author": "geekchic924"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "or i just go out and hope i catch covid one way or another",
                    "score": 7,
                    "author": "christiandiwhore",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Nah, dying from virus is lame, i wanna die in battle or at least like by accidentally falling from somewhere really high... Y know, something people wont say \"aw but she was so young blabla\" but rather \"sad, tragic, buuut actually damn that looked kinda cool\"",
                            "score": 3,
                            "author": "purple_spikey_dragon",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You get it, dying in armor is how it is",
                                    "score": 4,
                                    "author": "Ransnorkel"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You either get it or you dont. And they dont, and won't. But I do.",
            "score": 81,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same, friend. I feel a lot of guilt because I am fortunate to have the nice life that I do and I should feel grateful for that (which I do) but...I'm so sad. I want to be dead but I don't want to kill myself. I can't cause my family that much pain but damn when will the sadness stop?",
                    "score": 9,
                    "author": "chocolate_bars",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is exactly how I feel.\n\nI'm in a good spot, life and career wise. I don't want to die, I just want to stop existing for a bit. I would never kill myself because I can't be the source of that kind of pain for my parents",
                            "score": 3,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah I’ve realized not to talk about depression around family because they don’t care and will say ignorant statements I wish I could fade to black",
                    "score": 3,
                    "author": "noahbuckets23",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Id rather I just leave my body and let it do its thing without me. Ive always imagined this. It would get good grades without me and my toxic behaviors, maintain relationships better, actually enjoy things that it does, make other people happy. If the part of me that I am could die then \"I\" would be better off. *But I wouldn't be dead, that's the thing*",
            "score": 136,
            "author": "BlazingDumpsterFire_",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;Id rather I just leave my body and let it do its thing without me\n\nI really feel the same way all the time.",
                    "score": 58,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Im sorry you feel that way, honest. It's pretty rough but it's better than some of the alternatives as I have discovered",
                            "score": 11,
                            "author": "BlazingDumpsterFire_"
                        },
                        {
                            "level": 2,
                            "comment": "This describes my thoughts perfectly.",
                            "score": 6,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Felt this so badly \nBe a better friend, child, sibling, person just parts of my soul but the best parts. No disappointments and toxic traits",
                    "score": 8,
                    "author": "complexvibes"
                },
                {
                    "level": 1,
                    "comment": "That actually sheds a light on the constant need for depressed be to feel disconnected from the pain embedded on their bodies.",
                    "score": 2,
                    "author": "AkhenatonTomb"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s like being emotionally catatonic, there’s no pleasure in anything but you don’t necessarily wanna die",
            "score": 62,
            "author": "MeatBeatManiac696969",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is exactly how I feel",
                    "score": 3,
                    "author": "nonbigbrain"
                },
                {
                    "level": 1,
                    "comment": "it's frustrating",
                    "score": 1,
                    "author": "a-winter"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Speaking from my own experience, it seems that a lot of depression is just waiting for a death that doesn't come as soon as you'd expect. You feel like you're dying, you have no appetite for life, but death just doesn't come.",
            "score": 39,
            "author": "Han_Over",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;You feel like you're dying, you have no appetite for life, but death just doesn't come.\n\nThis. Also, I'm often reminded of that quote from Inception that Leo's wife would repeat (you're waiting for a train...)... except the train broke down somewhere and I'm just waiting.",
                    "score": 12,
                    "author": "CalBearSummer"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I just explained something like this to my daughter. I told her my depression didn't make me want to die, I just feel dead in a living body.",
            "score": 35,
            "author": "kmik05",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah like the spark is gone but you’re still going through the motions. Life just doesn’t feel like it used to when I was younger",
                    "score": 16,
                    "author": "aye-its-this-guy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "At least you have those memories. My depression has been lifelong, but for me it has gotten better. When I was a kid, I prayed every night for God to take me in my sleep.",
                            "score": 6,
                            "author": "kmik05"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I kind of just want to jump off of like a really tall building and just get up without being hurt at all. Like to relieve stress. Just jump off and then get up and walk away",
            "score": 23,
            "author": "Cherry-Dearest",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I totally feel you. Sometimes I wish I could sleep forever.",
            "score": 20,
            "author": "felinepunk",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same. I become a hypersomniac the weeks I most want to disappear.",
                    "score": 7,
                    "author": "CalBearSummer"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So many ppl have commented already but holy fuck this hits mega hard, thank you for putting it into words",
            "score": 17,
            "author": "pineappleandstitch"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 12,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "what matters is that we are all still here and fighting this god awful mental illness. don’t become another statistic and remember that none of this is your faults. much love to you all ❤️",
            "score": 19,
            "author": "wheresmyfrisbeeman"
        },
        {
            "level": 0,
            "comment": "Yes 100% my life. I have zero care to do anything anymore. I pretty much sleep as much as possible and hope to never wake up again. Nothing ever gets better.",
            "score": 7,
            "author": "raahhb912",
            "replies": [
                {
                    "level": 1,
                    "comment": "I feel you in the sleeping forever. It feels better than being awake",
                    "score": 6,
                    "author": "aye-its-this-guy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yesssss!! I just wanna like be in a coma for awhile",
            "score": 14,
            "author": "spacedgirl00"
        },
        {
            "level": 0,
            "comment": "it’s a real pity that we can’t pause life to take time to just grieve. Like, you could be falling apart and have an important deadline due one hour ago. I hate not having the option to grieve",
            "score": 6,
            "author": "rebeccamishra",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Honestly I’d rather just be invisible and float around. I don’t want to do anything anymore but I’d never kill myself.",
            "score": 6,
            "author": "nonbigbrain"
        },
        {
            "level": 0,
            "comment": "Tell me about it. Saw a shrink the other day, I told her I didn't want to live anymore, she asked \"why do you want to die?\". I was like, I don't want to die, I just don't want to live anymore. She couldn't understand the difference. Pathetic. How in the world would she be able to help people when she can't even understand what they're going through.",
            "score": 6,
            "author": "OmeleggFace"
        },
        {
            "level": 0,
            "comment": "I absolutely feel that",
            "score": 5,
            "author": "WhistleStop999"
        },
        {
            "level": 0,
            "comment": "Oh my gosh. This is absolutely the most perfect way to describe it.",
            "score": 6,
            "author": "depressionbutterly"
        },
        {
            "level": 0,
            "comment": "yes we just want purgatory goddamnit!! Send me to the island on *Lost*",
            "score": 5,
            "author": "rebeccamishra"
        },
        {
            "level": 0,
            "comment": "I feel it too. I don't want to be me anymore.",
            "score": 4,
            "author": "-sunshine_"
        },
        {
            "level": 0,
            "comment": "I can totally relate",
            "score": 3,
            "author": "Tonyp963"
        },
        {
            "level": 0,
            "comment": "I remember the nights when I would lay down to sleep and hope I wouldn’t wake up. For years I thought that way. Even throughout my pregnancy. I wasn’t really suicidal, I was like you. I didn’t want to live anymore. I was sick of the routine of medication, working, responsibilities, and just life. I finally hit rock bottom and got help and it took such a long time to get where I’m at now. I’m in a better place mentally, still could be better, but I’m ok. I really wish you the best and hope you can find peace with your life.",
            "score": 4,
            "author": "GlitterBeach"
        },
        {
            "level": 0,
            "comment": "Me too. Bro, me too....",
            "score": 3,
            "author": "cierachamere"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 4,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "how did you do it?",
                    "score": 2,
                    "author": "Either-Dream-3933",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "May I have that link",
                    "score": 2,
                    "author": "sunshinetoadies",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Kenji pls send to me as well pls. Thanks",
                    "score": 2,
                    "author": "A_DyingButterfly",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I came here to vent my feelings about life and lo and behold someone posted my exact feelings condensed in a single post",
            "score": 4,
            "author": "LiamCabbage"
        },
        {
            "level": 0,
            "comment": "I didn’t ask for this shitty life. I don’t want to kill myself, but I wish I didn’t exist too.",
            "score": 4,
            "author": "OhhWolves"
        },
        {
            "level": 0,
            "comment": "They don’t get the difference",
            "score": 3,
            "author": "SaintTerns"
        },
        {
            "level": 0,
            "comment": "I am in that place with you! When I think about being dead everything just drops away and I feel so calm. But I don’t want to kill myself. I just don’t want to be here.",
            "score": 3,
            "author": "ickleb"
        },
        {
            "level": 0,
            "comment": "I feel disconnected from my body, from everyone around me, I don’t want to die but I do want it all to be over.",
            "score": 2,
            "author": "Consuela_no_no"
        },
        {
            "level": 0,
            "comment": "bloody hell, if there was an island where Dignitas could operate freely, id go there. a calm easy way to go to sleep and never wake up? im in.\n\naway with the greed, ugliness of the world, not be a part of a wheel that you cant control and dont really care for either, since none of the other spokes seem to care where we are headed. is not my wants worthy of action ? are you so afraid to let me go so you forbid it, rather then to let me do what i want ? or are they simply afraid that if one starts, it never ends? \n\n\nim a bloody ugly scorpion in a desert and its to damn hot.",
            "score": 2,
            "author": "zwober"
        },
        {
            "level": 0,
            "comment": "Wow, I've never related as much, that's exactly how it feels but you can't say that or people think you need to be signed in somewhere with a white jacket.. \n\nNO, I just don't want to live a shitty life constantly fighting with myself,when things are good, yeah fine, I'll live it up but it doesn't take long for the battle to begin again and I'm just tired of it. \n\nAlso I find People think, when your not down and feeling sorry for yourself, you must be fine cos you haven't mentioned it. Again nope, that's just one of my many faces I put on just so people treat me like a normal person and ask me what's wrong cos they're definitely not equipped for the real answer haha",
            "score": 2,
            "author": "Broken_Banjo_String"
        },
        {
            "level": 0,
            "comment": "Those depression questionnaires I take at my Clinic, have that one question, \"Do you wish you were better off dead?\" (or something similar), have always tripped me up.\n\nI never knew how to answer it, so I'd answer \"Never\".  Then I was told, that if I feel like I wish I didn't exist, but have no desire to off myself, I should mark it as, \"Yes\".\n\nBut because I mark the question as \"Yes\", it becomes a whole 'nother conversation where I'm trying to convince the Doctor or Nurse that I'm not a danger to myself.\n\nIt's exhausting.",
            "score": 2,
            "author": "GarnetsAndPearls"
        },
        {
            "level": 0,
            "comment": "I rarely want to *actively* kill myself, or even die, actually. I want to simply stop existing: not like I never existed, but like everyone else also realized my time was over and I should go. No emotion or loss or fear over my daughter being scarred - just \"oh, it's your time? Okay, bye!\" and I stop being.\n\nWishing I never existed is not appealing to me because I want *some* of my impact (like my amazing daughter) to be here I guess, but **I** no longer want to be.",
            "score": 2,
            "author": "Faloopa"
        },
        {
            "level": 0,
            "comment": "I said this to my doctor today.",
            "score": 2,
            "author": "bluesadie",
            "replies": [
                {
                    "level": 1,
                    "comment": "How’d it turn out?",
                    "score": 1,
                    "author": "Nathanvic13"
                }
            ]
        },
        {
            "level": 0,
            "comment": "2️⃣0️⃣2️⃣0️⃣🔚🔜🎉",
            "score": 2,
            "author": "IHateTheAlphabet"
        },
        {
            "level": 0,
            "comment": "As someone who's gone through really big periods of suicidal thoughts, it's never been that I actively wanted to do something to myself that I knew would be painful, but more that I just wanted to not feel like there's something always weighing me down almost more wanting to just fade away into nothingness. What I will say is a lot of people make suicide a priority because sadly you can't fix someone's depression problem if they're gone. People may not understand why you feel suicidal, but people do recognize that you're in pain, and that is a universal human emotion that everyone can have empathy for if they choose to. There are people who even if they don't understand why you feel the way you do, they do empathize with the pain you feel and want to help you heal from it. I'm sorry you feel like this though, it can sometimes feel like no one really understands exactly how you feel, but they do recognize that you feel hurt and want to help you. I hope you feel better.",
            "score": 2,
            "author": "Jburrii"
        },
        {
            "level": 0,
            "comment": "I get it. I know what you’re talking about; really I do. But know this... you are special &amp; beautiful. I’ve been struggling w/ depression (and I mean depression, since I’ve been a young teenager). And guess what? I still do now @ the age of 44. I’m a father of two beautiful teenagers and I press on because there are people who care &amp; love me &amp; there are people who care and love you as well. \n\nLife can be hard and unfair... let me tell you. But please don’t give up. There are tests that life presents to humanity on a daily basis &amp; you can pass the tests like I have too. Yeah, there’s been times I’ve just wanted to all end &amp; there have been REAL times that I @ one or two times thought about ending it all, but life is truly puzzling yet beautiful.\n\nI encourage you to fight. To push yourself and go to new (safe) heights in life. \n\nEveryone including you ARE SPECIAL and UNIQUE. Push through the darkness @ all costs and find you’re light in this life. Prosper and love.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Right?",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "This is so relatable and I’m sorry that it is, no one should feel like this.",
            "score": 1,
            "author": "Toxic_Puddlefish"
        },
        {
            "level": 0,
            "comment": "i just wanna be put in a self-induced coma for a while",
            "score": 1,
            "author": "spacedcowboy69"
        },
        {
            "level": 0,
            "comment": "Some of us understand.",
            "score": 1,
            "author": "GrannieCuyler"
        },
        {
            "level": 0,
            "comment": "I relate to this completely. Sometimes I just want to sink into the ground and stay there for a while. Other times I just want to cry or scream. But I'm slowly learning that to stop feeling like this is to surround myself with positive influences whether that's regarding the friends I hang around with, or what I follow on social media accs, or even how and what I eat. Its difficult at first but ensuring you have positive influences in your life does make a difference.",
            "score": 1,
            "author": "emjlew_"
        },
        {
            "level": 0,
            "comment": "I’m not quite in that situation, but I went “off” the grid for 2 weeks after I went to the hospital for my last anxiety attack. I didn’t talk to anyone and just stayed off of social media. Watched Netflix and played computer games until I felt better. It helped a surprising amount. Not sure if it would help you at all, but it’s could be helpful. It was 2 weeks of just me and my cat. No issues, and nothing was expected of me. After that I finally decided to seek a therapist to work through all of my issues. It doesn’t work for everyone but it helped me.",
            "score": 1,
            "author": "Tibbles_G"
        },
        {
            "level": 0,
            "comment": "I get like this. Although sometimes I do want to .. depends on how bad I'm feeling",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "This is exactly how I feel. Perfect description.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "i see; you gotta find your purpose in live when you do then yo uwouldnt be thinkgin aobut whehter you wanna live or not",
            "score": 1,
            "author": "timelapse631"
        },
        {
            "level": 0,
            "comment": "Yeah, I've said something similar to \"I'm ok if I die today,\" and of course they respond with \"then why don't you kill yourself?\"",
            "score": 1,
            "author": "Asynithistos"
        },
        {
            "level": 0,
            "comment": "I want a life. Just not this one.",
            "score": 1,
            "author": "Ash57926"
        },
        {
            "level": 0,
            "comment": "For me I don’t know whether I want to be alive and better or have this thing go away. I want to feel a love for life again.",
            "score": 1,
            "author": "Lordlokes"
        },
        {
            "level": 0,
            "comment": "When i first talked to my doctor about my depression, i told her i dont think about suicide but rather not be alive, thinking she would diagnose it as mild depression. To my surprise she called it major depression. Even ppl with depression get confused",
            "score": 1,
            "author": "moohooh"
        },
        {
            "level": 0,
            "comment": "It’s really frustrating. Being suicidal isn’t a simple sliding scale with “suicidal” at one end and “not suicidal” at the other, it’s far far more complicated than that.",
            "score": 1,
            "author": "autumnnleaaves"
        },
        {
            "level": 0,
            "comment": "It's pretty common for the suicidal not to want to die, a lot (maybe most) want to be happy, but in the absence of happiness and in the depths of misery would rather be dead. I'd rather be happy than dead, but I'd rather be dead than as fucking miserable as I am.",
            "score": 1,
            "author": "jwhoooday"
        },
        {
            "level": 0,
            "comment": "Yeah, I'm not suicidal I just want to not exist or sleep forever.",
            "score": 1,
            "author": "SnooSketches"
        },
        {
            "level": 0,
            "comment": "Talking to my doctor (who then got me a place in a depression ward end of last year) I phrased it like this: \"I don't want to die, I just think it would be better if I wasn't here\". Specifically, I hate being a burden on the (few) people around me just because my brain is weird. I never wanted to hurt or punish myself, I just wanted to take the burden off them and ideally have never existed in the first place. The thought of actually doing anything about it, of maybe one day slipping so far down that I might actually do anything, scared the shit out of me.",
            "score": 1,
            "author": "lumidaub"
        },
        {
            "level": 0,
            "comment": "Literally the only thing that keeping me going right now is my mom, and as I’m starting to have suicidal thoughts recently, I don’t know what I’ll do if god forbid something happens to her",
            "score": 1,
            "author": "TheLoyalShinobi"
        },
        {
            "level": 0,
            "comment": "Thank goodness for the internet. Where you can see there are other people going through the same shit you are. Love you all. This fucking sucks",
            "score": 1,
            "author": "Dogluvr1991"
        },
        {
            "level": 0,
            "comment": "Not even that, I just want everything to stop for a while",
            "score": 1,
            "author": "RudeAddiction"
        },
        {
            "level": 0,
            "comment": "I know this well. I would never, could never “pull the trigger” so to speak, but if I knew without a shadow of a doubt that my death was about to happen in that moment, I think it would be the first true feeling of peace I have ever felt",
            "score": 1,
            "author": "King-ofHearts"
        },
        {
            "level": 0,
            "comment": "I feel the same way.",
            "score": 1,
            "author": "moose3298"
        },
        {
            "level": 0,
            "comment": "I understand completely. I’ve felt like this for nearly half my life now (I know exactly when it started) and idk if this feeling will ever go away. \n\nAll I can say is try to make the most out of the time you have. No one lives forever so there no reason to live in misery if you can do something about it. Spend this time with ones you care about &amp; doing things you enjoy. Take care of yourself. :)",
            "score": 1,
            "author": "KredPandak"
        },
        {
            "level": 0,
            "comment": "I’m so grateful someone articulated this. This is how I’ve felt for a long time. I just want to be done. Don’t have much direction otherwise",
            "score": 1,
            "author": "BettieFuckinBoop"
        },
        {
            "level": 0,
            "comment": "This the reason I wanna join the army, I wanna feel the thrill of life when Im about to die and go out in a way thats not looked down upon",
            "score": 1,
            "author": "RickFilA"
        },
        {
            "level": 0,
            "comment": "Exactly,we dont wanna die,we jsut wanna escape the pain,and death sometimes seem like the only option",
            "score": 1,
            "author": "Ismellpennies90"
        },
        {
            "level": 0,
            "comment": "Murs - melancholy",
            "score": 1,
            "author": "Always_Clear"
        },
        {
            "level": 0,
            "comment": "Same here, everytime i mention depression someone assumes i'm suicidal, i'm not, i just want to not exist.",
            "score": 1,
            "author": "luksonluke"
        },
        {
            "level": 0,
            "comment": "I just wish i was never born.",
            "score": 1,
            "author": "3kbalam"
        },
        {
            "level": 0,
            "comment": "You could live in VR and sleep there too . Only work ( unless you're streaming to make money ) , food and toilet would be the things that can get you out of it .",
            "score": 1,
            "author": "kenix7"
        },
        {
            "level": 0,
            "comment": "Yeah idk give me a reason to live and I’ll stop being a useless prick",
            "score": 1,
            "author": "Yvanne"
        },
        {
            "level": 0,
            "comment": "I don’t think I’ve ever related so much to a post",
            "score": 1,
            "author": "gossipchicaxo"
        },
        {
            "level": 0,
            "comment": "I kinda just wish I was never born.",
            "score": 1,
            "author": "alien_alice"
        },
        {
            "level": 0,
            "comment": "I've just went through a depressing period right after getting covid, the trigger was my spine pinching a nerve or some shit, for the past 3-4 weeks I haven't been able to sleep well, sit well, nap during work lunch or relax my body unless I'm on my side laying down, I freaked out and my shit self esteem and my shit emotional control, spiraled me into shit-ville, I got suicidal thoughts and more negative mental energy, then 2 days after I got back to work (and a week into depression), I broke down and cried in my car during lunch, I then knew this was getting out of hand so I called my mother and told her what was happening, that helped a bit, then I let the tears flow per my mother's advice, it helped a lot, I no longer was feeling like breaking down every 10mins, I then searched as much online information I could on my symptoms and stuff and calmed my brain a little, I eventually got the Audible audio book called \"you're not so smart\" and it saved my sanity and fished me out of this dark time, at the same time I refused to allow suicidal and negative thoughts to linger, I would identify them and shoo them away the moment I realized I was making myself feel bad, even if I continued to feel down, it helped a ton. \n\nYour mind is at war with your reality and you're fighting but if you don't know why exactly the right is there to begin with you will struggle in futility.\n\nGet the book audio or physical, \"your not so smart\" and feast on this more focused view into out mental capacity and fallacies.\n\nYou won't regret it. Consider buying the sequel to it. And good luck to all of you 😉",
            "score": 1,
            "author": "Nuttraps"
        },
        {
            "level": 0,
            "comment": "I really, really fucking hate that if I don't watch my mouth then I have to comfort whoever I accidentally opened up to.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Felt that for sure. Like just let some fast growing cancer take me already.",
            "score": 1,
            "author": "toledobull"
        },
        {
            "level": 0,
            "comment": "I feel like that’s majority of ppl these days. \nI don’t wana just die. But had there been a button to turn off forever? Yeaaaaaa woulda prlly hit it",
            "score": 1,
            "author": "Butthead2242"
        },
        {
            "level": 0,
            "comment": "When I recently went to see a therapist, he asked me some very specific questions regarding this difference.  It was really nice to have someone understand they are different, not freak out, and just get on with talking about the issues.",
            "score": 1,
            "author": "crabwhisperer"
        },
        {
            "level": 0,
            "comment": "I kinda just don't want to exist for a while. Just to get a break from everything.",
            "score": 1,
            "author": "Sadistmonkey"
        },
        {
            "level": 0,
            "comment": "I had never heard it called passive suicidal ideation. Thanks for putting a name on it.",
            "score": 1,
            "author": "drnancy3"
        },
        {
            "level": 0,
            "comment": "They don't understand that we wanna end this fucking unbearable pain in our souls. I understand you man. U have too much pain in your mind in your soul. We just wanna escape from this. That fucking emotion we are not valuable is just a illusion but we are. We are valuable without anybody's acceptance. I don't know u at all byt i understand you. I'm here for you",
            "score": 1,
            "author": "ravennasrage"
        },
        {
            "level": 0,
            "comment": "Thanks for mentioning the Emmengard Scale. I have never seen it before. I generally hover around a six.",
            "score": 1,
            "author": "drnancy3"
        },
        {
            "level": 0,
            "comment": "I really often wonder, when I watch the origins of our existence why our dna and why as humanity we tried so hard to exist? For what? I guess there are some good moments, but in the end... for what? I don’t think we are intelligent. I think we are stupid. Like an animal who instinctively does things with a point that matters within that instance but ultimately why? I always questioned why our species fought so much to grow and adapt then push through our human existence. For what?",
            "score": 1,
            "author": "iliketoeat8789"
        },
        {
            "level": 0,
            "comment": "I also feel guilty for not enjoying my life more. I feel guilty for not feeling grateful for what I have.",
            "score": 1,
            "author": "drnancy3"
        },
        {
            "level": 0,
            "comment": "I get this.   \nStill looking for a reasong to live, I might not wanna take my life or attempt it again, but I hate existing. :/",
            "score": 1,
            "author": "Silentico"
        },
        {
            "level": 0,
            "comment": "I feel ya. Hope you’re alright.",
            "score": 1,
            "author": "janklepeterson"
        },
        {
            "level": 0,
            "comment": "i give up on life",
            "score": 1,
            "author": "smthfx"
        },
        {
            "level": 0,
            "comment": "For sure. Would be nice to go poof.",
            "score": 1,
            "author": "Evanuss"
        },
        {
            "level": 0,
            "comment": "Sometimes I just wish I could go to sleep for a long time, but not forever. Like hibernating.",
            "score": 1,
            "author": "ndbm10"
        },
        {
            "level": 0,
            "comment": "Been there, I honestly don't know how I'm not there right now with this pandemic shit. I've never felt actively suicidal, bit I've had those passive suicidal  thoughts like \"what if I drove my car into the oncoming lane?\", or \"what If I just take all of those pills\" etc. I know in my mind I'd never go through with it, but that feeling can lunger for awhile. I don't think there's anything wrong with that from time to time, we all get depressed, or tired of life's bullshit, but if you do feel like you might go further than that, please call a friend, or talk to someone else if you don't feel comfortable with that. \n*I apologize if there are any typos, I'm drunk and I tried to fix all of them.*",
            "score": 1,
            "author": "Radius_314"
        },
        {
            "level": 0,
            "comment": "I don’t want to die, but if I was told I was going to die, I wouldn’t be mad about it.",
            "score": 1,
            "author": "sexysupremetaco"
        }
    ]
}