{
    "id": "ipgaqf",
    "score": 2693,
    "title": "It sucks how mental health is never a valid excuse in college",
    "author": "stlvng2",
    "date": 1599659632.0,
    "url": "https://www.reddit.com/r/depression/comments/ipgaqf",
    "media_urls": [],
    "other_urls": [],
    "postText": "*CW* \n\nanywhere, really, work/jobs included. I can't keep track of my lies. My \"headaches\" and \"migraines\" and \"feeling sick\" are all lies. I can't keep track of them. I wish instead of saying \"I stayed home because of my headache\" I could say the truth \"I have no motivation or energy. I want to kill myself. I hate myself so much and I want to die. I can't even drink water or eat healthy. I can't even do my work. I want to kill myself\".",
    "comments": [
        {
            "level": 0,
            "comment": "I think I found the trick for work.\n\nEvery-time I mention I'm the 'caretaker for' whoever is a family member I 'live with', somehow companies can turn from \"this is a 9-6 no exceptions\" to \"yeah, we can look at a work from home type arrangement\".",
            "score": 414,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's pathetic really. In reality we are caretakers, but of ourselves. People who look after others should realize how difficult it is to completely look after a whole human being, but that's what having these mental illnesses are like.",
                    "score": 237,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Shit, that's accurate. It actually makes me feel a smidge better about not being able to take care of myself, too. Like I may not have a physical disability stopping me, but most people, disabled or not, still have some motivation forcing them to act or at least try to. It's like I have to consciously create motivation for my body to move sometimes.",
                            "score": 27,
                            "author": "Linguisticallization",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The brain is an organ. Depression is a chemical imbalance in the brain. That organ is not working how it should. Mental health problems ARE a physical disability.",
                                    "score": 21,
                                    "author": "pydgeon"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I need to try this",
                    "score": 26,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "What?! I thought it was only a 9-5?",
                    "score": 12,
                    "author": "MEME_DADDY34",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ah you see, employers caught on to the fact that an 8-hour work day means they’re only getting 7hrs of labor out of you! Now we all have hour-long unpaid lunches and then eight hours of work, making 8-5 or 9-6 the new, stupid normal of the work day.",
                            "score": 49,
                            "author": "PCBen",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, it's funny how we all still say 9to5 even though myself and nearly everyone I know in the workforce has to do 8to5.",
                                    "score": 5,
                                    "author": "myripyro"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I work 8-5 lol.",
                            "score": 15,
                            "author": "anons-a-moose"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'm not going to lie this is brilliant, but you could be immediately terminated.\n\nit would be better to just live in a society that allowed people to be truthful",
                    "score": 10,
                    "author": "Buhdumtssss",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I do live with my grandma, so I'm her 'caretaker'. \n\nBut yeah, fuck society for needing to lie about what I need from a job position. I applied to be a video editor for god's sake. I don't need an office to edit videos.",
                            "score": 12,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "You can be immediately terminated for almost anything.",
                            "score": 4,
                            "author": "brainartisan"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yeah, it doesn't work for work either. I'm about to go in to work 2pm-11pm, my anxiety is so bad I feel like I'm gonna vomit and my PTSD symptoms are so bad. But I gotta go and pretend like I'm okay",
            "score": 250,
            "author": "stullskull",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m really late, and you are obviously already off your shift, but just know that I feel you. I wake up every morning, and put my phone on “do not disturb”, because I can’t face the day just yet. \n\nOnce I wake up, i look at all the shit I have to face. People demanding things from me from every possible angle. \n\nI know you can do it. I wake up every day at 6 when I don’t have to wake till 8. I lay in bed dreading the day ahead. \n\nLet it make you mad. Get pissed off. Get so mad every day that you power through your obligations. \n\nAs soon as they are done, you almost feel high. \n\nI have an internal dialogue that goes like this: “quit being a fucking bitch, just do it, if you don’t do it you will never do it”. Shame yourself. Just fucking do it.",
                    "score": 14,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Shaming yourself is a bad habit that will only make a depression worse in the long run.",
                            "score": 30,
                            "author": "HypothermiaDK"
                        },
                        {
                            "level": 2,
                            "comment": "Alternative: be kind to yourself tell yourself you can do it and and you've done it before then treat yourself when you're done. Literally just wake up and talk to yourself about how amazing you think you are every single day, theres enough ppl being rude to you.",
                            "score": 4,
                            "author": "iebelig"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I litterally called in sick this morning at 8AM for my night shift job that starts at 3PM for this reason. I just needed a day... and my boss tells me that I need to call back at 12 to make sure I still felt sick.... I didnt call back.",
            "score": 68,
            "author": "Migoo13",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well in 4 hours you could make a miraculous recovery... Its almost like they don't quite grasp that the point you're calling in sick is because you know that you won't be fit enough to work later that day 🤷🏾‍♀️",
                    "score": 9,
                    "author": "fifi1796"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I had sociology professor who worked with all types of mentally ill patients. He told us once a student who rarely came to class and said it was because she was depressed. He told her she was faking it and if she was actually depressed she wouldn't even be able to get out of bed. It's sad to see that in her eyes it was a small victory of actually making it to class this one time and instead got told that she was faking it. \n\n(P.S. It could be possible that she was faking it, but I still didn't like his attitude towards it.)",
            "score": 66,
            "author": "u_Asp4",
            "replies": [
                {
                    "level": 1,
                    "comment": "Like functional depression doesn't exist huh. That professor can eat my entire asshole",
                    "score": 44,
                    "author": "Freshoutafolsom"
                },
                {
                    "level": 1,
                    "comment": "What an a-hole.",
                    "score": 7,
                    "author": "katvomitt"
                },
                {
                    "level": 1,
                    "comment": "And this is why we are dying lol.",
                    "score": 8,
                    "author": "S_F_C_B"
                },
                {
                    "level": 1,
                    "comment": "I LOATHE people who say that kind of stuff.",
                    "score": 3,
                    "author": "fifi1796"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I can totally understand... but it seems like most people cannot relate to what we go through so they don’t really care or try to understand.",
            "score": 116,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Amen",
                    "score": 7,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s not an ultimate excuse, but if you’ve got the diagnosis and are willing to “out” yourself, most school systems in the US will give you some considerations.",
            "score": 50,
            "author": "dojijosu",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah I did this. Some of the accommodations are actually helpful. It depends on the school, really.",
                    "score": 11,
                    "author": "RyanCantDrum"
                },
                {
                    "level": 1,
                    "comment": "This is true - most colleges have an office of accessibility that can guarantee you certain accommodations in your courses if you go through their process.",
                    "score": 10,
                    "author": "TheMightyBiz"
                },
                {
                    "level": 1,
                    "comment": "Oh man I wish this worked for my job. I'd never dare to \"out\" myself when it comes to my livelihood.",
                    "score": 4,
                    "author": "shannonistachica",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you're in the U.S., you might be able to ask for reasonable accommodations under the [ADA](https://www.eeoc.gov/laws/guidance/depression-ptsd-other-mental-health-conditions-workplace-your-legal-rights).",
                            "score": 2,
                            "author": "FamishedHippopotamus",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I did this. I’m now allowed to work from home one day a week. It’s not much, but it’s something. You can also look into FMLA benefits if you’ve been with your employer for over a year, but that’s unpaid so it’s not an option for everyone",
                                    "score": 3,
                                    "author": "always_lost1610"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "but will this even work when you’ve given up on therapy and medication and dropped all of it because you hate the system and how it operates in a way that just makes you feel worse",
                    "score": 3,
                    "author": "romalley1583",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If that’s where you are, you have something to work on before you try for a degree.",
                            "score": 2,
                            "author": "dojijosu"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Not to discredit this but why get used to a support system that doesnt exist in the next stage of life; the job market.",
                    "score": -7,
                    "author": "KappaRossBagel",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "One day your parents will die and it will be just you. Why get use to a support system that wont exist in the next stage of life...\n\nSee what im trying to say, support systems should be utilized bc they can help you manage your depression and give you time to get better and give you time to heal. Dont waste a support system bc life could always be harder",
                            "score": 11,
                            "author": "S_F_C_B"
                        },
                        {
                            "level": 2,
                            "comment": "I took advantage of the support at college and uni, and now that I'm in employment I've chosen not to disclose. \n\nFor me personally, I don't regret it, if anything it gave me time and space to learn to manage myself so that I don't need that same degree of support now. If I didn't disclose, or have that support, I wouldn't have had the time/space/opportunity to learn to manage myself. \n\nAlso, I think stresses as uni/college are worse than work... But that's just my opinion.",
                            "score": 3,
                            "author": "fifi1796"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yeah, if only we could tell the truth.\n\nMy \"life\" is a string of excuses. You'd think someone would figure it out, but that would require that someone think about me for more than 5 seconds.\n\nI used to make plans and then bail (anxiety as well as depression). So now I just make excuses.",
            "score": 105,
            "author": "phelbooth",
            "replies": [
                {
                    "level": 1,
                    "comment": "I feel this 100%, and it’s either stick by those excuses religiously, or have people say you’re over sensitive, dramatic, or just plain faking. It just makes me want to give up.",
                    "score": 26,
                    "author": "tired___",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Like anyone would choose to fake this hell we call our \"lives.\" Imagine if they knew what was really going on in our poor sick heads. The horror.",
                            "score": 24,
                            "author": "phelbooth"
                        },
                        {
                            "level": 2,
                            "comment": "It took me a long time to stop hating myself for being a dishonest person / liar and realize I've just been in survival mode doing what I need to do to cope with a never-ending barrage of mental illness issues. I've gotten to a point where if I can't force myself to be honest that I will usually just retreat instead of lie or make excuses for most things if I can but it obviously doesn't work for everything.",
                            "score": 2,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "College professor here. It is a valid reason. Get a doctor's note. Just go to a walk in clinic. The note can be unspecific and say you are under the doctor's care until such and such a date. Then go the the program coordinator or Dean with the note. Skip the professor. They have an obligation to work with you, especially in Canada.",
            "score": 15,
            "author": "notnarb39"
        },
        {
            "level": 0,
            "comment": "Eh sometimes it works in college. If you just explain to profs a bit putting emphasis on the physical symptoms (use care here cuz covid) they can usually give you a bit of slack. At one point in my college career I asked a prof if I could postpone a test as my ptsd was acting up resulting in me not eating for a few days not sleeping and being basically incapable of study or driving to campus. Also used it in a job before. People usually understand if you just explain it a bit, if not just call it a personal medical problem you’re in treatment for and they don’t press cuz privacy laws",
            "score": 14,
            "author": "EconomyFap"
        },
        {
            "level": 0,
            "comment": "This sounds so familiar. I am uni currently and I go MIA for long periods of times. My excuse has always been migraines. Honestly, I hate the lies and excuses but the alternative reality of my situation isn't really an option. Stay strong mate.",
            "score": 13,
            "author": "chocolatte_rain",
            "replies": [
                {
                    "level": 1,
                    "comment": "It feels like telling the truth invites input that you didnt ask for, where something that like migraines is accepted in not having a solution, or social commentary associated with it. People just accept it and move on.",
                    "score": 8,
                    "author": "PoiLethe",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lucky for you it's \"accepted\". I do suffer from migraines and I've gotten the occasional \"I get headaches too and I still work\" comments and looks. Nevermind I can't move without blinding pain or that I feel like throwing up from the pain... They get headaches too...",
                            "score": 4,
                            "author": "Dayan54",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hey mate, I have gotten the occasional migraine episode in the past so I sort of know your situation. I got scripted a 'triptan' (frovatriptan) incombination with painkillers and anti inflammatory medication (paracetamol and ibuprofen). This really helped me in stopping the episodes before they fully occured. If you can, just have a conversation with your doctor because there are options available out there. Best of luck mate.",
                                    "score": 2,
                                    "author": "chocolatte_rain",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thanks for your advice. My migraines seem to be cause by hormonal changes and stress, which apparently makes it complicated. I'm also allergic to ibuprofen which reduces my options of treatment.",
                                            "score": 1,
                                            "author": "Dayan54"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 21,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I quit a couple months back, but I was pretty transparent with my situation. I've been tired of lying for many years now, just doesn't really get me anywhere though. I am thankful that I don't get yelled at for quitting, but the sound of disappointment still hurts. I made a new record though for the longest I've held a job, about 3 whole months.",
                    "score": 11,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "I feel like doing the same. Have zero motivation to do my job. No one even comes in the office anymore, it’s just me here. I don’t see the point. Would rather be at home in bed",
                    "score": 6,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I actually like work. I mean I hate my job itself, it blows. But I like the ritual of going to work, for some reason it helps me when I'm low to have something to do and focus on other than just being depressed.",
            "score": 23,
            "author": "Rifter0876",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah I know what you mean, if I have too much time to think I go downhill. So now I'm functional, like I still wanna die but much rather it be by a train than my own hands",
                    "score": 2,
                    "author": "mpercy33"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I missed an entire year, I feel u bro",
            "score": 6,
            "author": "WaffenSSRI"
        },
        {
            "level": 0,
            "comment": "I wish I could explain my academic record with the truth. I have semesters in which I excelled with straight A’s, and others in which I dropped most of my classes because of my inability to concentrate because of my depression. Even if I get help, get better, and tell future interviewers the truth, I’m afraid they simply won’t understand and won’t want to hire someone who has struggled with mental health.",
            "score": 6,
            "author": "ricardozumo"
        },
        {
            "level": 0,
            "comment": "Know exactly what you mean. I usually let it be known early on in a new job that I get horrendous migraines so I have an established excuse. I think, for me anyway, part of it is I’m unwilling to “out” myself and hope for a positive reaction. If the worst case scenario is something I feel like I can’t live with, then I don’t do whatever the thing is. And I can’t stand the thought of professors or people I work with knowing about my mental health problems. I don’t think they’ll understand, and I don’t want their accidental (or purposeful) condescension, I don’t want their pity. I just want to be left alone if I’m being honest.",
            "score": 5,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "If you see a Psychiatrist and Therapist and get a diagnosis, and disclose this info to your school/work, they should provide you with reasonable accommodations to help you better manage the challenges you face in that environment. The ADA “The Americans with Disabilities Act (1990) stipulates that postsecondary institutions are responsible for providing necessary accommodations when a student discloses a disability.” [American Psychological Association ](apa.org) This also applies to employment.  Look into it. I hope this is helpful.",
            "score": 5,
            "author": "Dreamchaser_215"
        },
        {
            "level": 0,
            "comment": "I got through college studying a double major in business during a major depression episode and grief. All I took were doctor notes advising I was under their care. . They don’t need to know what’s wrong or any thing else. That’s your privacy. Hope that helps. As for work, I struggled through the first year but after I got FMLA ASAP!! Than disability(ada) to protect me from my employers. No one will understand what you go through even other people who have been there or not. I got relief when I stopped trying to make others understand. Even people who care for you won’t get it, let alone bosses, friends, professors, family, etc. Hope everyones’good days last longer!! ❤️❤️❤️ Hope those resources help!",
            "score": 5,
            "author": "livingin1111"
        },
        {
            "level": 0,
            "comment": "Check with your disability department. They should recognize depression as a disability and will usually give you a letter you can send to your faculty so you can let them know without having to confront them.",
            "score": 4,
            "author": "Exodus21_20-21"
        },
        {
            "level": 0,
            "comment": "I tell certain, younger managers what’s going on because they fortunately get it. I also have FMLA on my side, so the ones who don’t care to get it, they don’t get to ask when I say I need to go home.",
            "score": 3,
            "author": "PublixHouseCat"
        },
        {
            "level": 0,
            "comment": "Most situations of society underrate the serious that mental health bro...it's so sad but it's like a tabu",
            "score": 3,
            "author": "whilneville"
        },
        {
            "level": 0,
            "comment": "My mental health is responsible for half the shit that's went wrong in my life and it's still not a valid excuse.",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Yeah. Depression is a disability.  If I ever become a teacher I know I'll be very sympathetic to it, having ADHD and Bipolar.",
            "score": 3,
            "author": "emilylinhla"
        },
        {
            "level": 0,
            "comment": "I had to repeat a year in medical school because of missing classes. No one cared that I was depressed and thought I was just lazy.",
            "score": 3,
            "author": "nhyfcswr88654322345"
        },
        {
            "level": 0,
            "comment": "~13 years ago in college I tried explain my struggles to one of my professors, who simply dismissed them by asking if I was crazy.  \n  \nSome days I feel like I'll be lucky if I die before the world ends, geez",
            "score": 3,
            "author": "kyune"
        },
        {
            "level": 0,
            "comment": "This is something I battled with for many years, ESPECIALLY at my most recent job. I was in love with my previous job. I felt like I was good at it, I knew what I was doing, it was a field I considered a hobby, I liked all my coworkers and I was being paid a decent amount of money. When I showed up I was the ideal employee, except... I go through extreme highs and lows. I work myself to death then all of a sudden I’m calling out almost every day because I don’t have the motivation, energy or want to get out of bed. THIS DID NOT END UNTIL I DECIDED TO QUIT AND WORK FOR MYSELF. I realized I was miserable working under other people and started my own small business. My small business did not take off and still hasn’t. But I’m much happier with a lot less money working for myself, at my own pace. This also gave me a hobby, spending most my days researching and advertising and creating new products helps to distract me. It also gives me something to look forward to when I wake up in the mornings. Now instead of sleeping through the entire day, I am up at 5:30 every morning ready to start my day.",
            "score": 3,
            "author": "katie3120"
        },
        {
            "level": 0,
            "comment": "Yeah it sucks. I wish I could tell my teachers the truth as well but missing class \"because I want to die\" isn't an excuse I can use so instead I show up and don't listen to anything other than my suicidal thoughts the whole class.",
            "score": 4,
            "author": "fijifu"
        },
        {
            "level": 0,
            "comment": "I think I've had gastroenteritis 4 times a year for decade, surely you'd think they'd at least enquire about what must be a severe bowel condition",
            "score": 2,
            "author": "mpercy33",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think when it came to bowel movements, it's a gold card pass. No one asks. The same as when you go to the toilet. When they asked where you went, just mention 'number 2' and it's all good in the hood. haha",
                    "score": 3,
                    "author": "Pleb_NextD00R"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s so hard finding excuses all the time.. I know. And the feeling that if u would tell them how u really feel they would look weird at you or think you’re weird. I hope you feel better soon darling",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "it's hard when u get addicted to drugs and use them just to feel anything that isn't depression,i hate myself can't even look in the mirror knowing how much i lie to others and even to myself",
            "score": 2,
            "author": "KILL_MANKEY"
        },
        {
            "level": 0,
            "comment": "Also literally I’m comorbid with BPD wish has a 10% mortality rate. Like it’s literally more deadly than most physical ailments but if you can’t see it it doesn’t exist, right?",
            "score": 2,
            "author": "zutari"
        },
        {
            "level": 0,
            "comment": "Anyone who works, look into FMLA. I have it for my depression. It allows me time to take care of myself when I can't work. Not all businesses offer it, but most do.",
            "score": 2,
            "author": "brnkfnsnty"
        },
        {
            "level": 0,
            "comment": "I never really told any of my employer's that i suffered with clinical depression before but when I started where I am now I made it a priority to tell my my new boss about my situation and that im not a person that will take the day off because of my depression that ill just work through it.\n\nHis response literally made me cry. \" you have paid sick days for a reason if you feel you need to take the day off do so i don't even need to know why\" for the first time my illness felt validated I didn't have to feel like a total pos for taking a mental health day and having to lie saying i have a stomach problem or something this incredible weight was lifted off of my shoulders that day I hope more employer's can be just as empathetic as he is.",
            "score": 2,
            "author": "Freshoutafolsom"
        },
        {
            "level": 0,
            "comment": "I didn't finish university, and I've never worked a fulltime job, at least partly because of chronic depression in both cases. I really feel the person who said they are their own caretaker. Managing my mental health really is a fulltime job. I've done lots of different kinds of volunteer work over the years, which allows me to ramp up my workload when I'm coping well, and quickly wind it down again if I start to get wobbly.\n\nI've been fortunate to live in a country that has the tattered remains of a social welfare system, so I've been able to at least keep a roof over my head and food in the cupboards (most of the time). I really feel for those of you whose countries let people literally rot in the gutter instead of helping them when they struggle with \"normal\" life.",
            "score": 2,
            "author": "strypey"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not even true, it’s just that physical issues are less refutable. Chronic illnesses also get dismissed all the time (especially if you have an invisible illness) and people keep expecting you to get better and it’s always like...no, my body still hasn’t started to work properly...because nothing has changed.",
                    "score": 3,
                    "author": "Invincible-Doormat"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was in survival mode at my fundamentalist Christian college. Got sickly a lot due to depression but had to hide it all the time. It was super fucked up.",
            "score": 1,
            "author": "NatsnCats"
        },
        {
            "level": 0,
            "comment": "Easier to lie than expect the world to understand your pain.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "right",
            "score": 1,
            "author": "marienire"
        },
        {
            "level": 0,
            "comment": "My teachers helped me during my career, I appreciate them so much",
            "score": 1,
            "author": "Friendly_Drummer"
        },
        {
            "level": 0,
            "comment": "I’m an adult now and it sucks trying to work. I call out at least once a week and I’m sure my employers love it. \n\nI’m applying for disability, and even though I don’t think I’ll get compensation, I will be able to tell\nMy boss that I have a disability and they get a tax cut which will hopefully make them more lenient when I call out..",
            "score": 1,
            "author": "zutari"
        },
        {
            "level": 0,
            "comment": "same, I remembered one interview that I took, I shouldn't have mentioned my mental illness, but I was more naïve back then.",
            "score": 1,
            "author": "Astre01"
        },
        {
            "level": 0,
            "comment": "Yeah and they also don't want you to \"bring your problems to work\" which is impossible. Depression is like a shadow, always there.",
            "score": 1,
            "author": "roaritsjess"
        },
        {
            "level": 0,
            "comment": "Personally I always take comfort in knowing that I have both a right to privacy and to important life events without giving context. When I need to leave work because all I can think about it how much I want to die I just tell them \"I need to leave, it's an emergency\". When I know I can't make it in instead of asking I just tell them that I'm simply not going to be able to make it.\nObviously these worked like once or twice for me and won't help everyone but... it's nice to remember.",
            "score": 1,
            "author": "ImAMemeMan"
        },
        {
            "level": 0,
            "comment": "My college didnt take my 60 days at hospital and 3 surgeries as an excuse",
            "score": 1,
            "author": "mrreaper72"
        },
        {
            "level": 0,
            "comment": "Yup. I was doing a clinical placement a few years ago and my supervisor was outright abusive to me and I had anxiety attacks all the time and I was so depressed. I worked at a hospital with kids and so I had to put on this happy face all the time, but one day, crying in the bathroom between client sessions just didn’t cut it, and I had a full blown panic attack in the bathroom (it was a single person bathroom luckily). \n\nAnyways, I was scared that my supervisor would just be more abusive if I said I was having mental health issues (they were because of her stupid ass too) so I said I felt sick to my stomach and physically ill and I was allowed to go home no problem. Because it was a hospital with very sick children, they were like YEAH PLEASE GET BETTER BYE. \n\n\nMan fuck that supervisor and fuck mental health not being seen as “real”.",
            "score": 1,
            "author": "beautifulchaos22",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same boat as you. I work as a nurse in a hospital and get targeted by bullies all the time because of my anxiety. In my current work place, I got picked on again and had a few cnsecutive episodes of panic attacks that I had to hide in a storeroom closet and call my GP to get me urgent medications. That led him to refer me to a psychiatrist and a psychotherapist again. I didn't tell my employer about my mental issues because the last time I did, they used it against me.",
                    "score": 1,
                    "author": "Masterofsnacking"
                }
            ]
        },
        {
            "level": 0,
            "comment": "in my formative years of education, this was true too. my mental health got really bad in the past couple of years and i decided to “put my foot down” and asked for extensions on deadlines because some days i really can’t get up and have no motivation. i told myself if they didn’t receive it well, then so be it. i’ll fail my semester then. to my surprise, they were really receptive to my issues and gladly gave me extensions despite their “no bullshit” kind of curriculum. i really lucked out, and i always try to not abuse the depression card, and only use it when i absolutely have to. school’s still a pain in the ass though, in almost all other aspects haha",
            "score": 1,
            "author": "hahahello_"
        },
        {
            "level": 0,
            "comment": "Literally why I had to quit my music Master's. It was all \"just stop overthinking\", and \"just wake up another hour early to practice more\". As if I already don't feel exhausted throughout my already 10 hour school day.",
            "score": 1,
            "author": "abby_cello"
        },
        {
            "level": 0,
            "comment": "I’m a supervisor.  I tell my employees that I don’t need to know what their health issue is - if you don’t feel well, stay home.  Just let me know you’re gonna be out, that’s all I ask.  I don’t ever ask for specifics because it’s *none of my fucking business* as far as I’m concerned.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Are you in school, or are you working?\n\nEither way, it doesn’t really matter. Get your ass up out of bed, and fucking go. Go to school, go to work. You are going to feel like shit when you get there, but maybe you won’t. JUST FUCKING GO. \n\nGrind it out. You have to. It probably sucks, but you have to do it. Just go, and do it. Even if it hurts the whole time. \n\nI wake up every morning dreading my day. Somehow I ended up owning/running a company. The stress is immeasurable, and the pressure is intense. But I get up every day, and I do it. \n\nEvery day when my alarm goes off at 7:00, I really want to reset the alarm to 8:00, because why the fuck not? I own the company, what are they going to do? Fire me? No, nobody can fire me. But I do hold 4 other guys livelihoods in my hands. The bed feels so god damn good, but the thought of letting people down keeps me going. \n\nThe way I justify everything to myself is this:\n\nI can skip work everyday, lay in my comfy ass bed, and be happy for a while. My bed is the fucking tits. \n\nIf I do that though, I won’t be in that bed for more than a year. I will be homeless before too long. Do you think that being homeless will in anyway alleviate your troubles? \n\nInstead, I wake my naturally lazy ass up, get to work, and power through the bullshit. And at the end of most days I feel pretty good. \n\nBefore anyone says “I own a company, so I don’t know a real struggle”. Just know that I worked 14 hours today to get a job out, while one of my employees left after 8, who also makes more than me. That’s the life of a start up.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "My therapist got it so I could have 15 minutes break ontop of all my other breaks.  \n\nOnce it was tied to my depression, anxiety and panic disorder it became an ADA issue and the employer couldn't fight it really.",
            "score": 1,
            "author": "WriteDepressionAway"
        },
        {
            "level": 0,
            "comment": "I was forced to take a medical leave in college. Like, I fell a couple weeks behind and instead of letting me make it up (which my professors seemed willing to do) the dean basically kicked me out. It honestly ruined my life for a few years as I had to go live with abusive parents and lost all my friends from college and fell behind academically... Fuck mental health stigma.",
            "score": 1,
            "author": "suddenly--pineapples"
        },
        {
            "level": 0,
            "comment": "Self care is one of the ropes that helps you climb out of the canyon of depression.",
            "score": 1,
            "author": "sadpostingagain"
        },
        {
            "level": 0,
            "comment": "The worst part of having a mental illness is that society expects for you act like you don’t. It’s very challenging",
            "score": 1,
            "author": "999nra"
        },
        {
            "level": 0,
            "comment": "I agree. Mental health call ins need to be a thing. The lying about why makes it worse",
            "score": 1,
            "author": "politicalpug007"
        },
        {
            "level": 0,
            "comment": "I know that feel",
            "score": 1,
            "author": "timascus"
        },
        {
            "level": 0,
            "comment": "This is my life. Except I ran out of excuses and just bailed.",
            "score": 1,
            "author": "Ok-Virus-1560"
        },
        {
            "level": 0,
            "comment": "My motivation is actually at zero. I'm tired just breathing and tryna shower.",
            "score": 1,
            "author": "GhostKingThrowAway"
        },
        {
            "level": 0,
            "comment": "1000%. I know why I can't handle the workload my bosses expect of me. I know why I keep falling behind on deadlines. I know why I'm up at 2am working instead of during the day. But I sure as hell can't explain it to my bosses. Shittiest feeling is that because I'm behind on deadlines, if I take a sick day I'll need to admit to my bosses that I don't have that work done, or else the clients will complain. And on top of it, when I take sick days, the work just gets piled on top of other people on the team and they're told exactly who it's coming from.",
            "score": 1,
            "author": "myripyro"
        },
        {
            "level": 0,
            "comment": "In my college even headaches are not accepted. You are expected to come to obligatory classes and practicals whatever the hell you are going though, unless you show an official document from your general practitioner. The doctor appointments are also expensive. I don't get why it works that way, it is cruel",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I have depression AND migraines, and even my own family said to be tough and just go through them.\nAnd I'm like \"lol, fuck you\".",
            "score": 1,
            "author": "-Skelan-"
        },
        {
            "level": 0,
            "comment": "oh wow. i also try to get away with lies and I've already reached the point of my life where I have to google search  valid reasons to call off work for a day.",
            "score": 1,
            "author": "Ok_Cranberry8872"
        },
        {
            "level": 0,
            "comment": "I failed all exams in my last year of high school because I was in bed the entire month depressed. This caused me to not go to university and I was looked down on by teachers, friends and family for this. I only told of few people of my diagnosis so everyone just thinks I was lazy and did it on purpose. Life sucks",
            "score": 1,
            "author": "fattiebitch"
        },
        {
            "level": 0,
            "comment": "Thank you for sharing this. It gave me chills and almost brought tears to my eyes. For years, basically all through high school, I did the same thing... I burdened my family with the idea that I suffered chronic migraines when in fact it felt like the only way to make people understand that I was suffering. My college years I found temporary relief from my misery in drug use and reckless behavior which disregarded everyone around me. That only ended in me hurting people and losing almost all of my friends. \n\nI don't do these things anymore. I still don't want to exist every day and this has become more intense because of those mistakes. The addition of a guilty conscious makes day to day existence almost unbearable. I have found solace only in trying my best to learn more and have responsibility for people and things beyond myself. This keeps me alive. Viktor Frankl's Man's Search for Meaning is a book I can not recommend enough. \n\nI hope this helps. You're not alone and if you can find the strength to overcome the terrible burden that has been laid upon and to bear it, you will find that you begin to have some relief. Or, if not relief, the strength to bear your suffering for the sake of those around you. Everyone suffers, the key to a good life is to bear your suffering enough that you may be able to lesson the suffering of others. You, as someone who suffers a great deal, have a unique capacity to help others who suffer. \n\nTry not lying at all for one day. If you sleep better that night, try again. Etc, etc.",
            "score": 1,
            "author": "Big-Breadfruit6896"
        },
        {
            "level": 0,
            "comment": "Damn i literally didn’t go to work today because of lack of motivation and energy. I jus needed a day. I also no called, no showed and now my anxiety is thru the roof thinking about what I’m going to tell my boss tmw morning. Fucking hell.",
            "score": 1,
            "author": "GraceGod6"
        },
        {
            "level": 0,
            "comment": "This is one of the 1# reasons a hate college. They act like they care, but they really don't. They require some bullshit doctors note stating that you are PHYSICALLY ill just so you can miss on class without consequence. Nothing has made me more depressed and hopeless than college. I had to drop this year because of mental health and they are still trying to charge me for the semester even tho I only attended one class. They are greedy, money hungry, bullshit corporations who don't give a shit about students wellbeing at all. Im sorry you have to go through this. From one student to another, it sucks but please know you aren't alone in feeling like this.",
            "score": 1,
            "author": "ragdollzz"
        },
        {
            "level": 0,
            "comment": "Hate to say it but doesnt work in the real world. Try telling your employer you didnt cone to work because your depression was crippling. You'll see termination very soon. Trust me",
            "score": -2,
            "author": "KappaRossBagel",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think it depends where you work. I take mental health days every now and then (either sick days or vacation days) and I've never had any problems. My company is awesome and might be an exception, but it is possible to find places that value your health (physical and mental) and will be understanding about it. I just wish it was the norm.",
                    "score": 2,
                    "author": "suddenly--pineapples"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -7,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": -3,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        }
    ]
}