{
    "id": "motarh",
    "score": 2950,
    "title": "Just because I laughed at a joke doesn’t mean I’m suddenly cured of my depression",
    "author": "throwaway18626271",
    "date": 1618156683.0,
    "url": "https://www.reddit.com/r/depression/comments/motarh",
    "media_urls": [],
    "other_urls": [],
    "postText": "My parents don’t seem to grasp this concept, just needed to vent",
    "comments": [
        {
            "level": 0,
            "comment": "Sometimes humor actually makes me feel worse, like I'm laughing but it's fake or something.",
            "score": 530,
            "author": "trippingfingers",
            "replies": [
                {
                    "level": 1,
                    "comment": "I totally understand. At work, I'm laughing and smiling and all the while thinking about dying. It's awful. I feel like two people.",
                    "score": 130,
                    "author": "laneydrum",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Totally. Compartmentalization. Just keep in mind that you're not actually two people, and you're just coping, and it is possible to bring how you're feeling and how you're acting into closer alignment with practice.",
                            "score": 37,
                            "author": "trippingfingers",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Do you have success with that? \nI have no idea how to combine them",
                                    "score": 6,
                                    "author": "laneydrum",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I have gradually had success, yeah. I go a \"somatics\" focused therapist and they've really helped me be more aware of my body and the differences between my sensations, emotions, and behaviors and perception, and ever so gradually combine them.",
                                            "score": 7,
                                            "author": "trippingfingers"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Yes pls explain more. Is there a howto guide?",
                                    "score": 3,
                                    "author": "swump",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "oh gosh I wish. psych2go is actually a pretty youtube channel for it tho",
                                            "score": 11,
                                            "author": "trippingfingers"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I can relate.   I stopped being able to fake putting on a \"smile\" quite a while back.    Just ZAPPED of energy and couldn't do it day in and day out anymore.    Fucking sucks.",
                            "score": 6,
                            "author": "mort469"
                        },
                        {
                            "level": 2,
                            "comment": "this is me to a tee. hate",
                            "score": 3,
                            "author": "work2oakzz"
                        },
                        {
                            "level": 2,
                            "comment": "I feel like a hundred",
                            "score": 2,
                            "author": "Born-Independent989"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "So true",
                    "score": 41,
                    "author": "MarsWinner"
                },
                {
                    "level": 1,
                    "comment": "Same",
                    "score": 15,
                    "author": "X_ChasingTheDragon_X"
                },
                {
                    "level": 1,
                    "comment": "God I feel that",
                    "score": 14,
                    "author": "TJdog5"
                },
                {
                    "level": 1,
                    "comment": "It doesn't happen as often now, but I remember I would genuinely laugh at something and then I would feel sick to my stomach.",
                    "score": 3,
                    "author": "ZedFraunce"
                },
                {
                    "level": 1,
                    "comment": "Possibly because you are unexpectedly forcing a different polar opposite emotion out of you when you have been too used to something different",
                    "score": 2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's the mask we have to put up,\n\nI had this conversation with my sister yesterday,\n\nI may look happy sometimes, I may smile, laugh and try make a joke.\n\nBut at the end of the day, when I turn around. It fades away again.\n\nMy mind has been my biggest enemy in life. Always second guessing me and telling me I won't be good enough.\n\nAdd social pressure to that (I've always been the kid who eats lunch by himself) and now these lockdowns have meant the only people I could call friends have vanished.\n\nIt's tough being alone, it's tough being a voice nobody wants to listen or pay attention to.\n\nI dream of suicide but don't have the balls to pull it off, simply because of the pain it would cause the family I leave behind.\n\nI often wish to be in an accident, something that would be a shorter mourning period and have no accountability towards the family.\n\nBut hey. I just hope one day things could turn around.",
            "score": 262,
            "author": "Ecstatic-Original948",
            "replies": [
                {
                    "level": 1,
                    "comment": "Your comment is eerily close to how i feel, i can relate with all of your points. It really sucks to have it this way, but it is what it is. Hopefully our lives turn around, or we get a quick exit.",
                    "score": 53,
                    "author": "TheBrokenSwede02",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Tomorrow is another day to try again.\n\nThat's my take on it, maybe something, someone or me will be different.\n\nKeep well Bud",
                            "score": 25,
                            "author": "Ecstatic-Original948"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "☝️this hits home hard, especially the being alone and dreaming of suicide part. I’m an Electrician and often want a fatal accident to take the pain away.",
                    "score": 14,
                    "author": "Elder_Drakos",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Omg im an apprentice and feel the same way",
                            "score": 1,
                            "author": "3rdeyesight710"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I feel the exact same with everything you said, I hope things change for us",
                    "score": 5,
                    "author": "Electronic_Dark_6085",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It will, we just need to keep trying.\n\nToday has been a better day for me. I got some work which kept my mind busy and I chose to trust my choices today (I'm a tradesman)\n\nYeah I made some mistakes but I tried to catch myself before I started beating myself up making rookie mistakes.\n\nLets see what tomorrow brings",
                            "score": 3,
                            "author": "Ecstatic-Original948",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah I guess we do just have to keep trying, \nThat’s great to hear you had a better day and you kept your mind busy with work, hopefully you have more days like that and if not that’s alright too, Take care of yourself man",
                                    "score": 2,
                                    "author": "Electronic_Dark_6085"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "People dont understand this well at all. Depression is a mood disorder.\n\nA mood is different than an emotion. Emotions are brief, shortlived. \n\nMoods are like seasons, emotions are like the weather on any particular day. Depression is like a long, cold and hard winter. Sure, there are days when the temperature is tollerable, you migh even get a couple of hours once every 2nd or 3rd week when the sun pops out and it's actually a little warm, but for the majority of the time, it's almost always below freezing.  \n\n\nSome people never experience low mood, they experience negative emotions, they are brief, lasting a couple of hours, couple of days. \n\nMajority of people have gone through rough patches in their life when their mood has hit something aproximating a chilly autumm, but an unfortunate few experience that cold, hard winter. So they tell you to put on some warm clothing and tell you platitudes about perseverence and toughening up and bla bla bla, because they've only been out on a chilly autumm day and dont know how it is to be cold to the bone.\n\nWe all want to return to baseline mood, sweater weather, a nice and warm spring day. Not to hot, not to cold, just right. For some, it takes alot of time before the temperature creeps up again and I wish that you all get to feel that warmth again.",
            "score": 80,
            "author": "ImperfectAuthentic",
            "replies": [
                {
                    "level": 1,
                    "comment": "Such a great metaphor. Seasons are supposed to last 4 months though, I’m on month 8 rn.\n\nMaybe it’s because ofclimate change",
                    "score": 25,
                    "author": "throwaway18626271"
                },
                {
                    "level": 1,
                    "comment": "I love the way you put that. It's a really good way to try to describe how we feel to the ones who just don't comprehend. The worst part for me is while I have those couple of days of warmth and sunshine I'm sitting with cloud above me caused by myself just know how brutal and dark those winters get and how the always come back around.",
                    "score": 6,
                    "author": "EdibleeZen",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My uncle literary said I'm not depressed because I smile",
                            "score": 1,
                            "author": "Heather241",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "A smile for us depressed people is just like a bandaid to those who have a actual cut. You just don't see our cuts mostly because we cover them with a smile. I always got told at work your just so pleasant and happy. Every move I made I walked it with a giant smile. That was a time I look back at and realize was one of the darkest times in my life.",
                                    "score": 1,
                                    "author": "EdibleeZen"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Ahh, banal platitudes of 'there's a light at the end of the tunnel, keep fighting on, etc etc.'\n\nLook, I know they mean well and they don't quite understand what we feel, most of the time we don't even understand what we feel (otherwise we would have found that magical off-switch and turned off our depression to be eternally happy and content), but spare me the sermon, guys.\n\nI find it funny how some depressed people are asked to cheer up and keep hoping; a vast majority of them have lost and forgotten the concept of hope - or even worse, recognize that hoping is painful, and all we want in general is for the pain to go away.\n\nHow can you keep hoping, in their definition, if you don't understand it? Even if you did, how can you guarantee that such a thing wouldn't be painful?\n\nSetbacks make us stronger.\n\nOh, I have a lifetime of setbacks, everything I set out to do just gets decimated at some point in life, in a very significant way. It hasn't made me strong; it only has made me rough around the edges. Pressure doesn't harden formed glass; it only cracks it, creating sharp edges at odd angles.\n\nI guess I'll just have to wear the mask of understanding on my part, but in reality, they don't really understand me, nor do I really expect them to.",
                    "score": 2,
                    "author": "Trapezohedron_"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I always feel like I'm faking my depression when I laugh at something I found funny, even though the joy is transient.",
            "score": 51,
            "author": "16MegaPickles"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 38,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "You're 100% correct.      It's nearly impossible at times to find the energy for me any more to imitate \"wellness\" as you put it.    I know exactly what you mean though.    That feeling of the world around you moving along / and as time goes on it becomes harder and harder to see myself put back into that fucking RAT RACE.",
                    "score": 3,
                    "author": "mort469"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I can genuinely be laughing my mouth off sometime, but the joy of the moment quickly gets overshadowed by the fog that is depression, and usually most of my memory of the instance is also clouded by the brain fog that comes with depression",
            "score": 29,
            "author": "fullofregrets2009",
            "replies": [
                {
                    "level": 1,
                    "comment": "I can really relate to that",
                    "score": 12,
                    "author": "throwaway18626271",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "By far the worst side effect of depression is forgetting all those good moments no matter how much I try to remember them. I’ve turned to pictures, videos, voice recording, and journaling, but nothing can make up for a memory, especially if I forget before I have a chance to record",
                            "score": 7,
                            "author": "fullofregrets2009"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thank. You. I wish more people understood that.",
            "score": 15,
            "author": "pool_and_chicken"
        },
        {
            "level": 0,
            "comment": "If I could hang this on my wall i would",
            "score": 14,
            "author": "2Whatever1",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am willing to pay for that wall hanging",
                    "score": 5,
                    "author": "AGOGLO-G",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’ll make a business out of it then",
                            "score": 3,
                            "author": "2Whatever1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Fuck, can I still patent my post?",
                                    "score": 8,
                                    "author": "throwaway18626271"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I got a phone call from my mom today so that she could tell me how glad she was that I seem to be feeling better lately and seem more content... guess I've just got really good at pretending I'm fine...",
            "score": 16,
            "author": "Tylenol-with-Codeine",
            "replies": [
                {
                    "level": 1,
                    "comment": "Fuck thats spot on..",
                    "score": 5,
                    "author": "throwaway18626271",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "\\+1",
                            "score": 1,
                            "author": "Puzzleheaded-Cry6599"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 22,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Even when I had a severe depression and every hour of life was like a torture for me, even then I could laugh when I saw something interesting in the net. But it was like seconds, and like laughing when you're still in pain, but detracted from it for a moment",
            "score": 9,
            "author": "Niktofill"
        },
        {
            "level": 0,
            "comment": "Can confirm.  My coworker made me laugh really hard the other day, but when I was alone again later, I crashed and went back to feeling blah.",
            "score": 6,
            "author": "Magnesium1994"
        },
        {
            "level": 0,
            "comment": "\"How do you have depression you were laughing a minute ago\"",
            "score": 5,
            "author": "pickledchocolate",
            "replies": [
                {
                    "level": 1,
                    "comment": "Beat them with their own logic:”How am I happy, I was thinking of killing myself a minute ago”",
                    "score": 3,
                    "author": "throwaway18626271"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Dude, I laugh A LOT. However, my sense of humor is dark af. I am definitely still depressed.",
            "score": 14,
            "author": "Alien_Nicole",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yep. Saw something delightfully wrong on tihi earlier and it hit me right in the funnies. Brain fog means I don’t fucking remember what it was though. \n\nIf you’re not there already, there’s some pretty good stuff on r/trollcoping",
                    "score": 5,
                    "author": "Plumplestiltskin23"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I laugh at a joke.\n\n\"Oh, you sound better today,\" someone says.\n\nI reply, \"Yep, laughter is making the scars and scabs on my arms disappear, see?\"",
            "score": 5,
            "author": "Asynithistos"
        },
        {
            "level": 0,
            "comment": "Mom: watch something funny\n\nMe: temporary laughter won't change my underlying condition, I'm still really sad even though I'm laughing.",
            "score": 3,
            "author": "B3taWats0n"
        },
        {
            "level": 0,
            "comment": "I would laugh when terrible shit would happen. actually laugh making myself look very crazy",
            "score": 3,
            "author": "fallsroad"
        },
        {
            "level": 0,
            "comment": "\"Aww there you go! I cheered you up, didn't I?\"",
            "score": 3,
            "author": "igloogirl67",
            "replies": [
                {
                    "level": 1,
                    "comment": "Holy fuck that’s infuriating",
                    "score": 2,
                    "author": "throwaway18626271"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Like people think i'm not depressed just pretend to be(even if it's certified by specialists)jus because i laugh and act happy",
            "score": 3,
            "author": "sippthapurp"
        },
        {
            "level": 0,
            "comment": "Wise words",
            "score": 2,
            "author": "WhiteWolf3210"
        },
        {
            "level": 0,
            "comment": "I put on a face when I'm in public or around my family. They don't need my negative energy.",
            "score": 2,
            "author": "Savvy_Canadian"
        },
        {
            "level": 0,
            "comment": "Thinking back to my worst depression if someone told me a joke it was a half smile &amp; slight snigger",
            "score": 2,
            "author": "Rational-Peter"
        },
        {
            "level": 0,
            "comment": "If I said not even swordsmanship cures my depression then who knows what will cure this",
            "score": 2,
            "author": "Silent_Estimate_7298"
        },
        {
            "level": 0,
            "comment": "OMG yes, this so much. People don't realize that just because we're laughing or having a good time for a night/day/week/month doesn't mean we're not dead/dying inside.",
            "score": 2,
            "author": "Forsaken-Thought"
        },
        {
            "level": 0,
            "comment": "This shit infuriates me! \n\n\"But you're always posting funny memes on social media, no way could you be depressed!\"\n\nAlmost like depressed people try to find some semblance of normality and hope that by partaking in funny behaviours they might be able to find a few moments of enjoyment amongst the pain",
            "score": 2,
            "author": "Dabrigstar"
        },
        {
            "level": 0,
            "comment": "Sometimes I have an amazing conversation or joyful experience- I call it a vacation from my depression.",
            "score": 2,
            "author": "photoaim"
        },
        {
            "level": 0,
            "comment": "My mom is amazed every time I \"have fun\"\n\n*Im so highly medicated that whatever Im experiencing is not my own feeling*",
            "score": 2,
            "author": "TW-suicide"
        },
        {
            "level": 0,
            "comment": "My fake laugh is pretty good these days.",
            "score": 2,
            "author": "bruisedonion"
        },
        {
            "level": 0,
            "comment": "I've used the phrase 'sometimes it rains in the desert' as a response to that",
            "score": 2,
            "author": "popfilms"
        },
        {
            "level": 0,
            "comment": "I can relate to this 100%.      It's frustrating as hell - just know they (And anyone else who deeply cares for you),  doesn't understand.   Unless they've gone through, or ARE going through significant Depression (MDD, or BPD as well - in my case combined with a long history of anxiety/panic/ocd) it's beyond difficult to explain.    I'm still trying to figure out a way to communicate everything to someone who has been fortunate enough to never have to endure this type of mental illness - but holy shit it's difficult.   \n\nAlso, especially Parents, because you're the most important thing in their lives - Good Parents would always, ALWAYS want to and be willing to do practically anything within reason to help you.   It's also hard to understand this unless you have your own children - but though it sometimes gets annoying being asked over and over \"what's wrong\" - \"how can we make this go away, or get better?\"    \n\nI'm sure I'm not alone here in that we've spent time explaining as best we can the symptoms, how it makes you feel (depleted of energy, unable to do mundane / everyday tasks, difficult to concentrate, difficult to find any real happiness or joy in things you used to love doing, and the list goes on.   Guilt is a big one for me as well.      \n\n\nLike I said - I'm still waiting to see if there's a better way to communicate to those closest to me (Family and the couple best friends I'm fortunate enough to have) what it feels like, how it isn't a light switch I can just turn off and on.   That the boatload of SSRI's and other meds over the years have just not done the job.     It's a vicious cycle - having people who truly want to help, which is EXTREMELY fortunate \\[lots of people going through all of this shit have NOBODY\\]    \n\nIt's a big problem.   There's still a stigma attached with mental health in general despite some attempts here and there to put it more \"out there\".    It's going to take something more - I don't know what.    \n\nI think obviously it's a huge reason why a lot of us flock to these forums...... We can understand one another - and as a lot of you know, it's not that \"What's the problem / Let's find the FIX for it, TONIGHT!\"    --- Often times, we're just looking for someone to listen..... Someone to talk to, sure - but understanding this runs deep in most of us, and it's not some overnight fix (IMO). \n\nKeep heads up everyone.....     Check in and let us all know who things are going.    These are really, really rough times for a lot of us.    For the WORLD actually.     I wish mental health was brought up MORE and MORE.     Enough with all this bullshit NEWS and bullshit POLITICS that does NOTHING....  \n\nYou want to talk about a \"Silent Killer\" , or a \"Silent Disease\" -   It's MENTAL HEALTH.    MDD/BPD/GAD/OCD and the list goes on and on as you guys know.",
            "score": 2,
            "author": "mort469"
        },
        {
            "level": 0,
            "comment": "I mean I laugh at everything, that doesn't mean the real world doesn't make me feel dead inside",
            "score": 2,
            "author": "djpetrin15"
        },
        {
            "level": 0,
            "comment": "I mean I offset most things with humor, doesn't fix the issue",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "parrents never understand.",
            "score": 2,
            "author": "ehsanboy74"
        },
        {
            "level": 0,
            "comment": "The only time I laugh is watching something on YouTube and once I stop and come back to being me in my actual life I’m either empty inside or else want to cry",
            "score": 2,
            "author": "Electronic_Dark_6085"
        },
        {
            "level": 0,
            "comment": "Some of the funniest people I know are super depressed. They use the humor to keep themselves afloat.",
            "score": 2,
            "author": "All-teraigns"
        },
        {
            "level": 0,
            "comment": "This. My parents don’t understand my depression isn’t cured just because I’m doing a lil better these days I still have really bad days but I’m trying to push through even when it’s so hard to and I feel like they don’t understand how big of a deal that is to someone who thinks about suicide often/is suicidal. Idk it’s just tough some days where you feel so alone and disconnected from family and you just wanna escape from life://",
            "score": 2,
            "author": "starangel1615"
        },
        {
            "level": 0,
            "comment": "r/wowthanksimcured",
            "score": 2,
            "author": "Dr_Kevorkian__"
        },
        {
            "level": 0,
            "comment": "Yep, it becomes your default resting state. You can laugh at a joke but you immediately drop back down to being depressed.\n\nWhat's worse this drop is even more depressing on top of being regularly depressed, so part of dealing with depression is trying to not get depressed over being depressed, only then can you chip away at the initial seed of depression.",
            "score": 2,
            "author": "lobehold"
        },
        {
            "level": 0,
            "comment": "I feel like more and more people think of being sad as being depressed. You see more often people say they are depressed if a small bad thing happens to them, like their team lost or they got a bad grade. Maybe as a joke, but still this takes away the severity of depression. Depression isn't taken as serious as it should be by some.",
            "score": 2,
            "author": "thatbigcookieinshrek"
        },
        {
            "level": 0,
            "comment": "I hate that too. I always come back to the same realisation though; unless you’ve experienced depression you just don’t get it because you can’t get it. Normal sadness doesn’t compare to depression and I think people get scared, to think someone they love could be depressed/suicidal is too much for some people to comprehend - just a few experiences I have had. \n\nI’m glad you got a laugh in! Anything I can utilise to distract myself and bring some peace to my mind is worth it. I was feeling bad about the fact I’ve started playing Sims again quite a lot but at this point I don’t care. It distracts me and gives me abit of escapism and light relief from a never ending month I seem to have been reliving for 13 months. \n\nI hope you get through and your parents support you as much as they are capable of doing.",
            "score": 2,
            "author": "1finedame",
            "replies": [
                {
                    "level": 1,
                    "comment": "I know, 2 years ago, I wouldn’t have been able to empathise on the same level with depression.\n\nThank you, all I do is distract myself. Whether it be by sleeping, listening to music, play games that are the least taxing on the mind. \n\nI hope you’ll get through this as well",
                    "score": 2,
                    "author": "throwaway18626271"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I completely agree with this. I’m trying so hard. Just because I can put on a good front every once in awhile doesn’t mean it’s ok or ‘not that bad’. I have to fight every second to seem ‘ok’",
            "score": 2,
            "author": "dz250123",
            "replies": [
                {
                    "level": 1,
                    "comment": "I hear you, I really do",
                    "score": 1,
                    "author": "throwaway18626271"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This happened to me just yesterday and was infuriating (in part because my mom used that to rationalize why she thinks I'm lying about suicidal thoughts, as if one funny moment changes me entire outlook on life?)! My mom is always saying things like \"it's nice to see you've been feeling better,\" as if you can see feelings, when I laugh at a joke or manage to cook or exercise one day. Those are moments, not patterns, and even patterns don't necessarily mean depression is over either. I'm sorry your parents are saying that stuff to you. It can be exhausting to have to explain mental illness to people when you're already going through it.",
            "score": 2,
            "author": "scatelo"
        },
        {
            "level": 0,
            "comment": "Facts\n\nAlso, \"depression laughter\" exists as well. Like when you're so depressed, that you start laughing about your own misery. Or some things that are geniunley dumb. Difference is that it often turns into crying",
            "score": 2,
            "author": "Kolbenfresserle"
        },
        {
            "level": 0,
            "comment": "I understand that, I really hate when I'm looking for help and people tell me shit like \"but you were fine a few hours ago, you were laughing\" It is called education, It doesn't challenges anything.\nKeep pushing through man, I hope you can get over your depression",
            "score": 2,
            "author": "Aly0033"
        },
        {
            "level": 0,
            "comment": "I also hate the fact that when you're seen as high functioning, you've survived this long so you don't really need the therapy for now or crisis call. Being high functioning has been a complete shit curse for me, it spiralled and turned into the most debilitating thing I've ever had, lower than being low.\n\nIt's not trying to make this about me but the stereotype that if you' re not acting out your symptoms that fit in this category, then you're definitely not in the to the book by the book form of depression. Same for ocd, fucking rile what ocd has turned into. I have intense flashbacks and intrusive thoughts of my own mum masturbating infront of me by my face, obsessively thinking that what if this happens. I couldn't give a shit about washing my dishes, or making sure all the nucleus of bacteria is tended to so they don't harm my ocd cleaning. Obsessing about a rockstar is not obsession.\n\nYou don't have to fit into the category your parents are trying to put you in their heads in. You can go on a huge tour of the world, learning and loving with people, they each give you 1 million pounds on this tour. You could still be miserable and fake this exchange on this ride. You could have an insane time, but the few days in your hotel room you could be wishing so hard to overdose. You could be cry laughing and a few moments you finished your balance will adjust to painful depression.\n\nEmotions are as unique as finger prints. Just having certain behaviours can be categorised which helps us. What your thought pattern of depression is will be totally different to someone else's.",
            "score": 2,
            "author": "Necromanlapse",
            "replies": [
                {
                    "level": 1,
                    "comment": "I hear you, we all just want to be acknowledged. Wanting to be acknowledged by your parents is almost a curse imo. \nDo consider talking to a health professional because they do care about what’s going on in your head. \nSorry if this isn’t what you would have liked to hear from a stranger",
                    "score": 2,
                    "author": "throwaway18626271",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's a curse and also different shoes as a kid and an adult. I think it is more complex for both sides of life, but when you have a kid, I'm thinking parents don't want to believe their children can be depressed as they have had to endure, and in some form it can develop into your adulthood and become a lot more worse with behaviour problems/more psychiatric mental health issues. There are a lot more triggering components in life in adulthood. At the end of this, it still does not matter and is not excuse, we should invite the idea in and try and make adjustments.\n\nYou're right, I don't mind hearing a cold slice of humble pie or the truth. The only reason I won't act on this is because I'm aware of how shit things were when getting support, I was too busy from the therapist point of view as I work shifts, so after my second 12 week wait it was just crushing to be let off the hook again. I'm constantly in the obsession that I should call someone but then the cycle of i want to burst and just have someone wipe my damn ass or anything, to I don't want to see anyone. Obsession is so awful urgh. Gotta fight the cycle.\n\nThanks stranger for the advice, we all know what's right but we can be huge walking contradictions because of our meat sacks in our heads",
                            "score": 2,
                            "author": "Necromanlapse",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "A 12 week wait is really long indeed so I see where you’re coming from. I hope your brain will give you an easier time soon.\nAlso a big yes for that last part, can confirm as a walking contradiction. I really like your way with words btw",
                                    "score": 2,
                                    "author": "throwaway18626271",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thanks, I get told a lot of the time to stop talking in riddles, its meant to be a joke but I have this problem where I take things so fucking personally but never react in a horrible way to the person, just take them personal I throw my hands and its enough to not focus on that person haha.Words are also our form of art, why can't we use them as they are intended to be played with ;) \n\nI'm not trying to be a mong lord here, but if you surround yourself with positive words and mindfulness videos it kind of can alter ways we use language. Talking to ourselves for once and saying things like my depression can be an inconvenience sometimes but not that it is stupid. It's not stupid that it was already implanted in us to have perfectly normal emotions to the side effects of stress or emotional things. I just haven't practiced it enough to let it stick because of the contradiction. Try watching some of sadghuru stuff on YT, he's very logical and far from snake oil theory.\n\nI hope you slowly wein into things and find them far from anxious, try and practice once in a while reminder. Also from all this isolation, get on them vitamin D and k2 tablets (has to be together not vit d on its own) this will help from the incredible crushing fatigue a lot of us are experiencing on top of the depression from pandemonium land",
                                            "score": 2,
                                            "author": "Necromanlapse"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m so sorry to hear that. Depression is something everyone needs to learn and get educated on for sure. Ignorance hurt people.",
            "score": 2,
            "author": "Expensive-Process-75"
        },
        {
            "level": 0,
            "comment": "i understand i hide the fact im depressed and never try to realize it and i have the same problems and it really messes with your mind we will get through it",
            "score": 2,
            "author": "lognts"
        },
        {
            "level": 0,
            "comment": "MY GOD. I hate when that happens. My parent think that just cuz I smile, I'm fine. LIKE WHAT IS THAT FUCKING LOGIC??",
            "score": 1,
            "author": "Snoosprouts2316"
        },
        {
            "level": 0,
            "comment": "I find it easier to laugh when depressed... because then I'd be laughing at how absurd everything seems to be, from the way the system is gamed against the vast majority of people for the benefit of the powerful minority, to how outlandish my dreams have turned out to be in the lens of modern society, to how everyone seemingly rejects knowledge when presented with an entire world's worth of wisdom through the internet, to just how impotent I generally am.\n\nIt hurts, but I laugh at it. And myself. Was it funny? Probably? Probably not. Did I just make another depressing jab about myself? Most likely.",
            "score": 1,
            "author": "Trapezohedron_"
        },
        {
            "level": 0,
            "comment": "It’s a good start, i guess",
            "score": 1,
            "author": "HaasMc"
        },
        {
            "level": 0,
            "comment": "It's not black and white. You feel happy less often and less intensely, depending on how bad it is.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Relateable",
            "score": 1,
            "author": "Ok-Parsnip9933"
        },
        {
            "level": 0,
            "comment": "Mr when this I'd both of my parents",
            "score": 1,
            "author": "thememelordH"
        },
        {
            "level": 0,
            "comment": "But if your laugh is truly real tho, not that artificial I'll laugh because society tells me laugh. But an honest true laugh. \n\nIt's not awful to experience is it.\n\nImagine you loose your leg in a car accident. Immense pain right. But there will be very short moments where you forget about the pain for a brief second. \nIt's the same with honest laughing. \n\nThat's how you could maybe explain it to the people who do not understand you.",
            "score": 1,
            "author": "[deleted]"
        }
    ]
}