{
    "id": "1053b6v",
    "score": 1,
    "title": "Questions for current students",
    "author": "Worldly-Material3566",
    "date": 1673033952.0,
    "url": "https://www.reddit.com/r/fanshawe/comments/1053b6v",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m looking to accept my offer into the general business program and attend here in the fall. I just a had a few questions I haven’t been able to find much of on the thread. \n\nWhat is the general business program like at Fanshawe?\n\nWas it easy to meet people during first year?\n\nWhat are the professors like?\n\nWhat is the nightlife like on campus?\n\nThank you",
    "comments": [
        {
            "level": 0,
            "comment": "I unfortunately am not in business, but I can answer your other questions\n\nI found it very easy to meet people in my first year, Fanshawe has lots of clubs/groups that can help meet people \n\nAll of my professors are very kind/helpful when I have problems \n\nLiving in residence I can tell you nightlife is pretty plain, not much seems to happen at night\n\nHope this helps - J.Van",
            "score": 1,
            "author": "Wolfie1515"
        },
        {
            "level": 0,
            "comment": "There's plenty of music events at Fanshawe and honestly the Student Union runs some pretty cool events.\n\nGo to any student union event and you can make some friends. There's a good amount of clubs people don't know about but have several members. It's seems clubs are more active this year than last.\n\nIdk about business program specifically. But entrepeneurial services is good here.",
            "score": 1,
            "author": "Affectionate-Shift49"
        },
        {
            "level": 0,
            "comment": "I'm a mature student, very mature, living off campus, in the business program. The professors are easy to get along with and they actually seem to care about your education. There is a strong emphasis on practical examples and hands-on learning. It was easy to make friends, but I'm pretty outgoing. some of the work is hard, but that's what you're supposed to be doing. Since I live off campus I can't say anything about the nightlife, but during the day the campus seems active and vibrant, and I see a lot of postings for night activities.",
            "score": 1,
            "author": "LunarEngineer"
        }
    ]
}