{
    "id": "10zxbtz",
    "score": 3,
    "title": "I have some questions about Pre-Heath Program",
    "author": "Alternative_Diet_748",
    "date": 1676147943.0,
    "url": "https://www.reddit.com/r/fanshawe/comments/10zxbtz",
    "media_urls": [],
    "other_urls": [],
    "postText": "Is there anyone here who wants to apply for a nursing program for your next path this Fall 2023?\n\nI am an international student and I have heard that they just accept about 1-2 international students in the nursing program. Is it true?\n\nOur teachers said that about 200 students dropped out last semester this year, so do you think the acceptance rate this year will be high? Do you think we still have a chance to get in nursing with 3.8 -3.9 GPA this year?",
    "comments": [
        {
            "level": 0,
            "comment": "Which nursing program are you most interested in? They are both super competitive, but the RN (Bachelor's of Nursing degree) is the most competitive program out of the two. \n\n[Here](https://www.fanshawec.ca/admission-finance/how-to-apply/competitive-programs) is a link that has information about the competitive programs. For the Collaborative Nursing program (the RN one) the website states: \"College applicants with early offers likely [had] an average above 90%.\" That being said, I know it's often encouraged to have a 4.0 or higher GPA to get into the program. \n\nThe Practical Nursing program (the RPN one) is slightly easier. According to that same link, there are only 94 seats in the program (versus the 125 for the RN one) and \"those who have at least an 80% average in each of their required courses, as well as at least a B+ in each of their post-secondary courses.\" \n\nFor both, you will also have to undergo the CASPer Assessment in order to apply. This is new to Fall 2023 and the assessment is meant to test your situational judgment as well as \"[evaluate] aspects of your social intelligence and professionalism such as ethics, empathy, problem-solving and collaboration\". You can read more about it [here](https://acuityinsights.app/casper/).\n\nIn short, it will be difficult (but not impossible!) to be accepted for either program.",
            "score": 1,
            "author": "JenovaCelestia",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for replying. I am most interested in Practical Nursing and I am confused if 3.8-3.9 is a safe GPA for an international student like me to apply for that.",
                    "score": 1,
                    "author": "Alternative_Diet_748",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There are multiple factors in trying to apply for this program. Yes, you can theoretically get in with a 3.8-3.9, but they tend to favour those with a 4.0 over those with a 3.8-3.9. \n\nThe data I provided doesn't really discern one way or the other if international students are counted amongst the available seats, but given what you said about only 1-2 international students being accepted kind of tracks; u/FanshaweC would be able to shed more light on that, but I do remember hearing something about how they tend to take more domestic students than international ones. It makes sense given there are only 95 seats in the program and a lot of domestic students who apply.\n\nTo answer your question about acceptance rates: only 26% of those who applied were given an offer of admission.",
                            "score": 1,
                            "author": "JenovaCelestia",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Do you know anything about the pharmacy technician program? Is it a less competitive program for international students?",
                                    "score": 1,
                                    "author": "Alternative_Diet_748",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "According to the official link for the program, the Pharmacy Technician program is actually listed as Closed for International Students for September 2023. As a general rule, that program is not as competitive as the others, but it does fill up really fast each year.",
                                            "score": 1,
                                            "author": "JenovaCelestia",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Are you in any health sciences program at Fanshawe now?",
                                                    "score": 1,
                                                    "author": "Alternative_Diet_748",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Nope, just a domestic student really well-versed in searching the college’s website and I know multiple people (mostly domestic, but 1 or 2 international students) who have applied for all 3 programs.",
                                                            "score": 1,
                                                            "author": "JenovaCelestia",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Oh, thanks a lot for your search. I really appreciate that.",
                                                                    "score": 1,
                                                                    "author": "Alternative_Diet_748",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "No worries! I am actually in the OAM4 (Office Administration- Health Services) program, so finding information is what I do!",
                                                                            "score": 1,
                                                                            "author": "JenovaCelestia"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Also not sure but my friends mostly got into Nursing and they said about 20 international students in their classes right now. Also, there are also some international students in Nursing at Woodstock. You still have a chance to get in if you try your best to maintain your GPA.",
                    "score": 1,
                    "author": "Free-Difference-1812"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Colleges are filled with mostly international students, not sure where you heard that.",
            "score": 1,
            "author": "Longjumping-Leave979"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 0,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Really? That's almost perfect GPA!! Idk but I have heard from the Bio prof, she said that this year is less competitive than other years since more than 200 students drop out after Level 1. And she said my friend who got 3.8-3.9, is pretty good to get into Pharmacy Tech (guessing). Do you think we will be ok this year? Hopefully, this year will be less competitive and we will get in a new program soon.",
                    "score": 1,
                    "author": "Alternative_Diet_748",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": " What are you gonna apply to?",
                                    "score": 1,
                                    "author": "Alternative_Diet_748",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 1,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Idk but just try our best for this midterm",
                                                    "score": 1,
                                                    "author": "Alternative_Diet_748"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It will be cut out by the number of students applying to. So it may be different this year. So 4.13/4.2 can get in for sure but not the exact required GPA",
                    "score": 1,
                    "author": "Free-Difference-1812"
                }
            ]
        }
    ]
}