{
    "id": "11a958y",
    "score": 4,
    "title": "CGPA calculation",
    "author": "naedynn",
    "date": 1677187330.0,
    "url": "https://www.reddit.com/r/fanshawe/comments/11a958y",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey buds! How does Fanshawe calculate your CGPA? \n\nDo they base it on the 4.2 scale? \n\nOr do they take your percentage average and assign a 4.2 scale conversion?\n\nI ask because I’ve gotten 94-100% in all of my courses so far, but one of my classes is kinda dicey. Preparing for the worst to get somewhere between 85-89%.\n\nIf the cgpa is calculated by percentage, I should still finish with a 4.2. If they calculate by the 4.2 scale, then I’d only get 4.18.\n\nI’m gunning for A+ average scholarships at Kings/Brescia so I REALLY don’t want to miss out on the highest $$ tier because of one class.",
    "comments": [
        {
            "level": 0,
            "comment": "It depends on the number of credits the class is worth. If the class is only worth 1 credit, it ain't hurt you as much as a class with 3 or 4.\n\nTake the number of credits the class is worth and multiply it by the gpa you got in the class. This will give you your Grade Weight Average.\n\nYou do this for all your classes on the semester, then addup your total Grade Weight Average and diving it by the total credits. This will give you your final GPA\n\nSo example for a class worth 3 credits where you got a B+ (3.5gpa)\n3 x 3.5 = 10.5 GWA\n\nExample for a class worth 1 credit where you get A+ (4.2gpa)\n1 x 4.2 = 4.2 GWA\n\nTo get your semester overall gpa, as the GWA totals, divided by the total credits, so..\n14.7 / 4 = 3.675 or 3.68 final GPA.\n\nThe course worth 3 credits affects your overall much more, so even though you got an A+ in the 1 credit class, it doesn't do much to help your overall.\n\nI hope this helps, any questions DM me. I have a pretty intense excel sheet.\n\nSorry formatting, did this on my phone",
            "score": 2,
            "author": "Unknown895",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for taking the time to respond! I forgot to mention that the 4.18 number I threw in is already the weighted average. I’m in General Arts so all of my courses are worth at least 4.\n\nI think it looks like my only option is to bust ass for this class 😭",
                    "score": 1,
                    "author": "naedynn"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Unless youre gonna parlay those marks into a university program, they dont matter. No employer will care. Stop worrying about it.",
            "score": 2,
            "author": "corona69corona",
            "replies": [
                {
                    "level": 1,
                    "comment": "There is absolutely a difference when it comes to entrance scholarships, not just for Western/Western affiliates, but others universities as well.\n\nIdk about you, but I like free money.",
                    "score": 1,
                    "author": "naedynn",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Dude, it’s fanshawe. Come on huh",
                            "score": 0,
                            "author": "corona69corona",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This isn’t about Fanshawe, this is about entrance scholarships. \n\nSee: https://www.guelphhumber.ca/sfs/transfer-entrance-scholarship\n\nThat’s a difference of $1000 for being 0.02 out of an A+/4.2 GPA.\n\nYou don’t care, but I do. This is why I asked.",
                                    "score": 1,
                                    "author": "naedynn",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I see",
                                            "score": 1,
                                            "author": "corona69corona"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "that low grade sunk you",
            "score": 1,
            "author": "doubleflush",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m going to be so cheesed. This prof didn’t start giving back grades and feedback until after four writing assignments have already been submitted.",
                    "score": 1,
                    "author": "naedynn"
                }
            ]
        }
    ]
}