{
    "id": "11hqoqb",
    "score": 4,
    "title": "Question regarding post graduate work permit.",
    "author": "pritulgohil",
    "date": 1677907792.0,
    "url": "https://www.reddit.com/r/fanshawe/comments/11hqoqb",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello everyone I am from India and I have received offer from Fanshawe College in Mobile Application Development (Co-op). It is a 2 year program, but completes in 16 months as mentioned on my offer letter. So, will I be eligible for 3 Years PGWP?",
    "comments": [
        {
            "level": 0,
            "comment": "Your course must be having COOP term for the 4th semester.",
            "score": 4,
            "author": "jonsnow3166",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, the course does have co-op for the 4th semester which should make them eligible for pgwp. Op should be fine.",
                    "score": 2,
                    "author": "larchernoir"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It should be 3 semesters + 1 co-op program for 4 months so it equals to 2 years of program which makes you eligible for 3 years of pgwp",
            "score": 2,
            "author": "larchernoir",
            "replies": [
                {
                    "level": 1,
                    "comment": "Okay thanks, I need one advice. Is Fanshawe a good college (specifically of IT students) since I am totally unfamiliar with Canadian education and all.",
                    "score": 1,
                    "author": "pritulgohil",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I can't compare it to other colleges since I only went to Fanshawe, but it really depends on your professors.\n\nI was in the CPA program (finished Dec. 2022). Some professors are great and some you learn nothing from.\n\nThe MAP program is run by Lianne Wong and she is amazing. I had her as a professor for the mobile class in CPA before they created the MAP program and she is very knowledgeable and caring.",
                            "score": 3,
                            "author": "claudiams",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks for the info",
                                    "score": 1,
                                    "author": "pritulgohil"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I am afraid I am not the one to answer this as my program is in 2024, sorry. But I have heard IT programs are usually up to date.",
                            "score": 2,
                            "author": "larchernoir"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "nope",
            "score": 1,
            "author": "doubleflush"
        },
        {
            "level": 0,
            "comment": "Then what will be my work permit duration in this case?",
            "score": 0,
            "author": "pritulgohil"
        }
    ]
}