{
    "id": "12xmkt6",
    "score": 2,
    "title": "Summer confirmation of enrolment",
    "author": "scamp1993",
    "date": 1682351271.0,
    "url": "https://www.reddit.com/r/fanshawe/comments/12xmkt6",
    "media_urls": [],
    "other_urls": [],
    "postText": "This is my first summer semester at Fanshawe, I am wondering when they usually confirm enrollment? I've usually had my enrollment confirmed by now, so just wondering if it works a bit different for the summer semester. I start my classes may 1st. Thanks 😊",
    "comments": [
        {
            "level": 0,
            "comment": "It should be sometime this week. I'm still waiting for them to confirm enrolment also 😀",
            "score": 2,
            "author": "Bitter_Library_2652",
            "replies": [
                {
                    "level": 1,
                    "comment": "Great, thanks!",
                    "score": 1,
                    "author": "scamp1993"
                },
                {
                    "level": 1,
                    "comment": "Financial aid got back to me and they aren't starting confirmation of enrolment until next week, just in case you are also checking this week!",
                    "score": 1,
                    "author": "scamp1993",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If your enrollment is not confirmed or worried about not being confirmed, you'll need to go to the Financial Aid Office to manually confirm your enrollment.\n\nThe location depends on what campus you're attending. The wait time is 5-10 mins.\n\nBetter to go to the office itself rather than just waiting for your confirmation.\n\nTold me that it'll take 3-4 days for my enrollment to be confirmed on the osap website. Not sure if I'm confident about it since I have applied for osap on February 2023 (When I went to the office itself).\n\nEdit:\n\nReceived confirmation for my enrollment less than a day.",
                            "score": 1,
                            "author": "Worldly_Priority4470"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "means you didn’t get in bud",
            "score": -5,
            "author": "doubleflush",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is my 4th semester, acceptance to a program wasn't my concern.",
                    "score": 7,
                    "author": "scamp1993"
                }
            ]
        }
    ]
}