{
    "id": "py9ept",
    "score": 13,
    "title": "Online school is killing me.",
    "author": "Hadesthegood",
    "date": 1632965205.0,
    "url": "https://www.reddit.com/r/fanshawe/comments/py9ept",
    "media_urls": [],
    "other_urls": [],
    "postText": "Honestly thought going into my program for fall wasn’t going to be terrible, but I was wrong. I moved away from my home more than 5 hours from here and wish I’d just kept working till in person returned. I was stuck in a dilemma between working or going to college. Sadly its too late to get my money back and I’m already half way into my lease.\n\nI don’t mind most of my profs but theres about 1-2 that are making things difficult to even learn anything. My program is 3 years and If I’m stuck doing online for even my second semester this is going to be tough to tolerate. I constantly feel like I’m stressing even though I’m done all my assignments.\n\nI’d even heard things warning about this program and I’m kinda wishing I’d listened. Maybe I’m just having a breakdown and I’m homesick since I’m only 18. Also I’m not sure even how many people pass/drop this program. If anyone is curious I’m in the CYB program.",
    "comments": [
        {
            "level": 0,
            "comment": "CYB has one of the highest drop out/fail rates. It looks like this program will not go back to fully in person anytime soon. Most instructors you have after semester 2 are part time and only available after 5pm so your classes are online. If you’re struggling with content reach out to peer tutoring, $5 per hour, contracts are 5 hours long. I am finishing the program so if there is a specific course you are struggling with it’s okay to ask. Also, don’t take your first tests to heart. Every intake for the first three years seems to average around 50% on their first midterms. If you have questions about specific staff or classes that you need help staying engaged in, you can also ask that.",
            "score": 4,
            "author": "Cowhugger64",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hey there, could you please provide me with a contact for peer tutoring. Fellow CYB1 student here, facing similar struggles with online learning.",
                    "score": 1,
                    "author": "Specter_1996",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "FOL Homepage&gt;My Fanshawe Tab&gt; Sign in&gt; Search bar \"peer tutor\"",
                            "score": 1,
                            "author": "Cowhugger64"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hello, \n\nWe are so sorry to hear that you are struggling.  Have you had a chance to speak with your Academic Advisor?  Her name is Faith and she can talk to you about your options and available supports. www.fanshawec.ca/myssa  \n\n\nAlso, consider joining the CYB Discord server if you haven't yet: [https://discord.gg/ZUEmKycK2f](https://discord.gg/ZUEmKycK2f)  \n\n\nAnd join the Fanshawe Server to connect with other students and supports. [www.fanshawec.ca/discord](https://www.fanshawec.ca/discord)",
            "score": 2,
            "author": "FanshaweC"
        },
        {
            "level": 0,
            "comment": "I'm not sure if this helps, but before covid, there were at least 1-2 profs throughout each semester that are terrible. Usually 3-4. The quality of instructors went down the further you got (CPA grad)",
            "score": 3,
            "author": "h0tstuff",
            "replies": [
                {
                    "level": 1,
                    "comment": "CPA is weird for this... the prof is either fantastic or terrible, maybe one or two average but mostly skewed out either way.",
                    "score": 2,
                    "author": "hungrydruid"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I know shit sucks man, but keep going. You won’t regret it. That’s coming from a 4th year student here. Having the ability to put your head down and overcome obstacles even when things are shitty is a skill you can’t learn from anyone but yourself.\n\n“A hero is one who knows how to hang on one minute longer”",
            "score": 1,
            "author": "Upper-Plate-9927"
        }
    ]
}