{
    "id": "stwzvt",
    "score": 10,
    "title": "Terrible C programming teaching in CPA",
    "author": "Trikethedogfish",
    "date": 1645021118.0,
    "url": "https://www.reddit.com/r/fanshawe/comments/stwzvt",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am in the CPA program, I am doing well in all subjects except C programming. The prof just writes code while partially explaining it as he goes, but then it turns out that isn’t the way to write the code and changes it all bit by bit. Very difficult to take notes from, provides no slides or study material. The other sections have different profs who do provide slides and study material. I have emailed the program coordinator but had no reply, has anyone else experienced this and if so how did you handle it?. \n\nEdit: when we receive projects I go through the lectures to find relevant information that could help, but what he teaches is not helpful for the projects. We have to teach ourselves basically.",
    "comments": [
        {
            "level": 0,
            "comment": "I graduated last month from CPA and what everybody is saying is true. It's a train wreck.",
            "score": 5,
            "author": "ArsStarhawk",
            "replies": [
                {
                    "level": 1,
                    "comment": "How are the other technical courses related to IT  in this college?",
                    "score": 1,
                    "author": "Sufficient-Doctor410"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I am in Cyber Security and their are so many issues, it is overwhelming. Several students messaged the program coordinator, program manager and the associate dean. They basically said sorry for your experience and never said anything else to us again and the issues remain. They just simply don't care.",
            "score": 5,
            "author": "Gambit-Lothbrok",
            "replies": [
                {
                    "level": 1,
                    "comment": "CPA had a similar issue where a certain teacher didn't mark anything until like 2 months past the end of the term. People literally failed because he didn't mark half the content.\n\nTo top it off, it was the program coordinator. Nowhere to complain except the dean, who naturally did nothing",
                    "score": 2,
                    "author": "Key_Confusion_576"
                },
                {
                    "level": 1,
                    "comment": "I’ve heard that same thing about so many other programs. Fanshawe sucks",
                    "score": 2,
                    "author": "D1ckRepellent"
                },
                {
                    "level": 1,
                    "comment": "That is definitely the impression I am getting",
                    "score": 1,
                    "author": "Trikethedogfish"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The issues don't stop there. I'm in 5th semester atm, and this program is the gift that keeps on giving.",
            "score": 4,
            "author": "Dopey_Power",
            "replies": [
                {
                    "level": 1,
                    "comment": "Honestly is, I hate that I am starting to regret taking this program.",
                    "score": 3,
                    "author": "Trikethedogfish"
                },
                {
                    "level": 1,
                    "comment": "semester 5 is the easiest since semester 2, whats your issue with semester 5??",
                    "score": 1,
                    "author": "Braunzz"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Can you access other section's lectures? I know when we were in person downtown I spent an entire semester going to Bill's OOP Java class even though I wasn't in his section, I just showed up to my section's class to write tests heh.",
            "score": 2,
            "author": "ArsStarhawk",
            "replies": [
                {
                    "level": 1,
                    "comment": "No we don’t have access, I could ask the other section to send the link though maybe that would work. Yes Bill is a great teacher, had him last semester, have a different Java teacher this semester she isn’t great but does just enough.",
                    "score": 1,
                    "author": "Trikethedogfish"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hi I m also in CPA winter intakes. This is my first semester but I found it overwhelming. Wanna change the college but I think it is too late?",
            "score": 2,
            "author": "Efficient-Nerve672",
            "replies": [
                {
                    "level": 1,
                    "comment": "First semester is by far the easiest. Not trying to scare you per se, but you should know what you're getting into. Bill Pulling is the gold standard for teaching in Fanshawe's CPA program, and I don't have a single bad thing to say about him. Unfortunately, he doesn't teach many of the courses you'll encounter, and I've had many problems with most of my other profs.",
                    "score": 3,
                    "author": "Dopey_Power"
                },
                {
                    "level": 1,
                    "comment": "Thanks for letting me know ahead. We touch c program this term too. C programming is the hardest!  I don’t think too much. Just let the nature take its course. Hang in there bros!",
                    "score": 1,
                    "author": "Efficient-Nerve672",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "C programming is half a term then never again, c++ and c# isnt nearly as bad imo",
                            "score": 1,
                            "author": "Braunzz"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hello, I encourage you to reach out to your Academic Advisor who will hopefully be able to offer some support or direction. Your academic advisor is Troy, her email is ttownsend@FanshaweC.ca.",
            "score": 2,
            "author": "FanshaweC",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you",
                    "score": 1,
                    "author": "Trikethedogfish"
                }
            ]
        },
        {
            "level": 0,
            "comment": "\" Provides no slides or study material. The other sections have different profs who do provide slides and study material.  \"  \n\n\nSeems like its more like the professor that is terrible at teaching and not cpa in general,   \nis it garth? haha   \n\n\nit seems like C is just taught so you can appreciate c++ more in the 2nd half and during semester 3 but actually both of them just help you appreciate c# the most imo",
            "score": 2,
            "author": "Braunzz",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes it is Garth, I think allot of us will really appreciate C++ lol",
                    "score": 1,
                    "author": "Trikethedogfish"
                }
            ]
        },
        {
            "level": 0,
            "comment": "is the coordinator still Chad? And is the programming teacher Garth?",
            "score": 0,
            "author": "poomanzilla",
            "replies": [
                {
                    "level": 1,
                    "comment": "Coordinator now is Feeney. Again.",
                    "score": 2,
                    "author": "hungrydruid",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "feeney is a good guy im sure hes doing all he can his hands are probably tied with the teachers union.",
                            "score": 0,
                            "author": "poomanzilla"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The teacher is Garth yes, has form I see",
                    "score": 2,
                    "author": "Trikethedogfish",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I tried taking CPA and Garth was the reason I dropped it. He taught it as if you already knew what you were doing. Terrible",
                            "score": 2,
                            "author": "D1ckRepellent",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That is the best way to describe his teaching method",
                                    "score": 2,
                                    "author": "Trikethedogfish"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "ya garth sucks hes been there way too long",
                            "score": 1,
                            "author": "poomanzilla",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Feeny is good but Garth sucks mk sure Freeney",
                                    "score": 0,
                                    "author": "Key_Confusion_576"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}