{
    "id": "2z2u4f",
    "score": 0,
    "title": "Fat shaming professors?",
    "author": "bullies_on_campus",
    "date": 1426382264.0,
    "url": "https://www.reddit.com/r/DVC/comments/2z2u4f",
    "media_urls": [],
    "other_urls": [],
    "postText": "Honestly, I still can’t believe this actually happened… I was sitting outside, and I was enjoying my time out with my friends after we had gone to a movie eating a post lunch snack and went back to school because we had classes that day. Me and my friends are very comfortable with our bodies, and we are all big ladies. We like to call ourselves the “Large and in Charge” gang, and we all practice HAES. There was six of us out of our usual seven since our seventh was getting us more food, and we had a variety box of donuts, fast food, and pizzas because we wanted to try different things and share.\n\n10 minutes before class starts, One of my teachers was talking to another student walking by. My teacher is extremely FAT PHOBIC and always harps on overweight people during class and how fat people are lazy and a burden to society.  If I bring up any other issue I may be having (like how I eat like a bird even though I'm fat) and how my thyroid had to be removed which leads to weight gain despite me being extremely active and nutritious foods he will dismiss it. I put my head down and tried not to make eye contact when he was walking by. Just then I hear “Gloria, what is this?” as he gestures to our awesome blossom, box of donuts, taco bell, and pizzas. I was stunned and didn’t know what to say….. “but, but…. There are SIX of us, Mr. ____…. And….”\n\nI paused to gain my composure. I politely reminded my teacher that I practice HAES, that I listened to my body and gave it what it needed during the day, and felt I deserved a reward with my friends. My teacher looked befuddled and didn’t know what to say…. I calmly told him that I’m happy with how I look, and am in love with my body, and that HE STILL IS A HYPOCRITE FOR EATING FOOD WITH GLUTEN IN IT DURING CLASS AND HAVING THE NERVE TO SAY I AM THE ONE WHOM IS UNHEALTHY. This ASSHOLE only gave me a shit eating grin and smugly said, “well, with all the rewards, you’re never going to look like ___ here.” He was talking about this skinny bitch twig looking student who desperately needs to eat a hamburger asap. \n\nJust then, the fart I was holding in couldn't contain myself any longer, and the kids around us overheard his comment and started laughing at us! I was so humiliated. I started crying and could barely enjoy my food.\n\nWhen a friend came with another box of pizza , the teacher looked into my eyes and just said, “are you kidding?” and just walked away. I was horrified. I was so brave and courageous to still sit with my friends and try to enjoy my snack, but this pushed me over the edge. I ran out into the parking lot and got in my car. I was hysterical. I was crying for so long, but I was happy that my friends were able to sit and enjoy their pizza still despite that ASSHOLE. I didn’t want him to ruin their day too. \n\nJust then, I hear a knock on the window. My heart almost stopped. I was sure it was that asshole ready to make another awful, hurtful comment to me. I rolled down the window, but it was a very attractive girl who watched what went down. Did she want to hurt my feelings too? She said, “I saw what that asshole said to you… Don’t let anyone make you feel less than beautiful… looks like you forgot something…” and she handed me the slice of pineapple pizza I missed out on\n\nSo I'm thinking this asshole needs to be reported or something? What to do?\n\nedit: I am in tears at being called a \"troll\". I am most certainly not. I suffer from chronic gas and I forgot to take my medication the day  this happened. ",
    "comments": [
        {
            "level": 0,
            "comment": "You had me up until the fart thing. Gr8 b8 m8.",
            "score": 7,
            "author": "xxam925",
            "replies": [
                {
                    "level": 1,
                    "comment": "Came in with my folding chair and popcorn, knew what was up by \"HAES\"",
                    "score": 4,
                    "author": "EkriirkE"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Go back to tumblr",
            "score": 4,
            "author": "sputsput"
        },
        {
            "level": 0,
            "comment": "I apologize about the troll, I'll remember to use the politically correct ogre.",
            "score": 2,
            "author": "PM_ME_YOUR_BESTEST"
        },
        {
            "level": 0,
            "comment": "Benefit of the doubt, I'll take you seriously. If you want anything done you need to record these occurrences. Especially in class. Pics or it never happened applies irl. ",
            "score": 1,
            "author": "Ahtomic"
        },
        {
            "level": 0,
            "comment": "So you were eating multiple unhealthy items, and your upset someone called you out on how unhealthy it is? Your upset someone disagrees with your slowly killing yourself through your path towards obesity? Which is proven to lead to multiple health problems? Blaming a thyroid condition that does not make you overweight since over eating does is nothing to help your point. You also seem to shame the skinny girl thinking she needs to eat more, so it's okay for you to judge her but are not able to deal with being judged?",
            "score": 1,
            "author": "PM_ME_YOUR_BESTEST",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 3,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My post is certainly real. Hers on the other hand is hopeful is not, or she's just in some serious denial. Props to the prof.",
                            "score": 0,
                            "author": "PM_ME_YOUR_BESTEST"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Its a troll albeit a good one.",
                    "score": 2,
                    "author": "xxam925"
                },
                {
                    "level": 1,
                    "comment": "The pizza was gluten free. The skinny girl looked like she was starving. I see so many anorexic looking people on campus, it's scary. I am perfectly healthy at 267 pounds and have never had a health problem besides my chronic gas. Its you who is unhealthy with this mindset that \"obese\" people have health problems when 6/7 days of the week I eat nothing but fruits and veggies.\n\nDid you know that BMI was created as a statistical tool and was never intended to assess a person's health? Since height and weight only tell you how tall you are and how much you weigh, and using a mathematical formula based on those two numbers only gives you a third number, this should be a no-brainer, but no, I thought that BMI had a basis in medical science once too but I was wrong.\n\nDid you know that three diet-drug pharmaceutical companies and a high-up in Weight Watchers were four of the \"experts\" who determined that the BMI valuation should change, thus making 25 million Americans overweight, literally overnight? BMI is bullshit!\n\n",
                    "score": -1,
                    "author": "bullies_on_campus",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I find it very hard to believe you are very healthy at 267. Unless you eat pounds and pounds of veggies everyday there is no way you'd be 267, so that's unlikely your diet. Did I ever say BMI was the end all be all, no, but even under the old standard 267 would have been obese, and in fact unhealthy unless it was a large amount of muscle. Obesity causes a lot of health issues, if you deny that fact you obviously haven't researched very much. When your 300 lbs continuing your trend your joints are hurting, your heart is clogging with build up, and you can't walk the stairs or walk a few miles without being exhausted then you'll see the problems. Being delusional of the potential problems. I also doubt the majority of anorexic looking people as you put it on campus are actually anorexic, that's your point of view to justify your obesity as being something to be desired.  The world isn't a hugbox, no one should have to protect your feelings, you weren't harassed, you just didn't like someone else's opinion of you and got upset.",
                            "score": 1,
                            "author": "PM_ME_YOUR_BESTEST"
                        },
                        {
                            "level": 2,
                            "comment": "I'm laughing right now, a lot of laughs actually. I find it amusing that HAES seems to support being chronically over weight to the point it can cause health problems and says it's okay and healthy, yet they seem to not think the women who is underweight can't be healthy? Is she not a healthy at any size? Oh wait being under and over weight can cause health issues, HAES is proven wrong!?! *headlines*",
                            "score": 1,
                            "author": "PM_ME_YOUR_BESTEST"
                        }
                    ]
                }
            ]
        }
    ]
}