{
    "id": "csmv99",
    "score": 5,
    "title": "phys 130 Textbook sold out",
    "author": "[deleted]",
    "date": 1566246545.0,
    "url": "https://www.reddit.com/r/DVC/comments/csmv99",
    "media_urls": [],
    "other_urls": [],
    "postText": "I know this sub is a bit dead but did anyone get the phys 130 textbook? It's been sold out for weeks and the IBSN returns nothing for me when I google it. I've been trying to find it online or anywhere and I got nothing. The name of the book on the bookstore website is weird too.\n\nIf you have a pic of it or the name on the physical book can someone graciously send it my way. Thanks !\n\nedit: I'm in section 1906 but I'm pretty sure the textbook is the same for all phys 130",
    "comments": [
        {
            "level": 0,
            "comment": "idk if I can help you, but I can say that depending on the prof you may not need the book at all. I'd definitely email the professor before the semester starts, or maybe talk to him in person\n\nalso, I wish this sub was less dead.",
            "score": 5,
            "author": "disndhdisjebdosldx",
            "replies": [
                {
                    "level": 1,
                    "comment": "thanks yeah I'm emailing them tonight ! \n\ni think that the only lively thing about this sub is literally just being a shadow of the Disney vacation club",
                    "score": 4,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Check in with the book store too. If the book is required, they can let you know if they'll be getting it in anytime soon",
                            "score": 1,
                            "author": "zombietaz",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah I called last week and this week and nothing there unfortunately",
                                    "score": 1,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "How did you get the ISBN in the first place? Canvas doesn't show any of my fall classes just yet.",
            "score": 2,
            "author": "ArkBirdFTW",
            "replies": [
                {
                    "level": 1,
                    "comment": "DVC bookstore website you can find out and buy all of your books there by choosing your location, course, and section. They tell you the ISBN there",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "thanks!",
                            "score": 2,
                            "author": "ArkBirdFTW",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "np!!",
                                    "score": 2,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "They should restock pretty soon, but if they don't, you should be fine. Most of physics textbooks are similar and it's mostly professors' preference. One thing though, is if he assign you specific problems as hw, then you might have to ask you classmate.",
            "score": 1,
            "author": "joshua7176"
        },
        {
            "level": 0,
            "comment": "Try libgen.is",
            "score": 1,
            "author": "TrumpIsMyDaddy69"
        }
    ]
}