{
    "id": "k12wlz",
    "score": 3,
    "title": "I've been denied prerequisite equivalency for Math-192 and Math-193. What should I do?",
    "author": "icomputeryou",
    "date": 1606344543.0,
    "url": "https://www.reddit.com/r/DVC/comments/k12wlz",
    "media_urls": [],
    "other_urls": [],
    "postText": "My registration date is 2nd of December and I'm an international student from S. Korea. Admissions and Records denied my prerequisite equivalency form. Should I start from Math-191?",
    "comments": [
        {
            "level": 0,
            "comment": "What did they say?",
            "score": 3,
            "author": "jpsingh1",
            "replies": [
                {
                    "level": 1,
                    "comment": " Hello ,  \n\n\nYour prerequisite equivalency form has been evaluated and the following decision(s) have been made:  \n\n\nMath-192-- Denied  \nMath-193-- Denied  \n\\--   \n\\--   \n\n\nYour prerequisite request has been denied because I am unable to equate your international coursework. You have the option to challenge the prerequisite requirement. To do so, please complete the Prerequisite Challenge form. \n\n&amp;#x200B;\n\nDoes this mean I have to wait until registration and I will only be able to enroll in classes with available seats if I'm lucky enough to clear my prereqs?",
                    "score": 1,
                    "author": "icomputeryou"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would fill out the form and challenge ASAP. I don’t want to stereotype, but a lot of other countries are years ahead of the US in terms of math. Maybe reply sending a recently graded math exam",
            "score": 3,
            "author": "hicksie51",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for the help! Can I challenge before registration date? DVC admissions told me that I can't challenge until the registration date.",
                    "score": 1,
                    "author": "icomputeryou",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh yikes. I would email the professors of the sections you want to take and explain what is going on so hopefully you can make it into their class. But if admissions says you have to wait it’s probably pretty firm",
                            "score": 2,
                            "author": "hicksie51",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well, I think I'll have to wait. I've emailed the one who have reviewed my prerequisite equivalency form but I don't think it'll change anything. I just hope I can enroll in any Math-192 and Math-193 classes for the upcoming Spring 2021. Do you think the classes will fill up quick after 2nd of December?",
                                    "score": 1,
                                    "author": "icomputeryou",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I think a lot of stem classes are already filling up",
                                            "score": 2,
                                            "author": "hicksie51",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Is it common for Math-192 and Math-193 to run out of seats for every section? If so, I think I'll just retake Korean SAT and go to Korean uni... Frankly I don't want to start from Math-191 and spend 3.5 years in community college before transferring to UC/CSU.",
                                                    "score": 1,
                                                    "author": "icomputeryou",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "No you will be able to get in for sure",
                                                            "score": 2,
                                                            "author": "hicksie51",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Thank you! I was worried I might not get in for any classes. By the way, do you know any math/computer club I might join? Does DVC have student forum where students can look for clubs to join? I think I'll need some extracurricular activities to write on the essay.",
                                                                    "score": 1,
                                                                    "author": "icomputeryou",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Ya Google DVCSync",
                                                                            "score": 1,
                                                                            "author": "hicksie51"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "It’s just a matter of getting a teacher you want lol",
                                                            "score": 1,
                                                            "author": "hicksie51"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Unlikely all seats in the higher classes will be taken as the semester is online, just register for those two and do the challenge form after the registration date",
                            "score": 2,
                            "author": "Asphyxiatinglaughter",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you for the reply! Will the math department be lenient? I've gotten 100 on Math part of Korean SAT, graduated 4th from my highschool and read Stewart in advance. I hope they give me some credit for this...",
                                    "score": 1,
                                    "author": "icomputeryou",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Not sure, I transferred a while ago but good luck dude",
                                            "score": 2,
                                            "author": "Asphyxiatinglaughter",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Thank you! I wish you the best and have a nice day!",
                                                    "score": 2,
                                                    "author": "icomputeryou"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Used to work there, but from what I remember, coursework from another country needs to be evaluated before they can accept anything. \n\nYou'll need to check with Admissions for the process on how to get you transcript evaluated in order for your grades to count towards a prerequisite, unfortunately.",
            "score": 2,
            "author": "zombietaz",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for the reply! Do you think I have to wait until the registration date and try for prerequisite challenge so Math Department can evaluate my coursework or will there be any other way to clear the prerequisite?",
                    "score": 1,
                    "author": "icomputeryou",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you want to go down the challenge route, I would reach out to the instructors to get an idea of what they're looking for and how feasible the challenge is based on your previous education, considering it's from another country. Its been two years, so take anything I say with a pinch of salt, but the evaluation method is one way you can try to clear it beforehand. Best bet is to speak to Admissions and records, to be honest! Get your ducks in a row first and then you know what your options are :)",
                            "score": 2,
                            "author": "zombietaz",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you for the help! Should I reach out for the individual instructor that I'd like to enroll or should I speak with the dean/chair of the math department? I thought dean/chair of the math department decides whether I'm eillgible or not. Does instructor of the class I'd like to enroll have a say in deciding whether I pass/fail the prerequsite challenge?",
                                    "score": 2,
                                    "author": "icomputeryou",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Honestly, not too familiar with that side of things. I would reach out to the dean first with your questions and take it from there. I think the evaluation process is costly and not always successful, so this is likely a better route. There's gonna be a ton of people doing the same thing so patience is your ally here, but I would talk to the dean of the math department about it. Counseling is also recommended if you can get a quick appointment to ask them how to approach it too, and admissions to clarify any other options you have to clear the prereq",
                                            "score": 2,
                                            "author": "zombietaz",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Thank you! I'll talk to the dean first. I hope everything goes well... Thank you again for the help and have a nice day!",
                                                    "score": 1,
                                                    "author": "icomputeryou"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}