{
    "id": "33ju5p",
    "score": 5,
    "title": "Housing? What should I pick?",
    "author": "cocomarshmallow",
    "date": 1429756191.0,
    "url": "https://www.reddit.com/r/Gonzaga/comments/33ju5p",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello! I recently committed to Gonzaga, and I will be a new student this coming Fall. I have been filling out the housing application and I was wondering what is the best housing socially? When I toured Gonzaga my tour guide gave me a tour of Madonna, Dillon, and Coughlin.\n\nAt the moment my first two choices are Madonna (First Choice) and C/M (2nd Choice). I picked Madonna because it seemed cleaner than C/M and it has a sink in the dorm. I was wondering if Madonna is a good choice socially? I understand C/M is a very social dorm, but I want a dorm that is a little bit cleaner a bit less hectic. So is Madonna a good choice? Or should I put down C/M as my first choice?\n\nPlease give me advice and personal stories about the dorms! Also what should I put as my third choice? Thank you!",
    "comments": [
        {
            "level": 0,
            "comment": "If you want clean and social I would suggest checking out Coughlin. I lived there my first two years on third floor. It gets a lot of hate from other students but I think it's a good choice. Coughlin the newest and cleanest dorm IMO but there's also enough people that if you like to party of want to you can find the right people to do that with. And C/M is right next door so it's easy to just pop in on weekends. ",
            "score": 5,
            "author": "cnnrcmbs",
            "replies": [
                {
                    "level": 1,
                    "comment": "I agree with Connor. Definitely apply for coughlin. ",
                    "score": 1,
                    "author": "Rudayb"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Granted, this was a decade ago, but:\n\nFirst year I was in Catherine/Monica. I was in room 69, actually, which meant that drunk kids would sometimes make pilgrimages to my dorm so they could giggle about the room number. Catherine/Monica was great. It was all freshmen, it was extremely social. Top floor was girls, ground floor was guys.\n\nSecond year I lived in Madonna. I was actually an RA there, so I had my own room. At the time, first and third floor were women, second floor was men. The men on the second floor, I believe, were all freshmen. The women were a mix of freshmen and sophomores.\n\nBut man, C/M was better. The common areas were better. There was more to do, and more people hanging out at any given time. And everyone being a freshman definitely was a bonus--everyone's out trying to feel out this college thing, trying to meet people. Having a sink in your room isn't really worth going with Madonna. CM is just awesome.\n\nGranted, you know, things have probably changed in the past decade, so this might not even be relevant info anymore.",
            "score": 5,
            "author": "gunslingerroland",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was in 77 (2002-03) I think. SE, right? When were you there?",
                    "score": 2,
                    "author": "zag83",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, SE I think. I was there 04-05.",
                            "score": 1,
                            "author": "gunslingerroland",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Would 69 be on the side facing Hamilton or the side facing the field? I'm just trying to think of who lived in that room when I was there. If it's where I think it was, it would be pretty close to the RA's room, right? I might have even been friends with your RA.",
                                    "score": 1,
                                    "author": "zag83",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah, it was on the Hamilton side. It was the room closest to the stairway, too. It was... maybe 4 or 5 rooms from the RA? Hard to remember. The RA in that hall at the time was Jack.\n\nEdit: Just remembered the RA's room was actually around the corner in SE, so I wasn't near his room. I was near his buddy's room.",
                                            "score": 2,
                                            "author": "gunslingerroland",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah the RA's room was right next to the one triple room basically at the corner in the middle of the hall. I didn't know your RA. Important question since you were by the staircase, did your window face out towards Hamilton or inward towards the courtyard? Two of my best friends lived in one and a super weird kid lived in the other.",
                                                    "score": 1,
                                                    "author": "zag83",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It faced Hamilton. Also, I think I could be accurately described as weird. Maybe not super weird. My roommate was well-adjusted, though.",
                                                            "score": 2,
                                                            "author": "gunslingerroland",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Ok, that was the weird kids room. I mean like so weird he freaked out and had to leave school weird. My room was the one right across from the one with the weird door (I think it used to be a computer lab), basically right in the middle of that part of the hall. Also faced Hamilton.",
                                                                    "score": 1,
                                                                    "author": "zag83"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I agree with the last two posts. Madonna is great socially but it is freshmen and sophomores so you get a mix and won't necessarily meet as many people in your class. Same with Coughlin. I have lots of friends that live in Coughlin and they're all great.\nYou can't go wrong with the dorms though. You will become super close with your hall and make tons of great friends. I lived in CM my freshman year and yeah it was messy but I learned to deal with it. I live with guys from my hall last year and I'm living with guys from my hall next year too. \nBottom line is if you're social, you'll meet other social people and make great friends wherever you live. The sinks in Madonna are really nice and the rooms are big, CM is amazing because of the community, and Coughlin is a bit of both.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Take my advice with a grain of salt as I went to GU from 2002-2006, but C/M is the biggest dorm and co-ed, so if that is important to you, then I would suggest trying to get in there first. Madonna didn't have anything going on compared to C/M when I was there. I heard Madonna looks better now, but they couldn't have changed that much on the inside there only so much you can do with that. Having a sink isn't really that big of a deal. The furthest away you're going to be from a bathroom is maybe like 100 feet and that's if you live at the end of one of the halls, and if you live there that's just less space you have to cover to sneak beer in. Win/win.\n\nThe most important part is not getting stuck with a crappy lottery number for your 2nd year. You don't want to get stuck in a place like Dooley like I did. ",
            "score": 1,
            "author": "zag83"
        },
        {
            "level": 0,
            "comment": "Search the history. Most freshmen end up in the big dorms, the rest get placed randomly. So be prepared to have a random choice on your short list. ",
            "score": 1,
            "author": "joepls"
        },
        {
            "level": 0,
            "comment": "for the love of god unless you want to party do not live in CM",
            "score": 1,
            "author": "[deleted]"
        }
    ]
}