{
    "id": "4scva7",
    "score": 4,
    "title": "What's my dorm like?",
    "author": "[deleted]",
    "date": 1468266311.0,
    "url": "https://www.reddit.com/r/Gonzaga/comments/4scva7",
    "media_urls": [],
    "other_urls": [],
    "postText": "I recently got placed in Coughlin Hall and I've heard nothing but great things about it. I've done a lot of research on the dorm, but I want to know what it's like from a students perspective. What the layout is? What the LLC's are like? What's it like living in a Sophomore/Freshman Hall? Any cool stories?\n\nAlso if you guys have any tips freshman year feel free to share. Thanks and Sko' Zags!",
    "comments": [
        {
            "level": 0,
            "comment": "Covered in rattata.",
            "score": 14,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "First off, welcome to Gonzaga! I lived in Coughlin both my freshman and sophomore year on the third floor, Cura Personalis.\n\nEach floor has similar layouts with a girls side and a guys side and a common room on both wings plus additional hangout spots in the middle. The wings are set up as so all the room are on the outer walls and the bathroom is in the middle. Second and fourth floor has a library/study room as it's main common room with a TV/game room on the side where as third and fifth floor have the TV/game room as it's main common room and a study room on the side. All the floors have kitchens in them as well. \n\nBeing on third floor I felt like we had it the easiest as far as requirements for the LLCs. Leadership has to do so many leadership positions, Service has to do so many service hours, and Cultures has to do so many cultural events. Cura Personalis didn't require us to do a whole lot, just attend guest speakers during our hall dinners. \n\nLiving with sophomores as a freshman is great. They really help in that mentor aspect when it comes to professors, majors, registration, etc. Don't be afraid to ask for help, whether it be from a resident or an RA. \n\nI'm not sure if this still holds true from my freshman year a couple years ago but the second and third floor used to have this rivalry, at least amongst the guys, so we would have some friendly competitions outside when the weather was nice. Things like softball, touch football, etc. \n\nOne downside that I noticed when I look back on living there is that people in Coughlin tend to just make friends with other people in Coughlin. Not that it's a bad thing to have friends in your dorm it's just that those were their only friends. I was guilty of this and I really wished I had made friends in C/M, Desmet, Twohy, etc. \n\nIt is a really great place to live and you're lucky you got to be in such a nice dorm. I know I gave you a lot but if you have any additional questions feel free to DM me! ",
            "score": 6,
            "author": "cnnrcmbs",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh hey cnnr 😏\n\nEdit: side note, it has the nicest floors to pass out I mean nap on",
                    "score": 2,
                    "author": "phalanx94",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "smh now I'm over here trying to figure out who you are",
                            "score": 1,
                            "author": "cnnrcmbs",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Good luck with that, my floor nights on Cura personalis were before you got there",
                                    "score": 1,
                                    "author": "phalanx94",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "yeah that would make it difficult",
                                            "score": 1,
                                            "author": "cnnrcmbs"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thanks for all the help! About how many people live on each floor?",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Around 80 if you count both wings, 40 for each individual side. ",
                            "score": 1,
                            "author": "cnnrcmbs"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I didn't live in coughin but I spent a lot of time there freshman year because a had a number of friends there. Each floor has the same layout: two wings with guys on one side and girls on the other (except for the all girls floor) with a large common area in each wing and an even bigger common area in between the two wings. Everyone liked to hang out, talk, and study in the common areas and everyone that I knew there was friendly and genuine. The sophomores and the freshmen got along very well and the sophomores would often mentor and help the freshmen figure out how to transition into college living, as it isn't always easy. It's a great place and I hope you have a fun freshman year!",
            "score": 3,
            "author": "Lava_pants"
        },
        {
            "level": 0,
            "comment": "Hey! I lived on Coughlin 3rd Floor (cura personalis) last year as a freshman and will be there this year! Pm me, I'd love to get to know you! ",
            "score": 1,
            "author": "EddyIsReady"
        }
    ]
}