{
    "id": "g8q760",
    "score": 23,
    "title": "We'd like to extend an invitation to Gonzaga CS students...",
    "author": "Senior-Jesticle",
    "date": 1587947925.0,
    "url": "https://www.reddit.com/r/Gonzaga/comments/g8q760",
    "media_urls": [
        "https://www.reddit.com/r/Gonzaga/comments/g8q760/wed_like_to_extend_an_invitation_to_gonzaga_cs/"
    ],
    "other_urls": [
        "https://www.notion.so/Make-a-product-not-a-project-bb80113a15f24ba2b43ddf6a194a0259)**.**",
        "https://airtable.com/shrdXVAcPd8HMNDDN](https://airtable.com/shrdXVAcPd8HMNDDN)",
        "https://join.slack.com/t/gonzagatechnetwork/shared\\_invite/zt-e6anpclc-awhcOtXUaljWVXni3XNxUQ](https://join.slack.com/t/gonzagatechnetwork/shared_invite/zt-e6anpclc-awhcOtXUaljWVXni3XNxUQ)",
        "https://airtable.com/shrazCNn5S0hOrIlU](https://airtable.com/shrazCNn5S0hOrIlU)",
        "https://join.slack.com/t/gonzagatechnetwork/shared\\_invite/zt-e6anpclc-awhcOtXUaljWVXni3XNxUQ](https://join.slack.com/t/gonzagatechnetwork/shared_invite/zt-e6anpclc-awhcOtXUaljWVXni3XNxUQ)"
    ],
    "postText": "CS students,\n\nThe job market that you're going into is going be tougher than the one we (the alumni) went into. You may have had an internship program, or even a full-time job, renege on their offer to hire you this summer. If you're still looking, you may notice less job postings, or if they're around, they're hiring folks more senior than you believe yourself to be. We cannot imagine the stress and fear you may be going through, especially while you're also managing one of the largest natural disasters in living memory.\n\nThe Gonzaga Tech Network is a growing organization of alumni with backgrounds at Amazon, Google, Mozilla, Segment, the Climate Corporation, WorkOS, Retool, Red Hat, Honeywell and other Y Combinator startups.\n\n**We are committed to running an 8-week summer program from May 11th to July 3rd.** This program is meant to be a self-directed internship or first job with support and mentorship from the network.\n\nIn GTN, students build [**products, not projects**](https://www.notion.so/Make-a-product-not-a-project-bb80113a15f24ba2b43ddf6a194a0259)**.** A *product* is one that is launched in production and used by real people. Only by getting something launched can you gain real experience like you'd get at a company. 90% of software engineering happens *after* you've launched and *after* people are using it.\n\nWe ask you submit an idea (or multiple ideas) for a *product*. You can pick something you were already working on or you can say that you don't know and let us suggest something. Similarly, you can switch your product at any point; you're never locked in. Success in the GTN program is not building something, it's *launching* something you've built. And then to continue to iterate on it, to talk to the people that use it, and to fix the problems that arrive. *That's* the job of a technologist, and that's what you'll learn.\n\nWe recommend (but do not require) people to make a product that they can sell or otherwise make revenue from. It's counter-intuitive, but it makes it way easier to launch your product and stick with it. It's the best incentive. Plus having a bit of extra cash in the bank can boost your opportunities.\n\n## What happens during the summer?\n\nEvery week we will meet with you or your team (over Zoom) and discuss blockers from the previous week and scope work for the next.\n\nEvery two weeks, we'll meet as a group (over Zoom) and demo to all members progress you've made.\n\nThroughout the entire program, network members will be available asynchronously (in Slack) to answer questions, provide feedback, or general advice.\n\n## Apply\n\nApply by filling out this form: [https://airtable.com/shrdXVAcPd8HMNDDN](https://airtable.com/shrdXVAcPd8HMNDDN)\n\nThen signup for the slack group here: [https://join.slack.com/t/gonzagatechnetwork/shared\\_invite/zt-e6anpclc-awhcOtXUaljWVXni3XNxUQ](https://join.slack.com/t/gonzagatechnetwork/shared_invite/zt-e6anpclc-awhcOtXUaljWVXni3XNxUQ)\n\n# I'm an alumni, how can I help?\n\nWe'd love to have you onboard! Fill out this form [https://airtable.com/shrazCNn5S0hOrIlU](https://airtable.com/shrazCNn5S0hOrIlU) and join our slack group here: [https://join.slack.com/t/gonzagatechnetwork/shared\\_invite/zt-e6anpclc-awhcOtXUaljWVXni3XNxUQ](https://join.slack.com/t/gonzagatechnetwork/shared_invite/zt-e6anpclc-awhcOtXUaljWVXni3XNxUQ)\n\n## FAQ\n\n* What's the app process like?\n   * Simply fill out the application form above.\n* When will I know if I got into the program?\n   * Within a week of submitting your application.\n* How exclusive is it?\n   * Our goal is to accept as many applicants as possible. We won't reject participants based off of degree or previous experience.\n* Do I need to know how to program?\n   * Yes, at least partially. We will provide help along the way, but for the most part we expect some degree of self-sufficiency.\n* Do I have to be a computer science major?\n   * Not necessarily. We won't exclude based off of degree, but we do expect you to be able to build your proposed project.\n* What are the time expectations?\n   * We don't have set time requirements; however, we expect you to have a finished product by the end of this program. Our mentors can help you create time-oriented goals in order to launch your product and get it into the hands of customers as soon as possible.\n* What technologies can I use?\n   * We have no requirements for using certain technologies. We encourage you to use whatever will help you be successful in your coding.\n* What if I don't have a formal idea?\n   * Our goal is to help you create your own product; however, we do have a list of ideas that you may choose from if you're completely stumped.\n* Do I have to work as an individual or can I work with a team?\n   * Complete your product as an individual or a team, choose your own adventure.\n\n&amp;#x200B;\n\nStay inside,\n\n\\- Gonzaga Tech Network",
    "comments": []
}