{
    "id": "ia396s",
    "score": 5,
    "title": "What was the off campus housing situation like last year?",
    "author": "teecos",
    "date": 1597476732.0,
    "url": "https://www.reddit.com/r/Gonzaga/comments/ia396s",
    "media_urls": [],
    "other_urls": [],
    "postText": "I graduated back in 2014 and have been considering investing in a house to rent to students. I was curious of any students that could share what the off campus rental situation was like these past few years. I know of the off campus site and have checked out the listings available there but was looking for some of your experiences. I'm happy with any information I can get, but particularly interested in the following:\n\n* Location wise what matters other than how close to campus it is? I lived near Safeway and personally loved that\n* What do you pay for rent? Would +/- $50 a month in rent for your room have made a big difference in your decision?\n* How far away do you know of students living? Or what do you think of as the borders\n* Is it harder to find big houses (4+br) or small houses (2-3br)? Any other specific features you were hoping to find in a house?",
    "comments": [
        {
            "level": 0,
            "comment": "Class of ‘20 grad here. Lease signing has gotten competitive over the last couple of years and students tend to sign summer of freshman year - early first semester sophomore year (Probably a little different this year due to Covid).\n\nLocation wise, I would say is getting pretty competitive. A lot of students are starting to get picky and want to live DeSmet 1000s, Sharp, Sinto, Mission and the cross sections of Lidgerwood, Astor, and Cincinnati. But I know a handful of people who lived all the way to Montgomery. I personally didn’t care how close I was to Safeway. I think the big thing was being close to Jack and Dans, Tav, and McDonalds. Seniors last year started going downtown to Zola. \n\nRent from what I’ve experienced has been anywhere from 400-600 and it’s going up (every two years) now that the even numbered grad years are moving into the Logan. An extra 50 wouldn’t have deterred me, but I’d only be willing to pay if it’s closer to campus and a nicer house. \n\nAgain, a small amount of people all the way to Montgomery. Students are highly concentrated near mission park, McDonald’s, or Lidgerwood and Astor. \n\nMany houses are 6-8. It’s probably harder to find smaller 3-4 person houses. I think 6 is the most common size. Personally I just don’t want my house to be a shithole. It doesn’t have to be granite countertops or hardwood floors. But something livable and can make it our own. I have started to see a lot of landlords making significant upgrades to houses though.\n\nHope this helps!",
            "score": 14,
            "author": "GiveMeKnucks",
            "replies": [
                {
                    "level": 1,
                    "comment": "This was very helpful, thank you for the detailed response! \n\nSounds like the Hamilton side is still more desirable. Is Ruby still basically the border on the west?",
                    "score": 1,
                    "author": "teecos",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I would say Ruby is still the border, but I didn’t know anyone who lived west of Lidgerwood. So realistically I’d say more Lidgerwood.",
                            "score": 3,
                            "author": "GiveMeKnucks"
                        }
                    ]
                }
            ]
        }
    ]
}