{
    "id": "rpxm5p",
    "score": 1,
    "title": "Cars for College",
    "author": "Usual-Cheek-7452",
    "date": 1640639986.0,
    "url": "https://www.reddit.com/r/Gonzaga/comments/rpxm5p",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey guys! I'm from a state that it rarely snows in and am looking at Gonzaga. I want to bring a car to college but am having trouble deciding which car to bring. Should I bring one with four wheel drive? What brand of car? Should I even bring a car? Please let me know what you guys think! Thank you!",
    "comments": [
        {
            "level": 0,
            "comment": "As far as bringing a car, definitely do it. The pass is 100$ a year, and there’s a lot of parking as long as you’re ok with walking a few minutes if need be. The garage is great for the winter so you don’t have to defrost your car. You definitely need one with FWD/AWD, and as far as brands go anything that will be safe in snow is good. Most people have bigger SUV/trucks, but I drove a AWD wagon and was 100% ok. They maintain the roads decently well in the snow. Just know that you’ll need to wash your car regularly to avoid rust from the salt they use.",
            "score": 9,
            "author": "mrwrldwwide"
        },
        {
            "level": 0,
            "comment": "Make sure to bring a car that isn’t statistically easy to break into. Car theft and property crime is prolific in Spokane",
            "score": 1,
            "author": "ST3AMB0ATW1LLIE"
        },
        {
            "level": 0,
            "comment": "I had a fwd when i first moved here then switched to an awd with winter tires and never looked back.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Bought 6 year old Outback as my first car in college in a cold-weather state.  I'm not a car person by any means.  \n\nThat being said, I haven't had an issue with it for over 50,000 miles (it's at 105k now), the AWD has carried myself and dozens of friends to ski trips across the entire western US, and I've road tripped in it during moves across 4 states totaling over 2000 miles while carrying everything I've owned inside.\n\nI can't think of another car that I would have rather had for that period of my life.",
            "score": 1,
            "author": "basegeartouchngo"
        }
    ]
}