{
    "id": "w69f8s",
    "score": 3,
    "title": "gonzaga dorms",
    "author": "Usual-Cheek-7452",
    "date": 1658597489.0,
    "url": "https://www.reddit.com/r/Gonzaga/comments/w69f8s",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey y'all! I have a question about buying a router. I visited my friend this past summer at her college and she said that every person in the dorm buys their own router and has their own wifi in their rooms because the university wifi stinks and is slow. My brothers university did not allow people to buy their own routers. So I am wondering if 1) Gonzaga lets you buy routers for your room and 2) if you feel like it is needed or is the campus wifi good enough. thank you!",
    "comments": [
        {
            "level": 0,
            "comment": "Campus WiFi was good enough, I didn't know of anyone buying their own router. \nAll the residence halls I lived in also had Ethernet ports in the rooms, and you could get Ethernet cables from the school, so if you're really worried you can just hardwire your technology.",
            "score": 18,
            "author": "ihateferries"
        },
        {
            "level": 0,
            "comment": "We bought a router in our dorm but honestly, it wasn’t totally useful. The campus WiFi is good and wired is really good.",
            "score": 6,
            "author": "HPBigfoot"
        },
        {
            "level": 0,
            "comment": "All the dorms are wired. Unless you have gigabit fiber at home this will probably be the fastest internet you have seen if you pug in. Wireless coverage is also excellent especially after Covid when they had to upgrade the infrastructure.",
            "score": 3,
            "author": "livinonthereg"
        },
        {
            "level": 0,
            "comment": "campus wifi is definitely good enough, with ethernet i believe i got around 1 gig up and down. also i don’t even think you’re allowed to get your own wifi",
            "score": 3,
            "author": "Aerospaces1"
        }
    ]
}