{
    "id": "x2tvuc",
    "score": 13,
    "title": "Be Careful on Centennial Trail",
    "author": "GodsGiftToNothing",
    "date": 1661993748.0,
    "url": "https://www.reddit.com/r/Gonzaga/comments/x2tvuc",
    "media_urls": [],
    "other_urls": [],
    "postText": "I live near the trail, and feel it’s important you know the danger you’re in, when on the trail.\n\nThere are homeless people hiding in the bushes everywhere - with weapons.  My husband and I were chased while walking our giant dog, by a man with a machete - and it’s not the first time.  People have pretended to pass out on the trail.  The moment you have walked FAR around them, they get up, and they, along with their accomplice (who was hiding in the bushes), wait for someone else to walk by.  Drug deals are a constant, the trail is littered with needles.  There have also been a lot of young men who’ve ended up in the river, and it doesn’t feel coincidental, especially if you’ve lived here long enough.  \n\nIf you are going to use the trail, please be safe and aware of your surroundings.  Don’t go at night, and if you have to, go in a group.  I have literally watched cars follow women, and only stop when they see me calling the cops.  \n\nSpokane is like any other city, it has its good, and it’s bad.  The trail can be great, but I implore you to be safe.  I genuinely don’t want find one of the students dead while I’m out with my dog.  Please be safe.",
    "comments": [
        {
            "level": 0,
            "comment": "I’d be more worried about the sexual abuser priests that Gonzaga protects and houses.",
            "score": 2,
            "author": "Powerful_Put_8763",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well, as a survivor of childhood SA, yes, I take that seriously.",
                    "score": 1,
                    "author": "GodsGiftToNothing"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This seems a bit overstated to me. I lived in Spokane for years and used the trail on a weekly basis to run, bike, etc. and I can’t say I ever once felt in danger or saw anything like you have mentioned here.",
            "score": 1,
            "author": "noah_inc",
            "replies": [
                {
                    "level": 1,
                    "comment": "My experience vs yours.  I live where the body was found.  I don’t want everyone to stop running it, I just want them to be aware.",
                    "score": 1,
                    "author": "GodsGiftToNothing"
                }
            ]
        }
    ]
}