{
    "id": "yozv84",
    "score": 10,
    "title": "Snow",
    "author": "Usual-Cheek-7452",
    "date": 1667854106.0,
    "url": "https://www.reddit.com/r/Gonzaga/comments/yozv84",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey yall! So my friends and I got season passes to Schweitzer and we couldn't be more stoked to go! Im from a state that it never snows in and I have never driven in snow but I am the only with a car here so I have to drive my friends. My car has all wheel drive but do yall think I should buy snow chains for my tires if I am going to be driving from her to the mountain?",
    "comments": [
        {
            "level": 0,
            "comment": "You'll be fine, but be VERY careful the first time you drive in the snow. You'll get used to it quickly, but that first time can be dangerous. Drive around in an empty parking lot first. \n\n\nMaybe this sounds overly cautious to you, but I remember my first time driving in the snow and I almost ran into the car in front of me. For context, I'm from WA so I know how to drive in heavy rainfall. Snow is its own animal.",
            "score": 6,
            "author": "Awsome306"
        },
        {
            "level": 0,
            "comment": "No you’ll be fine. At least to the base of the mountain. There are shuttles at the bottom to Schweitzer if you’re really worried.",
            "score": 5,
            "author": "rory_4"
        },
        {
            "level": 0,
            "comment": "You’ll be fine. They keep the road to Sandpoint pretty clear.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "You're probably fine for a few trips, but chains are one of those things that you don't need until you can't get them.",
            "score": 2,
            "author": "ktnolan"
        },
        {
            "level": 0,
            "comment": "chains cant hurt to keep in your car, but **more importantly**, on an icy day go to an empty parking lot and practice driving on ice and pumping your brakes so you know what it feels like to slide!!!",
            "score": 2,
            "author": "tonidonteatcheese"
        },
        {
            "level": 0,
            "comment": "I know there a lot of videos out there on how to drive in snow but I found this one helpful. \n\nIt has general speed advice, and what to do in a slide.\n\nhttps://youtu.be/TZQXuWzBC18",
            "score": 1,
            "author": "Alexneedsaname"
        },
        {
            "level": 0,
            "comment": "You'll be fine. Like others have said, be sure to practice driving in the snow - empty parking lots are great. A few tips: \n\n1. When it snows, you take a LOT longer to stop at high speeds - increase the space between you and the car in front of you. \n2. WHEN (not if) you start to slide when braking, do NOT press harder on your brakes - this seems counterintuitive, but release the brake and try again. This is called pumping your brakes &amp; this will stop you and will prevent your brakes from locking up. \n3. When turning, if you hit ice and start to slide, do NOT turn your wheel. If you're already sliding, turning your wheel will make your next move harder to predict. Wait until you stop, then SLOWLY press the gas and turn the wheel. \n4. Drive with confidence. Being timid or nervous while driving in the snow is going to cause an accident - don't brake unless you actually need to slow down or stop, don't drive ridiculously slow, etc. The most important thing to keep yourself (and others) safe is to be predictable on the road.",
            "score": 1,
            "author": "tealchameleon"
        }
    ]
}