{
    "id": "4xff64",
    "score": 6,
    "title": "Incoming Freshman",
    "author": "crickrej",
    "date": 1471030942.0,
    "url": "https://www.reddit.com/r/ClarkU/comments/4xff64",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello, i am an incoming freshman and i will be staying in campus. I am coming from a foreign country. I was just wondering if there are ny special tips or anything you have in mind for me. ",
    "comments": [
        {
            "level": 0,
            "comment": "Week one will tire you out, but the pace slows waaaaay down after that. Worcester pizza factory for pizza, happy house for Chinese, Yoway for yogurt/bubble tea. Very weed friendly campus, but don't be an idiot about it. The professors are amazing and most of them are so friendly and helpful in person even though they can be intimidatingly smart. Also, geography 4eva",
            "score": 4,
            "author": "dakaroni"
        },
        {
            "level": 0,
            "comment": "That depends on what you want out of your college experience! There are tons of international students but they generally go down one of two paths: \n\nFirst is to stick to people from the same country/continent as you. There are enough international students with similar cultures and languages for you to have a tight, albeit small group of friends for your entire four years.\n\nTwo: You really commit yourself to making and keeping friends from outside of that group. AKA with American students. The big key here is to brush up on your English and speak it often. I can tell (no offense) that English is your second language. I had a roommate who was from Vietnam and barely spoke English, but the problem was that he barely even tried and stuck to his friends, language, and comfort zone. I had a second Vietnamese roommate who I requested to live with because he sought out Americans in his major and spoke English more often and better than my first roommate.\n\nI would suggest this to any first year: Put yourself out there and get out of your comfort zone. I'm talking within the Clark bubble. You'll have to work to make friends and it **will** be harder for you being from a foreign country. That being said, it's really up to you whether or not you want to be one of the nameless, faceless internationals or you want to be the part of the diverse community at Clark.",
            "score": 4,
            "author": "_Jake_The_Snake_"
        },
        {
            "level": 0,
            "comment": "when I was at Clark there was a pretty fantastic international student community (for undergrads, not so much for grad students). Some cliques felt a little bit exclusive at times, but that was probably because I was a little jealous that I wasn't always invited to things. :/\n\nIn terms of tips- you don't always have to do the same social activities as your friend group. Go to activities that you've never tried before. Clark is small enough that you can go to a random activity by yourself and you'll always find someone to chill with ",
            "score": 2,
            "author": "rfr7399"
        }
    ]
}