{
    "id": "13f3nmq",
    "score": 3,
    "title": "Is it possible to complete a Major and 2 Minors in 3 Years",
    "author": "Loii17",
    "date": 1683847368.0,
    "url": "https://www.reddit.com/r/BostonU/comments/13f3nmq",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm transferring from another college and I had to take the spring semester off, Right now I'm planning how I could fulfill my Major and HUB requirements to graduate on time, I also want to do 2 minors, one of which has courses crossed with my major. Is it feasible to do 2 minors and 1 major in 3 years?\n\nNote: The Major would be Economics and the minors Business Administration and Public Relations; I have 16 credits from my previous college",
    "comments": [
        {
            "level": 0,
            "comment": "If you take summer classes and plan accordingly, overload and stuff, it might be possible",
            "score": 6,
            "author": "ACoolSea"
        },
        {
            "level": 0,
            "comment": "Not without summer class and/or overloading. Too little credits u have.",
            "score": 5,
            "author": "mhddddd"
        },
        {
            "level": 0,
            "comment": "It’s possible, but definitely not without overloading (however you’ll need to overload regardless of major/minor to meet 128 credits).\n\nHere are some tips as an econ major, business minor (I know nothing about public relations minor).\n\nI think transfers only need 10 hub units, and 5 should be fulfilled from econ prereq and principal courses (SO1/SO2, QR2, ETR, CRT, RIL). To my knowledge, none of the econ courses fulfill SI1, PLM, AEX, CRI. Plan accordingly. Try to fill as many hubs with major/minor classes.\n\nIf you take SM131 and SM132 the same semester, either don’t overload that semster or take an easy class. Both classes require a lot of work. A good amount of people have to retake 132 (if you like and are good at finance, it won’t be bad, just time consuming for 2 cr).\n\nOverall, plan well and meet with advisors (from all colleges), and you can probably do it, but it won’t be easy.",
            "score": 1,
            "author": "throwaway34_account"
        },
        {
            "level": 0,
            "comment": "i’m taking econ major w business and another minor in 3.5 years and i had 12 credits from hs. you will have to overload and possibly take classes at a community college or bu over the summer. i can finish my major and two minors in 3 years but i need 3.5 to get to 128 credits",
            "score": 1,
            "author": "wanttobehappylol"
        }
    ]
}