{
    "id": "13f5mca",
    "score": 24,
    "title": "how those threatening to ruin commencement expect us to react",
    "author": "TrulyLimitless",
    "date": 1683852382.0,
    "url": "https://www.reddit.com/r/BostonU/comments/13f5mca",
    "media_urls": [
        "https://i.redd.it/c586bchn9cza1.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "idk man. bill cosby was at my commencement and I wish we booed the fuck out of him",
            "score": 52,
            "author": "OHenryTwist"
        },
        {
            "level": 0,
            "comment": "the more i see posts like this the more I want the commencement to be ruined",
            "score": 30,
            "author": "og-tortilla"
        },
        {
            "level": 0,
            "comment": "respectfully…. as someone who graduated from com last year this strike is a big deal for everyone who works in the entertainment industry and the fact that bu invited one of the big execs directly opposing it to speak at graduation is incredibly insensitive to its graduates. literally every other union in hollywood has banded together to support the WGA and the least students can do to support their com peers is show respect to those choosing not to participate in commencement. even if you want to attend, don’t be condescending and insensitive to those choosing not to. have fun crossing the picket lines",
            "score": 11,
            "author": "oopsididitagain2000"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 8,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "where else would it happen tho 😭😭 “celebrating all the hard work we put in” babes please tell me you didnt go to college to go to a one-day event 💀",
                    "score": 6,
                    "author": "weewoott",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think it's about catharsis.  If there are outside stressors it adds to the negativity and makes it not cathartic.",
                            "score": 3,
                            "author": "Crazy_Discount"
                        },
                        {
                            "level": 2,
                            "comment": "U sound stupid Karen",
                            "score": -2,
                            "author": "twitch_blackboy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "and u sound like a yes-man",
                                    "score": -1,
                                    "author": "weewoott"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hello",
            "score": 0,
            "author": "florence_wins"
        }
    ]
}