{
    "id": "13fu6uk",
    "score": 15,
    "title": "Need Apartment Advice: How to Food",
    "author": "TheMan_03",
    "date": 1683918737.0,
    "url": "https://www.reddit.com/r/BostonU/comments/13fu6uk",
    "media_urls": [],
    "other_urls": [],
    "postText": "How do you optimize your food budget? \n\nI am thinking of buying crickets and eating that with rice, chicken, and Brussels sprouts every day. I don't mind if the food I eat for the summer is bland, as long as I get every vitamin and it can keep me going. \n\nAny resources too for free food (i.e., food pantries, etc.)?\n\nI appreciate any other general apartment-ing/adult-ing advice. Will be a fun experience.\n\nThanks!",
    "comments": [
        {
            "level": 0,
            "comment": "if ur being serious ab the cricket thing i support it they can be super yummy/nutritious if prepared the right way",
            "score": 10,
            "author": "LongjumpingClient159",
            "replies": [
                {
                    "level": 1,
                    "comment": "At first i thought this was a shitpost.",
                    "score": 7,
                    "author": "InterestingPickles"
                },
                {
                    "level": 1,
                    "comment": "I second this",
                    "score": 1,
                    "author": "cbx_k"
                }
            ]
        },
        {
            "level": 0,
            "comment": "In terms of grocery stores, I find Trader Joe’s to be the most affordable. If I’m absolutely dragging rock bottom, I can get a week’s worth of food for $50. You’ll have less options because it’s Trader Joe’s, but those options are pretty good.",
            "score": 6,
            "author": "boat--boy"
        },
        {
            "level": 0,
            "comment": "Don't use food pantries unless you have actual financial hardship. There's a lot of people in Boston who are legit homeless and rely on that food to survive.",
            "score": 1,
            "author": "FrequentEducation192"
        },
        {
            "level": 0,
            "comment": "Hi, BU actually opened up two new food pantries one on the Charles river campus and one on the med campus. I’m not sure which are near you but here is the link. Boston is such an expensive city and I totally understand the hardships and feel free to DM me for more resources. https://www.bu.edu/studentwellbeing/place-a-bu-food-pantry-order/",
            "score": 1,
            "author": "Educational-Ad2428"
        },
        {
            "level": 0,
            "comment": "If you have work study, you are eligible for SNAP food stamps through the state! Google MASS DTA Snap or something similar and it’ll lead you through how to apply",
            "score": 1,
            "author": "daprei"
        },
        {
            "level": 0,
            "comment": "china town / chinese supermarket groceries. frozen dumplings. big frozen vegetables bag. big bag of rice",
            "score": 1,
            "author": "GravityTree",
            "replies": [
                {
                    "level": 1,
                    "comment": "or SNAP",
                    "score": 1,
                    "author": "GravityTree"
                }
            ]
        },
        {
            "level": 0,
            "comment": "No way you’re that poor and go to bu. You need to figure out some budgeting first if literally all your money is in housing and you have nothing for anything else.\n\nThat said, 80/20 ground beef is the best bang for your buck as it’s the cheapest with the highest calorie content / nutritional value. Also, if you’re buying chicken already why the fuck would you buy crickets. Get your carbs from sweet potatoes and regular potatoes, as those are cheap and nutritional, though not as cheap as rice. The only thing your diet would be missing is vitamin C so you’re gonna have to eat some grapefruit or oranges, whatever’s cheaper, assuming vegetables cover your other needs.",
            "score": -22,
            "author": "chuckjoejoe81",
            "replies": [
                {
                    "level": 1,
                    "comment": "You did not just say “no way you’re that poor and go to bu” as if everyone here has disposable income or even no disposable income lmaoo it just reeks of privilege omg",
                    "score": 10,
                    "author": "Educational-Ad2428"
                },
                {
                    "level": 1,
                    "comment": "Well, I'm able to go to BU because I grew up on modest income (on a full ride), which is why I made this post to get ideas. \nHeard crickets are pretty good.\nGood idea for 80/20 and Vitamin C! Now I won't get scurvy. \nThank you!",
                    "score": 6,
                    "author": "TheMan_03",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I just think you just phrased the post in a way that was like “i have 5 dollars a week for food and might have to eat bugs”, which now I see is not the case. Still, food pantry food won’t be super nutritious probably, but that could be a resource - just google what’s in Allston. I know there’s one right off Harvard Ave https://allstonbrightonapac.org/services/ , but they do once a month food. \n\nIf this is your first time living alone, experiment with recipes until you find something you can eat consistently, make food in bulk for yourself like rice, beans, meat in 2-4 pound quantities that last a week, and don’t rely on eating out. That’ll be more sustainable and easier than forcing crickets down your throat.",
                            "score": -1,
                            "author": "chuckjoejoe81"
                        }
                    ]
                }
            ]
        }
    ]
}