{
    "id": "13g60h6",
    "score": 5,
    "title": "Incoming intl student: help me decide my flight ticket date",
    "author": "Imaginary_Stop_7488",
    "date": 1683948768.0,
    "url": "https://www.reddit.com/r/BostonU/comments/13g60h6",
    "media_urls": [],
    "other_urls": [
        "https://www.bu.edu/housing/living/calendar/2023-24-academic-year-calendar/)"
    ],
    "postText": "Hi!\n\nI am an incoming intl student from Asia who is planning to attend bu from this fall semester.\n\nI haven't been notified of my room assignment from the housing office yet but I have to purchase my flight ticket now. \n\nIt says that the fall semester move-in period is from August 30 - September 4, 2023 in the [23-24 academic year calendar](https://www.bu.edu/housing/living/calendar/2023-24-academic-year-calendar/) but since i have seen several intl students heading to bu around August 20, I was wondering when I should book my ticket.\n\nThank you!",
    "comments": [
        {
            "level": 0,
            "comment": "My daughter was in the same situation last year. We booked our tickets 3 days before orientation so we could purchase what she needed for her dorm. We stayed at an Airbnb and it worked out well since she had to open a bank account and get some vaccinations at the health center. Just ask when the last orientation session will be and book your tickets asap. Look for student discounts and sometimes it may be cheaper to book directly from the airline than Expedia - that was our experience with Emirates Airlines.",
            "score": 8,
            "author": "Apprehensive_Dot9882"
        },
        {
            "level": 0,
            "comment": "I'm not an international student, so there may be certain conditions I'm not aware of, but I personally wouldn't reccomend arriving before move-in period unless you're willing to stay at a (potentially expensive) hotel for a few days. The move-in dates listed on the academic calendar are strict. \n\nI'd personally say you should aim to fly in towards the beginning of move-in, since you do want time to get settled and make any preparations you need, but I'm not aware of any reason to get here before then.",
            "score": 5,
            "author": "TVforReddit"
        },
        {
            "level": 0,
            "comment": "Hey man!\nI'm also an international student going to BU during the fall semester.\nI booked my flights already, and I've chosen to arrive on the 29th, one day before housing opens.\nHousing will be open between 10am and 4pm, and they will call us at a especific time. \nThat's why I've chosen to arrive one day earlier, to be ready when they call me. I will also not have to worry about being late or having jetlag.\nHowever, it is up to you. You must arrive in time as orientation is mandatory, and that will be the 31st of August and 1st of September.\nYou can also arrive earlier, but you will have to pay for a place to stay the night.\nHope this has helped you :)",
            "score": 1,
            "author": "Ok-Egg9499"
        }
    ]
}