{
    "id": "13k5z86",
    "score": 0,
    "title": "Taking CS112 after using AP credit for CS111",
    "author": "No-Employer9479",
    "date": 1684339423.0,
    "url": "https://www.reddit.com/r/BostonU/comments/13k5z86",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey CS students,\n\nRecently I took the AP exam for CSA and I believe I got a 4 or 5. Firstly, a side question I have is that I have heard that college students (incoming freshman) get to see their senior year of high school AP scores early so the colleges are able to see them. I was wondering how this works?\n\n&amp;#x200B;\n\nNow for my main question: if I were to place out of CS111 should I go right ahead to CS112. I have heard lots of things about the jump between the two classes and how difficult CS112 can be. I also understand that Sullivan is one of the best CS profs and that I should try to get him.\n\n&amp;#x200B;\n\nBasically, should I retake CS111 for the experience? Or go right into CS112?\n\n&amp;#x200B;\n\nthank you!",
    "comments": [
        {
            "level": 0,
            "comment": "CS111 and CS112 are almost entirely separated, in that you don’t use what you learned in 111 in 112. 111 is all Python, and 112 is all Java. So if you feel like you have a good understanding of Python from AP CS, then you can skip to CS112 no problem. But if you would like to reinforce your Python skills (because you will use Python in future CS courses), then take CS111 first",
            "score": 13,
            "author": "EP1X-343"
        },
        {
            "level": 0,
            "comment": "CS111 takes you from the very very beginning, like what is a string, how do you print hello world, which might be a bit repetitive for you at first since may students have never taken a CS course. As other commenters said, it it in Python only, so if you know Python AND feel good about your AP class, then it wouldn't be an issue to skip it imo. Other courses will expect you to know Python, so if you don't know it, this would be your only opportunity to learn it in a classroom setting if that is something that you prefer (learning other new languages on your own WILL be expected in future courses/careers). CS112 is a challenging class for basically everyone, whether they took AP only, 111 only, or both. You are the only one who knows what you know, trust your gut here!!",
            "score": 3,
            "author": "BUowo"
        },
        {
            "level": 0,
            "comment": "skip 111. if you know java it takes a weekend to teach yourself python which is all you'd gain from 111. the first half of 112 is just switching from python to java/java syntax so you'd be ahead there, but the class picks up in the second half and you'd be learning data structures.",
            "score": 3,
            "author": "No-Ambition-9558"
        },
        {
            "level": 0,
            "comment": "Not CS student, but took 111 with Sullivan this semester. Sullivan is an excellent prof, and explained the concepts well (especially for beginners). But if you know python well (recursion, list comprehension, loops, list of lists), you probably won’t learn anything and might be bored. 112 is Java and won’t be building on 111.",
            "score": 2,
            "author": "throwaway34_account"
        },
        {
            "level": 0,
            "comment": "If you did an AP class and did well in it you will cruise through 112. Like more than half of the class is the same as AP and the only thing different is data structures for like the last month of 112. And as others have said 111 and 112 are very different. Definitely take the jump on credits and if you feel you need more python experience in future classes just do an online course or watch youtube.",
            "score": 2,
            "author": "stressedstudent2024"
        },
        {
            "level": 0,
            "comment": "112 is a tough course but very manageable if you take it seriously.\n\nThat being said, 111 didn’t help prepare me for 112 at all.\n\n111 was enjoyable and fun, 112 made me switch majors. I’d take 111 if I were you just to have a buffer for your first semester where it’s challenging enough to help manage your course load but not too hard to break your back. It’s a fun and rewarding class and if you took AP CS you’ll probably breeze by it. If you’re an academic weapon and want to take 112, that’s not a bad idea by any means.",
            "score": 2,
            "author": "ThoughtSafe9928"
        },
        {
            "level": 0,
            "comment": "Cs111 was one of the Best BU course. Why are Commenters just focusing like it only teaches python.\n\nIt teaches these when I took:\n\nLogic gates,adders\n\nBasic Assembly language,\n\nOOP\n\nRecursions\n\nBasic proofs\n\nString manipulation\n\nFine state machine.\n\nIntro to NP , P  stuff\n\n\n\nWhole CS degree summarized in one class. Cs112 is same everywhere. Nothing special.\n\nI strongly suggest you to not skip CS111. My recursive algo thinking is strong because of this class.",
            "score": 2,
            "author": "MarsManMartian"
        }
    ]
}