{
    "id": "13nzbma",
    "score": 290,
    "title": "Commencement Protest",
    "author": "SamPom100",
    "date": 1684686366.0,
    "url": "https://www.reddit.com/r/BostonU/comments/13nzbma",
    "media_urls": [
        "https://i.redd.it/up6gqc7i591b1.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "BU illegally attempted to withhold cost-of-living adjustments for grad students in retribution for their forming a union. Of course they'd cross the picket line for this too.\n\nWhen BU calls and asks you to donate, tell them you'll never donate and this is why.",
            "score": 42,
            "author": "jleonardbc"
        },
        {
            "level": 0,
            "comment": "There's an advertising banner flying around and around over commencement with a banner that says: David Zaslav Pay Your Writers",
            "score": 99,
            "author": "mac2016",
            "replies": [
                {
                    "level": 1,
                    "comment": "The commitment was inspiring 💅",
                    "score": 6,
                    "author": "mooonkiiid"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Shoutout to all the graduates that walked out as soon as he started to talk 🙌",
            "score": 63,
            "author": "laindustriainc"
        },
        {
            "level": 0,
            "comment": "No wages no pages 🤑📝",
            "score": 66,
            "author": "trololooolol222"
        },
        {
            "level": 0,
            "comment": "Good. BU made an awful choice for their graduation speaker and should be called out on it. \n\nAnyone who has a problem with this needs to get a life. This does not in any way ruin your graduation experience.",
            "score": 130,
            "author": "somegummybears",
            "replies": [
                {
                    "level": 1,
                    "comment": "what happened ? im an incoming freshman so i'd like to know",
                    "score": 9,
                    "author": "SnooSuggestions4223",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Commencement speaker is a shitty exec at Warner bros during a writers strike",
                            "score": 55,
                            "author": "peargremlin",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "not just a shitty exec, the ceo and president. terrible choice by bu tbh",
                                    "score": 25,
                                    "author": "the_cockodile_hunter"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m not mad they’re being respectul",
            "score": 37,
            "author": "peargremlin"
        },
        {
            "level": 0,
            "comment": "This is the longest line at canes I’ve ever seen!",
            "score": 3,
            "author": "AvailableAd759"
        },
        {
            "level": 0,
            "comment": "incredibly lame that they went through with that wow.",
            "score": 16,
            "author": "ThUwUsi"
        },
        {
            "level": 0,
            "comment": "I support the writers 100%… but this is so fucking stupid",
            "score": 7,
            "author": "Original_Penalty4745",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yup. You have so many students hoping to celebrate a life achievement with family who have to navigate this all day. Definitely part BU’s fault for keeping Zaslav, but also students and protesters here taking the focus away from other students’ big achievement.",
                    "score": 26,
                    "author": "Doctor_Gonzo__",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This doesn't take away from anything, if anything, it showcases the values we've learned from our time here, standing up for workers rights",
                            "score": 41,
                            "author": "boulderingfanatix"
                        },
                        {
                            "level": 2,
                            "comment": "&gt; but also students and protesters here taking the focus away from other students’ big achievement.\n\nNo, BU took the focus from students' achievement by crossing the picket line and going through with hiring a labor exploiter to \"inspire\" their students during an active strike against his company. The protest is the natural and necessary consequence of BU's decision. The protesters are the ones grads and their families should be looking to for inspiration today, not Zaslav.",
                            "score": 20,
                            "author": "jleonardbc",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think he’s an awful choice regardless, but he was probably locked in as the speaker before the strike happened right? Like money already locked in and very limited options of last minute backup speakers? It’s been going on for a little more than 2 weeks right?",
                                    "score": 0,
                                    "author": "Cpt_Obvius",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The right thing to do would be to cancel anyway and cope with the lost money and limited replacement options. And the real right thing would be not to book him in the first place.\n\nCanceling regardless of the cost is what they (hopefully) would have done if two weeks ago he'd been accused by 20 women of rape, or gone on a killing spree, or any other egregious offense. His being the head of an exploitative labor organization just didn't matter enough to BU not to offer him as an inspirational figure to its community.",
                                            "score": 3,
                                            "author": "jleonardbc",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I can agree with all that! I actually didn’t notice you used the phrase “going through with” so you already accounted for what I was saying. I was seeing others comment as though he was hired during the strike but you clearly were already aware he was not!",
                                                    "score": 3,
                                                    "author": "Cpt_Obvius"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "protests are meant to be inconveniencing and disruptive, that's the whole point",
                            "score": 99,
                            "author": "steph-was-here",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah to the people who you are protesting against. Not some random students who have no control.\n\nAll this does is make the students/families mad at the protesters and therefore making them care less about the issue",
                                    "score": 43,
                                    "author": "bagfka",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": -4,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "i was literally in front of the LOUDEST of all the hecklers",
                                                    "score": 1,
                                                    "author": "Academic_Squirrel_55"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": -14,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You seriously can’t figure out why during the commencement walk having protestors protesting along side that would dampen a celebration?\n\nYou seriously can’t figure that one out?",
                                                    "score": 12,
                                                    "author": "bagfka",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": -6,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Isn’t the entire point of a protest to be disruptive? How are you arguing this isn’t being disruptive to the ceremony in any way lol",
                                                                    "score": 9,
                                                                    "author": "AC127",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[deleted]",
                                                                            "score": -6,
                                                                            "author": "[deleted]",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "What is the goal?",
                                                                                    "score": 3,
                                                                                    "author": "AC127",
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "They were in the ceremony you fucking moron. They wouldn’t shut the fuck up during a fantastic speech",
                                                                                    "score": 0,
                                                                                    "author": "BurntMuff1n"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Welp then you are an idiot if you can’t figure that one out.",
                                                                    "score": 1,
                                                                    "author": "bagfka"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I’m aware. But I don’t think protests disrupting a graduation for people not actively supporting Zaslav will get writers fair compensation or result in Zaslav not speaking/looking at things differently. All it does is blemish graduation for others without making a tangible impact towards the efforts being fought for.",
                                    "score": 3,
                                    "author": "Doctor_Gonzo__",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It’s not like they are storming the stage during the handing out of diplomas. Are they photo bombing people’s pics and throwing paint on their gowns?\n\nMarching outside the venues on Comm Ave seems completely reasonable and logical. See it, walk past it, support the writers, go graduate.",
                                            "score": 34,
                                            "author": "somegummybears",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I understand, and for the record I support the WGA and the strike. However, for me personally, I don’t see how protests during BU graduation will help in any tangible way to give writers the compensation they deserve. I get your opinion as well, but respectfully I just don’t see any overt outcome that will come out of this besides students and their families being forced to navigate it on a day that should 100% be about the students graduating.",
                                                    "score": 1,
                                                    "author": "Doctor_Gonzo__",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "You could write this same post about literally any protest ever.",
                                                            "score": 8,
                                                            "author": "Guidobama"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt;I don’t see how protests during BU graduation will help in any tangible way to give writers the compensation they deserve.\n\nWe can hope that it at least makes BU think twice in the future about crossing the picket line to endorse a labor exploiter as the figure they hire to inspire a graduating class.",
                                                            "score": 7,
                                                            "author": "jleonardbc"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "They aren’t protesting at the graduation. They are protesting adjacent to it. \nIt brings attention to an issue. \n\nYou could make your argument for any form of protesting; protesting never directly leads to results, but it’s all a part of the process.",
                                                            "score": 28,
                                                            "author": "somegummybears",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "We can agree to disagree. I appreciate being able to argue it with you in a respectful way. Thank you. Hopefully the WGA gets their demands fulfilled soon.",
                                                                    "score": -1,
                                                                    "author": "Doctor_Gonzo__"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I don't understand how you don't think this is ruining what is an incredibly proud moment for many students and their families",
                                                    "score": -7,
                                                    "author": "RoyShavRick",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "No, I don’t understand that. Because it doesn’t. Campus is a mile long, this is one intersection. Get over yourself.",
                                                            "score": 6,
                                                            "author": "somegummybears",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I just don't see how this makes anyone care about the cause. Why do people think this creates change? It just furthers resentment",
                                                                    "score": -6,
                                                                    "author": "RoyShavRick",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I’m sorry people were making you feel bad about listening to some CEO who makes half a billion dollars a year.",
                                                                            "score": 10,
                                                                            "author": "somegummybears",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "No it just makes people less likely to care about these people. I definitely support the cause but why punish students who most definitely agree with the protestors viewpoint?",
                                                                                    "score": -1,
                                                                                    "author": "RoyShavRick",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "u clearly weren’t there …",
                                                                    "score": 1,
                                                                    "author": "Academic_Squirrel_55",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "So is your problem actually with fellow graduates?",
                                                                            "score": 1,
                                                                            "author": "somegummybears",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "yes lol but they wouldn’t be doing it if wga wasn’t so vehemently encouraging it. i understand signs, walking out, turning around, etc. but i don’t need the most profane heckles literally ever to be screamed in my ear for 40 minutes. yes this is specifically directed to the self righteous fuck sitting behind me in the eng section",
                                                                                    "score": 0,
                                                                                    "author": "Academic_Squirrel_55"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "That’s the point but you also can’t get mad when people are annoyed with the inconvenience",
                                    "score": 0,
                                    "author": "AC127"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Right",
                    "score": -3,
                    "author": "Least-Quality3522"
                }
            ]
        },
        {
            "level": 0,
            "comment": "yeah this was fucking annoying. i 100% support the cause but don’t ruin my graduation. writers guild of all people should know that people who work hard deserve their due credit and instead they decided to make their problem everyone’s problem.",
            "score": -9,
            "author": "Academic_Squirrel_55"
        },
        {
            "level": 0,
            "comment": "college students be like \"I'm ready to protest today I just have to figure what the reason is\"",
            "score": 0,
            "author": "cafecitoshalom"
        },
        {
            "level": 0,
            "comment": "People are literally dying of hunger right now. Go take your diplomas and do something about that please.",
            "score": -8,
            "author": "AdventurousLog9524"
        },
        {
            "level": 0,
            "comment": "BU students are weaklings",
            "score": -25,
            "author": "Least-Quality3522"
        },
        {
            "level": 0,
            "comment": "…how?",
            "score": -19,
            "author": "gennavoo"
        },
        {
            "level": 0,
            "comment": "Between this and the grade deflation scandal, I think BU has some decisions to make.",
            "score": 0,
            "author": "Rando_throwaway_69"
        }
    ]
}