{
    "id": "13r602z",
    "score": 3,
    "title": "What should I know about transferring to the CFA?",
    "author": "Asian_dodo",
    "date": 1684983416.0,
    "url": "https://www.reddit.com/r/BostonU/comments/13r602z",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi y’all, I’m an incoming freshman who’s interested transferring from CAS to CFA. Is there anything I should know about the process other than the fact that I need a portfolio, or things to consider about the CFA? And what does “VA major” or “stamped approval” mean on the course search website?",
    "comments": [
        {
            "level": 0,
            "comment": "Hey! Transferring will depend on what college in the CFA you are transferring into. You will need a portfolio to submit and then I know for the school of theatre and music you will also have to do an interview/performance.\n\nVA major means \"visual art major\" - you have to be in the school of visual arts to take that class. Stamped approval means you can take the class with the approval from the professor. \n\nIt's good to know that the CFA doesn't run like CAS. You have to take more classes because we don't follow the regular class/lab structure. You will also have \"studio hours\" where you will be working on your ✨craft✨. It's a bit like playing a D1 sport. This isn't to say DONT transfer - I would use this time to take as many HUB classes as possible because that will help you SO MUCH.",
            "score": 7,
            "author": "itsmytuberculosis",
            "replies": [
                {
                    "level": 1,
                    "comment": "Got it, thanks so much! I’ll try to plan my classes around the hub requirements, shame the art classes I wanted to attend are currently full lol",
                    "score": 1,
                    "author": "Asian_dodo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I agree with the response above me 100%! CFA is great, but another thing to consider is scheduling in general. CFA has linear courses (especially in visual arts) so you are required to take certain classes at certain times in order to progress in the major. This sometimes causes set backs with credits/ requirements because there’s often overlap with courses you need with your mandatory classes, but it’s not a huge deal as long as you work with your advisor. The professors are also all really great for the most part, and act as mentors more than professors",
            "score": 7,
            "author": "PrincipalShawty52",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s reassuring to know, thanks for the advice! I just gotta start building connections when I get there in the fall.",
                    "score": 1,
                    "author": "Asian_dodo"
                }
            ]
        }
    ]
}