{
    "id": "13xkcv8",
    "score": 5,
    "title": "Added the Wrong FY101 class",
    "author": "yipmanjk",
    "date": 1685632892.0,
    "url": "https://www.reddit.com/r/BostonU/comments/13xkcv8",
    "media_urls": [],
    "other_urls": [],
    "postText": "I added the wrong FY101 class. Both classes for transfer student and Wheelock's are labelled T2, and i stupidly schose the former 😭😭😭. What should I do? If i drop it and add the correct one will it show as a W on my transcript ?? or should I talk with my academic advisor ??",
    "comments": [
        {
            "level": 0,
            "comment": "No no no you're fine, no W on your transcript! Dropping without a W is allowed even several weeks into the semester.\nAlso...FY101 isn't like an academic course, no one should care if you did somehow get a W.\n\nThe semester calendar will always have the official dates/deadlines including drop without and drop with a W.\nhttps://www.bu.edu/reg/calendars/semester/\nFor Fall 2023, last day to drop without W is 10/10/23.\n\nPeople change their schedules all the time over breaks/summer before the semester officially begins. \n\nYou shouldn't even have to drop the course I think because you just need to change sections. Under Reg Options, there should be \"change section\" so you don't have to actually drop the class to then register for the same one, different section.",
            "score": 5,
            "author": "mac2016",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank youuu so much , I was worrying over this. Never do this back in my previouse institution.",
                    "score": 3,
                    "author": "yipmanjk",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It doesn't help that BU just...doesn't have instructions for how to register!!! I figured it out on my own well ahead of Orientation (back when incoming first years and transfers couldn't register until you were in person at orientation) but that's just me trying to learn everything I could about this new environment I was entering.\n\nBut yeah there's...no guides or steps or tutorials on to use the registration system???",
                            "score": 1,
                            "author": "mac2016",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They actually do have instructions",
                                    "score": 1,
                                    "author": "Winter-Pick-6282",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Where? I could never find them online and I tried to search recently for this or another post when someone needed help",
                                            "score": 1,
                                            "author": "mac2016",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "https://sites.bu.edu/casreg/registration-instructions/",
                                                    "score": 2,
                                                    "author": "Winter-Pick-6282"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "yeah and for the amountttt of tuition we are paying everyon there seems to hard to reach. Even now my advisor message me one day before the registration period, lowkey sent me through a rushhh.",
                                    "score": 0,
                                    "author": "yipmanjk",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The Registrar phones have been a shit show today because it seems like everyone and their mother is calling. And their phone queue only allows for 5 calls to be waiting. The rest all get a busy signal 😅\n\nYou'd think with all the tuition we pay they'd...hire more people who can answer the phones??? But nope, that requires paying more staff 🫠 why do that when we can make the existing small team do all the work? 🫠🫠",
                                            "score": 1,
                                            "author": "mac2016",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "This lowkey brought nightmares with the admissions team🥲Needed to call then every week to make sure that they have my documents. They are always very late with marking it on the portal 🫠",
                                                    "score": 1,
                                                    "author": "yipmanjk",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yeah it's stressful. But I understand why it can take them a long time to update the portal. The number of applicants is just SO HIGH. \n\nI just looked it up, back in 2012 when I started undergrad, there were 37k applicants my class year. This year had 80k!!! And I'm pretty sure the admissions team is the same size because BU rarely expands departments.",
                                                            "score": 1,
                                                            "author": "mac2016"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}