{
    "id": "1423xzg",
    "score": 12,
    "title": "Not getting an academic advisor, not able to enroll the course",
    "author": "Brilliant-Gap-7636",
    "date": 1686026690.0,
    "url": "https://www.reddit.com/r/BostonU/comments/1423xzg",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm a transfer student who recently submitted my deposit and set up my BU account. I saw some transfers said they are able to register for courses already, so I went to my BU account to check. But it said I need to get a code from academic advisor for enrolling the course. Where should I go to find an academic advisor???\n\nAlso, anyone else tries to register for orientation but finds all of the orientations are filled out? What u guys do for that)))):",
    "comments": [
        {
            "level": 0,
            "comment": "Hi! To find your specific advisor, go to [Student Link](https://student.bu.edu/MyBU/s/). Click on \"My Academics\" at the top, then scroll to Additional Resources and click \"Degree Advice.\" Once you are in the Degree Advice page, if you scroll past the Degree Advice Report information, you should see Advisors. Shoot them an email for your registration code!\n\nIf you can't get in contact with your advisor, some larger majors have overall advisors/administrators who might have your code. Just search \"BU X department advisor\" and you'll find the name.\n\nWhen I transferred, I distinctly remember being bombarded with calls since I did not register for orientation on time haha. They didn't let me slip through the cracks. Maybe give them a call (617-353-3555) or shoot them an email ([oocs@bu.edu](mailto:oocs@bu.edu)) or fill out [THIS](https://www.bu.edu/undergradorientation/contact-us/) form just to make sure you get a spot that works for you?? Idk someone else might have more info for this semester (I did it during the virtual covid year...)",
            "score": 6,
            "author": "BUowo"
        },
        {
            "level": 0,
            "comment": "You’re supposed to get an email that said you had to send your planned courses back to that same email they then send it to an advisor who would reach out to you with the advisor code",
            "score": 1,
            "author": "SofiriChof"
        }
    ]
}