{
    "id": "146jquw",
    "score": 3,
    "title": "As a transfer, should I focus on finishing my HUB first or my major course?",
    "author": "Brilliant-Gap-7636",
    "date": 1686455592.0,
    "url": "https://www.reddit.com/r/BostonU/comments/146jquw",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey, so I'm going to be COM student next academic year. Currently, I'm working on transferring credit from my initial school to BU. Don't know how much that gonna transfer, but I already start enroll courses now.\n\nBasically, I chose one writing course COM CO 101, two department required courses and one major course. I didn't choose HUB course like quantitative reasoning bc I can only take 16 units next semester. In the courses I am taking now, some of them fits the HUB requirements like social inquiry. \n\nMy major is in COM, so I don't really worry about the HUB courses related with sociology, literal etc. But I do worries about HUB requirements like quantitive reasoning. Should I delete one of my courses and replace it with quantitive course? If so, do u guys have any recommend course?",
    "comments": [
        {
            "level": 0,
            "comment": "honestly i don't think it matters which you finish first (major courses or HUB courses), i would just suggest trying to get both done at the same time. definitely double check to see if any of your major classes (this semester or future semesters) will also cover any HUB units and go from there. quantitative reasoning 2 was pretty frustrating for me in particular because i've already taken stats and didn't want to take it again (i'm a psych major) but i managed to get a spot in epidemiology, which i think is the most non-STEM class for that requirement. i'd say ride it out this next semester with what you have and go from there and/or definitely reach out to your advisor if you have one so you can work on a more detailed plan with them",
            "score": 3,
            "author": "fallingleafy"
        },
        {
            "level": 0,
            "comment": "I’d focus on your major ones. It really doesn’t matter what order you do it in so you might as well get a lot of prereqs and classes you’re actually interested in to start. Also I’m pretty sure HUB requirements for transfer students are slightly altered so you can worry about the few that fall outside of your major at a later time.",
            "score": 3,
            "author": "tittsorass"
        },
        {
            "level": 0,
            "comment": "as a recently graduated transfer student myself, focus on your major/minor requirements first. the HUB credits will continue to accumulate as you take courses for your degree and as you get closer to graduation, you’ll be able to look at your degree advice report and see what actual gaps need to be filled in when fulfilling HUB credits.",
            "score": 2,
            "author": "caucasian_scammer"
        }
    ]
}