{
    "id": "148s9y5",
    "score": 0,
    "title": "Using fake in Chinatown",
    "author": "zzachthomas",
    "date": 1686697601.0,
    "url": "https://www.reddit.com/r/BostonU/comments/148s9y5",
    "media_urls": [],
    "other_urls": [],
    "postText": "So I’ve already collected that using fake ID’s in Boston for bars, clubs etc. is simply a no-go. But if I’m just looking to purchase alcohol, will a packie somewhere like Chinatown accept a fake? It’s a good fake. It even scans on this mobile ID scanner app and pulls up the details, and I look passable 21, barely. Thanks in advance for your replies",
    "comments": [
        {
            "level": 0,
            "comment": "nice try bupd",
            "score": 18,
            "author": "Aware-Afternoon7416"
        },
        {
            "level": 0,
            "comment": "lol dm me if anyone responds to you with the answer. there’s a reason y this chat quiet",
            "score": 5,
            "author": "Excellent-Custard637"
        },
        {
            "level": 0,
            "comment": "blanchards in allston never ask for id",
            "score": 4,
            "author": "Significant_Bet2300",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don't know why Reddit is always pushing this sub on me, but since it does... since when?\n\nWhen I lived in Allston 16/17 years ago they would have someone just inside the door checking every ID, then again at the register.\n\nAlso, I wonder if this is like some kind of sting post. Oh and, fakes are really easy to identify. Using them is really stupid.",
                    "score": 9,
                    "author": "Yeti_of_the_Flow",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Agree, but it’s admittedly been nearly a decade for me too. But just as you described, ID check at the door then again at the register.",
                            "score": 1,
                            "author": "Ecstatic_Tiger_2534"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Shippys in south campus rarely asks. The man at the counter is usually really nice too :)",
            "score": 1,
            "author": "BurntMuff1n"
        },
        {
            "level": 0,
            "comment": "Go to starmarket and get some grape juice. Proceed to ignore it for a few weeks and voila",
            "score": 1,
            "author": "boulderingfanatix"
        },
        {
            "level": 0,
            "comment": "You could just not purchase alcohol. You don’t need it.",
            "score": 0,
            "author": "NotNotSilent"
        }
    ]
}