{
    "id": "j0aw3k",
    "score": 495,
    "title": "If you need to go to planned parenthood on comm ave, and need someone to walk you, please dm me",
    "author": "panda61200",
    "date": 1601144081.0,
    "url": "https://www.reddit.com/r/BostonU/comments/j0aw3k",
    "media_urls": [],
    "other_urls": [],
    "postText": "Please don’t take this down because I’m not trying to make this political (because it isnt) but I support planned parenthood, and unfortunately there are often times protestors outside of the PP on comm ave. I know it can be scary walking into the building alone (especially if you are a young adult woman) when there are protestors outside, so I am willing to walk you to and from your appointment, given I am free at the time. You don’t need to tell me why you have an appointment (unless you want) and we can never speak again if that’s your cup of tea. I don’t judge anyone for using their services, and I know for low income students it is often the only option. I have been there myself and am thankful that they did not charge me the full cost because I was a student and didn’t have a job. **If you are pro-life, you do you, but don’t bother commenting on this post because I am not going to change my position. I have done plenty of research on the topic of abortion and my views are what they are.**\n\nEdit: I love that people are also offering to help and I am currently in contact with someone from stugov to *maybe* turn this into an actual program. I’ll try to keep everyone posted :-)\n\nEdit 2: this planned parenthood is a part of the program that PP has that has escorts and you can volunteer through their website! I am trying to figure out how to do that now and will do a new post with more info!!!",
    "comments": [
        {
            "level": 0,
            "comment": "dude they're so annoying I used to walk to campus from Allston and these annoying ass protestors will preach at me and try to give me flowers like... I'm not even American I don't want your flower I can't vote leave women alone",
            "score": 34,
            "author": "dyinghall"
        },
        {
            "level": 0,
            "comment": "I also extend the same offer in case OP happens to get too many responses lmao. DM me, no questions asked.",
            "score": 28,
            "author": "Cellular_tuesday"
        },
        {
            "level": 0,
            "comment": "There were so many of them outside today, on both sides of the sidewalk. They've been making me angrier and angrier lately; the other day I couldn't resist telling a lady she was an absolute goddamn hypocrite for wearing a \"defend life\" sign while not wearing a goddamn mask.\n\nWhen I got my IUD, it was absolutely fucking terrible. I could barely walk after, and had to stay at that Planned Parenthood (the very same one you're offering this service for) for hours before they felt safe letting me go. As I left the clinic, feeling tired and sad and emotionally exhausted, I was accosted by a crowd of protesters. One of them, a tiny older woman, followed me down the street for several blocks as I hobbled as fast as I could away. The entire time she was yelling at me in a language I didnt understand and brandishing a pamphlet with the large words \"living in sin\" and \"eternal damnation\" emblazoned on the front. It was a terrible, scary experience, and I WASN'T EVEN GETTING A GODDAMN ABORTION. I was doing something that was incredibly helpful to my life and my health, a decision that I made with a doctor's help. I can't even imagine how I would have fared had I been actually doing that heavy, serious thing and then had to walk out to that crowd.\n\nLong story short, fuck those people. And thank you, OP, for supporting people; if you'd been around at that time, I probably would have asked for your help.",
            "score": 66,
            "author": "scaryratinaxmashat",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ugh I am so so sorry that you had to deal with that. I went there to get a prescription for birth control and plan on getting an iud there before trump can appoint a new Supreme Court judge. Luckily when I went for birth control no one was there protesting but I know it would’ve made me so uncomfortable and scared",
                    "score": 18,
                    "author": "panda61200"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey OP and others, PP actually has a designated volunteer escort program for this exact situation. Sign up to volunteer with PP so they can vet and train you. They'll give you a vest/uniform so you're instantly identifiable as a friend to people coming for services, and they'll schedule you. It's nice to offer on here, but working directly with PP is where you'll be able to help the most.",
            "score": 13,
            "author": "wookiewookiewhat",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have heard of that before, but for some reason I was under the impression that this PP didn’t offer that service. I’ll def do more research, thank you for taking the time to comment!",
                    "score": 5,
                    "author": "panda61200"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Somewhat unrelated story but a buddy of mine used to live across the street from planned Parenthood over there, and its a pretty good place to live actually with transit and shopping right there in Packard corner.  But one day after I moved in down the street I asked him what his favorite part of living there was.  He wasn't sure but he was adamant that it wasn't being woken up to the sound of praying outside his window every Sunday morning...  Apparently people protesting planned Parenthood pray quite loudly using a bullhorn some mornings.",
            "score": 18,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh wow that’s super annoying, I live a few blocks away so I doubt I would hear it but I can guarantee if it woke me up I would be there telling them to shut up",
                    "score": 10,
                    "author": "panda61200"
                }
            ]
        },
        {
            "level": 0,
            "comment": "used to love biking up comm ave and yelling at them to get a hobby as I rode past. seriously, if your priority for the day is to stand around and harass women then go back to bed",
            "score": 77,
            "author": "Que165",
            "replies": [
                {
                    "level": 1,
                    "comment": "For real. I stopped today and was able to trick one of the protestors into agreeing with me that birth control is a good thing and then used her own logic against her to explain why planned parenthood is good. She literally couldn’t come up with one point against me and just started ignoring me because she knew I was right but was too stubborn to admit it",
                    "score": 35,
                    "author": "panda61200"
                },
                {
                    "level": 1,
                    "comment": "Well, they think they're saving lives or something.",
                    "score": 9,
                    "author": "TheRoilingChaos"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": -7,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "ah yes, how could we forget that getting tested for an STD or screened for breast cancer = infant genocide",
                            "score": 2,
                            "author": "ksirica",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 0,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "too bad it’s not the harassers’ choice to decide who gets to have an abortion and that cells aren’t living beings (i know i’d be freaked out if a voice started speaking out of my uterus)",
                                            "score": 3,
                                            "author": "ksirica"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 2,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m also willing and able to do this! DM me if you ever need it as well",
            "score": 30,
            "author": "vividnormalcy"
        },
        {
            "level": 0,
            "comment": "I know how scary it is to go to planned parenthood. I live right by there. I offer the same assistance if anyone ever needs just a hand to hold while walking in. Dm me, no questions asked, I’ll be your friend.",
            "score": 6,
            "author": "Ltons"
        },
        {
            "level": 0,
            "comment": "That is truly a gift you are giving. I hope your kindness is paid forward.",
            "score": 9,
            "author": "Smurdered"
        },
        {
            "level": 0,
            "comment": "I’m also more than willing to extend the same offer. My DMs are always open.\n\nI walk or jog past that PP most mornings and it’s so damn frustrating seeing people outside there every single damn day.",
            "score": 11,
            "author": "S_Wenc"
        },
        {
            "level": 0,
            "comment": "Tbh they shouldn’t even be allowed that close to the front doors.",
            "score": 26,
            "author": "buthrowaway1212",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah I’m pretty sure they have security to get rid of them. I went last year and they had to go shoo them away. These people need to find better hobbies",
                    "score": 12,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "They have a line drawn up/taped out that they are not allowed to cross. It looks like a basketball 3-point line around the entrance",
                    "score": 4,
                    "author": "9gagWas2Hateful",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Those buffer zones were ruled unconstitutional by the Supreme Court in 2014.",
                            "score": 6,
                            "author": "wookiewookiewhat",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "#bballtermz #ballersssssss",
                                    "score": 1,
                                    "author": "panda61200"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I also volunteer if needed",
            "score": 8,
            "author": "8bitinfinite"
        },
        {
            "level": 0,
            "comment": "I’d also be happy to help out if OP is ever unavailable! You can dm me on here if you need to, no questions asked!! stay safe girlies 🥰",
            "score": 7,
            "author": "dankbetty"
        },
        {
            "level": 0,
            "comment": "You're a wonderful person ❤️",
            "score": 20,
            "author": "funnymemer68"
        },
        {
            "level": 0,
            "comment": "I don't have a uterus, but bless your kind soul &lt;3",
            "score": 25,
            "author": "pitabitebitch"
        },
        {
            "level": 0,
            "comment": "DM me too. Happy to help anyone go to planned parenthood for any reason.",
            "score": 5,
            "author": "djdwade27"
        },
        {
            "level": 0,
            "comment": "This is a wonderful  initiative! I would like to help if you need any- you can PM me here.",
            "score": 4,
            "author": "kjo_19"
        },
        {
            "level": 0,
            "comment": "I fully admit that I dread the part of my walk that takes me past PP because of said protestors. I have definitely given them an earful when they harass people actually daring to enter the clinic.  I'm unfortunately not really in a position to walk people over there since I'm WFH from my Brighton apartment, but I'm happy to prerecord a string of colorful metaphors to anyone who wants it.",
            "score": 5,
            "author": "jdchambo"
        },
        {
            "level": 0,
            "comment": "Hey I just want to second this 👏 please dm me I will walk you or drive you. I support you and your right to choose.",
            "score": 6,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I’m right there with you. I live close by now, and thankfully the only protesters I’ve come across so far are those minding their own business — but I’ve definitely seen the intrusive sort. \nIf anyone needs an ally and support, I’m also here as a resource.",
            "score": 5,
            "author": "mindful-mess"
        },
        {
            "level": 0,
            "comment": "Mad respect for you",
            "score": 11,
            "author": "IntrepidCereal"
        },
        {
            "level": 0,
            "comment": "This is so wonderful",
            "score": 7,
            "author": "bensmith0622"
        },
        {
            "level": 0,
            "comment": "who the fuck protests free services?",
            "score": 2,
            "author": "cheezybeans7"
        },
        {
            "level": 0,
            "comment": "I would also volunteer if needed and my DMs are always open and try to get back as soon as I can. I kinda have an ankle injury now so it'll be a slow walk or fast in a couple months!",
            "score": 2,
            "author": "Ahmedisgr8"
        },
        {
            "level": 0,
            "comment": "y’all it turned into fucking politics 🙄 that was the whole OPPOSITE point of this post…….",
            "score": 1,
            "author": "panda61200"
        },
        {
            "level": 0,
            "comment": "What do you bench lol? Or are you armed?",
            "score": -29,
            "author": "TheRoilingChaos",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s not that the protestors are going to physically attack the woman entering and exiting (though they might) it is just that they often make them feel extremely uncomfortable to the point someone may not want to deal with it and they skip their appointment. I would be there for emotional support and to tell the protests to fuck off if the woman I am accompanying doesn’t feel comfortable to do so herself. Additionally, after an abortion, iud implantation, or other procedure, a woman would be very weak and can sometimes barely walk. The protesters take advantage of this and will follow them blocks yelling at them. If the protestors see someone walking with the woman they are less likely to do this. And I always carry pepper spray on me as a woman living in the city and would use it only in self defense",
                    "score": 18,
                    "author": "panda61200",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "oh I was just wondering it sounded like you were offering a bodyguard service",
                            "score": -5,
                            "author": "TheRoilingChaos"
                        }
                    ]
                }
            ]
        }
    ]
}