{
    "id": "mc9kp5",
    "score": 351,
    "title": "Thank you to the girl in the bright pink sweater in front of marsh chapel that saved me",
    "author": "duffyduffy3",
    "date": 1616602167.0,
    "url": "https://www.reddit.com/r/BostonU/comments/mc9kp5",
    "media_urls": [],
    "other_urls": [],
    "postText": "I literally created a Reddit account for the sole purpose of this post. I was walking down COM ave and this old man stopped me to ask me if I believed in a creator and asked me if I was religious and kept handing me these little handouts and I could not find a way to leave. This girl in a bright pink sweater came up to me and asked me if I was in her class and I said yes in econ, and then we hurried away because we were going to \"work on the homework together\". I literally got to my dorm room and just burst into tears because I don't think a stranger has ever been so concerned or caring about my safety. If you are the girl, please PM me, I would love to take you out for coffee.",
    "comments": [
        {
            "level": 0,
            "comment": "these weirdly religious fucks that sit outside to harass people are so annoying. glad youre okay!",
            "score": 140,
            "author": "theanonfilmstudent"
        },
        {
            "level": 0,
            "comment": "yeah I always feel so uncomfortable when these people stand around marsh and try to get my attention when I walk by. it’s not cool",
            "score": 59,
            "author": "agirlnamedyeehaw"
        },
        {
            "level": 0,
            "comment": "Just to everyone as a PSA they are usually cults when they are super pushy and aggressive. BU has had issues with religious cults on campus in the past.",
            "score": 16,
            "author": "sarah-1234"
        },
        {
            "level": 0,
            "comment": "Honestly those people are so annoying. I’ve been stopped by the same guy twice and it took everything in my body to not tell him to F off.",
            "score": 41,
            "author": "bobsmith97bs",
            "replies": [
                {
                    "level": 1,
                    "comment": "Do it next time!! (Be safe ofc)",
                    "score": 4,
                    "author": "slf_dprctng_hmr",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Be sure to do MP whenever possible.",
                            "score": 1,
                            "author": "FilthyPlay"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm glad that someone helped you out. I remember being stopped by one of them recruiters. I was so tired of being stopped by these people that I just spat nonsense about \"the metaphysics of God\" which made him shut up pretty quickly. I told him I was in a rush and he let me leave without much resistance.",
            "score": 32,
            "author": "AquariumSmuggler"
        },
        {
            "level": 0,
            "comment": "I hope you find her. Also he tried to talk to me and as a religious guy, these fucks give us a bad name and I seriously almost fought him. So sorry that happened!",
            "score": 26,
            "author": "irlyheartasians",
            "replies": [
                {
                    "level": 1,
                    "comment": "You’re right they do give us a bad name",
                    "score": 4,
                    "author": "cwpotter22"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ugh. So sorry that happened to you. Maybe I’m a bad person... But I always just tell them God isn’t real and walk away. 😇",
            "score": 19,
            "author": "mtns77"
        },
        {
            "level": 0,
            "comment": "You couldn't find a way to leave? Did you try walking away?",
            "score": -43,
            "author": "throwaway73017",
            "replies": [
                {
                    "level": 1,
                    "comment": "youre getting downvoted but honestly this is how youre supposed to treat that situation.",
                    "score": 0,
                    "author": "keithabarta",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well it's true but confrontation is difficult for some people and not everyone is used to situations like this. I think people were mostly downvoting for the tone.",
                            "score": 7,
                            "author": "gkkiller"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "exactly. And crying about this situation is excessive lmao",
                    "score": -19,
                    "author": "livinthememedreme",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "while i don’t want to make assumptions, i imagine you have not experienced being harassed in public and how the discomfort of something poking at you with derogatory statements (or deeply personal questions in this case) leads to people freezing up. especially when you are in a vulnerable situation, such as being an alone, young woman or person of color, it is not that simple.",
                            "score": 15,
                            "author": "sunflowerlover08",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "(Edited for correction)",
                                    "score": 1,
                                    "author": "throwaway73017",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "just as a heads up: i happen to have heard of this particular situation from a first hand source, so no assumptions here",
                                            "score": 3,
                                            "author": "sunflowerlover08",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "OK, thanks for clarifying.",
                                                    "score": 2,
                                                    "author": "throwaway73017"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}