{
    "id": "142z320",
    "score": 10,
    "title": "Difference between being an LLC taxed as an LLC and being an LLC taxed as an S corp?",
    "author": "Icy-Drop-2524",
    "date": 1686100187.0,
    "url": "https://www.reddit.com/r/Entrepreneur/comments/142z320",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey everyone! \n\nI’m starting a business with four other people, and I’m trying to figure out the tax situation for the future. \n\n\nMy question is basically in the title. Is it more beneficial for an LLC with 5 owners to be taxed as just an LLC or be an LLC taxed as an S Corp? I want to minimize our tax expense on each owner but I’m not sure the best way to do that. \n\n\n\nNote: no plans to ever take the company public. It’s a merchandising business.",
    "comments": [
        {
            "level": 0,
            "comment": "I’m not an accountant / tax expert and ChatGPT probably has a better answer but:\n\nLLC taxed as an LLC:\nAny wages or partner draws of profits are typically subject to social security, FICA etc up to the max. \n\nSo if you’re paying yourself a wage of 50k but also get a partner draw of 100k “bonus” that will also be subject to social security, fica, etc.\n\nIf LLC taxed as SCORP\nYou can pay yourself a wage of 50k and then a partner draw of 100k and only the 50k are subject to social security, fica, etc.\n\nSo it’s a bit less in taxes and less going toward social security.\n\nMy main biz was LLC taxed as LLC for a few years and then switched to SCORP as it made better sense to do so at that time.\n\nIf you’re unsure whether the business will have much growth or churn out much in profits might be easiest to do LLC as LLC and then switch it later. I think it’s just slightly less paperwork but likely fine early on.",
            "score": 8,
            "author": "captain-doom",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not completely true. An LLC taxed as a sole proprietorship/partnership pays self employment taxes (both portions of FICA) on the net income of the business. It doesn't matter how much you \"draw\".\n\nYou're right in that if S Corp election is made, the business does not pay self employment taxes on the distributions made to the owner(s).\n\nThe IRS does require that the officers of the S Corp pay themselves a \"reasonable salary\" (purposefully vague).\n\nThe rule of thumb is usually the business should net at least $80k for S Corp election to make sense because there are added costs (payroll and payroll filings as well as the 1120-S annual filing). So yes, I agree starting off with the default tax treatment is probably best until the business is going well.",
                    "score": 2,
                    "author": "cmmpssh"
                },
                {
                    "level": 1,
                    "comment": "Gotcha. \n\n\nThe business has been profitable in the past (I’m restarting an older one) and did decently well &gt;200k sales yearly. \n\nI’ll probably consult an accountant like you suggest, but I appreciate the feedback!",
                    "score": 1,
                    "author": "Icy-Drop-2524"
                },
                {
                    "level": 1,
                    "comment": "Great &amp; accurate answer",
                    "score": 1,
                    "author": "ErroneousBakenopolis"
                }
            ]
        },
        {
            "level": 0,
            "comment": "We saved money by filing our llc as an s corp. Talk to your cpa. Depends on your numbers but most likely you will be better off filing As a scorp",
            "score": 1,
            "author": "bburghokie"
        },
        {
            "level": 0,
            "comment": "Taxation can be confusing and stressful, but don't worry, I got you. Being taxed as an LLC vs an S Corp does have some differences. It might be worth looking into the benefits of each for your particular business, and maybe even consulting with an accountant. Good luck!",
            "score": -1,
            "author": "Other_Individual6688"
        }
    ]
}