{
    "id": "1435e1l",
    "score": 3,
    "title": "Interview questions for successful entrepreneurs",
    "author": "gym_performance",
    "date": 1686119121.0,
    "url": "https://www.reddit.com/r/Entrepreneur/comments/1435e1l",
    "media_urls": [],
    "other_urls": [],
    "postText": "Let's say you get invited for lunch with a very successful entrepreneur.  \nwhat kind of questions would you ask this person?",
    "comments": [
        {
            "level": 0,
            "comment": "What's your secret sauce to kickstarting a venture and pushing through difficult times?",
            "score": 3,
            "author": "Other_Individual6688"
        },
        {
            "level": 0,
            "comment": "You can't go by me. I'd ask questions specific to the research I had done. Perhaps bringing up the current project or deal that person is working on then asking about that.\n\nDemonstrating you have done your homework might not be as naive and blundering as is popular ... in certain places.\n\nMy suggestion is leave the abject cluelessness at home. If the person has a book, don't ask those things they fully explained in it. If the person has a site, study it; if they blog, read it. There is nothing that says \"I am wasting your valuable time\" like asking for the secret wealth hack. Or whether they [will adopt you](https://www.reddit.com/r/Entrepreneur/comments/xsng94/comment/iqlg9va/?context=3).\n\nBut of course if you have leveled up enough to do that, you can just as well do the same for any business venture or generate the least little interest in the life of a target customer.",
            "score": 1,
            "author": "AnonJian"
        },
        {
            "level": 0,
            "comment": "An excellent interview example is \"first we feast\". Their research team comes up with really good questions often integrating relatively unrelated events from the interviewee's past and comparing that to their success or how it influenced them. \n\nFor instance, \"I recently found out you were in the\n national geography bee in junior high. As a entrepreneur in global banking, do you think you've always had an interest in international studies?\"\n\nIt is important to frame the it so it does not feel like a \"gotcha\" question. Here is a YouTube channel that focuses on social interactions like what you are talking about: https://youtube.com/@Charismaoncommand",
            "score": 1,
            "author": "ProfessionProfessor"
        },
        {
            "level": 0,
            "comment": "“What was your childhood like?”",
            "score": 1,
            "author": "Real-Good9473"
        },
        {
            "level": 0,
            "comment": "What kind of business would you start if you had to redo it all, and why?\n\nAs a successful person, they'd have better insight.",
            "score": 1,
            "author": "Not-Red-John"
        }
    ]
}