{
    "id": "14397hu",
    "score": 3,
    "title": "Which tools do you use to spy online campaigns of your competitors?",
    "author": "Zumcddo",
    "date": 1686132851.0,
    "url": "https://www.reddit.com/r/Entrepreneur/comments/14397hu",
    "media_urls": [],
    "other_urls": [],
    "postText": "As of now, I will do these things listed below but obviously I am still missing something and I need some more ideas:\r  \n\r  \nwebsite traffic, SEO performance: SEMrush\r  \n\r  \ncompare ad creatives, engagements: Facebook Ads Library\r  \n\r  \nsearch trends: Google Trends\r  \n\r  \nNote that I am interested in determining and comparing their digital marketing campaigns, not which Shopify app they use.\r  \n\r  \nHow can I compare PPC (Google Ads) results? Is there a tool wherein I can spy or at least get an estimate how much traffic a search or display ad generates? (without having to access the admin panel as I will be searching competitors)\r  \n\r  \nIs there a tool to spy how much they spent on social media marketing? Facebook, instagram, twitter etc\r  \n\r  \nIf the above is not possible, which platform can I use to get some data to be able to gauge digital marketing, online campaigns, ads etc.?\r  \n\r  \nCan spyfu or semrush tells you the breakdown of the sources of traffic, in the level whether from paid ads or organic social media posting?",
    "comments": [
        {
            "level": 0,
            "comment": "To my knowledge, there are no tools that can provide information on competitors' budgets and advertising performance. However, you can explore their ad formats and engagement data, such as on LinkedIn Pages where there is an \"Ads\" tab, or using tools like SEMrush that offer similar services. Additionally, if you work with an agency, they may be able to provide some industry or competitor data, although it is usually not exact and should be treated as a reference rather than precise information.",
            "score": 2,
            "author": "SnackAttacker_33"
        },
        {
            "level": 0,
            "comment": "Have you tried ahrefs for the PPC results? It might have the functionality you need. As for the social media data, unfortunately, it's not possible to determine their exact spending. But you can use tools like Social Blade or HypeAuditor to estimate their followers' growth and engagement rates on social media. Hope that helps!",
            "score": 1,
            "author": "DisastrousRope5221"
        },
        {
            "level": 0,
            "comment": "Facebook offers you to check out all your competitors ads that are currently running. They show you the exact ad, when it was started, which platforms it’s being shared on. Sadly it doesn’t show interests or behaviors or how it’s performing but if a company has the same as for a year it’s obviously performing well",
            "score": 1,
            "author": "Old-Bee-1765"
        },
        {
            "level": 0,
            "comment": "👌",
            "score": 1,
            "author": "DrakeWebsiteDesign"
        },
        {
            "level": 0,
            "comment": "Surfer - It has powerful features that can help you gain insights into the strategies of your competitors and optimize your own campaigns. I use Surfer to analyze keyword performance, research competitor content, and gain a better understanding of the SEO landscape.",
            "score": 1,
            "author": "stagnarsa"
        }
    ]
}