{
    "id": "1446y3m",
    "score": 2,
    "title": "Technical due diligence during M&amp;A... How is that usually done?",
    "author": "ioah86",
    "date": 1686224558.0,
    "url": "https://www.reddit.com/r/Entrepreneur/comments/1446y3m",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello everyone! I have a question that I would love to ask into the void: What does the technical Due Diligence usually look like when people do M&amp;A (especially micro M&amp;A and such)? How do they ensure that they are not buying an unmaintainable, absolute hacked together piece of architecture that will cost them a fortune to maintain/rewrite? Please don't tell me that it is done purely through questionnaires like many cyber insurance companies are doing it today.",
    "comments": [
        {
            "level": 0,
            "comment": "There are firms that specialize in doing technical due diligence as part of M&amp;A.  Any reasonable investor will hire one along with the usual QofE, tax, legal, etc. diligence work streams.  \n\nMost firms will ask for some data - diagrams, hardware inventory, open source packages, code platforms, etc. and then will do q&amp;a to attempt to understand what’s been built/how it’s constructed and how maintainable the code is.  Some will even do a code review if requested by the buyer.  It’s surprisingly not that difficult to determine whether or not a platform is poorly constructed by talking to those closest to it.  If during diligence the seller isn’t truthful, there’s insurance that typically will kick in to cover the liability.",
            "score": 2,
            "author": "jcacavias"
        },
        {
            "level": 0,
            "comment": "As someone who works in M&amp;amp;A, I can say that technical due diligence is a serious business. We usually have a team of experts assess the target company's architecture, codebase, development practices, etc. to ensure that the acquisition makes sense. It's definitely not just a questionnaire!",
            "score": 2,
            "author": "Far_Telephone_3301"
        }
    ]
}