{
    "id": "144ente",
    "score": 7,
    "title": "I'm a software developer and my boss probably won't be giving me serious work for months. How can I make an extra 5-10K with this free time?",
    "author": "illusiveconsistence",
    "date": 1686243533.0,
    "url": "https://www.reddit.com/r/Entrepreneur/comments/144ente",
    "media_urls": [],
    "other_urls": [],
    "postText": "**Some ideas I have are:**\n\n\\- Coding a botting plugin for an online game and selling that as a service  \n\\- Figuring out something I can do and/or develop in the crypto or AI space as a service  \n\\- Offering To Build WordPress or Websites Coded From Scratch on Fiverr or Upwork  \n\\- Starting a YouTube channel for developers and getting sponsors for my videos.\n\n**Any other realistic ideas?**",
    "comments": [
        {
            "level": 0,
            "comment": "Why not try building a useful tool and putting it on Product Hunt? You may not make money directly from it, but you'll get great exposure and could attract potential clients. Plus, you'll be helping the dev community, win-win!",
            "score": 3,
            "author": "AnyBid2585",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'll give that a look, thanks. \n\nRealistically, I'm personally a lot more stingy with my paid working time these days after having done a lot of free writing and coding for people in the past with little pay-off even though I'm happy that people benefited from it. So personally, I'm a bit apprehensive, but I'll check it out either way.",
                    "score": 2,
                    "author": "illusiveconsistence"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What field are you related to/have worked in (sector/industry)? Probably got a job for you after reading your stack",
            "score": 2,
            "author": "NoAbility9738",
            "replies": [
                {
                    "level": 1,
                    "comment": "Mostly web development in both the Private and Public sectors. Developing, upgrading, or dealing with bugs in web apps. One of them being a SPA.\n\nOverall, it was mainly B2B but there was also some B2C work with SAAS. In terms of the industry, it's mainly been related to security but I've also worked on developing an upgraded app for a government service in a niche industry.",
                    "score": 1,
                    "author": "illusiveconsistence"
                },
                {
                    "level": 1,
                    "comment": "Hey I have similar skills. DM pls",
                    "score": 0,
                    "author": "robotomatic"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wordpress website coded from.scratch. please not. There are templates and plugins and everything. \n\nOffer your software dev. Skills as freelancer (not upwork or fiverr, but for a small local software company) as companies are urgent seeking talent atm.",
            "score": 2,
            "author": "Dr_Greenthumb85",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;Skills as freelancer (not upwork or fiverr, but for a small local software company) as companies are urgent seeking talent atm.\n\nI'll give that a look. Thanks. I don't want it conflict with my work hours but if I'm given tasks as a contractor for a small software company and I can make extra pay on the side then that'd be great.",
                    "score": 1,
                    "author": "illusiveconsistence"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you have enough time, work a 2nd software developer job.",
            "score": 2,
            "author": "wanabmasta"
        },
        {
            "level": 0,
            "comment": "What languages or frameworks you know?",
            "score": 1,
            "author": "Miginyon",
            "replies": [
                {
                    "level": 1,
                    "comment": "JS (w/ Node.JS and React, and JS is my best), C# (although I'm weaker here ngl), XML/Xpath (not a programming language), HTML/CSS (w/ Bootstrap, I know they're not programming languages), PHP (I'm okay). I've used WordPress before to develop a site, and I've made and hosted my own portfolio site. Only really made 3 \"official\" sites, and then a bunch of half-done ones for class work with a specific purpose before I graduated.",
                    "score": 1,
                    "author": "illusiveconsistence",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How are you going to do anything with AI with this?",
                            "score": 2,
                            "author": "DivideSimple9637",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Stable Diffusion API, GPT-3/GPT-4 API etc. The possibilities are endless. APIs alone can solve a lot. Integrating them with Python or JS (w/ Node.JS). Add in a stripe or shopify service and that's a base to start with.\n\nThe MVP would be pretty easy to quickly make and test out with a target audience. It succeeding is a different issue though.\n\nI genuinely believe that if 100 people were given these tools, they could come up with 100 unique competitive business projects.\n\nThe big differentiator imo in business is in who is able to outcompete and execute. I don't even necessarily need a powerful computer and the pile to train some AI that I develop from scratch.\n\nSure, it's not proprietary, but if we're talking about a small business making 10-50k/year on the side, those talks can be done later. I mean almost OpenAI-level AI is available open source. You just need the resources and effort to run it.",
                                    "score": 1,
                                    "author": "illusiveconsistence"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Partner with me to develop a mobile app.",
            "score": 1,
            "author": "quickickle53",
            "replies": [
                {
                    "level": 1,
                    "comment": "Java ?",
                    "score": 1,
                    "author": "DivideSimple9637"
                },
                {
                    "level": 1,
                    "comment": "Oh? I'll reach out. Have you done an MVP or are you starting from scratch?",
                    "score": 1,
                    "author": "illusiveconsistence",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I am starting from scratch.  Working on spec and feature breakdown.",
                            "score": 2,
                            "author": "quickickle53"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "PM me. I have a list of cool projects I have always wanted to do but never will have time. You're welcome to digest through it and see if you see anything you think is viable enough that you want to steal the idea.",
            "score": 1,
            "author": "XenonOfArcticus"
        },
        {
            "level": 0,
            "comment": "Bank and Credit Card Sign Up bonuses. I’m at about $2k in bank bonuses alone this year.",
            "score": 1,
            "author": "RyanRoberts87",
            "replies": [
                {
                    "level": 1,
                    "comment": "This seems honestly so enticing right now. Do credit card bonuses implicate taxes at all? If not, are the accounts easy to close? Also, how many did you need to open for that 2K.",
                    "score": 2,
                    "author": "illusiveconsistence",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Credit card sign up bonuses not taxable. Bank account sign up bonuses taxable. I’d recommend going in branch tomorrow if you can for chase Sapphire preferred as first credit card. That should get you $805 worth of points for $6k spend after credit card annual fee. I just prepay my bills. \n\nhttps://www.doctorofcredit.com/starts-3-19-chase-sapphire-preferred-90000-in-branch-signup-bonus/amp/\n\nI did 7 credit cards and 11 bank accounts in 2021 netting about $4400. First starting out you can probably get about $5k+ in credit cards alone. Did that when I was working on MBA using credit cards to pay for classes as I went and immediately paying off credit cards 2016-2018.",
                            "score": 1,
                            "author": "RyanRoberts87"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I just sent you a DM regarding an early working version b2b app.",
            "score": 1,
            "author": "wickdata"
        },
        {
            "level": 0,
            "comment": "Upwork - just pick up some odd jobs. If you know what you're good at, and can get good at reading project descriptions, you can easily pick up jobs that pay $300 - $400 for an hour of work.",
            "score": 1,
            "author": "bumblejumper"
        },
        {
            "level": 0,
            "comment": "Yeah, Freelance has a good scope, you can earn more than assumption",
            "score": 1,
            "author": "Learning_Something_"
        },
        {
            "level": 0,
            "comment": "I think the softwares real estate investors use for cold calling, skip tracing, campaigns, property research, public databases could all be significantly improved. There’s not an “all-in-one”…you have to buy a software that partners with another company to skip trace to partner with another company to set up your campaigns email/text. They are easily understandable.   \nIt’s all ridiculous.\n\nReal Estate Appraisal softwares need to be significantly improved. They are very outdated and too many technological issues.",
            "score": 1,
            "author": "New-Commercial-778"
        }
    ]
}