{
    "id": "144v389",
    "score": 11,
    "title": "Work anywhere and access high-paying jobs",
    "author": "josiivega",
    "date": 1686284693.0,
    "url": "https://www.reddit.com/r/Entrepreneur/comments/144v389",
    "media_urls": [],
    "other_urls": [],
    "postText": "Welcome to Remoty, your gateway to a world of remote work opportunities! 🌍💼\r  \n\r  \nWe've identified some of the most common challenges job seekers and companies face in the digital age and have crafted a dedicated solution to address them:\r  \n\r  \n1. Difficulties in finding suitable remote jobs: Our platform is focused on ease of use and efficiency so you can find jobs that match your skills and experience in record time.\r  \n\r  \n2. Limited job opportunities: At Remoty, we are not confined by geographical borders. We offer job postings from around the world, opening up an unprecedented range of opportunities.\r  \n\r  \n3. Lack of transparency: We provide clear, detailed information about the hiring companies, so you can make informed decisions.\r  \n\r  \n4. Lack of quality control: We ensure that all jobs posted on Remoty are high quality, weeding out low-quality ads that might waste your time.\r  \n\r  \nWe are proud to introduce you to a remote work platform that is fast, efficient, transparent, and of high quality. Whether you're a professional looking for new opportunities or a company seeking global talent, join us today at www.remoty.io.\r  \n",
    "comments": [
        {
            "level": 0,
            "comment": "This seems pretty good. Wish you great success mate 👍",
            "score": 2,
            "author": "Typical-Plantain256"
        },
        {
            "level": 0,
            "comment": "Great Layout!\n\nWas wondering, how did you initially find the jobs? or are you just linking them to the website itself?",
            "score": 1,
            "author": "dinaricManolo"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 0,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Tnxs so much my friend",
                    "score": 0,
                    "author": "josiivega",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Tnxs? lol",
                            "score": -1,
                            "author": "247GT"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Good work. I have similar platform idea in mind but for specific region. For example, here in Canada, there’s not many platform dedicated only for Canadians. I was thinking for a remote job platform such as remoteonly.ca (I’ve got the domain) \nAnother idea is to have a website dedicated to devs who wants to find software/web dev jobs in North America, called northamerica.dev \n\nIf you’d like to collaborate, let’s discuss.",
            "score": 0,
            "author": "techbr0_o",
            "replies": [
                {
                    "level": 1,
                    "comment": "have been interested to make a app like this but for my country (in europe) and monetize it. how much does it cost to run 1 and what are the monetization options?",
                    "score": 1,
                    "author": "woolliegames",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Depends on where are you building. Are you gonna build in Wordpress/code from scratch? \n\nShouldn’t be that costly. You can think of monetization when you have enough viewers, company would have to pay for listing.",
                            "score": 1,
                            "author": "techbr0_o",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "did a double check not that many sites for this in my country, we have around 20million people not that much if you compare it to other but still allot.\n\ni might do it just so I have a portfolio piece as I want to start a business using web development skills and more.\n\n&amp;#x200B;\n\nthanks!",
                                    "score": 1,
                                    "author": "woolliegames"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "There are tags on the job posts saying USA, Worldwide, etc. Does that mean only a person residing in USA can apply for that particular job? If yes, then technically it won’t be called remote opportunities, right?",
            "score": 0,
            "author": "dstartupkid",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;There are tags on the job posts saying USA, Worldwide, etc. Does that mean only a person residing in USA can apply for that particular job? If yes, then technically it won’t be called remote opportunities, right?\n\nRemote opportunities refer to job positions that can be performed from any location, regardless of the employer's location or the applicant's location. The tags are intended to provide additional information about the employer's preferences or the job's potential geographic scope.  \nIt's important to carefully read the job description and any specific requirements mentioned by the employer to determine if you meet their criteria, regardless of your location.",
                    "score": 1,
                    "author": "josiivega"
                }
            ]
        }
    ]
}