{
    "id": "1453u2l",
    "score": 2,
    "title": "Struggling in finding a reliable website agency",
    "author": "GreedyExternal9473",
    "date": 1686313511.0,
    "url": "https://www.reddit.com/r/Entrepreneur/comments/1453u2l",
    "media_urls": [],
    "other_urls": [],
    "postText": "I need help building a news website for 100k IG followers.   I keep finding website designers that are not good. Im not offering low pay. \n\nHow do I go about finding someone? Apologies, if this question comes off lazy. I am just stumped.",
    "comments": [
        {
            "level": 0,
            "comment": "I would recommend calling David at https://aminocreates.com",
            "score": 2,
            "author": "Beneficial_Past_5683"
        },
        {
            "level": 0,
            "comment": "Define \"Not low pay\" because this means different things to different people and in different regions.",
            "score": 2,
            "author": "xisonc"
        },
        {
            "level": 0,
            "comment": "I am running [devdynamo.io](https://devdynamo.io) you can ping us there see if we can help you!",
            "score": 1,
            "author": "JustInfactsGr",
            "replies": [
                {
                    "level": 1,
                    "comment": "Very nice website. OP, I would go with them ☝🏼",
                    "score": 0,
                    "author": "altondnewton"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have 15+ years of experience in Web/App development. Please don't consider yourself a promotion.",
            "score": 1,
            "author": "Hasnain_k"
        },
        {
            "level": 0,
            "comment": "By not good do you mean, they have a nice portfolio but then when you talk to them you are unimpressed or you just cant find any designers with a great portfolio that indicates they can design a site in a manner fitting your page/brand?",
            "score": 1,
            "author": "Dyagz",
            "replies": [
                {
                    "level": 1,
                    "comment": "The latter",
                    "score": 1,
                    "author": "GreedyExternal9473"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I had similar problems to OP when I needed a news website built 10 years ago. If you ask web devs to build a site slightly outside of what they're used to, they have a difficult time doing it. I think it has to do with not having the budget (or sometimes the interest) in researching the target audience and looking at similar websites in the niche.\n\nOP, if you want to connect and talk more about the challenges and my experience, reach out.",
            "score": 1,
            "author": "gripto"
        },
        {
            "level": 0,
            "comment": "Purple Fish Creative. Tell ‘em Roger sent you.",
            "score": 1,
            "author": "ReleasedKraken0",
            "replies": [
                {
                    "level": 1,
                    "comment": "Tell ‘em large Marge sent you",
                    "score": 2,
                    "author": "Ok_Possible_2260"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What functions do you need?",
            "score": 1,
            "author": "Maumau93"
        },
        {
            "level": 0,
            "comment": "Webflow.com is pretty great.  They also have webflow university you can go through.  I did that and built my own.  There is also a community where you can hire solid designers.",
            "score": 1,
            "author": "Benmarcsilverman"
        }
    ]
}