{
    "id": "1453zlx",
    "score": 3,
    "title": "Which sounds better?",
    "author": "Ok_Bike239",
    "date": 1686313927.0,
    "url": "https://www.reddit.com/r/Entrepreneur/comments/1453zlx",
    "media_urls": [],
    "other_urls": [],
    "postText": "“Serving clients across the globe.”\n\n“Confidently serving clients across the globe.”\n\nThe two sentences above are only ever so slightly different, but I feel both has drastically different interpretation by and impact on the reader. The second one reads better imo, but I wonder if, perhaps, it could also be viewed as arrogant and/or too cringey. And that perhaps the first one, though shorter and simpler, sounds more professional? \n\nFor context, this is for the final sentence in a paragraph on the “About” section of my business’s website.",
    "comments": [
        {
            "level": 0,
            "comment": "You project more confidence by leaving the word \"confidently\" out. Its inclusion feels self-conscious. When in doubt, simpler is better.",
            "score": 6,
            "author": "pablo_pcostco",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks very much indeed.",
                    "score": 2,
                    "author": "Ok_Bike239"
                },
                {
                    "level": 1,
                    "comment": "100%\n\nEven \"Across the Globe\" feels better to me.",
                    "score": 2,
                    "author": "Beneficial_Past_5683"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Both are bad, because both are about you.\n\nYour website copy should be about what you do FOR clients. \n\n\"confidently serving\" means nothing. \n\nI'm not trying to be a jerk here. This is super common in people who write copy who aren't copywriters. \n\nHonestly ask yourself, if someone reads \"Confidently serving clients across the globe.” do you *actually* think they're going to give a shit?\n\nDo you really think that line of copy is so unique, so impactful that it's going to drive someone to engage with you?\n\nGood copy is specific, and it is benefit driven. \n\nSo for example, let's say you serve a client confidently, what do they get out of it?\n\nIncreased revenue? Bigger ROI? Reduction in cost of goods? Cheaper shipping rates? \n\nI don't know what your business is about, but I do know that if you speak about the benefits your business gives your customers, then you will have people reading your website that actually want to contact you.",
            "score": 4,
            "author": "seamore555"
        },
        {
            "level": 0,
            "comment": "Global",
            "score": 2,
            "author": "Dependent-Bid-2206"
        },
        {
            "level": 0,
            "comment": "I haven't touched it for a while, but is google optimize still free? Back when I was in product marketing analytics, this can be easily solved using AB tests. Now plus the capability of bing chat, you can leverage it even more",
            "score": 1,
            "author": "fikri_inter-business"
        },
        {
            "level": 0,
            "comment": "Your best bet is to just test it rather than ask people's opinion. In other words put up both versions and see what's converts best.",
            "score": 1,
            "author": "TheAudioExchange"
        },
        {
            "level": 0,
            "comment": "Maybe something like \"Trusted by clients across the globe\" would be more confidence inducing?",
            "score": 1,
            "author": "adelaleda"
        }
    ]
}