{
    "id": "145cf8t",
    "score": 1,
    "title": "New air freshener idea",
    "author": "Visible_Field_68",
    "date": 1686334219.0,
    "url": "https://www.reddit.com/r/Entrepreneur/comments/145cf8t",
    "media_urls": [],
    "other_urls": [],
    "postText": "I have an air freshener that I’ve come up with. Tested for a year and believe it will be competitive with candles and the like. \nQuestion is, do I manufacture and sell on my own until…\nOr do I come up with prototypes and shop them around to sell the idea. \nReason I ask is 20 years ago I had an idea knocked off in china 6 months after I showed it to someone. I knew it was him and he just laughed in my face. Said, “sue me”. \nI haven’t tried to do anything with my ideas since. Just figuring I can’t fight so why get in the ring.",
    "comments": [
        {
            "level": 0,
            "comment": "I don’t think there’s really any right or wrong answer to that. There’s just a choice. You could even try both. Coming up with a catchy name that’s tempting to copy is a good strategy, because that solidifies you as the first. For example, lets say you call it Space Fresh, and your packaging is black with galaxies and rockets on it or whatever.  If gets even mediumly popular, you can bet that there will soon be “UFO fresh” or something like it on the internet for sale before long. But you already have your name out there, and then you can put “the original galaxy freshener” or whatever on your adverts, which will also give you a provenance to trade off. So being first is often better than being cheaper, and not always a product killer. Look how many different cheap types of sticky tape or sticky notes there are, but sellotape and post it are still in business",
            "score": 3,
            "author": "catfink1664"
        },
        {
            "level": 0,
            "comment": "Hey there! It's great to hear that you've come up with a promising air freshener. When it comes to deciding on the best approach, it's essential to protect your idea and minimize the risk of it being copied. Consider filing a provisional patent or seeking legal advice to safeguard your invention. Once you have some level of protection, you can explore different options. You could manufacture and sell the air fresheners on your own, building your brand and customer base. Alternatively, you can create prototypes and pitch your idea to potential buyers or investors who may be interested in licensing or partnering with you. Don't let past experiences discourage you. With the right strategy and protection, you can navigate the market and achieve success with your innovative product.",
            "score": 1,
            "author": "AccelerateYourProd",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks, chat gpt",
                    "score": 3,
                    "author": "TruckNuts_But4YrBody",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "LMAOOOO so true 🤣",
                            "score": 1,
                            "author": "12i2121"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Realistically no one's going to buy the idea.\n\nI would say manufacture a bunch of them, try to sell online and see if some mom and pop stores will carry them.\n\nYou may just want to give away some for free. People who like it will come back for more.",
            "score": 1,
            "author": "TheAudioExchange"
        }
    ]
}