{
    "id": "145eq3b",
    "score": 1,
    "title": "3D Modeling",
    "author": "DelusionalSack",
    "date": 1686339734.0,
    "url": "https://www.reddit.com/r/Entrepreneur/comments/145eq3b",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am a 26 year old engineer and I can’t stand working my desk job. I have been working with 3D modeling softwares since I was a freshman in highschool. Autodesk Inventor, Siemen’s NX, Solidworks, Creo Parametric, you name it. \n\nIs there any way to monetize this through being an independent contractor or starting my own business? I love doing it and I would love to have my own business around it, but I’m just not sure how you could go about turning it into something successful. \n\nAny advice helps. Thanks!",
    "comments": [
        {
            "level": 0,
            "comment": "I used to work at a 3D modeling/animation school, a long time ago.\n\nFirst things first, you need to put together a portfolio of your work. Get all your best stuff and create a personal website to display your work, and to put your resume online.\n\nIn technical careers, education doesn't count for as much as the ability to use the tools an employer is using, and use them well.\n\nYou might want to also have some samples printed up so you can hand them out with printed copies of your resume. Start looking at companies in your city that are likely to be working in 3D modeling, and look at LinkedIn to figure out who the managers are at those departments. Contact them directly and ask to submit your resume and samples of your work.\n\nCheck to see if there are any business networking groups in your city that are focused on 3D modeling, and join those. [Meetup.com](https://Meetup.com) may be helpful here.",
            "score": 2,
            "author": "HaiKarate"
        },
        {
            "level": 0,
            "comment": "YouTube! Best way to monetise your skill imo.",
            "score": 1,
            "author": "Plenty-Walk450"
        }
    ]
}