{
    "id": "145ea09",
    "score": 11,
    "title": "What do you wish you had known before you hired your first employee?",
    "author": "YourNameIsIrrelevant",
    "date": 1686338662.0,
    "url": "https://www.reddit.com/r/Entrepreneur/comments/145ea09",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Don't expect them to care as much as you do. They're paid to be there so act accordingly..\n\nDon't ask them to do anything you wouldn't do yourself.\n\nTake the time to properly train them.  Nothing's more frustrating for an employee than an employer who gives them a job without understanding what's expected of them.",
            "score": 23,
            "author": "TheAudioExchange",
            "replies": [
                {
                    "level": 1,
                    "comment": "It still surprises me how many founders have a hard time understanding why their bottom rung employees aren't willing to give up their lives for the business the way they did when starting out.",
                    "score": 6,
                    "author": "DefiantAbalone1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;It still surprises me how many founders have a hard time understanding why their bottom rung employees aren't willing to give up their lives for the business the way they did when starting out.\n\nEven though I wasn't necessarily in a start up when I realized this, I found this out when I was \\*overcommitted\\* (to say the least...) to my job in the hospital as a manager, and I had to lower my expectations of my direct reports that work should be done during work hours.",
                            "score": 3,
                            "author": "ifyoulikepinacolada6"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That people lie on their CVs and that it's best to not max your budget with the salary offer the first year, so you have a buffer for performance based increases a year on. Also, if you're not in a country where you can fire people on the spot, make sure the probation period is at least 6 months (especially for more senior roles).",
            "score": 3,
            "author": "adelaleda",
            "replies": [
                {
                    "level": 1,
                    "comment": "Dang that’s a hell of a way to get rid of employees",
                    "score": 2,
                    "author": "WillRAndes",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yea.. it's painful and probably harmful in the hands of the wrong manager. However, when as a manager you have the best intentions and an underperforming employee keeps ignoring feedback, dismissing coaching and avoiding work, a probation period can be a lifeline.",
                            "score": 1,
                            "author": "adelaleda"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That no matter how experienced they are in your industry, they will need training on how you you expect things done, then there will be a period while they are still learning. This means you take one step backward in the business to take two steps forward, and during that time you will be overloaded even more with the training and question-answering you have to do.",
            "score": 3,
            "author": "kabekew"
        },
        {
            "level": 0,
            "comment": "How many hours I **really** needed help with. I thought I needed a 40-hour a week person - when in reality I only needed 15-20.",
            "score": 5,
            "author": "myworstadvice"
        },
        {
            "level": 0,
            "comment": "That the thousands spent on employment contracts were worthless.",
            "score": 2,
            "author": "Barney_Roca"
        },
        {
            "level": 0,
            "comment": "Setting clear expectations from the beginning for work scope, deliverables, how and when things should be done. \n\nIt can be really difficult for employees when things are not clear, and tough to hold people accountable when procedures or practices are not documented.",
            "score": 2,
            "author": "evalenceEV"
        },
        {
            "level": 0,
            "comment": "First, if you are feeling swamped and need an employee - it's already too late. Speaking from experience.\n\nBut the most important thing you can do is have your process in place. Ensure that the hire and have confidence in you and your business. If you hire but don't have an exact process in place for training them and their eventual day to day you will be scrambling. Not a good image.\n\nSet aside dedicated time in your week to prepare for an employee. Your workflow is going to change, things that are \"messy\" in your workflow become REALLY messy when trying to teach another how to navigate it. \n\nObviously these may not be that important depending on your industry/the employees job but these are things that I have experienced.",
            "score": 1,
            "author": "SlayTheEarth"
        },
        {
            "level": 0,
            "comment": "To outsource as much as possible to payroll companies, including benefits, taxes, insurance, etc.",
            "score": 1,
            "author": "chriswaco"
        },
        {
            "level": 0,
            "comment": "Hire based on character, cultural fit &amp; work ethic. Don’t worry about experience, it’s often a counter indicator.",
            "score": 1,
            "author": "ReleasedKraken0"
        },
        {
            "level": 0,
            "comment": "The employee was great.  The only issue is they came on the back of a government grant.  The government wanted 10 million bits of bureaucracy completed every week.\n\nIt was like dealing with an automated email spambot with the patience of a toddler that was off its tits on speed and desperately needed constant attention.\n\nWon't do that again...",
            "score": 1,
            "author": "GweiLondon101"
        },
        {
            "level": 0,
            "comment": "When I hired my first workers some of them were unqualified to yo the job, so I relied on the qualified ones to teach them how to do the job. But it turned out that the qualified ones wasted time trying to teach others, which I should've did myself or hire someone exclusively to do the job. So I ended up with time loss and some minor material accidents. Next time I'll make sure to gather a well balanced team and the right process to lead them down the successful path",
            "score": 1,
            "author": "mrcolt1992"
        },
        {
            "level": 0,
            "comment": "that’s a good question.. man i hired an employee which was a complete mess and found out why the hard way 🫠\n\nYour not as good as trained HRs, at least learn the basic of interviewing and asking open ended questions\n\nYou should have technical questions while at the same time being open ended. It will save you hours of breaking your head and finding out that your hire has actually 0 skill in the subject\n\nIf he/she is stressed out because of anxiety during an interview, it’s fine, instead start with simple “break the ice” and make it as friendly as it could be before starting with these questions\n\nNothing is more stronger than PORTFOLIO, like really. First thing you can ask is open up their portfolio and ask about how they did it, why the did it, and what they learned doing it. In this case, if their portfolio blown your mind about how good it is and you found out they 100% made it themselves while being honest -&gt; you got a very good employee!\n\nDon’t cheap out — just never give them peanuts income! You might get a “good talent” but they will lose their favor to actually expand their skills while working with you due to seeing your competitors giving higher wage and eventually they will lose hope even asking for a raise just because they saw someone giving 2x the wage your giving.\n\nThis is what i learned, would also love to hear what others have learned -&gt; could greatly help us all :)",
            "score": 1,
            "author": "Any1ok"
        }
    ]
}