{
    "id": "145vcqe",
    "score": 0,
    "title": "Should I list out full details of all my services offered on my LLC website or post high level and follow up with more details on leads?",
    "author": "ifyoulikepinacolada6",
    "date": 1686388205.0,
    "url": "https://www.reddit.com/r/Entrepreneur/comments/145vcqe",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am updating my LLC website and have mapped out all of my services my businesses will offer. I made a page for each service and listed out all the ideas that a client and I can work together on. I am hesitant to list out everything on my website simply because I don't want people to steal my comprehensive thought-out ideas. I completely know this is unavoidable but it is something I would like to try to avoid at all costs. With that said, would best practice be to share at a high level services provided and then if someone contacts me, to provide them with more information via email in like a PDF format? Or should I just bite the bullet and list everything out on my site? I just don't want to give all of my goodies away ......\r  \n\r  \nThe truth is, there is one person in my field who I am nervous about who has absolutely no shame, and I think would steal my website / business idea as fast as a speeding bullet. Although I could be extra paranoid..... this person has done this to me before in lesser shameful capacities (i.e. taking credit for work that I did on a project we worked on together). I am even hesitant to publicize my site on LinkedIn because of this sadly :(.\r  \n\r  \nOn the other hand, I am not looking to make a million bucks with this LLC. It is something I am proud of and would like to continue doing on the side as I make great money with my primary job. This is more of a hobby and tax benefit.\r  \n\r  \nOverall, what would be the best way to go about this?",
    "comments": [
        {
            "level": 0,
            "comment": "Generally your website should be something of a taster or tease to get them interested enough to contact you so you can CLOSE. Websites are not usually for closing but middle of funnel. Hope that helps.",
            "score": 1,
            "author": "creativecode"
        }
    ]
}