{
    "id": "146aj79",
    "score": 2,
    "title": "How do you set up a business, while having a job and small children?",
    "author": "localhoststream",
    "date": 1686429719.0,
    "url": "https://www.reddit.com/r/Entrepreneur/comments/146aj79",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm currently setting up a software business. Lately I found it very hard to work on this side project. I have a small child and we're expecting the next one soon. I also have a full time job. A tried working together with a cofounder but I still end up doing the majority of the work. Lately I felt no energy at all during the evenings to work on the business project. I'm wondering if anyone was in a similar situation and how you managed it.",
    "comments": [
        {
            "level": 0,
            "comment": "I waited until I had the experience, capital, and network to do so easily. Plus a solid retirement account where keeping up with my plan wasn’t a problem. \n\nLater in your career when you have senior management experience, a large network of CEO’s and VP’s to tap for employees / clients, and a large enough cash savings to last at LEAST a few years without worry, plus industry expertise to identify known problems that can be solved with your company, setting up a business is EASY. \n\nWait until everything is in place and you have the knowledge to execute and run a company successfully. Until then, focus on increasing your seniority, salary, retirement, and senior management experience in the meantime. \n\nDon’t rush it and put your family’s livelihood at stake while you roll the dice. I made sure our lifestyle could weather a storm, even IF my business completely failed. But like I said, I waited until I was prepared to the point that failure was a very small possibility.",
            "score": 2,
            "author": "CSCAnalytics",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for the advice. Did your business ideas change? For example, now I'm working on load-shifting energy software, which is a hot topic now. But in five years the market has probably changed significantly",
                    "score": 1,
                    "author": "localhoststream",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Our niche was “Advanced Analytics consulting for small to mid sized companies” (&lt;$1billion annual revenue). \n\nWas broad enough where we could just adapt to market trends.",
                            "score": 2,
                            "author": "CSCAnalytics"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Depends where you work and if you can afford it, but if sabbaticals are an option, I would highly recommend it. Take a couple of months off, with the first one to unwind and the rest to work on your project. \nSounds like you're having signs of burn out and that's not going to end well if you don't address it ASAP.\n\nAn alternative is arranging for shortened or flexible hours at your day job, so you can spend time on your side project.\n\nRegarding children, I hear you. There's no easy way to handle both parenthood and work towards financial independence. The balance my husband and I are trialing is for one person to be the constant breadwinner (me), kid gets sent to nursery, and the other person focuses on building a business.\nI am also expecting the second baby and will be on mat leave for a year (Europe), so we have come to terms with the fact that we will have to eat into our savings for a while, until we find our feet again. Acceptance has made a big difference! We have less than half the household income we had last year, but are consoled by the fact that it's all in function of a better long term. If things don't work out, we both go back to corporate, but knowing that we at least tried.",
            "score": 2,
            "author": "adelaleda",
            "replies": [
                {
                    "level": 1,
                    "comment": "That sounds like a good combination. One fixed income and one flexible. Normally, I would take the chance to go flexible. Now, with the responsibility for the kid(s), I am going to try to work fewer hours and play it safe. Thank you for your advice!",
                    "score": 2,
                    "author": "localhoststream"
                }
            ]
        }
    ]
}