{
    "id": "146bjk1",
    "score": 73,
    "title": "Never Quit",
    "author": "Blanco_ice",
    "date": 1686432245.0,
    "url": "https://www.reddit.com/r/Entrepreneur/comments/146bjk1",
    "media_urls": [],
    "other_urls": [
        "https://www.woofnews.co/subscribe)"
    ],
    "postText": "In 2013 I moved to NYC with big dreams of making it somehow, someway, in something. I knew nobody, had no connections, my English was good but not great and I had never before started a company of any kind. \n\n**Company 1:** in 2014 I launched Beyond Neutral it was an organic cold pressed alkaline forming line of fresh juices (when juicing was a real trend). Our problems were: 1. Saturated market 2. Short shelf life 3. Some were high in sugar 4. Needed refrigeration 5. Pricey\n\n**Company 2:** In 2015 we pivoted to Shotco. A line of organic shots. Meant to be taken at diftimes of day like a vitamin. These shots solved many of our previous problems but they created one big one. At the time it wa only us and maybe 2 other companies, we were going to need to do a lot of consumer education. We raised a 6 figure seed round but ultimately after 2+ years we shut down the company.\n\n**Company 3:** 4 Months before Covid hit I had this idea to eliminate single use cups in coffee shops. The idea was a cup that would connect to an app, you would pre order your coffee, and  the barista could scan and make your desired cup. I raised a small pre seed of 50k, found a manufacturer in China but right then Covid hit and we hit a wall. Our biggest issue was that coffee shops would not under any circumstance accept cups from outside and China was a big issue as well. Bye Bye coffee business.\n\n**Company 4:** This was more of a little side project, Lettair was a way to write someone a lettair online and we would create and mail the actual thing on your behalf. Bad idea, bad execution, i shut it down pretty quickly.\n\n**Company 5:** 2021: Wilder a marketplace for booking outdoor guides. This was crazy,   \nI managed to get a decent amount of hype with people who wanted to join the company, people who wanted to invest and I was able to create a waitlist of a few hundred ppl before we even launched. however within a few months (as we were building) my cofounder left unexpectedly (family issues was the official story) and after that everything kinda dissolved fairly quickly with a couple of months. The momentum, the hype, the inertia, all gone.\n\n**Company 6:** 2023, I reconnected with a childhood friend who I hadn’t talked to in a longtime. We had a long conversation and at the end decided to both make a list of potential idea we would like to work on. Which is how [The Woof](https://www.woofnews.co/subscribe) was born. While its still early we are both really into it, enjoying what we are dong, enjoying working together and solving problems and learning how we grow &amp; scale. So far we are happy with our progress and hope we can hit our end year goal. \n\n**Conclusion**: While I still do not have that fairytale ending (yet) I never let my failures dissuade me from trying again, learning my lessons and improving. Dont listen to all the overnight success stories you see on social media they are either lies or outliers. Most of the entrepreneurs I know and have chatted to have taken the long hard road. If you fail 3 times, you get up 4 times. Dont let the fact that it didn’t go your way today, stop you from trying tomorrow, that's it.",
    "comments": [
        {
            "level": 0,
            "comment": "One of the best things I did was quit businesses that had maxed out or weren't worth continuing, in favor of a new one that really worked.  Sometimes, you need to cut your losses and start over.  I've launched 5 companies.  2 were sorta ok, especially for the goals I set for them.  2 were duds that never really got off the ground.  1 has completely changed my life.  If it's bad and isn't working, quit while you're ahead.",
            "score": 29,
            "author": "Chief_tyu",
            "replies": [
                {
                    "level": 1,
                    "comment": "Fail Fast",
                    "score": 7,
                    "author": "GuanacasteFarmer"
                },
                {
                    "level": 1,
                    "comment": "This is something I’m struggling with right now.\n\nMy app is getting 200k traffic from Google and amassed 100k signups. Looks like success right?\n\nBut no matter what we do we can’t monetize it properly, our users are third world teenagers that simply don’t have money. We kept trying through multiple pivots, but nothing works and we’re stuck at $2k MRR with my wife working full time on it.",
                    "score": 1,
                    "author": "GiancarlloRojas"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sorry I am new to this. People, investors, give you money and you don’t have to pay them back? You must have incredible pitch skills. Do you tap the same people or just do kickstarters?",
            "score": 8,
            "author": "FieldAppropriate8734",
            "replies": [
                {
                    "level": 1,
                    "comment": "Investors don’t give you money.\n\nInvestors buy shares in your business. It isn’t usually a loan you pay back.\n\nYou also purchase shares in your business when you found it. You set a price, transfer money to the business, and it belongs to the business for its operation. You don’t get it back. It’s the same for investors.",
                    "score": 6,
                    "author": "NWmba"
                },
                {
                    "level": 1,
                    "comment": "Most investors only get a high ROI from a small % of their investments, it’s a gamble",
                    "score": 10,
                    "author": "Blanco_ice",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Cool thanks, that makes sense. 6 companies in 10 years is amazing. Keep pushing forward. I’m still trying to get to the first one!",
                            "score": 6,
                            "author": "FieldAppropriate8734",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Just start!",
                                    "score": 9,
                                    "author": "Blanco_ice"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 4,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nobody fires me faster than I do",
                    "score": 5,
                    "author": "sheepofwallstreet86"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So the final thing is a mailing list or something? Do those make money?",
            "score": 3,
            "author": "forever-transitional",
            "replies": [
                {
                    "level": 1,
                    "comment": "Newsletter and yes! Just yesterday a popular Canadian newsletter The Peak was acquired for 5 mil",
                    "score": 3,
                    "author": "Blanco_ice",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What the shit, is it not just a curated list of things you could easily find on your own by googling?",
                            "score": 1,
                            "author": "forever-transitional",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes it is. Which is why I personally think it's a bad business model",
                                    "score": 0,
                                    "author": "FPS_LIFE",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You have no idea what you’re talking about. The idea of a paid newsletter is providing unique content, or unique angles on content, or curated content that saves readers ***time***, which is inevitably what we all want more of. The business model is VOLUMETRIC MRR. Not high ticket. So, think $10 a month subscription that nobody really misses, because it costs more to buy a coffee for one day than a subscription for one month. Then multiply that by X amount, it soon compounds. Plus then you have access to a targeted audience directly. You can negotiate brand deals with relevant companies to bring your subscribers unique offers etc. there’s so many caveats to producing more income. It’s a very lucrative model if you can pull it off.",
                                            "score": 3,
                                            "author": "brightworkdotuk",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yep, if you can pull it off. I still think it's a bad business model. How are you going to hold onto your audience for more than a few months. Especially in the pet scene. People sign up for a free trial then cancel. It's a bad business model.",
                                                    "score": -2,
                                                    "author": "FPS_LIFE",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "???? free trial of what? It’s content consumption. It’s not a bad business model, you’re just uneducated about it.",
                                                            "score": 3,
                                                            "author": "brightworkdotuk",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Free trial Of the newsletter. I know the business model , I already have a business with MRR. Im going to end my part of this discussion here. Thanks",
                                                                    "score": 0,
                                                                    "author": "FPS_LIFE"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Company 5 is still a great idea. Thank you for giving us all a confidence boost. It's always nice to hear, keep pushing forward.",
            "score": 3,
            "author": "red18set"
        },
        {
            "level": 0,
            "comment": "A self-styled analyst posted a textwall on the overnight success of Pinterest. Of several glaring omssions was Tote. The app founders got funding for. No market learning from years spinning their wheels with Tote, then there is no Pinterest.\n\nNo cancelling Tote and Pinterest doesn't exist at all.\n\nIt is important for people to realize a pivot isn't giving up. And a pernicious persistence in the face of reality is no startup asset.\n\nYou don't have to give up but stay flexible and adaptive in your perseverance.",
            "score": 7,
            "author": "AnonJian"
        },
        {
            "level": 0,
            "comment": "Hey mate nice drive. I might add though, those types of businesses are way too niche, and don't really solve a real problem. \n\nI think you definitely have the passion, I just think you need to start a business that really solves a problem, especially if it's completely new.\n\nGood luck though , I hope it all works out !",
            "score": 4,
            "author": "FPS_LIFE"
        },
        {
            "level": 0,
            "comment": "Lettair is kinda dope actually",
            "score": 2,
            "author": "CrimsonCupp"
        },
        {
            "level": 0,
            "comment": "Motivational",
            "score": 2,
            "author": "trendingusa_com"
        },
        {
            "level": 0,
            "comment": "Your persistence, adaptability, and never-give-up mentality as an entrepreneur are inspiring. You've clearly grown from each venture. Your perseverance in the face of failure shows your dedication.\n\n\r  \n\r  \nRemember that success takes time and is rarely easy. Entrepreneurs must be persistent to overcome difficulties. Your ability to learn from failure and pursue your objectives is impressive.  \n\r  \n\n\n  \nYour experience shows that entrepreneurship is a learning process. It's about learning, refining, and adapting. Keep your resilience and self-confidence despite failures.\n\n\r  \n\r  \nYour dedication to growth and positive mindset will help you succeed. Keep going, keep open, and follow your passion. Your perseverance will take you far.\n\n\r  \n\r  \nSuccess is measured by your growth, learning, and resilience, not just the end product. Focus, motivate, and remember your importance to the entrepreneurial path. Good luck with The Woof and everything else!",
            "score": 2,
            "author": "moralsupportnetwork",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well said 👍",
                    "score": 1,
                    "author": "Blanco_ice"
                },
                {
                    "level": 1,
                    "comment": "GPT, is that you?",
                    "score": 1,
                    "author": "BetterMaintenance7"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m lookin at similar business areas, would love to pick your brain on the areas, for example with the organic shot business, what did you do after preparing samples, did you go through different agencies to determine the nutritional values?",
            "score": 1,
            "author": "No_Literature_7329"
        },
        {
            "level": 0,
            "comment": "Thanks for sharing. \n\nQuick question: how did you afford rent and general life in NYC through all these different ventures? Did you hold a part time or fulltime job?",
            "score": 1,
            "author": "Sduowner",
            "replies": [
                {
                    "level": 1,
                    "comment": "I worked either part-time or full-time depending on the year, I also had some income from the company later on.",
                    "score": 1,
                    "author": "Blanco_ice"
                }
            ]
        },
        {
            "level": 0,
            "comment": "How were you able to maintain your mental health issues after every failure?",
            "score": 1,
            "author": "Fred294",
            "replies": [
                {
                    "level": 1,
                    "comment": "Honestly, I’ve been through so much in my life that while hard it wasn’t something that would break me, mostly it was a big bruise to the ego and sad but nothing that made me deeply depressed. I took a few weeks, shrugged it off, and onto the next, I try to never dwell on stuff.",
                    "score": 3,
                    "author": "Blanco_ice",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wow this is amazing man, I'm really inspired and motivated",
                            "score": 1,
                            "author": "Fred294",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks! now its full steam ahead on [The Woof!](https://www.woofnews.co/subscribe)",
                                    "score": 1,
                                    "author": "Blanco_ice"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thanks for an easy Sunday morning read. Enjoyed it and it's certainly motivating. I hope to launch 3 or 20 businesses by the end of this year.",
            "score": 1,
            "author": "PorscheHen"
        },
        {
            "level": 0,
            "comment": " of difficulty or opposition.  \n\n\nYou are my type of entrepreneur! \n\nI would be honored if you would let me interview you for my Newsletter. DM me if you are interested in chatting.",
            "score": 1,
            "author": "DitchtheMan"
        },
        {
            "level": 0,
            "comment": "Some people do need to quit though. Not everyone wins. Nothingbwrong with quitting.",
            "score": 1,
            "author": "travelguy23"
        },
        {
            "level": 0,
            "comment": "Tough Times Never Last, But Tough People Do!",
            "score": 1,
            "author": "paulhayds",
            "replies": [
                {
                    "level": 1,
                    "comment": "Amen to that",
                    "score": 1,
                    "author": "Blanco_ice"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I  thought I was crazy or seem to be failing or. It quite getting to the next level once I realize it’s just me I have to figure to meet someone like Minded so that we can do what you and your old friend is doing I’m always looking to start and create I suggest they run friends family I’ve re routed since mentally sheesh",
            "score": 1,
            "author": "Inevitable-Log9509"
        },
        {
            "level": 0,
            "comment": "Michael Scott.",
            "score": 1,
            "author": "jpark778"
        },
        {
            "level": 0,
            "comment": "I can tell you are Indian",
            "score": -6,
            "author": "savage_kunal"
        },
        {
            "level": 0,
            "comment": "Note to self: don’t invest in this guy",
            "score": -1,
            "author": "jwasilewski"
        }
    ]
}