{
    "id": "146kfx7",
    "score": 0,
    "title": "How can I get my idea off the ground FAST?",
    "author": "Soulless_Chip",
    "date": 1686457892.0,
    "url": "https://www.reddit.com/r/Entrepreneur/comments/146kfx7",
    "media_urls": [],
    "other_urls": [],
    "postText": "So I'm 17 and I'm looking to start something/anything asap that actually has a chance. I'm looking into software companies that sell to other companies (mailchimp, salesforce, etc) since they don't really require a lot of capital to start and they have a lot of market demand. I have some ideas which are slowly but steadily becoming clearer (work from home hr, data analysis) but I want to know what I can do to get something that somebody might just use in less than 500 hours of programming/what not? Mabye a better question is how do I code faster? xD\n\nAny answers are greatly appreciated!",
    "comments": [
        {
            "level": 0,
            "comment": "&gt;So I'm 17 and I'm looking to start something/anything asap that actually has a chance.\n\nDamn, you are in the wrong neighborhood.\n\n&gt;Mabye a better question is how do I code faster? xD\n\nAs usual, I never understand the post. Even on the first and most superficial level, have you never heard of the no-code movement? Wouldn't that be 'faster.' Really this code first, ask questions later bullshit is vintage Build It And They Will Come.\n\nOnly you don't have Kevin Costner to carry the whole project to success on his back. Truth be told, when is Kevin Costner around when you need him? \n\nNext, people are in a hurry to 'get there,' only to find there is no 'there' when they arrive. They just want to do [random shit](https://www.reddit.com/r/Entrepreneur/comments/eycm8w/need_a_bit_of_help_created_an_amazing_product/) and get their payoff. Well there is a payoff but it's [nothing like you imagine](https://www.reddit.com/r/Entrepreneur/comments/mupm4w/comment/gv8mh4q/?context=3).\n\nRandom shit is not an industry classification. Open for Business is no strategy.\n\nDo be careful what you ask for, plenty who wanted to start a business in the worst way got exactly what they asked for ...good and hard. Naïveté isn't a skill ... you can stop practicing.",
            "score": 2,
            "author": "AnonJian",
            "replies": [
                {
                    "level": 1,
                    "comment": "So product matket fit is probably the most important part of startups, but yeah It's definetely best to avoid doing random shit. Also being 17 i'd like to learn about the whole process more than try to become a teen millionaire.",
                    "score": 1,
                    "author": "Soulless_Chip",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "People who object that they never wanted to make a hundred million dollars quite coincidentally decided to skip most of what it takes to make one single dollar. Maybe it is more than coincidence. \n\nProduct-market fit is [somewhat important](https://pmarchive.com/guide_to_startups_part4.html).",
                            "score": 1,
                            "author": "AnonJian",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's a great point actually. You obviously don't want to solve a nonexistent problem just because you don't plan to make millions. I guess there's also answering the 'why' your idea will be successfull rather than doing useless work.",
                                    "score": 1,
                                    "author": "Soulless_Chip"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}