{
    "id": "146tgx0",
    "score": 1,
    "title": "I would like to acquire an existing cash flowing online business and have been looking at sites like flippa.com and acquire.com but the reviews warn of scams. Does anyone have any experience with these or other platforms?",
    "author": "Confident-Bullfrog82",
    "date": 1686488711.0,
    "url": "https://www.reddit.com/r/Entrepreneur/comments/146tgx0",
    "media_urls": [],
    "other_urls": [],
    "postText": "Happy to learn more about how/where to find online/SAAS business to acquire.",
    "comments": [
        {
            "level": 0,
            "comment": "Most of them are scams. People building sites, doing the bare min, then claiming all kinds of potential or just flat out lying to flip them quickly. It's been going on for years. \n\n* They claim it's \"passive income\". You don't need to do anything, it just makes money.\n* They claim they need to get rid of it because of personal finances, or finance another project, or don't have the time to run it anymore. \n* Most of them are drop-ship sites built on Shoppify. Some on WordPress. \n* They're less than a year old. \n* Most aren't making a dime. \n\nDon't lose your money, investing in a business that you don't know anything about, or how to run. ESPECIALLY something online. \n\nIf you really want to build something successful, learn how, and do it yourself.  You have a better chance of being successful when you understand what you're doing.   \n\n\nThat said, putting up yet another ecommerce site tends to fail most of the time.",
            "score": 3,
            "author": "LincHayes",
            "replies": [
                {
                    "level": 1,
                    "comment": "“Passive income” is a myth. &amp; if too PASSIVE, watch ppl w/access to your investment(s). GL.",
                    "score": 1,
                    "author": "Banksville"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Let me put it this way, I'm a dev that sometimes sells software that's \"ready to go\" or older web assets I have, but I don't list on Flippa. It's so much junk it gets lost and I don't expect to find the right buyer there (ive tried). The sites that make money on there are few are far between and often priced in some absurdist way. Most of what selling are copied templates of a concept that gets a buyer who thinks \"if you build it they will come\" is business advice. \n\nYoure going to see a lot of opportunities to invest in SaaS over the next year as it becomes faster and more efficient to release apps. If you have an industry you know well or want to target, there are even ideas for apps in that space that just need funding behind to get the dev time. That may be a way to go, investing in building something vs just buying something. \n\nThere isn't really an organized list of these, it was Flippa forever, empire flippers years ago, microacqhire became acquire and now it seems it's just that and the registrars selling expired domains. Now you might see some on product hunt but if they get any traction there they feel they made it and the ask price goes to the moon.",
            "score": 3,
            "author": "GolfCourseConcierge"
        },
        {
            "level": 0,
            "comment": "Are you able to compete? Meaning finances to even allow the necessary resources needed. You need income and finances to even compete.",
            "score": 1,
            "author": "EvolvingMedia",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am an accredited investor.",
                    "score": 3,
                    "author": "Confident-Bullfrog82",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Are you? What country how do we know? So many questions",
                            "score": 1,
                            "author": "EvolvingMedia"
                        }
                    ]
                }
            ]
        }
    ]
}