{
    "id": "1478c3v",
    "score": 132,
    "title": "10 Things I Wish I Knew and How to Scale Faster",
    "author": "Dcaim",
    "date": 1686524744.0,
    "url": "https://www.reddit.com/r/Entrepreneur/comments/1478c3v",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’ve owned a business for 4 years now in online coaching. It’s scaled to 5-figure months and I’d like to give you the top 10 things that I wish I knew sooner. \n\n1. You don’t need to spend $$$ on paperwork before you begin. Starting out, you don’t need an LLC, S-corp, etc unless you somehow bagged 100K in funding. I started my business with $30 out of my own pocket as a Sole Proprietor, created sales, and worked my way to getting an LLC and all the other fancies. If you need other stuff for legal reasons before you can sell, that’s different and should be done. \n\n2. Don’t go crazy spending time/money making your website look beautiful. Focus on ONE product. Ask your clients what part of the website/sales was appealing and what could’ve been improved. Learn from them, they paid for your services. \n\n3. Your ideal clients won’t flock to you, especially if you haven’t built a following or brand. Don’t expect to launch a website or booking system and “be found”. Getting consistent clients takes ample time in social marketing (people who don’t follow/subscribe to you), direct marketing (followers/email subscribers), and referrals. \n\n4. Get 3 mentors before you invest in coaching. Find 3 people that are at where you want to be in 5 years. Ask them if they’re willing to be a mentor or lend a listening ear. This doesn’t mean you should expect them to be your coach, but you can often go to them with very specific questions/situations. Most of my mentors make $800k-$2M a year. We meet maybe once a month (or less) but their inboxes are always open. \n\n5. If you’re an online coach, get yourself a VA. Think about how you’re spending your time - yes you can do all that a VA does, but that’s at ~$15 an hour. Do you want to make $15 an hour or $100 an hour? So why are you wasting time on things that earn $15 an hour? Before getting a VA, get good proven concept/results on the tasks you want them to do. They aren’t there to enter your business as a consultant, but to ease the load on those repetitive tasks that you’ve already mastered. \n\n6. If you invest in a business/marketing/sales/whatever coach, do your due diligence. Check out their website, their policies/guarantees, client testimonials, and reach out to 1-3 previous clients of theirs. Don’t get burned by fake reviews. Investing in the right coach/consultant can be very rewarding. \n\n7. Focus your efforts in this order: delivering value to present clients, delivering passive value to all clients, automating more marketing, and automatic your sales process. Let’s break it down - give attention to your current clients before other hypothetical clients. Your past/current clients will get you the best referrals as those are ready to purchase with little effort from you. Are you exceeding their experience expectations? Then, where possible, automate actions. Do you regularly send out the same email at a certain point? Do you set them up with access to files or your system after purchase? Do you follow up with them after their coaching is done? This can be automated. Then add marketing sequences to your followers. Some of your followers won’t purchase until years after they follow you. A value-rich email every two weeks keeps you at top of mind. Create marketing content (focus on one platform at a time). Marketing content and social engagement aren’t the same. Lastly, improve your sales funnel if needed. A client likes a systematic journey once they decide to learn more about you/what you do and they usually like instant info. How can you make the “learn more” to “thanks for scheduling your consult” seamless and scalable?\n\n8. If you’re just getting started, you’ll hear this a lot “be where your ideal clients are”. I hate that phrase, what the f does that even mean? What that actually means is where the heck would you go to complain about this topic? Reddit, LinkedIn, FB, Yelp, Upwork, whatever. Be there, add value, don’t self promote. Just comment and add value. Don’t sell you, your products, your clients or anything else. If people want to learn more from you, they’ll find you. \n\n9. Protect your business (CYA). Set up a solid policy/guarantee on your website or contract. Record your calls, send recap emails, etc. Last thing you need is a person who tells their bank they didn’t get what they paid for and you have no way to prove it or show they agreed to pay what they paid. This hasn’t happened often, but when it has, CYA has helped me win every case. \n\n10. Said this above, but focus on ONE product until you hit your first MRR goal. If you want to hit $20K a month, just sell one product until you get there on a regular basis. It’s easier for you and potential clients when there’s only one product to choose from. I started my business thinking I can do/offer so many things so I listed them all. Biggest mistake - 80% of them hardly sell if at all. Just focus on one, prove it works, refine, refine again, get client testimonials, refine again, get that system down, and THEN add more. \n\nAdditional - best thing I did was block an entire day of the week to just focus on the business instead of in the business. And rest. Your brain is not designed to heavily work 10+ hours a day. It will cause burnout fast.",
    "comments": [
        {
            "level": 0,
            "comment": "I value your advice to focus on one product. I haven’t made a sale yet. How would you recommend I choose one product from my list?",
            "score": 9,
            "author": "Key_Focus_5768",
            "replies": [
                {
                    "level": 1,
                    "comment": "Which product brings the most value/results? Sometimes that means creating a package product for the client. For example, instead of 1 training session, a fitness coach might provide 3 months of training, diet/meal plan, and a library of at home training videos. Many coaching programs I see can range from 2-6 months long vs a single service.",
                    "score": 8,
                    "author": "Dcaim",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Very helpful. Thanks.",
                            "score": 4,
                            "author": "Key_Focus_5768"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Great advice thank you.  This is helping me figure out what I’m focusing on for Monday.",
            "score": 2,
            "author": "iknowthatpicture",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks, happy it’s valuable! Is there a top thing you’re currently struggling with?",
                    "score": 3,
                    "author": "Dcaim",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hey, checkout my reddit posts may be u can help.",
                            "score": 1,
                            "author": "Man_Of_Culture_711S",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What are you currently looking to scale or resolve right now? \n\nBtw, telling me to look through your posts doesn’t actually help me help you. I just gave a long list of info in this post and then you’re asking me to look through all of your posts to figure out how you should go make money? I don’t suggest this approach if you’re looking for free help. Tell someone one thing you’re currently struggling with and why you’re asking them for advice. \n\nExample: Hey, I really liked your post about how became a freelancer and tripled your income. I’m looking to start doing something similar. How did you figure out what to promote on your page?",
                                    "score": 8,
                                    "author": "Dcaim",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "But that was worse...\nWomen ☕? Karen ?",
                                            "score": -4,
                                            "author": "Man_Of_Culture_711S"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I know, I was in a hurry and I just have a few posts, so I thought you can take a look. I thought it will be awkward to post the entire passage here.",
                                            "score": 0,
                                            "author": "Man_Of_Culture_711S"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Great advice and ill be following! \n\nAre there any guides or books that you can recommend on marketing? \n\nMy cousin is trying to grow their brand and is looking for advice just like this.",
            "score": 2,
            "author": "Artlearninandchurnin",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks! I wish I had more time for books, but here are a few that I’ve enjoyed: Marketing Made Simple &amp; Business Made Simple by Donald Miller (also a podcast), Get Clients Now by C.J Hayden, Book Yourself Solid by Michael Port. \n\nIf you do read any books on any business topic, I suggest 3 things: get an accountability partner, treat the book like an online course (actually do the actions as you’re reading, don’t just read), hire a consultant on the topic for 1 hour. Marketing is always changing, so many books will be out of date or not directed at your niche. \n\nWhen I hired a consultant experienced in online ads, I learned more in one hour than I ever have from a book, but it put most of what I read into the right perspective and reading gave me a good foundation.",
                    "score": 9,
                    "author": "Dcaim",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You are amazing! \n\nStay awesome and thanks for sharing!",
                            "score": 2,
                            "author": "Artlearninandchurnin"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Value added thanks",
            "score": 2,
            "author": "WrittenCommissions"
        },
        {
            "level": 0,
            "comment": "How do you find mentors?",
            "score": 2,
            "author": "frankhoecean21",
            "replies": [
                {
                    "level": 1,
                    "comment": "I found mine through LinkedIn and networking groups. Usually I follow them for a while and notice they have a similar persona/vibe as I do and they’re someone I’d actually get along with. Then I send them a thoughtful sandwich message: What is it about them that makes them an awesome value source and person to follow on social, specific issue I’m struggling with, specific question I hope they can answer. Once answered, thank them and ask if they’re open to being a mentor from time to time when situations like these arise.",
                    "score": 1,
                    "author": "Dcaim"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thank you for this great advice. It 100% resonates with what i do and i find this very informative. Thank you",
            "score": 2,
            "author": "AscentCareerBoost"
        },
        {
            "level": 0,
            "comment": "It was great advice.",
            "score": 2,
            "author": "ReceptiveHaircut"
        },
        {
            "level": 0,
            "comment": "I really loved point nr 7. We have few paying customers and we always treat them like the most valuable gold we have. \n\nAlso about point 10 - we had various thoughts to switch and try with something else, but we always concluded that we would just face same issues, later :D",
            "score": 2,
            "author": "fanarro"
        },
        {
            "level": 0,
            "comment": "I can tell this post comes from experience. Having owned multiple businesses, failing multiple times, and growing, I relate with these. Esp \"delivering value to present clients\"",
            "score": 2,
            "author": "digigrowth",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks, I appreciate that!",
                    "score": 1,
                    "author": "Dcaim"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Great read! Another aspect is to utilize government programs to your advantage! For Canada, there is the CDAP program that really helped a lot! A big part of it was I think the level of professional expertise the digital advisor that I went with had and how much they were able to help me!",
            "score": 2,
            "author": "ZaneA1"
        },
        {
            "level": 0,
            "comment": "What if you don’t have an idea/ product to sell or a customer/ client following. How do you narrow all of your ideas/ products down to the ONE thing?!",
            "score": 1,
            "author": "taylorgielow",
            "replies": [
                {
                    "level": 1,
                    "comment": "What niche are you in? From your array of services, what gives the client the best value/results that’s also worth your time?",
                    "score": 1,
                    "author": "Dcaim",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not sure if I’m even answering your question.. \n\nI’m in automotive sales (not sure if I want to niche further into that). I nanny on the side with mostly first time parents and as a licensed realtor I help newbie real estate investors with their first investment purchases. Any thoughts, suggestions🤦🏼‍♀️🤣",
                            "score": 1,
                            "author": "taylorgielow",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Sounds like you might have a viable option helping real estate investors choose properties to invest in wisely. I can definitely see folks subscribing to a newsletter like that. I have seen some businesses charge $10-15 a month for newsletter subscribers. As long as the content is value rich",
                                    "score": 1,
                                    "author": "Dcaim"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I want my website development service company to be my only \"product that scales\"\nDo I pick a niche in that too?",
            "score": 1,
            "author": "desertstorm-07",
            "replies": [
                {
                    "level": 1,
                    "comment": "You can if you’d like to focus on one type of industry. When I’ve looked at web developers, I’ve specifically sought out those that have built sites for coaches. Others may want to know if you understand their industry, even better if you can show your clients in the same industry have gotten good results.",
                    "score": 2,
                    "author": "Dcaim",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yupp got it\nWhat do you think are in high demand now? Eg: portfolio pages, online delivery website etc.",
                            "score": 1,
                            "author": "desertstorm-07",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Landing pages and home page in my niche. Some coaches have just one click funnels page, some have a site with 5-7 pages and blog page.",
                                    "score": 1,
                                    "author": "Dcaim"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "what type of business do you have and how long did it take for you reach 5 figures per month?",
            "score": 1,
            "author": "beautiful_bill727",
            "replies": [
                {
                    "level": 1,
                    "comment": "Online coaching. When I went full time into my business, it took about a year but could’ve been sooner if I got out of my own head and invested in the right business coach. My coach helped me create a systematic approach to get more sales calls that didn’t involve posting on social media or paying for ads.",
                    "score": 3,
                    "author": "Dcaim"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thank you for this! What niche do you specialize in and what was your experience before starting the business?",
            "score": 1,
            "author": "hughfordb",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m a career coach with experience in just about every career placement avenue possible - recruiting, career services for different schools, career coaching for a major job board, consulting businesses, and subcontracting my business to other businesses for coaching. 1/2 of this was prior to starting my business and 1/2 was after. Finding B2B stuff has helped create consistent income too.",
                    "score": 1,
                    "author": "Dcaim"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Appreciate this post. If you have time, can I ask a question?  My dad really wants me to try becoming a coach, because he thinks I give great coaching to friends - how to comprehensively view a problem, where to find answers, etc.  \n\n\nAnd my friends agree with him that I give great advice.  \n\n\n\nHOWEVER, I have a big question:\n\n\n- how did you pick your niche? I give coaching on a range of issues, family dynamics, kids education, etc.  and everything is a one-off. There is no pattern.\n\n\nThanks so much!",
            "score": 1,
            "author": "dca_user",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sounds like a life/parent coach, but you’d want to be more specific on the type of topics you solve that bring you joy. The “bring you joy” is the main focus. I’m sure you can solve a lot of things, but the joy part will keep you disciplined and steady in your “why”. \n\nI am specifically in career coaching. I’ve worked in several aspects from recruiting, to university counseling, to consulting. My issue when I started was similar - I could solve so many problems. It wasn’t until I honed in on “but what do I actually enjoy helping others get results in” is when the services defined themselves.",
                    "score": 2,
                    "author": "Dcaim"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What if you don’t have an idea/ product to sell or a customer/ client following. How do you narrow all of your ideas/ products down to the ONE thing?!",
            "score": 0,
            "author": "taylorgielow"
        },
        {
            "level": 0,
            "comment": "What if you don’t have an idea/ product to sell or a customer/ client following. How do you narrow all of your ideas/ products down to the ONE thing?!",
            "score": 0,
            "author": "taylorgielow"
        }
    ]
}