{
    "id": "147f7i7",
    "score": 7,
    "title": "Is $100M Offers by Alex Hormozi applicable for simple products like t-shirts?",
    "author": "StevenJac",
    "date": 1686545350.0,
    "url": "https://www.reddit.com/r/Entrepreneur/comments/147f7i7",
    "media_urls": [],
    "other_urls": [],
    "postText": "How is $100M Offers by Alex Hormozi applicable for simple products like t-shirts?\n\n&amp;#x200B;\n\nAlex says you need to solve all the potential problems when buying your service/product.\n\nHe uses gym training as an example where it is a complex service where many people do indeed find a lot of problems like buying groceries, meal prep, how to follow through the program so there is a lot of potential for entrepreneurs to fix the problem.\n\nHowever, for ecommerce t-shirt business how is his book applicable? \n\nAt the moment, the only problem customers face I can think of is getting scammed or the design/quality of t-shirts are not as good as they expected, which can be solved with customer service or buyer protection service from PayPal.",
    "comments": [
        {
            "level": 0,
            "comment": "People don't buy features, they buy benefits. \n\nHigh quality, or good design is not a benefit.",
            "score": 5,
            "author": "DivineSwordMeliorne",
            "replies": [
                {
                    "level": 1,
                    "comment": "People buy benefits, not features. Design is not enough.",
                    "score": -1,
                    "author": "Luciomante007",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "unless the design gets me laid",
                            "score": 3,
                            "author": "poissonbruler"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think you're missing the point of clothing lines.\n\nUnless you're a bottom of the barrel clothing company where people buy your product because they are spending conscious, you need to have a message and something you attach yourself too that's not clothing. \n\nPeople don't give 2 shits about t shirts or pants or whatever. They care about the story and what you're about.\n\nNike is about running and sports, Gymshark is about body building, crossfit, calisthenics, Monster I'd about motocross and \"extreme\" sports, now including UFC.",
            "score": 3,
            "author": "Clearhead09",
            "replies": [
                {
                    "level": 1,
                    "comment": "Gymshark is the joke of the fitness community",
                    "score": 1,
                    "author": "Kad3n02",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They do numbers tho",
                            "score": 1,
                            "author": "SwissMargiela"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I feel like his book works well for knowledge or content products with a low cost of delivery and with the same target customer everywhere you go.\n\nMake outrageous offers that are so good people can’t say no…. If your incremental cost of delivering the goods is almost nothing, then sure you can play up the value and then offer it for free if it doesn’t work.  \n\nHowever, how do you offer 10x the value on a service business?  You can’t realistically give someone $1000 of value on a lawn mowing or car detailing business for $49. \n\nYou also can’t do $1000 of work that cost you $800 to deliver and then refund them if they aren’t 100% satisfied. \n\nUltimately I liked the book but am still trying to think about how to apply it to my business. \n\nAlex’s model was helping gyms get customers. He knew from experience if he did X he would get the outcome. So he could guarantee it and charge a high price.\n\nThis feels harder to apply to something like a retail store or online shop. Everyone of those businesses is different. Every customer is different. Every message is different. \n\nI don’t know how I would apply his model to a t-shirt business. How do you play up $1000 of value on a physical product that people know what it costs. \n\nA small gym knows that 100 new customers paying $50/mo is $60k worth of annual profit at almost 100% margin. The cost of delivery is almost nothing but the fixed overhead. This doesn’t apply for a tshirt.",
            "score": 2,
            "author": "Chabubu",
            "replies": [
                {
                    "level": 1,
                    "comment": "One could create a shirt business built around a cause, for example sustainability. Market shirts to parents for toddlers -&gt; growing children on a subscription. Ex: We’ve used data to determine children need a new size about every x months. When your child outgrows it we’ll send you another shirt (new or recycled options) and a reusable package where you can ship the previous version back for recycling.",
                    "score": 2,
                    "author": "voljason"
                }
            ]
        }
    ]
}