{
    "id": "147lvp5",
    "score": 0,
    "title": "I have redesigned my virtual assistant portfolio. Please give me your review, guys.",
    "author": "ExaminationGreedy440",
    "date": 1686569659.0,
    "url": "https://www.reddit.com/r/Entrepreneur/comments/147lvp5",
    "media_urls": [],
    "other_urls": [
        "https://gulsansaurav.carrd.co/"
    ],
    "postText": "Hello guys, My name is Saurav, and I am from India. I am a virtual assistant with two years of experience. I have worked with more than ten clients. I have redesigned my portfolio website to grow my business. I need your review of my portfolio. Thank You. \n\n https://gulsansaurav.carrd.co/",
    "comments": [
        {
            "level": 0,
            "comment": "I didn't read it because of the text color change. Hurts my eyes.",
            "score": 8,
            "author": "Beautiful_Resolve_63",
            "replies": [
                {
                    "level": 1,
                    "comment": "Okay",
                    "score": 0,
                    "author": "ExaminationGreedy440"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Your website is completely broken on dark mode (Samsung s21 Ultra)\n\nBackground shows as dark grey and your text isn't visible",
            "score": 3,
            "author": "visualsbyaqib"
        },
        {
            "level": 0,
            "comment": "Hi Saurav, I agree with the other poster who mentioned the gradient colour of the text, I also didn't like that. Also I'd recommend running your copy through an editor like [hemingwayapp.com](https://hemingwayapp.com) as there are some spelling errors (30 minute consultaion), and some very long sentences. As a business owner I liked seeing the testimonials, but I wonder if there's a different way of displaying these as they were a little difficult to read. Could be another way to display your graphic design skills too!",
            "score": 3,
            "author": "DiamondMinds-co-uk"
        },
        {
            "level": 0,
            "comment": "I'm a bit overwhelmed by the amount of text in your site. Maybe updating it to be more graphic?",
            "score": 3,
            "author": "Falahil",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nice suggestion. Thank you 🙏",
                    "score": 1,
                    "author": "ExaminationGreedy440"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You only have a few moments of attention from your reader. Don’t bore them by telling them what they already know. Make a compelling headline that hints at a solution for their problems. Create a hook to keep them reading. Use a big idea to sell yourself. Make yourself something more than just a boring virtual assistant. There are thousands of those. You want to be something unique and new (it’s only the way you position yourself, you’ll be doing the same tasks).",
            "score": 2,
            "author": "maturedtaste",
            "replies": [
                {
                    "level": 1,
                    "comment": "Okay. Can you suggest something??",
                    "score": 2,
                    "author": "ExaminationGreedy440",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sure. Learn the basics of copywriting. It will help you a ton moving forward. I suggest reading cashvertising as a nice, easy introduction. After reading this, you will know how to sell yourself better. \n\nAlternatively, pay someone to do it for you from Upwork. I’m happy to rewrite your website copy for you, but it will cost you. \n\nYou’re better off reading some materials and learning to do it yourself, as it is an invaluable skill (that you can also sell as a service).",
                            "score": 2,
                            "author": "maturedtaste",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Okay thank you for your advice.",
                                    "score": 1,
                                    "author": "ExaminationGreedy440"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}