{
    "id": "147rwvu",
    "score": 546,
    "title": "‘just STFU’ - why are you should never tell anyone about your project",
    "author": "eattheinternet",
    "date": 1686589169.0,
    "url": "https://www.reddit.com/r/Entrepreneur/comments/147rwvu",
    "media_urls": [],
    "other_urls": [],
    "postText": "I wanted to expand on my previous post about the ‘key to manifesting’ (I’m a woo woo man what can I say) being this: DON’T FUCKING TELL ANYONE WHAT YOU’RE DOING!\n\nI truly believe this is the secret sauce: when you tell people about your new project, there are two main scenarios that can play out – a positive or a negative reaction - and both of them fucking suck.\n\nFirst, let's say you tell someone and they get super excited about it. Sounds great, right? Well, not really. You kinda fucked yourself energetically. Now you're on the hook. They become your unofficial boss. Every time you see them, they'll ask about the progress, and trust me, every business or project has its ups and downs. It’s not gonna be all sunshine and rainbows the whole time. You don't need the added pressure of reporting to someone. \n\nThere’s also a negative side to the positive reaction from a brain chemistry standpoint– when you talk about what you're going to do you get a quick hit of serotonin! It feels good in the moment, but it tricks you into thinking you've already accomplished something. You’ve literally done nothing so far it’s just an idea. Ideas are abundant. So when it's time to actually get to work, it feels like you're trudging through tasks instead of embarking on an exciting new journey.\n\nHere’s what I like to do: I keep things under wraps and let people find out once it's up and running with some momentum! Let them find out on their own. If you succeed they'll figure it out eventually. It’s simply hits 1000 times harder if they’re the ones asking you about it vs you telling them about the project before it’s even a thing.\n\nI don’t know why or how it works exactly but I truly believe in the evil eye 🧿..that mysterious force (ego) that sometimes gets triggered when people see you doing something great. Just weird energy simply put. It's not personal; it's all about them projecting their own issues. But hey, you’re not their therapist and you’re not responsible for anyone else’s emotional state and if you happen to be an empathetic person, you’re going to be seriously thrown off by the energies around you when talking about a new project. (Speaking from experience here.)\n\nThe other scenario you may find yourself in when telling someone about your new project, is encountering strong negativity or complete disinterest. (or any other type of ‘negative’ reactions) That’s just never a good time. Sure, some argue the negative reaction can be used as fuel - ‘I’m gunna prove them wrong!’.. but if it's someone you care about, it just feels shitty.. like ‘if that’s how they’re reacting to the initial time I told them about the project, how are they going to act when it’s a massive success? Do they just not care at all?’ (&lt;— your mind, probably) \n\nNow, I'll admit, there are a few exceptions. There are some individuals you can trust with your plans, but you need to be extremely careful. These are the people who won't get triggered by positive news or secretly relish in your failures. In general, though, it's best to keep your plans to yourself. I'm fortunate enough to have a handful of ‘real ones’ I can keep it 100 with. But God dammit they’re rare. Even with them, I often wait until things are more solid before I show them what I’m doing. The energy is just so light and pure before any external influence is put on it.\n\nSo, to sum it up, ‘the secret to manifesting’ is to shut the fuck up. Stop blabbering to everyone about your plans. It's not doing you any good. On top of that, it's way more badass to surprise people with your accomplishments instead of hyping it up all along, desperately seeking validation. \n\nYour energy should be focused on bringing things to life and making them happen, not looking for validation from anything or anyone outside of yourself. I know it sounds cheesy, but you’ve got to care about how you feel more than anything because everything you do is based off your emotional state.",
    "comments": [
        {
            "level": 0,
            "comment": "I told a family member. They knew someone in the industry, which was a surprise to me. We’re having lunch on Friday.",
            "score": 203,
            "author": "penguinino",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is the way. People can't help you if you don't tell them about it. You need those lucky breaks that come from serendipitous meetings. \n\nNegative JuJu doesn't match the power of serendipity :)",
                    "score": 77,
                    "author": "Gentleman-Tech"
                },
                {
                    "level": 1,
                    "comment": "beautiful!! You're lucky to have family like that!   \n\n\nI love my fam but ..yeah.. can't be real with them like that unfortunately.",
                    "score": 43,
                    "author": "eattheinternet",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not sure why you're being downvoted. At the same time, I guess the point here is everyone's situation is different.",
                            "score": 20,
                            "author": "penguinino"
                        },
                        {
                            "level": 2,
                            "comment": "Yes! Fucking religious nuts in my case.",
                            "score": 6,
                            "author": "fixer-upper-",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Of course. If you're starting a new venture you should talk to people about it all day, because partnerships are what make a venture successful. This pop psychology about your mental state or whatever is not sound business.\n\nThis post has convinced me to unsubscribe from this sub. There's too many posts that are solopreneur wannabe porn rather than the real nitty gritty of how you build an audience, grow sales and deliver a product/service, which are the ONLY things an entrepreneur needs to care about.",
                    "score": 16,
                    "author": "letoiv",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes. Everyone has a bright idea. Few know how to make it work.",
                            "score": 5,
                            "author": "0R_C0"
                        },
                        {
                            "level": 2,
                            "comment": "Let us know If you find such a space! I just joined this sub looking for that as well. Not “mindset / motivation” content. I will continue my search and report back here if I find such a community.",
                            "score": 3,
                            "author": "itsjackofall"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I quite like telling people about my new projects. It keeps me accountable - even to random distant friends. \n\nIf I make progress, great, if I don’t, no-one truly cares. \n\nIf I’m going for it I don’t mind people knowing, it can also open doors for the “I know a guy who also…” because you never know who can put you in touch with their friend of a friend…\n\nIf you’ve not made progress, maybe you should. Focus more, work more on it, prep more… then the next time you’ll be able to say positive stuff.",
            "score": 148,
            "author": "k_rocker",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;If I’m going for it I don’t mind people knowing, it can also open doors for the “I know a guy who also…”\n\nYeap you get it!",
                    "score": 33,
                    "author": "JustInfactsGr",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "'i know a guy who wants to start xyz' - who cares, ideas are a dime a dozen. Everyone has an idea. however, 'i know a guy who has an xyz business (as in its a thing that exists, has momentum in some way)' hits hard",
                            "score": -32,
                            "author": "eattheinternet",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "In either scenario, that conversation will never happen if you don’t tell them about your project",
                                    "score": 12,
                                    "author": "Zenophilic",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "If you’re going to approach it in an overtly negative manner, the interaction will not likely be a positive one.",
                                    "score": 4,
                                    "author": "PackOfStallions"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "\n\n&gt;I quite like telling people about my new projects. It keeps me accountable - even to random distant friends. \n\nSomeone said this is effective when quitting smoking. You tell people you've quit... \n\nIt doesn't work for me, but we are all wired differently ( I just quit without telling anyone )",
                    "score": 5,
                    "author": "ikalwewe"
                },
                {
                    "level": 1,
                    "comment": "Not so much even that... but it can also have people come along and tell you where you're at fault, and how you can improve.\n\nI'm firmly of the opinion that ideas are worthless, and execution is everything.\n\nIt's nice to have people help me execute.",
                    "score": 3,
                    "author": "prankster999"
                },
                {
                    "level": 1,
                    "comment": "That’s cool you do you. I’ve just seen it personally in my life the amount of times that people talk about projects and then end up crumbling because of the pressure… It’s just so common.",
                    "score": -20,
                    "author": "eattheinternet",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Realistically, I am sure its not talking about it that determines if it works out or now. You just don't hear about the people who crumbled due to something else because they never talked about it.",
                            "score": 8,
                            "author": "DemonGoddes"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Probably depends on your intent when speaking of it in relation to op post",
                    "score": 1,
                    "author": "anon3451",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I took it as ‘don’t tell anyone’ as in, if you did tell people you would look like an idiot if you fail. \n\nI firmly believe there’s a lot of upside from talking about it. \n\nI’m a big believer in James Clear’s ideas - if you want to be an ‘X’, act, and behave like and ‘X’. That involves being an ‘X’, and telling people you’re an ‘C’. \n\nThere is accountability, belief and opportunity in taking about it. \n\nMaybe OP doesn’t speak to a lot, or has negative energy in acquaintances but I reckon if you tell no-one, you’ll get no symbiosis or shared opportunity - even if the downside is that you might fail.",
                            "score": 2,
                            "author": "k_rocker",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is garbage advice. It's extreme.  Yes, you should not solely seek personal validation from others--collecting \"yes\" people around you. Yes, you should be more focused on doing whatever work you can (within healthy boundaries). \n\nBut, it's usually best to find the right balance between extremes.\n\nTelling the right people about what you are working on appropriately is a great way to rally others around you and open the door to untold opportunities that would otherwise go unknown to you.\n\nThe main thing is to not make every relationship or your entire existence about what you are working on. Don't be transactional. Don't be a boring or weird obsessive person.\n\nBe a person that builds healthy relationships that can connect with others on various different levels about more than one thing (what you are working on).\n\nYou never know who someone knows or how they may be willing to help you experience success.",
            "score": 205,
            "author": "GaryARefuge",
            "replies": [
                {
                    "level": 1,
                    "comment": "Telling trusted people is also a great way to avoid sinking years and fortunes into an enterprise that won't work because of factors outside of what's on your radar. Going solo is the surest path to failure.",
                    "score": 38,
                    "author": "squ1bs",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "literally horrible advice.",
                            "score": 4,
                            "author": "VandalezIndustries"
                        },
                        {
                            "level": 2,
                            "comment": "We have enough to go around for everyone. Why fight for crumbs when you can have the entire pie.",
                            "score": 1,
                            "author": "designgrl"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "i hear you, if you're lucky enough to have 'real ones' you can talk to about what you're about to do, awesome! but most people don't have that network in their life (even close friends and family will react in funky ways that can throw off the energy of an idea. remember im talking about the infant stages, the absolute starting point - the idea, not anything real yet. its energetically fragile)  \n\n\nthis advice is extreme but it works. maybe not for everyone, but for myself in countless examples over the last few decades.  \n\n\nI'm basically saying, in another way, 'just fucking do it' and 'one step forward is worth 1000 years talking about it'   \n\n\nAt this point in my life, when someone brings up an idea that they want to start, I try to be positive but it's hard to be when I know they're just looking for short term validation and respect. (unless they've done shit in the past which is an entirely different story) I used to get hype about it years ago but i learned how most people are just looking to feed off my energy and they are ALL TALK. 99% of people are all talk and need to stop blabbering and start doing",
                    "score": 20,
                    "author": "eattheinternet",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "OP, I went through your post history, sorry if it’s weird — I found another post you did here a while back that mentioned your story. It was nice to hear. One of the key things you emphasized there is radical honesty and how it contributed to your success. You told people what you were doing, which made people trust you. I know this was in a specific circumstance, but I can’t help but wonder how different it felt from this post. What made you change your mind? Do you think now you have more to protect and more to lose versus back then?",
                            "score": 5,
                            "author": "SmellyAlpaca",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "&gt;if you're lucky enough to have 'real ones' you can talk to about what you're about to do, awesome!\n\nLuck is not required.\n\nTaking care of yourself, understanding yourself, practicing empathy, practicing compassion, learning how to communicate effectively, and strategizing how to matchmake with those you are most aligned with and in need of learning from is how anyone could do this very well.\n\nThese are all skills. Skills that can be learned and mastered.\n\nWorking with a psychologist (everyone would benefit from having one for anything that comes up in life) is a great starting point for all the above. I know a psychologist is often hard to come by for most people (especially in a country like the USA). Reach out to the many non-profits for assistance. Don't be scared or feel ashamed.  It is like a trainer at a gym but for your mental health.\n\nUnderstanding yourself, who you are trying to connect with, and why is the starting point. Then, you can start to identify strategically aligned persons that may be great matches. Once you have done that, start reaching out to those people. Be chill. Be gracious. Be respectful. Be grateful. Be passionate. Be patient. Be the best version of yourself. Don't ask for a lot to start. A simple 15 minute call or 30 minutes to grab coffee/tea together. Be intentional and clear about why you are reaching out to them. If you connect and set something up, that's when you can start to vet each other and the possible relationship you are building. As things progress you continue to vet them, establish and manage boundaries, and be aware of red flags to indicate they may not be \"a real one.\"\n\nYou can find people on an endless number of socials, at in-person events and meetups, in trade magazines, or wherever. Be open and receptive to discovering and possibly meeting new people. Be focused but not rigid. A professional relationship is very different from an intimate romantic relationship. You're not living together. You're simply supporting each other where you can.\n\nAnyone can do this starting with ZERO connections or friends.\n\n&amp;#x200B;\n\n&gt;but most people don't have that network in their life (even close friends and family will react in funky ways that can throw off the energy of an idea\n\nThis is usually due to the person sharing their idea in a manner that is hard to understand, overly ambitious if not delusional, or obsessive--they are giving off weird energy that may even be toxic. That often leads to the recipient reacting or responding in a less than favorable manner than what was expected or desired.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&gt;remember im talking about the infant stages, the absolute starting point - the idea, not anything real yet. its energetically fragile)\n\nThis is a self-report about your own mentality being weak, easily influenced, and hinging on validation from others without any data to lean on.\n\nIt is only fragile because you are fragile.\n\nInstead of avoiding other people, it is a lot more beneficial to address your weakness and overcome it.\n\nInstead of advising others to give in to weakness, it is a lot more beneficial to help them recognize that weakness and overcome it.\n\nIt is not easy for everyone. I struggled with it. I still do. But, it is exponentially more beneficial to even try pushing through it than hiding.\n\nThis is a weakness that will ultimately doom most. Adversity and outside influences only grow as your company grows. It gets much harder as you go.\n\nAgain, a psychologist is the best starting point for this.\n\n&amp;#x200B;\n\n&gt;this advice is extreme but it works. maybe not for everyone, but for myself in countless examples over the last few decades.\n\nYou think it works. But, you have no idea how many missed opportunities you have had because of shunning away from others.\n\n&amp;#x200B;\n\n&gt;I'm basically saying, in another way, 'just fucking do it' and 'one step forward is worth 1000 years talking about it'\n\nYou are creating a false choice. You can do both. You can be getting shit done while openly sharing with others what you are doing.'\n\n&amp;#x200B;\n\n&gt;At this point in my life, when someone brings up an idea that they want to start, I try to be positive but it's hard to be when I know they're just looking for short term validation and respect. (unless they've done shit in the past which is an entirely different story)\n\nYou are making a big assumption about people. Why is that all they are looking for?\n\nEven if they are, why are they seeking that? Is it for their ego? Is it to stave off their fears of failure? Is it a misunderstanding of lean methodology and product validation?\n\nHow does what they have done before relate to their motivation behind sharing what they are working on with another person or looking for short-term validation and respect?\n\n&amp;#x200B;\n\n&gt;I used to get hype about it years ago but i learned how most people are just looking to feed off my energy and they are ALL TALK. 99% of people are all talk and need to stop blabbering and start doing\n\nIt seems like you haven't taken enough time to develop empathy, communication, matchmaking, and vetting skills.  Perhaps some more self-awareness would be beneficial as well to re-evaluate your past and current relationships and why you have experienced those situations and may still be (thus, being so extreme in your actions and views).",
                            "score": 10,
                            "author": "GaryARefuge",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I agree with everything you just said. OP’s advice comes from a place of uncertainty and insecurity. I recognize it because I often feel it myself, but I know that it’s something to be worked on.\n\nYou mention it in your post that you still struggle with this, and perhaps your tone is more to the part of yourself you see in OP, rather than OP him or herself — or maybe this is the kind of talk that motivates you — but I do think it may minimize just how hard all the inner work to overcome these personal issues are, especially if you grew up in a terrible environment (abusive, poor, homeless, etc). Some stuff will always stick with you, no matter how much success or money you have. I’m sure you have those parts of yourself too. Even though I know you mean well and I agree with you, I too feel a bit discouraged reading this. \n\nI think to balance out your post, we have to give ourselves a little bit of grace and forgiveness for all the parts of us that we dislike or are ashamed of. That doesn’t mean to stop trying to be better, but just acknowledge that it is going to be hard, and failing to change immediately doesn’t mean failing in general.",
                                    "score": 4,
                                    "author": "SmellyAlpaca",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "its actually good advice. \n\nI've been in this same boat. \n\nmany negatives telling people about your endeavors. \n\n1 - They can steal the idea. (this happened to me. My brother in law stole an investment idea I was thinking up with my wife)\n\n2 - People dont understand your idea. The thing about that is sometimes ideas arent for everyone. in fact.. maybe they are only for a small percentage of the population and as such explaining it to others is sometimes frustrating. \n\n3 - They are jealous of your new idea or project and are secretly hoping for your failure. (yes.. these people exist. they are too lazy to do anything and dont want others to succeed either )",
                    "score": 10,
                    "author": "VandalezIndustries",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "yes indeed, one of best advice tho",
                            "score": 6,
                            "author": "resigned_jay"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Also telling people holds someone accountable for their benefit. So if they feel demotivated along the way, a reminder of the convesation will keep them going.",
                    "score": 2,
                    "author": "DamnCoolGuy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That should be managed well. It could be dangerous to declare deadlines to people outside your organization. \n\nOften, the inexperienced, foolish, or outright stupid will declare a deadline for something arbitrarily and without any deep thought applied to arrive at the deadline. That often sets a person/team up for failure as they can't meet the deadline given their current resources and understanding. That then leads to others having unfavorable opinions due to being disappointed or even harmed. Then, you are feeling bad and attacked from within and by others. Not good for the mental health or the company brand.\n\nTo feel accountable to others it is often enough to simply share what you are working on without sharing a deadline.",
                            "score": 1,
                            "author": "GaryARefuge"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I've opened several successful businesses and I absolutely agree that this is garbage advice. \n\nPeople are mostly scared that the idea is being stolen, but this in reality rarely happens I believe. \n\nFor me talking about my idea (at least with other successful people) might help a lot. You might get good feedback, additional ideas, you might be connected to other people that can help you and also you could get negative feedback in terms of potential problems which you should also take in consideration as you possibly did not think about that in the first place. \n\nThat being said, speak with competent people about your ideas; don't necessarily spread it out to everyone in order to get some self-affirmation.",
                    "score": 2,
                    "author": "maC69",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "This is the correct advice. Entrepreneurship can be intellectually lonely, especially in the beginning. You need your trusted people in your conger championing you to keep you going through self doubt to remind you of why you are doing it and to keep you accountable to yourself.",
                    "score": 1,
                    "author": "curious_astronauts",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It is only lonely because the person makes it lonely. Loneliness is not a requirement or an inevitable outcome.",
                            "score": 0,
                            "author": "GaryARefuge",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's lonely because there is only so much you can talk about something that you are building from scratch. Until you have employees who can strategise together you can only give your trusted people the highlights.",
                                    "score": 4,
                                    "author": "curious_astronauts",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It is lonely because they allowed themselves/forced themselves to become a one-dimensional person with nothing else in their life to speak about or share with others.\n\nEven worse, they don't have the capacity or willingness to listen to others and relate to them in their journeys (personally or professionally).\n\nBe aware of what you are allocating your time for. Set healthy boundaries. Live as balanced a life as you possibly can, given your means. Do not make your life only about work. It is okay to go slower. You'll still be progressing and that is what matters most. Rushing for the sake of going as fast as you can almost always results in failure. The failure you don't easily bounce back from.",
                                            "score": 2,
                                            "author": "GaryARefuge",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It's ironic that you're You are really painting everyone with the same one dimensional  brush. I don't talk about my business much precisely because there is only so much capacity someone has on a topic. So the topic moves on to other things as it  should. Many creative pursuits have elements of loneliness in the process. Authors are notorious for this. Imagine George RR Martin building the world of Game of Thrones where, at that stage, it only existed in his mind and having no one to really talk to about it. Because friends and family can only take so much on something they can't see or feel before their eyes glaze over. It's not that Entrepreneurs have nothing else to talk about - it's just that there's a major thing happening in their life and they don't have people that they can really share the passion and the burdens with unless they are lucky enough to have found a co-founder.",
                                                    "score": 2,
                                                    "author": "curious_astronauts",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "i have only announced one thing to my immediate family member in terms of plans and that is \"i want to leave my job to try and freelance\" which is 50% of the truth. The reality is I have a few product ideas I want to research and understand, but I have yet to mention them to anyone because I know that they are radically different ideas that will pull varied reactions. You are 100% on point with this.",
            "score": 6,
            "author": "Rymasq",
            "replies": [
                {
                    "level": 1,
                    "comment": "idea to test product/biz before much investment: create a landing page and run ads to the thing, then have a 'sold out - be back soon' page when they go to checkout. This can give you a good feel for the potential demand (you could also post in fb groups in the niche you're looking to get into for feedback from strangers)\n\n  \nIf you ever wanna chat to a stranger about it, feel free to reach out! (I'm sure strangers like myself might add some energy to it to a certain degree but just way less than friends and fam)",
                    "score": 1,
                    "author": "eattheinternet",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "not a bad idea at all, my ideas are not necessarily tied to a specific good, but rather aimed more in the area of service and human capital. still though, it's possible to test out with that exact template to gauge market interest.",
                            "score": 1,
                            "author": "Rymasq"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;I truly believe this is the secret sauce:\n\nYeah, no, all of that \"objective\" truth that you seem to think that you've found is just something specific to you. Some other people will be similar to you, and others will be the complete opposite.\n\n&gt;Your energy should be focused on bringing things to life and making them happen, not looking for validation from anything or anyone outside of yourself.\n\nAnd there you just told people to not get a support network with likeminded people that help you focus on the hard, and often very lonely, work of realizing your own project. Getting \"validation\" about where you heading is important, and so is market testing and getting feedback from both doubters and believers (and future customers.\n\nTalking about your project is important. Working on yourself to be able to handle talking to other people about your project, that's also important.",
            "score": 60,
            "author": "downtownflurry",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think I understand where OP and you are going, and theres a difference.\n\nHaving a support group of people you can ask advice from, and \"accountability buddies\" who help you keep on track is very important. These are people who are directly involved in your success.\n\nI think OP is talking about telling random family members and friends who know nothing about it, either as a way to brag or get that motivation, or just to tell someone youre excited about your life. I can see how that backfires and adds extra barriers to overcome.\n\n&gt;Working on yourself to be able to handle talking to other people about your project, that's also important.\n\n10000000% agree. For me though, Ill add that I remove these barriers as much as possible as well. Knowing how to deal with your mindset and talking to people in your life is important. But dont put yourself in stressful situations, especially if you dont know how to handle it yet, ya know?",
                    "score": 17,
                    "author": "Loon_Tink"
                },
                {
                    "level": 1,
                    "comment": "OP's experience maps really well with my reality. I made the mistake of telling my former manager about my business goals and he won't stop asking every other week about \"how's the business going?\"\n\nEvery time I have literally nothing meaningfully positive to reply back with and I hate it. Like dude, I will message you ECSTATICALLY if I my dumb attempts gets any traction or revenue, you don't need to ask.\n\nIt's like someone asking an ugly, unsocial guy over and over \"how's the dating life?\" - it's a Seinfeld comedy skit that writes itself.\n\nWhat you are saying is great, IF its with people who are also entrepreneurs, otherwise you are statistically more likely to invite the things OP is talking about.",
                    "score": 6,
                    "author": "AccountOfMyAncestors",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;It's like someone asking an ugly, unsocial guy over and over \"how's the dating life?\" - it's a Seinfeld comedy skit that writes itself.\n\nIf that's how you think about yourself and your entrepreneurial endeavors you're not in a positive place, and you can change your attitude to be more positive even when you don't see the results that you want.\n\nHe's curious, he's making smalltalk, it's something positive; it's you that take that as a reminder of you \"failing\".",
                            "score": 1,
                            "author": "downtownflurry"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I’m the opposite. I build communities around my ideas while I develop them and have great success",
                    "score": 4,
                    "author": "AtlasMundi",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Tell me what projects you have built a community around and tell me about the success you have had ? DM privately if you don’t want to share with this board",
                            "score": 1,
                            "author": "Bluesky4meandu",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I get talking to business people or strangers, that’s quite different because you’re doing market research. But when it comes to telling people in your personal life, it’s a very different story.\n\nMaybe I’m just wrong in this thinking, but personally I’ve never seen an example of someone who has succeeded after telling people (friends and family) about the project before it’s even a thing. Also, from personal experience projects fizzle when I tell people, but if I keep my head down and work on them before telling people, then there’s no pressure and it can happen on its own time. \n\nHowever I do know an unbelievable amount of people who have talked about doing something and then absolutely crumbled under the pressure. (Likely the reader of this comment know exactly what I’m talking about). It’s such a common story it’s painful to see.\n\nI always suggest to people that they keep it to themselves when they’re just getting started, at least let it grow a little bit before telling people because an idea is so fragile in those early stages.",
                    "score": 10,
                    "author": "eattheinternet"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ideas are cheap and plentiful. It's the execution that is difficult and rare. Tell people.",
            "score": 5,
            "author": "independent_hustler"
        },
        {
            "level": 0,
            "comment": "I actually completely agree with you. Everyone’s different of course, and some people need that external encouragement and validation to keep going. \n\nHowever, for me, I just do it and tell people about the results. It creates too many expectations when I tell people what I’m doing.",
            "score": 4,
            "author": "blackboyx9x",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;some people need that external encouragement and validation to keep going.\n\ni wonder why that is! tbh feels deep rooted - the need for others approval, overcoming self-doubt, hoping it'll jumpstart their motivation/energy.   \n\n\nI think it's great if it works by telling others - but too many people try that and fail. so I'd just suggest to those people to try the 'keep it to yourself' way at least once and see what happens",
                    "score": 2,
                    "author": "eattheinternet"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think we as people put too much thought into “the universe” “energies” and in general superstition. \n\nWhether you tell people or not, will not logically impact the success of your business unless they steal the idea. \n\nNow the serotonin thing is true, every time you tell people you think you’ve already accomplished it, and you drag on the tasks—if you’re a lazy person. \n\nI think the best thing for success is realizing that there are no such things as coincidences in life. There is no higher power pulling strings in the clouds. Every other living person is either a competitor, a friend, or someone to buy your product/service. We are all the same, we are all apart of the same hominid species. There is nothing magical about our existence whatsoever. We are here, we have built tools to allows us to live better. If you make a new tool and get others to buy it then you will live better than those around you. Period.",
            "score": 5,
            "author": "beoptimisticworkhard",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Sounds like you don’t want to be held accountable. A common tactic used to accomplish big goals is to tell people about them because they will help keep you accountable.",
            "score": 16,
            "author": "itrallydoesntmatter",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, very much so. I don’t want to be held accountable for a project I’m just starting. Why would anyone want that pressure? Some strange psychology is happening if that’s what you required to make something a reality. \n\nI might want to drop it randomly as I do with a lot of projects. I might get bored. So I don’t want that external energy put on me while the project is in its infant stage.\n\nIf you are being driven by anything from the external world, then you’re off center energetically speaking. \n\nThe best energy to have when creating something new is to literally not care what anyone thinks good or bad to not get excited or depressed. To stay in the middle. To stay Zen. If you are unaffected by other peoples energies, more power to you but I think most people are affected by the reactions of others",
                    "score": 10,
                    "author": "eattheinternet",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Spoken like a true artist.",
                            "score": 6,
                            "author": "Visible_Field_68"
                        },
                        {
                            "level": 2,
                            "comment": "I think it also changes the type of driving motivation from « I’m doing this because I want to » to « I’m doing this because I have to ». The first is much more potent and keeps you in a better mood while doing it.",
                            "score": 2,
                            "author": "Rustler9",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "What big goals has that attitude helped you accomplish?",
                            "score": 0,
                            "author": "itrallydoesntmatter",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I’ve started multiple businesses over the last 13 years, three of them have become multi million dollar businesses. Ive done multiple eight figures in sales online, I have a successful podcast, I have multiple TikTok accounts with hundreds of thousands of followers total, I have a YouTube following, I am a photographer, I’m successful in the NFT space (content creator, flipper, artist). I just sold my first business this year. I’m an artist and I sell physical pieces online. I’ve been a part of a ton of epic projects. I’ve done a ton of shit, literally more than anyone I know",
                                    "score": 3,
                                    "author": "eattheinternet",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Diamond hands baby!  Today is the day, and if not today tomorrow!",
                                            "score": 4,
                                            "author": "Heavy_Solution_4099"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "can you please privately DM me any of your work ? Not a single person had made money in the NFT space except for a couple of individuals at the beginning.  What are you selling in the 8 figures ?\nHonestly, show me somethings",
                                            "score": -1,
                                            "author": "Bluesky4meandu",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Just an observation- but you sound very immature tbh. You don’t have to prove yourself to internet strangers at all.",
                                            "score": -1,
                                            "author": "darthcrossbowman",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If I could give this 100 up votes…\nIt’s like you are in my head. \nI just said this exact thing to my wife. \nWeird",
            "score": 11,
            "author": "Visible_Field_68",
            "replies": [
                {
                    "level": 1,
                    "comment": "thats cool lol! Tthis came from a spiritual teacher 'Esther Hicks' (also known as 'Abraham Hicks') where she says \"keep your ideas and desires close to your heart, nurturing them with positive energy and focus. Avoid sharing them prematurely with others, as their doubts or negativity might disrupt the manifestation process' - so this teaching is definitely out there! (you'd vibe w/ AH btw if you feel strongly about this message!)",
                    "score": 5,
                    "author": "eattheinternet",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "wow i never knew this. i've been doing this now for the last 3-4 years. I used to always tell people about my ideas. be it business, investing or development and I started to notice that there was always this weird feeling and vibe after more and more people learned.. \n\nbut when I work on something on my own and keep it private.. by the time its ready to launch it goes big and people are blown away by it.",
                            "score": 5,
                            "author": "VandalezIndustries"
                        },
                        {
                            "level": 2,
                            "comment": "I’ve read about this before. \nA couple of decades ago I was on a tear with ideas and trying to find out what they would really turn out to be. \nThat’s when I learned to keep it to myself until the idea is totally finished. \nI don’t focus on making money or success when I’m working on something. It’s an artists kind of thing I guess. I just have to do it. I can’t explain why. I just have to do it. \nWhen other people get involved the focus and energy just changes. I loose my balance I guess. \nI do have issues with staying motivated on one thing though. Sometimes that’s good and sometimes it costs ALLOT. It’s the price of this kind of creativity. Im cool with that.",
                            "score": 3,
                            "author": "Visible_Field_68",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;I don’t focus on making money or success when I’m working on something. It’s an artists kind of thing I guess. I just have to do it. I can’t explain why. \n\nholy shit yeah im 100% the same way! i just wanna create cool shit while im here on this earth, we're not here for long. The money's important to me but only to continue to create  \n\n\n\"I do have issues with staying motivated on one thing though.\" - same tbh. Not always but for a lot of things at a certain point i like to bring a team together so that it can carry the momentum and other \\[people can do the daily tasks to keep things going",
                                    "score": 2,
                                    "author": "eattheinternet",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Lol \nI have a great product for little league pitchers that I have been sitting on for 15 years because a kid in California got a provisional patent on a very similar product. \nI could go up against him and do the sleepless hard work for $7 an hour thing to get it to a point it could support itself but I just lost interest. \nI have a working prototype, sales and advertising ideas hashed out and a way to get kids using it for free and everything. I’m just not interested in the legal shenanigans. Even if I get a patent, someone in china will knock it off. Unless I flood the market with a cool name and make a warehouse full of them it’s just not something I’m interested in right now.",
                                            "score": 1,
                                            "author": "Visible_Field_68"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "dude. LOL same here. I said this to my wife also. .shes always telling people what I'm working on and then goes \" Tel them about that thing you're trying to build\"  and i'm like.. jeez... first off no one will understand it since they arent the demographic.. second if it seems like a big success they will just be jealous. Other than best friends and your immediate family.. most people are jealous. \n\nits the same reason families fight over an estate.",
                    "score": 3,
                    "author": "VandalezIndustries",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Having been in a stealth startup, it is incredibly important to get out and get feedback from actual potential users.  The last thing I’m worried about is anyone else stealing my idea.  I’ve been old enough for a long, long time to understand the importance of potential users.  Of course people you know will say the wrong positive things.  You should have enough experience and know that their opinion doesn’t matter.  If you don’t know who to listen to and who not to listen to, you aren’t a good entrepreneur anyway.",
            "score": 2,
            "author": "Longjumping-Ad8775"
        },
        {
            "level": 0,
            "comment": "I agree with you 1000%. One's probability of success is directly proportional to their ability to STFU. Big talkers fail like 99% of the time.",
            "score": 2,
            "author": "Brilliant-Swimmer265"
        },
        {
            "level": 0,
            "comment": "I love telling people what I do so they can give me their opinion why it's wrong and wouldn't work well. Not becouse they are always right about everything, but because it keeps me double checking my blindsides. I don't need external validation, the market does that, I want external thinking, an outside perspective, as I can't do that.",
            "score": 2,
            "author": "Castravete_Salbatic"
        },
        {
            "level": 0,
            "comment": "What an … interesting post lol",
            "score": 2,
            "author": "CovetousDuke"
        },
        {
            "level": 0,
            "comment": "Nope. Ideas are cheap.",
            "score": 2,
            "author": "cptngeek"
        },
        {
            "level": 0,
            "comment": "Nope, wrong. Talk it through with as many smart people as you can. Friends, contacts, even good old Reddit. You should seek out criticism so you can build a better product. You can disagree if you want, but any experienced entrepreneur knows this is an important part of the process.",
            "score": 2,
            "author": "zipiddydooda"
        },
        {
            "level": 0,
            "comment": "Lol I didn’t need to read this whole thing to know it’s trash. When I was starting up my own parents didn’t believe in me. Would tell me “get a real job” act like I wasn’t doing anything or spending a day packing orders wasn’t real work (they ate crow real fast when I asked for help packing orders once).\n\nTo be invalidated by the closest people to you sucks. The real lesson though is you should be confident enough in yourself and your ideas that the opinions of a few people won’t stop you. In fact, if some irreverent opinions of people can influence you to the point of scrapping your entrepreneurship, you really don’t have what it takes because there will always be shitty people with shitty opinions.\n\nThe real advice is to learn to filter signal from noise, believe in yourself, and make sure your footing is solid before taking a step.",
            "score": 2,
            "author": "crappysurfer"
        },
        {
            "level": 0,
            "comment": "I have found that by sharing your project, you open doors to potential collaboration and valuable feedback from others who may have experience or expertise in your field....\n\nTheir insights can help you refine and improve your work. Additionally, sharing your project can also help you build a community around it, connecting with like-minded individuals who can support and promote your endeavors.  \nWhile it's true that you get that pleasure feeling while sharing what you are working on - positive reinforcement and encouragement can go a long way in boosting your motivation and helping you reach your goals.  \n\n\nAll in all don't be afraid to explore the benefits that come with opening up about your projects and engaging with others who share your passions.\n\n&amp;#x200B;\n\n\\-CP85",
            "score": 2,
            "author": "chasinpaper85"
        },
        {
            "level": 0,
            "comment": "I have some experiences where this has seemed 100% true - and others where telling the *right* people about it was Key in me achieving what I was striving for.\n\nI really think it matters the type of person you tell. \n\nOverall though, I love this quote:\n\n“WHEN YOU'RE GOOD AT SOMETHING, YOU'LL TELL EVERYONE.\nWHEN YOU'RE GREAT AT SOMETHING, THEY'LL TELL YOU\"\n-Walter Payton",
            "score": 2,
            "author": "tako_shark"
        },
        {
            "level": 0,
            "comment": "Honestly I enjoy telling people about my idea and try to get as much validation and criticism on the concept. But as soon as I launch the product and start getting my first sales - I shut up and just keep it all to myself. Sharing my idea helps me convince myself to go ahead and pull the trigger. But after that the pressure is on me no more help or advice I gotta trust my gut and only talk about the business with my mentors or other equally obsessed people.",
            "score": 2,
            "author": "YoungStudy",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s cool I don’t know how you do it! You might be a lot stronger than me emotionally and I might just too sensitive to other peoples energies idk. I’ve brought a lot of businesses and projects to life and one thing I’ve noticed in myself is that the project will be brought to life much quicker and easier if I don’t share it with anyone until it’s got momentum",
                    "score": 1,
                    "author": "eattheinternet"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Shhhh! You’re going to upset the wantrepreneur circle jerk!",
            "score": 3,
            "author": "jnkbndtradr"
        },
        {
            "level": 0,
            "comment": "&gt;Your energy should be focused on bringing things to life and making them happen, not looking for validation from anything or anyone outside of yourself.\n\nThis is the single worst piece of advice I can think of. This is how people end up building things that nobody wants other than you.",
            "score": 2,
            "author": "Hephaestite",
            "replies": [
                {
                    "level": 1,
                    "comment": "Bingo.",
                    "score": 1,
                    "author": "rackmountme"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So your reason is mistic mumbojumbo? Ok pal, LOL.",
            "score": 2,
            "author": "maxalmonte14"
        },
        {
            "level": 0,
            "comment": "I couldn’t disagree more",
            "score": 1,
            "author": "dreeke92"
        },
        {
            "level": 0,
            "comment": "I wish people would stfu about “manifesting”",
            "score": 1,
            "author": "throwaway_mog",
            "replies": [
                {
                    "level": 1,
                    "comment": "guess what? CHICKEN BUTT!!  \n\n\njust curious.. I wonder if you'll read this comment knowing it's about manifestation, or if you have the strength dear throwaway\\_mog to read this far into the comment and then look away having never read the rest?  \n\n\nok, ready? here we go!  \n\n\n(this is about manifestation once again fair warning)  \n\n\neverything in your life is an outward reflection of your inner world. If you look in the mirror and see a frown, but decide to smile back anyway - not because that's what you see BUT INSTEAD BC that's how you want to feel - then the mirror can't help but to smile back.",
                    "score": 0,
                    "author": "eattheinternet"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "You are very smart.  I’ve been telling people the same thing for years, both in business projects and well as weight loss.  You are the first person I’ve seen on Reddit who understands this.",
            "score": 1,
            "author": "onepercentbatman"
        },
        {
            "level": 0,
            "comment": "I like telling people about not just projects but also lifestyle choices because it brings forward different perspectives and helps me evaluate my ideas. And yes if I fall through no one cares but if it saves me some time in pivoting it then its a win for me",
            "score": 1,
            "author": "notsocialwitch",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;I like telling people about not just projects but also lifestyle choices because it brings forward different perspectives and helps me evaluate my ideas. \n\nyes there is a serotonin hit that you get that when telling people about ideas. Feels good to sit over a beer with friends talking about what could be  \n\n\nnot saying it can't work of course, but personally has it worked for you? have you been successful in the things you said you would do after telling people?",
                    "score": 1,
                    "author": "eattheinternet",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes. Infact I have realised that sharing an idea with someone has made me more driven and accountable for doing it. \n\nSometimes it has also helped plant the seed in my husband's mind on what we should be doing. \n\nWorked for me and us as a couple really well!",
                            "score": 1,
                            "author": "notsocialwitch"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think up to a certain point it's important to keep things under wraps. But at some point it's great to share the idea. Even if it's not all rainbows. Share the nit and gritty. The amazing joys. And the frustrating road blocks. Let them hold you accountable on your project. Even if the update or accountability is just you prattling off the mundane tasks you need to wade through in order to get to the fun adventure.",
            "score": 1,
            "author": "Sewers_folly",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; But at some point it's great to share the idea\n\nI agree for the most part. At a certain point i usually tell people or bring others on the team so it carries it's own momentum (bc i get bored w projects that i should stick to so its nice to have weekly meetings for example).   \n\n\nI usually share when it's officially 'a thing' (definition depends on what the project is) - but tbch, as fucked up as it is, a lot of times i \\*still\\* don't share what i'm up to bc of how it triggers other people. people in general, even your best friends, will often times get uncomfortable when you're shining bright and crushing it ,. shows you clearly who the 'real ones' are",
                    "score": 1,
                    "author": "eattheinternet",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Your verbiage is dreadful. You're original post you site concerns of being held accountable. Now you're saying you get bored with your projects.\n\nI'm having a hard time wrapping my mind around this reality where you have no supportive peers. I'm really sorry if this is the case. It sound pretty depressing.",
                            "score": 1,
                            "author": "Sewers_folly"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Have a read [of this principle](https://www.principles.com/principles/d775fbc1-c9f1-4bf6-85a5-affe51982cec/) by Ray Dalio.\n\nYou're on the right track, but it's not quite actually about the act of telling people. The more important part is actually what do you do with their opinions after you tell them.\n\nTo be successful you should surround yourself witb as many \"believable\" people as possible. Like mentors or someone you've vetted previously.\n\nIn other words, telling your grandma about your business idea and receiving an amazing feedback might feel nice, but unless grandma has decades of experience in the business you're building, she might not be very believable.",
            "score": 1,
            "author": "pxrage",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;The more important part is actually what do you do with their opinions after you tell them.\n\noh shit! ok yeah this is spot on you're so right! It's most definitely my reaction - my internal world - that throws things off externally. I gotta work on that!  \n\n\nRay says having \"open-minded conversations with believable people who disagree with you is the quickest way to get an education and to increase your probability of being right\" - I think the key here is \"open-minded conversations\" .. an open-minded person will let you breathe, they'll give you space, and they'll be willing to change their mind. They're looking at it objectively - which is a rare person bc most people get their egos all tied up in the conversation.  \n\n\ndamn this is a good comment! droppin wisdom rn. I agree you need to be around successful people - winners, people actually doing shit, mentors - i always say 'real ones' bc they CAN be a friend or family member if you're so lucky to have someone like that in your life who can be 100% real with you and they're coming from a good place.   \n\n\nI totally see what you mean about telling grandma. I'm very lucky to have a few people who will respond from such a loving place and I highly respect their input when starting new ventures. BUT, even with those 'real ones' - i've still ran into weird 'energy' scenarios that threw things off. Particularly when it came to making 'serious money' .. even the most zen mofos can be wonky if enough money's on the line.   \n\n\nthank you for this comment i appreciate you!!",
                    "score": 1,
                    "author": "eattheinternet",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You got it my man.\n\non the open-minded conversations and finding the right kind of mentor I just have one last thing to say.\n\nyou'll eventually run into some very smart and believable but extremely rude people.\n\ngetting feedback from them will feel like eating a very spicy pepper for the first time, a bitch slap in the face.\n\nobviously smart thing to do is ease yourself into it, but just like spicy food, it's actually not doing any real damage to your body. Very little chance of death.\n\nIt's all in your head :)",
                            "score": 1,
                            "author": "pxrage"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is exactly what I did for many years. I kept it all to myself except a good buddy of mine, I always discussed business with. Now I started to share to more people around me what I’m working on. It motivates me a lot and some interesting conversations can happen.",
            "score": 1,
            "author": "NotADreamButAPlan",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;This is exactly what I did for many years. \n\ndid you start yet or are you still talking about it? 'not a dream but a plan' your username suggests you're still stalling ('planning')   \n\n\nI'm not tryna be an ass, but I understand it feels good to tell people about the idea now... there's science behind it. Look up \"the illusion of progress effect\".  (ChatGPT: \"It refers to the psychological phenomenon where individuals perceive themselves as making progress towards a goal when, in reality, they have only taken small or superficial steps.\")  \n\n\nAlso by telling them it now has potential to effect you energetically (not saying it will just saying you added extra energies to it while its in its most fragile state which can cause potential unnecessary stress). But you do you, good luck!!",
                    "score": 1,
                    "author": "eattheinternet"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I personally ran into this with our company recently when we expanded into a second niche. \n\nWe hid the growth of our first company from everyone including our children until this year. \n\nWe expanded late last year into a secondary niche that's much larger than our primary and it's very saturated with competitors and established manufacturers. We have a war chest of Capitol built up and we control most of the North American market for our primary niche so we have a customer base that we can upsell to with a new product line. Many of our customers are the reason we chose to pivot and bring out the second niche because of the strong demand.\n\nEven with decades of experience in building business and running businesses and being the head of sales of all the efforts I overestimated the timelines.\n\nManufacturing, research and development, and testing took four or five months longer than we expected. We received the shipment in November when we were supposed to receive it months earlier. That's slammed us into Christmas time and end of year inventory concerns for customers. Nobody wants to pay taxes on stuff sitting on a shelf if they don't have to. The next thing was getting the information out to our established customer base while simultaneously breaking into an entirely new market. With the established customer base we had to fit into the buying timelines because a lot of our customers already had product on shelf when we show up, then you have to keep them aware of you until the next buying cycle so if they pull the trigger with you and not go back to their usual supplier.\n\nAll this leads to us discussing with excitement the new niche with friends and family. Now at least once a month I get calls or questions saying hey did you guys break a million dollars yet??? We have not we are in the five figure range but it's growing steadily. People automatically assume it's going to fail because our other side of the business is doing so well. This leads to lots of unwanted advice and criticism. The good news is I have very tough skin.\n\nNext time I'll keep it to myself until we hit numbers that are undeniable like we did with the first niche. Even then people still think you're crazy or you got lucky or something I don't know.",
            "score": 1,
            "author": "FatherOften"
        },
        {
            "level": 0,
            "comment": "I needed this 4 years ago.\nThank you, TYLSE.",
            "score": 1,
            "author": "FireTriad"
        },
        {
            "level": 0,
            "comment": "I’m building a project and haven’t told many about it - trying to make collecting payments easier; kind of a Bitly for payments - https://tur.bo",
            "score": 1,
            "author": "monkey6"
        },
        {
            "level": 0,
            "comment": "Having been through some big project developments this strikes me as true but with some qualifications.  \n\nFirst, it is really important to be able to communicate what you are doing when it does matter.  Because of this it is really valuable to make drafts of business plans, investor pitches, and promotions for potential customers.  This might all end up being completely unused, but going through the motions can help to sort things out and draw lines to guide development.  \n\nSecond, it is almost impossible to judge how people will react and there are almost alternative terms, metrics, and framing that may be valuable to incorporate into development.  What sometimes works is to occasionally tell some people you don't know well about some element of the whole plan.  Don't try to get the whole thing across, and don't go far to recruiting.  Ideally this should be someone who will not be interested in following up and will not relate to what you are doing in the same way you and people close to you do.  This can really help to judge if there is value in what is being developed and where that value is and what gives it traction.",
            "score": 1,
            "author": "m0llusk"
        },
        {
            "level": 0,
            "comment": "Is this just in reference to friends and family? If you're not talking to your potential customers and validating your idea before you start building it, you're probably gonna have a bad time.",
            "score": 1,
            "author": "RevolutionaryYou885"
        },
        {
            "level": 0,
            "comment": "idk abt all the evil eye and all that stuff but this shit is so fucking facts. once i just did and didn’t say it actually resulted in something",
            "score": 1,
            "author": "No-Entertainer3645"
        },
        {
            "level": 0,
            "comment": "I’m into the same woo as you and I kind of agree. It’s just hard because I want to share and talk about things with my friends. But I know I shouldn’t. The only people I should tell my business plans to are my employees. I get what you’re saying though for sure. I think Joseph Murphy and Neville have talked about this too.",
            "score": 1,
            "author": "SunglassesBright"
        },
        {
            "level": 0,
            "comment": "I come here for the weekly adderall fueled text raids and never disappoints",
            "score": 1,
            "author": "havegravity"
        },
        {
            "level": 0,
            "comment": "&gt; \"DONT TELL PEOPLE WHAT YOU'RE DOING\"... \n\nErm... communication led to branching out for my very successful business.\n\nWhat you *think* works could be just specific to you. Not sure why you're telling people how to behave when there's numerous ways to build a successful project or run a successful business.\n\nTelling and communication I'd say is very important. It generates feedback and confirms if there is a market appetite, something that could otherwise cost you a lot of money and time down a wrong path.",
            "score": 1,
            "author": "masterflex11"
        },
        {
            "level": 0,
            "comment": "This is interesting. I have a differentiated approach. \n\nI tell people who are supposed to help me about the vision to motivate them. \n\nPeople who should contribute valuable expertise I tell about certain details, but not about the whole plan...\n\nPeople who can't or don't want to contribute anything, I don't tell them anything.\n\nYes and of course, i collect a lot of feedback from stake holders, potential customers, strangers,...but i dont have to tell them everything...",
            "score": 1,
            "author": "Dr_Greenthumb85"
        },
        {
            "level": 0,
            "comment": "I take multiple calls per year from people that have invested thousands of hours, and dollars, for me to ask a handful of questions and them to fold. “Oh, we never thought of that” Some of these revelations are so serious that they have to fold the business. \n\nThinking you have a great idea, and knowing you have a great idea, are very different and you can only find out the latter by talking about it.",
            "score": 1,
            "author": "djaxial"
        },
        {
            "level": 0,
            "comment": "It’s a strange take to not want input (good and bad) from other people.\n\nPeople’s opinions are solid gold. They are better than marketing because they actually want to tell you what they think.\n\nBut you do you.",
            "score": 1,
            "author": "more_beans_mrtaggart"
        },
        {
            "level": 0,
            "comment": "Agreed..I don't tell others  what  I'm going to do ... I let them witness me doing it",
            "score": 1,
            "author": "ItsMwen"
        },
        {
            "level": 0,
            "comment": "r/titlegore",
            "score": 1,
            "author": "moutonbleu"
        },
        {
            "level": 0,
            "comment": "Yeah i think this is great advice universally. I’ve tried everything to make money whether it be NFT’s, drop-shipping, Amazon FBA, and everything in between. I was vocal about these and I failed at most of them. When I started wholesaling real estate I kept quiet about it. When I closed my first deal and collected the assignment fee, that was when I became vocal. It’s much easier and a lot less pressure when working in silence and letting success be the noise.",
            "score": 1,
            "author": "Certain_Physics_236"
        },
        {
            "level": 0,
            "comment": "I've got a Uber-like, globally scalable idea and I always have people asking me what it is. Lol. I give them a rough idea and then they want to know more. I then ask them if they want to invest, have they ever been an early stage investor, what companies have they invested in? \n\nUsually, asking simple investment questions, and company forming, structural questions scare them off once they realize the project is not another online hot dog stand \n\nI've yet to meet a potential CTO with bona fides that check out, that is honestly wanting to be a serious partner, with the financial connections to float it until the launch date, when it starts bringing in money on Day One.\n\nI'm clueless about coding, but have 20 years as international marketing manager, national sales manager, etc.\n\nMy close friends and relatives all think I'm crazy for not having this be a real thing as yet.",
            "score": 1,
            "author": "Free-Isopod-4788"
        },
        {
            "level": 0,
            "comment": "&gt;they become your unofficial boss. Every time you see them, they'll ask about the progress, and trust me, every business or project has its ups and downs. It’s not gonna be all sunshine and rainbows the whole time. You don't need the added pressure of reporting to someone.\n\nspeaking as someone with ADHD, yes, yes I do need that added pressure. In general, the difference between a project of mine that goes somewhere, and one that doesn't is outside social accountability.",
            "score": 1,
            "author": "glenlassan"
        },
        {
            "level": 0,
            "comment": "There is an important caveat to this advice. \n\nIf the people you are talking to fit your target audience profile, then those are precisely the people you should tell about your ideas to determine if you should even build it. \n\nIf it’s your buddy you play pickleball with once a week, maybe not worth it since it could kill the early energy around an idea.",
            "score": 1,
            "author": "tchock23"
        },
        {
            "level": 0,
            "comment": "Seems like more people disagree. But I agree. Keeping everything secret helps me a little bit from a psychologic perspective. I even don't talk about new projects with my family. I'm a lonely wolf programer entrepreneur for like 10 Years. Maybe thats the reason. But it just works very well.",
            "score": 1,
            "author": "Haftos"
        },
        {
            "level": 0,
            "comment": "Telling others you think makes them your unofficial boss, but can also be seen as now you have some else hold you accountable. Extra drive",
            "score": 1,
            "author": "baller2k89"
        },
        {
            "level": 0,
            "comment": "You explained that SO well - really resonates with me. Now I now why I feel weird telling people things. I need to develop a trusted network of biz advisors to run ideas past so that I’m carrying myself off into fairyland with my ideas",
            "score": 1,
            "author": "Ace-Dear-606"
        },
        {
            "level": 0,
            "comment": "Is this whole post woo woo?",
            "score": 1,
            "author": "moves2fast"
        },
        {
            "level": 0,
            "comment": "Asking for help is underrated. Would not have gotten advice, funding, and some valuable connections had I not told people. It's about telling the right people.",
            "score": 1,
            "author": "Shotime44"
        },
        {
            "level": 0,
            "comment": "This whole sub is like a MLM scheme. Shame that's what entrepreneurship has become.",
            "score": 1,
            "author": "FearlessDamage1896"
        },
        {
            "level": 0,
            "comment": "Great post dude, amazingly put.",
            "score": 1,
            "author": "Buunnyyy"
        },
        {
            "level": 0,
            "comment": "I wish I heard this years ago. I wish I had even better discipline now. I feel this.",
            "score": 1,
            "author": "derekYeeter2go"
        },
        {
            "level": 0,
            "comment": "\"unofficial boss\"? What kind of people do you hang with OP? Seems a bit extreme. Who cares what people ask about. No, they don't get to be your unofficial boss. They don't really care either way if you've made progress of a new project or not, they probably just want to hang with you regardless. That's fine.",
            "score": 1,
            "author": "goosetavo2013"
        },
        {
            "level": 0,
            "comment": "Not telling anyone about your ideas or projects is how you end up sinking hundreds of thousands of dollars into a failing, bad idea. You need fresh perspectives",
            "score": 1,
            "author": "SaskyBoi"
        },
        {
            "level": 0,
            "comment": "Snakes, haters EVERYWHERE!!",
            "score": 1,
            "author": "Id_Solomon"
        },
        {
            "level": 0,
            "comment": "I am passionate about sharing my projects with others as I truly appreciate the immense value of their views and opinions. Their unique perspectives often shed light on aspects that I may not have considered, enriching my understanding in ways I might not have otherwise discovered.",
            "score": 1,
            "author": "Orchidivy"
        },
        {
            "level": 0,
            "comment": "I guess everyone works differently. There are things I share and things I don't. For some projects I don't want anyone to know,for others I do. \n\nLike if I want people to leave me alone about something I'll tell them I'm busy doing XYZ. They leave me alone. \n\nSometimes people know things I don't know, so I bring it up. I might find out new information about something. \n\nOther times I don't want people to shit on my ideas so I don't share it. Maybe the person I'm talking to is the type to get jealous, so I don't say anything. Or I'll know they'll be disinterested, or not believe in me.\n\nJust depends.",
            "score": 1,
            "author": "JediWebSurf"
        },
        {
            "level": 0,
            "comment": "Totally agree with this. And it's actually a thing that has been known for a long time. I remember reading a machine shop book from like the 1880s that was filled with a bunch of professional advice for young men entering the machining trade. One of the things that it said was \n\n\"The key to any successful enterprise is to just do a thing, don't talk about it.\"",
            "score": 1,
            "author": "techgeek6061"
        },
        {
            "level": 0,
            "comment": "Hey folks, just wanted to offer a different spin. Chatting about your idea, your dream project, can actually do wonders.\n\nFirst off, sharing = feedback, and that's gold. Keeping your ideas to yourself might just keep them from reaching their full potential. Yeah, criticism can sting, but it also sharpens.\n\nAnd let's be real - telling people about your project isn't just about validation. It's about getting pumped, staying committed, and maybe, just maybe, getting some like-minded folks on board. \n\nHeard about the thrill of telling your plans tricking your brain into feeling you've achieved something? Fair point. But we're smarter than that, right? It's about striking that balance - talking the talk AND walking the walk.\n\nNegative reactions? Bring it on! They're your reality check, and sometimes, your best motivator. As for the 'evil eye' - can't stop people from feeling certain ways, but you sure can choose how you react.\n\nSo here's my two cents - don’t just shut up and grind. Your ideas are worth sharing, worth shaping. You might even strike gold in the most unexpected conversations. So take the plunge, and who knows, you might not just make a ripple but a wave.",
            "score": 1,
            "author": "hypotheticallywoke"
        },
        {
            "level": 0,
            "comment": "I always say I’m toying with things but never say when I’m going to release something until it’s complete or near completion. \n\nIf you have to use it as a way to be accountable then I’d rethink what motivates you in the first place",
            "score": 1,
            "author": "Ikeeki"
        },
        {
            "level": 0,
            "comment": "Remember everyone: your first customer is going to steal your business and the only way to solve this is to have no customers.",
            "score": 1,
            "author": "Twice_Knightley"
        },
        {
            "level": 0,
            "comment": "You know what ,  a friend mentioned this to me . He is  a chemical engineer and he was getting frustrated  with his job hunting. \n\nHe said he felt that when he tells people where was applying he didn't seem to get the job ... Its like some jinx or something.\n\nI do believe in energy and all that. When I was teaching one-on-one classes , the moment I step in the room, I knew right away that me and the other person would have a loong 45 minutes together. Some people just suck your energy.",
            "score": 1,
            "author": "ikalwewe"
        },
        {
            "level": 0,
            "comment": "the biggest opportunity that i’ve gotten in my current business was as a result of me blabbering about it to some friends, someone connected me with someone more prominent in the field, and recently, we’ve been collaborating, which has the potential to really jumpstart my business",
            "score": 1,
            "author": "immickle"
        },
        {
            "level": 0,
            "comment": "I don't agree with that because everyone's business model can be different and yet the same product or service, it's competition. you're gonna feel good when you launch your idea your way no matter who knows about it and you'll have that good feeling you're talking about. and just cause they know doesn't mean that they could do it too!",
            "score": 1,
            "author": "Makeuplady6506"
        },
        {
            "level": 0,
            "comment": "The good thing about telling people about your project is it can keep you motivated (for fear of being seen as a failure or procrastination).. if you can stay motivated without external forces, then absolutely tell no one about your project, until it’s finished and live.",
            "score": 1,
            "author": "NapLvr"
        },
        {
            "level": 0,
            "comment": "I guess none of these people disagreeing with you have ever heard of Facebook. \n\n200 billion reasons why you should never tell people what you're working on until its ready.",
            "score": 1,
            "author": "VandalezIndustries"
        },
        {
            "level": 0,
            "comment": "Fantastic post and completely agree. Keep it zipped.",
            "score": 1,
            "author": "CreateorWither"
        },
        {
            "level": 0,
            "comment": "I agree",
            "score": 1,
            "author": "Ok_Sir4235"
        },
        {
            "level": 0,
            "comment": "My advice, for what it’s worth. STFU and get on with it! If you get on with it, then your “trusted friends” will know your beavering away. “Other friends” don’t care anyhow",
            "score": 1,
            "author": "Rich-Rhubarb6410"
        },
        {
            "level": 0,
            "comment": "In my experience the world is a mirror, and people will mirror your energy, if you’re really fired up about your project and your cause with the right words you can instill that light in others, but negative breads negativity, the trick is just making sure people don’t steal it if it’s an invention, so you should have contracts and legalities in place to protect you, and then move freely light as a feather, tell the world, meet people, establish relationships, travel and network, even things that don’t help your cause, just do them, like offering to help someone else or getting involved in the community, it all comes back and helps the manifestation of your dream, as a ceo you must learn how to execute the will of the company properly.\n\nyou’re supposed to be a leader, and inspire others, yes there is some information you hold back, but if you walk around holding everything back afraid of a glare or disapproval of others you will never succeed in business. As the CEO the company sits above you, literally bigger then yourself, you have a mission to the company, not to yourself, shame and judgment are worries of people who have not realized their goal, purpose and way, as soon as you get on Tv or public speaking a majority of people online will say terrible things about you, the lost mass majority, that is the way of the world, but to win in business you must be light as a feather and let it pass through you, you can have no ego, and there is no right and wrong (except don’t break the law) just execute the will of the company, but if you put negative out, you will have so many obstacles and roadblocks, success comes from community and help from those higher then yourselves, grants and investments,\n\nIf you lead your business in that way I am sorry to say that it will fail, and not because of the product or the tech, but because the ceo is so afraid of being looked down at he would rather hide his company away in fear of shame",
            "score": 1,
            "author": "DrDragon118"
        },
        {
            "level": 0,
            "comment": "In terms of social media, most people fall in love with watching you grow. Following your moves and seeing your hurdles. It really depends on which platform you are using.",
            "score": 1,
            "author": "trillnoel"
        },
        {
            "level": 0,
            "comment": "I think it’s more of a personal problem. I personally find myself telling friends and family about sporadic ideas I’ve had in excitement, and don’t think that’s necessarily good for the mental not following through on things you put out there - which have a different impact on the mental in retrospect than thoughts you have. I blame myself though, and try to just talk about things I’m serious in pursuing. Love/need their input.",
            "score": 1,
            "author": "This_Cardiologist242"
        },
        {
            "level": 0,
            "comment": "I guess everyones different. I used to be like that where I'd eventually overthink when things don't go according to plan, and the shame you feel when they ask \"Hows that thing going?\" but I've learned to be thick skinned, and just take negative reactions on the chin because telling people my plan keeps me from procrastinating, or when I'm feeling really down I remind myself not to let those people down. It keeps some type of accountability on my level of productivity.",
            "score": 1,
            "author": "DasDa1Bro"
        },
        {
            "level": 0,
            "comment": "I heard once that that when you tell people all about your goals/plans/dreams you are in some way rewarding yourself mentally before getting any work done which is why you fail at that goal/plan/dream.",
            "score": 1,
            "author": "snatcheternal"
        },
        {
            "level": 0,
            "comment": "I see where you are coming from. You could see it as a phase of going through. In programming the 'desert of despair ' Just go on. Manage your money, time and relationships you value. It is a tremendous learning experience. \n\nWe also have different kinds of entrepreneurs. The energetic, extrovert types etc. I myself am way more introverted.  I stopped telling people. I just say the name of my company or I am working on Pinata's.\n\nI believe, I do not come from an entrepreneurial background, that others must relate to their reality. Most people do not succeed or work jobs. So they make an estimate, a calculated guess and do not know how much effort it takes \n\nSo build something you are passionate about and tweak it, so it will survive inception. It is only wasted money if you burn easily through cash. Hobbies, useless products, you don't need, courses that do nothing all cost money. You don't need justification to spend reasonable money on your business idea.\n\nI also learned two things. Competitors can be defeated by their minds. Dumb people can have an advantage, because they just jump and do.  Tell people and don't care about what others say. We can learn from all kinds of people.\n\nIf you tell people you have to manage expectations, unless you found Investors, hired people, and with great debt imitate Silicon Valley. Those are the most visible and narrated stories.\n\nWe are so accustomed to the fact that entrepreneurs should ask others, make others enthusiastic about their products. Why should that be the case? It is I think a lazy consumerist mindset. A mindset that corrupted a lot of things Where is the small token of saying can I do something small for you? Fungus doesn't ask the tree to make sugar for it! It simply does and the tree makes good use of it.\n\nI also noticed that people get uncomfortable sometimes. It is the way they ask about prices. Telling people about your people, also tells you much about people.",
            "score": 1,
            "author": "Mesmoiron"
        },
        {
            "level": 0,
            "comment": "This is big time. Also I read somewhere that you get the same dopamine release telling someone about your project versus actually getting said project done.",
            "score": 1,
            "author": "Hero90"
        },
        {
            "level": 0,
            "comment": "Have you ever considered that for some people the opposite may be true? And that by telling people it helps both get early feedback and keeps you accountable?",
            "score": 1,
            "author": "jpswade"
        },
        {
            "level": 0,
            "comment": "I'm also come to the same conclusions. Do not need to tell anyone till you accomplish something. Otherwise you could quickly lose motivation. Do first tell later.",
            "score": 1,
            "author": "istinspring"
        },
        {
            "level": 0,
            "comment": "This entire thread was super helpful. Thanks all.",
            "score": 1,
            "author": "karinalightyear"
        },
        {
            "level": 0,
            "comment": "I value your insight; there's certainly wisdom in avoiding unnecessary pressure or feeling obligated to report on one's progress.  \nHowever, I've experienced a situation where sharing my ambitions was immensely beneficial. Some years ago, I conceived an idea for a new business. Initially, I was leaning towards the strategy you described, preparing to maintain discretion and work in solitude.  \nUnexpectedly, during a party with a previous client, I found myself discussing my idea. He expressed interest in collaborating and brought invaluable skills and connections to the table. Today, we are co-founders of a successful company.",
            "score": 1,
            "author": "xtogro"
        },
        {
            "level": 0,
            "comment": "In my experience, people don't always react well to the good news about yourself if you're an entrepreneurial type of person (aka everyone here). Best to keep your successes to yourself and project your losses. Everyone can relate to a bad day, but not everyone can relate to you achieving your dreams.",
            "score": 1,
            "author": "the_dubert"
        },
        {
            "level": 0,
            "comment": "OP must be the anti elon musk. Don’t tell people than show it when we least expect it.",
            "score": 1,
            "author": "jeaxz74"
        },
        {
            "level": 0,
            "comment": "Yea telling people about your projects is like the first rule in validating your idea, people will give you a perspective you never could come up with on your own, I tell anyone who will listen about my ideas",
            "score": 1,
            "author": "leafynospleens"
        },
        {
            "level": 0,
            "comment": "I don't usually agree with statements like this, but I have to admit, this resonates with me somehow. I also think many people in the comments are not understanding what you are saying. \n\nThis is about not telling anyone your plans. Once you're up and running, I think it should be fine. But in my experience, every time I'm working on a project, I can't shut up about it, because I'm so excited. Then it ends up in. nothing.\n\nI am now not talking about it. Yes, my best friend knows I'm starting a business in X industry, but that's about it. I have a better feeling now. And yes, I know it sounds stupid.",
            "score": 1,
            "author": "natastically"
        },
        {
            "level": 0,
            "comment": "Op: don't tell anyone about your projects\n\nLe Sundar pichai and Mark zuckerberg: 🥱",
            "score": 1,
            "author": "Minion_77"
        },
        {
            "level": 0,
            "comment": "I feel like I need to drop hints to my family....  I kind of speak of it as my \"project\" when I bring it up.  This helps let them know why I'm so busy all the time between my main job and my \"project\".\n\nPast that I try to limit them on how much I tell them about my \"project\" because I don't need unrooted opinions... It may not be a product they even think they need or quite simply don't know they need yet, haha",
            "score": 1,
            "author": "Wise_Cut_2543"
        },
        {
            "level": 0,
            "comment": "I honestly have to agree with you here. The whole building public thing has always seemed weird to me. I am almost positive. It is just some stupid catchphrase that big tech or some asshole at next.js or vercel I used to get everyone to build in public and steal ideas and code. If you’re building in public, you’re working for free.\n\nThat’s why I host my own gitlab server, and I never talk about or build my projects in public.",
            "score": 1,
            "author": "Dr-McDaddy"
        },
        {
            "level": 0,
            "comment": "I really don’t think this matters as much as work ethic which comes from being passionate about your project. Everything else and everyone else is irrelevant at worst and hopefully resources at best.",
            "score": 1,
            "author": "darthcrossbowman"
        },
        {
            "level": 0,
            "comment": "I absolutely agree with you 100% I don't even tell my family what I'm currently running.",
            "score": 1,
            "author": "Darkwolf099"
        },
        {
            "level": 0,
            "comment": "I am in total agreement.  It's not worth being hyped up about something that isn't manifested.",
            "score": 1,
            "author": "One_Maintenance2451"
        },
        {
            "level": 0,
            "comment": "So you're telling me some big entrepreneur like Elon Musk &amp; Jeff Bezos STFU himself and built 2-3 massive company all by himself?\n\ndelusion, that's where you living in.",
            "score": 1,
            "author": "ComfortableCurrent65"
        },
        {
            "level": 0,
            "comment": "Learned this the hard way- tell people once you're already in the testing phase imo",
            "score": 1,
            "author": "CrispyOwl717"
        },
        {
            "level": 0,
            "comment": "Quite frankly if you can't handle criticism, you can't run a successful business. The times to not tell are few and far between. Chances are what you thought of is already being made or has been made - you just weren't aware or lacked in research. Getting feedback is a great way to improve a thing - I BEG for feedback and sometimes pay just to have it. Then there's the final thing: people. Without the right people, your project will almost certainly fail. Make sure you tell the right people, and don't expect someone making a living off you to jeopardize that for your well-being.",
            "score": 1,
            "author": "profile_this"
        },
        {
            "level": 0,
            "comment": "Yup. Talking about something gives the same feeling as actually doing it. Hugely motivation sapping.",
            "score": 1,
            "author": "ugohome"
        },
        {
            "level": 0,
            "comment": "I can’t believe how much I relate to this. Every time I tell some one this they look at me like I’m nuts.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "This advice is what makes all the business subs terrible for those asking for advice. Tell your story, share your business, expect competition, be grateful strangers might want to help you succeed.",
            "score": 1,
            "author": "LowSkyOrbit"
        },
        {
            "level": 0,
            "comment": "I like telling people about my idea.. sometimes I’ll get a really good suggestion that I haven’t thought about.\n\nAnd if they have positive or negative reactions, they have no baring on the outcome of my work. You make your own luck through hard work and dedication. Forget what other people think and focus on having fun and working towards your goals.\n\nWhat’s kept me accountable towards my overall vision are SMART goals… they’ll literally manifest you to success lol",
            "score": 1,
            "author": "TorontoCpl11"
        },
        {
            "level": 0,
            "comment": "It’s a double edged sword telling people your plans before you’ve made any headway into them. I think it makes sense to show them your progress but always downplay the idea until it’s proved to be viable. However once this happens your passion needs to be there as it’s positively infectious! Good luck.",
            "score": 1,
            "author": "Foresight12345"
        },
        {
            "level": 0,
            "comment": "I think preserving project confidentiality ensures security and prevents unauthorized access.",
            "score": 1,
            "author": "Muhammad_Hamza1"
        },
        {
            "level": 0,
            "comment": "I completely agree with you! Keeping your projects under wraps allows you to maintain your own energy and focus on making things happen without unnecessary external pressures.",
            "score": 1,
            "author": "Shift_Inside"
        },
        {
            "level": 0,
            "comment": "I've learned this the hard way. When I shared my project with someone, their constant questions and expectations added unnecessary stress. Now, I prefer to surprise people with the finished product.",
            "score": 1,
            "author": "Slangilyundress535"
        },
        {
            "level": 0,
            "comment": "It's interesting how talking about our plans can sometimes give us a false sense of accomplishment. I've found that keeping things to myself helps me stay grounded and focused on the actual work",
            "score": 1,
            "author": "Amissindent"
        },
        {
            "level": 0,
            "comment": "I've had experiences where people's negative reactions dampened my enthusiasm for a project. It's disheartening when someone you care about doesn't share the same excitement. Keeping it to yourself avoids those disappointing moments.",
            "score": 1,
            "author": "Alongattach"
        },
        {
            "level": 0,
            "comment": "I understand the concept of the evil eye, and while it might be a superstition, I believe there is some truth to the negative energy that can arise when others see you doing well. Protecting your project until it gains momentum is a wise approach.",
            "score": 1,
            "author": "TacitlyDeflate"
        },
        {
            "level": 0,
            "comment": "I've found that sharing my plans with only a select few who genuinely support and uplift me is the best approach. They become my trusted circle who I can rely on for feedback and encouragement without the negative influences.",
            "score": 1,
            "author": "dippedStooper"
        },
        {
            "level": 0,
            "comment": "The element of surprise is so powerful. When you reveal your accomplishments without prior hype, it feels incredible. You're not seeking validation; you're simply showcasing your hard work and dedication.",
            "score": 1,
            "author": "stormilydefray"
        },
        {
            "level": 0,
            "comment": "I've adopted a similar approach, and it has helped me stay motivated. By focusing on my own emotional state and caring about how I feel, I'm able to channel my energy into making things happen instead of seeking external validation",
            "score": 1,
            "author": "solidlyAdvance714"
        },
        {
            "level": 0,
            "comment": "It's true that ideas are abundant, and sharing them prematurely can sometimes deflate the initial excitement. By keeping things to myself, I'm able to preserve that sense of excitement and use it to drive me forward",
            "score": 1,
            "author": "sweetlyqualify800"
        },
        {
            "level": 0,
            "comment": "I've found that external influences can often cloud my judgment and derail my progress. Keeping my plans to myself allows me to stay true to my own vision without getting swayed by others' opinions or doubts.",
            "score": 1,
            "author": "meanlytune81"
        },
        {
            "level": 0,
            "comment": "Surprising people with your accomplishments is such a rewarding feeling. It's a testament to your dedication and hard work. Keeping your projects to yourself adds an element of mystery and excitement to the process.",
            "score": 1,
            "author": "equallyClean412"
        },
        {
            "level": 0,
            "comment": "I've experienced the pressure of having someone act as an unofficial boss after sharing my plans. It can be overwhelming and distracting. Keeping things under wraps allows me to maintain control and work at my own pace.",
            "score": 1,
            "author": "ConAbsorb"
        },
        {
            "level": 0,
            "comment": "Not everyone understands the creative process or the journey of bringing something to life. By keeping your plans to yourself, you protect your energy and avoid unnecessary judgment or skepticism.",
            "score": 1,
            "author": "roundwhiff"
        },
        {
            "level": 0,
            "comment": "I've found that talking about my projects before they're fully formed can invite unwanted opinions and doubts. It's better to wait until you have something substantial to show before sharing it with others.",
            "score": 1,
            "author": "thinhttg88"
        },
        {
            "level": 0,
            "comment": "There's a certain power in keeping your plans private. It allows you to work on them without external expectations and allows you to surprise others with your achievements when the time is right.",
            "score": 1,
            "author": "Zenithalirenidae"
        },
        {
            "level": 0,
            "comment": "I believe that self-belief is crucial for success. By focusing on your own emotional state and staying true to your vision, you build the confidence needed to make things happen, regardless of external validation.",
            "score": 1,
            "author": "VoidBolster737"
        },
        {
            "level": 0,
            "comment": "I've learned that not everyone will understand or support your dreams. Keeping your plans to yourself protects your enthusiasm and shields you from negative influences.",
            "score": 1,
            "author": "Livelonggrammar15"
        },
        {
            "level": 0,
            "comment": "I've seen the difference in my productivity and motivation when I keep my projects to myself. It's liberating to work on something without the pressure of others' expectations or judgments.",
            "score": 1,
            "author": "ZigzagHabit202"
        },
        {
            "level": 0,
            "comment": "Being selective about who you share your plans with is essential. Having a trusted circle who genuinely supports and uplifts you can provide the encouragement you need without the negative energy",
            "score": 1,
            "author": "uphilltittup23"
        },
        {
            "level": 0,
            "comment": "The journey of bringing something to life should be focused on your own fulfillment and passion. Seeking validation from others can distract you from the true essence of your project. Keep it to yourself and let your accomplishments speak for themselves.",
            "score": 1,
            "author": "Coequalraveling"
        },
        {
            "level": 0,
            "comment": "I don't think there's nothing wrong with the first scenario of you telling someone. \n\nI think it's not great if you're the type to not do what you say. But if you're committed nd actually invest in it, it would be enjoyable to me to be asked about my progress",
            "score": 1,
            "author": "pan_rock"
        },
        {
            "level": 0,
            "comment": "Why set up a business and then hide it from the world?\n\nUnless you have a super pantable IP or the person you are talking to is in direct competition, what do you have to lose by talking about it?\n\nThe person you speak to may give you negative feedback but that is often better than positive feedback. Positive feedback is freely given and people will give positive feedback so as not to offend. Negative feedback tends to be more genuine and should be used to fix your product or service.\n\nThose that are genuinely positive could take your products to the right people and present you with partnerships and help you would never normally be able to find.\n\nEven if they have little interest in your product or service, you never know when one of their contacts will need your services or product. That uninterested person now becomes your salesperson by forwarding your details.\n\nI genuinely don't see any benefit in keeping things secret",
            "score": 1,
            "author": "SickPuppy01"
        }
    ]
}