{
    "id": "148ftrs",
    "score": 280,
    "title": "5 Habits to go from Founder to CEO",
    "author": "Falahil",
    "date": 1686663899.0,
    "url": "https://www.reddit.com/r/Entrepreneur/comments/148ftrs",
    "media_urls": [],
    "other_urls": [],
    "postText": "Over the years, I've gathered some knowledge about transitioning from a startup founder to a CEO. I started my company 7 years ago. We are now not super big (65 people), but we have learned a lot. We raised $19M in total and we are now profitable.\n\nThe transition from Founder to CEO was crucial. Your startup begins to mature and scale and you need to scale with it. It's often a challenging phase, but I've managed to summarize it into five habbits.\n\n**1. Say no to important things every day**\n\nBeing able to say \"no\" to important tasks every day is an essential practice for a growing leader. It's a reality that as the magnitude of your company or ideas expands, so does the influx of good ideas and opportunities. However, to transform from a mere hustler to a true leader, you have to become selective. This means learning to refuse good ideas, which is crucial if you want to consistently execute the outstanding ones.\n\nThe concept that \"Startups don't starve, they drown\" resonates deeply because it underlines how challenging it can be to reject opportunities.\n\nA key strategy to develop this skill is time-constraining your to-do list. Here's how you can do it:\n\n* Weekly: Formulate a weekly to-do list, including only those tasks that you're sure to complete within the week. Leave some buffer room for unexpected issues. If there's any doubt about whether you'll have time for a certain task, it should not feature on your weekly list. I use **Todoist** and **Notion** for task management.\n* Daily: Apply the same rule while creating your daily to-do list. Only include tasks that you're confident about accomplishing that day. If a task seems too big to fit into one day, break it down into manageable chunks.\n\n**2. Journaling**\n\nJournaling is a powerful strategy that can help an individual transition from a reactive approach to a proactive one. As founders, we often find ourselves caught up in a cycle of endless tasks, akin to chopping trees in a dense forest. However, to ensure sustainable growth, it is crucial to develop an ability to \"zoom out\", or to view the bigger picture.\n\nI use The Morning Pages method, from Julia Cameron. It consists of writing each morning about anything that comes to mind. The act of writing effectively combines linear, focused thinking with the benefits of a thoughtful conversation. If you just want to journal, you can use **Day One app** (The free version will be enough)**.** If you want to go a bit deeper, you can try **a coaching app**. I use **Wave.ai** and I also hired it for the managers in the company because it combines both journaling with habit building. \n\n&amp;#x200B;\n\n**3. Building Robust Systems and Processes (I know, it is boring and founders hate this)**\n\nAs a founder, you often need to wear multiple hats and juggle various roles. But as a CEO, it's vital to establish strong systems and processes that enable the business to function smoothly, even without your direct involvement. This includes:\n\n* Implementing project management systems.\n* Establishing clear lines of communication and accountability.\n* Designing efficient workflows and procedures.\n\nTo many founders, developing these systems might seem monotonous or even tedious. After all, the allure of envisioning the next big idea often proves more exciting. I experienced the same predicament. In response, I brought onboard a competent COO who excelled in systematizing processes. This strategy allowed me to kickstart initiatives and explore them in a flexible, less structured manner. Once an idea showed signs of gaining traction, my COO stepped in to streamline it, crafting a process that turned the fledgling idea into a consistent business operation.\n\n&amp;#x200B;\n\n**4. Meditating**\n\nMeditation is about reprogramming unconscious mental processes by repeatedly performing fundamental tasks with a distinct intention. This practice can be even more crucial to leadership than acquiring a business school education. Because meditation provides the most direct route to understanding your mind's workings and thus, forms the most effective basis for transforming it.\n\nTo transition from a founder to a CEO, a significant shift in your mindset is required. This shift involves moving from a hustle mentality to precision, from acting as a superhero solving problems to consciously stepping back, thereby providing room for your team members to discover their own superpowers. It's about shifting your success indicators - from individual achievements to the triumphs of your team. This transformation might not feel comfortable initially, and your instincts, shaped by your scrappy founder phase, might resist this change.\n\nHowever, with consistent practice, you can align your instincts with the stage of your company, promoting more effective leadership. This is where the value of meditation truly shines. It allows you to identify your distinct thought patterns in real time and, over time, modify them.\n\nI use **Headspace** a lot, and I also encourage the employees to use it. The company pays the subscription as a perk.\n\n&amp;#x200B;\n\n**5. Balancing the Macro and the Micro**\n\nAs the CEO, your primary focus should be on the big picture – your company's vision and strategy. However, you also need to keep an eye on the details, as these can make or break your execution. It's all about balance:\n\n* Delegate the details but stay informed.\n* Prioritize strategic planning but be ready to dive into the trenches when needed.\n* Keep your eye on your long-term vision but adapt to short-term realities.\n\nThe transition from founder to CEO isn't about giving up what made you successful initially but augmenting it with additional skills, perspectives, and practices. It's a personal and professional evolution that can lead to greater success for both you and your business.\n\nEvery great CEO was once a founder. It's just about taking the next step.\n\nI’d love to hear your experiences or any tips you might have for this transition.\n\nIn which step of your journey are you right now? Do you have employees already? What are your main challenges right now?",
    "comments": [
        {
            "level": 0,
            "comment": "I always found the quite famous Enseinhower prioritization matrix very useful too!",
            "score": 18,
            "author": "BrilliantSome9326",
            "replies": [
                {
                    "level": 1,
                    "comment": "It was a game changer for me.",
                    "score": 5,
                    "author": "Falahil",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "💖",
                            "score": 1,
                            "author": "No-Mobile4713"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This sounds interesting - is it Ensein or Eisen?",
                    "score": 4,
                    "author": "beurremouche",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[Eisenhower](https://en.wikipedia.org/wiki/Time_management#The_Eisenhower_Method)",
                            "score": 5,
                            "author": "R53in808",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks 👍",
                                    "score": 2,
                                    "author": "beurremouche"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Just learnt a new thing, thanks.",
                    "score": 1,
                    "author": "PUMK1ng"
                }
            ]
        },
        {
            "level": 0,
            "comment": "How did you find your COO?",
            "score": 16,
            "author": "Omeet2",
            "replies": [
                {
                    "level": 1,
                    "comment": "I met her in an accelerator program, she was working for the accelerator and we convinced her to join the company. Find someone you trust and someone that is able to learn new skills super fast",
                    "score": 22,
                    "author": "Falahil",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How do you network with likeminded individuals? Do you suggest attending meetup groups? I'm trying to grow my network and I'm having trouble finding other passionate entrepreneurs, I know they exist but I'm not sure how to go about finding them locally.",
                            "score": 5,
                            "author": "Givemeallyourtacos",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If you have the chance to go through an accelerator program, I'll go! I started in one of those. \n\nAlso, there are some entrepreneur slack communities and meets that you could join",
                                    "score": 5,
                                    "author": "Falahil",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Info on Slack and Meets?",
                                            "score": 3,
                                            "author": "halpmeplz94"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "How did you pay her? I mean… I wish I had a COO but I don’t know how I could afford (we’re a 6 person team that needs to grow to 17 in the next 6 months)",
                            "score": 3,
                            "author": "Flowerburp",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "90K€ (in spain, it is very high tier)\n\n1% of the company vesting in 4 years",
                                    "score": 5,
                                    "author": "Falahil"
                                },
                                {
                                    "level": 3,
                                    "comment": "Yeah on the same boat, how much equity/salary do you give to a COO?",
                                    "score": 1,
                                    "author": "PregnantMale"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "What's an accelerator program?",
                            "score": 1,
                            "author": "wicker771",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Either the state or private Startup incubator runs an organisation that helps new startups grow. There are experts in different fields, usually long time entrepreneurs, that help you tune your business plans, help with bureaucracy stuff and use their conections to help you get moving.",
                                    "score": 1,
                                    "author": "Molehole"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m on year 3 of running my company. We’re trying to hit 8 figures in revenue this year, but I’m mentally exhausted. I spent the last 3 weeks of June being unproductive and there’s a certain guilt to that I can’t shake off, even as I tell myself it’s a well deserved break.",
            "score": 9,
            "author": "jassi3991",
            "replies": [
                {
                    "level": 1,
                    "comment": "you really need to take 2-3 weeks off. 100% out disconnected from the business. You will feel guilty for not being working 24/7 but you will be WAY more productive when you are back",
                    "score": 14,
                    "author": "Falahil"
                },
                {
                    "level": 1,
                    "comment": "What sort of company do you run?",
                    "score": 3,
                    "author": "GratefulForGarcia"
                },
                {
                    "level": 1,
                    "comment": "It's only June 13",
                    "score": 2,
                    "author": "Aliquot126",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Only? 13 days must not mean much to you.",
                            "score": -3,
                            "author": "jassi3991",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well there haven't been 3 weeks of June so far.  So not sure how you spent the last three weeks of June doing anything!  \n\n\nBut I understand when the usual is double shifts every day it seems like way more time...",
                                    "score": 3,
                                    "author": "Aliquot126"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I’m on the same boat. Guilt and sense that you should be doing more but not having the mental energy to focus. I’m doubting if this is transitory or if I should pursue an exit and move on.",
                    "score": 1,
                    "author": "RelativelyMental"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Saying \"no\" to important tasks is a tough but necessary skill for leaders. The struggle to turn down good opportunities is a real challenge. Well said!",
            "score": 7,
            "author": "AnumRizwan",
            "replies": [
                {
                    "level": 1,
                    "comment": "👍",
                    "score": 1,
                    "author": "No-Mobile4713"
                },
                {
                    "level": 1,
                    "comment": "💯",
                    "score": 1,
                    "author": "No-Mobile4713"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wow, thanks for dropping these nuggets! Your advice really hits the spot. Right now, I'm just starting out on my own entrepreneurial adventure. Scaling sounds exciting, but also challenging.",
            "score": 4,
            "author": "Angry_Raclette",
            "replies": [
                {
                    "level": 1,
                    "comment": "The beginnings are also the funniest part! Sometimes I miss that stage when everything is new every day and you test a new channel/feature/idea every week. Enjoy that part of the journey!",
                    "score": 6,
                    "author": "Falahil"
                }
            ]
        },
        {
            "level": 0,
            "comment": "These are great points, things have started to improve greatly once I started these. My only regret is not doing it like 1 year ago.\n\nI’m still struggling with the COO part though. I really want one, but i’m not big enough to even pay myself a decent salary.",
            "score": 3,
            "author": "Flowerburp",
            "replies": [
                {
                    "level": 1,
                    "comment": "Chief of staff is a potential alternative. Supercharged admin in some places and highly organized decision maker in others",
                    "score": 2,
                    "author": "Readdontheed"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Interesting, thanks for sharing. Any tips on hiring when you pass the 50-people mark, like how involved are you still, meeting every candidate or trusting some of your managers to make the final call?",
            "score": 2,
            "author": "Djoulzinho647",
            "replies": [
                {
                    "level": 1,
                    "comment": "That is a hard question. After 30 I was involved in all the hiring processes. From 30, I was only involved in late stage of the management layer or very specific profiles where I'm used more as a \"way to make the candidate fall in love\", rather than someone assessing the candidate or making the call.",
                    "score": 3,
                    "author": "Falahil"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Very instpiring",
            "score": 2,
            "author": "Fabiolous-88"
        },
        {
            "level": 0,
            "comment": "Great read, would love you over at r/fatbusiness",
            "score": 2,
            "author": "Frequent-Rice-8013",
            "replies": [
                {
                    "level": 1,
                    "comment": "Joined!",
                    "score": 2,
                    "author": "Falahil"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What is your revenue",
            "score": 2,
            "author": "Background-Singer73"
        },
        {
            "level": 0,
            "comment": "Wonderful post.\n\nEspecially point 3. A company with robust systems and processes is on strong foundations to grow. Being an operations guy, I can vouch for this.",
            "score": 2,
            "author": "dimbolo"
        },
        {
            "level": 0,
            "comment": "Too vague on the last one. Balance vision and tactics - okay how?",
            "score": 2,
            "author": "cryptocommie81"
        },
        {
            "level": 0,
            "comment": "As someone working in a small startup currently, I can definitely see some of these things in the overall business",
            "score": 2,
            "author": "8slider"
        },
        {
            "level": 0,
            "comment": "And always have a hooker and a coke dealer on your speed dial. Stress busters",
            "score": 3,
            "author": "nostril-pc"
        },
        {
            "level": 0,
            "comment": "nice read - thanks for sharing!",
            "score": 1,
            "author": "Spiritual_Option_428"
        },
        {
            "level": 0,
            "comment": "This is a great post. I've been using several of these techniques to stay on top. Habit improvements, meditation, journaling - all of these have great transformative benefits.",
            "score": 1,
            "author": "Alex_1729"
        },
        {
            "level": 0,
            "comment": "Very interesting analysis— how did your personal experiences vs observation of others’ influence the points you hit on?",
            "score": 1,
            "author": "bony_appleseed"
        },
        {
            "level": 0,
            "comment": "Just started my VA company and I'm feeling overwhelmed with ideas. I'll try to do this and see how it's going to work out for me, hoping for the best",
            "score": 1,
            "author": "Elite_VA"
        },
        {
            "level": 0,
            "comment": "Curious about what your company does.",
            "score": 1,
            "author": "Grave_Warden"
        },
        {
            "level": 0,
            "comment": "The journaling and habit-things things is soooo true - I can only agree with that. Saying no is important as well.",
            "score": 1,
            "author": "No_Quote_13090"
        },
        {
            "level": 0,
            "comment": "💖",
            "score": 1,
            "author": "No-Mobile4713"
        },
        {
            "level": 0,
            "comment": "Hello I am here 👋",
            "score": 1,
            "author": "No-Mobile4713"
        },
        {
            "level": 0,
            "comment": "Thanks for sharing mate. I think I needed this much. I'm gonna apply the all these learnings.\nAny books recommendations?",
            "score": 1,
            "author": "0xBeyah",
            "replies": [
                {
                    "level": 1,
                    "comment": "He quoted Julia Cameron, you can buy her books on Amazon",
                    "score": 2,
                    "author": "Ace-Dear-606"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m impressed that you found Julia Cameron helpful",
            "score": 1,
            "author": "Ace-Dear-606"
        },
        {
            "level": 0,
            "comment": "Great Read, This Gonna Help Me In My Journey\nFacing Many Hurdles But I Understand The Fact That Perfection Is Only Achieved By Facing Hurdles.\nThanks For The Amazing Tips.",
            "score": 1,
            "author": "RonyZ1320"
        },
        {
            "level": 0,
            "comment": "Sounds interesting but still it takes a lot of time for me to be a CEO",
            "score": 1,
            "author": "Ayesha_Sarwar"
        },
        {
            "level": 0,
            "comment": "Very nice post! I love the last point",
            "score": 1,
            "author": "Alfredo_8601"
        },
        {
            "level": 0,
            "comment": "If you looking to build a robust systems and Processes, you don’t need a coo, we are startup we developed an orchestration and automation platform and we are looking for partnership. We offer the full integration and the consulting for free, only you pay for the license. if interested hit me up!",
            "score": 1,
            "author": "LucaDePacioli"
        },
        {
            "level": 0,
            "comment": "I’ve been a self-employed software dev for the past 3 years, slowly working my way to trading under my limited company… but I just can’t seem to make the jump! \n\nI’m working with a few clients, one client is very strong so I’ve got work majority of the year. I’ve brought on another dev as my right-hand, in an ideal scenario I would become CEO and him the CTO. \n\nThis post has been super helpful to shed light on various aspects, I’ll be keeping it in mind. Cheers!",
            "score": 1,
            "author": "dylzbee"
        },
        {
            "level": 0,
            "comment": "Wow I’m 23 and hoping to break into the world of business and this was super inciteful",
            "score": 1,
            "author": "AdIll814"
        },
        {
            "level": 0,
            "comment": "Don't forget to turn that part of the brain off. The part of compassion, sympathy, and emotion.",
            "score": 1,
            "author": "Id_Solomon"
        },
        {
            "level": 0,
            "comment": "This one is hard for me, because I thought I was doing what what necessary for a founder and owner, however with just 2 people (me included) and a dream bigger than we had capacity for, I ended up burning myself out after 7 years of working on a project.\n\nRight now I’m still in recovery, thinking about how wealthy my ex business partner is because his wife built a successful business and I was experiencing little satisfaction while grinding with him and he’s taking trips and enjoying a nice part of his life being covered.\n\nOne of the greatest gifts I was given was when I told him I envy him, and it’s been hard for me to be around him because my envy tends to take over, and he threw me away like a bag of chips. “All I’ve done for you, and how much I’ve invested in you, you were like my little brother, I should’ve listened to my mother when she said you sounded envious of me at my wedding” (I was the best man). \n\nStarting from zero mentally now, and working through the ties I felt with him while trying to think through solutions while maintaining my family now.\n\nIt’s much easier then before since I know he doesn’t want me in his life anymore.\n\nThat’s my business story haha",
            "score": 1,
            "author": "a-friendgineer"
        },
        {
            "level": 0,
            "comment": "re #1, my favorite Steve Jobs quote is:\n\n“People think focus means saying yes to the thing you've got to focus on. But that's not what it means at all. It means saying no to the hundred other good ideas that there are. You have to pick carefully. I'm actually as proud of the things we haven't done as the things I have done. Innovation is saying no to 1,000 things.”",
            "score": 1,
            "author": "RedditKon"
        },
        {
            "level": 0,
            "comment": "You are saying you are now profitable. How long did it take you to become profitable and who's money were you spending in the mean time?",
            "score": 1,
            "author": "vorpalglorp"
        },
        {
            "level": 0,
            "comment": "This is great. I'm still working on no.1. I've been in founder mode for 4 years now, and starting to make this transition. Loving it.",
            "score": 1,
            "author": "No-Turnover7216"
        },
        {
            "level": 0,
            "comment": "Thanks for sharing",
            "score": 1,
            "author": "aitoolsarena"
        },
        {
            "level": 0,
            "comment": "Thanks for the tip, now my procrastination will be perfectly organized!",
            "score": 1,
            "author": "ExternalHearing5996"
        },
        {
            "level": 0,
            "comment": "I'm a founder/CEO but systematizing processes and establishing workflows is not hard at all for me to focus on. I struggle a lot more with putting off tasks that I don't feel 100% capable of executing well. Anything legal or financial gets me stopped up. \n\nIt might help that my business is 3000 miles from where I live, so the more I systematize, the more time I can spend with family.",
            "score": 1,
            "author": "Green_Fire_Ants"
        }
    ]
}