{
    "id": "148fuej",
    "score": 2,
    "title": "Have I done it the wrong way?",
    "author": "olafviking",
    "date": 1686663948.0,
    "url": "https://www.reddit.com/r/Entrepreneur/comments/148fuej",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello everyone,  first of all I must say I don't have the entrepreneurship mindset, I want to make money, like everyone in this world, but I'm more focused on building things, as a passionate developer with a good eye for design. \n\n2 years ago (which is a lot) I decided that I wanted to build an app for beginner and intermediate crossfit athlete like me, who wants to keep track of their progress, being able to find and do again, the workout they did at their box, analyze their strength and weaknesses. \n\nSo far I've been doing great, the app works, I'm using it, but I don't dare to talk to anyone at my box about it. There are still many things I need to figure out, for example I cannot import and sort all workouts from all athletes that signup into my app. For now I kinda do it manually with my box workouts, for one box it's fine 😆\n\nSo yeh, what I thought was that if the thing I build is useful for me, it will certainly be for others, but I have many doubt, IDK where to go, idk how to sell it neither. Perhaps i should've started with asking people at the gym what do they need the most from an app, but now it's about late (or ?!) \n\nI feel like I did what most of you advise, which is just to BUILD! I'm proud I've worked on it, and I've learned a lot, but I want this to be used now 😄",
    "comments": [
        {
            "level": 0,
            "comment": "iOS or android?",
            "score": 1,
            "author": "monkeydroger21",
            "replies": [
                {
                    "level": 1,
                    "comment": "Technically both, it's a web app, but I've made it a PWA so an app that can run on play store and iOS, but I don't want to pay the 100$ on iOS right away, I only have it on play store for myself, later I'll push everything to prod when I'm confident enough 😄",
                    "score": 1,
                    "author": "olafviking"
                }
            ]
        }
    ]
}