{
    "id": "5okzhj",
    "score": 2384,
    "title": "I'm tired of reading about people making 6 figures in 30 days with drop shipping and t shirts. Who here has an interesting small business that just ticks over with a profit each and every month? What are your stories?",
    "author": "LL112",
    "date": 1484689461.0,
    "url": "https://www.reddit.com/r/Entrepreneur/comments/5okzhj",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "I bought land near the largest apartment complexes in 3 small midwest towns and built garage sized storage facilities. The business almost runs itself.",
            "score": 446,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Very interesting.\n\nWhat was the initial investment? Would you call it a risky business? What is your daily / weekly overhead? How long did it took for you to break even?",
                    "score": 96,
                    "author": "kunlun",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 47,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "How did you get the capital to start this? I'm looking into doing something similar in my neck of the woods but the starting capital required gives me headaches.",
                    "score": 35,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 70,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You are correct, it does take money, but it does not mean it has to be your money.\n\nIf you have a good plan, contact investors.  You would be surprised by how many investors would love to buy into something with little input on their part for a share of the profits.\n\nThe experience and guidance of someone who has \"been there and done that\" being available to you is worth it's weight in gold. This experience alone will be worth at least 1,000 times whatever you make on the first deal.",
                                    "score": 26,
                                    "author": "jcorkern",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This has been something Ive constantly thought about trying to get into if I had the available capital. I live in the Seattle area and storage and parking is atrocious here, but there seem to weirdly be a ton of always closed off parking garages. \n\nIve always wanted to turn half of a structure into reasonably priced storage units to help store everyone's extra items because of Seattle's tiny apartments and the other half into decently priced vehicle storage. Tons of apartments dont even have parking options included in the lease and you have to fight over minimal street parking. Anyway, I thought creating a gated car storage would be helpful and possibly thought about incorporating a lot attendant to not only watch the units, but to be on call to drop customers vehicles off at their residences when called upon. \n\nThe Tacoma area has a lot of closed out parking structures that seem vacant as well and I think would make an excellent repurposing space to help vehicle congestion in our city. ",
                    "score": 6,
                    "author": "tristinDLC",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Interested to know more if you're willing to share ",
                    "score": 7,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I created camelcamelcamel and run it with two friends.  It wasn't intended to be a business, nor even a long term project, but people started using it and now we are approaching our 9th anniversary.  Just had our millionth user sign up!\n\nSounds like I should be in the tshirt dropshipping business though?",
            "score": 586,
            "author": "L1quid",
            "replies": [
                {
                    "level": 1,
                    "comment": "You created camelcamelcamel!? That is awesome! Love that site. ",
                    "score": 108,
                    "author": "JoshGreat",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks!",
                            "score": 23,
                            "author": "L1quid",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Dude I love your site, been using it for years. Keep up the great work!",
                    "score": 32,
                    "author": "Tricon916",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "So we're you guys just like \"fuck domains, name an animal\"\n\n\"Camel\"\n\n\"Taken\"\n\n\"Moar camel\"\n\n\"Still taken\" \n\n\"ALL THE CAMELS DAMN IT\"",
                    "score": 19,
                    "author": "AtherisElectro",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "\"I need a domain for this code that I don't expect to stay online longer than a week.  Oh hey I already own camelcamelcamel.com.  Perfect!\"",
                            "score": 26,
                            "author": "L1quid",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "If you don't mind me asking, how much revenue does camelcamelcamel generate for you guys?",
                    "score": 30,
                    "author": "versace_versace_vers",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "and followup question, how do you make money?",
                            "score": 11,
                            "author": "dimonsf",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Affiliate earnings from amazon",
                                    "score": 14,
                                    "author": "TaiGlobal"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Misplaced my cellphone and didn't have a landline to call it. I built a website to do just that and grew it into a small business that basically pays my rent for a few hours of work a week.",
            "score": 121,
            "author": "Treytor",
            "replies": [
                {
                    "level": 1,
                    "comment": "Callmylostphone?",
                    "score": 50,
                    "author": "FoodWaterAtmosphere",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Bingo :)",
                            "score": 39,
                            "author": "Treytor",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I started an app development company with my wife about 7 years ago (we're both software developers by trade). Originally started out on iOS and have since expanded to macOS, Android, and Windows. We're currently doing around $800k/year in revenue, expenses are minimal ($1k/month or so on servers) so most of that ends up our bank account at the end of the day. (A big chunk goes to taxes of course.) Hoping to break the elusive $1M/year in 2017.\n\nOur main product is a niche consumer-oriented utility app that you've probably never heard of. Unfortunately we've had enough clones of our app (like, literally multiple people have cloned it screen for screen), that I don't really want to invite more clones by publicly naming it here (especially after mentioning our numbers).\n\nIf you told me 7 years ago that I'd still be working on my own products as an app developer in 2017, I would probably have been shocked. Every year people keep telling me \"there's no money in apps anymore\", but every year we've broken that trend and continued to grow in revenue. It doesn't look like it's stopping anytime soon.\n\nSo far we've done almost zero marketing. (We did some banner ads on popular app sites a few years ago, but gave up on it because we could never make the ROI work out. Part of the problem was lack of attribution tracking at the time. I've been meaning to try again with Facebook ads but haven't found the time to experiment yet, we're still very much focused on development right now.) At this point I think the app spreads primarily through word of mouth, many of our users *really* love it, and they share with their friends, who share with their friends, etc.\n\nI read a bunch of other startup/small business related forums and I get the impression there's lots of other folks out there like me, quietly working on their own products and making a pretty good living out of it. Here's another great thread to read through on Hacker News: https://news.ycombinator.com/item?id=13326535\n\nP.S. It's really cool to hear everyone's stories and see the creators of sites like examine.com and camelcamelcamel post here. Glad to find out this place isn't just about dropshipping, affiliate marketing, and maid services.\n\nEdit: Incidentally, I think this is one of the best threads I've ever seen on this subreddit. Just people telling their stories in a really wide range of fields. No weird sales pitches or thinly-veiled marketing attempts. This is what we need more of.",
            "score": 93,
            "author": "fidnappdev",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I sell pizza. Started with 1 place, figured out what I was doing, now I have 3 with a 4th opening in April. Not franchises since everyone always asks.",
            "score": 259,
            "author": "notanative",
            "replies": [
                {
                    "level": 1,
                    "comment": "How does the pizza taste?",
                    "score": 31,
                    "author": "-Villarreal-",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Awesome in my opinion, but pizza is pretty personal for most people. I maintain a 4 star rating across social media and review sites.",
                            "score": 78,
                            "author": "notanative",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "\"Pizza was some of the best I've ever had. Restaurant was in great shape and obviously well maintained. However, the server forgot to bring my side of ranch. 1 star\"",
                                    "score": 27,
                                    "author": "Alex_801",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "I always felt like the pizza business would a be a fun creative venture to start. ",
                                    "score": 17,
                                    "author": "dafootballer",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "All food service is stressful as hell.",
                                            "score": 19,
                                            "author": "overcatastrophe",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "aweseome -  always wonder,  how much cash started up your first pizza place? ",
                    "score": 15,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I bootstrap. It's easy to open a new place with so many failures in this business. You could get up and running for 25k if you know what you are doing.",
                            "score": 22,
                            "author": "notanative",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Nice. Congrats.",
                    "score": 30,
                    "author": "doogie88"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 9,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thin and hand tossed, conveyors at 500.",
                            "score": 8,
                            "author": "notanative",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "How do you keep track of and trust the staff to give you every dollar your make?",
                    "score": 18,
                    "author": "IveRedditAllNight",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "it is kinda obvious, you have a \"checking\" counter, where the customers usually pay, and recieves their change. you have a starting balance when you open, and and ending balance that is higher based on what you sold today in your cash register.\n\nYou count the change between starting balance and ending balance, and compare it to the amount in USD sold today.\n\nIf it is the same, or more, perfect. If it is less, someone lost money or is stealing. ",
                            "score": 39,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What if someone pays cash and they don't ring up the product and just pocket the cash? How to know waste of product from theft?",
                                    "score": 7,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "This is also why you always see those receipt signs stating your meal is free if no receipt is given. It's not being nice to the customer its ensuring the order is being entered and cash not being stolen.",
                                            "score": 26,
                                            "author": "fsuguy83",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "The order won't be made by the kitchen unless it's rung up. It's not completely fool proof but this is usually the system. Used in conjunction with security cameras and good judgement when hiring, it is usually sufficient.",
                                            "score": 32,
                                            "author": "aesopmurray"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "There is a trick cashiers will do to steal cash from the customer. Customer orders for 10 items. Cashier rings up 12 items and quotes the price. Customer pays in cash. Cashier drops 2 items from the order and pockets the cash difference. If the customer pays with credit, then it goes through at the correct price. The customer usually won't notice. If they do then it's \"Oopsie, I made a mistake.\"\n\nSo, one rule a lot of businesses do is to have a rule about limiting the dollar amount of items removed from orders. Too many removals results in getting written up. Getting written up 3 times results in a firing.",
                                            "score": 14,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Painter and decorator here. I own a small painting business which has been at a steady pace over the last year. I hire sub-contractors when the pressure is on but mainly do all the work myself. No advertising is used, just word of mouth through property managers in real estate firms. \nI dont make massive amounts of money but I do have the freedom of having a lot of spare time NOT WORKING, in this spare time I focus on the things I enjoy most. Life aint about making a shitload of money, at the end of the day time is money, make use of it wisely.",
            "score": 83,
            "author": "Kinderfeld88",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Trivia in bars and restaurants.  I have 25 bars and restaurants that we host trivia at every week.  I have 9 hosts who work for me.\n\nI charge the bar $150/night.  And pay the host $50.  The trivia lasts about an hour and a half.\n\nThe bar wins, because it brings people in on a slow night and they sell more booze.\n\nMy hosts win, because they get paid $20/hr to read trivia questions and play music in a bar.  Working 1-2 nights a week.  It's good money for college kids.\n\nI win, because I have good weekly cash flow, and only have to work if I'm starting a new location, filling in as backup, or because I want to.",
            "score": 84,
            "author": "General_Exception",
            "replies": []
        },
        {
            "level": 0,
            "comment": "A friend and I run a website that allows people to send a postcard from Timbuktu to anyone they want with a custom message. It's a shopify site and similar model to all the send X to X sites, but our operation is a lot different due to some fairly complicated logistics.  \n\nI am based in Bamako, Mali's capital, and my friend Ali, a former tourist guide, lives in Timbuktu. With Ali, we have a group of unemployed guides in Timbuktu that handwrite the messages on the cards and take them to the Timbuktu post office. We get the postcards stamped at the post office, but then send them down to Bamako ourselves, either on public transport or on United Nations flights (the sole clerk at the post office in Timbuktu has told us it could be weeks to get it to Bamako if we go through the Malian postal service). The final stop is the Bamako Central Post Office before the postcards leave the country for their international destination. 60% of the profits go to the guides, who are unemployed because Timbuktu has been a red zone since 2012. There are no tourists, and the town is still dealing with serious insecurity. \n\nThe postcards take anywhere from 2 weeks to a couple months to arrive at their destinations. It's definitely not for the impatient, but we have found plenty of customers who enjoy the idea of receiving this physical object that has traveled an incredible distance from a place that some people don't realize actually exists (we actually had someone write to the site who thought we were just making a fake Timbuktu stamp to mess with recipients. He thought Timbuktu was imaginary and just something people say.) \n\nStarted the site last year and cracked 1000 orders towards the end of 2016, mostly thanks to a BBC article that came out in December. We have now teamed up with a schoolteacher in Timbuktu, and her students are hand drawing postcards, which is a new option on the site. Those cards cost $2 more and the $2 goes directly to her classroom.  At the end of the day, we've been able to send a good amount of cash to Timbuktu, and we have sent postcards to over 53 countries. ",
            "score": 79,
            "author": "philinthe_",
            "replies": [
                {
                    "level": 1,
                    "comment": "may you be rewarded for your actions.",
                    "score": 11,
                    "author": "oneknocka"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I help Chinese students study abroad in the US. My Chinese competitors are all low-quality and corrupt. I make my money by doing everything they do bad, well.",
            "score": 493,
            "author": "hungry_zebraz",
            "replies": [
                {
                    "level": 1,
                    "comment": "cool. do you verify credentials such as degrees? what i've heard is that a huge number of chinese students come with faked transcripts, references, proof of english fluency, etc. ",
                    "score": 25,
                    "author": "arbivark",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I work with the schools directly (on both the Chinese and American side) so I don't really deal with anything fake. But yeah, that's a huge problem. For instance, lmost every recommendation letter I've read for a student was written by themselves. And it includes so many personal details that no professor would ever know so it's super obvious... so usually I have to contact the professor directly, tell him to write the letter in Chinese, and then I translate it into English.",
                            "score": 42,
                            "author": "hungry_zebraz",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; \"This student also has a huge dick. I mean, it's just awesome.\"",
                                    "score": 77,
                                    "author": "gimpwiz",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "What kind of help? Help with studying, or just getting settled, finding places to live, etc?",
                    "score": 57,
                    "author": "adamf1983",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It started out with study help (editing their essays for class and tutoring). Then I expanded to helping them edit their essays and other English documents for grad school and charging a lot more. Now I work with them (and their parents... that deserves another post in itself) basically with anything and everything that gets them from china to the us. So, someone will come to me saying that they want to go abroad for study, and I will help them select schools, then select their major, then help them brainstorm and edit their written materials, and after acceptance (hopefully) I work with them on their visa interview.\n\nIt's honestly a really rewarding experience. And the money is pretty good with next to no costs... most Chinese institutions will charge $10,000 (USD!!!) per student, and after they take in the money, they basically do the bare minimum. I charge a slightly higher fee, and give them my utmost attention.\n\nIt doesn't hurt to be a white guy who can speak Chinese, with a wife who went through the exact same situation my students are going through. As for advertising, I do everything 100% word of mouth through an app called WeChat. I offer my students 10% off if they help me repost an advertisement. I still make my money, they're happy because they saved money with minimal effort, and I get more potential clients. It's a good deal all around.\n\nI'd love to do an AMA on this, but not sure if there is enough interest. It's a somewhat niche industry I'm in, but a niche industry in china still means millions of potential customers.",
                            "score": 285,
                            "author": "hungry_zebraz",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I don't speak Chinese, but have done some science tutoring on the side and would love to hear more. ",
                                    "score": 23,
                                    "author": "tiny-dino"
                                },
                                {
                                    "level": 3,
                                    "comment": "Hell yes you should definitely do an ama about this! How did you start? Do you have a website? What is your marketing strategy? Do you have offices? What are your costs? ",
                                    "score": 17,
                                    "author": "yadoya"
                                },
                                {
                                    "level": 3,
                                    "comment": "I tried convincing my mother to do this.  She did everything for two exchange students she took in after my brother and I were all grown up, graduated and living on our own. They both wanted to attend  university within the United States. You are right, the China equivalent \"placement\" agencies are about as corrupt as can be. She got them graduated with a high school diploma, enrolled in a university, and many other things. ",
                                    "score": 13,
                                    "author": "EconomicFacepalm"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I have zero desire to do this... but I'm still curious what you do. This intrigues me. ",
                    "score": 11,
                    "author": "germanywx"
                },
                {
                    "level": 1,
                    "comment": "So amazing. My Yalie friend paid his way across the world ghost writing Ivy League essays for entitled Chinese kids. Made about 1500 a month and lived it up like nobody I've ever known. ",
                    "score": 31,
                    "author": "Pleasuredinpurgatory",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Are you missing a digit there?",
                            "score": 40,
                            "author": "arghhmonsters",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That amount would be more than enough to make you like like a King in Malawi. Rent here is 350$ for a fully furnished townhouse with 2 security guards and 2 Maids.water and electricity all inclusive. food would cost you 200$. internet is expensive though but you could spend 200$ on high speed internet and drink our cheap beer all day.",
                                    "score": 20,
                                    "author": "hadi265",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "yeah his finger got worn down after writing out all those essays by hand",
                                    "score": 7,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Structural engineer here. I'm fortunate enough to use online project tracking and payment systems to ease the pain of collecting, and sell my expertise and signature to clients who need building permits / additions / inspections. It can be tedious but I'm very grateful for the rate at which I'm needed sometimes. ",
            "score": 228,
            "author": "tspencerb",
            "replies": [
                {
                    "level": 1,
                    "comment": "Everybody is kickstarting or selling fluff, while you're selling a service that only a very small number of people can legally provide. \n\n\nIt's the classic \"firm\" building that people forget about on this subreddit. Good stuff!",
                    "score": 136,
                    "author": "effyochicken",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you! I need to hear this, because  I read about the people selling stuff online and think I'm 'supposed' to be doing that as a real entrepreneur. I have a grass is greener mentality that I always have to keep in check. ",
                            "score": 67,
                            "author": "tspencerb",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 19,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 53,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Started a company called [Examine.com](https://examine.com) almost 6 years ago.\n\nWe analyze nutrition and supplement research. We sell nothing but info we learn from our research (no products, no coaching, no consulting).\n\n100% digital products.\n\nHad 69,000 visitors just yesterday (Monday).\nEdit: Cracked 70,000 (Tuesday)",
            "score": 297,
            "author": "AhmedF",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; Examine.com\n\nYou run this?! So informative, thank you for what you do! Do you, or anyone that works with you, have any background in nutrition, or science, or biology? Just curious",
                    "score": 68,
                    "author": "tookie_tookie",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; Do you, or anyone that works with you, have any background in nutrition, or science, or biology? Just curious\n\nOh absolutely. It's trendy on the Internet to think that authority and expertise is not important, but that's a load of bunk.\n\nI myself have zero xp (comp engineering degree), but I also write none of our research. My co-founder did his degree in dietetics, and everyone else has a different breadth of research/nutrition covered.",
                            "score": 23,
                            "author": "AhmedF",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Are you looking for help by any chance? I have a nutrition/biochem background and research/analyst experience, and I'm looking for work at the moment\n",
                    "score": 39,
                    "author": "dannyp123",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "1. You should have direct messaged him. \n\n2. Never say you're looking for work -- say you're looking for a new job. (this implies you AREN'T unemployed or undesired) ",
                            "score": 37,
                            "author": "nss68",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "u/dannyp123 way to put yourself out there.\n\nu/nss68 way to provide some actionable feedback.\n",
                                    "score": 29,
                                    "author": "WantToBeEverything"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "My wife is a wizz with interior design, so we bought a city centre apartment and made it up to look quite Scandi/chic/modern and through a combination of AirBNB and renting it out to film crews for movie/tv/video and photography shoots, we make more from that per month than my salary for working 9-5, Mon-Fri, and the workload is only maybe 10 hours max per week. ",
            "score": 45,
            "author": "ShetlandJames",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I plan and execute domestic and international elopement-style weddings (ten guests or less, one hour total events, very inexpensive comparatively speaking). \n\nI started out locally in my town. It exploded, so I opened operations in surrounding towns. Then different states. Now I'm in three total countries. My business oversees 500-600 weddings a year, all of which I get a very healthy cut. \n\nI'm expanding this year to sell the business as a \"business in a box\" opportunity to give people all over the country to start their own. I'll provide everything they will need to get started: website and hosting, email address, what you need to find in terms of locations and providers, book of ceremonies and readings for every occasion. \n\nI never saw myself as a lover of weddings. I just see myself as an entrepreneur who saw a niche market and had all the right skills to master it. It has worked very well. ",
            "score": 203,
            "author": "germanywx",
            "replies": [
                {
                    "level": 1,
                    "comment": "this is golden\n",
                    "score": 22,
                    "author": "Matt_yo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks! It really has been. \n\nI'll never run out of people wanting to celebrate love. ",
                            "score": 16,
                            "author": "germanywx"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'm surprised people having those style weddings are hiring people to plan them... I thought they just went to the courthouse and signed the papers?",
                    "score": 9,
                    "author": "Jasonrj",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not elopement style. All sorts of laws surrounding valid marriages internationally. People also still want dresses, flowers, music, photographs. ",
                            "score": 8,
                            "author": "3065462"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Glad you posted this! I'm a bit new here and mostly lurk, never saying much because the culture here seems to be more about making money and less about a quality product or service.\n\nI started out as a bookbinding instructor at a local non-profit and some students started asking to purchase my example books. I tossed around the idea of becoming a seller and joined Etsy sometime in 2014 but didn't really do anything with it. \n\nLast year in January (2016) I decided to really give it a go. Since then, I've been putting in a lot of work learning about SEO, promoting, creating a brand for myself, taking good product shots, setting up a standalone site, etc. etc. I also approached local businesses and museum gift shops about carrying my books and even sell some in person when people pass by my bookbinding studio. \n\nBetween Etsy, my standalone site, and local sales, I pulled in about $3000 dollars last month. To be fair, it was a good month. I consider this a part-time gig, though I am registered as an LLC. I still teach and work at the non-profit.\n\nIt's been A LOT of work, and there's a lot more to do and learn. It's tough to do every last bit of everything yourself, but nothing is better than being able to bind books in my studio all alone with some good music or Netflix on.",
            "score": 117,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's a super interesting niche! How did you start getting into bookbinding?",
                    "score": 13,
                    "author": "Robobvious",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 27,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Run a traffic and road sign manufacturing company. Defiantly not the most sexy industry but we're in year three and killing it. Supply any kind of sign from stop signs to plastic safety signs. Election season was big for us. We now have distribution in the US (home), EU, Japan, and working on south america. We're a small team, about 10 of us but we've had some good experiences. We have a little partnership with the state correctional facility where we hire recently released inmates to come work for us while they get back on their feet. Low risk, no violent crimes, etc. But we've had about 4 go through with 3 moved on to bigger and better things while the other still works here. Been a really fun program that bring me personally, a lot of happiness. Looking forward to this year, especially with expansion and looking to more international markets. ",
            "score": 111,
            "author": "paraplu1232",
            "replies": [
                {
                    "level": 1,
                    "comment": "That sounds awesome. Who are your customers? \n\nWith regards to road signs, would that be the municipality?",
                    "score": 10,
                    "author": "tookie_tookie",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "We have two divisions somewhat. A government/city side which are all the roads, highways, any kind of public street. And we have more of a commercial side which is everything from handicapped parking signs for a business, custom signs, safety and construction signs, etc. Government gives the big ticket sales but they are harder to get and they take forever to make decisions so the commercial side provides the steady stream of smaller sales. ",
                            "score": 13,
                            "author": "paraplu1232",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I walk dogs. It's not exciting, but I spend my days outdoors with dogs I love and it has been paying the bills for a few years now. ",
            "score": 52,
            "author": "russkhan",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I make anvils out of surplus railroad rail that I'm able to buy at a better rate if I buy 30+ feet of it at a time.  I cut it up with a bandsaw and sell raw rail, as well as fully finished pieces that have horns, mounting holes, hardie/pritchel (tool) holes and a milled top.  Getting anywhere from $40-285 per piece depending on size and features.  Last year made enough to pay mostly cash for an eBay find used vertical machining center that I'm working on bringing up to date so I can use it to make these faster.  Doesn't pay the rent but brings in enough to keep tools maintained and occasionally pay for new ones and put a few dollars in my pocket.  \n    \nFor those interested, my sawing station: http://imgur.com/a/bwVWj    \n    \nCNC mill drilling holes and installing square tool hole: http://imgur.com/a/VGOx2    \n    \nTransition from raw to finished horn: http://imgur.com/a/izawl    \n    \nA finished piece that came out looking real good: http://imgur.com/a/YkD9F    \n    \nI've also made some stamping blocks for artists &amp; book ends but haven't really marketed them as much as the anvils",
            "score": 176,
            "author": "greenbuggy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Awesome! I've been looking for an anvil to take care of this coyote that's been chasing me. \n\nSeriously, sounds like a good side hustle that is leading somewhere. Do you do anything else with railroad supplies? ",
                    "score": 95,
                    "author": "mrdux84",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I've sold a few RR spikes as I've been able to get my hands on them, there's a bit of a market but I haven't found a steady supply like I have with the rail itself.  Still trying to find myself a better source of them so I can stay diversified.  If I'm slow (which admittedly hasn't happened lately - bought a house late last year and my day job is also keeping me pretty busy) I do some lathe, welding &amp; CNC machine work but there's a lot of people with those similar capabilities and at least a few willing to chase thinner margins than I am.",
                            "score": 8,
                            "author": "greenbuggy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "where are you located? I sell a fair amount of steel through a steel broker in Mill River MA. I'm sure he (or I) could put you in touch with someone. \n\nWhat kind of wt are you looking for? \n\nnm I see ur in FC, CO. Might have someone for you, will PM if I do. ",
                                    "score": 9,
                                    "author": "LeoAPG",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Who is the buyer of these?  \n\nVery cool and interesting but I can't figure out who this is for.  ",
                    "score": 16,
                    "author": "mrholty",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "cartoon villians. hipster blacksmiths. anvils tend to be expensive, so he's figured out a cottage industry to make them cheaply.",
                            "score": 82,
                            "author": "arbivark",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Bet shipping is a bitch.",
                                    "score": 16,
                                    "author": "GodOfAllAtheists",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "In the area I'm in (between Denver and Fort Collins) the used market for anvils is insane, with some pieces of known quality (basically, made in the US, UK, Japan or Germany) often fetching $6-9/lb even for something 50 years old and totally beat to hell.  Have heard complaints that hipsters going for \"rustic/vintage\" look interiors are further distorting it beyond the large number of hobbyists, knifemakers, leatherworkers and silver/jewelrysmiths that are on the lookout for their own.  For a hobbyist just starting out I offer something a lot more reasonably priced, without resorting to the garbage cast iron units that Harbor Freight sells.",
                            "score": 33,
                            "author": "greenbuggy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Longmont checking in.  Howdy!\n\nHarbor Freight shitty vise/anvil thingy confirmed.  If I could do it all over again, I'd get one of these. Pretty cool.",
                                    "score": 9,
                                    "author": "TianWoXue",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I've mentioned it on here before, and it's pretty far away from most of the t-shirts and dropshipping you see on this sub.\n\nI clean carpet.  I am an owner/operator, with no employees.  This is a side gig, I have a full time desk job.  I work, on average, 15-20 hours a week cleaning.  I just bought some new equipment and a newer van, so now my costs are about $1000 per month.  I make that in about 2 days.\n\nI have zero marketing costs, and everything I do relies on word-of-mouth and very satisfied customers.  I have enough commercial work to keep up income but prefer high-income residential.  All told, someone could get a solid start in this business for $20k and if I were full time, no doubt I could bring in 6 figures a year, even in my small town.",
            "score": 26,
            "author": "BukketsofNothing",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I started a graphic design and copywriting service specifically targeting Amazon sellers.",
            "score": 22,
            "author": "daxdeegan",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I run a site called [FrankerFaceZ](http://frankerfacez.com) which is a browser extension for [Twitch](http://twitch.tv). Although the service is completely free, we offer a few extra features to users who donate $5 or more to the site. My philosophy has always been to make people fall in love with your work *first*, so that their purchase is one they make out of happiness/gratefulness/goodwill, rather than the money feeling like a paywall.\n\nWe have about 150,000 users. I recently quit my desk job and moved to the middle of nowhere, where rent is really cheap, so the donations we get helps me cover the rent while I work on new projects.\n\nWhile I'm not an expert at coding or web design, I think my greatest skill is looking at a specific community and understanding the kind of things they want the most, and delivering that to them. Then, once people see my project with some degree of legitimacy (rather than me being the typical \"idea guy\"), it attracts the interest of more expert developers or other specialized people who can take it to the next step of professionalism. That's what happened with FFZ (I don't do much coding anymore) as well as some of my new projects I haven't announced yet.",
            "score": 23,
            "author": "dansalvato"
        },
        {
            "level": 0,
            "comment": "My best friend and I had the crazy idea to make ourselves a couple of skateboards. After receiving a multitude of positive feedback on the boards, we decided to sell them locally. Eventually we scaled up and began selling them all around the country!\n\nSo far the business has been a success, and we've had multiple distribution deal with skate shops everywhere.",
            "score": 20,
            "author": "Sparkswont",
            "replies": []
        },
        {
            "level": 0,
            "comment": "My business partner and I run photography workshop (2.5 hour 'adventures') in Tokyo, Kyoto, and Osaka. It's our second year and we are just starting to break even. There are two of us working full time and one other guy who is a contractor for us.",
            "score": 39,
            "author": "burningmonk",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I run a sunglasses brand called [Tens](http://tens.co), we market ourselves solely around our lens tint which makes everything look happier!\n\nWe received a personal investment from Sir Richard Branson in July 2016, which still kind of blows my mind.",
            "score": 131,
            "author": "martybell",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's super cool. How are sales? How do you get past the \"sounds like bullshit\"?\n\nYour site shows up absolutely terrible on firefox.\n",
                    "score": 44,
                    "author": "doogie88",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sales are solid by now, we've built up a pretty loyal fan base over the last couple years. We really don't get much of the 'sounds like bullshit' stuff. A large majority of new customers have tried a pair from their friends/family. Launching with a successful crowdfunding campaign w/ ~8,000 backers gave us a pretty strong customer base from our beginning.\n\nThat's really odd, I use Firefox as my default browser (on Mac) and it displays as it should. Are you using an ad blocker? If so, which one?\n\nCheers!",
                            "score": 19,
                            "author": "martybell",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Cool.\n\nI'm using ublock, and yeah I think it's the issue.",
                                    "score": 11,
                                    "author": "doogie88",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Also looks terribad in chrome with ublock. I think it's safe to say that ublock is the issue.",
                                            "score": 12,
                                            "author": "fr1ction"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I'm on mobile and it says \"looks like you're in USA/canada...\" so i click ok take me too na site, then it says \"looks like you are in uk..\" lol ",
                                            "score": 19,
                                            "author": "Vyper28",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Same for me",
                                                    "score": 7,
                                                    "author": "vikingcock"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[Richard Branson](https://www.virgin.com/richard-branson/why-you-should-invest-products-you-love) seems pretty confident in what they are doing, so I'd call that a win. ",
                            "score": 15,
                            "author": "Rockmann1",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[Uhh...](http://i.imgur.com/CEIyrR2.png?1)\n\nWhen I turn off uBlock Origin it seems to load correctly.",
                    "score": 16,
                    "author": "constantly-sick",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ahhh we've been running into some issues with that particular ad blocker, I believe it's not getting along well with our Geo-IP script. Will bring it up with our devs again tomorrow. Thanks for alerting me to it.",
                            "score": 11,
                            "author": "martybell",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah I also use ublock and it looks like a nicely designed, completely empty website",
                                    "score": 19,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I own a business that makes copies....kinda dialed into a small niche - Lawyers. Sometimes they can have 100s of boxes to copy or scan. The lawyers think I just wave a wand",
            "score": 15,
            "author": "otisday",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I run a mobile car repair business that specializes in vehicle brake systmes. I service your brake pads, rotors, drums, fluids, lines, etc. I come to your home or office and perform the repair. I am now getting serious about attracting customers and I get MAJOR referrals because of the customer service aspect I provide along with saving the customer time and money by not going to the dealer. It is a hit!",
            "score": 30,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I transcribe old big band recordings for bands around the world to be able to play. Lots of medium and large publishers print some of these arrangements but believe it or not, most of them are pretty bad, sometimes with catastrophic errors in them. It's a niche market, but bands that want to play those charts have nowhere else to go and not everyone knows a transcriptionist who can work with orchestra music. Bands come to me and stick with me because I put out a professional product and put their bands in a position to succeed under the demands of the modern band (not enough funding to rehearse, all sightreading, constant rotation of players, etc). \n\nIt gets a little better every few months. There are slumps and peaks but it's been steady for 3-4 years now on the whole. I mean, I've always paid my rent on this gig alone so something must be working properly!\n\nedit: should also mention that I do custom arrangements and original music commissions for bands as well. Think of it like the bespoke side of the business. I am a session musician as well but I do the least amount of playing out of all my friends/colleagues since I spend so much time doing charts.",
            "score": 33,
            "author": "Syjefroi",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I make content websites by scanning public domain books.\n\nI literally bring a scanner to the library, scan the whole thing, then turn it into a well organized website.\n\nLatent semantic indexing is high since it already a book, topics are organized, well edited, etc. \n\nI then put  few Adsense blocks on each page. \n\nEach site makes less than $100/month, but was steady while I was doing it.",
            "score": 33,
            "author": "jjv5_jjv5",
            "replies": [
                {
                    "level": 1,
                    "comment": "One site per book?  Can we see an example?  That's absolutely fascinating.",
                    "score": 9,
                    "author": "Rouxmire"
                },
                {
                    "level": 1,
                    "comment": "I'm not sure I understand, are they instructional books?",
                    "score": 4,
                    "author": "IrrelevantPenguins"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm in the process of renovating an old theater from the 1930s into a second run theatre. No profit.... Yet",
            "score": 92,
            "author": "SoCalWasCal",
            "replies": [
                {
                    "level": 1,
                    "comment": "Good luck, those old theatres are worth preserving!",
                    "score": 21,
                    "author": "adamf1983"
                },
                {
                    "level": 1,
                    "comment": "our town has a group that wants to do that. https://www.facebook.com/IndyRivoli/\nthey have little/no money, but they might like to have you in their rolodex as a consultant.",
                    "score": 14,
                    "author": "arbivark"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I run a SAAS product that builds digital beer menus for beer bars and breweries. You know, those TV screens that show all the beers on tap in real time. It basically runs itself these days so I also have a couple other small businesses I invest in and advise. ",
            "score": 15,
            "author": "redtarmac",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I own a small, online-only skincare company. I do R&amp;D, manufacturing, bottling, labelling, fulfillment, customer service, the whole shabang - with the exception of the logo and label design, which I used a freelancer for, the entire business is a one-woman show.\n\nI started making skincare products without any goal to sell them, I just missed being in a chem lab so I set one up in my kitchen and played around with recipes I found on the internet. I started perfecting my recipes, got my blog followers to test them out and give me feedback, and ended up with a couple products that I thought were effective and unique.\n\nI created an LLC, got all my ducks in a row, and launched with just those two products. I only spent about $3k pre-launch, so I broke even within the first two months. I still have my regular day job, but my skincare company makes enough that I could leave my day job if I wanted to (but I really love my day job - bummer, right?).\n\nI owe a lot of my success to two things:\n\n1) Finding a niche and staying true to it. My company is all about science-based, no-frills, unfragranced, gimmick-free, hyper-effective skincare. While there are a few beauty companies out there like that, it's a much less crowded market than if I were trying to do luxurious, high-end skincare or all-natural, organic skincare or trying to keep up with the latest skincare trends.\n\n2) Genuine engagement with my customers. I was a science-y skincare blogger long before I launched the company, and I still write blog posts/post on Reddit about skincare in general, without pushing my products. I regularly post behind-the-scenes chemistry photos from the lab to my Instagram. I figure if people are interested in what I'm selling, they're probably also interested in the general science behind skincare, so I focus on that rather than pushing a sale.",
            "score": 15,
            "author": "the_acid_queen",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I write Wikipedia articles and help people manage an article about themselves or a company.\n\nI'm sure people will jump to point out the COI but don't worry, I care a hell of a lot more about Wikipedia than them or their money.\n\nThis had lead me to meet some really interesting people.  For instance, a guy plays one down for the Steelers and people will have an article up about him in hours.  Play a huge role in a scientific field and unless you're a public figure, no one gives a shit about you.  So I find those people and they're more than happy to dish out the money for me to essentially write a huge research paper on them.\n\nWikipedia article basically shove their subject to the top of every major search engine.\n\nI've met diplomats, politicians, comedians (my favorite), scientists, musicians, and entrepreneurs.  I don't make a ton of money with this company but that's not the point.  I wrote articles for a decade and helped COI editors find a place on WP.  Now I do it for money, stories, and connections.  I love it.",
            "score": 56,
            "author": "Zezu",
            "replies": [
                {
                    "level": 1,
                    "comment": "Since I didn't know myself, COI = Conflict of Interest\n\nThe wikipedia rule about writing about yourself or your own business.",
                    "score": 5,
                    "author": "strangecharacters"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 95,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Damn dude seriously impressive \nWould love to check out the store :-) got a link? ",
                    "score": 26,
                    "author": "princetonkane",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You'll be waiting...",
                            "score": 24,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I own and operate 2 businesses \n\nOne cutting down trees and another doing wedding photography",
            "score": 29,
            "author": "ohheyyouagain",
            "replies": [
                {
                    "level": 1,
                    "comment": "Why not two business?\n\n1. Cutting down trees.\n\n2. Planting new trees.\n\nInfinite clients. ",
                    "score": 10,
                    "author": "swskeptic"
                },
                {
                    "level": 1,
                    "comment": "Cutting down trees ain't no joke. We have 8 old trees in our yard that need to be trimmed or taken down, and we've had estimates in the $5-7.5k range. Never knew it would cost so much to take down trees. But we're going to pay it, because if I try to DIY it I'll probably take down a tree onto my roof.",
                    "score": 6,
                    "author": "bluishmamba",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 75,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "That sounds rad! Love crafty business ideas that give back. Good work!",
                    "score": 7,
                    "author": "martyz",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I sell truck lights and bulbs, online and offline, retail and wholesale. It's a pretty conservative audience. Revenue grows over time, but it's a steady growth, not a one day wonder thing.",
            "score": 13,
            "author": "nimblemerchant",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I ran (very poorly) a gourmet jelly company that's currently on hiatus because I'm out of cash. I will say that it's not hard to find a co-packer in your town who will help you develop a condiment and then produce it for you, and all you have to do is sell and ship it. The margins aren't awesome, but you can make them work- unless you're dumb like me and overspend on things you don't need. ",
            "score": 13,
            "author": "PAdogooder",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 146,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm looking to get into real estate myself. I'm going to assume you're in the US? Do you mind talking more about how one starts a brokerage? ",
                    "score": 25,
                    "author": "MadHaterz",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 17,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I tried RE, but couldn't stomach the always-available lifestyle, congrats for you! Were you able to balance work and play at first or was it balls to the wall for a few years? ",
                    "score": 15,
                    "author": "tspencerb"
                },
                {
                    "level": 1,
                    "comment": "How often did you work with real estate photographers and what would be your advice to someone trying to approach brokerages for photography needs?",
                    "score": 9,
                    "author": "Whatisatoaster",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Something I don't understand, homes aren't like consumer goods that are bought a lot, are they? After how many years does the average consumer buy a house?\n\n\nSeems like a really long play.",
                    "score": 8,
                    "author": "RaceTo100",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "From another 29, well done man.  I'm writing this with 3 failed businesses under my belt.  It's inspiring to read :)  Keep up the hard work!  Q: During a bad housing market, is it a bad time to get into realestate, or not really an issue?",
                    "score": 5,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I create modern memory baby clothes quilts from that box of sentimental baby clothes every mom has sitting in her closet/attic/basement! I made one for my son in 2003, started doing them for friends/family occasionally, then in 2007 decided to make it a business! Built my website myself (Frontpage at the time, lol, have since upgraded to Wordpress) &amp; just used basic SEO to get it ranked on Google (I had a job in SEO at the time.) Got my first few orders by posting on my local Craigslist... and over time it just organically grew to where it is a full time job for me and a part time job for my sister (and I really need to hire a second person!) I do basically everything myself, from web design to marketing to social to accounting to product creation, and my sister helps me with prepping the clothes. I have created almost 1000 quilts at this point, and have about a year's worth of orders pretty much on an ongoing basis. People send me their stuff from all over the globe - all over Europe, Australia, Hong Kong, Singapore, Kuwait, UAE - I even had a man fly to me (I'm in Phoenix AZ) from Luxembourg with 3 suitcases of his kids' baby clothes because his wife didn't trust the postal service. I am lucky enough to get to work from home, and was able to stay at home with my kids when they were little, and this year I should make right at about $50,000. It's a lot of work - no dropshipping here, lol - and it's not like I'm getting crazy rich, but it is absolutely my passion and I feel pretty great about what I've created from literally a $10 domain name purchase! Bonus: no daycare for my kids. And I've probably listened to well over 500 audiobooks in the last decade while sewing, along with hundreds of podcasts. And multiple Harry Potter movie marathons. ;)",
            "score": 12,
            "author": "tahini17"
        },
        {
            "level": 0,
            "comment": "Started a web development and online marketing [company](https://www.cyberbytesinc.com) 7 years ago when I was a freshman in college with a business partner (my step dad). He ran a construction company full-time and was my first/primary client.\n\nWell, 4 years went by while I was getting a triple major in college that had absolutely nothing to do with my skill (web development). Brought on a few clients over the years but really didn't make much at all. Worked a lot and payed myself like $5k/yr for those 4 years.\n\nI was an introvert, enjoyed sitting in-front of a computer all day and worked well by myself. My business partner wasn't going out and networking and marketing so no new business was coming in. At that point I was managing $35k/yr in advertising budget for my step dad's company, but I was charging him hourly at like $30/hr when working on the campaign and website. It didn't amount to much.\n\nAnother year went by with minimal growth and I decided to make an ultimatum, if nothing changed a year from then (2 years out of college) then I would have to totally rethink things and consider getting a job somewhere. (I never worked for anyone aside from my step dad's company).\n\nAnother year went by, got a couple bigger clients (big for me at least, like a $4-5k website). But still, not enough growth or sustainable work.\n\nI'd go to networking events, nothing came from it. I'd usually just hang out with a few friends and not really talk to many people. I was in my comfort zone. Then I'd just complain afterwards that my business partner was supposed to be sales guy anyway, it wasn't my responsibility and I sucked at it!\n\nIt was at that time that I broke it off with my business partner, he was supposed to be the sales leg, but he was working 70 hours a week at his construction company.\n\nThis brings me up to about 8 months ago. So just over 6 years in business and bringing in $5k/yr and the most recent year $11k. Working my ass off, teaching myself web development, doing personal projects, working tons of hours but not many of which were billable.\n\nBut it was at that point when I broke it off with my business partner that I decided to go out to networking events and actually force myself to talk to people and sell myself. It lead to a few promising leads and eventually a sale. It was then that I realized I was using him as a crutch. He was \"sales guy\" so I didn't have to be. In my mind at least. But I was a \"sales guy\". I was passionate about my service and knew it like the back of my hand. I started networking and talking to people. Using others as soundboards to figure out and refine my service offerings based on engagement.\n\nStarted backing away a bit from web development and more toward the IT side of things. IT consulting, software implementation. Stopped trying to be an asshole artisan putting small businesses on $4-10k websites and instead using SquareSpace and Shopify when it made sense to just pop out a $800-1.5k site.\n\nWeb development became my foot in the door, but I was clearly becoming an IT company. I positioned myself that way and transitioned my existing clients over to it. I joined local advertising organizations and didn't go there as advertising guy. I went there as IT guy and problem solver guy. I met my current best client there. A 25 person advertising agency. I pushed them to take a chance on me, gave them a phenomenal deal to get my foot in the door. They just axed their IT guy 6 months prior so they had some work outstanding that needed to be done.\n\nI didn't know how to do a lot of the work, but I figured it out. I pushed myself, got tons of mentors in the IT space, asked them for advice constantly.\n\nStarted building up recurring revenue from clients and figuring out a direction. Closed out 2016 by tripling what I did in 2015, all by myself. Still a 1-man team. But now I know my service offerings and I know where to focus.\n\nI'm hoping to double in size this year and wholeheartedly believe I can do it by myself. I've finally passed the point of making \"minimum wage\" and it finally makes sense to keep on pushing.\n\nIt's tough, it's a struggle. I'd re-evaluate things at least once a year and it got old real quick. \"Just one more year\" I'd tell myself, but nothing would change. Had close family asking me when I was going to move on from this and get a \"real job\". That killed me. They meant no harm by it, it was a very valid and fair point. I did want to prove them wrong, but more, I wanted to do what was right for me.\n\nI still continue to work my ass off. I think about my business 24/7 and haven't had a meaningful relationship (girlfriend) in 4 and a half years. My business took precedent. It gave me highs, it gave me lows, and I learned to equalize things. When you have super high highs, you're going to crash and burn and have the shittiest lows. It's not sustainable or healthy. I just learned this in recent months. Now when things are going well, I think about the negatives, and vice-versa. Keep myself equalized.\n\nAnd no, I'm not making the best money just yet. BUT I am finally seeing solid growth happening 7 years later. I've grown professionally but also personally. I'm now super outgoing, people can't even fathom that I am an introvert deep down. I now love meeting new people and building relationships. I am excellent with sales and selling myself because I'm just being fully transparent, honest, and passionate. Refined my business to focus on [Business Process Automation &amp; Efficiency](https://www.cyberbytesinc.com) with IT Support as the foundational service. (P.S. site is pretty outdated, haven't updated copy in a while. Little to no business comes from my website so it has hit the back burner. It's tough to sell what we do with text on a page.)\n\nIt's working well and I'm figuring out my niche.\n\nIt took 7 years making no more than $5k/yr for most of them. Living at home WAY too long. But I finally feel like I've made it and so excited for the years to come. I wouldn't want to be doing ANYTHING else right now.\n\nI wouldn't trade any of it for anything. I am a totally different person now. If things took a turn for the worse and I had to close up shop, I don't care. I've learned so much and grown so much as a person. Not to mention, the various mentors I have built over the years have told me there would always be a job waiting for me. While it's a nice safety net to have, it's definitly my last resort. I'd rather continue fighting building my own thing even if I don't end up making more than $50-60k/yr. I'm happy and love having control of my future. That alone is worth it over making a guaranteed $80k/year + benefits.\n\nIf it isn't already clear, money is not at all my driving factor right now, never has been. If it was, I'd have thrown in the towel a LONG time ago.\n\nThere's two things I want to stress:\n\n1. Get mentors. A LOT of them. They are invaluable given you show them that you aren't afraid of some hard work.\n2. DON'T start a business because you're chasing money. If money is your driving force, you're going to give up before you make it.\n\nIf this post can help even one person, it will all be worth it to me. I know I haven't \"made it\" yet, but I already feel indebted to all my mentors and the need to give back just as they did.\n\nCheers!\n\n**EDIT/UPDATE:**\n\nSo I've been getting tons of DMs and questions and have already spent hours replying to so many people individually. I mean I was just talking about my story and the CRM bit seems to have struck a cord with many people here.\n\nThere's a lot of repeating I'm doing in DM's and in here so it's probably much easier to reply in mass. I mean I do specialize in business automation and efficiency and all! haha\n\nI'm going to put together a boutique 1:1 newsletter where I will talk about this stuff in more detail and I can probably be much more help. You can also reply to it and talk to me directly if you have any specific questions.\n\n**[Business Automation &amp; Efficiency Newsletter Signup](http://cyberbyt.es/newsletter)**",
            "score": 45,
            "author": "flip4life",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I have just started a small studio to help couples star in their own porn. Lighting, good quality cameras, makeup and waxing if they choose are all taken care of. Whether they want a corny build up script or not is up to them, but usually they roll with some kind of backstory for the clip.\n\nOf course its for the more eccentric types. We are just running on word of mouth at the moment and have shot 11 special videos, while we are planning out our 12th for this weekend. ",
            "score": 34,
            "author": "Ilikephlying",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I write and design science-themed books and art prints for kids. A mix of etsy, my own ecommerce site, and Amazon -- I'm not rolling in dough but it's very part time work I've been able to do from home while raising kids.\n\nNow that the kids are getting older I have more time to work on growing the business. I would love to expand into producing toys, bedding, and other decor items. I have designs, but not capital. That might be a Kickstarter at some point.\n\nIn the meantime my goal is to create some nice passive income streams. I'm working on selling digital content over on teacherspayteachers.com and I'm making a series of children's books for kindle.\n\n",
            "score": 11,
            "author": "miparasito"
        },
        {
            "level": 0,
            "comment": "I make hot sauce, BBQ sauce, Bloody Mary, and Margarita mix. You can get it in more states than you can't. It will be 9 years in February, and we do sell an occasional t-shirt.",
            "score": 10,
            "author": "Bluth_bananas",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I run a website that buys used Apple devices from consumers and businesses. The first few months were hectic with negotiating shipping rates, squashing bugs, and figuring out our pricing structure. Now it is doing really well!",
            "score": 21,
            "author": "ericditmer",
            "replies": [
                {
                    "level": 1,
                    "comment": "PM me your site so I can sell you my MacBook?",
                    "score": 11,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hehe dropshipping seems to.be a hot topic around here at the moment. \n\nI'm working on something that's not shirts or Aliexpress haha \n\nI've been selling art prints and drawings on Etsy for about three years now - and a few other marketplaces; things are really starting to grow. We cracked 200k in turnover last year, seriously starting to think about leaving work. \n\nEven just set up a new project/e-commerce website to help increase branding and start bringing it all together, exciting times ahead :-)\n\nThere's other stuff out there....\n\nEdit: Woah - thanks for testing out the new servers reddit, jebus batman that was a hell of a traffic spike. ",
            "score": 103,
            "author": "princetonkane",
            "replies": [
                {
                    "level": 1,
                    "comment": "Can you explain what other market places, what kind of art prints and how you were able to make sales? ",
                    "score": 18,
                    "author": "AScarletKnight",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'll try and keep it brief. \n\nBasically started with a pen and piece of paper. Made a couple drawings and started of by simply listing an item on Etsy. Cost - less than $10. \n\nIn a few weeks I sold one and made $50 bucks, so I went out and bought a cheap printer and slowly expanded my range. \n\nIn a couple months, I had made $500. Awesome. So I ran a really small Kickstarter and asked for money for supplies - raised another $600.\nEnd of year one we made about $1500. \n\nEnd of year two - I had made $5000 and my fiance and I went on a holiday :-) \n\nYear three I launched a book on Kickstarter and cracked 100k to launch the book. It was only after this I started to think bigger picture, and put some effort/money into branding/logo etc. I moved some of my products onto Amazon and a couple websites I mange (single product pages). Tried out bonanza as well but meh. \n\nEnd if year three we did, $201,645 turnover.\n\nIt's now year four - I'm working on launching a project/e-commerce website to act as my hub of activities and increase brand awareness. \n\nGoing to massively increase product range, and launch two new major, large scale projects this year - should be fun!\n\nEdit: how do I get sales, combination of long term email list, using etsy/Kickstarter traffic - Facebook ads amd a couple social accounts but I'm shit at those\n\n",
                            "score": 56,
                            "author": "princetonkane",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "how many people on your team? i only ask because you say \"we\" did $201,645. Where would you be if it was just a solo venture?",
                                    "score": 11,
                                    "author": "SantiagoAndDunbar",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I say we - but it's just me and my fiance.  \n\nShe helps with packing/shipping and the art. I just passed her accounting haha. slowly getting her to take over the social stuff too, so that'll be a load off my mind. \n\nI basically do everything else, websites, listings, marketing blah blah blah",
                                            "score": 22,
                                            "author": "princetonkane",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I manage a handful of properties for other investors.  Its small enough that it only takes a few hours of my time each week.  The company barely breaks-even, sometimes small profits and sometimes loses money monthly, however it typically covers the cost of the infrastructure I need to manage my own personal investments (where I really make money) and is a huge opportunity for tax write-offs.  Rent office space to myself, all of my vehicle expenses, various tools, training classes, etc are all business write-offs.  ",
            "score": 8,
            "author": "tokamakv",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Started an influencer marketing company in the gaming industry. We did 250k in sales in the first 6 months. ",
            "score": 10,
            "author": "Rekt_Nation",
            "replies": [
                {
                    "level": 1,
                    "comment": "What does an influencer marketing company do, from your perspective?",
                    "score": 7,
                    "author": "dexx4d"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm on my second venture backed startup. Sold my first one for not a lot of money, and realized I needed to diversify my income. So by day I run product at my startup, but we have a few other things we do to hedge our income. \n\n1. My wife and I started an affiliate review site 18 months ago that brings in $750-1,500 month. We do one article a week, focusing only on things our family uses. It's not going to make us rich, but it helps cover the mortgage. We work 2-3 hours per week on this. My wife does most of this, as she's a great writer and has a little background in SEO.\n\n2. Etsy - we sell very niche letterpress posters on Etsy that sells $4-5k month. Our profit all out is about $2-3k per month. Our COGS are not cheap, and we spend about 2-3 hours a week in the evenings on this, mostly on fulfilment. Again, not F*ck You money, but it helps. \n\n3. Mobile App - I'm a product guy, and designed and built an app that we apply into multiple niches. Right now it's about bring in revs of about $6-7k month, but my dev partner and I are putting most everything back into the company. So right now I pull nothing from it, but I anticipate that by may it should be $3-4k month in income for me.  \n\nMy main income is still my VC backed startup, but my wife and I have been working really hard to build a steady baseline because income stability in my line of work is not the best. None of it has been easy, and definitely not a 30 day turnaround, but they're just the kind of low maintenance businesses we need. ",
            "score": 65,
            "author": "bluishmamba",
            "replies": [
                {
                    "level": 1,
                    "comment": "Great stuff, thanks for posting!\n\nCan you share how your mobile app generates revenue?",
                    "score": 5,
                    "author": "A2Bacon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Right now just display ads. We have very focused criteria for what market/niche we target, so our click rates are pretty good. \n\nOnce we get more users and drive up our user metrics, we'll start going out to brands to do promoted content.  \n\nEDIT: I should have included that we built a basic framework app, and then reskin it and promote it via Facebook ads to various niche markets and enthusiasts. Right now we have 5 niches that we're targeting.",
                            "score": 7,
                            "author": "bluishmamba",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm in the early stages of relaunching a chocolate brand which had disappeared a few years ago. It will be a long and difficult process which will involve lawyers, but I want my daughter to be able to taste the chocolate I had when I was little. It will not be a US based (or even English-language based) venture either so when I start posting more about it here, it won't be promotional spam :D",
            "score": 17,
            "author": "quodo1"
        },
        {
            "level": 0,
            "comment": "I own a Beef Jerky Company Called Tibbs Beef Jerky I started making Jerky 6 years ago. Last year I pushed to the business side of things I just launched my website tibbsjerky.com I make 5 bold flavors my newest one is Garlic Siriacha I use 100% grass fed Angus Beef and I never skimp on the quality I offer free shipping and auto shipping too",
            "score": 16,
            "author": "stevetibb2000",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Started a cleaning business end of 2015 following a famous Redditor here ... was making 5k per month after 6 months sold the business cause I had to move. It was all for the sake of learning to build a business and I highly recommend. It's all about taking action and moving forward.\nTook the lessons I learned from there and started a catering business with my partner early this year and a web marketing agency. I'm quite confident I can make both successful with what I learned.\nIf I could give any advice is STOP READING THIS! LITTERALY! I used to spend lots of time reading info on how to do stuff that I actually never took action and that's what's wrong with many of us. Just execute on your idea ... do anything reach out to people, send emails or dm's on instagram to your potential clients, try and get a sale today! You don't need more info telling you how this has to be perfect before launching! Go do it now and be ready to fail, fail and fail again. But you will keep trying and before you know it you will start winning.",
            "score": 8,
            "author": "Mastasef",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I create products using tea. All products are made to order so far. Coming along nicely!",
            "score": 14,
            "author": "BinkyB",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I'm basically an outsourced IT department for small/medium sized businesses. I Work from home, make decent money, get to spend time with my kids.  Not exactly something you can just start doing without experience though.",
            "score": 33,
            "author": "remotefixonline",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yep same here, going remote as software developer was my best idea ever. I am from Europe and now moving to a lower-cost European country, that helps too. ",
                    "score": 16,
                    "author": "socialbod",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Our family makes rice noodles and sell to local restaurants and supermarkets.",
            "score": 29,
            "author": "OnlyKarina",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 15,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I make SAAS sites in small, relatively focused areas. I'm a lawyer by day, so I generally focus on niches related to the legal field. I try to look for areas where a market has been validated, but the existing solution is outdated or not available online. \n\nMy most successful site is a child support calculator for my state. Calculating child support is basically a formula, but it's complicated enough that most people don't want to do it by hand (especially lawyers). Plus, I add in a few features for estimating income tax if the other parent hasn't provided any information. I'm totally self taught, so it's really nothing fancy.\n\nTo be honest, I'm really bad at promoting the sites once they launch. I tend to write some blog articles and then hope that they drive enough traffic to get some customers. But, despite that I made about $20k last year. I spend maybe 2 hours a month responding to emails and help requests, but largely they run themselves. Developing the sites can take me a while, but I enjoy doing it and chalk it up as time spent on my hobby.",
            "score": 8,
            "author": "Fedocks",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I was laid off from my day job last year and used the extra time to teach myself how to code. I eventually found my way developing on platforms like Salesforce, WordPress, and Shopify. \n\nLast August, I signed a unique deal with a particular client. I designed and launched his eCommerce site with little upfront costs, in return for a percentage of his monthly sales. They locked in with my \"company\" (opened a tax-id) for 36 months for updates/maintanence. There's been busy months and slow months, but overall the residual income from $80 worth of udemy classes has definitely paid itself off.\n\nHoping i can find more clients just like them in the future. ",
            "score": 12,
            "author": "calix_xto",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I play in and run a covers band.  It's been growing every year so  I quit my day job 4 years ago to do this full time, which is around 9 hours a week.",
            "score": 26,
            "author": "caleb-crawdad",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 24,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Best post on here in weeks. Great question, great answers. ",
            "score": 25,
            "author": "JoshGreat",
            "replies": []
        },
        {
            "level": 0,
            "comment": "i bought a house for $7k. (it was a good deal but $20-25K is not unusual for this zip code; it's a run down part of a rust-belt city in flyover country.) i usually make $700/mo gross from my 3 roommates, plus it's housing for me and tentatively my boyfriend.\nI'd been paying $425/mo at my last place. \nMy expenses are the utilities, internet, dumpster, taxes, and insurance, so some months i just break even, but I think I am in the process of getting my $7k back. \nThursday I go to an auction of 4 houses, where I don't expect to get any, then next month there's a big county auction where I have a shot at picking up one or two. Bought one there two years ago for $5600 with a partner and he's just now ready to start paying me $400/mo on it. My living expenses are minimal, so this income stream helps cover months like this one where I'm not off at a gig somewhere. I had hoped to have 5 houses by now, so I could stop doing gigs, but there've been some setbacks.",
            "score": 17,
            "author": "arbivark",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 12,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "**I take photos of naked/nearly naked ladies and sell photobooks online.**\n\n\nIt's all digital so there's no real cost involved, other than my time. It's nice waking up and checking how much money you've made while you slept.\n\n\nIf anyone has any questions, just ask :)",
            "score": 29,
            "author": "redonculous",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have a large inventory of photos I can license from my years shooting fashion/model stuff. (I have a good manner with models and they're willing to sign rights agreements at reasonable rates with me.)\n\nI've avoided this sort of business model because I can't see how piracy won't eat me up.\n\nIs piracy an issue? A cost of doing business? \n\nAlso, how many images would say it takes to make a sellable photobook?",
                    "score": 10,
                    "author": "mrpoopistan",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I run Alpinezone.com, a skiing forum and community. It's mostly a lifestyle site and helps me ski for less. \n\nI also help my with run her highly successful Team Beachbody fitness business. \n\nI also run a photography / videography company and also a small web design company. ",
            "score": 6,
            "author": "nreuter",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I write tweets &amp; facebook posts for an assortment of businesses. The easiest side job in the world IMO. ",
            "score": 6,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I tried that and failed to get clients. Care to share some tips?",
                    "score": 3,
                    "author": "Alexandria1970"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I am the creative director and co-owner of a branding agency. We basically do brand renovations for businesses and struggling corporations. We use design, development, and marketing campaigns, as well as some soul searching to make it all work. Last year we made about $500k doing it. \n\nWe also launched an app last year and will be launching a new version this year. Hasn't made money yet, but has attracted some SF VC's, so here to hoping. \n\nWe also rent out extra space in our offices as a co-working environment, aimed at creatives and developers, who end up becoming contractors for us. Cuts rent in half most months. \n\nWe also just launched a lower budget graphic design platform that sells services at flat rates. Waiting to see how that one pans out. Fingers crossed. \n\nIf I had heard about dropshipping earlier I may have been tempted, but t-shirts seem like a an idea out of 2002 to me. Threadless or nothing! ",
            "score": 10,
            "author": "natebitt",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I make $19 an hour selling free horse manure in my spare time. I use only my car, no truck. I only spent $10 to get started. My product is very unique, I don't have any competition. I'm scaling up this year to see how far I can take it. It's nothing that will make you rich in 30 days but it's good money if you're willing to do a little shoveling. I'm writing an ebook that I will be releasing this spring. ManureStartup.com ",
            "score": 36,
            "author": "DavidoftheDoell",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is entrepreneurshit right here, nice work!",
                    "score": 28,
                    "author": "spleenfeast",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ha. Thanks. Or Entremanure.",
                            "score": 10,
                            "author": "DavidoftheDoell"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 16,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 9,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "One of my clients sells online training to college kids, he's making about 700k/mo.  The training is all pre recorded. Spends about 50k/mo on youtube ads to target it.  $20/mo subscription business.  been running strong about 5 years. ",
            "score": 29,
            "author": "drteq",
            "replies": [
                {
                    "level": 1,
                    "comment": "What kind of training may I ask?",
                    "score": 5,
                    "author": "mmishu",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Instagram marketer here. Have 6 fairly large accounts that serve as advertising platforms to companies in a niche industry. Made over $300k in 2016.\n\nEdit: Wow didn't expect this many questions. I'm blown away. I'm thinking I may do an AMA pretty soon here and fully explain the journey!",
            "score": 29,
            "author": "jegzz",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 9,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "You clearly are leaving money on the table by but selling t-shirts at the end of that tour",
                    "score": 16,
                    "author": "blaspheminCapn",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I know a great way he can sell tshirts without ever touching the product!",
                            "score": 13,
                            "author": "Forgetful_username_1",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "My hubby and I own a screen print, embroidery and promotional products shop.  So legit we sell t-shirts!!  \nBut most of business is local, focused on sports and schools.   Lots of investment upfront in equipment (I've been at this since 2004) but it's just he and I working.  Very competitive field.  Very hard to compete against larger shops with bigger equipment/more people.  So we focus on a niche.  We make enough to support ourselves, but not quite enough.  Eventually hubby will have to stop printing or hire a younger person. It's physically hard to print shirts.  \nI'd love to hire sales, grow the business.  Because right now we are word of mouth.  I have great customer service. Deliver on time and never ever surprise anyone with an invoice charge they weren't aware of at beginning.\nSide Note:  Weekly, we get the call/email \"I saw this shirt on Etsy, Teespring, TeeChip, etc. etc  Can you just print me one shirt....for $8\".  No buy it from said site for $15 and quit being a cheap ass.  From me you'll pay about $25 for that one shirt, not including the artwork fee I'm going to charge for recreating someone's funky fiverr text graphic design.\nAggravating.",
            "score": 8,
            "author": "mrscwells",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I run a small IT services company, targeting seniors and creative professionals. We focus on high interaction, customer satisfaction, and  trust. When I saw the kind of treatment seniors and computer illiterates get from Geek Squad and the like, I realized I could provide a much more personal service. One appointment that solves their problem with minimal fuss, no condescension, and lots of patience for their questions earns a loyal client. If you treat clients like family, they love your business. Who woulda thought? :)",
            "score": 7,
            "author": "pixel_juice",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I'm in software engineering. I mostly make money as a dev/consultant and aiming for about 40% margin per month.\n\nThis year will be different as I'll try to market a SaaS and probably hire a salesman to help me with selling one of my product and/or more high rates as a consultant. I also want to hire another dev in June.",
            "score": 15,
            "author": "saznk",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Might be worth asking this over at /r/smallbusiness",
            "score": 48,
            "author": "ncfroglog",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, I mean this IS /r/entrepreneur afterall.",
                    "score": 27,
                    "author": "RossDCurrie",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Don't you mean /r/dropshipping? ;)",
                            "score": 95,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 43,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Group text messaging in the cloud, and text message marketing for business.  Paying the bills now, endeavoring to get bigger!",
            "score": 7,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 8,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "During off hours, I have run service and software company that gives IT departments an easier way to install and manage Firefox.  13 years and still going.  Margin is about 80%-90%, but the market is very very small.  I still have a full time job.",
            "score": 6,
            "author": "DraconPern",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Custom decals/stickers... I bought the equipment as a personal thing and now I'm making an extra $300 a week in side cash...\n\nAlready getting people over at /r/mrrobot asking for stickers 😂\n\nGreat business, costs are extremely low and the profit is through the roof ",
            "score": 6,
            "author": "stbernardy",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I have apps, they are not games that die quickly but utility apps that stay fresh over time. I'm not rich but very comfortable (too comfortable - lazy) and I don't work for anyone else. \n\nI think sudden riches is better, eventually my apps will stop ticking over as iOS falls out of favour, sudden wealth is yours forever.",
            "score": 6,
            "author": "altitudinous",
            "replies": []
        }
    ]
}