{
    "id": "fj4czk",
    "score": 14691,
    "title": "Reselling essentials like toilet paper and water is not entrepreneurial, it is taking advantage of the needy. If this is you, please stop.",
    "author": "an_onanist",
    "date": 1584291305.0,
    "url": "https://www.reddit.com/r/Entrepreneur/comments/fj4czk",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Also, the supply chain of those essentials isn't broken. There is only a manufactured shortage caused by people buying out the stores. Once they can no longer afford to buy out the stores, the shelves will just fill up again leaving people who bought them out with a shit ton of supplies that they won't be able to resell at retail prices.",
            "score": 850,
            "author": "Reverend_James",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 415,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He got served a cease and desist order also, likely fucked. \n\nhttps://m.imgur.com/yIEVCdg",
                            "score": 334,
                            "author": "attemptedcleverness",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hahaha I hope he loses as much money as he thought he’d make",
                                    "score": 190,
                                    "author": "StantonMcBride",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 38,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Somewhere I see that all going to lawyer fees and court costs",
                                                    "score": 13,
                                                    "author": "mwestadt"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Yes but his primary source of income was selling online. If you're banned on Amazon and Ebay, you're done in ecommerce. I hope his 80K was worth losing his ability to make a living. Amazon is especially ruthless when it bans you. You can't just make another account to sell, they have all your financial data and personal info required to start a seller account. Unless you can create another real world identity, you are screwed.",
                                                    "score": 20,
                                                    "author": "U235offthechain",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "But what stops him from opening account of his mother, father, brother?",
                                                            "score": 4,
                                                            "author": "DinoChart",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Amazon has scary efficient AI working to counteract this kind of fraud. Not only will they ban you but bring their legal team in to crush you for trying to circumvent them. In the online game sellers are dust and buyers are gold. This guy probably just got anyone ever connected to him banned. \n\nAlso, there's the state govt that will most likely revoke his business license or corporate charter.",
                                                                    "score": 3,
                                                                    "author": "U235offthechain"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I can't speak for Amazon, but Ebay will figure out who your friends and family are. If they suspect that you are selling through their accounts they will be warned and then banned if it continues. I'd be shocked if Amazon didn't do the same.",
                                                                    "score": 5,
                                                                    "author": "PIchillin456",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 7,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Honestly though, that part seemed fine to me. He bought out the stock of a company going out of biz and resold it. \n\nThe ransacking if every store for Clorox wipes and sanatizers was super shitty though.",
                                                    "score": 17,
                                                    "author": "nopethis",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Agreed. I had no issue with buying up store liquidation supply. I do have an issue with him driving through two states, hitting up dollar stores, and emptying all the shelves so no one else had access",
                                                            "score": 2,
                                                            "author": "unsavvylady"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Yet the AG does nothing when it comes to hospitals charging mothers to hold their newborn children, or $50 for a tylenol, etc.  It's clear who the AG works for.",
                                    "score": 96,
                                    "author": "amiatthetop2",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I went in for a MRI for my shoulder and my insurance denied my prescription for Celebrex $350. I told my doctor about it and he gave me something else and it was $0.82.",
                                            "score": 53,
                                            "author": "treetyoselfcarol",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "If your doc is writing scripts for Celebrex in the first place, instead of the generic equivalent, then he is part of the problem.",
                                                    "score": 48,
                                                    "author": "LiquidCracker",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Nearly all states have a law that pharmacies will attempt to fill a generic equivalent first unless specifically requested by the doctor.",
                                                            "score": 19,
                                                            "author": "ZebZ",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Problem is the doctors get kick backs from drug companies for pushing their stuff.",
                                                                    "score": 3,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[deleted]",
                                                                            "score": 10,
                                                                            "author": "[deleted]",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Honestly prescriptions at all are part of the problem. \n\nI could never get my doctor's to prescribe me anti-parasitic drugs after returning from Europe, and then my insurance lapsed... So I went to PetCo and bought *literally the same chemical*, Praziquantel, for $60 with no prescription; didn't even show ID. \n\nI didn't realize prescriptions restrict access to medicine based on *who it is for* and are not actually related to the chemical itself... \n\nLook it up: does Praziquantel require a prescription? \n\nThen go to PetCo and buy it without one. \n\nWe need to make a law requiring that entities demonstrate a clear, obvious, and real danger of abuse to put medicine behind a prescription pay-wall; otherwise it should be illegal to put barriers between people and medicine.",
                                                            "score": 29,
                                                            "author": "Im_A_Thing",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Same with ivermectin, just buy horse dewormer. I prophylactically take it to prevent bed bug infestations when I stay at hotels.",
                                                                    "score": 8,
                                                                    "author": "fukitol-",
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Yeah ive had to buy antibiotics from pet suppliers more than a few times. I don't have hundreds of bucks to drop just because I got an eye infection and need $20 of antibiotics. The only problem is, 90% of people would probably never bother even looking up what kind of drugs they need and buy and use the wrong shit in the wrong way and wrong amounts.",
                                                                    "score": 13,
                                                                    "author": "IEatBabies",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "&gt;90% of people would probably never bother even looking up what kind of drugs they need and buy and use the wrong shit in the wrong way and wrong amounts.\n\nSo instead we force people to either not get the medications *at all*, or to take medications meant for other animals.... \n\nI swear they should make it a crime to restrict access to a drug for no reason.\n\nEdit: manslaughter.",
                                                                            "score": 7,
                                                                            "author": "Im_A_Thing"
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Well, this explains why I can't buy Kanaplex or any meds for my fish in Canada anymore lol.",
                                                                    "score": 2,
                                                                    "author": "alaskadotpink",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "=O\n\nThat's bullshit we need to repeal prescriptions in general and just have them be sold at the pharmacy after signing a paper or something.",
                                                                            "score": 2,
                                                                            "author": "Im_A_Thing"
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "And you were able to perform the ova and parasite fecal tests and then identify the harmful parasite?",
                                                                    "score": 3,
                                                                    "author": "PLZDNTH8",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "No. I did a multi-panel fecal test and it came back negative, then I was told I'd need to do 3 more of the same tests again because the test is not effective. \n\nMeaning I'd have to freeze jars of feces in my communal freezer 3 more times hmm\n\nNo fuck that. \n\nAlbendazole is a one-time use CURE for tapeworms with basically no side effects. \n\nMebendazole is another one-time cure for parasites in humans with few side-effects. \n\nPraziquantel is *another* one-time-use CURE for intestinal and liver parasites.\n\nI specifically asked my doctors for one of those, and they REFUSED and in the same breath *PRESCRIBED ME ANTIBIOTICS*, and this was after a doctor from the same clinic tried to prescribe me *anti-depressants*.\n\nAnd again, I ended up getting Praziquantel against their wishes at PetCo when it's got an artificial pay-wall (prescription) for humans. Hmmmmmm, it's almost as if Doctors really only care about making money, prescribing drugs they are paid for readily, and advocating tests that don't work for hundreds of dollars readily; but making it illegal for me to get the medications I actually need without going though them, *unless* I go to PetCo and eat a god damn dog chew.... -_-",
                                                                            "score": 13,
                                                                            "author": "Im_A_Thing",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Did you end up expelling parasites? See any in your feces?",
                                                                                    "score": 6,
                                                                                    "author": "averagenutjob",
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "You are the main reason prescriptions exist in the first place. There is a very good reason to restrict access to medicine when people will take it just to feel good, as in your case. Overuse of medicine causes very real harm on a population level.",
                                                                                    "score": 13,
                                                                                    "author": "[deleted]",
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "So you had a multi panel test out of paranoia, it came back negative, and you still went out and bought medicine to try and address your mental anxieties? It’s not surprising the doctor prescribed you anti depressants, was probably trying to stabilize your mood.",
                                                                                    "score": 6,
                                                                                    "author": "Sulluvun",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "My insurance oddly prefers on-brand. I have a regular script for a drug I take daily. Generic is $156, brand name is $9. The insurance you have matters more than anything in US healthcare, and for whatever reason, my insurance negotiated costs for brand name drugs instead of generics",
                                                            "score": 3,
                                                            "author": "thehappyheathen"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "You can damn skippy bet doctors and hospitals are part of the problem. A lot of gall too. John Hopkins published a report that says THE HIGHEST COSTING HEALTHCARE SYSTEM IN THE WORLD KILLS 250,000 TO 400,000 PER YEAR BY ERROR.\n\n3RD LEADING CAUSE OF DEATH IN U.S. AFTER HEART DISEASE AND CANCER IS HEALTHCARE ITSELF.",
                                                            "score": 2,
                                                            "author": "EdofBorg"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "It's easier to hate a person than a faceless corporation. It's the same reason everyone hated Shkreli even though charging extortionate prices for drugs is the pharmaceutical industry's entire business model.",
                                            "score": 25,
                                            "author": "HxisPlrt"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "And they won't until we vote out the status quo ducks who enable this...",
                                            "score": 6,
                                            "author": "shwarma_heaven"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "$1400 per day for a newborn to “visit” the nursery, per day, at a local hospital near me.",
                                            "score": 3,
                                            "author": "Hobodaklown",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah and I mean they literally charge the mother to have skin to skin time.",
                                                    "score": 2,
                                                    "author": "amiatthetop2",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "This is a false equivalency and whataboutery.",
                                            "score": 2,
                                            "author": "StantonMcBride",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Both are wrong.   It is worthy to show the hypocrisy though IMO.  I don't understand the case though how that would be false equivalency.  When you're in an emergency, hospitals have bought up cheap items and will charge up the whazoo for them because they know you're desperate and are going to pay whatever they want, and they are actually worse because they go a step further and don't even tell you the price beforehand unlike a visible price gouger.",
                                                    "score": 3,
                                                    "author": "amiatthetop2",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Shoulda kept their stupid mouths shut and never gave an interview, kept selling and returned most of it to the stores.",
                                    "score": 14,
                                    "author": "TheSportingRooster",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Or just mark them up $1.  Still a hefty profit. \n\nI kind of sympathize with him up to a point since reselling is what I do (commercial and industrial equiptment), but the dude got greedy.",
                                            "score": 2,
                                            "author": "tcpip4lyfe",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Its not the reselling that got them over their skis, its the NYT interview, the mistake is when you give an interview you no longer control your message. His message needed to be, I went to the backwoods and bought these to redistribute to help people and I need to be compensated for gas, time, etc. Not I'm a dopey profiteer who is greedy af because I do this as my job, which is how the author made him look.",
                                                    "score": 2,
                                                    "author": "TheSportingRooster"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I have the biggest justice boner right now. As an aside my phone tried to correct that to Justice Boomer for some reason, which sounds like a really shitty superhero.",
                                    "score": 3,
                                    "author": "MangledMailMan",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;Justice Boomer\n\nI'm picturing the comic, could be pretty funny.",
                                            "score": 2,
                                            "author": "attemptedcleverness"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "That's awesome. Make an example out of him!!!",
                                    "score": 2,
                                    "author": "hannahstrunk"
                                },
                                {
                                    "level": 3,
                                    "comment": "\"please turn over all your possessions... to detective... for examination\".\n\nWTH do they want to examine in his hand sanitizers?",
                                    "score": 2,
                                    "author": "zer0_snot"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "He and his brother are being investigated for price gouging. \n https://www.courier-journal.com/story/news/2020/03/15/coronavirus-price-gouging-men-hoarding-hand-sanitizer-urged-stop/5053519002/",
                            "score": 11,
                            "author": "OldTarheel",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Price gouging is illegal in a lot of states that have a hurricane season. The reason gas isn't $40/gallon all along every highway when you're evacuating from a hurricane is because of this. It was a serious problem in states like Florida and North Carolina in the past, where people would take advantage of evacuees trying to buy necessities like bottled water. I am not sure how common it is nationally, but throughout the Southeast US, it is a crime",
                                    "score": 11,
                                    "author": "thehappyheathen",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I honesty don’t know of any state where price gouging isn’t illegal during a declared emergency.",
                                            "score": 5,
                                            "author": "Abraxas65",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Is that the guy in Tennessee? I remember seeing an article about it. Sounded like a \"woe is me\" piece with a picture of him standing in front of his merch with a frowny face. I couldn't help but think \"aw boo-hoo\"",
                            "score": 24,
                            "author": "mikevega",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Reporter: \"Would you say sorry to all the people who couldn't buy supplies at the stores you cleaned out?\"\n\nPrice Gouger: \"........\"",
                                    "score": 21,
                                    "author": "nysrpatakemyenergy2"
                                },
                                {
                                    "level": 3,
                                    "comment": "I saw that asshole. He probably bought out my area as it was in his path. I just feel it was some sweet justice Karma. Fuck that guy.",
                                    "score": 5,
                                    "author": "toiletnamedcrane"
                                },
                                {
                                    "level": 3,
                                    "comment": "Yeah",
                                    "score": 3,
                                    "author": "Hyperman360"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Lol, and anyone that lives or works near him, his family, everyone knows what a shitty person he is, and I hope that shame carries with him for a few years.",
                            "score": 20,
                            "author": "trackday",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "People like this don't have shame. It's like the guy driving in the emergency lane in heavy traffic thinking he's clever and doesn't understand why everyone doesn't do it.",
                                    "score": 25,
                                    "author": "[deleted]",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "I hope he wakes up one morning and all his hoarded supplies are gone. And by an amazing coincidence local churches and shelters receive donations of the various hygiene products.",
                                    "score": 5,
                                    "author": "Liar_tuck",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That's exactly what happened!",
                                            "score": 2,
                                            "author": "OldHippie",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Wait it did?",
                                                    "score": 2,
                                                    "author": "lieth2486",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yep, state came to his storage unit and seized it all.",
                                                            "score": 3,
                                                            "author": "OldHippie",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "And [this song](https://www.reddit.com/r/videos/comments/fj27u2/my_friend_and_i_wrote_a_song_about_the_man_that/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf) about him appeared on my timeline just above this post.",
                            "score": 9,
                            "author": "zetecvan",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "He got what he deserved",
                            "score": 24,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah an investigation",
                                    "score": 3,
                                    "author": "OldTarheel",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It aslo states he is to turn over all remaining supplies to the AG.",
                                            "score": 7,
                                            "author": "Ttownzfinest",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That's s serious financial hit.",
                                                    "score": 3,
                                                    "author": "OldTarheel",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Amazing how he gave interviews about what he is doing",
                            "score": 4,
                            "author": "redditorium",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "He's also fighting a extradition case to the United States for ecstasy smuggling from what I read.",
                            "score": 6,
                            "author": "B1gWh17",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think he's a Tennessee resident, you might be referring to someone else",
                                    "score": 10,
                                    "author": "Hyperman360",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah the dude I'm talking about is Canadian, he was on the front page yesterday.",
                                            "score": 4,
                                            "author": "B1gWh17"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "He's going to have to go back to the weighted blankets business.....lol...what an asshat.",
                            "score": 2,
                            "author": "bruteski226"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yes! That’s what happened when everyone freaked out about Gas here in Texas. A few days later no one was at the pumps but there filled up again.",
                    "score": 18,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "In theory people will run out of money, however if you live in a wealthy area or within driving distance of a wealthy area, there will be enough people who still have money to deplete supply.  I live in such an area and the store shelves have been empty since Friday.",
                    "score": 6,
                    "author": "EndMeetsEnd",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well even those people will eventually get to a point where they finally realize they don't need more toilet paper. It's not like they're going to keep it buying it until their house overflows.",
                            "score": 9,
                            "author": "iamiamwhoami",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yup. It's hilarious. In a sad way.",
                    "score": 2,
                    "author": "HusbandFatherFriend"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This applies to the pharma execs gouging people who need insulin too.",
            "score": 63,
            "author": "abudabu"
        },
        {
            "level": 0,
            "comment": "It's interesting how a crisis brings both the absolute worst and best from humanity",
            "score": 120,
            "author": "trustdabrain",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's all about [empathy](http://goldenrule.org).\n\nIn times of crisis, some people think of others; and some people think of themselves (actually the second type of people are basically always thinking about themselves, crisis or not - they are called sociopaths and narcissists).",
                    "score": 46,
                    "author": "EGoldenRule",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I love the Golden rule, but I thought you were doing a goof with that website after reading for so many paragraphs describing how you were going to reveal what the Golden rule is. I started skimming to the end because I thought you were never going to reveal it",
                            "score": 2,
                            "author": "BananaDogBed",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "And entrepreneurship, specifically, should be about solving problems.. not creating new ones",
                    "score": 13,
                    "author": "ljschindel",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "You think the hospital won’t give you a 500k bill if you need to stay in the icu for 2 weeks?\n\nThe healthcare system is worse than any dude selling tp for 3 bucks a roll.",
            "score": 12,
            "author": "papahighscore",
            "replies": [
                {
                    "level": 1,
                    "comment": "But I'm supposed to be mad at toilet paper guy",
                    "score": 3,
                    "author": "Jideiki"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Same with medicine. Please stop.",
            "score": 111,
            "author": "f1xxmAn",
            "replies": [
                {
                    "level": 1,
                    "comment": "*All pharmaceuticals awkwardly look at each other*",
                    "score": 104,
                    "author": "Ridikiscali",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is irony :)",
                            "score": 16,
                            "author": "f1xxmAn",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The problem with medicine is even greater.\n\nThe compounds, called APIs, which are essential for most medicine are being produced in China and India. China is currently non operational and India might soon follow suit. Furthermore, India has already stopped exporting certain APIs ([https://www.in-pharmatechnologist.com/Article/2020/03/03/India-stops-export-of-certain-APIs](https://www.in-pharmatechnologist.com/Article/2020/03/03/India-stops-export-of-certain-APIs)), meaning that it is impossible to produce the medicine, which is based on those APIs.",
                    "score": 13,
                    "author": "MagesticPlight1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes, I know. I've listened to the beginning of the recent Joe Rogan's podcast where he had a discussion with infectionist. That's terrible.",
                            "score": 5,
                            "author": "f1xxmAn"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's price gouging. \n\nAnd it's illegal\n\nhttps://legaldictionary.net/price-gouging/\n\n#Here is what happens if you're caught: https://www.reddit.com/r/JusticeServed/comments/fj8uxs/greedy_man_has_his_hoard_of_hand_sanitizer/?utm_medium=android_app&amp;utm_source=share",
            "score": 133,
            "author": "ukiyuh",
            "replies": [
                {
                    "level": 1,
                    "comment": "Honest question, who/what defines what an unfair price is?",
                    "score": 12,
                    "author": "Finaglers",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m wondering this myself. It seems you can flip real estate for way more than it’s worth and stick it to the buyer and/or renter... but try it on hand sanitizer and you get crucified.",
                            "score": 9,
                            "author": "godofgainz",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think (i am not positive) the issue is that it’s during a time that has been declared a state of emergency. I THINK if it wasnt declared a state of emergency, they could legally resell all the hand sanitizer and toilet paper they want. (Though it would still be morally questionable, just not illegal).",
                                    "score": 4,
                                    "author": "princesspeach722",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Under normal circumstances, you'd be trying to convince people to pay 20x the price of toilet paper.\n\nPrice gouging can only exist inside a monopoly, and that's what's been created here.",
                                            "score": 6,
                                            "author": "Hunterbunter",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "So lets say the price gouging was happening during the week prior to the national emergency being declared. Still during the time when people were hunting down toilet paper. Was it illegal to price gouge at that time since it was not officially declared a national emergency?",
                                                    "score": 3,
                                                    "author": "princesspeach722",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 31,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think new state declarations of emergency that are being made cover this use case, now.\n\nOnly a few states so far. Many more incoming.",
                            "score": 11,
                            "author": "GaryARefuge"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Just like insulin",
                    "score": 8,
                    "author": "woodandsnow"
                },
                {
                    "level": 1,
                    "comment": "Amazon is tracking down price gouging.",
                    "score": 2,
                    "author": "Iamdumblikeyou",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Price gouging is illegal for LLC’s and corporations to do. Doesn’t apply to the secondary market. Market value is fickle because of perceived value, otherwise secondary value on things like Supreme clothing would be price gouging. \n\nIt’s a shit thing to do but not illegal for this context",
                    "score": 8,
                    "author": "ItsGettinBreesy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is incorrect. Many states have anti-price gouging statutes that implicate anyone involved in the supply-chain process, *including resellers*. Doesn't matter if they're a company or not. \n\nThere was a good thread on this elsewhere, I'll see if I can find it.\n\nAs to why reselling designer clothes at a large markup isn't gouging: it's not in unethical territory. Those are luxury items, no one needs to buy a Supreme hoodie, but they do need medical supplies during a crisis.",
                            "score": 42,
                            "author": "Allen4083",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This also applies to when a state declares a state of emergency. In my state the Attorney General's office is encouraging people to notify them.",
                                    "score": 15,
                                    "author": "[deleted]"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Toilet paper, PPE, hand sanitizer, etc arent equivalent to Supreme clothing though?",
                            "score": 5,
                            "author": "ukiyuh",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "In some countries, like Japan, this is illegal and you might go for 1 year to prison.\n\nEdit: here's an article regarding this\n\n [https://www.japantimes.co.jp/news/2020/03/10/national/japan-punish-reselling-face-masks/](https://www.japantimes.co.jp/news/2020/03/10/national/japan-punish-reselling-face-masks/)",
            "score": 29,
            "author": "my_phosphenes",
            "replies": [
                {
                    "level": 1,
                    "comment": "In time of hurricanes, the Florida law prevents companies feonprice gauging and limit certain items to a person. \n\nWhy in the world is it so hard to implement national wide, idk. Even if president went on national tv and said “yo we great America, please share, great bussiness I ask you to please implement volunteer limit on toilet paper.”",
                    "score": 4,
                    "author": "Ruski_FL",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Agreed",
            "score": 34,
            "author": "justdan7",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same with diapers and baby food! Please stop",
                    "score": 33,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I went out to get baby wipes yesterday and was lucky to find some.  Diapers seem in stock still though",
                            "score": 5,
                            "author": "LemonHerb",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My wife had to run out to get some wipes and formula for our 1 y/o yesterday (just looking for a normal amount to hold us over a few weeks). She saw an extremely pregnant woman there trying to stock up and my wife made sure the woman got one of the two remaining packs of wipes. I can't imagine those who are close to giving birth at this time, it's already stressful enough.",
                                    "score": 5,
                                    "author": "jackospades88",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 3,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Those that do it with diapers and baby food can go fuck themselves. That’s babies you’re fucking with.",
                            "score": 33,
                            "author": "pforsbergfan9",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "This ! It’s insane ... :(",
                            "score": 5,
                            "author": "worldoff"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hot take: maybe this *is* entreprenurial, and the fact that it's hurting people is reflective of the larger issues with optimizing for financial success alone. Corporations will not hesitate to destabilize entire countries if it makes them a quick buck (See: United Fruit Company), a direct consequence of assigning great social power only to those with the most capital.\n\nNext to that, jacking up TP prices is small potatoes. It's certainly not ethical, but I don't think we can pull a 'No True Scotsman' and say that capitalizing on this crisis is fundamentally distinct from \"real\" entrepreneur practice.",
            "score": 14,
            "author": "Thunderstarer",
            "replies": [
                {
                    "level": 1,
                    "comment": "I agree with this completely. I was going to comment the same thing until I found yours. This is absolutely entrepreneurial; seeing a demand and satisfying it. It isn't ethical and it isn't nice, but neither is jacking up the price of Insulin because you're Martin Shkreli and you want more money. Welcome to America folks, land of the self-made man, whatever it takes.",
                    "score": 2,
                    "author": "TheBigRedWan"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I agree it's crisis profiteering, but what is the difference between an individual selling you a bandaid for $10 and a hospital in the USA charging you $10?",
            "score": 27,
            "author": "Mm2k",
            "replies": [
                {
                    "level": 1,
                    "comment": "One has lobbyists.",
                    "score": 18,
                    "author": "Cyrix2k"
                },
                {
                    "level": 1,
                    "comment": "My best guess is people feel apathetic toward to big guys because they know they're powerless against titans. Whereas that Colvin guy is just a guy, we can go egg his house. So it's easier to hate him. Also, his bullshit is more simple and easy to understand.",
                    "score": 9,
                    "author": "Mobely",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If every story about how healthcare companies screwed customers over, was accompanied by a picture of the CEO of that company, things might change.\n\nEven powerful people who seem to get away with things can be held accountable if there's enough pressure.  Look at Jeffrey Epstein.",
                            "score": 2,
                            "author": "EGoldenRule"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "No difference, and that is why our health system is so screwed up: someone is making $9.93 profit.",
                    "score": 25,
                    "author": "an_onanist",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "\"How is this any different from any other shitty, horribly broken and immoral system?\"",
                    "score": 4,
                    "author": "SoInsightful"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 16,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "It’s called profiteering, and it’s been despised for a long time and in many counties illegal.",
            "score": 4,
            "author": "Mrkvica16",
            "replies": [
                {
                    "level": 1,
                    "comment": "In America if someone becomes a billionaire from it, they get to deliver a keynote and have the petit-bourgeois defend their actions because they \"took the risk\"",
                    "score": 10,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I honestly don't understand how toilet paper is essential under the context of a pandemic.",
            "score": 4,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "If you’re stuck indoors for a while, you need all the toilet paper you can get.",
                    "score": 2,
                    "author": "Weather53",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "IMO this is just a more relatable snapshot of the way our economy currently works. We can hate it because we can see that person as one of our own who is taking advantage of a system. \n\nWhat about monopolies on communications?\n\nhyperinflation of medicines\n\ncorruption in government contracts\n\nlobbyists \n\nI'm not prepared at this moment to give more examples, although I know there are many. Our system works this way - if you think you can get away with it you do it. We are just quicker to jump on those who seem to be just like us but gaming the system.",
            "score": 28,
            "author": "organicfreerangetim",
            "replies": [
                {
                    "level": 1,
                    "comment": "Exactly, where is all this butthurt when capitalism does it every other day?",
                    "score": 6,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I'm not sure what the point you're making is?   There are definitely problems we have to deal with but just because some entities can get away with it, doesn't mean it's right.  This just means we have more work to do.",
                    "score": 2,
                    "author": "EGoldenRule"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's predatory, I have zero sympathy for any that do this and find harm upon them.",
            "score": 18,
            "author": "Scizmz",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 7,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Mods: Can we sticky this????!",
            "score": 21,
            "author": "roostershoes",
            "replies": [
                {
                    "level": 1,
                    "comment": "There's no point. The people who are doing it don't read reddit, especially not this subreddit.",
                    "score": 8,
                    "author": "cosmicr",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Plenty of people in this thread defending them.",
                            "score": 6,
                            "author": "AwGe3zeRick"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Isn’t it capitalism to a T. You want it, I have it you have the choice to pay my asking price. \n\nI don’t agree with this practice but  this is what we have in our country.  I do agree it’s not entrepreneurial.",
            "score": 28,
            "author": "Golddog1",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I agree with you wholeheartedly, but you cannot hold this opinion while also thinking what Nestle does is ok. I feel about this the way I felt about Martin Shkreli. It is a reflection of our attitudes under capitalism where money is more important than humanity. Do not be mad at the symptom, be mad at the disease. How could someone be angry at Martin Shkrelli when what he did was no different than what every other pharmaceutical company does? You can go to Cuba and buy an inhaler for pennies! you can go to Canada and prescription drugs are cheap as well! Why does the USA jack up the prices of things and call it business?\n\nWhat I fail to understand, how is price gouging different than retail arbitrage? Is it because it is a \"need?\" in that case, why do we not have universal healthcare? Why do we not have UBI? \n\nIf the banks and business owners are allowed to be corrupt, why does it stop short of the people? \n\nI want to make it clear I am not defending price gouging, but instead I am posing the bigger question which is why do we not question the status quo which is just as corrupt as what you're discussing?",
            "score": 9,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 9,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "He did quite the opposite",
                    "score": 4,
                    "author": "SmithRune735"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don't support it all. But by definition, it IS entrepreneurial. There are million and billion dollar businesses operating exactly like this that many of you applaud year round.\n\nAnd you only care about THIS example because YOU feel personally threatened by this crisis and thus care about people exploiting it.\n\nWhen this is over, you are going to go right back to supporting this behavior when it harms people you don't care about.",
            "score": 6,
            "author": "ohhimaark",
            "replies": []
        },
        {
            "level": 0,
            "comment": "What about epi pens?  Is that acceptable?  How about asthma enhalers or chemo??  What about groceries and housing?  Where is this moral line that we speak of?  Or is it only relevant if you're poor and doing it?  Cause then it's trashy?",
            "score": 9,
            "author": "ebotfu",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Unless it's Christmas time, then buy up all the hot toys and make big money fuck the poor kids",
            "score": 3,
            "author": "Thenameimusingtoday",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Keep that same energy when thinking about your for profit health insurance.",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Wall Street does it for decades, no one cares.\n\nAmericans do it to Americans everyone cares",
            "score": 3,
            "author": "Noratek"
        },
        {
            "level": 0,
            "comment": "Since when is entrepreneurship not tagging advantage of another person's inability to do something? Amoral entrepreneurship is still entrepreneurship.",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Isn’t this the practice of commerce; find a cheap service or product and sell it at a profit. A gas station can sell single bottles of water for $1.50-2.00, but for $3 more you can buy 24-34 bottles of the same water. We just assume it’s an okay price for that single bottle because we don’t know better. Price gauging is and always will be a way of life. \nWith that said, I have 3, 1oz bottles of purell hand sanitizer going for $250 each or 12 rolls of 3 ply toilet paper.",
            "score": 3,
            "author": "Gundam_Greg",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Can someone give me karma so i can post?",
            "score": 3,
            "author": "Winning_Walrus"
        },
        {
            "level": 0,
            "comment": "Isn’t this what wealthy people do with commodities like precious metals and oil when global markets tumble?  Seems like Joe from “wherever the fuck” USA is doing the same just on a smaller scale.",
            "score": 9,
            "author": "drunken-teacher",
            "replies": [
                {
                    "level": 1,
                    "comment": "Except precious metals are a few steps removed from life-saving medicine or Lysol. It’s not the same",
                    "score": 6,
                    "author": "roostershoes",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Concept is exactly the same and commodities like oil are essential.  I’m just pointing out the hypocrisy of letting people that have expendable capital during a crisis benefit from a vulnerable market and then being pissed at small time Joe for trying to capitalize in a market that he can afford.  \n\nAre you pissed at the people dumping extra money into the stock market right now?   They are going to profit off of thousands of people selling off their 401k’s in a falling market?  It’s exactly the same concept.  Some people are going to profit off the fear of others.  Why are we pissed at the guy making a few grand off of toilet paper and not other making millions.  That’s all I’m trying to say here.",
                            "score": 1,
                            "author": "drunken-teacher",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It’s similar yes, but I still think those are secondary and removed somewhat from the main discussion here. At some point it’s no longer an economics question and becomes a moral one.. You can make money doing all sorts of illegal and immoral stuff... it doesn’t mean you should.",
                                    "score": 3,
                                    "author": "roostershoes",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"taking advantage of the needy\" also know as exploiting consumers demands? Don't get me wrong, \n\nI find inmoral what these people are doing but there are worse cases of companies abusing the needs/addictions (coca cola, McDonalds, e c.) and we accept them in our everyday life.",
            "score": 10,
            "author": "apol0",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Arbitrage at the cost of public health and safety is not admirable in the least.",
            "score": 2,
            "author": "GnarlsSharklee"
        },
        {
            "level": 0,
            "comment": "🤔 If you own a business and have the proper licensing for it. I do not care what you sell or how you go about it as long as it’s legal. Ethics are not apart of capitalism and if you believe they are, you’re going to have a hard time in business.",
            "score": 2,
            "author": "Toanimeornot",
            "replies": []
        },
        {
            "level": 0,
            "comment": "“If this is you please stop” oh and you’re scum.",
            "score": 4,
            "author": "Jesus1959"
        },
        {
            "level": 0,
            "comment": "Lol false. Just because it seems grimey dosnt mean it is not entrepreneurial. If that was the case 75% or more of all corporations are not 'entrepreneurial'. Maybe stop voting for the Trump's and bidens of the world. \n\nThese people out here pulling themselves up by their bootstraps and people getting mad, this is capitalism for the poor, this isnt the 1% you don't got a social saftey net.\n\nLol capitalists crying about capitalism. Well prob 'capitalist' who own zero capital.",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "It's the same thing under capitalism, honestly. The only goal is make money and more money, by whatever means necessary. Big corporate does it by corrupting government, weakening protections, and turning you into just another cheap-to-free tool. Smaller dudes do it by squeezing in whatever they can take advantage of.\n\nBluster and bellow all we want, shame and scorn all we can, it will always happen so long as meaningful regulation, control and consequence do not exist.",
            "score": 5,
            "author": "guineaprince",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Stores actually need to ration and price gouge to prevent hoarding. Stores themselves can prevent this. Higher prices in grocery stores lower the incentive to buy and resell to the desperate masses. Rations mean more people can access and people are prevented to act like monkeys.  \n\n\nIt's up to the businesses to actually do something about this. Individuals will always act in their best interest. If you can get TP for say $5 at the store, and sell it for $15 on the black market, this will ALWAYS happen no matter how many cries in reddit we see.   \n\n\nIf stores RAISED prices, to say $11-12, this cuts WAY down on the hoarders and resellers. It's simple economics that gets complicated with knee-jerk emotional reactions.",
            "score": 9,
            "author": "plentyoffishes",
            "replies": [
                {
                    "level": 1,
                    "comment": "And then poor people get fucked once again and makes things worse. Price gouging is not a solution, it is literally taking the problem, repackaging it, and selling it off as a solution to the same problem.",
                    "score": 7,
                    "author": "IEatBabies",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No they don't. Poor people get fucked when they can't access what they need, which is what the current system gives us- empty shelves.",
                            "score": 4,
                            "author": "plentyoffishes",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I agree we really need to come together and help each other, our future is going to be tough einough.",
            "score": 2,
            "author": "worttito"
        },
        {
            "level": 0,
            "comment": "Likely the State of Emergency being declared makes reselling this stuff a crime during the soe.",
            "score": 2,
            "author": "HomeHeatingTips"
        },
        {
            "level": 0,
            "comment": "assuming water is running and it should, toilet paper is not worth stocking in such quantities Soap is. So do the maths, water+soap.",
            "score": 2,
            "author": "GloomyNectarine2"
        },
        {
            "level": 0,
            "comment": "Interestingly enough, this is another example of [the tragedy of the commons](https://en.wikipedia.org/wiki/Tragedy_of_the_commons).\n\nThis is a basic sociological/economical/psychological construct that everybody should be familiar with.\n\nIt's one the primary reasons why we have government/regulation.  If people were left to their own devices, they don't always act in the best interests of their community, and therefore need to be policed.",
            "score": 2,
            "author": "EGoldenRule",
            "replies": []
        },
        {
            "level": 0,
            "comment": "The funny thing is the healthcare system does the same thing but it’s ok when they do it...",
            "score": 2,
            "author": "28majidy"
        },
        {
            "level": 0,
            "comment": "Oh so just like the entire medical system in the U.S.  Got it.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "BUT IMMA HUSTLER BABY!",
            "score": 2,
            "author": "ZeroGh0st24"
        },
        {
            "level": 0,
            "comment": "It is 100% entrepreneurial. STFU.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I hope someone sees this post because I want to put a little something positive in this context.\n\nAn old lady in my neighborhood went to the dollar store and got a bunch of those cheap fake Tupperware containers. She mixed up a big batch of 2/3 rubbing alcohol and one third hand lotion. She folded paper towels and put them in the containers. She then poured in some of the alcohol / lotion mix. She put the lids on and sold them over the weekend on a little folding card table outside her house for $2 each. it didn't actually work great because the hand lotion kind of curdled up like sour milk and didn't mix well with the alcohol but they were still disinfecting hand wipes and the lotion still moisturize your alcohol dried out hands.",
            "score": 2,
            "author": "Cheeseand0nions"
        },
        {
            "level": 0,
            "comment": "Agree good for saying it",
            "score": 2,
            "author": "sAvage_hAm"
        },
        {
            "level": 0,
            "comment": "If you do that, you're what belongs on the toilet paper",
            "score": 2,
            "author": "colepower1996"
        },
        {
            "level": 0,
            "comment": "Please don't educate me with Community College Econ 101.  Price gouging due to panic buying is not going to inspire anyone to break ground on a new TP factory because smart people know this is not a price you can count on receiving in the future.  This is not a \"rational, maximizing market demand\" this is panic fueled wannabe-entrepreneurship that is more akin to warlords confiscating Red Cross relief supplies than the basic supply and demand economic framework.",
            "score": 4,
            "author": "Fark_ID"
        },
        {
            "level": 0,
            "comment": "It's almost like relying on the profit motive to provide basic goods and services is inherently unethical.",
            "score": 4,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Why cant people just use water? Its much more hygienic to use water to clean yourselves.",
            "score": 3,
            "author": "beatpoxer",
            "replies": [
                {
                    "level": 1,
                    "comment": "I saw these bumguns in Thailand but the whole time I was trying to figure out, once you butt was washed clean - how do you dry it?",
                    "score": 3,
                    "author": "nowyuseeme",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "By their actions people who hoard toilet paper are just reinforcing the fact that they are the shittiest people.",
            "score": 3,
            "author": "Blarty97"
        },
        {
            "level": 0,
            "comment": "Toilet paper isn’t essential though.",
            "score": 4,
            "author": "thatsyikers",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I think hoarders are the real issue though. It’s easy to point out a few stories of people trying to sell something in short supply for a lot money, but the reason it’s in short supply is because of all the people hoarding it. Doesn’t make the guy selling it better, just make everyone who is running out buying up the supply equally bad.",
            "score": 2,
            "author": "benobos",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Everyone in here trying to rationalize predatory behaviour.   \n\n\n**If you can't make money without having to exploit someone/ something, you're not an Entrepreneur you're an idiot who stubbed his toe on a gold nugget.**   \n\n\nSource : One of my teachers at my EMBA course.",
            "score": 6,
            "author": "CodeDinosaur",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Entrepreneurship and capitalism at its worst. 🤢",
            "score": 6,
            "author": "Pullupjump48",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I can mostly agree with this, unless it's a disaster stricken area that you're bringing goods into ***and*** those goods are ***not*** being sourced from within that same area.\n\nIn this situation, people are panicking everywhere. There is no \"not affected\" area for what's going on right now.\n\nBut, if you're buying goods in Oklahoma to bring to the hurricane-stricken coast of, say, Texas where people have to drive far out of the area to get essentials (if they can get out at all), I don't have a big issue with it. In that situation, it's not the resellers that have created the shortage. There's a legitimate supply problem that needs to be solved and the ability to resell is a good way to encourage people to bring in those supplies from outside those affected areas.\n\nBuying up all the supplies in an adversely affected area to resell them in the ***same*** area makes you an asshole. You artificially created a shortage of necessary goods to profit. Driving in items from hundreds of miles away and helping relieve a legitimate shortage in the adversely affected area is a different thing.\n\nBuying items during a nationwide panic up so you can resell them on Amazon, eBay, or any other online platform also makes you an asshole.",
            "score": 3,
            "author": "pennymakesdollars",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Agreed. I am not a saint at all, I'm the kind of guy who would usually at least consider flipping shit that is sold out (you know, like Graphics cards when the mining craze drove prices up), but there has to be a line somewhere and flipping potentially lifesaving supplies is definitely way beyond it",
            "score": 3,
            "author": "ThegamingZerii"
        },
        {
            "level": 0,
            "comment": "Imagine thinking hoarding and profiteering is entrepreneurial",
            "score": 2,
            "author": "kaldrazidrim"
        },
        {
            "level": 0,
            "comment": "This is not exactly true.  It depends on many circumstances, which makes this post a blanket condemnation because it considers none of them.  \n\nIf I sell a 48 pack of TP less than a store would charge for 6 rolls (price per roll), than I am actually solving a problem and adding value. \n\nIt's just the ignorant people that see TP for sale and flag  the ad on Facebook that are truly the problem. They have just interrupted me helping someone, while supplying them with what they need, \n\nIt's the knee-jerk reactions of the overly emotional, who can't calmly read a post without irrationally having a tantrum, that are getting in the way of a business with ethics, helping a consumer.  Some may be exploiting people but others may not. But they assume all people selling TP are exploiting people.  Much like the poster of this thread did.  He felt it was his duty to come to the entrepreneur thread to lecture people selling items in high demand, and admonish them for selling items in high demand.  It is this kind or irrational thinking that is fueling fear and affecting economic markets.  Perhaps these are the people that should stay silent, and let the buyer decide for himself if he wants to purchase the item, or wait.   Meanwhile, I'll sell a 48 pack of TP for less than a store charges for 6 roll (price per roll) all day long, if people would stop interfering with me providing a product to those in need.  Now sit down.",
            "score": 2,
            "author": "porkboat"
        },
        {
            "level": 0,
            "comment": "I ran out of toilet paper at my house and there is none anywhere in my city. What a shitty situation to be in.",
            "score": 2,
            "author": "MrOneironaut",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I had to let my anger out since I spent hours going to stores to find medicine for my daughter.  I reported everyone I saw on Craigslist and OfferUp.  Looks like a number of them were removed too.",
            "score": 2,
            "author": "tge101"
        },
        {
            "level": 0,
            "comment": "You’re a fucking retard. \n\nIt is quite literally entrepreneurial. \n\n100% of interactions across the entire world work exactly like this. Buy in-demand product where available and where cost is less than what one can sell elsewhere, and then sell in that other market for more.\n\nMorals are an entirely different discussion. You could argue (and I would agree) that it is immoral and a shitty thing to do. \n\nHowever, you cannot rightfully say it is not entrepreneurial- that’s stupid.",
            "score": 2,
            "author": "CriminalSugar"
        },
        {
            "level": 0,
            "comment": "While I agree what this person is doing is wrong - this is the basis of American Capitalism. Epi-pens charge $600 for an epipen that costs them less then $10 to make. \n\nMartin Shkreli bought the manufacturing rights for Daraprim a pill used by HIV/AIDS patients and raised the price from $13/pill to $750/pill. \n\nMany industries in America take advantage of the poor and receive little to no backlash (even business'like payday loans are well understood to be very predatory).\n\nI am not saying any of them are right, I am just wondering why one man in Tennessee is deserving of this vitriol but not any of the rest of american capitalism that uses the same basic principles.",
            "score": 2,
            "author": "random-short-guy"
        },
        {
            "level": 0,
            "comment": "Amen",
            "score": 3,
            "author": "notlikethat1"
        },
        {
            "level": 0,
            "comment": "Highway robbery is what it is...",
            "score": 1,
            "author": "crimsonparasaur"
        },
        {
            "level": 0,
            "comment": "If you have excess and want to distribute it to those in need, give it away for free if you can. Some people really fucking suck.",
            "score": 2,
            "author": "MAIN-WAV-EE"
        },
        {
            "level": 0,
            "comment": "Same with test kits and, ultimately, vaccines.",
            "score": 1,
            "author": "Suolucidir"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s not.",
                    "score": 1,
                    "author": "miparasito"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I completely agree.",
            "score": 1,
            "author": "lytton7"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "If you do this is called price gauge\nAnd it is punishable by law.\n\nAt my country first time is 5k euro ticket second time you have to close of activity for 6months. This is for business, individuals without a LLC its even worst lol.",
            "score": 1,
            "author": "gerandi"
        }
    ]
}