{
    "id": "i54bi0",
    "score": 2300,
    "title": "I hate Linkedin gurus with a passion",
    "author": "Past_Sir",
    "date": 1596762282.0,
    "url": "https://www.reddit.com/r/Entrepreneur/comments/i54bi0",
    "media_urls": [],
    "other_urls": [],
    "postText": "For the following reasons:\n\n1) overly positive and upbeat all the damn time\n\n2) emotionally exploitative posts like \"2008. I was living in a rundown apartment after my parents abandoned me due to my alcoholism...\" \n\n3) cringey statuses like \"Reinventing Finance 1% at a time | Extraordinary Husband | Trailblazer in the Kitchen | Apptrepreneur\"\n\n4) \"if you don't come out of this quarantine with a new skill or job, you are WASTING this opportunity!\" during a time of record unemployment \n\n5) shameless, absolutely shameless self-promotion \n\n6) People who leave their jobs and write 5 paragraphs thanking everyone and anyone at their last company for being their best friends, close family, donated a kidney, etc. If it was truly that great, why are you leaving?\n\n7) \"HUSTLE AND GET THAT $$\"\n\n8) Posts about exercising and working out in the gym. How is this even business related?\n\n9) PASSIVE INCOME. GENERATE CASH FLOW! INVEST IN REAL ESTATE! Poster has zero real estate experience and does not have any investing credentials.\n\n10) **none of them are actually rich, successful, or have any proven track record** yet they seek so much attention\n\n11) Pointless platitudes that are marketed as courageous but in reality are just common sense. \"You should be paid what you are worth at your company\". 20,000 upvotes. No shit. \n\n12) Inspirational posts about how Mark Zuckerberg and Jeff Bezos once started off as not rich. Now, they are rich. Conveniently leaves out both of them were already incredibly successful and extraordinary people by the time they started their respective ventures. \n\n13) \"HERE'S HOW YOU BECOME A MILLIONAIRE: Sell a product for $100,000 ten times. How do you sell a product for $100,000? Create something that is worth $100,000.\" Wow, why didn't I think of that?\n\n14) Posts about waking up at 4:30 AM to \"get shit done\". No. That's what my day is for. \n\n15) First statement. New line. Second statement. New line. Third statement. New line...\n\nThe proliferation of social media marketing has reached a boiling point where consumers are inundated with annoying \"hustlers\" who peddle subpar products and misleading advice. It's useless at best and outright deceitful at worst. On average, it's become incredibly annoying.\n\nEdit: Will update list if I think of anything else.",
    "comments": [
        {
            "level": 0,
            "comment": " Which one of you Linkedin Guru's reported this? \n\n&gt;**USER REPORTS**  \n&gt;  \n&gt;1: It's promoting hate based on identity or vulnerability",
            "score": 1,
            "author": "FITGuard",
            "replies": []
        },
        {
            "level": 0,
            "comment": "If someone called themselves a guru.  Chances are they are not a guru",
            "score": 249,
            "author": "leaklikeasiv",
            "replies": [
                {
                    "level": 1,
                    "comment": "“Being powerful is like being a lady. If you have to tell people you are. You aren’t”\nFavorite quote of margeret thatcher (that I’m not a big fan of) that I often think about in situations like this one.",
                    "score": 104,
                    "author": "fersk",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Reminds me of the Tywin quote\n&gt;      Any man who must say, \"I am the King\", is no true king.",
                            "score": 62,
                            "author": "gay-pirate-assassin",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Or if they say they are a very stable genius.",
                                    "score": 19,
                                    "author": "blinkk5",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Good quote.",
                            "score": 6,
                            "author": "oftcenter"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Except if they are a robe wearing bearded man in India. Still not 100% sure he's a guru, but it's a start.",
                    "score": 10,
                    "author": "gliturr",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No they are not, 100%. :o)",
                            "score": 6,
                            "author": "theaashes"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The problem with LinkedIn is, it is a platform where you gain social cred by proving you know what you're talking about. So literally everyone talks like an expert - even a 21-year-old intern. \n\nAbsolutely hate LinkedIn",
            "score": 165,
            "author": "yeah_but___why",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wow, you nailed a really good point. \n\nI always read through a lot of career wisdom posts then I realize it was written by some 20 year old who just had his first internship. Then I start getting irrationally angry.",
                    "score": 64,
                    "author": "Past_Sir",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think how intelligent the person is weighs far more important then how old they are.\n\nI find that particularly stupid people who get old tend to have what I call \"one year of experience 30 times over\"\n\nBasically they \"got by\" for 30 years and now think of themselves as a bastion of wisdom. When in reality a particularly intelligent 20 year old would probably be more competent and more worth listening to.\n\nMind you this doesn't mean I'm saying \"listen to the 20 year old over the 50 year old\" it means that look at how competent and intelligent they are first and foremost, regardless of how old they are.\n\n\nTL;DR if you spend 30 years being an idiot, you simply have 30 years of experience at being an idiot.",
                            "score": 22,
                            "author": "CommonReview",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I used to respect people with “many years of experience.” Doing the same thing 20 times over, as you said, is just lazy. Learn something new. Put yourself out there. Take on new projects. I respect what people have done, not how much “experience” they have.",
                                    "score": 5,
                                    "author": "alexkeoni",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "There's nothing irrational about that anger.",
                            "score": 7,
                            "author": "clyde2003"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "There also the expectation of \"professionalism\", which means no one is even slightly critical of anything anyone says. Whenever you do see someone call-out the bullshit, you'll see a bunch of people tell them it's \"unprofessional\".",
                    "score": 19,
                    "author": "chillintheforest",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The ability to take criticism constructively is a skill many people lack. \n\nInversely the ability to give constructive criticism is also lacking in so many people.",
                            "score": 12,
                            "author": "fattpuss",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "see that's the thing, I don't directly get all the \"crap\" content that everyone here seems to complain about. Rather I see that \"random recruiter that added me likes ____\" and that content is the garbage that the people here seem to complain about.",
                    "score": 3,
                    "author": "Rymasq",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Toxic Productivity I like to call this..",
            "score": 458,
            "author": "Kierooonn",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 130,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I am about ready to hire a social media manager to blowhard my linkedin. I'm too busy working hard (and getting paid) to bother with it but I want to improve my image and recognition in my industry as I may go independent.",
                            "score": 37,
                            "author": "ConsultoBot",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Nobody gives a shit about LinkedIn my guy.\n\nA perfect example is a guy named Josh Braun. Dude tries to make sales videos and is so fucking terrible. \n\nNobody actually takes it seriously.",
                                    "score": 18,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I don’t think it’s the worst. It’s a tool that needs to be used properly.\n\nJust don’t connect with toxic productivity individuals. I’ve gotten many leads and made many connections by cold messaging on LinkedIn and one of my profs at E-Cornell (yes lol right here) saw one of my articles I’d written over project management and gave me feedback accordingly.\n\nI’ve also been able to stay in contact with other professionals in my field to see some emerging trends, contact speakers, etc which otherwise would have been really difficult for me to do.",
                                            "score": 7,
                                            "author": "Gh0stw0lf",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I'm doing an eCornell certificate right now too, it's been super positive for me. Thanks for your suggestions about how to leverage LinkedIn, which has always seemed pretty challenging to me.",
                                                    "score": 2,
                                                    "author": "msadvn"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "When I worked in software sales, I followe him and used his tactics and actually paid for his course and was happy with his material.\n\nWe are in an entrepreneur forum, who cares if anonymous people on the internet don’t like you or take you seriously.\n\nStop worrying about what other people think and are doing.\n\nSure some it is annoying but some of it is great information by smart people, I guess you can either be cynical and care about what your peers and boss (who likely would replace you if they could ) think, or just do you",
                                            "score": 4,
                                            "author": "Quality_Digital",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yep, as long as people have found value in someone else's product, power to them. To hate on their hustle is super misguided considering the fact that entrepreneurship and sales in general require a lot of hustling.",
                                                    "score": 3,
                                                    "author": "doog_good"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I feel unless they are running a scam or promoting illegal tactics, there's really no need to call out anyone by name as they are really just trying to hustle. It's no different than anyone else on here hustling doing outreach, improving social media presence, cold calling etc.",
                                            "score": 3,
                                            "author": "doog_good"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "They don't. They use tools to give them consistent posting all day, so they stay in the feeds of anyone who checks at any given time.",
                            "score": 21,
                            "author": "thedancingpanda",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Can confirm this. Schedule posts on a weekly or bi weekly basis depending on articles I can come up with or share.",
                                    "score": 12,
                                    "author": "Xalistro"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You should trademark that, this explains perfectly what it is!",
                    "score": 7,
                    "author": "netherlanddwarf"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You had me at \"I hate linkedin\"",
            "score": 62,
            "author": "theabstractengineer"
        },
        {
            "level": 0,
            "comment": "Yeah it’s the dumbest shit I’ve ever seen.\n\nAgree or disagree?\n\nQuick edit: I used to roast the crap out of these guys on LinkedIn cause I hate when people act pompous or just say horseshit, but then my buddy told me it looks unprofessional which I agree with (esp as I was looking to switch jobs.\n\nOh and just to dig my hole deeper - I get that this is an entrepreneurial sub, but if you’re like 23 and brag about being the CEO of your one person company that isn’t even legally incorporated and is financed by a “friends and family” round while dispensing advice via nonsensical stories about celebrity CEOs...no what time you wake up doesn’t mean shit, idgaf that some celebrity ceo wakes up at 4am to take a leak and workout, some days I/people work past 4, everyone’s got a different routine",
            "score": 173,
            "author": "GummyBearFighter",
            "replies": [
                {
                    "level": 1,
                    "comment": "Comment if you agree, like if you disagree.",
                    "score": 24,
                    "author": "amawesome1"
                },
                {
                    "level": 1,
                    "comment": "I love watching people roast LinkedIn posters. Professional? No. Funny as hell? Yes. \n\nA couple of weeks ago someone made one of those faux deep motivational posts and a commenter replied “if you want to be a thought leader it would be useful if you had an actual thought more insightful than vague platitudes”",
                    "score": 27,
                    "author": "breakingb0b",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "One of my customers is active on linkedin and every few days I can see him comment on posts saying \"This is for facebook\"\n\nI wouldn't comment stuff like that because it's a little too snarky but I love seeing him do it.",
                            "score": 17,
                            "author": "DantesEdmond",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm considering registering a fake linkedin just so i cab do that",
                                    "score": 3,
                                    "author": "bigclivedotcom",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Or those “like if you want to become a millionaire” posts.",
                    "score": 9,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "Haha, ass.",
                    "score": 10,
                    "author": "GaryARefuge"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You mean posts like: \n\n“I did it! Everyone told me I wouldn’t! My 2nd grade teacher called me an idiot in front of the class because I couldn’t tie my shoe.\n\nToday I am the proud owner of a business that brings in millions of dollars. I did it with my BLOOD, SWEAT, and TEARS!!! If you want to have a successful business you HAVE to bleed, sweat, and cry! \n\nChampions who have taken my program know that I am successful because they are successful now too! Send me a DM if you want to stop crying and want to start #winning.” \n\nOr even worse, all the coding posts... as a programmer I legitimately cringe at these posts. \n\n“I code for 5 hours everyday. I completely ignore my family just to code. \n\nNothing good comes to those who don’t sacrifice their lives for coding skills. \n\nI would be nothing without programming. You can be something if you code like me too. Buy my book, the 100 page success today.”\n\nFor a while, I actually posted helpful content on linkedin. I shared resources and advice on how to improve one’s professional career. My likes and views never reached what the “gurus” got so I gave up. People like fake and dramatic. You want lots of views, start your post with the following:\n\n“I was suicidal and had nothing left...” \n\n“Everyone told me I was a failure...” \n\n“I didn’t have it easy as I was raised as a *minority entry here*....”\n\n“My parents abandoned me when I was 5...”\n\n“From drug addict to millionaire...” \n\n^Instantly millions of views and people messaging you begging to be your “mentee.”",
            "score": 92,
            "author": "Zavoyevatel",
            "replies": [
                {
                    "level": 1,
                    "comment": "Most of these gurus who endlessly preach and talk about coding has never coded anything in their entire life.",
                    "score": 18,
                    "author": "Past_Sir"
                },
                {
                    "level": 1,
                    "comment": "I know all those coding posts come from people very insecure about their abilities so I ignore them\n\nIt's a very amateurish thing to think that pure coding skills is what will get you a successful product\n\nI work as a SWE and coding is maybe 15-20% of my time in z good week\n\nMost of the time I'll be working on documents, requirements, reviews, architecture, client discussions and so on, I'm a pretty good coder so when I know what I need I can implement it pretty fast, but again coding itself is mostly an afterthought",
                    "score": 19,
                    "author": "RoburexButBetter",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Gary Vee is the worst. I can’t stand the circle jerk around him.",
            "score": 119,
            "author": "Chazman199",
            "replies": [
                {
                    "level": 1,
                    "comment": "“I shocked you by saying ‘fuck’, now buy my shitty info products funded by the company I inherited.”",
                    "score": 52,
                    "author": "RUFiO006",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I liked him in the beginning, but after a while it's like listening to Shia Laboeuf's \"Just do it!\" on repeat\n\nAlso his \"just post a video on tik tok every 15 minutes and your business will become successful\"-attitude really lacks actual indepth business strategie",
                            "score": 42,
                            "author": "JessiSexy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I like how he called Mark Zuckerberg “Zucks” as if he was his college room mate and helped build facebook 😂😂😂😂",
                                    "score": 30,
                                    "author": "BILLTHETHRILL17",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Guy told JRE that he will not let his daughter win in basketball if they play. Because hes a fing lunatic!! Go jets",
                    "score": 10,
                    "author": "BILLTHETHRILL17"
                },
                {
                    "level": 1,
                    "comment": "This guy is always showing up in my feed and I always wonder if he actually works or just spends his days talking in those videos.",
                    "score": 7,
                    "author": "cwsnakes",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I actually follow him because he’s so outrageously selling common sense as secret texts. It’s hilarious! His true believers are all like “he sees me, he gets my genius, finally I’m understood”...",
                    "score": 3,
                    "author": "Trumpy675"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’ve stopped opening LinkedIn for this very reason, what a waste of time",
            "score": 85,
            "author": "TemporaryData",
            "replies": [
                {
                    "level": 1,
                    "comment": "Linkedin is actually a great resource if you are extremely strict on your connections. I only accept people within my industry or people I know IRL. Otherwise shitposts build up fast!\n\nIt’s easy enough to cull the shit too, just head into your network and delete anyone you don’t know or don’t give a shit about.\n\nThere’s a lot of good industry knowledge being posted on the site and I find it excellent for getting in touch when I can’t get a phone number or email.",
                    "score": 19,
                    "author": "cooliokid",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ya, I was initially skeptical but I have found it very useful for specific things, like keeping track of people as they move to different companies.  As you say, there is a lot of knowledge on there, but you have to keep on top of your list.  More is not better.  I cull the list every now and then and I never accept people without a photo.",
                            "score": 5,
                            "author": "ScoobyDone"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's still really good if you like to read bullshit stories.",
                    "score": 32,
                    "author": "landmanpgh",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I know someone who is building themselves up as some sort of brand or guru on LinkedIn, in particular. I have yet to figure out what they are selling or what their speciality is.  They write stories on self publishing platforms and their catch phrase is they “invent leaders”. I have no words.",
                            "score": 12,
                            "author": "cerebral__flatulence",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's it. I'm becoming an \"anti-guru\" guru on LinkedIn and my catch phrase will be \"invert leaders\". It will mostly be about how people need to shut the fuck up and get back to work.",
                                    "score": 7,
                                    "author": "clyde2003",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ah, yes the \"Hustle\" niche, where every post is about waking up at 5 AM and \"just doing it.\" And \"make it happen\" and \"discipline is more important than motivation\". And \"actions speak louder than words\" and \"leaders lead from the front lines and in the trenches\". \n\n\nGot just as much fluffy bullshit in that niche too :)",
                                            "score": 3,
                                            "author": "effyochicken",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Sure, but I've got Reddit for that.\n\nIf I'm on LinkedIn, I'm looking to understand the lay of the land in terms of career trajectories, available jobs, what people in my network are up to, etc. \n\nFor every one of those forced, awkward, canned rags-to-nowhere-near-riches-but-imma-tell-you-anyway stories clogging up my feed, I could be reading a tactical how-to guide for a specific problem I'm trying to solve written by someone who ACTUALLY solved it. Or a post offering some insight into a particular niche or field I want to know more about. \n\nIn other words, I'm on there to be self-centered and consume content that will benefit me. Not content written for the purposes of self-aggrandizement or virtue signaling.\n\nAm I wrong here? Wouldn't content like that be more useful to us average Joes (and Josephines)?",
                            "score": 8,
                            "author": "oftcenter",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Completely agreed. You wouldn't want to see Quora's self-claimed-gurus, they are much worse than both Reddit and LinkedIn since no one actually knows who are they and what they do.\nI also hate how LinkedIn sorts by relevance on your homepage, I keep unfollowing people who like these stuff but there's no end. So personally, I gave up on finding useful content there.",
                                    "score": 7,
                                    "author": "dangooopa",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Quora died when it became mainstream, there's people posting the same stories with pictures that don't even relate to their answer to make a point that is irrelevant to the question to make them look humble or wholesome or some shit.",
                                            "score": 3,
                                            "author": "machine_soul"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Linkedin for me is a place where people message me to try to sell my company their shitty SAAS product, primarily.",
                    "score": 5,
                    "author": "ncurry18"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The doers are normally not posting on LinkedIn.",
            "score": 16,
            "author": "reefsurfah",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I‘ve an account there but never use the feed. It feels like watching ads.",
            "score": 14,
            "author": "Accomplished_Ad_8814"
        },
        {
            "level": 0,
            "comment": "They do it because it works.  \n\n\nWhether people find it cringy or motivational, It doesn't change the fact that many of them would stop to just read the guru's bio...\n\nIt's just that we're not their target audience...\n\n  \n“Get rich quick” people who just started are...\n\nBut yeah, That's the dumbest thing I see on the internet...\n\nEspecially on Instagram...",
            "score": 13,
            "author": "rtesh_01",
            "replies": [
                {
                    "level": 1,
                    "comment": "Instagram is definitely much, much worse. Next to the booty pics are inspirational posts about building your side business. Mixed messages for sure.",
                    "score": 10,
                    "author": "Past_Sir",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Honestly Instagram is probably my favorite social network. The \"stories\" get some garbage posts, but your \"feed\" is only the accounts you chose to see (no \"shared\" posts). If you're seeing bullshit posts, that's your own fault. Just unfollow them.\n\nIf you follow the booty, you get the booty. If you follow the guru, you get the guru.",
                            "score": 3,
                            "author": "chillintheforest",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Am guilty of following the booty",
                                    "score": 3,
                                    "author": "Past_Sir"
                                },
                                {
                                    "level": 3,
                                    "comment": "Yeah I agree. I love Instagram because I like the idea of simply sharing quick photos to show what's going on in my life, as well as my friends' lives, and even getting a \"behind the scenes\" look at some of my favorite celebs. But once you go to the Explore page... holy shit it gets toxic quick.",
                                    "score": 3,
                                    "author": "Sketch_Crush"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Commenting for better reach.",
            "score": 28,
            "author": "Ridsidious",
            "replies": [
                {
                    "level": 1,
                    "comment": "Commenting on this comment for better reach.",
                    "score": 14,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Adding interactions here",
                            "score": 5,
                            "author": "CaptMartelo"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Never feel any difference between LinkedIn and Quora these days. \n\nFull of these type of shits",
            "score": 11,
            "author": "dev2049",
            "replies": [
                {
                    "level": 1,
                    "comment": "Really interesting you bring up Quora. I used to come to Quora for some really good industry advice.\n\nThen the motivational bloggers came in by the droves to write about how to become rich and how to maximize your potential and the whole damn site went to trash.",
                    "score": 5,
                    "author": "Past_Sir",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Quora was great at first when it was focused on history, science, and engineering, and then devolved rather rapidly when opinionated questions took over, or things you can find with a simple google/ddg request. \n\nSame problems that afflicted Yahoo Answers in a way.",
                            "score": 7,
                            "author": "petersuffolk"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Please add people who describe themselves as “serial entrepreneurs” and “Angel investors”",
            "score": 14,
            "author": "jonnyjuk",
            "replies": []
        },
        {
            "level": 0,
            "comment": "The thing is, they do it because it works.",
            "score": 38,
            "author": "swedishfishes",
            "replies": [
                {
                    "level": 1,
                    "comment": "Does it, though? I’m not at all saying you are wrong, but I have to question whether this works for promotions, landing new / better roles, etc... I can’t imagine looking at a user’s LinkedIn profile as described by OP and saying “wow this is the person I want to hire” as a result of all of this. If anything, I’d probably steer clear of them even more.",
                    "score": 20,
                    "author": "ParalyzeTheAnalysis",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They’re getting something out of it, that’s for sure.",
                            "score": 7,
                            "author": "Sophisticated_Sloth",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Dopamine and delusions of grandeur?",
                                    "score": 12,
                                    "author": "chillintheforest"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It 100% works.\n\nI have friends who do this in the b2b sales space. They're getting \\~30,000 impressions per day from their posts on avg and make good money without much direct effort to monetize their base.\n\nBUT, that's not really the point.\n\nThey charge $1,000-2,000/hr for consulting with series a,b,c startup founders with 10 hour monthly minimums. You only need a few clients at that point to make good money.\n\nTheir fanbase and the $29 product they sell is just icing on the cake to the real value they get from building a following: valuable connections and great consulting gigs which in turn gives them more experience, more to talk about... it's a feedback loop that prints money.",
                            "score": 14,
                            "author": "cunth",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Damn I gotta say I'm very jealous, that sounds like an amazing way to get into the consulting space to start making some serious cash. I'm always on the lookout for how I can get started on taking my life back from the 9-5 grind that's only ever going to allow me to subsist in life. \n\nI would even be happy with a sales job where I could make six figures, that would get me to where I need to be in life. I'm just trying to survive out here, it seems so challenging with bills that can pile up if I went without income for a month, healthcare costs skyrocketing, and everything else going on it's just very discouraging.\n\nI am not even sure where to start with skills that could help me crack into the startup space, or entrepreneurship. I have a B.S. in Biochemistry, I've worked with a few small technology start-up projects, and I have been involved in entrepreneurship in certain ways, mostly in college. There were some avenues to pursue small grants for funding, maybe I should look there again. \n\nThen again, I just don't have any ideas these days, my brain feels like mush half the time and I just want to turn my brain OFF, not put it into fifth gear to grind 100 hours of week on a passion project. I simply don't HAVE passion anymore, it's not something that I have now, and I don't foresee I'll ever have it again.",
                                    "score": 6,
                                    "author": "jametron2014",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "There’s a reason you’re here and not there. You’re a bit smarter than their would be target audience",
                            "score": 17,
                            "author": "skatenox"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Honestly, that type of \"promotion\" might work in a \"communications\" field but for anyone who works in a field with some type of learned hard skill it just looks dumb as f\\*\\*\\*",
                    "score": 7,
                    "author": "CrossroadnKC"
                },
                {
                    "level": 1,
                    "comment": "Correct they understand massive hype is all advertising is, and that actually sells almost no matter what your product or service is. They understand people want to be sold a feeling. That's all they're doing.\n\n\"Story, Example, Tell (“SET” Framework): The goal of your entire message is to relate to\nyour specific target audience on an emotional level by telling your Story. After this you provide\nExamples of the benefits you found from the solution being offered… followed by Telling the\naudience the reason to buy and of course to click purchase.\nOnce you understand the SET framework, you’ll see it everywhere. Get rich websites always\nhave a story of a guy who was broke and in debt (targeting masses) and muscle building websites\nalways go with the “I was skinny or I was fat” followed by the story and current look. This is\nhow it should be done, and our framework is easy to remember.\nIf you stick to the basic SET framework, you can then layer in more complex items and other\nsales tactics you’ve learned along the way\"",
                    "score": 10,
                    "author": "Quantum_Pineapple",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I know a joke of a guy that sells LinkedIn profile acceleration courses.",
            "score": 8,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Don't forget these cringe worthy posts made by gurus: \n\nSome self righteous story about the plight of job hunters/unemployed individuals --&gt; point out major systemic flaws in hiring/recruiting --&gt; proceed to make some profound statement about how to change the system --&gt; proceed to have a circlejerk in the comments praising how much of a saint the guru is.",
            "score": 7,
            "author": "GD_ChE",
            "replies": [
                {
                    "level": 1,
                    "comment": "Then they develop an app because of the broken process which does literally the exact same thing as previous apps that they called broken, just with more Javascript this time.",
                    "score": 5,
                    "author": "amawesome1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's all straight up bullshit, how they get thousands of people to like and comment is beyond me. One of the many reasons (maybe the main one?) that I can't stand LinkedIn",
            "score": 7,
            "author": "amawesome1"
        },
        {
            "level": 0,
            "comment": "13. Incoming \\[Insert Prestigious Company\\] \\[Job Title\\] \n\n14. Ex \\[Insert Prestigious Company\\]",
            "score": 7,
            "author": "sunstah",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Twitter is fucking full of this kinda bullshit which they call money twitter. Everyone is waking at 4 doing meditation then eating some fucking carbs doing intermittent fasting and banking $30,000 per month selling how to guides on gumroad. \n\nI want a moment of truth.",
            "score": 7,
            "author": "JohnyGuns",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Reminds me of another post regarding Facebook positive affirmation posts you see over and over from the person you went to high school with who has never held down a job for more than 6 months. \n\nRemember, it’s never the successful people posting this shit because they are ACTUALLY working.",
            "score": 14,
            "author": "red-eee"
        },
        {
            "level": 0,
            "comment": "Yeah, I personally saw them as cringe oversocial wanna-be person.",
            "score": 6,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I couldn't agree more. This podcast with the founder of @bestoflinkedin mocks these  \"Linkedinfluencers\". JR hilariously details all of these moronic behaviors including the self-congratulatory \"LinkedIn Lions\". https://podcasts.apple.com/us/podcast/interview-jr-hickey-creator-bestoflinkedin-plus-finale/id1510862515?i=1000479770031",
            "score": 6,
            "author": "elbobcat"
        },
        {
            "level": 0,
            "comment": "It‘a called toxic positivity.",
            "score": 5,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Amen to that, I deleted my LinkedIn account because I couldn’t stand seeing so much of this crap, people who never did anything in their life selling a book on how to be successful filled with advice like “wake up early” “be organised” “save money” and all the brainless sheeple on linkedin saying “oh thank you so much you changed my life I would never have thought about this on my own”",
            "score": 5,
            "author": "LondonNoodles"
        },
        {
            "level": 0,
            "comment": "What about spam on private message? I get more and more of these. People creating fake profiles that seem real at first sight, but after you accept them, they ask you to subscribe to their service. I f*cking hate LinkedIn",
            "score": 6,
            "author": "Huvaz"
        },
        {
            "level": 0,
            "comment": "I hear you.  But let me flip this around.  If someone is genuinely selling a useful product, course or coaching, is authentic, and knows their stuff, how should they promote it?  \n\nWhat would get your attention without being spammy and annoying.",
            "score": 15,
            "author": "shiroboi",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;is authentic\n\nA lot of what OP is complaining about is a distinct lack of authenticity/sincerity.  It's like the old writer's maxim to show the scene rather than tell your readers what it is.  You can't tell people you are authentic.  You have to show them that you are.\n\nIn other words it's the complete opposite of trying to use snappy buzzwords and clickbait techniques.",
                    "score": 26,
                    "author": "grumpyGrampus",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Authenticity is probably the difference between what I'll buy and what I won't buy. Good point.",
                            "score": 6,
                            "author": "Past_Sir"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Same question. Was looking for a job. Did a bit of a self promotion. I hated myself for doing that.",
                    "score": 3,
                    "author": "sifanjai",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "The crux of my post is that none of these people are authentic and none of them know their stuff. \n\nFor example, despite his social media fame, I'm not at all annoyed by Graham Stephan on YouTube. Whatever he's doing, he's doing it right.\n\nedit: I haven't bought anything from Graham Stephan, he's just an example of someone who seems to be authentic and authoritative in his knowledge.\n\nedit 2: FWIW by comparison, Grant Cardone gives off such a powerful, sleazy sales vibe that I wouldn't trust him at all. Take it as you will.",
                    "score": 9,
                    "author": "Past_Sir",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I have enjoyed significant business success on LinkedIn by providing quality and cutting through the crap.\n\nThere's junk on Twitter, there's junk on Reddit and there's junk on Instagram. I don't let it bother me.",
                    "score": 3,
                    "author": "may0man",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm glad that's working for you then.  Keep sticking to quality",
                            "score": 2,
                            "author": "shiroboi"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Calling yourself a guru is for poo people",
            "score": 5,
            "author": "doot_doot",
            "replies": [
                {
                    "level": 1,
                    "comment": "The poo poo guru.",
                    "score": 2,
                    "author": "Pb_and_drums"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s shitposting for ad revenue",
            "score": 5,
            "author": "steppenwolf_23"
        },
        {
            "level": 0,
            "comment": "Don’t see a comment talking about long term consequences. The loudest people in the room are not necessarily the most talented. Yet, LinkedIn is actively becoming a decision maker in choosing the loudest people in getting the most job opportunities. Soon we will be stuck with “Leaders” who cannot walk the talk. They will hop from company to company while they preach on LinkedIn and retire rich, leaving behind someone else to clean up the mess.",
            "score": 4,
            "author": "raring2go"
        },
        {
            "level": 0,
            "comment": "HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE HUSTLE",
            "score": 4,
            "author": "MrBalint",
            "replies": [
                {
                    "level": 1,
                    "comment": "RISE AND GRIND (I want to kms) RISE AND GRIND (I want to kms) RISE AND GRIND (I want to kms) RISE AND GRIND (I want to kms) RISE AND GRIND (I want to kms) RISE AND GRIND (I want to kms) RISE AND GRIND (I want to kms) RISE AND GRIND (I want to kms) RISE AND GRIND (I want to kms) RISE AND GRIND (I want to kms) RISE AND GRIND (I want to kms) RISE AND GRIND (I want to kms) RISE AND GRIND (I want to kms) RISE AND GRIND (I want to kms)",
                    "score": 4,
                    "author": "Mulark_gro-Krognak"
                },
                {
                    "level": 1,
                    "comment": "You forgot HUSTLE",
                    "score": 3,
                    "author": "worldalpha_com"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I once saw a very funny and accurate description of LinkedIn: 30-50 year olds posting quotes for 16 year olds. \n\nDamn, how I hate to scroll that platform! The business world can be so fake sometimes.",
            "score": 3,
            "author": "sompel8"
        },
        {
            "level": 0,
            "comment": "I use my LinkedIn like I use my Facebook. Rarely, and with distaste.",
            "score": 4,
            "author": "steeled3",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 5,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "That's pure narcissism. \n\nUse of manipulation, lack of empathy, lack of shame, belief that they are superior to everyone, excessive need for attention and admiration.\n\nThat's just pure narcissism, there is no other reason.",
            "score": 3,
            "author": "Alfred1400"
        },
        {
            "level": 0,
            "comment": "You forgot to add the list of \"masterclass\" or \"mastermind seminars\" . \n\nLol to add to your #10. They need your purchases and follows to get them the $$$$. Selling empty promises",
            "score": 4,
            "author": "solariscalls"
        },
        {
            "level": 0,
            "comment": "The best thing about your post here is that now I realize I am not alone!! So glad! \n\nI have come to absolutely hate LinkedIn because of these jargon-filled, unverifiable, motivation-filled, happy-ending hey-I did-great-so-follow-me-I-am-great, virtue-signaling, if-you-don’t-share-or-like-you’re-not-empathetic, toxically positive posts. They are purest garbage. It’s like Instagram’s body negativity for Professionals. Make everyone else feel like Luddite.\n\nA friend once asked me why I am not active on LinkedIn. I told him this, and I got a mouthful of how I was not “networking“ and how it will hurt me. I trudged along until I had enough. I don’t know anyone who has benefited from LinkedIn. Got a job or got a sale. Maybe you know? Finally, quit it, and log in only when I am looking for a job, I treat just like any other job-site.",
            "score": 5,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I really hate to step in to LinkedIn nowadays, it's the worst media out there.",
            "score": 3,
            "author": "neopsych"
        },
        {
            "level": 0,
            "comment": "Aren't they similar to the youtube motivational speakers, who don't seem to be following their own advice?",
            "score": 3,
            "author": "abj_bpi"
        },
        {
            "level": 0,
            "comment": "It’s Facebook with fancy suits. So much cringe.",
            "score": 3,
            "author": "Deeyennay"
        },
        {
            "level": 0,
            "comment": "You will love this: “Guys with “Entrepreneur” in their bio” https://youtu.be/MhTDp5FwfmM",
            "score": 3,
            "author": "Er_Coues"
        },
        {
            "level": 0,
            "comment": "There's a saying that's been around for ages..  it's called \"Fake it till you make it\". We've all heard it and unfortunately it fucking works. People eat the shit up.  That guru is absolutely not posting that shit for other people in their field, they are posting it for attention in hopes of getting their next paycheck.",
            "score": 3,
            "author": "a_little_obscene"
        },
        {
            "level": 0,
            "comment": "This is what I’m trying to do man:\n\n- Write down goals\n- Follow them the best I can\n- Ignore anything that does not benefit my goals\n\nIt’s that simple. Steer the course. Ignore what others say and promote if it doesn’t benefit you. Success has ups and down, but it’s very linear of you steer the course and focus instead of listening to the phonies.",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I want to post this to my LinkedIn timeline so bad!",
            "score": 3,
            "author": "andstayoutt",
            "replies": [
                {
                    "level": 1,
                    "comment": "haha do it!",
                    "score": 2,
                    "author": "Past_Sir"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This toxicity is all over Instagram as well. I feel for the young people constantly bombarded by this, not a healthy environment to be in during your teenage years.",
            "score": 3,
            "author": "hoodbeats"
        },
        {
            "level": 0,
            "comment": "YES. And 99% of them are making all their money off of giving shitty guru advice, not excelling at the actual thing they claim to be experts at. That shtick only works so many times... right??? (To be fair I'm mostly talking about IG/FB... I didn't actually realize people used LinkedIn like a social media platform! I always think of it as an interactive resume kinda thing)",
            "score": 3,
            "author": "omglia"
        },
        {
            "level": 0,
            "comment": "&gt;The proliferation of social media marketing has reached a boiling point where consumers are inundated with annoying \"hustlers\" who peddle subpar products and misleading advice. It's useless at best and outright deceitful at worst. On average, it's become incredibly annoying.\n\nYou also have to blame the naive people who perpetuate these shitters by buying into the hype.",
            "score": 3,
            "author": "Amn1225"
        },
        {
            "level": 0,
            "comment": "I saw someone with “upcoming LinkedIn influencer” in their Bio the other day.  Like WTF is that?",
            "score": 3,
            "author": "SufficientTower"
        },
        {
            "level": 0,
            "comment": "This is absolutely true, poeple on LinkedIn always act  like that are bunch of unappreciated geniuses. Duuuuuuude there is only one unappreciated genius in history and it's Nikola Tesla.",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I never knew that anyone  hated linkedin as much as I did. I'm so happy to have found a home here",
            "score": 3,
            "author": "8TJL"
        },
        {
            "level": 0,
            "comment": "Unfortunate for those entrepreneurs heading down the digital marketing route - youtube ads are so quickly dismissed as \"guru\" ads due to the alarming popularity of this niche. Hopefully we can spread awareness of the fake gurus to the broader starry-eyed masses out there!",
            "score": 3,
            "author": "AstralConsulting"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 15,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "There is definitely a political bias on Linkedin. Either you agree or your livelihood is at stake. Absolutely ridiculous. \n\nI've worked in tech for years now and I have never seen a woman being denied opportunity. If anything, these lonely engineers absolutely **adore** women",
                    "score": 11,
                    "author": "Past_Sir",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "As a woman in tech, I've seen it and experienced it personally, way too many times. But I've rarely had a problem with engineers. It's usually shitty business bros who take credit for your work and step on everyone around them so they can maintain their positions of power.",
                            "score": 12,
                            "author": "treeunit",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You make a good point. I was speaking solely from my experience with IT and engineers. I don't interact much with business units.\n\nFor what it's worth, those business bros are assholes to everyone. They treat us like shit.",
                                    "score": 6,
                                    "author": "Past_Sir"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;if you don't come out of this quarantine with a new skill or job, you are WASTING this opportunity!\n\nI mean, I know what you are saying, but I honestly agree with this. I know a lot of people who spent their entire covid binging netflix and wasting away when they could be doing a lot of self improvement or working on ideas.\n\ncovid quarantine has a huge negative mental health impact on people that thrive on structure, routine, deadlines, and pressure. When that is all gone, they don't know what to do.\n\nMany people need external motivation to get out of funks.\n\n(working out is an incredibly important part of mental health and motivation too, people forget how to do that without a gym routine).",
            "score": 12,
            "author": "boon4376",
            "replies": [
                {
                    "level": 1,
                    "comment": "My point was that even during a global pandemic where health and safety should be your first issue, you have these posts endlessly preaching about the grind and learning new skills.",
                    "score": 8,
                    "author": "Past_Sir",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Its because everyone is always so focused on achieving",
                            "score": 2,
                            "author": "Rj17141"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "But also it’s a fucking tough time for everyone. If you getting through the day involves watching Netflix and boozing from midday. That’s ok. If you want to start a side hustle get fit and read 10 books, that’s also ok.",
                    "score": 9,
                    "author": "Chazman199",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don't know how people like that are so shameless. So many sites are inundated with this type of rhetoric and it's amazing to me that they can profit from perpetuating it. Only until people realize that it isn't that easy and not to buy into their BS it will not go away.",
            "score": 2,
            "author": "Jewleeee"
        },
        {
            "level": 0,
            "comment": "I believe they do this to compensate te lack of ANY hard skills.",
            "score": 2,
            "author": "robsanna",
            "replies": []
        },
        {
            "level": 0,
            "comment": "LinkedIn is the Facebook, trash content.",
            "score": 2,
            "author": "Thelettersender"
        },
        {
            "level": 0,
            "comment": "Wow, you hit the nail on the head with this.",
            "score": 2,
            "author": "techno_queen"
        },
        {
            "level": 0,
            "comment": "Haha this would be a great LinkedIn post if you just added a few motivational thoughts at the end about how you survived 2008 and love your job.",
            "score": 2,
            "author": "smk3509"
        },
        {
            "level": 0,
            "comment": "Every single one of these points is 100% facts",
            "score": 2,
            "author": "Chemical_Belt2581"
        },
        {
            "level": 0,
            "comment": "*A job is an activity you do because you get paid for it and wouldn't do otherwise.*",
            "score": 2,
            "author": "mtriad"
        },
        {
            "level": 0,
            "comment": "I love it tho.   \nNever been so easy to weed out who I want to hire or work with.",
            "score": 2,
            "author": "mtriad"
        },
        {
            "level": 0,
            "comment": "This is all entrepreneurship gurus I've ever seen except the angry ones. Reddit is plastered with them.",
            "score": 2,
            "author": "notlikelyevil"
        },
        {
            "level": 0,
            "comment": "Thanks for articulating my own thoughts, I have been waiting for years. Also the articles.",
            "score": 2,
            "author": "Daimakai"
        },
        {
            "level": 0,
            "comment": "I wonder whether it's because people tend to share values rather than practical information.",
            "score": 2,
            "author": "tearsofacompoundeye"
        },
        {
            "level": 0,
            "comment": "The worst thing about all of is that people actually fall for that shit",
            "score": 2,
            "author": "fitnesssnap247"
        },
        {
            "level": 0,
            "comment": "It is easy for people to be business gurus and pretentiously rich on LinkedIn. I know so many entrepreneurs who put up unnecessarily positive, complicated, and unnecessary posts. I have started severing connections with such people if they have not added any penny to my business or network.  \n\nAnd there is a new breed who are now sharing memes on LinkedIn.",
            "score": 2,
            "author": "hrishi_comet"
        },
        {
            "level": 0,
            "comment": "\"But all this hustling has made me able to own my dream car, a Lamborghini!\" 🤮",
            "score": 2,
            "author": "sketchybutter"
        },
        {
            "level": 0,
            "comment": "I agree! That said, the regular folks on there have always been helpful when I randomly inquire about changing career fields. Messages and introductory phone calls with mid level employees has really helped me steer clear of career changes that wouldn’t be a good fit.",
            "score": 2,
            "author": "TurnandBurn_172"
        },
        {
            "level": 0,
            "comment": "Agreed. These kind of posts show up all the time on my home feed not because im following them, but because a lot of my connections react to them. I think more people these days are capable of smelling bs of someone trying to exaggerate their whole story/point.",
            "score": 2,
            "author": "baderocks2"
        },
        {
            "level": 0,
            "comment": "Most posts pander for comments for reach, from those who comment so more will see their posts that pander for comments for reach…\n\nFun little circle going on there.\n\nMeanwhile, meaningful connections are being formed by grown-ups using these products for what they’re for: actually connecting with people.",
            "score": 2,
            "author": "adamfairhead"
        },
        {
            "level": 0,
            "comment": "You forgot some important gurus who try to recruit you for an international job if you comment on their post. Or the ones who promise to review your cv if you comment on their post, like dude are you really going to review 10K cvs?",
            "score": 2,
            "author": "i_am_exception"
        },
        {
            "level": 0,
            "comment": "The fact we know they exist means they succeeded.",
            "score": 2,
            "author": "StempleCoffee"
        },
        {
            "level": 0,
            "comment": "Yes this is stupid, but you know what? There are a people who believe in that so they can sell something to that people and this is how it works. They gather audience of people who would like to change their lives but they don't have time/willingness to do it so they just buying this shit from such person. \n\nI also done such thing one than more time, and I notices this actually works. Thanks to that today I got clients, and I could leave my 9-5 job.",
            "score": 2,
            "author": "kubelke"
        },
        {
            "level": 0,
            "comment": "Number 2 and 6! This is so bad I literally unfollow and delete ppl that out their manifestos about leaving the company LOL. Oh, Im sure you can thanks 20 ppl but lets just save it. You were fired!!!",
            "score": 2,
            "author": "BILLTHETHRILL17"
        },
        {
            "level": 0,
            "comment": "People that say “team work makes the dream work” should be stuffed down a well.",
            "score": 2,
            "author": "BILLTHETHRILL17",
            "replies": [
                {
                    "level": 1,
                    "comment": "the people who say that are typically either the most useless group member or an incompetent manager",
                    "score": 2,
                    "author": "Past_Sir",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "LinkedIn is total bullshit these days.   \n\n\nWhen it was new, I got a assignment worth north of $150k from it that put my agency on a completely new trajectory. Just from being on the platform and having a good profile.   \n\n\nThis was 7 years ago.   \n\n\n\"Sales\" since then? **0**  \nIdentical reqs from people wanting to \"expand their network = offer their services\"? Too fucking many.",
            "score": 2,
            "author": "aabergkvist",
            "replies": []
        },
        {
            "level": 0,
            "comment": "You should post this in LinkedIn haha. I'm thinking about it but I'm not very confrontational.",
            "score": 2,
            "author": "Saruvat",
            "replies": [
                {
                    "level": 1,
                    "comment": "Feel free to do it once you summon the courage :p",
                    "score": 2,
                    "author": "Past_Sir"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I hate LinkedIn with a passion",
            "score": 2,
            "author": "Michqooa"
        },
        {
            "level": 0,
            "comment": "You summed up LinkedIn perfectly",
            "score": 2,
            "author": "calidelphia1228"
        },
        {
            "level": 0,
            "comment": "It’s a dumpster f*ck on there.  The way they write they sound like they’re in a cult drinking the kool-aid lol",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Number 10 is the biggest issue of all. It nullifies their actions.",
            "score": 2,
            "author": "darcwonn"
        },
        {
            "level": 0,
            "comment": "Clown society such cringe",
            "score": 2,
            "author": "tartoola"
        },
        {
            "level": 0,
            "comment": "This post is gold! So true.",
            "score": 2,
            "author": "abacabbmk"
        },
        {
            "level": 0,
            "comment": "Thanks I needed this. Just recently started my own website and was researching on how to promote my posts. One article said LinkedIn this, LinkedIn that, promote yourself and be seen bleh. \n\nYour posts reminds my I don't need to bother about that kinda of rubbish, especially prematurely coz I know I know shit right now.",
            "score": 2,
            "author": "adaptaBill"
        },
        {
            "level": 0,
            "comment": "~~Linkedin~~ gurus. They're all the fucking worst, regardless of what platform they use. The people who have good advice to give don't spend all damn day trying to sell it. They use it themselves and make a shit load of money. The core advice any of them will give you, though, is this simple formula: X experience + Y opportunity + Z luck = success. Some of the most successful people you will meet modestly tell you that they were in the right place at the right time, or the knew the right people to get started. None of them will tell you \"YOU NEED TO START A DROPSHIPPING COMPANY YESTERDAY!\"\n\nAs the devil's advocate, though, I will say that not everything the gurus say is wrong. Creating a passive income stream is something you should work toward regardless of what you do for a living. In my experience though, you are best to stay as fucking far away from residential real estate as possible; commercial is better if real estate is your route to passive income. Developing new skills can be beneficial. Those skills, though, need to be something that helps you personally, not just something that looks good on a resume. Exercise and diet not only make you physically healthier, but help improve your cognitive function. You don't need to look like a greek god/goddess, but rather follow what science says to live a healthy life. The only thing is, you don't need to pay $1,500 for a \"hOw tO gEt rIcH lIkE mE\" entrepreneurship 'course' to learn all that.",
            "score": 2,
            "author": "ncurry18",
            "replies": [
                {
                    "level": 1,
                    "comment": "Agreed. Gurus peddle common sense financial advice and market it as some secret formula of success. \n\nEvery time a guru tries to sell me on a new way to get rich, I already assume that way is overcompetitive and not viable (day trading, real estate, youtube)",
                    "score": 2,
                    "author": "Past_Sir",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "We had a horrible employee at my workplace who noone liked and she was difficult to work with... She was tolerated for too long before she left for another job elsewhere. After she left she became one of those linkedin types you speak of. It was so ironic she was making \"inspirational\" posts about the exact things everyone hated her for.",
            "score": 2,
            "author": "cosmicr"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I couldn't agree more with what you've said here. Finally, someone is making sense of this. Whenever I've spoken slightly against this type of LinkedIn guru, it could be even something in slight disagreement, the mob attacks.\n\nThese guru's attract a certain type of person, in my personal experience, a type of person who wants to believe.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Facebook post with way to many hashtags and fire emojis lots and lots of fire emojis.",
            "score": 2,
            "author": "changing-life-vet"
        },
        {
            "level": 0,
            "comment": "So true, especially number 10. They are big fucking liars who have achieved nothing in their life except thousands of followers online whom they fool every day.",
            "score": 2,
            "author": "rover_r",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This made me giggle, it was initially the facebook/instagram culture and it sad to see it has infected linkedin where you would expect people to be people more down to earth and mature.",
            "score": 2,
            "author": "Twiggerish"
        },
        {
            "level": 0,
            "comment": "I agree. Makes me sad for the people that fall into the trap.\n\nFollow up question: who or what organization offers a truly high quality education experience for aspiring or budding entrepreneurs? Is there a \"Master Class\" for entrepreneurship? \n\nMaybe I'm just not seeing it with all the clickbaity stuff out there.",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;Follow up question: who or what organization offers a truly high quality education experience for aspiring or budding entrepreneurs? Is there a \"Master Class\" for entrepreneurship?\n\nAndrew Yang's \"Venture for America\" program is the only practical \"master class\" I've investigated. He talks about the only real way to learn entrepreneurship is to literally do it, and he recommends working at startups in basic roles and then scaling up your responsibilities.",
                    "score": 2,
                    "author": "Past_Sir",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'll look into this. Thank you!",
                            "score": 2,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Betweeen Linkedin Gurus and Linkedin Recruiters, I terminated my Linkedin account for my sanity.",
            "score": 2,
            "author": "Oflameo"
        },
        {
            "level": 0,
            "comment": "This kind of content does work, however (and unfortunately). \n\nAnd then, we, realize it is garbage content and become jaded to any content that even remotely feels scamy. \n\nI remember a period of life when Gary Vee was a god to me. Then, after I found out he just spews out all empty ideas and words, I turned my nose up to the \"here's my sob story and now I'll yell at you until you give me your money\" approach. As we all rightfully should. \n\nThere are, however, some really excellent speakers and motivators out there. They are often understated and harder to find. They don't yell or hype themselves up. They're quiet wisdom. Example: Jim Rohn.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "That’s hilarious. If I can make it in my field / strike it rich with f u money then I’m gonna get back to roasting lol",
            "score": 2,
            "author": "GummyBearFighter"
        },
        {
            "level": 0,
            "comment": "Why are you giving them any of your time.\n\nIf they post bullshit twice, just disconnect from them so they aren't cluttering your feed and move on.",
            "score": 2,
            "author": "arkofjoy",
            "replies": [
                {
                    "level": 1,
                    "comment": "You have obviously never tried doing this on Linkedin before",
                    "score": 2,
                    "author": "Past_Sir",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's a formula that works.\n\nWait a minute ... which year is it? 2020? WTF man, it was 2015 last I checked.\n\nMaybe add this one to the list.\n\nBuy my course about how to ignore these gurus and live your best life. Do what you were really meant to do (I was obviously born to prey on the vulnerable and \"author\" this course) $999 but yours today for just $99. Hurry, offer lasts only 5 minutes.",
            "score": 2,
            "author": "BarryFromBankstown"
        },
        {
            "level": 0,
            "comment": "All 15 points are valid, you speak a lot of sense. LinkedIn promotes fake personalities and kiss-asses like no other place.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Just another platform where people will do anything for likes to feel validated.",
            "score": 2,
            "author": "LoveNotH86"
        },
        {
            "level": 0,
            "comment": "Lol..I know what you mean...i't's like they never have a problem and if you don;'t sign up with whatever they're hustling then you;re stupid.",
            "score": 2,
            "author": "[deleted]"
        }
    ]
}