{
    "id": "rpw214",
    "score": 1899,
    "title": "Elon Musk tweeted recently about the importance of being aware of cognitive biases - here are 20 Cognitive Biases used by businesses to make billions of dollars every year",
    "author": "Limejhit",
    "date": 1640635662.0,
    "url": "https://www.reddit.com/r/Entrepreneur/comments/rpw214",
    "media_urls": [],
    "other_urls": [
        "https://kickstartsidehustle.com/)",
        "http://kickstartsidehustle.com/a-billion-dollar-mvp/)",
        "https://kickstartsidehustle.com/)"
    ],
    "postText": "\"People don't buy products. They buy emotions\".Over 95% of our purchasing decisions are emotional.\n\nMarketing tools are just the tools to influence the human psyche in one way or another, with psychology in its core.\n\n&amp;#x200B;\n\nI play with behavioral science (psychology in marketing) on a daily basis, so I thought I will share 20 biases here, so you can implement them in your business today to make a few extra bucks:\n\n&amp;#x200B;\n\n\\------------\n\n***EDIT because a few people asked already****If you want I have a* [*free newsletter*](https://kickstartsidehustle.com/) *where I share over 150+ more biases like these ones, but in more extended versions*\n\n[btw, here's an article about how 42 billion-dollars created their MVPs and got their first 1,000 customers](http://kickstartsidehustle.com/a-billion-dollar-mvp/) \n\n\\------------\n\n&amp;#x200B;\n\n# 1. Fresh Start Effect - New beginnings encourage people to pursue their goals\n\nThis bias is responsible for the whole \"New Year, New you\" movement. Whether it's a cliche or not, people want to change at the beginning of every year.\n\nRight NOW (at the end of the year), market your product offering the \"New You\" solution your product provides.\n\n&amp;#x200B;\n\n# 2. Default Effect - People tend to accept what we are given and stick with what we have\n\nWhile offering services package, instead of asking if the customer wants the additional services, just include additional, complementary services in the offering, and ask if they want to exclude some of them from the bill.\n\nWith this one, you might double or triple your average order value.\n\n&amp;#x200B;\n\n# 3. Labour Illusion - People value things more when they see the work behind them\n\nBuild in Public - constant updates on new features and upgrades to your products or services creates the perception there's a lot of work put into your business, making it more valuable\n\n&amp;#x200B;\n\n# 4. Humor effect - People remember humorous information better\n\nHumor can increase your conversion rate by 28%Using funny GIFs in your copy, newsletter, or landing page can increase the attractiveness of your product or services.\n\n&amp;#x200B;\n\n# 5. Framing Effect - people decide on options based on how the options are presented\n\nPricing - \"The tool costs $720/year\" or \"The tool costs $2/day\"\n\n&amp;#x200B;\n\n# 6. Decoy Effect - People change their preference between two options when presented with a third option (the decoy) that is “asymmetrically dominated”\n\nPricing - if you offer just 1 price, a customer has 2 choices: either to buy or not.If you offer 2 choices of pricing, a customer has 3 choices: To buy the cheaper one, the more expensive one, or not to buy.When you add the third pricing option, a much more expensive one, now the second price (the previous expensive one) looks like a bargain.\n\n&amp;#x200B;\n\n# 7. Goal Gradient Effect - The closer to the goal the more motivated people are\n\nCoupon Stamps - whenever a new customer arrives, give them 2 stamps instead of 1. This will give them a little boost to return.\n\n&amp;#x200B;\n\n# 8. Stepping Stones - to embark on a complex journey every step needs to be attainable\n\nWhen creating a referral program the most important reward is the first one. The first reward has to be both achievable and attractive to motivate people to participate.\n\n&amp;#x200B;\n\n# 9. Inaction Inertia Effect - When missing an offer once you are likely to miss an offer twice.\n\nWhen people see that you're giving big discounts frivolously every month or week, they tend to ignore them after a while, because the perceived value for your product is low.\n\n&amp;#x200B;\n\n# 10. Foot-In-The-Door Technique - Getting a person to agree to a large request by their agreeing to a small one first\n\nUpsell whenever you can, but in a friendly, not pushy manner.Last week, I went to McDonald's with my friend. I was in shock at how effective these self-service kiosks were with upsells! My friend took about 5 upsells and was ecstatic about it\n\n&amp;#x200B;\n\n# 11. Risk Compensation Theory - People tend to be more careful if they feel there is a greater risk if they take a particular action. They are less careful when they feel they’re protected by certain factors.\n\nOutline a clear refund/return policy. By offering a 30-day money-back guarantee encourage people to make business with you.\n\n&amp;#x200B;\n\n# 12. Life Event Effect - people are more likely to change their habits during a major life event\n\nAds - target people when they move to a new house, start a new job, etc. People are 3 times more likely to switch brands during the major life event\n\n&amp;#x200B;\n\n# 13. Country of Origin Effect - People's perceptions are influenced by a product’s country of origin labeling\n\nSwitzerland is associated with the best watches and swiss army knives in the world.Italy is associated with the best wine, cheese, and olives.Every country is famous for something - use it to your advantage.\n\n&amp;#x200B;\n\n# 14. Storytelling Effect - People prefer and better remember stories than facts alone\n\nIn 2009, Rob Walker bought 200 objects from eBay for a total sum of $129. He then asked 200 authors to create a story for each object. Rob then sold those 200 objects with included stories on eBay again. He sold them for $8000. That's a 6202% increase in value.\n\n&amp;#x200B;\n\n# 15. Primacy &amp; Recency Effect - People remember things that come first and last more clearly\n\nYour first and last impression matters the most.E.g: Provide your best articles when someone signs up for your newsletter.End your newsletter with something witty, funny, unexpecting.\n\n&amp;#x200B;\n\n# 16. Pratfall Effect - If a brand admits its flaws and makes itself vulnerable, we perceive it as more authentic, thus more likable\n\nThere's a catch to that. Your brand needs to be well perceived in the first place. Then, admitting to your flaws make your brand more authentic.When you're admitting to your flaws, when your brand is perceived as not reliable, it makes things worse.\n\n&amp;#x200B;\n\n# 17. Cashless Effect - People pay more when they can't actually see the money\n\n“Buy Now Pay Later” option at the checkout, in the US, increases an average order value up to 50%, decreases cart abandonment by 28%, boosts repeat purchases among first-time customers up to 23%, and reduces sales refunds by 17%.\n\n&amp;#x200B;\n\n# 18. Endowment Effect - Users value something more if they feel it belongs to them\n\nOffer a freemium version of your products. The key is to offer the right features in the free version.You want to offer enough that users experience the best of what it has to offer but hold back enough to make serious users want to upgrade their package.\n\n&amp;#x200B;\n\n# 19. Sensory Adaptation - People ignore the things they get exposed to repeatedly\n\nInstead of a single graphic in ads, provide an ad sequence, that releases each different ad to the user, depending on user actions or timing.\n\n&amp;#x200B;\n\n# 20. Pareto Principle - generally known as the 80-20 rule, states that roughly 80% of the effects come from 20% of the causes\n\nThe 80/20 rule can also be applied to the 80/20 rule, which provides an ASTOUNDING revelation:Effort: 20% of 20% of 20% = 0.8%Results: 80% of 80% of 80% = 51.2%In conclusion: over 50% of your results are produced by less than 1% of your effort!!!\n\n50% of your revenue likely comes from 1% of your efforts.50% of happiness likely comes from 1% of your experiences.etc.source for this Pareto structure: Brian Bourque\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\-------------------------\n\nThat's it!\n\nIf you want I have a [free newsletter](https://kickstartsidehustle.com/) where I share over 130+ more biases like these ones, but in a more extended versions",
    "comments": [
        {
            "level": 0,
            "comment": "This is a great post, thank you!",
            "score": 82,
            "author": "SwitchItUpYo",
            "replies": [
                {
                    "level": 1,
                    "comment": "You're welcome ;)",
                    "score": 13,
                    "author": "Limejhit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Where can I learn this like you described? Any Books suggestions?",
                            "score": 3,
                            "author": "catapillaarr",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Nudge would be a great place to start!",
                                    "score": 2,
                                    "author": "BHN1618"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Can you explain to me what 'stamps' mean in no. 7",
                    "score": 4,
                    "author": "The_Wizard_z",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Quite often when you buy a coffee, you get a card with 10 empty spaces to receive a stamp every time you buy a coffee. When you collect the 10 stamps, you get a free one  \n\n\nI was talking about that, but I see that I might have been not clear enough",
                            "score": 8,
                            "author": "Limejhit",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Loyalty program",
                                    "score": 2,
                                    "author": "qpv"
                                },
                                {
                                    "level": 3,
                                    "comment": "Interesting, can you do a case study on [crypto.com](https://crypto.com) marketing efforts and their  prepaid Visa card staking program?",
                                    "score": 1,
                                    "author": "wishtrepreneur"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Starbucks did something once where they gave 3 stamps when you buy your first coffee out of 12 vs 1 stamp out of 10. Functionally you need to still buy 9 more to get your free drink. But the perception of 1/10 = 10% of the way there vs 3/12= 25% of the way there. Beautiful isn't it?",
                            "score": 4,
                            "author": "BHN1618",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "beautiful!  what it shows is its all about perception!",
                                    "score": 2,
                                    "author": "MissKittyHeart"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Add 21. - Use Elon Musk's name to attract attention... - it works. lol",
            "score": 41,
            "author": "Aarmed11",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ye, that's the authority bias ;)",
                    "score": 18,
                    "author": "Limejhit"
                }
            ]
        },
        {
            "level": 0,
            "comment": "\\#14: \"Elon Musk recently tweeted\" = Storytelling effect vs the title being here's are some cognitive biases  \n\n\n\\#11 &amp;  #18: Person reads the whole post and now there's a free news letter (free = low risk), and also since they got some value here the more in-depth version is more appealing!  \n\n\n\\#19: This one talks about timing information and ads based on context of what the user is doing. First bias was \"Fresh Start effect\" which is very timely when it's days before the New Year! Bonus #15 primacy effect in that it is likely to be read and remembered as it was put first . Also increases likelihood of reading through to the end since it's so context relevant.   \n\n\nWell done overall. Didn't subscribe because too much noise in my email but if I was younger this would have been an autosubscribe!",
            "score": 11,
            "author": "BHN1618",
            "replies": [
                {
                    "level": 1,
                    "comment": "damn, that was great breakdown. didn't know this post was a play on all of it.\n\nwell played, op ;)",
                    "score": 1,
                    "author": "deadcoder0904"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I wouldn't go back to a company/service if they did number 2 on the list...sneak in extras and make the customer exclude them. That's an asshole thing to do",
            "score": 28,
            "author": "_sideffect",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ye, in my mind it sounded differently\n\nIt goes like this:If you buy a phone, you stick with the already built-in apps\n\nIf you offer a service **package.** Let's say the full-body transformation at the gym. You can offer **AS A PAckage** training sessions, planned diet, supplements, etc, and THEN ask if they want to exclude some things from the package",
                    "score": 24,
                    "author": "Limejhit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ohh, OK yeah that makes more sense. \n\n\"Here is the package A with these 5 items included for 99.99 , but you can remove or substitute any of them\"",
                            "score": 10,
                            "author": "_sideffect",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Every time you buy a computer it’s loaded with certain components, but you’re “allowed” to downgrade. But a lot of people pause and think, “Fuck it. I’ll use that.” and then just pay for it.",
                                    "score": 16,
                                    "author": "[deleted]"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I always hated it when brands do this. Like, we all know apps paid to be there by default (or are made by whoever made the phone), we all know they are _never_ gonna be any good because the good apps get popular without relying on cuntish tactics.\n\nThere’s a reason Edge is the top tool for installing Chrome.",
                            "score": 13,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You may know this and all your friends may know this but I'm often surprised by just how many people don't know this. I guess we all live in our own bubbles lol",
                                    "score": 2,
                                    "author": "BHN1618"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "When they are coded to not be deleted is another story. Quite a few i try to get rid of.",
                            "score": 3,
                            "author": "Canashito"
                        },
                        {
                            "level": 2,
                            "comment": "People hate the built-in apps. They're named \"bloatware\" for a reason.\n\nNow, it may work depending on who you are selling to, but remember that it could also be seen as asshole design and play against you.",
                            "score": 3,
                            "author": "__-___---",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;Now, it may work depending on who you are selling to, but remember that it could also be seen as asshole design and play against you.\n\nYeah condos love doing this. I don't want or use the fucking pool or gym in my building, why should I pay for them?",
                                    "score": 2,
                                    "author": "wishtrepreneur",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I heard that Americans also have condos that come with internet, some being stuck with an inferior service.\n\nThat would never work in my country and would be perceived as scammy and invasive.",
                                            "score": 1,
                                            "author": "__-___---"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Enough people don't, where it remains a profitable scam.  That's why being careless when shopping around, and not aggressively pursuing fraudsters effectively hurts us all.  They figure they can keep doing it, if people don't care.\n\nI see this \"opt out\" instead of \"opt in\" scam more and more, and people always defend it by saying \"you can always jump through these hoops to opt out, so who cares if it's a scam.  It's your fault for not paying attention if you don't catch it\".",
                    "score": 7,
                    "author": "JaredFoglesTinyPenis"
                },
                {
                    "level": 1,
                    "comment": "I agree, but it seems to be a cultural thing.\n\nI recently saw a similar practice on r/assholedesign and multiple redditors from the US thought it was normal while some mentioned that it would be illegal in their country.\n\nOverall, this list is very culturally oriented. Some things might play against you depending on who you are selling to. See the failure of wallmart in Germany as cultural gap example.",
                    "score": 3,
                    "author": "__-___---",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Why did Walmart fail there?",
                            "score": 1,
                            "author": "_sideffect",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Long story short, they insisted the personnel would act like they do in the US, being extraverted, chatty and smiling to customers. They also asked them to participate in cultish team building exercises (singing every morning). \n\nBoth the employees and customers hated the experience and it was a total failure.\n\nYou can Google \"wallmart Germany\" for more details.",
                                    "score": 1,
                                    "author": "__-___---",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "haha, stupid to enforce US culture in another country  \n\n\nI'll read up about it",
                                            "score": 1,
                                            "author": "_sideffect"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "In EU I didn't see company doing it, may it be illegal in some countries?",
                    "score": 1,
                    "author": "travel_learn_wine"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Brilliant post. Have an award!",
            "score": 15,
            "author": "fozrok",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks!",
                    "score": 4,
                    "author": "Limejhit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m half way through ‘Thinking Fast &amp; Slow’ so it’s all very relevant &amp; timely.",
                            "score": 4,
                            "author": "fozrok"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Post is awesome. Now link Elon Musk’s tweet or should we include Authority bias to the list.",
            "score": 20,
            "author": "KaozSh",
            "replies": [
                {
                    "level": 1,
                    "comment": "Here's his tweet   \nhttps://twitter.com/elonmusk/status/1472647410568642564",
                    "score": 10,
                    "author": "Limejhit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Bruh I was being playful. It’s a great hook and awesome content.",
                            "score": 1,
                            "author": "KaozSh",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "xD   \nYe, I got it, I just wanted to paste it here anyway  \nSorry for my emotionless response xD",
                                    "score": 3,
                                    "author": "Limejhit"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Consumer behavior was my favorite subject in uni (and one that I actually use), so I deeply appreciate your post.\n\nMy all time favorite is post-purchase cognitive dissonance. Maybe we could add that as 21, as buyers remorse/stockholm syndrome is something to take into account in the purchase decision making process. \n\nAnd yes, I'm cognizant of the even vs uneven numbers. FWIW, there's research around odd numbers sticking in our brains more, and as a result gain additional meaning.\n\nYep, I'm a geek.",
            "score": 4,
            "author": "monkey_see",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ye, there are hundreds of biases we are aware of  \nAnd probably another ton we still don't know about  \n\n\nI love your geekiness! I'm a geek myself on this subject (as you might have already assumed ;p)",
                    "score": 3,
                    "author": "Limejhit"
                },
                {
                    "level": 1,
                    "comment": "&gt; stockholm syndrome\n\nwhat does the stockholm syndrome have to do with purchasing?\n\ni hold you hostage, then you buy my products, then you are happy with the purchase?",
                    "score": 1,
                    "author": "MissKittyHeart",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No, it's just a term that is sometimes used to also describe post-purchase rationalization. I didn't make it up. https://deepstash.com/idea/16637/the-buyers-stockholm-syndrome",
                            "score": 1,
                            "author": "monkey_see"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "5. \"Framing Effect\" - Adobe has certainly caught me on that one! I clicked through the purchase screen quickly - saw the ~£20 a month for all software, but did not realize until a month later that it was actually ~£20 paid monthly on a 1 year contract, totaling £240. \n\nI had to pay a cancellation fee of 50% - I should have read the small print. Though I still think it was a bit sneaky to not clearly state the total price on the order confirmation... If Adobe didn't have domination of this market, I'd certainly be looking for another product.",
            "score": 5,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Brilliant, I coached CEOs in laternal thinking for the last few sessions, and your write up is very illuminating for them. Thkq",
            "score": 4,
            "author": "9mcm9",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;  laternal thinking\n\nare you mean lateral thinking?",
                    "score": 1,
                    "author": "MissKittyHeart",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ha2... quick fingers? ...Yes, but no excuse for that...",
                            "score": 1,
                            "author": "9mcm9"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt; Italy is associated with the best wine, cheese, and olives.\n\nThis is how wars are started",
            "score": 4,
            "author": "ikinone",
            "replies": [
                {
                    "level": 1,
                    "comment": "xD",
                    "score": 1,
                    "author": "Limejhit"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey this is awesome thank you! Do you have a suggestion for how many biases to use for maximum impact? Is there overwhelm at any point? Or if your product/service allows, try and hit as many as possible?",
            "score": 6,
            "author": "chunkythyme",
            "replies": [
                {
                    "level": 1,
                    "comment": "The things with biases is this:   \nYou're are using hundreds of them EVERY. SINGLE. DAY. and you're not even aware of them  \n\n\nSo, in my opinion, there's no upper limit to the usage of these biases. The important part is HOW you use them, and in what mix",
                    "score": 6,
                    "author": "Limejhit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I would say most importantly, recognizing others using them to run their scams.",
                            "score": 3,
                            "author": "JaredFoglesTinyPenis",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yep, for this as well",
                                    "score": 2,
                                    "author": "Limejhit"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Brilliant thanks for the post",
            "score": 3,
            "author": "tobiadiks"
        },
        {
            "level": 0,
            "comment": "Amazing post- thank you! Taught me a ton about how I need to market",
            "score": 3,
            "author": "niloy_r",
            "replies": [
                {
                    "level": 1,
                    "comment": "You're welcome ;)",
                    "score": 1,
                    "author": "Limejhit"
                }
            ]
        },
        {
            "level": 0,
            "comment": "For anyone interested in this topic and diving in further, I suggest reading The Undoing Project. The book written by Michael Lewis (same author as Moneyball) goes into the history of the two founders of Behavioral Economics (cognitive biases) - Daniel Kahneman and Amos Tversky. The book follows these two Israelis, the experiments they conduct, and breakthroughs they discovered. I will preface it by saying it is not a business book, but interesting nonetheless and could provide additional insights into different cognitive biases and their applications.",
            "score": 3,
            "author": "Lanky_Lobster"
        },
        {
            "level": 0,
            "comment": "From a philosophical standpoint, I've always struggled with tricks like this to perform a sale because a part of me feels like I'm tricking people to act against their own interest which I feel  is wrong. I wonder how others feel about it.   \n\n\ne.g If you make it easy to borrow money, poor people who can't afford stuff will borrow money and buy a product leading them into more debt etc.   \n\n\nOr well maybe I need to embrace capitalism and not care about stuff like this.",
            "score": 9,
            "author": "be_polite",
            "replies": [
                {
                    "level": 1,
                    "comment": "If you put on a suit to go to a job interview so that you can make a good impression and put your best foot forward, that is using cognitive bias in a way that is probably acceptable to both your own ethics and the companies. \n\nIf you put on that same suit to fool poor or ignorant people into thinking you are a business success and get them to hand over their limited money to you, that is using cognitive bias for unethical ends. \n\nSame tool - different ethical outcomes. In both scenarios you are trying to sell yourself (or at least your image).",
                    "score": 9,
                    "author": "martechnician"
                },
                {
                    "level": 1,
                    "comment": "I've got the same dillema myself\n\nI got into this, because of my love to psychology. But at the same, knowing what makes humans humans (what makes people tick) makes you a villain? I spent countless hours wondering about it  \n\n\nI think about it this way: You have a knife, and you can either make a sandwich with it or kill a man. \n\nI always tell people to don't do shady things (we all recognize shady tactics when we see one). Use these biases to express your most authentic self (examples: dollar shave club, purple mattress, etc)",
                    "score": 2,
                    "author": "Limejhit"
                },
                {
                    "level": 1,
                    "comment": "This line of thought makes me roll my eyes. Economic systems are only as moral as the actors in them. If you choose to trick people into buying shit products they don’t need, then that’s on you. No one is forcing you to sell people shit that won’t enhance their life. Maybe you should only market/sell products and services that bring benefit to peoples life instead.",
                    "score": -2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Archived \n\nhttps://archive.ph/u1IkX",
            "score": 3,
            "author": "Caldoe"
        },
        {
            "level": 0,
            "comment": "Thanks for this",
            "score": 2,
            "author": "NTeC",
            "replies": [
                {
                    "level": 1,
                    "comment": "You're welcome!",
                    "score": 2,
                    "author": "Limejhit"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What a post!",
            "score": 2,
            "author": "Former_Ad3363"
        },
        {
            "level": 0,
            "comment": "Fantastic...thx",
            "score": 2,
            "author": "Maxscar1031",
            "replies": [
                {
                    "level": 1,
                    "comment": "You're welcome!",
                    "score": 1,
                    "author": "Limejhit"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What a great read. Def had to take notes on how we can incorporate items on this list. Thank you for sharing!",
            "score": 2,
            "author": "Chirpios",
            "replies": [
                {
                    "level": 1,
                    "comment": "You're welcome ;)",
                    "score": 1,
                    "author": "Limejhit"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Very helpful. Thanks so much for posting :)",
            "score": 2,
            "author": "birdsareinteresting",
            "replies": [
                {
                    "level": 1,
                    "comment": "You're welcome ;)",
                    "score": 2,
                    "author": "Limejhit"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Excellent list.  I'll definitely be referring back to this.  Thank you.",
            "score": 2,
            "author": "wroughten"
        },
        {
            "level": 0,
            "comment": "Great post!",
            "score": 2,
            "author": "mokaveli"
        },
        {
            "level": 0,
            "comment": "Very informative. Thanks!",
            "score": 2,
            "author": "rolltide1995"
        },
        {
            "level": 0,
            "comment": "I heard about the decoy effect some time ago and was looking for a source like this.  thank you thank you sir.  Is this from a book?  please share if it is!",
            "score": 2,
            "author": "tensor0910",
            "replies": [
                {
                    "level": 1,
                    "comment": "There are a ton of books on that: Cialdinis books, or Rory Sutherlands.  \n\n\nI also share them here, in my free newsletter  \nhttps://kickstartsidehustle.com/",
                    "score": 1,
                    "author": "Limejhit"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is GOLD! 🏆",
            "score": 2,
            "author": "mufasis"
        },
        {
            "level": 0,
            "comment": "Excellent post. Love it",
            "score": 2,
            "author": "Dull-Personality-878"
        },
        {
            "level": 0,
            "comment": "Sent an award",
            "score": 2,
            "author": "Ok-Ship-2209",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you!",
                    "score": 1,
                    "author": "Limejhit"
                }
            ]
        },
        {
            "level": 0,
            "comment": "While none of these seems to be a 'technical' bias from my understanding, these **are** very, very helpful patterns and principles that benefit all people to understand better.\n\nLearning and directly applying each of the most relevant principles here will bring results.\n\nPlus, for #19, yes people consciously ignore them more often, and also from what I know they are actually subconsciously more affected by them than otherwise.",
            "score": 2,
            "author": "daddy78600",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ye, we live on autopilot 99% of the time  \n\n\nEvery second our brain processes 20k of information. And that's when the cognitive biases kick in, and filter those information to help us cope with it\n\n&amp;#x200B;\n\nSo it's not a matter of \"learning\" these biases. It's more about rediscovering them inside you and making the use of them",
                    "score": 1,
                    "author": "Limejhit"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thanks for this 🙏",
            "score": 2,
            "author": "Dj_A_V_O"
        },
        {
            "level": 0,
            "comment": "Thanks for sharing!",
            "score": 2,
            "author": "thepathlessfollowed"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'd say to be aware of the techniques boosting up the value of these products, and then negotiate the price that might seem fair to you  \n\n\nWhen buying, it mostly got to this:  \n\\- stick to the things you want to buy. Don't buy upsells (if you choose differently it's still ok)  \n\\- be aware that every story the seller tells you, except the technical ones, are used to pump up value of the product  \n\\- Be aware of the cashless effect  \n\n\nWell, there's a ton of biases used during purchasing decisions. Being aware of them helps",
                    "score": 3,
                    "author": "Limejhit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks, i was thinking more along psycological ways on how to get people to choose me to buy/receive their offer for, their item instead of the other vendors. Like how should a car dealer get privates to sell them their used car.\n\nCashless effect is not an issue in my country because all cash payments above 2900USD is illegal, and the items i purchase are more expensive than that :(",
                            "score": 2,
                            "author": "LowDog84",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; Thanks, i was thinking more along psycological ways on how to get people to choose me to buy/receive their offer for, their item instead of the other vendors.\n\ni use my own branding for that.  want to buy \"meow mix chow mix\"?  im hte only one who sell it!",
                                    "score": 1,
                                    "author": "MissKittyHeart"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt; Be aware of the cashless effect\n\nsuper important!",
                            "score": 1,
                            "author": "MissKittyHeart"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Loved it! Hope to see something similar in newsletter! \nI subscribed!",
            "score": 2,
            "author": "harry488"
        },
        {
            "level": 0,
            "comment": "this deserves a medal",
            "score": 2,
            "author": "raisethetreble"
        },
        {
            "level": 0,
            "comment": "I've just started reading Harvard Business Review The Must N°16 about 15mins ago which is all about cognitive biases. I've been chosen!",
            "score": 2,
            "author": "IamTheRedGuy",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;Harvard Business Review The Must N°16\n\nLife is funny sometimes  \n\n\nGood luck!",
                    "score": 2,
                    "author": "Limejhit"
                },
                {
                    "level": 1,
                    "comment": "link? google shows a lot of books but don't know which one it is :(",
                    "score": 2,
                    "author": "deadcoder0904",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm reading [the french version](https://www.hbrfrance.fr/numero/hors-serie-harvard-business-review-le-must-de-lart-de-decider/) of it since we still don't have HBR English magazines in my country.\n\nI did some research and found [this](https://store.hbr.org/product/hbr-s-10-must-reads-on-making-smart-decisions-with-featured-article-before-you-make-that-big-decision-by-daniel-kahneman-dan-lovallo-and-olivier-sibony/11367) as some kind of English equivalent.\n\nHope this helps :)",
                            "score": 2,
                            "author": "IamTheRedGuy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "thank you :)",
                                    "score": 2,
                                    "author": "deadcoder0904",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You're welcome :)",
                                            "score": 1,
                                            "author": "IamTheRedGuy"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;Labour Illusion - People value things more when they see the work behind them\n\nI think the illusion is more often when people **don't** see the labor and consequently undervalue it. I worked at one company where one of our salesguys consistently under estimated the work the technicians had to do to complete the projects he sold.",
            "score": 2,
            "author": "9bikes",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yep, every stick has 2 ends",
                    "score": 2,
                    "author": "Limejhit"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I wish people knew this before spending their 2 months salary on a new apple device \n(I'm not a hater btw)",
            "score": 2,
            "author": "potcubic",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yep, the same goes for the diamond engagement rings - btw, the whole diamond industry is a scam  \n\n\nDiamonds aren't rare at all. They could be worth 10% of the current price, or even lower",
                    "score": 6,
                    "author": "Limejhit"
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;6. Decoy Effect - People change their preference between two options when presented with a third option (the decoy) that is “asymmetrically dominated”  \n&gt;  \n&gt;Pricing - if you offer just 1 price, a customer has 2 choices: either to buy or not.If you offer 2 choices of pricing, a customer has 3 choices: To buy the cheaper one, the more expensive one, or not to buy.When you add the third pricing option, a much more expensive one, now the second price (the previous expensive one) looks like a bargain.\n\nI'm not ashamed to admit that I used this one for 10+ years before I even knew what it was called. All I knew was that 3 worked well, and to make one look like a bargain compared to the higher one, even though I was raising my rates across the board. \n\nIt worked very well. That thing became my best-selling service.",
            "score": 2,
            "author": "LincHayes",
            "replies": [
                {
                    "level": 1,
                    "comment": "!!!  \n\n\nWith this single one, I've helped in the last few months a dozen of small entrepreneurs who doubled their AOV thanks to this one principle alone",
                    "score": 3,
                    "author": "Limejhit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "to do the decoy effect, like 10$, 15$, and $20, and the most purchased option was $15?\n\nis it a linear pricing structure (10, 15, 20) or a non linear pricing structure (10, 15, 18) that works best?",
                            "score": 1,
                            "author": "MissKittyHeart"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt; I'm not ashamed to admit that I used this one for 10+ years before I even knew what it was called. All I knew was that 3 worked well, and to make one look like a bargain compared to the higher one, even though I was raising my rates across the board.\n\ntell me more.  so the magical number of options was 3?  like 10$, 15$, and $20, and the most purchased option was $15?",
                    "score": 1,
                    "author": "MissKittyHeart",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No, more like   \n\n\n5 hours- $350 (must be used consecutively)  \n8 Hours - $499 ( can be used over time)  \n12 Hours - $799 \n\n8 hours sold 95% of the time.",
                            "score": 1,
                            "author": "LincHayes",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "ok ty\n\nbasically, option a is 70$/hr, b is 62.38, c is 66.58\n\nmake option a entry level/undesirable, optoin b the sweet spot, and option c overkill",
                                    "score": 1,
                                    "author": "MissKittyHeart",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yes, but you want a little more difference in your pricing. $5 bucks either way isn't much when you talking about a $60-$70 product.   \n\n\nAnd  it's hard to charge different amounts for the same hour. You can see I was charging for blocks of hours, in increments that make sense for my most common projects, and nmade one easier to use.   \n\n\nI also had to play with a few different ways before this formula worked including the pricing...using \"5\" at the end, \"99\" and so on.  There is no one specific way that's going to work for every business. What works for a matress store probably won't work for a web designer.",
                                            "score": 1,
                                            "author": "LincHayes"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks!",
                    "score": 1,
                    "author": "Limejhit"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The first post I have saved thank you!",
            "score": 2,
            "author": "Justinpickrell",
            "replies": [
                {
                    "level": 1,
                    "comment": "You're welcome!",
                    "score": 1,
                    "author": "Limejhit"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Nice",
            "score": 2,
            "author": "Castravete_Salbatic"
        },
        {
            "level": 0,
            "comment": "\"Over 95% of our purchasing decisions are emotional\"\n\nNo. 95% is very large estimate. In developing countries people think 10 times before spending money. It might be true for rich people or people in developed countries.",
            "score": 2,
            "author": "ern_6002",
            "replies": [
                {
                    "level": 1,
                    "comment": "Actually it's closed to 100% than 95%, but I didn't want to be dramatic\n\nEvery decision you make is based on the mood you have during that day, the story you tell yourself before the decision, the story other people tell you, the frame you see your potential decision in, etc, etc\n\nWe tell ourselves that we are highly rational beings, because we want to have the perception of being in control.",
                    "score": 1,
                    "author": "Limejhit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "90% of days I don't make any decision other than what to eat so that I can have balanced diet. What I want to eat is based on scientific facts and not opinions. Other things are repetitive.\n\nSome times once in a year I want to buy some clothes because some of my previous clothes are teared out. I buy clothes based on price and durability.\n\nOther decision like related to travel are based on conditions : for example I need to relocate or my office is closed due to covid and I need to return home town.\n\nYou are too much inspired from some YouTube videos who shouts 10 times : \"people don't make decision rationally, they take decision and then try to justify it\".\n\nWhen I was kid, I used to take around most of decision of my life based on others due to lack of knowledge and freedom.\n\nMost products I see around me, for which people pay in form of money are those products which can really add value and not just based on emotion.\n\nIt would be better if you justify your facts based on real stats than just making some good looking baseless argument which most youtube videos do for teenagers.",
                            "score": 0,
                            "author": "ern_6002",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You misjudged my knowledge based on how I presented it - in the simplest possible format (Feynman technique), but I know my subject  \n\n\n[https://hbswk.hbs.edu/item/the-subconscious-mind-of-the-consumer-and-how-to-reach-it](https://hbswk.hbs.edu/item/the-subconscious-mind-of-the-consumer-and-how-to-reach-it)  \n\n\n[https://westsidetoastmasters.com/resources/laws\\_persuasion/chap14.html](https://westsidetoastmasters.com/resources/laws_persuasion/chap14.html)",
                                    "score": 1,
                                    "author": "Limejhit",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Feynman technique is for learning and not explaining.",
                                            "score": 1,
                                            "author": "ern_6002",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "yes",
                                                    "score": 1,
                                                    "author": "Limejhit"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is great. I'd read your book.",
            "score": 2,
            "author": "Mergatroid093"
        },
        {
            "level": 0,
            "comment": "Thanks this is awesome",
            "score": 2,
            "author": "jmoasdf",
            "replies": [
                {
                    "level": 1,
                    "comment": "You're welcome ;)",
                    "score": 1,
                    "author": "Limejhit"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Commenting on it just to get back at it later\nGood content",
            "score": 2,
            "author": "Little-Emphasis2551"
        },
        {
            "level": 0,
            "comment": "This is awesome. Thank you",
            "score": 2,
            "author": "StickyGumboDavis"
        },
        {
            "level": 0,
            "comment": "Saved aaaand bookmarked for later",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Bout to use these ideas in my next marketing campaign lol",
            "score": 2,
            "author": "McPoyal",
            "replies": [
                {
                    "level": 1,
                    "comment": "haha, that's awesome!",
                    "score": 2,
                    "author": "Limejhit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Fuck yeah",
                            "score": 1,
                            "author": "McPoyal"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "this is legit gold.  im glad to read this post; i will print it out and frame it on the wall!\n\nmany of these things ive encorporated into my business.  but now seeing it in writing, with a tweet from elon musk, makes me more confident in my actions",
            "score": 2,
            "author": "MissKittyHeart",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ye, it's always assuring to see someone we admire confirming our course of action",
                    "score": 1,
                    "author": "Limejhit"
                }
            ]
        },
        {
            "level": 0,
            "comment": "thank you",
            "score": 2,
            "author": "minesh1991",
            "replies": [
                {
                    "level": 1,
                    "comment": "You're welcome!",
                    "score": 1,
                    "author": "Limejhit"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Nice post, you nail it!",
            "score": 2,
            "author": "beaquis"
        },
        {
            "level": 0,
            "comment": "Thank you for this post. New to Reddit and this sub!",
            "score": 2,
            "author": "Yemeni01",
            "replies": [
                {
                    "level": 1,
                    "comment": "You're welcome!",
                    "score": 1,
                    "author": "Limejhit"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is there a book about this? It be a great read!",
            "score": 4,
            "author": "Nikki_iva",
            "replies": [
                {
                    "level": 1,
                    "comment": "The Choice Factory - Richard Shotton\n\n2. Thinking, Fast and Slow - Daniel Kahneman\n\n3. Robert Cialdini - Most of his books\n\n4. Hooked - Nir Eyal\n\n5. Alchemy... - Rory Sutherland\n\nAnd here's my free newsletter where I share 150+ of these  [https://kickstartsidehustle.com/](https://kickstartsidehustle.com/)",
                    "score": 11,
                    "author": "Limejhit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I always **hate** posts which are an infomercial to get people to sign up to a newsletter, but I have no attention span and need simple examples for me to learn marketing (I'm terrible at it). Your post presented the info in bite sized chunks like I need so I signed up for your newsletter.\n\nThe pictures on your site look like you've made a marketing product for 5 year olds with the attention span of that fish from Finding Nemo. You may be taking my money at a later date. \n\nWell played OP, well played.",
                            "score": 4,
                            "author": "Con_Clavi_Con_Dio",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I really appreciate your opinion and observant eye  \nThat was the main point of these sketches  \n\n\nWe're all 5-year-olds trying to use fancy words to be perceived as adults.   \nBut our attention span tells the truth",
                                    "score": 2,
                                    "author": "Limejhit"
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt; The pictures on your site look like you've made a marketing product for 5 year olds with the attention span of that fish from Finding Nemo. You may be taking my money at a later date.\n\nyou may be on to something",
                                    "score": 2,
                                    "author": "MissKittyHeart"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "That’s for the recommendations! I just subbed to the newsletter :)",
                            "score": 2,
                            "author": "Nikki_iva",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The Art of Thinking Clearly is a great read on these. It’s a journalist who compiled a bunch of them into easy to digest examples.",
                                    "score": 4,
                                    "author": "UncoolSlicedBread",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thanks for the recommendation! I’ll add it to the list :)",
                                            "score": 1,
                                            "author": "Nikki_iva"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "#20 is bullshit. It's 80/20 not 51.2/1.\n\n\nHow on earth could 1% of your efforts be 51%? Everything is compound. Other biases like #8, 3 &amp; 4 are good examples of that. \n\nAlso this was just regurgitate material you barely understand that you are now sending out as a newsletter? PASS. Double advertised too lol tool",
            "score": 3,
            "author": "Cobek",
            "replies": [
                {
                    "level": 1,
                    "comment": "that's a probability distribution just multiply 0.2 and 0.8 three times and you'll get 0.008 and 0.512 intuition behind it is that this rule can be applied to the 20 percent which has 80 percent of resources and you do it two times to get 50/1 rule",
                    "score": 4,
                    "author": "darkish1346"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thank you for posting something valuable!  You’re a rare breed, anymore.",
            "score": 2,
            "author": "mrderyck",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you!",
                    "score": 1,
                    "author": "Limejhit"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m sure someone who got rich from apartheid has no cognitive biases.",
            "score": 1,
            "author": "sublunari"
        },
        {
            "level": 0,
            "comment": "Awesome read! Thank you",
            "score": 1,
            "author": "PresidetnDamn"
        },
        {
            "level": 0,
            "comment": "Post saved",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Interesting",
            "score": 1,
            "author": "living_intently"
        },
        {
            "level": 0,
            "comment": "Have worked with OP and recommend.",
            "score": 1,
            "author": "warwingz"
        },
        {
            "level": 0,
            "comment": ":3",
            "score": 1,
            "author": "MissKittyHeart"
        },
        {
            "level": 0,
            "comment": "Cognitive bias advice from one of the least self-aware men on the planet. Brilliant.",
            "score": 1,
            "author": "relentless_beasting"
        },
        {
            "level": 0,
            "comment": "From the king of cognitive bias: https://elonmusk.today/",
            "score": 1,
            "author": "Thump604"
        },
        {
            "level": 0,
            "comment": "This is great thank you my man",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "i appreciate you ! thank you",
            "score": 1,
            "author": "Lol_kok"
        },
        {
            "level": 0,
            "comment": "You’re a disgusting human being with a disgusting job.",
            "score": 1,
            "author": "twelve25oh9"
        },
        {
            "level": 0,
            "comment": "The ones you \"devour\" aren't actually your competition. They are your fellow humans, tricked in this silly competitive game, just as you.",
            "score": 1,
            "author": "intheredditsky"
        },
        {
            "level": 0,
            "comment": "👍",
            "score": 1,
            "author": "commonlogic_yes"
        },
        {
            "level": 0,
            "comment": "wow",
            "score": 1,
            "author": "Guilty_Age_9535"
        },
        {
            "level": 0,
            "comment": "So basically exploiting humans, got it.",
            "score": 0,
            "author": "Tenter5",
            "replies": [
                {
                    "level": 1,
                    "comment": "It makes me sad how few are seeing this, and sadder how many do, but want to take advantage of others with it\n\nNo wonder poverty is so high, when “entrepreneurship” has evolved to be so efficient that you can’t even leave your bedroom without encountering a sales tactic\n\nMy Alexa tried to offer me a membership when I asked for rain sounds, and then I contemplated “hmmm ball-peen hammer? Or rear wheel of my car?”",
                    "score": 1,
                    "author": "MeatSim88"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is great! How to save?",
            "score": 0,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Elon Musk is a moron and the world would be a better place if he just fucked off forever",
            "score": 0,
            "author": "Strammy10",
            "replies": [
                {
                    "level": 1,
                    "comment": "\"Show me on this doll where Elon Musk hurt you.\"",
                    "score": 1,
                    "author": "Admirable_Bass8867"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just here to say that FRANCE is the country of wine and cheese.   \n\n\nCheers.",
            "score": 0,
            "author": "slamingzone"
        }
    ]
}