{
    "id": "s30vae",
    "score": 1533,
    "title": "I hired content writers from 17 different websites, and most of them were scammers.",
    "author": "kjb123etc",
    "date": 1642084562.0,
    "url": "https://www.reddit.com/r/Entrepreneur/comments/s30vae",
    "media_urls": [],
    "other_urls": [
        "https://growthbadger.com/hire-a-writer/)"
    ],
    "postText": "I've been wanting to publish more content on my site. So I decided to hire a writer to help.\n\nIt turns out that there are tons of places to hire writers online:\n\n* Freelance marketplaces like Upwork.\n* Content mills like Textbroker.\n* Higher-priced content services and agencies.\n* And plenty of job boards for writers.\n\nSo I thought:\n\nWhy not waste a bunch of money and turn this into a big experiment?\n\nSo I tested 17 different websites for hiring writers and outsourcing content. I spent an embarrassing amount of money. And by the end of it, I'd reviewed 359 articles from hundreds of writers.\n\nThe results were a **minefield**.\n\n* 34% of the articles were plagiarized or \"spun\" (stolen, but with slight tweaks to make it harder to catch).\n* 18% were AI-written nonsense.\n* And many writers included irrelevant links to low-quality sites. Probably in order to charge other clients for link-building services.\n\nSurprisingly, these issues came up at practically every pricing tier. Whether the fee was under $0.01/word or over $0.50.\n\nWhether through a job board, a freelance platform or a content-writing service.\n\nSome sites even reinforced bad behavior.\n\nFor example, I wouldn't recommend any site that offers article spinning as a service.\n\nOr any platform that lets writers hide unfavorable client reviews. (I'm looking at you, Verblio. *Both* Verblio writers I tested sent me plagiarized articles.)\n\nLuckily, a few sites were much, much better.\n\nHere were my favorites:\n\n**Best writing service: Express Writers** (expresswriters.com)  \nIt's more expensive than a content mill — but a bargain for the quality.\n\n$600 got me a 2k-word article at their \"authority content\" tier.\n\nIt was clear and concise. Well-structured and well-researched. And backed up with good examples and links to relevant resources. I gave it a 4 out of 5 for content quality.\n\n**Best inexpensive and fast writers: WriterAccess** (writeraccess.com)\n\nAt $0.15 per word for their most expensive tier, I didn't expect WriterAccess to be very good.\n\nIt isn't as good as Express Writers. But it might have the best price-to-quality ratio of any option out there. I gave it a 3.5 out of 5 for writing quality.\n\nAnd it only took 4 days to get a 1,600-word article.\n\n**Best budget content mill: iWriter** (iwriter.com)\n\niWriter's pricing ranges from under $0.01 to $0.07 per word.\n\nI spent $145 for a 2k-word blog post.\n\nThe writing won't blow your socks off.\n\nBut from my testing, the quality coming out of iWriter beats every other budget content mill.\n\nI only gave it at 1.5 out of 5 for writing quality. But that's good enough for low-competition affiliate blogs. Or anyone who thinks quantity &gt; quality.\n\n**Best writing jobs board: ProBlogger Jobs** (problogger.com/jobs)\n\nI bet half the pro writers in the world have applied to jobs on ProBlogger.\n\nYou can use it to find freelancers for one-off or ongoing projects. Or to recruit full-timers.\n\nA $75 job listing gets you dozens and dozens of applicants. If not 100+.\n\nAlternatively, another great — and free — writing job board is the r/HireaWriter subreddit.\n\nMy listing there brought me 85 applications within a week.\n\nWhen using any job board, I recommend setting up a Google Form for your application process instead of using their application management system. (Because when you're dealing with that many applicants, you need to be able to quickly glance through them.)\n\n**Best freelance platform: Upwork** (upwork.com)\n\nThe haters are wrong. I've hired 60 Upwork freelancers over the years.\n\nBut with so many low-quality freelancers there, it can be like finding a needle in a haystack. The key is having the right hiring process. Otherwise you'll waste a lot of time.\n\nFor this experiment, I hired two different writers on Upwork. One interesting thing about Upwork is that you don't always get what you pay for.\n\nThe first writer charged me $0.40/word, and I would give her writing quality a 2 out of 5. Not good.\n\nThe second writer charged $0.10/word, and his writing was a 3.5 out of 5. Pretty decent! Good enough for most blogs, and great for the price.\n\n(Note: People Per Hour is a good alternative to Upwork if you don't mind British English. But I don't recommend their Fiverr-style individual services. Just stick to the freelance marketplace side.)\n\nIf you're curious, I also published lots more details about my experience with all 17 sites in a [blog post yesterday.](https://growthbadger.com/hire-a-writer/) (It's just a blog post, no email address required or anything.)\n\nThat post includes:\n\n* A job post template\n* The strengths of content services vs freelance sites vs writing job boards\n* What to include in your Google Forms application form, and why to use one\n* And a hiring process that filters out plagiarizers and bad applicants, so you don't have to waste as much money as I did. 🤪\n\nPlus more detailed reviews of all 17 sites, with writing excerpts of the work I received.",
    "comments": [
        {
            "level": 0,
            "comment": "As a freelance copywriter and blog writer, I find it sad to see these stats.",
            "score": 331,
            "author": "Weallgetboredalot",
            "replies": [
                {
                    "level": 1,
                    "comment": "My main business is drywall contracting. Half the time when I show up for a quote the potential customers are surprised I shower up at all. Low quality competition is a very good thing for high quality businesses/freelancers",
                    "score": 169,
                    "author": "GlaerOfHatred",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "As a homeowner, 10% chance anyone shows up. Even vetted, website owning, well reviewed and major contractors. \n\nAnyone acquired through Facebook or Craigslist might as well not even advertise. They literally can't tie their shoes.",
                            "score": 29,
                            "author": "40isafailedcaliber",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yea it's kind of embarrassing, I imagine the higher companies do that just in case they need the work, but for someone like me it makes it really easy to get work",
                                    "score": 8,
                                    "author": "GlaerOfHatred"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt;I shower up\n\nI'll assume a typo, but it works too.",
                            "score": 60,
                            "author": "budrow21",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Lol dang it",
                                    "score": 25,
                                    "author": "GlaerOfHatred",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "**client sniffs and nods approvingly*",
                                    "score": 11,
                                    "author": "barryhakker"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It's incredible how many contractors just don't even bother to do the job.",
                            "score": 53,
                            "author": "kjb123etc",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yea it's quite shocking. Oh well, more money for me",
                                    "score": 17,
                                    "author": "GlaerOfHatred"
                                },
                                {
                                    "level": 3,
                                    "comment": "Holy crap I’m actually blown away by this. As a writer who has been on the opposite side, I find you are paying way more than most people want to. Many gigs pay $30 to $50 an article or even as low as $20 an hour. Which platform would you say is best for writers! I’m guessing you can’t tell if they get the money directly or a cut..",
                                    "score": 12,
                                    "author": "samara37",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah, I tried to test writers at every pricing tier to get a good sense of what's happening in the market right now.\n\nTo answer your question, I'm not sure. Some other folks have chimed in to say that most content services take a large chunk of the cut. So if you wanted to work for one of those, I would definitely go for a more expensive one like Express Writers.\n\nBut even Express Writers only charges \\~$0.30 per word for their most expensive blog content tier. Which includes graphics and editorial review and keyword research. So as a writer you might only get, I don't know, less than half of that?\n\nI think as a writer, you're probably facing this continuum:\n\n**Content services and mills**: the least pay, but the easiest to get clients.\n\n**Freelance platforms**: more pay but somewhat harder to get clients.\n\n**Job boards**: maybe even more pay (but not always). And again harder to get clients.\n\n**Inbound** (meaning, people reaching out to you because of your activity on social media, personal brand, personal website, or portfolio of credited work): the most pay, but the hardest. These are the only types of folks who can reliably charge $1+ per word from what I've seen.\n\nAnd to add another layer…\n\nThe more technical or specific subject-matter expertise you have, the more you can charge. It probably makes getting clients harder at first because you narrow your scope, but over time it actually might make it easier to get clients if you get known for doing that one thing and get referrals.\n\nFor example, good legal writers, medical writers, technical writers etc. might be able to easily charge over $0.50 or $1/word. (Not that they ALL can, but I would guess that experienced ones can.)\n\nConversion copywriters, script writers, etc. also tend to charge much more than general content writers / blog writers. At least per word — but it probably takes longer for them to write too.\n\nConversion copywriters also have the benefit of being \"closer to the money.\" Someone who writes landing pages or ad copy can directly tie it to revenue and demonstrate ROI in a way that most content writers can't. \n\nHope that helps!",
                                            "score": 9,
                                            "author": "kjb123etc",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yes it does thank you ☺️",
                                                    "score": 2,
                                                    "author": "samara37"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I've been experiencing that myself this past year. We bought an old house and literally *everything* needs work, we're talking:\n\n* new windows\n* new roof\n* re-wiring\n* new plumbing\n* bathroom remodel\n* kitchen remodel\n* extensive landscaping\n\nNo exaggeration, we called every contractor, specialist and handyman in our local area. Dozens of firms.\n\n2 turned up. And only 1 gave us a quote.\n\nGet this: That 1 guy measured up on June 11th. He sent the quote to us *yesterday*.\n\nYou guys do not have to work very hard to be better than your competition.",
                                    "score": 5,
                                    "author": "the_drew",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The competition smells bad because they don't shower?",
                            "score": 5,
                            "author": "TheFastestDancer",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ahhhhhh typoooo",
                                    "score": 2,
                                    "author": "GlaerOfHatred"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I had a painting company a few years back, and that’s very true in the construction industry. Everyone expects you to be drunk and dirty. So when I show up in business casual and sober, not acting like a dick, I already have the job.",
                            "score": 2,
                            "author": "hammerripple"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Absolutely.\n\nOn the bright side: if you're even just decent, you're in the top 1%. Congrats!",
                    "score": 93,
                    "author": "kjb123etc",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I run a moderately successful construction business. Just met with a Deloitte partner and when he asked me what our company profile was, I said, \"We're a B company in an ocean of D's and F's.\"\n\nMy goal is B+ lol.",
                            "score": 25,
                            "author": "velders01"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 43,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I am somewhat sure you plagiarized a comment.",
                            "score": 3,
                            "author": "f0urtyfive",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "100% sure you've used all of these words before",
                                    "score": 4,
                                    "author": "justamemeguy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Im 34% certain you plagiarized this comment.",
                                            "score": 5,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "100% sure you've used all of these words before",
                            "score": 3,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;Best budget content mill: iWriter (iwriter.com)\n\nIt shouldn't. If you are good, then knowing most of the competition is shit great from a business side.",
                    "score": 17,
                    "author": "mintoreos",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Doesn’t that make it hard to get found initially, though? I’ve done tons of writing both academically and for passion projects, but never really entertained the idea of writing for money outside of academia. These stats means that not only will frauds get fired anyways, they’re likely getting hired over more qualified candidates",
                            "score": 11,
                            "author": "bickdickanivia",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Correct, frauds are likely to get fired but good people are likely to continue to get work. \n\nOver time, the marketplace participants will land on the good people, and the good people will be rewarded with additional work. Also, word of mouth is a VERY powerful source of new clients, especially if the marketplace is unreliable.  \n\n\nGetting the first few clients might be difficult, but if you are good you are likely to hold on to them for a long time, while the bad writers just rely on shady practices.",
                                    "score": 4,
                                    "author": "mintoreos"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Really? If I were in your shoes I would be encouraged to go all in, position yourself as expert and offer high quality content in a high ticket context.\nThere are copywriters that start from 5-10k. Pick a niche and dominate the market 👌",
                    "score": 7,
                    "author": "zorndyuke",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 3,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 3,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "True. However, I do not like the connotation and negative previous experience that could potentially make my clients’ biased. It’s very much noticeable, even with all the professionalism.",
                            "score": 3,
                            "author": "Weallgetboredalot",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is quality content for this sub.\n\nIt's not whining about no motivation.\n\nIt's not asking for business ideas because you've got money to burn.\n\nIt's not spam.\n\nIt's quality work and very helpful for all tiers in business ownership.",
            "score": 259,
            "author": "titanicx",
            "replies": [
                {
                    "level": 1,
                    "comment": "I had to do a double take to make sure I was in the right sub. It was a great read for sure and definitely touched on a very painful subject.",
                    "score": 49,
                    "author": "SuccessISthere",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You guys are making me blush over here!",
                            "score": 55,
                            "author": "kjb123etc"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thanks for the kind words. You made my day.",
                    "score": 28,
                    "author": "kjb123etc",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m commenting here to helpfully boost this post so more people see it, it really is well researched. Great work!",
                            "score": 2,
                            "author": "clothespinkingpin",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Came to make this exact comment. Top!",
                    "score": 5,
                    "author": "bloodybeakerfolk"
                },
                {
                    "level": 1,
                    "comment": "&gt; It's not spam.\n\ni think it may be thinly veiled spam. if op has no connection to any of the recommended sites, i'd be pretty surprised.\n\nthe top recommended site, which is quite expensive, is a very low trafficked site.",
                    "score": 1,
                    "author": "wdrosa",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Loving this. This is grade A community content, thanks for sharing.",
            "score": 108,
            "author": "dmart89",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks, glad you liked it!",
                    "score": 23,
                    "author": "kjb123etc",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "These days, quality is one of the hardest things to come by... at least at affordable prices.",
                            "score": 12,
                            "author": "dmart89"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Find writers, designers, freelancers you can trust and stick with em folks. Worth every penny.",
            "score": 65,
            "author": "pervavor",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'd say the sentiment is the same here on the writer side of things. Nothing makes me happier than working with a client that's trustworthy and communicative.",
                    "score": 13,
                    "author": "happygrouse"
                },
                {
                    "level": 1,
                    "comment": "100%.",
                    "score": 12,
                    "author": "kjb123etc"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Very insightful. I struggle to find good content folks myself",
            "score": 21,
            "author": "3xasperated",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's a real challenge.",
                    "score": 5,
                    "author": "kjb123etc"
                },
                {
                    "level": 1,
                    "comment": "It can be so hard to know what you're signing up for when you're hiring people online. When a potential new client approaches me, I always suggest that we have a quick phone chat or video meeting. I've found that this is the best way for both parties to gain a little more information. If we do work together, it can also help alleviate the slightly weird feeling of never having interacted other than through text.\n\nIf you're struggling to find good content writers, consider suggesting a five-minute phone call. This can help you filter out those who aren't serious and give you the chance to look for red flags.",
                    "score": 3,
                    "author": "happygrouse"
                }
            ]
        },
        {
            "level": 0,
            "comment": "As a non-writer i will now sign up for these sites and begin my freelance writing career!",
            "score": 18,
            "author": "bakutehbandit",
            "replies": [
                {
                    "level": 1,
                    "comment": "You'll fit right in.",
                    "score": 15,
                    "author": "kjb123etc",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They might actually be in the top performers. I’ve also ran into 2nd grade level copy pasta articles recently.",
                            "score": 5,
                            "author": "SuccessISthere",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "😂 \n\nThere's a good chance it was AI-written. That's becoming rampant, unfortunately.",
                                    "score": 3,
                                    "author": "kjb123etc",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 4,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Good [insert time of day greeting], [insert pronoun]!",
                                                    "score": 3,
                                                    "author": "diffcalculus",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Do another case study for web and graphic designers if your budget allows. I'm an experienced designer myself but struggling to find gigs",
            "score": 13,
            "author": "wookeydookey",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I charge $0.50/w and up, depending on the work, and I work from my long-term network and referrals (never through mills). I get a lot of repeat business, so I assume that means my work is acceptable.\n\nThe answer for how to get good writers is, on the surface, \"already know them\". But if you dig deeper, the real answer is: don't look for writers, look for professionals in your industry with robust documents, and ask *them* for writing contacts.",
            "score": 12,
            "author": "PenandSquid",
            "replies": [
                {
                    "level": 1,
                    "comment": "Love it, thanks. I would be happy to pay over $0.50/word for great content.",
                    "score": 4,
                    "author": "kjb123etc",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "RIP inbox",
                            "score": 2,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I charge the same and work with awesome companies that refer me out, and a great network that send referrals, and post on Linkedin daily. Always keeps me busy. Never had to turn to job boards.",
                    "score": 2,
                    "author": "TheWriteDestination"
                }
            ]
        },
        {
            "level": 0,
            "comment": "As a freelance writer, this is fascinating. I like getting to see what things look like from the other side. \n\nI’m not surprised there were issues on the lower paying tiers. Writing good content takes time, and I’d expect problems from writers rushing to churn out tons of words at a low rate. \n\nIt’s interesting that the same problem occurred at the higher tier prices. I do wonder if part of the problem is that the content mills and agencies take a cut of the pay. Even if you’re paying .50/word, the writer might be receiving less than that and still needing to rush through jobs. \n\nI applied for one or two content mills when I first thought about freelance writing. It was fine for dipping my toe into paid writing while I still had a day job, but there’s no way I could make enough to write full-time and afford to live in my city for what they offered their writers. \n\nMost of my favorite clients that I work with are ones I work with through Upwork or that I work with directly. I don’t like the fee that Upwork takes out of my price, but it’s worth it for some ongoing projects. I only take one-off projects if they sound fun or if I think they’ll be good for my portfolio. \n\nI do love that you included how to write a job description. If every job description were that clear, it would make it so much easier for me to give potential clients exactly what they are looking for. \n\nYou also mentioned a few sites I’d never heard of that sound intriguing as a writer. So, even though I’m not your intended audience, you provided a ton of useful information.",
            "score": 9,
            "author": "edemolat",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's great feedback, thank you. \n\nI definitely had some individuals who charged $0.40 and up try to pass off plagiarized work as their own. But you're right that it was more common among at the lower tiers (of freelancers and content services/mills). \n\nFrom a writer's perspective, is there anything you wish I'd said differently about what to include in a job description, or the hiring process I recommended?",
                    "score": 5,
                    "author": "kjb123etc",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The process that you outlined sounds like a good system and sets the writers up to provide good content. \n\nThe only part that is slightly annoying as a writer is the filtering test word. Every once in a while I skip over ones that have a test word because I put a lot of time into my applications and feel like it should be obvious from my answers that I read the entire job description. \n\nBased on your insight, I can see why the test word is helpful though. I have noticed that I get replies back more quickly when there is a filtering test word, so that probably indicates that they work. \n\nI also think that most of the ones I’ve skipped over with a test word had something else odd in the wording of the job description. I don’t automatically skip them every time. \n\nAs a writer, I pay attention to the tone that I get from clients in the job description and throughout the hiring process to evaluate whether I want to work with them. I want to work with people who are pleasant to interact with. I don’t know exactly how to describe the red flags without quoting specific job descriptions, but sometimes I can tell in advance that I’m not going to enjoy a job even if I like the topic and the pay is great. I don’t apply to those. It doesn’t sound like that was an issue with your experiment, but it’s something that might be helpful to other people looking to hire writers.",
                            "score": 2,
                            "author": "edemolat",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Very interesting. Thanks so much for taking the time to respond!",
                                    "score": 2,
                                    "author": "kjb123etc"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Express Writers just hires UpWork writers. Not saying that's good or bad. But you're basically just paying them to be the middle man for their source of vetted freelance writers. At least this is how it was back when I wrote for them a few years ago. One of the managers who was really awesome left and started her own agency and things turned shitty from a freelancer perspective (docking pay for client requested edits, unreasonable timelines) so I bailed.\n\nFunny enough, after that I ended up getting hired by another agency through UpWork and realized that's all these agencies do now. So then I just started finding my own clients. It's just a side hustle for me so having 2 or 3 projects per month is all I really need. I know I'm biased but that's the way to go. Find a writer you like and work directly with them. You may even save money in the long run because you're not paying middleman agencies or freelance platform fees (or both if you're working with an agency hiring freelancers through UpWork).",
            "score": 7,
            "author": "SofaProfessor",
            "replies": []
        },
        {
            "level": 0,
            "comment": "As someone who is doing freelance content writing and trying to find opportunities to collaborate with good companies these stats are really disheartening.\n\nFrom this side (I’m on a few of the sites mentioned here) there is a lot of bullshit/scamming/exploitation I’ve experienced as well.\n\nI’m an RN and certified ESL teacher, and my niches are health and medicine and more specifically dissemination of health research, maternal/child health, child growth and development, education and learning, language, science etc. \n\nA few examples of some of the bad experiences I’ve come across: \n\nBeing hired to write an article about weight loss related to diabetes.. so prior to writing I reached out to clarify their needs. Did they want an article focused on how unexpected weight loss can be a sign of diabetes? Did they want an article discussing how losing weight can reduce the risks associated with diabetes? Their answer was vague and non-committal, but they mentioned to include CBD for weight loss. \n\nI wrote an article that included BOTH of the aforementioned angles, and sent the article back with the note that there is no evidence of CBD supporting weight loss in diabetes, and gave cited sources from reputable medical journals. Well, they refused to pay me and told me that I didn’t give them what they wanted. \n\nAnother wanted an article on the difference between Asperger’s and Autism. Spoiler alert: there isn’t really one. So I wrote an article that explored the historical roots of Asperger’s (Nazi Germany FYI) and autism, how we got to ASD from that history, the role of parents of children with ASD in the evolution of the diagnosis, where things stand today and how our understanding of both labels has been informed in medicine. \n\nI submitted the article and was met with a response that I didn’t answer the question and wouldn’t receive payment until it was re-written. I did answer the question, again with cited sources based in evidence, but the answer wasn’t useful for their narrative.\n\nI would say 2/3 of my “leads” turn out like this.. most do NOT want actual evidence-based factual content, they want you to spin lies and promote some bullshit to lure people with click bait and sell them snake oil. \n\nUnfortunately, I’m not willing to attach my name to those things and wont compromise intellectual integrity in my writing. So that means that a significantly smaller market for me and a lot more work and energy put into leads that end up as a waste of time.\n\nIt can be extremely discouraging to find good partnerships in a market saturated with “low-quality high-quantity” bullshit. \n\nThanks for this perspective! I’m going to give Express Writers and r/hireawriter a try now.",
            "score": 45,
            "author": "unicornpolkadot",
            "replies": [
                {
                    "level": 1,
                    "comment": "Colleague, you must vet your clients better! If they give you vague answers, especially when you ask them more than once, don’t waste your time writing the article. Or require in your onboarding that they approve the outline with a 10% payment.\n\nSeems like you’ve been around the block enough now to follow your gut. I’m also a writer (cannabis and finance). I feel for you. Learning the red flags for clients sucks.",
                    "score": 20,
                    "author": "dmbf",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; 10% payment.\n\n*non-refundable*",
                            "score": 7,
                            "author": "diffcalculus"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Wow, that's rough. Sorry to hear how hard it is.\n\nFor the record, I didn't dispute a single assignment for this article. Everyone got paid quickly. Even the plagiarists (because I wanted to use their excerpts as examples in my article).",
                    "score": 8,
                    "author": "kjb123etc"
                },
                {
                    "level": 1,
                    "comment": "If you're still freelancing, please message me your rates.  Fwiw, I outsource a lot of content and I'm currently working on a health-related science and fact-based (longevity/anti-aging) site.",
                    "score": 5,
                    "author": "mullman99"
                },
                {
                    "level": 1,
                    "comment": "If they mention CBD... It's kind of obvious they'll use that article to create a backlinks to some CBD company, that's why they don't care about the angle or anything else except you put that keyword inside...",
                    "score": 2,
                    "author": "snopeal45"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Random scam I encountered a couple of years back related to content writing that I thought I'd share - I thought it was pretty clever I gotta say:\n\n - Using one of the above sites, paid $40 for a 1000 word post.\n - Scammer accepts job.\n - Scammer hires another content writer to do the job.  A high end content writer who would do that for about $100.\n - Scammer then sends me the content they wrote and I pay them.\n - Scammer fleeces the initial content writer.\n\nWhat I was getting was excellent content at a great price that was 100% unique and passed copyscape etc.  What I didn't realize was the scammer wasn't the original writer of the content.\n\nA couple months down the road I'd get raging e-mails from the original writers, accusing me of theft etc because they discovered their content on my site and upon being shown proof, I'd have to remove the content.\n\nWas such a pain in the ass and glad I have regular content writers now but man I respected the hustle.",
            "score": 27,
            "author": "youreapie",
            "replies": [
                {
                    "level": 1,
                    "comment": "I mean if you took down the content then you too were scammed as well.",
                    "score": 19,
                    "author": "RoundTableMaker",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh yes I know - scammer was able to scam both me and the person who wrote the content and I had no way of getting my money back.",
                            "score": 9,
                            "author": "youreapie",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "what site was this through?",
                                    "score": 3,
                                    "author": "RoundTableMaker",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "This was iwriter.  I've actually found some great writers via there who I now work with outside of writer (as their fees are brutal especially for writers).",
                                            "score": 8,
                                            "author": "youreapie",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Wow, that is... diabolical. And impossible to check for or catch.",
                    "score": 6,
                    "author": "kjb123etc",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "This is the industry I'm in and I've noticed the pandemic has turned everyone in Africa and the Middle East into copy and content writers. The influx has been quite a thing to see. And it happened very quickly.\n\nSorry you got scammed man. I feel for you and the poor guy that worked for half pay or less.",
                    "score": 6,
                    "author": "TheMentalMarauder"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Great post!\n\nNow tell us how much money you spent.",
            "score": 24,
            "author": "TheOneNeartheTop",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 14,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yea the OP said that. We all read that. He wants more exact figures.",
                            "score": -8,
                            "author": "RoundTableMaker",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Just do the math yourself...\n\n359 articles * 1800 avg. words per article * .025 average price per word\n\n= ~$16,000",
                                    "score": 10,
                                    "author": "leesfer",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Why would i do the math? I'm not the one who qsked for the info.",
                                            "score": -3,
                                            "author": "RoundTableMaker",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; Why would i do the math?\n\nTo add something useful to the conversation.",
                                                    "score": 3,
                                                    "author": "leesfer",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": " With friends like this who needs enemies.",
                                                            "score": 3,
                                                            "author": "RoundTableMaker"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "There is obviously an imbalance. These scammers are making money while many great writers are starving",
            "score": 6,
            "author": "wookeydookey"
        },
        {
            "level": 0,
            "comment": "I had one experience with fiverr.  Paid someone to help me with my logo.   Sent him an idea I had created as reference.  He sent a couple of options that we're no where close.  And at one point sent my own reference logo back to me as his lol.  I gave up then and found an alternative. \n\nScammers is right.  Which is unfortunate because I'm sure there are legitimate people on there.",
            "score": 5,
            "author": "thisisfunz"
        },
        {
            "level": 0,
            "comment": "Quick aside for marketers in B2B or in a more technical field. You're going to be disappointed more often than not with freelance writers. Why? Because: \n\n1. if your product is even somewhat technical and,\n\n2. you're serving a specific market segment, and\n\n3. you actually want to say something that matters...\n\n...it's going to be extremely difficult to find a stranger to capture these things without an excessive amount of training. \n\nSome things that have worked for me in the past:\n\n* Find journalists or bloggers already in your industry and ask if they'll do some freelance on the side for you. \n\n* Write extremely detailed outlines with sources and have a freelancer turn it into a narrative for you.\n\n* Write the article yourself (quickly - don't worry if it's rough) and hire an editor to rewrite and reassemble it for you.\n\nIs this automated? No. Is it cheap? No. But will it actually produce results that matter? More likely than hiring a fiver freelancer who has 8 minutes of experience with your brand.",
            "score": 13,
            "author": "sbcmurph",
            "replies": [
                {
                    "level": 1,
                    "comment": "Great tips.",
                    "score": 3,
                    "author": "kjb123etc"
                },
                {
                    "level": 1,
                    "comment": "As a freelance writer, yup. Though, for the third option, I would suggest looking for writers. Editors don’t generally rewrite unless they offer writing services as well and if it’s not their main focus they won’t be as good.\n\nTbh honest the second is my favorite when writing for an industry I don’t know well. The outline doesn’t even have to be extremely detailed. Make this outline from these sources into a piece like these. Love it.",
                    "score": 2,
                    "author": "dmbf",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Content writing is something that requires a certain level of devotion, and available time. And frankly some intelligent creativity ... the combination of all 3 is rare in individuals, the world over, and very few are capable of tuning into another persons idea *enough* to even be in the ballpark of what they want. Sorry this happened but good lessons and takeaways.",
            "score": 4,
            "author": "NesaraSteve"
        },
        {
            "level": 0,
            "comment": "I spent years and years looking for good writers going through a similar experience as you found in terms of quality.  Anyone can claim to be a writer.  IMO this is a service where you truly get what you pay for.\n\nDepending on what your budget is and the quality you are looking for, I suggest taking a look at professional/freelance journalists who have been published in \"known\" media.  They may not be as expensive as you think, especially if they are a subject matter expert and don't require a ton of research to get up to speed, but I've gone this route and the results have been great.\n\nEdit: Not to say there aren't great freelance writers that aren't journalists, I have just had a harder time finding them among everyone offering writing services.  If the content is a key part of your strategy, it's worth taking a look.",
            "score": 9,
            "author": "always_keep_moving",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This is quite the insight, thanks for sharing. As a marketer, this affects me on a few levels, I'll save this post for reference and check your article soon, great work!",
            "score": 3,
            "author": "Not-A-Name-001",
            "replies": [
                {
                    "level": 1,
                    "comment": "Awesome, I hope it helps!",
                    "score": 2,
                    "author": "kjb123etc"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That's awesome. So I can literally just write my genuine impressions and understandings of what the client wants, double check with them for any adjustments they want to make, then I'd be better than 90% of the competition, where it only takes me a few hours to actually write to make $2k.\n\nOut of the low-effort, attempted-automation solutions for content writing, the diamond in the rough?\n\nI'm learning new things about industries every time, man.\n\nThanks for sharing this.",
            "score": 3,
            "author": "daddy78600",
            "replies": [
                {
                    "level": 1,
                    "comment": "The bar is very low, that's for sure.",
                    "score": 3,
                    "author": "kjb123etc",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Awesome post",
            "score": 3,
            "author": "ImZanex87",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Thank you for sharing your experience.  It's very useful and I will certainly keep this in mind when looking for a copywriter.  All the best for your blog!",
            "score": 3,
            "author": "TotallyDifferentBG",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I have actually noticed this lately on many search results. Most of the “blogs” that come up on google searches are full of these awful plagiarized or AI written articles, and of course they are littered with more ads than content. \n\nSomething needs to change.",
            "score": 6,
            "author": "SuccessISthere"
        },
        {
            "level": 0,
            "comment": "Wooow, the stats are crazy!! I'm reading your blog now, and I love the way you laid down the stats.   \n\n\n... I'll just go now and share it with a few people, just to ruin their day lol",
            "score": 5,
            "author": "PracticalMarketer",
            "replies": [
                {
                    "level": 1,
                    "comment": "Haha, thanks. \n\nYes, spread the bad word! Ruin all the days!",
                    "score": 2,
                    "author": "kjb123etc",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm maniacally laughing as we speak. \n\nJokes aside, great article. Hiring freelancers is such a gamble in my line of work, and the good ones get snatched away pretty quickly.",
                            "score": 3,
                            "author": "PracticalMarketer",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, good freelancers are hard to come by. There are so many bad ones. \n\n\"If you can't do, freelance.\"",
                                    "score": 2,
                                    "author": "kjb123etc"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This has been a struggle as well. Slowly building a network of sites and having the backend to feed it but he content sourcing has become a struggle to find something affordable and content worthy. I would be willing to pay a little more for something that I can build a partnership with and get reliable content for my network.",
            "score": 2,
            "author": "boxxa"
        },
        {
            "level": 0,
            "comment": "Thank you for this. Have used The HOTH for blog content but have not been very happy with the results. This gives me a few new avenues to try out.",
            "score": 2,
            "author": "bhc317"
        },
        {
            "level": 0,
            "comment": "Great job, OP! Thank you!",
            "score": 2,
            "author": "fckthedamnworld"
        },
        {
            "level": 0,
            "comment": "I'd never considered hiring content writers. Most I've done is hire freelance translaters for the content I already had.\n\nThanks for reminding me that this exists, and for such a thourough comparative.",
            "score": 2,
            "author": "rubs_tshirts",
            "replies": [
                {
                    "level": 1,
                    "comment": "No problem!",
                    "score": 2,
                    "author": "kjb123etc"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thank you for sharing. Very interesting.",
            "score": 2,
            "author": "Mr_OTG",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Great exercise! Thanks for writing this up.",
            "score": 2,
            "author": "ChiefMustacheOfficer",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Great post. We also have had an overall positive experience with Upwork. Needle-in-haystack analogy has truth to it. People aside, I say overall b/c upwork states in their ToS that they maintain the rights to use, alter, or both, any material that comes through their site. Audio, video, text, whatever. Most people don’t read the ToS. Just fyi.",
            "score": 2,
            "author": "Threesqueemagee",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh wow, that's good to know about the ToS. I definitely didn't read it. Thanks.",
                    "score": 2,
                    "author": "kjb123etc"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm planning on doing a little bit of writing work online to gather some money to get started with my business. Any tips on what you were looking for or what I can do to stand out?",
            "score": 2,
            "author": "kvlkar",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This is amazing. I just want to say thanks, I will save this and refer to it when I need a writer",
            "score": 2,
            "author": "erelim",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This is sad and inspiring, especially since I want to get into content writing myself.",
            "score": 2,
            "author": "tynar08",
            "replies": [
                {
                    "level": 1,
                    "comment": "The world needs more honest writers who actually give a shit.",
                    "score": 3,
                    "author": "kjb123etc"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Great post. As the owner of a copy and  content writing company, this makes me very happy indeed.",
            "score": 2,
            "author": "TheMentalMarauder",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This is great... I genuinely appreciate this quality information and also your sacrifices! Saving this for future references. Well done mate, thanks!",
            "score": 2,
            "author": "choffmasterlumpus",
            "replies": [
                {
                    "level": 1,
                    "comment": "No problem, thanks for saying so!",
                    "score": 2,
                    "author": "kjb123etc"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I loved both this post and your blog post. Thank for that",
            "score": 2,
            "author": "SubstantialCollar",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Oh yeah? How do we know you didn’t hire a writer to write up this post eh? Lol jk this is a great post. Saved!",
            "score": 2,
            "author": "SectorZed",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Wow this is very good to know! I have always found good writers and editors through LinkedIn through word of mouth.",
            "score": 2,
            "author": "jonkl91"
        },
        {
            "level": 0,
            "comment": "Because most are inspired by the second income hacking information supplied on TikTok",
            "score": 2,
            "author": "AcerTravelMate"
        },
        {
            "level": 0,
            "comment": "I'm a freelance content writer and what I hear the most is that writers take jobs for niches they dont understand, resulting in poor quality. \n\nMost of my clients come through LinkedIn or referrals from my network and past/current clients. I'd recommend asking your industry network for recommendations over hiring from job boards. That being said, I got my start on Upwork.",
            "score": 2,
            "author": "beige14"
        },
        {
            "level": 0,
            "comment": "This is one of the most useful posts I've ever found on Reddit (comments are gold too).",
            "score": 2,
            "author": "majin_stuu",
            "replies": []
        },
        {
            "level": 0,
            "comment": "solid advice, thanks!!",
            "score": 2,
            "author": "furyofsaints",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Wow thanks for doing this experiment... I've only used Upwork and it is very hit or miss. I probably don't have the best hiring process though lol.",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "A good hiring process makes all the difference with Upwork for sure.",
                    "score": 2,
                    "author": "kjb123etc"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This same thing happens with whiteboard explainer videos... Most freelancers are actually just using a program that generates a video and just pop your logo on it. So annoying",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Very interesting content, thanks. As others have said, this exhausting nature of the search is why people tend to stick with clients/writers who work. \n\nI've made hundreds of thousands of dollars off Upwork. Almost all of it from clients I've worked with for multiple years now. Almost all of them frequently ask me to stop freelancing and come full-time with them.\n\nI don't know why people hate on Upwork, generally. There are some great clients and some great freelancers on there. But you do have to weed to find them.",
            "score": 2,
            "author": "Full_Acanthopterygii",
            "replies": []
        },
        {
            "level": 0,
            "comment": "A long time ago, I wanted to build a website similar to buzzfeed, scary mommy, you know those big websites. \n\nI quickly found out that good authors and content writers are incredibly hard to find. I ended up giving up.",
            "score": 2,
            "author": "Apprehensive_Park_62"
        },
        {
            "level": 0,
            "comment": "How much did you pay for this post and where did you find the writer? It’s good quality! 😜",
            "score": 2,
            "author": "European_Ape",
            "replies": []
        },
        {
            "level": 0,
            "comment": "As a heads-up, the Mint Copywriting Studios link you posted is broken.\n\nHere is an archive of the page you intended to show for plagiarism:\n\nhttps://web.archive.org/web/20210907152507/https://www.mintcopywritingstudios.com/blog/fintech-content-brief\n\nEdit: Sorry, I forgot to mention where in your blog post. It's under the Verblio part.",
            "score": 2,
            "author": "bjlwasabi",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Nice post! Can you do one for developers?",
            "score": 2,
            "author": "throaway420blaze",
            "replies": [
                {
                    "level": 1,
                    "comment": "Interesting, like hire a bunch of developers to build simple websites or MVP apps or something?",
                    "score": 2,
                    "author": "kjb123etc",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah! Would be awesome to read a report on that, as a developer",
                            "score": 2,
                            "author": "throaway420blaze",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Cool, no promises but I'll give it some thought.",
                                    "score": 2,
                                    "author": "kjb123etc",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thanks! :)",
                                            "score": 2,
                                            "author": "throaway420blaze"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Question for OP: did you happen to hire Verblio? I hired them for a year and I would say a 3.5/5 overall. Pricing seemed reasonable. I did not research their content sources (I.e. check to see if there was any plagiarism) because I hired them to give me honest and “fresh” content and also because I don’t have time to write it myself. I’m possibly going to hire them again for another year or look into other options. I appreciate your post and thoughtfulness.",
            "score": 2,
            "author": "Viper01MHC",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yep, several people recommended Verblio to me so I tried it out.\n\nTwo different Verblio writers submitted articles to me and both of them were plagiarized/spun.\n\nDirect link to the Verblio review in my full article (with excerpts so you can see the stolen content): https://growthbadger.com/hire-a-writer/#9_Verblio",
                    "score": 2,
                    "author": "kjb123etc",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wow, that is a great overall review. Excellent work!",
                            "score": 2,
                            "author": "Viper01MHC",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "As a writer myself, this is quite sad to see. But also somewhat motivational, as it shows I must be providing insane value to my clients. Or I’m undercharging! Haha",
            "score": 2,
            "author": "NormanieCapital",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Do you think the reviews people leave on their profile reflect their quality?",
            "score": 2,
            "author": "melancholichamlet",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Very informative freelance copywriter post! TY!",
            "score": 2,
            "author": "Dr_JeJo",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Can you check the readability/education level of each writing and include that in the stats?\n\nThere are some websites that grade \"what education level\" writing is at. I'm just curious what grade level good content is written at vs bad content.",
            "score": 2,
            "author": "diff2",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I hire writers all the time, and we switched to no more writers.\n\nAnd rankings I think went up bout 10x-20x for the projects that we had that were most funded.\n\nIt turned out to be even more profitable to just give blog post writing work to the biz owner to do... and they do a better job, and we focus on ranking THAT instead of ranking petty content.",
            "score": 2,
            "author": "jakeinmn",
            "replies": []
        },
        {
            "level": 0,
            "comment": "What was the subject that you asked for content on?",
            "score": 2,
            "author": "Chris_in_Lijiang",
            "replies": [
                {
                    "level": 1,
                    "comment": "A blog post about how to write a content brief.",
                    "score": 2,
                    "author": "kjb123etc"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is just depressing. But thank you for your research!!",
            "score": 2,
            "author": "goodvibesandsunshine",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Wow! Thanks for sharing. This is quality content for this sub. We need more people sharing useful information like this 👍",
            "score": 2,
            "author": "alb3rtuk",
            "replies": [
                {
                    "level": 1,
                    "comment": "You're very welcome. Thanks for the kind words.",
                    "score": 2,
                    "author": "kjb123etc"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Fantastic post, thank you!",
            "score": 2,
            "author": "nerval",
            "replies": [
                {
                    "level": 1,
                    "comment": "You're welcome! Thanks for the kind words.",
                    "score": 2,
                    "author": "kjb123etc"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Very useful! Thanks for sharing, will need these websites one day.",
            "score": 2,
            "author": "moneyshome",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Great Evaluation\n\nRegards  \n[Seoanalyzer.pro](https://Seoanalyzer.pro)",
            "score": 2,
            "author": "SeoAnalyzer_PRO",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I hired Textbrokers once.\nNever again.\nThe content seemed to be written by AI and a programmer that can read but does not speak English.",
            "score": 2,
            "author": "Admirable_Bass8867",
            "replies": []
        },
        {
            "level": 0,
            "comment": "bookmarking this. thanks",
            "score": 2,
            "author": "talkplantome",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Your research will not be in vain.\n\nI’m too poor for gold, but have this my good man .\n\n⠀⠀⠀⠀⠀⣤⣶⣶⡶⠦⠴⠶⠶⠶⠶⡶⠶⠦⠶⠶⠶⠶⠶⠶⠶⣄⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⣿⣀⣀⣀⣀⠀⢀⣤⠄⠀⠀⣶⢤⣄⠀⠀⠀⣤⣤⣄⣿⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠿⣿⣿⣿⣿⡷⠋⠁⠀⠀⠀⠙⠢⠙⠻⣿⡿⠿⠿⠫⠋⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⢀⣤⠞⠉⠀⠀⠀⠀⣴⣶⣄⠀⠀⠀⢀⣕⠦⣀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⢀⣤⠾⠋⠁⠀⠀⠀⠀⢀⣼⣿⠟⢿⣆⠀⢠⡟⠉⠉⠊⠳⢤⣀⠀⠀⠀ ⠀⣠⡾⠛⠁⠀⠀⠀⠀⠀⢀⣀⣾⣿⠃⠀⡀⠹⣧⣘⠀⠀⠀⠀⠀⠀⠉⠳⢤⡀ ⠀⣿⡀⠀⠀⢠⣶⣶⣿⣿⣿⣿⡿⠁⠀⣼⠃⠀⢹⣿⣿⣿⣶⣶⣤⠀⠀⠀⢰⣷ ⠀⢿⣇⠀⠀⠈⠻⡟⠛⠋⠉⠉⠀⠀⡼⠃⠀⢠⣿⠋⠉⠉⠛⠛⠋⠀⢀⢀⣿⡏ ⠀⠘⣿⡄⠀⠀⠀⠈⠢⡀⠀⠀⠀⡼⠁⠀⢠⣿⠇⠀⠀⡀⠀⠀⠀⠀⡜⣼⡿⠀ ⠀⠀⢻⣷⠀⠀⠀⠀⠀⢸⡄⠀⢰⠃⠀⠀⣾⡟⠀⠀⠸⡇⠀⠀⠀⢰⢧⣿⠃⠀ ⠀⠀⠘⣿⣇⠀⠀⠀⠀⣿⠇⠀⠇⠀⠀⣼⠟⠀⠀⠀⠀⣇⠀⠀⢀⡟⣾⡟⠀⠀ ⠀⠀⠀⢹⣿⡄⠀⠀⠀⣿⠀⣀⣠⠴⠚⠛⠶⣤⣀⠀⠀⢻⠀⢀⡾⣹⣿⠃⠀⠀ ⠀⠀⠀⠀⢿⣷⠀⠀⠀⠙⠊⠁⠀⢠⡆⠀⠀⠀⠉⠛⠓⠋⠀⠸⢣⣿⠏⠀⠀⠀ ⠀⠀⠀⠀⠘⣿⣷⣦⣤⣤⣄⣀⣀⣿⣤⣤⣤⣤⣤⣄⣀⣀⣀⣀⣾⡟⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⢹⣿⣿⣿⣻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠁⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠛⠛⠛⠛⠛⠛⠛⠛⠛⠛⠛⠛⠛⠛⠛⠛⠛⠛⠃⠀⠀⠀⠀⠀",
            "score": 2,
            "author": "YanDoe",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'll take it, thanks!",
                    "score": 2,
                    "author": "kjb123etc"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My wife plans on entering the freelance market. In my opinion, she's probably a higher tier writer. \n\nAny suggestions on how to market her skills and establish herself in the freelance space when there are clearly so many low quality writers out there?",
            "score": 2,
            "author": "ckjazz",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Sad to see so many scammer online",
            "score": 2,
            "author": "Low-Improvement-4865"
        },
        {
            "level": 0,
            "comment": "Wow, this is very insightful. Appreciate the depth of your research and I like how you presented this is a clear and concise way. I was actually thinking to do an experiment as well by writing an article myself and then get freelances to optimize them and seek affiliate marketing opportunities. Any chance you've done sth similar?",
            "score": 2,
            "author": "Nikolafy",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I'm in sales in a technical industry. I'm not a writer by any means, but I am good at writing (think process/documentation, breaking down technical topics to non-technical audiences).\n\n\nAm I hearing that the bar is so low that i could try to start writing in my niche and be able to get 30-50 cents a word?",
            "score": 2,
            "author": "Jiggynerd",
            "replies": [
                {
                    "level": 1,
                    "comment": "The bar in terms of quality is low enough that you could probably excel. But that doesn't mean you'd be able to get a lot of high-paying clients out of the gate. \n\nEven if most of your competitors are plagiarists, their plagiarism goes largely undetected. And unlike you, they have portfolios/reviews/relationships.",
                    "score": 2,
                    "author": "kjb123etc",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks. I was doing some other digging and it seems that I could probably earn more faster doing technical consulting in the space I'm experienced at as opposed to trying to build up writing.",
                            "score": 2,
                            "author": "Jiggynerd",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I agree. Great post! \n\nAlso interesting to hear about writers having trouble with their clients.",
            "score": 2,
            "author": "moosevan",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Thank you for taking the time to share.\nI’m currently learning copywriting via AWAI and was pondering setting up Fiverr or Upwork.\n\nBut now 😬 not sure if that’s for me 😅",
            "score": 2,
            "author": "Impossible_Umami",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I never worked on any job board sites for freelance writers, because, when I looked, it was entirely low-paying work or companies that didn't really want to hire a writer for their skills, but just to churn and burn content no matter the quality. \n\nI charge TONS more than what you're prices are here, and there's very good reason: I'm a good writer, that knows how to bring in leads with my content and position a brand as an authority on a topic. I have worked in-house as a writer, and with marketing agencies in addition to internships and a degree in communications. \n\nBasically, what I'm saying is- you get what you pay for in most cases. Sure, you'll definitely find people charging more than the quality of their writing commands, but most good writers are worth paying more for.\n\nLuckily, I've managed to avoid job boards and have companies seeking me out for the sheer reality that a lot of people have a hard time finding good writers.\n\nMy advice:\n\nSearch for writers on social media. There, you can actually see the content they produce before you hire them. You'll see if they understand marketing and content, how they write, how they position themselves (it's a good indicator they'll know how to position you)... \n\nGranted, a lot of these writers will be more expensive, but if you want to stop burning through writers, you'll likely have to pay a little more (and you should also have the right expectations, and a good solid writing process in place within your company first).",
            "score": 2,
            "author": "TheWriteDestination",
            "replies": []
        },
        {
            "level": 0,
            "comment": "These findings are pretty much in line with my own experience. I own an investment fund management company and wanted to make use of social media to help establish my business’ is credibility by publishing various articles on my website blog. Naturally, my first port of call was to see if I can find a competent content writer at a reasonable price. I tried both fiverr and up works and simply could not find anybody that produced anything worth publishing at all. Eventually I just gave up and that project now sits in limbo. It is so very frustrating and sad",
            "score": 2,
            "author": "hbvzyl",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I'm a freelance copywriter and I'm not surprised to see those kinds of stats. The $0.01/word 100 articles per month job posts on Upwork must be out there for a reason...",
            "score": 2,
            "author": "Maistereq"
        },
        {
            "level": 0,
            "comment": "Thanks for sharing, this is actually pretty interesting",
            "score": 2,
            "author": "hyperbubblesLeo",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Interesting. I submitted many applications with some samples i made from scratch and over delivered hoping to get hired. Then they ghosted me",
            "score": 2,
            "author": "TroyElric",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Interesting! \n\nI’m a full-time professional writer and editor with a regular job. But I’ve always picked up side gigs writing and editing, in part to earn some extra money but also to expand the types of writing and editing I do to add it to the resume. And sometimes just out of curiosity about a specific client or project.\n\nIt’s all word-of-mouth referrals and generally pays $70-90/hr (I’ve never worked for $/word but my hourly rate usually works out to $0.30-0.50 per word.) I’m so glad I don’t use these content mills to find work!\n\nI thought your experiment was really eye-opening. I’m surprised by the results you got for high-priced services, though as an editor who commissions freelance pieces I know quality can be a real mixed bag and hard to judge in advance, even for a writer with a great reputation.\n\nMany years ago, I picked up some work on Elance, which was the predecessor to Upwork. I had a repeat client start asking me to use an article spinner. I told him our work relationship was done. It’s an insult to any writer who cares about their craft and reputation (even if it’s not bylined work) to use an article spinner.\n\nAt the moment I’m trying to shift my side gigs more into strategy, to tie the content directly to a specific goal or business objective and to be able to track and measure that. (A lot of my side gig work is for non-profits and institutions, so it’s usually more geared toward advocacy than driving revenue.)\n\nI think unless a writer is a subject-matter expert in a really niche area, it’s hard to excel in content without being able to understand how your work ties into broader business goals.",
            "score": 2,
            "author": "shinyonn",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I am a freelance content writer and I agree with you. Too many spammers have entered the field",
            "score": 2,
            "author": "ResponsibleMind3031",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Content creation is one of the reasons why the internet is full of bad advice, mis information and listacles.\nThere is a big difference between substance and content.",
            "score": 2,
            "author": "brick_windows"
        },
        {
            "level": 0,
            "comment": "thank you",
            "score": 2,
            "author": "JosephRJennings",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Thanks for sharing! Very informative!",
            "score": 3,
            "author": "consultali",
            "replies": [
                {
                    "level": 1,
                    "comment": "You're very welcome. I was definitely scratching my own itch (at least at first).",
                    "score": 2,
                    "author": "kjb123etc"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My daughter is excellent at research and writing. I will definitely share these stats with her. She's looking for work and thanks to you, I know where to send her. Thank you!",
            "score": 4,
            "author": "chevyliebling",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Upwork and bidding sites pretty much devastated the freelance writing marketplace by around 2009. It lowered rates and brought less talented writers who would work pennies for employers who began to devalue the skill involved and began to seek out cheaper, poor writing just to fill content needs. Before I walked away my rate was 500$ for 300 words and I didn’t beg or deliberately undersell myself to do it.",
            "score": 3,
            "author": "Withnail-",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I am a freelance writer. I used Upwork for years, and it’s alright. But in recent years Fiverr has become far and away the best freelance site. I suggest you check it out. \n\nShameless plug: search username azimm1979 and tell me you found me through Reddit for a discount.",
            "score": 3,
            "author": "azimm1979",
            "replies": [
                {
                    "level": 1,
                    "comment": "This comment feels like scammer bullshit you see on Fiverr.\n\nAs a freelancer of the past 10+years, Fiverr is the absolute bottom of the barrel. I wouldn't be caught dead on that platform. \n\nIt's a blight on the freelance market.",
                    "score": 16,
                    "author": "m_gartsman",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Fiverr is like McDonald's, good enough if you are fine with the quick and dirty approach.",
                            "score": 5,
                            "author": "izybit"
                        },
                        {
                            "level": 2,
                            "comment": "Thanks for your opinion. The reason I like Fiverr as a vendor is because I advertise my skills and customers come to me. I get to choose which gigs I accept. On sites like Upwork, customers list the job they need done and vendors bid for their work. In my opinion, the first scenario is more friendly to vendors.",
                            "score": 3,
                            "author": "azimm1979"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thanks. I tried Fiverr as part of this and wasn't impressed. But it wasn't you :D.\n\nI've also used it for other things like basic design projects in the past, and that worked out well.",
                    "score": 2,
                    "author": "kjb123etc"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Online marketing is junk flyers of the new day",
            "score": 2,
            "author": "grownmanjanjan"
        },
        {
            "level": 0,
            "comment": "the fact you wrote an entire study that boils down to \"I thought i could get great content for dirt cheap\" is hilarious. there are quality writers available, you need to stop thinking anything below 50 cents a word is an acceptable rate and avoid content mills.",
            "score": 2,
            "author": "lynit"
        },
        {
            "level": 0,
            "comment": "Did you try copywriting softwares",
            "score": 1,
            "author": "Significant_Cry_6571",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, I tried several AI writers and none could put together a cohesive blog post. There's an excerpt in my full article if you want to see what I mean.",
                    "score": 2,
                    "author": "kjb123etc"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The two sites I really like to use you didn't even try one person from either. I don't really want to plug the sites  but [legiit.com](https://legiit.com) and BHW both have mechanisms to prevent fraud. legiit.com does escrow which I always love when buying a service online and BHW does shitlisting/banning and actively mediates complaints. There are hundreds of writers on both platforms.",
            "score": 1,
            "author": "RoundTableMaker",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I really do not understand why so many people pretend to be writers.\n\n&amp;#x200B;\n\nOn the other hand, I also have no idea how anyone producers good writing at less than $.50/word. I guess if you live in a developing nation maybe? But then how good is their writing going to be coming from a horrific education system of a developing nation with English as a second language?",
            "score": 1,
            "author": "deathnow8989"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": -1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "If I paid $1000 for a 2000 word essay, that better be a really damn good essay. All I'm saying.",
                    "score": 3,
                    "author": "glenlassan",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "You think over $0.50 per word is too cheap?",
                    "score": 2,
                    "author": "kjb123etc",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There are too many variables to determine what the right price should be for a specific content request.  Here are 3 examples:\n\n1. There are people that charge thousands of dollars for one sales letters because it converts directly into thousands or millions of sales, cost per word on that is way more than $0.50.\n2. Being a native speaker to the country you are writing for can also make a huge difference by knowing the nuances of that country's language.\n3. Is the content a white paper or a fluff piece?\n\nYou have to decide who your audience is, what the purpose is and what will relate to them the most.\n\nI generally don't look at it on a per word basis.  But rather, for example, say I need a great piece of content that is around 1000 words for a blog piece.  I ask myself things like: How much is an evergreen piece of content worth and how long would a great writer need to research, write and edit it properly?  On a per hour basis, what is a reasonable amount to pay a top expert in their field?  Depends where you are, but I can tell you that a top quality piece of 1000 words should take way more than 2 hours after revisions and edits.\n\nFor comparison, I've read the average screenplay is about 20,000 words and can take 2-3 months for a first draft from a professional writer.  They aren't cranking it out in a week.  I realize content articles are very different, but again, what I said earlier in the comments, find the best, don't base it off their rates, but off their past writing that is verified and published, and pay them as much as you can to keep them writing for you.\n\nThe opportunity cost of constantly finding new people is not worth it IMO.  Plus you'll have a consistent voice in your marketing efforts.  This is based on personally having years of needing content for all sorts of projects, so real firsthand experience.",
                            "score": 3,
                            "author": "always_keep_moving",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Absolutely. \n\nConversion copywriters, highly specialized subject matter experts, technical writers etc. all charge more and should.\n\nLots of good blog writers charge less though.",
                                    "score": 2,
                                    "author": "kjb123etc"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Are you able to publish data/crunch some raw numbers on this? You do some really interesting analysis off the back of this with raw data.",
            "score": 1,
            "author": "crossj828"
        },
        {
            "level": 0,
            "comment": "I have found buyselltext to be the best as far as quality and affordability. The best way would be to get industry experts to write the content, but that will usually be more expensive and harder to find writers.",
            "score": 1,
            "author": "ninjataro_92"
        },
        {
            "level": 0,
            "comment": "Wow, great article. Easy to read, informative. Now, how do we know you are not spamming? Lol (just kidding)",
            "score": 1,
            "author": "Aarmed11"
        },
        {
            "level": 0,
            "comment": "I used fiver for years. Paid about 20 dollars an article and could pump them out fast. Catchy headlines got clicks and made money for me.",
            "score": 1,
            "author": "agnosticautonomy",
            "replies": []
        }
    ]
}