{
    "id": "13rs76o",
    "score": 8,
    "title": "‘Euphoria’s Hunter Schafer Joins A24 Pop Music Epic ‘Mother Mary’ From Filmmaker David Lowery",
    "author": "AliceTheMagicQueen",
    "date": 1685046051.0,
    "url": "https://www.reddit.com/r/entertainment/comments/13rs76o",
    "media_urls": [
        "https://deadline.com/2023/05/mother-mary-hunter-schafer-joins-anne-hathaway-michaela-coel-in-a24-film-1235380054/"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Euphoria‘s Hunter Schafer has closed a deal to star opposite Academy Award winner Anne Hathaway and Emmy winner Michaela Coel in Mother Mary, the pop music epic marking writer-director David Lowery’s third film for A24 following his acclaimed efforts The Green Knight and A Ghost Story.\n\nThe forthcoming film to be released worldwide by A24 is an epic pop melodrama following a fictional musician (Hathaway) and her relationship with an iconic fashion designer (Coel).\n\nSources tell Deadline that Schafer will play Hilda, the assistant of Coel’s designer, Sam.\n\nMother Mary will film in Germany, with funding from Film- und Medienstiftung NRW and the DFFF. Lowery, Toby Halbrooks and James M. Johnston will produce alongside Jeanie Igoe of Homebird Productions and Jonas Katzenstein, Maximilian Leo and Jonathan Saubach of the Cologne-based augenschein Filmproduktion. Daniel Hart will pen the film’s score, with Jack Antonoff and Charli XCX to write and produce its original songs.\n\nSchafer has previously been in business with A24 as one of the breakout stars of the studio’s hit HBO drama series Euphoria, which has secured nine Emmys to date and was renewed for a third season early last year. The actress, who plays Jules — the love interest of Zendaya’s teenage drug addict, Rue — has in addition to her performance, drawn praise for her work co-writing the special episode “F**k Anyone Who’s Not a Sea Blob,” aired amidst Covid’s continuing impact in January 2021.\n\nMost recently wrapping a cameo role for Yorgos Lanthimos’ AND, Schafer will next be seen in Lionsgate’s Hunger Games prequel The Ballad of Songbirds and Snakes, as well as the Neon thriller Cuckoo which has her starring opposite Dan Stevens and Jessica Henwick. The rising star is represented by CAA, Untitled Entertainment and Sloane, Offer, Weber &amp; Dern.",
            "score": 1,
            "author": "AliceTheMagicQueen"
        },
        {
            "level": 0,
            "comment": "Very excited for this",
            "score": 1,
            "author": "BOEJlDEN"
        }
    ]
}