{
    "id": "13u3zv8",
    "score": 14430,
    "title": "‘The Little Mermaid’ Dominates Memorial Day Box Office With $118 Million Debut",
    "author": "misana123",
    "date": 1685289840.0,
    "url": "https://www.reddit.com/r/entertainment/comments/13u3zv8",
    "media_urls": [
        "https://variety.com/2023/film/news/little-mermaid-memorial-day-box-office-fast-x-disney-1235627238/"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "I just want a damn cel animated movie again please.",
            "score": 1059,
            "author": "blueberrybowler",
            "replies": [
                {
                    "level": 1,
                    "comment": "Problem is that cel animated movies started to trend out and make less money. IIRC The Princess and the Frog was Disney’s way to test the market for something like that and it made a fraction of what their CG animation stuff was doing. Public perception started to move towards “cel animated = straight to DVD quality” film.  \nEDIT: I get it, it’s cel animated, not cell",
                    "score": 311,
                    "author": "TheOriginalNemesiN",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I agree with everything you said, but damn…Princess and the Frog was fucking fantastic. If that’s gonna be their swan song, at least they went out with a banger.",
                            "score": 140,
                            "author": "tobylaek",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I also think it’s not really true. I think cel animated movies fell out of popularity more because Disney stopped making them due to costs rather than because audiences actually stopped liking them.",
                                    "score": 49,
                                    "author": "AJDx14",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "They also kinda fell out because they were becoming really derivative and not as good as the Disney Renaissance. Home on the range, brother bear, Atlantis.. they're not terrible, but they don't have the same feel that 88-92 had. The characters never landed in the cultural consciousness, no well known songs.. they were instantly forgettable.\n\nI hate that they stopped making 2D because of public perception shifting, when they weren't exactly putting out great 2D stories at the time",
                                            "score": 3,
                                            "author": "bonemech_meatsuit",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I miss 2D animation",
                            "score": 79,
                            "author": "Gold-And-Cheese",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Treasure planet was peak",
                                    "score": 42,
                                    "author": "Triggerz777",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yes it was",
                                            "score": 10,
                                            "author": "Logician22"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "It was, and it was also a box office flop",
                                            "score": 6,
                                            "author": "whelplookatthat",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Which is weird to me, since it was a god damn good movie. Not saying the best by Disney, but it was awesome. And tbh, if they were ever to make a live action of an animated movie, Treasure Planet would be one of the better.",
                                                    "score": 7,
                                                    "author": "Lynild"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "This why I watch anime lol. I have a strong distaste for 3D animation.",
                                    "score": 12,
                                    "author": "Zyvyn",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I love princess and the frog and the art style. I hope they can being that back.",
                            "score": 22,
                            "author": "whopperlover17",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "It’s also super expensive and time consuming. Which is a big reason CG animation took such a strong hold. \n\n2D CG animation is getting better and better. I think animation will trend back towards the traditional style using the 3D tools (I think most anime are made this way now), but the shift in the west will be slow.",
                            "score": 74,
                            "author": "alienith",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Bring back flash! Homestarrunner will once again rule the world! /s",
                                    "score": 45,
                                    "author": "secret_hidentity",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "God the animation in that movie felt so *good*. It really brought back the feel of the 80's-90s golden era for me.",
                            "score": 24,
                            "author": "TheGoodIdeaFairy22",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "With kids especially. Entire generations have grown up on post-Pixar animation, even on tv",
                            "score": 3,
                            "author": "TheNextBattalion",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Traditional/cel animation is an animation technique in which each frame is drawn by hand. Traditional animation, where each frame is drawn by hand, was the main method used until digital animation arrived. Unlike the traditional method, modern 2D animation is all about computers and their ability to take things further when it comes to creating an animation. Traditional cel animation died out in the mid 2000s with the Cartoon Network show Ed, Edd n Eddy being the last major animated production to use cel. With the Last traditional cel animated movie being Bill Plympton's Hair High.",
                            "score": 3,
                            "author": "VoidedVoidance",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "was trying to figure out wtf you guys were talking about... after searching it's Cel not Cell",
                            "score": 3,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "We could have had more Atlantis and Treasure Planet, but no, you guys went drunk on Shrek",
                    "score": 152,
                    "author": "_Thrilhouse_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Disney poisoned the well with direct to DVD sequels of all their animated films, and then once people thought 2D animation meant \"shit,\" they took their animation division out back and shot it in the head",
                            "score": 94,
                            "author": "Frogbone",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They used Old Yeller as a template.",
                                    "score": 9,
                                    "author": "I_Cut_Shows"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yeah, my bad. Look, the power of Smashmouth compelled me. \n\nBut I did also see Emperor’s New Groove in the theater.",
                            "score": 7,
                            "author": "Funandgeeky"
                        },
                        {
                            "level": 2,
                            "comment": "Every day for many years I have followed the same route in taking the kids to school. Every day, without fail, we roll down the windows and scream “SHRRRRRRREK!” as we pass by the small little swamp where he resides. Every day, without fail, he resists the urge to holler back. He’s a good ogre.",
                            "score": 12,
                            "author": "InvaderZimbo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "_^do ^the ^roar_",
                                    "score": 5,
                                    "author": "chop5397"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Feel like I'm going crazy because 100% of replies are using the words \"cell animated\", but it's \"cel\"",
                    "score": 8,
                    "author": "CopperSauce",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Seriously, I can't stand the live action remakes, and am really sick of 3D animations.  Guess there's always anime Lol.",
                    "score": 89,
                    "author": "Moistraven",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I cringe so hard when I see an anime where they use 3d models for the characters and even poorer quality 3d models for the vehicles or monsters. That dragon shouldn't look like it's made of Legos, sir.",
                            "score": 22,
                            "author": "miclowgunman",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I couldn't stand the Berserk movies cause of this. If you don't have enough resources to make it look good then just don't make it.",
                                    "score": 7,
                                    "author": "Olama",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Oddly enough I liked the movies obviously some scenes were better than others. However the 3D abomination afterwards.....FUUUUU\n\nIf only we could have had something like Vinland Saga.",
                                            "score": 3,
                                            "author": "its_a_throwawayduh"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "\\*cel",
                    "score": 4,
                    "author": "happy_bluebird"
                },
                {
                    "level": 1,
                    "comment": "Except you don't because no one saw the last couple and everyone saw the new CGI stuff.",
                    "score": 3,
                    "author": "PlayfulPresentation7",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "There must be a nuclear blast behind her in that image",
            "score": 1362,
            "author": "charrcheese",
            "replies": [
                {
                    "level": 1,
                    "comment": "The movie was actually an Oppenheimer prequel.",
                    "score": 814,
                    "author": "PayneTrain181999",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;The movie was actually an Oppenheimer ~~prequel~~ sequel.\n\nHow do you think they mutated into merpeople?",
                            "score": 267,
                            "author": "B_Fee",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "“MERMAN! I’M A MERMAN!”",
                                    "score": 61,
                                    "author": "incredibad29",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "\\*cough, cough*",
                                            "score": 17,
                                            "author": "ColdIceZero"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "LITTLE MERMAID II: EVOLUTION ON THE BIKINI ATOLL",
                                    "score": 35,
                                    "author": "Lake_Shore_Drive",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "LITTLE MERMAID III: MURMAIDER",
                                            "score": 19,
                                            "author": "L1feM_s1k",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "LM4: Maid for Mayhem",
                                                    "score": 6,
                                                    "author": "novkit"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "\"Woah woah woah, wouldn't it take millions of years to evolve into mermaids?\"\n\n\"Normally yes, but the caffiene really sped things up.\"",
                                    "score": 36,
                                    "author": "ZorkNemesis",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "r/unexpectedfuturama",
                                            "score": 9,
                                            "author": "Leviathan1337"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "For a second I thought that said ‘mutilated’ and I was very concerned 💀",
                                    "score": 5,
                                    "author": "DavidExplorer"
                                },
                                {
                                    "level": 3,
                                    "comment": "The old Coca-Cola factory 🏭",
                                    "score": 3,
                                    "author": "Resident_Safe_6980"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Or the prequel to Fox News Movie Division's \"von Braun, the Early Years\".",
                            "score": 4,
                            "author": "DogWallop"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That’s actually the sub plot on how mermaids came to be.",
                    "score": 93,
                    "author": "Jegma72",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Freaking give spoiler alerts!",
                            "score": 33,
                            "author": "IllustriousAct28"
                        },
                        {
                            "level": 2,
                            "comment": "Filmed at Bikini Atoll",
                            "score": 14,
                            "author": "Catoblepas2021",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Ariel used to be human, the first nuclear test mutated her, the US government is just trying to kill what they created now",
                    "score": 33,
                    "author": "Lucius-Halthier",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I don’t know anything about this movie other than the color grading of the trailers/commercials looks terrible. “Let’s take an all time classic and remake it in live action in a darkroom with a single flashlight”.",
                    "score": 43,
                    "author": "Server6",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There are very noticeable moments of that but it’s mostly in the first 20 minutes.",
                            "score": 11,
                            "author": "dinosaurkiller"
                        },
                        {
                            "level": 2,
                            "comment": "The initial trailers were purposefully darkened. The release trailers and the movie are nonstop popping with gorgeous color. It feels so alive in every moment. They did an amazing job of translating the lively colors of the animated film into a live action. It looks neither too realistic or too cartoony. It looks 100% Little Mermaid.",
                            "score": 3,
                            "author": "FilthylilSailor"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I’m assuming they couldn’t get the exposure right. At first I’d blame her darker skin tone but that’s silly. A major studio should be able to set up lighting properly.",
                    "score": 45,
                    "author": "Affectionate_Ear_778",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I've watched a few Disney live action movies recently and the colours are so dull.\n\nWatched Aladin the other day and it was nowhere near as colourful as it should have been. Then I watched Jungle Cruise and everything was so... grey.",
                            "score": 25,
                            "author": "bacon_cake",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Its because these magical fairy movies are **serious** and needs to be taken seriously",
                                    "score": 15,
                                    "author": "mr_plehbody"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "can't blame skin tone. every photographer on planet earth knows how to adjust for light and dark skin. This image looks like it's been badly processed by some underpaid webpage jockey",
                            "score": 79,
                            "author": "rotomangler",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Litteraly the second thing they teach you after teaching you 18point gray scale that is the base color function for all cameras is based on white skin cause, to quote one of my college photography teachers “ when this was set up the people with enough money to buy cameras did not even try to think of black people cause you know racism. So its very important for you to gain the skill to work with different tones and pigment.” It quite literally photo/cinematography 101.",
                                    "score": 27,
                                    "author": "Negative-Bitch",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "I have yet to see an image or clip from the movie that looked like it was lit correctly.",
                                    "score": 38,
                                    "author": "PacmanIncarnate",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Speaking from frustrating experience, this looks like what happens when you take a non-HDR screenshot of a HDR display. \n\nOr, in the case of Windows (at least as of six months ago), take _any_ screenshot on a HDR display. \n\nSo yeah, one possibility here besides blaming the movie studio is HDR shenanigans. Then again, if the whole movie looks like that even in HDR, get the pitchforks out.",
                            "score": 16,
                            "author": "esperalegant",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Melissa McCarthy is in this?",
            "score": 14,
            "author": "TheMatt561",
            "replies": [
                {
                    "level": 1,
                    "comment": "As Ursula",
                    "score": 12,
                    "author": "Elluminated",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ohhh, I wonder how she did with poor unfortunate souls",
                            "score": 6,
                            "author": "TheMatt561",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I took my kids to see it yesterday for my dsughters birthday. It was pretty decent - hard to beat the OG voice talent of songs stuck in your head for 30+ years, but still good.\n\nThey expanded a few things, threw in a few small scenes. I think if it were ~25 minutes shorter it would be great for kids. My kids were getting antsy in the theater due to the longer runtime plus all the previews (yes I should know better about preview length).\n\nMy biggest gripe? No \"Chefs Song\". Just as bad as taking out \"Be Prepared\" in Lion King.",
            "score": 201,
            "author": "FistLove",
            "replies": [
                {
                    "level": 1,
                    "comment": " Non Le poisson?? Quelle dommage!",
                    "score": 69,
                    "author": "fredfreddy4444",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "**HEEHEEHEE HONHONHON**",
                            "score": 45,
                            "author": "dalstrus",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "How I love les poissons!",
                                    "score": 16,
                                    "author": "StarsFan17"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Zut alors!",
                            "score": 6,
                            "author": "FistLove"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yes definitely about 30min too long, why are movies getting longer, its just filler that should be cut",
                    "score": 11,
                    "author": "EmbarrassedForce9310",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah. For me, it was cool to experience it all. If they took out beach date and Eric's song, it probably would have been good. But 🤷‍♂️ We all still enjoyed it.",
                            "score": 3,
                            "author": "FistLove"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That's not much of a dominate tbh",
            "score": 262,
            "author": "crimsxn_devil",
            "replies": [
                {
                    "level": 1,
                    "comment": "Seems like this has been a year of big budget disappointments.",
                    "score": 71,
                    "author": "Blackstar1886",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Let's hope spider verse 2 does well",
                            "score": 42,
                            "author": "crimsxn_devil",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It had a huge fan base. I was appalled to see that spider verse 1 wasn't even on the top 50 highest grossing films. But 2 is definitely going up there (maybe not frozen 2 levels but definitely high)",
                                    "score": 25,
                                    "author": "Rocket-R"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "“Dominates” at that number on a holiday weekend is pretty misleading. The drop off next week will be palpable.",
            "score": 301,
            "author": "Son_Of_A_Plumber",
            "replies": [
                {
                    "level": 1,
                    "comment": "Who was it even competing with lmao",
                    "score": 99,
                    "author": "im_absouletly_wrong",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "3rd week of GOTG3 and Fast Furious Fifteen or something or other…",
                            "score": 102,
                            "author": "FinaglingFink",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "To be fair, Fast and Furious is also a family movie.",
                                    "score": 13,
                                    "author": "GhostalMedia",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Don't forget The Machine!",
                                    "score": 13,
                                    "author": "Smorvana",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm trying to",
                                            "score": 8,
                                            "author": "T3NF0LD"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It is the 5th highest grossing film released on Memorial Day weekend at this point. It's doing well, though the international numbers look grim. I wonder why...",
                    "score": 21,
                    "author": "Scary-Jacket3377",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Meanwhile r/boxoffice is mostly thinking that the numbers are a huge underperformance to the point of being a flop.  With the massive underperformance international and the front loading on Friday with a slower Saturday than expected, most are thinking worldwide will be around 450m which is nearly 200m short of breakeven.\n\nEdit: not defending this fluff piece OP posted.  r/boxoffice knows what they're talking about.",
            "score": 595,
            "author": "Kelsier25",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wait, why the fuck is this movie's budget that high?! Most of the scenes should be on land and the underwater CGI looks like shit",
                    "score": 208,
                    "author": "Bowlbowlbowlelbow",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah the live action was supposed to be cheaper production. \n\nOne big problem with these live action versions since Alice in Wonderland (the best one) is the lack of color, everything is too dark for Disney especially.",
                            "score": 27,
                            "author": "drawkbox",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Rewatched Alice just the other day and loved how well it still held up.\n\nThat said, it doesn't hold a candle to Glenn Close's Cruella DeVil in 101 Dalmatians remake.",
                                    "score": 5,
                                    "author": "descendantofJanus",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The [Jungle Book and Dalmations movies in the 90s were pretty big at the box office in terms of tickets and sales](https://en.wikipedia.org/wiki/List_of_Disney_live-action_adaptations_and_remakes_of_Disney_animated_films#Box_office_performance). \n\nInteresting that they stopped those for over a decade. 102 Dalmations definitely went down a bit but was still big. \n\nThe money they made on Alice definitely propelled more, it hit a billion and only has been surpassed by remakes for Lion King and Beauty and the Beast.\n\nSeems like all the sequels to these also underperformed even Alice Through the Looking Glass.",
                                            "score": 3,
                                            "author": "drawkbox"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "250m production budget (which is still crazy considering how bad the CGI is) and then usually x2.5 for breakeven because the studio only gets a percentage of ticket sales.",
                            "score": 118,
                            "author": "Kelsier25",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Covid played a part in the budget inflation, and like others have said the movie needs to recoup the $250 million and additional marketing costs (likely in the area of $125-$150 million) with revenue split with exhibitors of the movie (theaters). All told, it needs around $600 million to break even",
                            "score": 25,
                            "author": "BidnessBoy",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "It takes 100's of millions of dollars to make a fish look that fucking ugly. Technology is crazy. Like seriously who thought Flounder was passable?",
                            "score": 3,
                            "author": "Yadilie",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "450m is a bit of a lowball but i’ll be shocked if this movie ends up doing more than 600m worldwide, which is around the break even point",
                    "score": 143,
                    "author": "pokerface_86",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "We'll see.  Between demographics and big releases over the next few weeks it will certainly be a challenge.",
                            "score": 43,
                            "author": "Kelsier25",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "i agree, spider verse into the flash into mission impossible does not bode well for the performance of this movie, especially when looking at the international audience who are already apathetic at best about TLM",
                                    "score": 42,
                                    "author": "pokerface_86",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Also, given that this is a Disney movie, it will end up on Disney+ in a few weeks anyway - and people have understood that by now.",
                                            "score": 45,
                                            "author": "Pandering_Panda7879",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "yep i don’t have any hard evidence of this so i won’t speak conclusively, but i’ve heard a LOT of people i would classify as “disney adults” echoing the same sentiment",
                                                    "score": 17,
                                                    "author": "pokerface_86",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "That would be me for example. I love watching movies in the cinema but it's really not an enjoyable experience anymore for me. Tickets are extremely expensive, crowds in the theatres are hit and miss and often suck. And being almost two meters tall doesn't help the experience either.\n\nSure, my home theatre can't compete with a cinema, but having grown up with DVDs (actually CDs) that fell of a truck, oftentimes super low quality with artifacts and bad sound, my big 4K-TV with a soundbar is a hell of a step up.",
                                                            "score": 11,
                                                            "author": "Pandering_Panda7879",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Anyone got a source for this $600M? It seems high based on the $250M budget I was seeing online. Appreciate a Link",
                            "score": 30,
                            "author": "laserinlove",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "basic math - 200-250m production + 80m marketing budget = 280-330m. for a film to break even the general rule is 2.5x that number, which would actually be higher than 600m, but all this shit is too nebulous to give definitive numbers like that. most outlets agree the break even point is between 550 and 750m tho",
                                    "score": 42,
                                    "author": "pokerface_86",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Does the “break even” threshold account for other revenues like merchandising and streaming rights?",
                                            "score": 14,
                                            "author": "wynnduffyisking",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "$600m is a *break even point* on a live action adaption?",
                            "score": 14,
                            "author": "great-nba-comment",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "well the budget was 200-250m and marketing is at least another 80-100m so break even could very well be higher than 600m",
                                    "score": 18,
                                    "author": "pokerface_86",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That’s absolutely insane to me. How is it even possible to spend $100m on marketing?\n\nI work in advertising and I’ve seen budgets bloat on major global campaigns (few million in paid, few million in agency fees etc), but I can’t fathom how you spend $100m marketing a single movie. Let alone the production budget. \n\nI dare say the industry is teaching wedding services points where the invoice 10xs when they see a major studio name.",
                                            "score": 15,
                                            "author": "great-nba-comment",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Most ad budgets for these tent pole films are all about that high. Anywhere you can stick an ad and they will have something there.",
                                                    "score": 11,
                                                    "author": "HostileReplies"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; How is it even possible to spend $100m on marketing?\n\nThe Oscars promotion was rumoured to be $10m *alone*...",
                                                    "score": 8,
                                                    "author": "smacksaw"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "honestly, they’re not wrong. unless Spider-Verse, Transformers, and Elemental all flop, TLM will not see a profit from theatrical release",
                    "score": 84,
                    "author": "Judgy_Garland",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Good. Make new movies.",
                            "score": 99,
                            "author": "fdar",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 35,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Is that the real break even or the Hollywood accounting ‘break even’?",
                    "score": 21,
                    "author": "Ok-Translator-9453",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Real break even; the general rule for breaking even is 2.5 times budget (250m in this case) because studios generally only take about half of the ticket gross and then there’s also marketing costs not included in the direct budget",
                            "score": 45,
                            "author": "JDraks",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I said in another thread, I think someone was snorting the effects budget. The underwater scenes looked so cheap.",
                                    "score": 35,
                                    "author": "folklorebetty",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "In the trailer it looked like she was ripping off Flounder's fins.",
                                            "score": 14,
                                            "author": "ThePhonyOne"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This movie bombed lmao",
                    "score": 3,
                    "author": "RedditIsPointlesss"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is this one any good? I loved the original as a kid, but have been generally disappointed with all the live-action remakes up until now.",
            "score": 48,
            "author": "ThatTinyGameCubeDisc",
            "replies": [
                {
                    "level": 1,
                    "comment": "It was alright. I’m firmly in the camp of it being just ok. It didn’t ruin anything for me, didn’t stack up against the original, but it wasn’t a *bad* movie by any means. My daughter liked it but she (5) was getting a little stir crazy by the end. It was definitely too long.",
                    "score": 78,
                    "author": "makingburritos",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Same - the 2 hours and 15 minutes was a bit dragging. Also they took out the crazy French chef scene which was a little sad.",
                            "score": 35,
                            "author": "BlondeBobaFett",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "While this isn't quite Mushu erasure, that is pretty lame. As a kid, I was over the moon about mermaids and stuff, but me and my sibilings loved singing along with the chef in horrible French accents.",
                                    "score": 16,
                                    "author": "BonJovicus"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Very long. I went with my friend and her daughter and the daughter “had to potty” like four times, lol.",
                            "score": 5,
                            "author": "Oomlotte99"
                        },
                        {
                            "level": 2,
                            "comment": "Same, my 3 year old made it about an hour in or so, which was how long it took her to make the deal with Ursula, which imo was way too long",
                            "score": 3,
                            "author": "Maximum_Anywhere_368"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;Is this one any good? I loved the original as a kid, but have been generally disappointed with all the live-action remakes up until now.\n\nI saw it. It's nothing special. Little kids will like it. I'd wait for it to be on disney+.",
                    "score": 27,
                    "author": "folklorebetty"
                },
                {
                    "level": 1,
                    "comment": "It’s ok. The CGI is really bad in a lot of parts though. And there’s a new song that you’ll either love or hate with a fiery passion",
                    "score": 9,
                    "author": "JeffBoyardee69"
                },
                {
                    "level": 1,
                    "comment": "It was somehow worse and better than I thought it would be. Definitely one of the better \"live action\" remakes they've done.",
                    "score": 14,
                    "author": "JB-from-ATL"
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt; $96 million (3-day), $118 million (4-day) \n\n\n'Dominates' is a bit misleading when the projections have going down since Friday when it was projected to make $105M (3-day) / $125M (4-day). \n\nOverseas, it made just $68.3M, so the global opening will be around $186 million, that's worse than 'Ant-Man 3' $227.4M global opening.",
            "score": 728,
            "author": "Neo2199",
            "replies": [
                {
                    "level": 1,
                    "comment": "How much did it make under seas though?",
                    "score": 801,
                    "author": "Sk0l_Nation",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Couldn't tell you. \n\nI'm not a part of that world.",
                            "score": 309,
                            "author": "tider06",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What would you give?",
                                    "score": 60,
                                    "author": "quantumcalicokitty",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "To spend a day warm on the sand?",
                                            "score": 24,
                                            "author": "Zemykitty",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I don't like sand. It's course and rough and irritating and it gets everywhere.",
                                                    "score": 18,
                                                    "author": "solid_hoist",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "![gif](giphy|Dv3sF2ZUTmVtm)",
                                                            "score": 13,
                                                            "author": "Zemykitty",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "“They’ll probably remake Star Wars in a few years but this time Darth Vader will be black.”\n\n-you just know someone had made that comment completely without irony.",
                                                                    "score": 6,
                                                                    "author": "Funandgeeky",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Over James earl Jones' dead body. Hes not gonna let no black guy take his role! He's the king of Africa. King of the lions! He's the one who brought balance to the force!!!",
                                                                            "score": 3,
                                                                            "author": "EvaUnit_03"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Muh dinglehopper.",
                                            "score": 13,
                                            "author": "maximumtesticle"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Now sing",
                                    "score": 6,
                                    "author": "M1ck3yB1u"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Under da sea? Everything's better down where it's wetter, take it from me.",
                            "score": 14,
                            "author": "Flufflebuns",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "r/angryupvote",
                            "score": 31,
                            "author": "Ibe121"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thank you for actually explaining it to us commoners",
                    "score": 19,
                    "author": "work3oakzz",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "How much did production cost?",
                    "score": 6,
                    "author": "DLDrillNB",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Production budget is $250 million, plus $100 million for marketing.",
                            "score": 12,
                            "author": "Neo2199"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Dominates is a little hyperbolic, but accurate. It's the number one film of the weekend, beating Fast X amd GotG3 by nearly an order of magnitude(Based on Friday numbers) \n https://www.boxofficemojo.com/date/2023-05-26/?ref_=bo_di_table_1\n\n But is is only \"the fifth highest Memorial Day opening in history.\"",
                    "score": 161,
                    "author": "Electrorocket",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "GOTG3 has been out for like a month so I would hope it beat it out for its opening weekend",
                            "score": 91,
                            "author": "domthemom_2",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Dominates, as you say, refers to beating out competition. It's factually accurate, regardless of how much more it makes or how well received the movie is. There are some strange takes on here",
                            "score": 132,
                            "author": "Mythosaurloser",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Out of all the petty shit to be bothered about, I'm most bothered by a realistic looking talking crab.  I don't know if I can get past that.",
            "score": 11,
            "author": "his_purple_majesty",
            "replies": []
        },
        {
            "level": 0,
            "comment": "wonder if they well auto tuna her voice.",
            "score": 70,
            "author": "lfohnoudidnt",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I couldn’t care less about watching this movie, but I want it to do well just to watch the incels lose their shit.\n\nEdit: Oops! Seems like they’re already here.",
            "score": 1604,
            "author": "Balls_of_Adamanthium",
            "replies": [
                {
                    "level": 1,
                    "comment": "Black, white, purple, who cares. I just wish Disney would quit with the live action remakes.",
                    "score": 680,
                    "author": "finditplz1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Bring the OG animation back!",
                            "score": 40,
                            "author": "thuggishruggishboner",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "No.\n\nI want a Live action Night on Bald Mountain. Let's see Chernobog and finally have a Slavic Disney Princess.",
                            "score": 152,
                            "author": "Darebarsoom",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Or start remaking all the bombs instead of the hits. Give me live action Black Cauldron and Treasure Planet.",
                                    "score": 128,
                                    "author": "MadManMax55",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You mean overlooked masterpieces?",
                                            "score": 78,
                                            "author": "IamtheBiscuit",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Treasure Planet I’ll give you, but Black Cauldron? Ehhhh",
                                                    "score": 18,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Agreed. Respectfully, Black Cauldron sucks ass. Treasure Planet tho 😘👌🏼",
                                                            "score": 11,
                                                            "author": "Kilngr",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Which is sad, because the Chronicles of Prydain are such amazing books.",
                                                                    "score": 10,
                                                                    "author": "Crono2401",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Yes, they are utterly amazing and I loved them as a kid. I read them all out of order, too but they were still amazing. \n\nThey could easily be a television series.",
                                                                            "score": 6,
                                                                            "author": "Funandgeeky",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "So many great quotes from it. I've always been fond of Eilonwy saying, \"Not listening to people is like putting your fingers in your ears and jumping down a well!\"",
                                                                                    "score": 3,
                                                                                    "author": "Crono2401"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I wouldn't go that far. Now I do enjoy most of the Disney misfit films, they're something outside of the Disney norm and still have that passion in their productions.\n\nThat being said some are a bit messy and had stories tightened up a bit before they went into full animation production. But it's also partially on Exec Disney probably not giving these productions the proper time because they're not princess fare. Hell they just did it again with Strange World which should have gotten the typical Mouse marketing but just came and went with little fanfare.\n\nI'd love to see a live action Atlantis or Treasure Planet, a Black Cauldron that actually follows the book. These films and actually a lot of bad movies have good ideas, but had poor directors, actors, scripts and should be given another shot. But and this is a general Hollywood thing not just Disney they're banking on nostalgia of something that new and successful instead of risking on something that was bad and could become good.",
                                                    "score": 9,
                                                    "author": "Xikar_Wyhart"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Treasure Planet, absolutely.",
                                            "score": 10,
                                            "author": "openlate"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Black Couldron is an entire book series and it's actually the second book in the 5 book series. The series is great, I'd say up there with the Narnia serie.",
                                            "score": 5,
                                            "author": "MegaMarioSonic",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Live action Anastasia with a scary Rasputin. Rated R.",
                                    "score": 7,
                                    "author": "The_Clarence",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Princess Kurwa",
                                    "score": 3,
                                    "author": "robo_robb",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "To hell with purple people!",
                            "score": 16,
                            "author": "Killbil",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 38,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I thought Cinderella and Aladdin were quite good.",
                                    "score": 6,
                                    "author": "Funkycoldmedici"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Exactly. But they wont because people who complain about the lack of originality PAY THEM TO SEE THESE MOVIES! 🤦‍♂️",
                            "score": 45,
                            "author": "SeagullsStopItNowz",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I don’t",
                                    "score": 5,
                                    "author": "RobloxLover369421"
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt;Exactly. But they wont because people who complain about the lack of originality PAY THEM TO SEE THESE MOVIES!\n\nI mean, the same species is. But can you prove that the same ones who complain are paying?",
                                    "score": 28,
                                    "author": "rldogamusprime",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "How about the incredibly novel idea of wanting GOOD movies to do well? This is a lazy rehash",
                    "score": 33,
                    "author": "treesandcigarettes",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "And conservatives who thinks having a black woman as Ariel is wrong and woke. \n\n\nWho gives a flying fuck what her race is. There was a black mermaid in the animated version. Halle Bailey can sing and act.",
                    "score": 247,
                    "author": "ZiOnIsNeXtLeBrOn",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You don't understand. A black mermaid is historically inaccurate. Every mermaid I've met has been white.",
                            "score": 227,
                            "author": "Far_Blueberry_2375",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Why didn't they cast an actual mermaid instead of this human pretending. Ugh.\n\n /s",
                                    "score": 79,
                                    "author": "ChillyCash",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I just want a good live action Disney movie. Too many are disappointing. Though my nostalgia probably gets in the way.",
                            "score": 14,
                            "author": "Antique_Essay4032",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Kinda misleading title, it's dominating cus there is nothing else to oppose it. It's doing OK-ish domestically but is flopping massively internationally. Usually for big movies, international box office is about 2 times the domestic but for TLM it's about 30% lower than US/Canada. With a near 250 million budget and 100 million in marketing it needs to do about 625 million to break even, without some miracle legs it won't reach that.",
            "score": 130,
            "author": "Marace55",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;without some miracle legs\n\nI see what you did there.",
                    "score": 43,
                    "author": "aloysiuslamb"
                },
                {
                    "level": 1,
                    "comment": "The real battle will be Oppenheimer V Barbie",
                    "score": 21,
                    "author": "Rudy_Colludiani",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The Bomb vs the Bombshell",
                            "score": 9,
                            "author": "drawkbox"
                        },
                        {
                            "level": 2,
                            "comment": "I hope they make the exact same amount down to the cent cause that’d be funny",
                            "score": 3,
                            "author": "Doctor_Slept"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "this is an extremely misleading title, TLM has a ceiling of like 650M WW max and with a 250m budget like you said, this looks like it’s NOT going to be the success terminally online journalists want it to be. hell, newest international estimates are going to bring it to a more like 500m WW run which is disastrous for disney! i hate the fact that articles like this are being written to “spite racists” while ignoring the huge elephant in the room that this movie may not even fucking break even!",
                    "score": 56,
                    "author": "pokerface_86",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "that 100 mil on marketing is very low its probably closer to 200 mil for this big of a movie",
                    "score": 22,
                    "author": "vanjaeesti",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It seems low for me too, but they have had a big promo campaign estimated at 80 million partnering with other companies like McDonalds and Mattel that doesn't cost them anything so maybe with that big of a budget they tried to be a bit cautious and especially after covid ballooned the budget they might have just tried to focus on key markets.",
                            "score": 8,
                            "author": "Marace55",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The song “scuttlebutt” in this movie is quite possibly the worst piece of music ever created by a human being",
            "score": 4,
            "author": "pools4567",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Movies was a pleasant surprise the lead sang really well and the supporting characters were pretty funny id say its worth seeing (8.5/10)",
            "score": 283,
            "author": "Aromatic_Bee_645",
            "replies": [
                {
                    "level": 1,
                    "comment": "Melissa McCarthy was awesome as Ursula",
                    "score": 146,
                    "author": "soovestho",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "that's a great casting",
                            "score": 34,
                            "author": "hoxxxxx"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Just watched it. My ONLY qualm is that the middle seemed to lose the pacing. If they didn't include Eric's Song, I think it might have helped. Overall, being someone who grew up with the animated film and who has kids who enjoy it also, this was a GOOD rendition. Lots of little moments that made it directly from animated form to this film. I agree with your rating! Too bad no \"Le Poisson\" but \"The Skuttlebutt\" will suffice.",
                    "score": 74,
                    "author": "turbohatch",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah i cant really disagree with that, eric overall was just ok the song was fine probably could have done well without it but they probably wanted to give him a moment so its all fair still the best live action disney movie ive seen since maleficent and junglebook 2016",
                            "score": 24,
                            "author": "Aromatic_Bee_645",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "His song had a lot of auto tune",
                                    "score": 3,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Totally agree. The people bashing it are clearly taking it too seriously. Saw it with my daughters (3 years and 19 months) and they LOVED it. Of all the live action Disney remakes I’d say this is either best or second best (with Aladdin being the top). The animals were realistic but they didn’t get stuck in the hyper realism that Lion King did. They still let the animals be animated and have “human” characteristics (except maybe for Flounder, but even he grew on me). All-in-all I was just so happy to see my daughters so excited the whole time. Only problem is they keep asking to go back!",
                    "score": 35,
                    "author": "cobo10201",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "For a four day weekend, those numbers are ABYSMAL. They need at least twice that just to break even. \n\nSomeone just lost their shoes in Hollywood.",
            "score": 49,
            "author": "MicrowaveChats",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Literally beaten by black adam lol",
            "score": 31,
            "author": "mking1337",
            "replies": [
                {
                    "level": 1,
                    "comment": "The dominace hierarchy in the box-office has been upset",
                    "score": 8,
                    "author": "Cyrus_Dragon_Hunter"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The framing of this information is very misleading. It's not doing well enough based on its international performance and massive budget. With numbers like these, this seriously might be considered a flop when it finishes. It's only dominating because there is no competition being released right now \n\nIt's exactly like how Disney lied about the \"success\" of Quantumania. You can manipulate numbers to say whatever you want in the short term",
            "score": 27,
            "author": "pixima1290",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Dominates? Those are pretty terrible numbers for a holiday weekend with zero competition",
            "score": 60,
            "author": "Spenson89",
            "replies": []
        },
        {
            "level": 0,
            "comment": "These “live-action” movies are Disney’s greatest finesse. They're just recreating established stories, most of the time shot for shot, line for line, with small updates...and then relaunching them as new standalone movies. And we are nostalgic about eating it up. It's crazy. Gave in and took the kiddos to see it, what a POS. Lol 😆 they got me for a grip of money",
            "score": 31,
            "author": "TheScoundrelLeander",
            "replies": [
                {
                    "level": 1,
                    "comment": "You are the reason they still make them…likes to hate on it but goes anyway. Should have showed your kids the original and saved money and their experience of a good movie. \n\nThe only good live action was beauty and the beast. Hear they’re making a Lilo and Stitch one next fucking awful.",
                    "score": 19,
                    "author": "GalacticAttitude",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Who cares. If he wants to take his kids to a movie that’s his business. Not everyone lives their life trying to change Disneys movie making strategy.",
                            "score": 6,
                            "author": "mikesnout"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "So put this into some perspective, that's about 3 Morbius's",
            "score": 3,
            "author": "eccentricbananaman"
        },
        {
            "level": 0,
            "comment": "Why are these live action Disney films so dark?? No like, LITERALLY dark. It’s like they finished production on the movies, then went “okay, everything looks good! Just gotta reduce the brightness by 50% to 75% and we done!”",
            "score": 3,
            "author": "TheKittensAreMelting"
        },
        {
            "level": 0,
            "comment": "Across the Spiderverse is going to kill this movie",
            "score": 3,
            "author": "conceited_king_",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I'm just hoping that the money grab will fail. Let them put in some effort and create original content.",
            "score": 57,
            "author": "brestfloda",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I just really hope they kept the integrity of Howard Ashman’s and Alan Menken’s musical masterpiece.",
            "score": 17,
            "author": "WardenEdgewise",
            "replies": [
                {
                    "level": 1,
                    "comment": "Alan Menken was on set with them and he said he loved working with Halle, so id say yes",
                    "score": 28,
                    "author": "Rosuvastatine",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "They let Lin-Manuel Miranda get his greasy mitts on it, so obviously not. The quote I saw from him was properly reverent, but anyone with true respect for Ashman’s genius would have politely declined and urged the filmmakers to keep his words intact.",
                    "score": 3,
                    "author": "SamfromRI",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well said. Imagine going to see Beethovens 9th, and listening to the conductors *modern rendition* instead.  \n\nYes, I compared Howard Ashman’s work in TLM to a Beethoven symphony.  It’s that good.",
                            "score": 3,
                            "author": "WardenEdgewise",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "So it tanked?",
            "score": 35,
            "author": "gobSIDES",
            "replies": []
        }
    ]
}