{
    "id": "13wljb1",
    "score": 2090,
    "title": "IMDb changes review system after bots review bomb The Little Mermaid remake",
    "author": "fortune",
    "date": 1685537734.0,
    "url": "https://www.reddit.com/r/entertainment/comments/13wljb1",
    "media_urls": [
        "https://fortune.com/2023/05/30/imdb-revamps-rating-system-the-little-mermaid/"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "This should’ve been done years ago when there was the very public review brigading campaign to knock The Dark Knight out of #1",
            "score": 864,
            "author": "hatramroany",
            "replies": [
                {
                    "level": 1,
                    "comment": "Imagine being such a loser that this is a thing you do for internet points with other losers.",
                    "score": 43,
                    "author": "BulljiveBots"
                },
                {
                    "level": 1,
                    "comment": "I remember when the forums were still a thing, review bombing recruiting was a regular occurrence. When Return of the King briefly bumped The Godfather from the #1 spot on the Top 250, The Godfather boards had a ***massive*** meltdown about it, and started organizing review bombs to get Return of the King off the top 10. \n\nIt was a never-ending battle between Godfather fanboys and Shawshank Redemption fans knocking the other out of the top 10 so their favorite movie could be number one, somehow bringing a sense of fulfillment into their sad lives. And IMDb never did anything about *that* 20 years ago.",
                    "score": 287,
                    "author": "theghostofme",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Funny that the same thing happens with anime on myanimelist and full metal alchemist fans.",
                            "score": 47,
                            "author": "KingGatrie",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Damn I haven’t though of mal in ages lol",
                                    "score": 2,
                                    "author": "WeNeedBoofEmoji"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "For years I thought I was the only one who liked Shawshank redemption. Growing up, no one else I knew really cared for it.",
                            "score": 3,
                            "author": "YaBroDownBelow"
                        },
                        {
                            "level": 2,
                            "comment": "Well in their defense, there's a big difference between two fangroups wasting their time, and people review bombing because of an actress' race. Obviously, they're gonna move faster on one of those.",
                            "score": 77,
                            "author": "Satanic_Earmuff",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 3,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "IMDB has both a bad data problem and a racism problem. Movies get review bombed even before release just because they have a black cast.",
                                            "score": 43,
                                            "author": "[deleted]",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "One is a problem of people being assholes. Dumb, but nothing new. One is a problem of people being actual racists. If you don’t know what the difference is, you’re probably with them",
                                            "score": 47,
                                            "author": "No_Satisfaction6035",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 14,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Unless someone can show the numbers here, I’d wager the amount of fanboys review-bombing movies 20 years ago is FAR less than what we’re seeing today considering bots can be programmed to do this shit.",
                                                            "score": 14,
                                                            "author": "NewbornXenomorphs",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Yes, I’m saying that review bombing because of the race of an actress is a worse thing to do than because you’re mad that a movie you like isn’t on top anymore.",
                                                            "score": 31,
                                                            "author": "No_Satisfaction6035",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "People going out of their way to be effectively racist is much worse than over the top fans and bots.",
                                                                    "score": 33,
                                                                    "author": "Hey_HaveAGreatDay"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Sure yeah but we’re talking about movie reviews from public forums. Not scientific studies. However science studies are also rife with bad data. It’s weird you’re only bringing this up in relation to a movie that’s being dunked on by literal nazis.",
                                                            "score": 4,
                                                            "author": "brassninja",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Except most of those instances didn’t involve racism as a source of the reviews. \n\nDifference between The Godfather is superior to LOTR. \n\nAnd saying \n\n“Movie bad, Mermaid black. Mermaids can't be black!”\n\nA fucking chasm of difference, any argument otherwise is just obstructing the very real reality that racism is a part of the major critique.",
                            "score": 9,
                            "author": "Mabans",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You mean the very public review brigading campaign to make The Dark Knight no 1, right? Because The Godfather was massively downvoted by comic book fans to make that no 1 spot happen in the first place.",
                    "score": 16,
                    "author": "Will-Of-D-3D2Y",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes, this is exactly what happened. TDK fans and The Godfather fans were locked in a close fight and no one saw The Shawshank Redemption jumping to no. 1 spot. I don't know why OP said there was a campaign to knock down TDK from no.1 spot.",
                            "score": 4,
                            "author": "TheUmbrellaMan1",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That was civil disobedience for the greater good.",
                    "score": -10,
                    "author": "jim45804"
                }
            ]
        },
        {
            "level": 0,
            "comment": "How many times has IMDb had to change their review system after a movie gets review bombed? I swear it’s like every movie now",
            "score": 303,
            "author": "alexc1ted",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; I swear it’s like every movie now\n\nIt's because outrage junkies wanna make their favorite YouTuber proud by going, \"See? I can think for myself and these woke movies aren't gonna win! If I waste this much time and effort hurting its ratigins on IMDb, the massive, bulti-billion-dollar corporation will 'get the message.'\"",
                    "score": 152,
                    "author": "theghostofme"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 35,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You don’t find it at all sus that almost half of the reviews of this movie gave it 1 star on it’s opening? IIRC a majority of those were opening night.",
                            "score": 31,
                            "author": "TheUserAboveFarted"
                        },
                        {
                            "level": 2,
                            "comment": "Oh that's a really interesting point you made in the first paragraph! \n\nI'd love to know more. Can you provide me some articles that prove movies are intentionally including elements that might cause discourse, in order to use that as a shield against criticism? \n\nI've seen Reddit and Twitter users ponder that in comments before, but I've never seen documented proof that is occurring, like you've claimed.\n\nReading some of your other comments I can see you also care about having accurate sources before making claims, so I'm sure you can help out!",
                            "score": 20,
                            "author": "alphathums"
                        },
                        {
                            "level": 2,
                            "comment": "Just any review that's in bad faith should be regarded as review bombing when done systematically. \"1/10 because 'woke'.\" Really? Movie has ZERO redeeming qualities? I can't take user reviews seriously. Yeah, sometimes professional critics get it wrong but user reviews have basically no value when it comes to movies. Too many knuckle draggers make it their life's mission to piss on movies that aren't glorifying the white \"Christian\" fascist ethnostate they want to fucking badly.",
                            "score": 21,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Like I didn't love the ladies Ghost Busters, finding it mostly boring, and primarily due to bad editing. Having said that, it wasn't horrible. It wasn't the worst movie ever made. It had LOLs. No other movie of equal quality across the board was ever subject to the absurd contempt it was. Hell, worse movies were treated better. \n\nPretending it wasn't spammed with bad reviews by misogynists is basically an admission that they're one of them or support it being done. A rant about how everyone doesn't have a like a movie when that's not what's being discussed is also a confession. A movie can be bad, and we agree its bad, and we acknowledge that there's lunatics attacking it for far different reasons than it's bad.",
                                    "score": 18,
                                    "author": "Distinct_Salt_2460",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yep. I've seen some truly awful, politically motivated films that are quite literally just a bit of propaganda wrapped in jokes or stories, but even those aren't worthy of being called a 1/10 movie. I've seen plenty of truly awful films that I wouldn't say are worth my time, but very few are true 1/10 disasters. Shit like \"An American Carol\" which is just a lot of very dated, often bigoted, and wildly stupid jokes and talking points still managed to get a few chuckles out of me and probably lands somewhere like a 4/10 for me. Was it watchable? Yeah. Was it any good? At times. Would I sit down and watch it again? Probably not. But it has a plot that makes internal sense, the actors make a decent effort, it's shot in a professional way, and while there were some bits that were repulsive, it's still far from the worst thing I've ever seen. \n\nI understand not liking new Ghostbusters or new Star Wars, but people acting like this is the worst thing ever committed to film are not acting in good faith and they shouldn't be allowed to contribute to online movie review scores.",
                                            "score": 7,
                                            "author": "[deleted]",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Some people are either misogynistic or in denial of the disproportionate hatred thrown on that film. Their typical deflection is \"we aren't just tired of lazy, unnecessary sequels/remakes\" or \"the movie is just bad, it's not because they're female.\"\n\nThe movie itself is quite respectful to its source. Nobody among the original cast died, retconned or got disrespected. Its an alternate universe and reimagining of the story with different characters - who just happen to be female. \n\nSure it may be boring and uninteresting, but it respects the franchise more than other sequels and reboot.",
                                            "score": 4,
                                            "author": "pinkpugita"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "But, these are bots doing the review bombing. Not people.",
                            "score": 47,
                            "author": "MidToUpperAgitated",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Shhh fan fiction time",
                                    "score": 5,
                                    "author": "Feeling_Hunter873"
                                },
                                {
                                    "level": 3,
                                    "comment": "It's people *using* scripting to do this. When PrequelMemes was having its usual meltdown over The Last Jedi, they were passing around Greasemonkey scripts so people could automate their review bombings on IMDb and Rotten Tomatoes. \n\nBots don't care about an imagined culture war, and only do what they're programmed to do by *people*.",
                                    "score": 22,
                                    "author": "theghostofme",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ok, great. So, a group of people scripting more bots than the number of people actually making these reviews.",
                                            "score": 6,
                                            "author": "MidToUpperAgitated"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": -4,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "“Review bombs are an increasingly large problem for review sites. Activists who object to some element of a film, or groups that want to see it succeed, flood review sites with positive or negative reviews, usually driven by **bots**, to skew the averages, in hopes of discouraging or encouraging others to view it.”\n\nAlso the idea is even real people who review are often negatively reviewing 1) without watching the movie 2) just because they don’t like 1 specific part like a character being LGBT or a minority",
                                            "score": 39,
                                            "author": "GreenBayQuackers",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "The article does mention bots. This also isn't the first article published about this being an issue.",
                                            "score": 17,
                                            "author": "MidToUpperAgitated",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 8,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Guess they just hired a lot of people then.",
                                                            "score": 3,
                                                            "author": "MidToUpperAgitated"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "The article was written by a bot.",
                                                    "score": 1,
                                                    "author": "Old-but-not",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Maybe I’m a bot.",
                                                            "score": 3,
                                                            "author": "--Stabstract--",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Review bombing is clear, and no, Disney didn't cast a black mermaid to bait it. \n\nAnyone acting like this isn't a well documented phenomenon that they can easily identify is probably doing it.",
                            "score": 21,
                            "author": "Distinct_Salt_2460",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "how is it clear?  the article only said that the site detected review bombing and revealed no details.",
                                    "score": 3,
                                    "author": "tensai7777"
                                },
                                {
                                    "level": 3,
                                    "comment": "Yea Disney dosent fanbait at all. Nope. Also, the sky is purple and smells like rainbow sherbert. I also have a bridge in new York id like to sell you.",
                                    "score": 4,
                                    "author": "VictorHelios1",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I have not really seen anyone argue all negative reviews are review bombing, and it’s pretty clear what review bombing is: people, within days of the release of a controversial movie, saying it is the worst movie of all time without having seen it. \n\nCan we accurately delete those reviews with 100% accuracy? No. But if the goal of a review aggregator is to help people decide whether to see the movie, the site has two choices: 1) do nothing or 2) do something and accidentally remove legitimate negative reviews. #2 is better for the goal on the handful of polarizing movies where we know the trolls are agitated.\n\nRegardless, it seems odd to me to focus on bogeyman execs who allegedly try to judo trolls into helping them and irrational Swifty type fans. The trolls are a way more obnoxious force than either of those imo.",
                            "score": 4,
                            "author": "spackletr0n"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don’t understand having this level of free time.",
            "score": 108,
            "author": "TitaniumDreads",
            "replies": [
                {
                    "level": 1,
                    "comment": "Children and adult losers",
                    "score": 44,
                    "author": "SneezingRickshaw",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I still remember the Snyder Cult review bombing Godzilla vs. Kong because WB released it the same week as the Snyder Cut. Lmao.",
            "score": 43,
            "author": "Jay12678"
        },
        {
            "level": 0,
            "comment": "All this fuss over a movie no one will be talking about a month from now.\n\nNever change, Internet.",
            "score": 29,
            "author": "WhackOnWaxOff",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Rotten Tomatoes appear to have done something similar as it has a 95% audience rating. I don't think it has anything to do with bots though.",
            "score": 142,
            "author": "OwletHurst",
            "replies": [
                {
                    "level": 1,
                    "comment": "RT changed their rating system years ago after Captain Marvel was review bombed. They haven’t done anything special for The Little Mermaid. The 95% verified audience rating is in line with the in-person exit surveys from CinemaScore and Posttrak",
                    "score": 183,
                    "author": "hatramroany",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; The 95% verified audience rating is in line with the in-person exit surveys from CinemaScore and Posttrak\n\n*Noooooo!* That can't be right! TheQuartering and all my favorite YouTubers said people would hate this woke shit; it's a massive conspiracy to make it seem like people love it!",
                            "score": 82,
                            "author": "theghostofme",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Dang I forgot that person existed, one of those negative view farmers not worth giving the time of day.",
                                    "score": 13,
                                    "author": "Bacon-muffin"
                                },
                                {
                                    "level": 3,
                                    "comment": "Dear god the not the quarter pounder",
                                    "score": 9,
                                    "author": "goatliquor54",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "He's been as obsessed with this movie as he is about Brie Larson; he *really* needed it to be a box office failure to avoid looking like a fucking idiot...which you'd think he'd be used to by now.",
                                            "score": 24,
                                            "author": "theghostofme",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Oh yeah quarter pounder is a mess these days I can’t believe I used to watch him I genuinely don’t agree with a thing that comes out of the man’s mouth he’s so hateful. It’s so weird I used to watch him at all I remember stopping because  I felt he was so negative and never had anything good to say years later I’m ideologically on the other side of the spectrum of him it’s weird.",
                                                    "score": 9,
                                                    "author": "goatliquor54"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The verified ratings were a great idea. Just unfortunate you can't do the same for TV shows.",
                            "score": 5,
                            "author": "throwaway77993344",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "While critics don't like it, audiences seem to really like it. I haven't seen it, so I can't comment. It's just consistent with in-person reviews by movie goers.",
                    "score": 6,
                    "author": "Distinct_Salt_2460"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Online reviews aggregation in general is pretty garbage.  I pick a few reviewers whose opinions I trust and ignore the rest.\n\nToo many reviews online are just people with ulterior motives.",
            "score": 5,
            "author": "According_Skill_3942"
        },
        {
            "level": 0,
            "comment": "Being the target of nationwide (probably even worldwide) racism at 18 was probably awful. Forever sending good vibes Halle’s way!!",
            "score": 64,
            "author": "GreenDolphin86",
            "replies": [
                {
                    "level": 1,
                    "comment": "You are confused. Racism is what disney does, remaking every disney movie with swapped main characters just for diversity and political correctness instead of producing new stories...",
                    "score": 2,
                    "author": "PureDarkcolor",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "About time. Then again, I have never trusted IMDb ratings and probably never will, but I know a lot of people do use it as a guideline and something definitely needs to be done about the ratings.",
            "score": 4,
            "author": "FreemanCalavera"
        },
        {
            "level": 0,
            "comment": "&gt;The smear campaign over ‘The Little Mermaid’ movie is so intense that IMDb had to revamp its rating system for the movie.\n\nSo they haven't fixed their problem.  They fixed it for a single movie?",
            "score": 4,
            "author": "mdj1359"
        },
        {
            "level": 0,
            "comment": "I guess you could neglect all 1 &amp; 10 star reviews from any user that does not have more then X amount of reviews in the past year. And not disclose it, so it becomes very unlikely to be cheated on.",
            "score": 4,
            "author": "International_Mix970",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I never, ever look at any reviews because they have become worthless. These days, reviews are mostly politically motivated.",
            "score": 47,
            "author": "melouofs",
            "replies": [
                {
                    "level": 1,
                    "comment": "What reviews do you have in mind? The ones written by people on IMDb, YouTube, Reddit etc.? Or actual film critics and journalists for major publications? Because if you mean the latter, read more reviews and expand your horizons, because you don't know what you're talking about.",
                    "score": 1,
                    "author": "FreemanCalavera",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m not talking about those written by professionals. I’m talking about the general public who mostly seems to have an axe to grind about everything",
                            "score": 8,
                            "author": "melouofs"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yeah they did this to targets Pride line too, with a crap ton of unverified purchases posting negative reviews that were identical across products. Simple solution is to only allow verified purchase reviews.",
            "score": 49,
            "author": "roboticArrow",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 3,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "When I purchase something in store, my purchase is reflected on the target app. I don't see it as a problem as a security protocol at this point in time.",
                            "score": 10,
                            "author": "roboticArrow",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You may agree or disagree with the casting but if that alone is enough for you to shit on the movie without even seeing it then you might be a racist",
            "score": 24,
            "author": "AssertRage",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Freaking out the way so many have about casting for the lead is indeed ridiculous. IMDb knows their own traffic patterns, they know what is and what is not typical activity. Should  they detect patterns indicative of review bombing or illegitimate reviews and they have a fair and efficient way to account for that then I don't see why they shouldn't implement it where needed. That being said the optics are terrible. What I'm about to say is how I imagine its seen by those who are already freaking out about the casting. \"It looks like the MSM is not going to allow their woke propaganda piece to be reviewed as anything other than a triumph in cinema. It's just a bad movie, the reviews are in and they can't handle it so they are putting their fingers on the scale.\" It plays right into their conspiratorial nonsense that every institution in modern American life is out to get them and in on a plot to to turn America into a socialist gay night club. I think they should list both the review average reflective of their typical grading system and that of the modified version. I think they should list both in addition to explaining in detail how the modified ratings are tabulated. We all know that a large number of the negative reviews are based solely on who the lead actress is, no not even who she is but that she has more melanin in her skin than they can handle. Its ridiculous and we know it but I think the way it is being handled by IMDb could potentially make matters worse. All these wingnuts need is \"proof\" that their paranoia is justified. I'm sure a few are going to disagree with me - I may not have done the best job of getting my point across.",
            "score": 7,
            "author": "Khristophorous"
        },
        {
            "level": 0,
            "comment": "The internet has been ruined by trolls, racists, and bigots. It’s very sad that these a-holes have the loudest voices and get their way at the expense of everyone else. It’s beyond messed up.",
            "score": 33,
            "author": "RomanHawk1975",
            "replies": [
                {
                    "level": 1,
                    "comment": "I feel like the internet has always been a ‘safe haven’ for trash like that. I miss when they didn’t go around publicly espousing their shit opinions. It was obvious they knew their beliefs weren’t socially acceptable. For the most part they kept their shit beliefs to themselves instead of feeling free to harass their black or brown sever for the audacity of existing while black or brown. It’s nauseating.",
                    "score": 9,
                    "author": "DokiDoodleLoki",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You’re not wrong, at all. I feel your frustration. I mainly stick to Reddit these days. The community as a whole is pretty great. I love how most people stand up for each other here. It gives me a bit of hope.",
                            "score": 3,
                            "author": "RomanHawk1975",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "When you can't decide if a movie is actually bad or it's just being hate-brigaded-against so the only choice you have is to check it out yourself... Yeah, good job tipping the scales incels -_-",
            "score": 63,
            "author": "ainvayiKAaccount",
            "replies": [
                {
                    "level": 1,
                    "comment": "My wife and I weren't fans of it, but our 2 kids loved it lol.",
                    "score": 11,
                    "author": "CondomBalloonAnimals",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Now this is a good review.",
                            "score": 6,
                            "author": "ainvayiKAaccount",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Idk if it's nostalgia, but I just preferred the cartoon. No spoilers but there was some stuff added to the movie that helped the story that I did like. I'd watch it again if my kids wanted to. Who knows, maybe I'd like it more on a second watch lol.",
                                    "score": 6,
                                    "author": "CondomBalloonAnimals",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I literally only went to go see Mad Max Fury Road because it pissed off the men's rights activists and the incels. It became one of my favorite movies of all time!",
                    "score": 39,
                    "author": "EFB_Churns",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I still dont get what was objectionable in the movie, like theres absolutely nothing to be mad about.",
                            "score": 24,
                            "author": "MugRuithstan",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Because Miller said something about taking inspirations from the Vagina Monologues when writing the script, which pissed a bunch of basement dwellers off who've never seen or read the Vagina Monologues.",
                                    "score": 9,
                                    "author": "FreemanCalavera",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You ever just see someone complainimg and you wonder why someone spent so much time and effort doing that? Imagine having the free time to do that.",
                                            "score": 7,
                                            "author": "MugRuithstan"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt;I still dont get what was objectionable in the movie, like theres absolutely nothing to be mad about.\n\nI dunno, Max seems pretty mad.\n\nJoking aside there were a lot of butthurt angry man children going on about how Furiosa was \"stealing the masculine pride\" of such an iconic character like Mad Max by effectively being the co-main character, arguably the real main character. The worst one I ever saw was actually someone who said that it was an insult to a great work of American Cinema despite the fact that the Mad Max series has always been filmed in Australia by an Australian director.",
                                    "score": 18,
                                    "author": "EFB_Churns",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "And it was so stupid too because Max has never been the focus of the films. He's kind of just along for the ride and isn't really that fleshed out (other than the first film), he's just a cool viewpoint character. But of course, people who haven't seen the old films have to critique the director who made the franchise on how he was wrong about his own film.",
                                            "score": 6,
                                            "author": "FreemanCalavera",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Bingo!\n\nMax is the Eternal Wanderer, always passing through other people's stories helping to push them in the right direction to survive their current trials.",
                                                    "score": 5,
                                                    "author": "EFB_Churns"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Also, the movie came out in 2015, a moment in time between GamerGate and the election of Donald Trump. Online misogynists were well-organized and dangerous at that time, since their opponents hadn’t yet organized into the #MeToo movement.",
                                            "score": 5,
                                            "author": "Sceptix",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I hate that they consider the old ones with Mel Gibson as the star fine, but Furiosa is somehow evil.",
                                            "score": 7,
                                            "author": "MugRuithstan",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Because owning femoids like slaves is portrayed as bad!! B-b-but that's my fetish!!",
                                    "score": 3,
                                    "author": "teenypanini"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I saw that movie 3 times in theatres and in total bought 7 tickets because i invited some friends!",
                            "score": 3,
                            "author": "GG_Papapants",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I want to go see that movie and then immediately took my dad to go see it the next day cuz I knew we'd love it. I was right became one of his favorite movies too one of the only movies he's actually bought on Blu-ray.",
                                    "score": 2,
                                    "author": "EFB_Churns",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ayeeeee. Yea that shit is epic XD.",
                                            "score": 2,
                                            "author": "GG_Papapants"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "If pissed off men’s rights activists? How the hell?",
                            "score": 2,
                            "author": "Foreign_Rock6944",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[Like this.](https://www.cnn.com/2015/05/15/entertainment/mad-max-fury-road-boycott-mens-rights-thr-feat/index.html)",
                                    "score": 2,
                                    "author": "EFB_Churns",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Oh I very much believed you. I’m just baffled that some insecure men would somehow be offended by Mad freakin’ Max.",
                                            "score": 3,
                                            "author": "Foreign_Rock6944",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "No worries, my friend.",
                                                    "score": 2,
                                                    "author": "EFB_Churns"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don't like this remake. NOT because main character is black but because it is another soulless cash grab by creativity bankrupted Disney. \nWatch the original. This remake is unnecessary.",
            "score": 42,
            "author": "alexiosByzantium05",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, and with people brigading it for mostly racist reasons, I can’t get a proper read on whether people hate the weird, charmless, photorealistic CG animals, unnecessary 2+ hour runtime, omission of the best part of poor unfortunate souls, or are just being racist.",
                    "score": 9,
                    "author": "diglettdigyourself",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "And they added 50 minutes where you can feel every second",
                    "score": 11,
                    "author": "KristenJimmyStewart",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "So have you seen the movie?",
                    "score": 6,
                    "author": "Empero6",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Why don’t you just say that you didn’t see it?",
                    "score": 5,
                    "author": "theAintotheB",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I might see it when it comes to D+",
                            "score": 3,
                            "author": "alexiosByzantium05"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I like the live action remakes. Alladin was fun.",
                    "score": 3,
                    "author": "batrailrunner",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I adored the Beauty and the Beast remake",
                            "score": 2,
                            "author": "Streetduck"
                        },
                        {
                            "level": 2,
                            "comment": "I give you that with Alladin along with Jungle book but rest of them are crap. ESPECIALLY Pinocchio.",
                            "score": 3,
                            "author": "alexiosByzantium05",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": " Guillermo del Toro's Pinocchio is peak",
                                    "score": 3,
                                    "author": "LemonPartyRequiem"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "How was the “original” not a cash grab by Disney? 🤔\n\n(Original in quotes, since it’s not an original Disney story)",
                    "score": -1,
                    "author": "BurgerMcKinley",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "To me the answer is that to make the animation they had to decide on elements of the story they were keeping, design all the main characters, write an amazing soundtrack and create.\n\nFor the remakes they pretty much took all that was already there and copied it badly. And created a song that could be used as a torture device by the rapper named after a bottle of water. Not Zephyrhills ( the only water bottle brand I can think of and I have a headache and don't care to look it up.) I've heard that it was so dark on a regular theater screen that you couldn't see what was happening. I haven't seen it.\n\nEven the remakes I like were cash grabs just ones that remained more faithful to the source material (Cinderella) or told their own story in a way with an amazing cast (Alice and Wonderland).",
                            "score": 15,
                            "author": "crazycatgal1984",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Because that was creative. There is a reason why orginal Animated little mermaid kick started the Disney Renaissance.",
                            "score": 13,
                            "author": "alexiosByzantium05",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You’re saying they didn’t want the cartoon to make money?  \n\nIt was a Hans Christian Andersen story. I think it’s just as creative as the new one. \n\nDisney is taking existing stories and making them into movies for money, same as they’ve always done.",
                                    "score": 5,
                                    "author": "BurgerMcKinley",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yes but difference between this one is that nothing was changed from orginal and things it changed... REALLY DIDN'T MATTER. Yes story of little mermad isn't orginal but in the animated film Disney only took like 30% of Hans Andersen story and changed it  completely. Andersen didn't even gave names to the characters- the name Ariel, Eric, ursula and triton  was all created by Disney! The endings are different as well!",
                                            "score": 5,
                                            "author": "alexiosByzantium05"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "You don't understand so I'll spell it out for you\n\nChildrens movies made when I was a child were done with love and passion\n\nChildrens movies made when I am an adult are soulless cash grabs made for money and nothing else\n\n&gt;!/s!&lt;",
                                            "score": 8,
                                            "author": "CleanAspect6466",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Bro the “s” is so important, because that’s what they unironically are saying. \n\nI love the X-Men cartoons from when I was a kid. But the animation is garbage, and my sisters kids get bored when I put it on. I obviously like it for more than what it is. I like it because of how I feel about my life in 1992 or whatever. \n\nThe movies weren’t better in the 90’s. My life was better, and Indiana Jones 5 isn’t bringing my youth lol.",
                                                    "score": 2,
                                                    "author": "BurgerMcKinley",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Not to mention tons of the straight to video Disney sequels that were made in the 90's, movies that I enjoyed as a kid and still look back on fondly because, I was a kid lol, don't know why grown adults get so heated over companies making products to make money and pretend this is a recent phenomena",
                                                            "score": 10,
                                                            "author": "CleanAspect6466"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "**From reporter Chris Morris:**\n\nDisney’s live-action remake of The Little Mermaid has been a hit with critics, but the casting of Halle Bailey as Ariel has brought racists and alt-right critics out in force. And efforts to scuttle the film’s success has led one of the internet’s largest film sites to adjust its rating system for the film.\n\nIMDb currently gives the movie a 7 out of 10 ranking, but of more than 33,000 user-submitted reviews, around 13,000 have it ranked as a one-star film in a clear review-bombing attempt\n\n“Our rating mechanism has detected unusual voting activity on this title. To preserve the reliability of our rating system, an alternate weighting calculation has been applied,” IMDb wrote in a note flagging “unusual activity” on the page. When that occurs, the site says, “an alternate weighting calculation may be applied in order to preserve the reliability of our system.",
            "score": 11,
            "author": "fortune",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 13,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How did they fix the score for Rise of Skywalker?",
                            "score": 2,
                            "author": "AdAny5912",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 7,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ok, and? Just a bunch of conspiracy theories for a movie that came out 4 years ago. The score not changing all that much is not impossible. Why would Rotten Tomatoes help Disney to begin with? The site is owned by Fandango which is owned by Warner, a rival company. And the critics score is still rotten, is that not enough for you?  Some people liked the film, get over it.",
                                            "score": 4,
                                            "author": "AdAny5912",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "There's a theater like version on Disney plus and i quite liked that one more.. lol. the animation really was better than any of these CGI animals.",
            "score": 2,
            "author": "Rhytmik"
        },
        {
            "level": 0,
            "comment": "“What are they called again? Oh yeah…FEEEEEEEEEEEEEEEEEEEEEEEEEEEEEET”",
            "score": 2,
            "author": "allroadsendindeath"
        },
        {
            "level": 0,
            "comment": "So people who didn’t like the film have less influence on the rating? Or if you gave it a bad rating you’re deemed as a bot? On the other hand, doesn’t Disney know that ratings don’t matter that much to the average viewer? A “you have to see it” or an “I saw it, don’t bother” from your friend weighs a lot more than ratings. But maybe that’s why they think ChatGPT or other AI can actually write a script.",
            "score": 2,
            "author": "TheDoctorAtReddit"
        },
        {
            "level": 0,
            "comment": "I liked the movie! Although the fish and crab were kinda weird being that realistic lol",
            "score": 2,
            "author": "xensiz"
        },
        {
            "level": 0,
            "comment": "I haven’t watched Disney remakes in years and I won’t watch this one, but from what I’ve heard it’s a good movie  and kids will enjoy it.  Also bravo, they have created another reason for studios to be like “see, our movie was great and these racists are the only critics”",
            "score": 5,
            "author": "Cherry_Bomb_127"
        },
        {
            "level": 0,
            "comment": "Saw the movie yesterday, and other than Scuttle and Lin Manuel Maranda’s original songs (the dude makes catchy music but it’s always the same. Kinda sick of it) I thought it was better than the original in basically every way. Halle Bailey killed it, Melissa McCarthy killed it (still should have been Lizzo), the movie is a good time.",
            "score": 16,
            "author": "KrookedDoesStuff",
            "replies": [
                {
                    "level": 1,
                    "comment": "I wanted Hannah Waddingham as Ursula",
                    "score": 2,
                    "author": "DuckmanDrake69"
                },
                {
                    "level": 1,
                    "comment": "I think Lizzo is waaaay too youthful to play Ursula. That’s not something you can fix with makeup or CGI.",
                    "score": 2,
                    "author": "jacksev",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "True but I can see her smashing Poor Unfortunate Souls with those absolutely lit vocals....",
                            "score": 2,
                            "author": "ApprehensiveBug188"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I won't see the Little Mermaid - the movie just isn't for me.  But I am glad it's making a ton of $$$$ and driving the incels crazy :)",
            "score": 34,
            "author": "copperblood",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's doing very poorly internationally. Japan hasn't released it yet, and this does not bode well with the Japanese audience who are extremely attached to tradition, the mermaid not being her iconic bright red haired fair skin girl isn't received well in most of Asia, it will be even worse with Japan of its own.\n\nDomestically, the numbers are okay. Not amazing but okay.\nNow if you look at the demographics, you'll see blacks are overrepresented, more than double their % of the US population in this first weekend, also almost 70% female, with such skewed demographic numbers, mathematically, this isn't sustainable medium to long term and the numbers will drop dramatically. This does not bode well for future weekends, especially since other major releases are coming (spiderverse is one). It had no competition this memorial day weekend besides GOTG3 which has already been out for weeks.",
                    "score": 17,
                    "author": "Atkena2578",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "It‘s not, the movie is tanking overseas and in the US it‘s doing pretty underwhelming numbers too.",
                    "score": 24,
                    "author": "Seraphayel"
                },
                {
                    "level": 1,
                    "comment": "&gt;But I am glad it's making a ton of $$$$ and driving the incels crazy :)\n\ndude, it is not tracking good rn, if it keeps looking like this it will lose money. for more detail just check r/boxoffice",
                    "score": 21,
                    "author": "azrieldr"
                },
                {
                    "level": 1,
                    "comment": "Unfortunately it’s not doing that hot. I was expecting $800M-$1B+ like the other major remakes but $600M is the absolute ceiling now.",
                    "score": 26,
                    "author": "ednamode23",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "It’s actually not and in danger of not being profitable at all with such a huge budget. Domestic had a lovely holiday weekend,  worldwide nobody is seeing this.",
                    "score": 37,
                    "author": "SkyYellow_SunBlue",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Reddit wants this movie to fail so badly.",
                            "score": 4,
                            "author": "not28"
                        },
                        {
                            "level": 2,
                            "comment": "Well... I'm French and when I saw it on monday we were almost 15 in the room! (but it was in english, maybe that's why)",
                            "score": 2,
                            "author": "youvegotpride"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's pissing of racists, not incels. Lots of overlap in that Venn diagram but still.",
                    "score": 58,
                    "author": "AnsibleAnswers",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "IMHO, the word incel has lost all meaning, and now it basically just refers to any guy who has shitty/harmful/toxic beliefs.",
                            "score": 4,
                            "author": "BuzzImaFan"
                        },
                        {
                            "level": 2,
                            "comment": "It’s hard to distinguish between the two sometimes",
                            "score": 18,
                            "author": "goldenboy2191",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It’s actually doing terribly. And what do the incels have to do with it??",
                    "score": 19,
                    "author": "imaginexus",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Disney found out that they can get the Internet to defend their incredibly cheap, low quality remakes of beloved movies by surrounding then in a thick, slimy layer of Twitter drama. That mouse is one clever bastard I tell ya...",
                            "score": 20,
                            "author": "OwOegano_Infinite",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Because when a male-led movie comes out, like Mario or Captain America, it’s “just a kids movie,” or “I just want to turn my brain off for a bit.”\n\nBut when a female-led movie comes out, like little mermaid or captain marvel, it’s “Why is this movie so **fucking bad?!?!**” or “kids movies should be good, not mindless entertainment 😡”\n\nIt’s super obvious. Some movies (ones with boys) are recognized as “bad,” but that’s totally fine and cool. Other movies are recognized as bad, and that’s totally unacceptable, and anyone with a different opinion is part of some wild conspiracy\n\nI think marvel movies are silly, simple sci-fi movies for kids with accessible themes. The reception to Captain Marvel was absolutely insane.",
                            "score": 7,
                            "author": "BurgerMcKinley",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "People didn’t dislike captain marvel because it had a female lead. They didn’t like it because it was genuinely terrible.\n\nu/NewbornXenomorphs replied and then instantly blocked me, but I saw their comment before they did. I just want to point out that they wrote a strawman of my argument and then pretended I was dumb for thinking something that I never expressed. Reddit logic in action, everyone. Imagine being so weak that you have to block someone for thinking captain marvel had an unsatisfying character arc.",
                                    "score": 5,
                                    "author": "keystothemoon",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "And yet it got over $1B in the box office so clearly that wasn’t the average opinion.\n\nEdit: it also did well in VOD/DVD sales so you can’t argue “well people only saw it in theaters because of Endgame hype”.",
                                            "score": 3,
                                            "author": "TheUserAboveFarted",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Ha, citing the box office numbers does not trick me into thinking a terrible movie was actually good.\n\n“That main character had no arc or challenges to overcome. Her motivations were unclear and she was portrayed with all the charisma of a bag of concrete.”\n\n“But it made a billion dollars.”\n\n“In that case she was consistent, fleshed out, and magnetic.”\n\nEdit: why did this person reply and then instantly block me? This movie was terrible. Why is stating that seen as a fucking war crime? Imagine having to block someone because you’re too fragile to hear that captain marvel didn’t have a satisfying character arc.",
                                                    "score": 4,
                                                    "author": "keystothemoon",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I’m not trying to trick you into thinking it’s good. The point is: people clearly disagreed with you as the movie consistently brought asses to seats for several weeks after it’s release and people actually bought personal copies when it was released on video. \n\nSorry to inform you that your opinion is worthless and doesn’t represent the mainstream. Must be tough being told you aren’t the main character.",
                                                            "score": 2,
                                                            "author": "TheUserAboveFarted",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "The Lion King remake made 1.6 billion dollars and you'd be crazy to suggest that piece of shit was any good.",
                                                                    "score": 3,
                                                                    "author": "Kakuyoku_Sanren"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Captain marvel was the same quality as all the other shit marvel had spewed out so no, it was because of the female lead",
                                            "score": 10,
                                            "author": "Fhaksfha794",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "This is hilarious and exactly what the fan-baiting studios want. Congrats, you’ve been manipulated.\n\nPeople have legitimate criticisms of captain marvel that don’t necessarily apply to the other marvel films, but dumb dumbs just shrug and say “sexism” so those criticisms can be ignored. Way to fan-bait, studios. It worked.",
                                                    "score": 11,
                                                    "author": "keystothemoon",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I watched a movie where they keep repeating “you keep your weight when you shrink.” That concept is a pillar to the entire movie working. \n\nAt the end, a character had a shrunken tank that didn’t keep its weight. This is Ant**MAN**. \n\nMarvel movies are action garbage. Acting like Captain Marvel had “legitimate criticisms,” but every single other marvel movie doesn’t, just proves my point.",
                                                            "score": 4,
                                                            "author": "BurgerMcKinley",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Oh, so pointing out a legitimate criticism people had of antman means the legitimate criticisms of captain marvel don’t exist. Gotcha. That’s totally sound reasoning and in no way one of the strangest pieces of anti-logic I’ve ever heard. /s\n\nCarol Danvers was a boring Mary sue played with the charisma of a plank of wood. She faced no obstacles and the themes of empowerment were hollow, trite, tacked on, and condescending. Keep defending the film though.\n\nThere are tons of action movies led by women that are beloved. Funny how the sexism evaporates as soon as characters are written decently. It’s almost as if people have more complicated reactions to film that goes deeper than “she’s a girl. Me no like.” But whatever. Keep telling yourself that you’re standing up against cartoonish sexists instead of doing the studios bidding by defending this garbage movie.",
                                                                    "score": 7,
                                                                    "author": "keystothemoon",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Tony Stark builds an iron man suit in a cave. \n\n&gt;Carol Danvers is a Mary Sue. \n\nWhew, glad Tony didn’t have breasts and a vagina to distract him from building a magical exoskeleton in an afghan cave. He just had “logic,” and “facts.”\n\nHe’s just a smart, clever, industrious *MAN* though. He’s not a Gary Sue. He’s just a genius who can invent anything, and has everything he needs, and all women adore him. Totally normal, realistic, non-power fantasy character. \n\nSorry for all the “anti-logic,” lmao.",
                                                                            "score": 5,
                                                                            "author": "BurgerMcKinley",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Tony stark has serious flaws. His arrogance, for one, often gets in his own way and is something his character works to overcome throughout the course of the MCU. What character flaws did carol danvers have that she worked to overcome?",
                                                                                    "score": 7,
                                                                                    "author": "keystothemoon",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "That’s weird, because they like all the other genuinely terrible marvel movies that are starring men 🤔",
                                            "score": 6,
                                            "author": "BurgerMcKinley",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Oh yeah I heard lots of good things about Thor 2, Thor 4, ant man quantumania... Oh wait a minute",
                                                    "score": 30,
                                                    "author": "ValerianRen",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "No, they don’t. Tons of shit marvel properties get savaged by fans and critics alike. What you just wrote is factually incorrect.\n\nI love that people’s demand for sexism so far exceeds the supply that they’ll actually come to bat for the absolute pile of dogshit that was captain marvel. Keep defending garbage.",
                                                    "score": 19,
                                                    "author": "keystothemoon",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": -6,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My definition is \"not making enough to cover the cost of production and marketing\"...",
                                    "score": 22,
                                    "author": "OwOegano_Infinite",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "It needs to double that number to break even..\n\nThats godawful..",
                                    "score": 15,
                                    "author": "Dr_Will_Kirby",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Especially considering the original\nLittle mermaid was an international smash.  It had comparably poor domestic numbers at 83 mil domestically but almost 180 mill international.",
                                            "score": 3,
                                            "author": "Nobodyinc1"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "200 million worldwide after the first weekend for a movie with 250 million dollar budget is actually not very good. Not terribly, but below expectations.\n\nThe movie is doing slightly below other Disney remakes domestically, and doing MUCH worse internationally.\n\nThe movie would need around 600-700 million in order to break even, and there's doubt if it's actually going to achieve that number",
                                    "score": 19,
                                    "author": "insertusernamehere51",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Yeah it's terrible. That's really not good for a film that needs $650 - 700 million to break even. I don't have a dog in this fight, but in your own little world where it's You vs. Incels, guess what? The Incels are winning.",
                                    "score": 2,
                                    "author": "ScionN7",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Now do the cuts. Out of that 200 only 40-60 goes to Disney",
                                    "score": 3,
                                    "author": "meroisstevie"
                                },
                                {
                                    "level": 3,
                                    "comment": "With no international money at all.  That means you could be looking at 400 top\nOn a movie that cost over 200\nMill to make",
                                    "score": 6,
                                    "author": "Nobodyinc1"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": " The problem here is that it is not doing well, and there seems to be a trend of blaming the supposed review-bombing by racists for its underperformance rather than perform a more honest analysis.\n\n There was a similar situation with \"Ghostbusters\" reboot in recent memory.",
                    "score": 2,
                    "author": "SamsonFox_returned"
                },
                {
                    "level": 1,
                    "comment": "Its doing horribly..\n\nAlso what do incels have to do with this movie?",
                    "score": 6,
                    "author": "Dr_Will_Kirby",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thats not good dude…lol\n\nIt needs to double that to even break even and people aren’t showing out like they did the first HOLIDAY weekend…",
                                    "score": 3,
                                    "author": "Dr_Will_Kirby",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The idea of being #1 at anything is archaic at best.",
            "score": 4,
            "author": "jimmytime903"
        },
        {
            "level": 0,
            "comment": "Imagine being offended because a fictional creature in a movie for children is black.",
            "score": 7,
            "author": "Gooner27UK",
            "replies": []
        },
        {
            "level": 0,
            "comment": "But are we sure they’re bots?\n\nThis movie has been bombing at the office and people don’t like it… why is it all the sudden bots?",
            "score": 8,
            "author": "Dr_Will_Kirby",
            "replies": [
                {
                    "level": 1,
                    "comment": "Probably a surge of newly created accounts and way more activity than a usual release. Article says it has 33k ratings with 13k giving it 1 star. For reference, Fast X, which came out a week earlier than Little Mermaid, has 32k ratings.",
                    "score": 8,
                    "author": "NewbornXenomorphs"
                },
                {
                    "level": 1,
                    "comment": "I honestly don’t see how it was a bad movie. It’s not perfect, but it’s definitely not bad.",
                    "score": 2,
                    "author": "Empero6"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Theyve been doing this since that Amy Schumer comedy and Ghostbusters 2016. Manipulating review scores has been a common pr tactic since the introduction of social media\n\nIt makes corporate upset when the common people dont like their 600m dollar movies. Gotta rig the system so you bait and switch enough people to get your moneys worth. So let the bots fly, disable ratings, delay the scores by two weeks, only allow top commenters to score it…. The manipulations go on and on",
            "score": 6,
            "author": "blackmobius",
            "replies": [
                {
                    "level": 1,
                    "comment": " Ghosbusters didn't flop because of bad reviews, though. It flopped because people weren't interested in seeing it.\n\n Take another example: the new Star Wars saga. It still attracted lots of hate, yet managed to make bank. Review bombing doesn't matter.",
                    "score": 5,
                    "author": "SamsonFox_returned",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "  My 8 year old daughter (who demanded to wear an Ariel dress almost every day for a year a few years ago) didn’t like it. When my little redhead girl, whose favorite movie ever was the animated little mermaid, gives it a “meh” That’s all the review I need. It isn’t racism, it’s just a bad movie that never should have been remade. (Like Aladdin and the lion king).  It looks like shit, the CGI is crap, the original’s brisk pacing is gone and vibrant visuals are largely drown out. Also I find photorealistic animals talking and emoting like humans to be unsettling. Disney, please stay away from live action remakes with talking animals. Maybe try Big Hero 6 if you must continue this unoriginality quest. Just no more talking “real” animals, they’re nightmare fuel.",
            "score": 9,
            "author": "Illustrious-Club-687",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lion king was terrible. Kids couldn’t even be arsed to pay attention. All the best jokes were removed. We turned it off halfway. It clearly wasn’t made for children. Idonno about these other ones but I’m not giving any of them the time.",
                    "score": 2,
                    "author": "DudeBuddyGuyFriend",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The “live action” Lion King is truly an abomination. It’s not even “live action.” It’s just a cartoon made to look real. The whole thing made me cringe. Animals are not built to talk or express emotions like humans. It’s cute when it’s highly stylized traditional animation. The “realistic” version just looks stupid at best and scary at worst. I can’t believe Jon Favreau had the balls to take the title of director. I imagine he brought a first edition VHS version of the Lion King onset the first day of shooting, threw it at a cameraman, and said “make it exactly like this, but make the animals look terrifying.” Then he drove away and wasn’t seen again until the premiere.",
                            "score": 3,
                            "author": "Illustrious-Club-687"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Review bombs or not it doesn’t change that the movie lost ALL the good will it had built up after Kiss the Girl by immediately following it up with hand grenade to the tone that is the rapping bird. \n\nIt’s like they promised Awkwafina a song and then forgot until the last second and went uhhhhhhhh……..SCUTTLEBUTT",
            "score": 3,
            "author": "Expired-Cough-Drops",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This movie was actually really good. I feel like I’d miss just as much from this movie when watching the original, as I’d missed from the original when watching this movie.",
            "score": 3,
            "author": "Rezindez"
        },
        {
            "level": 0,
            "comment": "All the real people who saw it liked it, so…",
            "score": 3,
            "author": "the-hottest-of-damns",
            "replies": [
                {
                    "level": 1,
                    "comment": "It was a really good movie.",
                    "score": 2,
                    "author": "Empero6"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Good job Hollywood, keep pretending that the only people who don't like your poorly acted, poorly written, poorly filmed movies are racists and bigots, that'll restore your credibility. That'll stop you from hemoraging money. \n\nMakes me sick to my stomach how often the \"my detractors are racist\" marketing tactic is used nowadays and how many people buy into it. If you have anything to do with this you are truly a despicable person.",
            "score": 4,
            "author": "CaptainCanuck15",
            "replies": [
                {
                    "level": 1,
                    "comment": "Normal people just don’t purchase products  aren’t interested in. Conservatives throw a shit fit and don’t want anyone to be able to enjoy it, because of their feelings.",
                    "score": 7,
                    "author": "Undisolving"
                },
                {
                    "level": 1,
                    "comment": "Funny how this mostly happens to movies featuring POC or women though… 🤔",
                    "score": 11,
                    "author": "NewbornXenomorphs",
                    "replies": [
                        {
                            "level": 2,
                            "comment": " Oh, yes, \"Dumbo\" made bank, and \"Maleficent 2\" flopped.",
                            "score": 3,
                            "author": "SamsonFox_returned",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The discussion is review bombing. Try to stay focused.",
                                    "score": 1,
                                    "author": "NewbornXenomorphs"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You really have a big victim complex, don't you? The movie being bad and racists trolls using bots to review bomb the film can be both true. And you can clearly see it by just going to see a bunch of the reviews from the film which are just 1 star reviews from recently created accounts that haven't reviewed other stuff.\n\nAlso, the verified audience score and all the audience score on rotten tomatoes is also suspicious cause of the big difference between the two. And cause the Post track analisis for the film has been more in line with the verified audience score than with the all audience one.",
                    "score": 10,
                    "author": "AdAny5912"
                },
                {
                    "level": 1,
                    "comment": "It would probably not be a tactic if people weren't vocal racist dickwads",
                    "score": 4,
                    "author": "The_Rolling_Stone",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Great job Reddit, acting like any attempt to comedown on review bombing or racist discussion about a film is just trying to silence criticism or PR.",
                    "score": 6,
                    "author": "ManOnNoMission",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A mega corporation cashing in on cultural trends to push their creatively void crap! NEVER!!!",
                            "score": 2,
                            "author": "profdirigo"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My wife saw it with work friends. She is definitely not someone who would have an issue with actor choice and she fell asleep in the theater. That’s all I know so I assume it’s on the boring side.",
                    "score": 3,
                    "author": "Splizmaster",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I feel bad to disparage the movie because the lead does not deserve an ounce of hate she got, she actually did good, but god damn the movie was so soulless and slow. I have fallen asleep in movies twice as an adult and this was almost time number 3",
                            "score": 10,
                            "author": "KristenJimmyStewart"
                        },
                        {
                            "level": 2,
                            "comment": "I have never been to movie, and whether I liked it or hated it, fallen asleep. I don't know how you could with how loud some of them are nowadays.\n\nAnd this includes drive-in movies where you could stay for four showings in a row. RIP i-70 drive-in.",
                            "score": 2,
                            "author": "Leifthraiser"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Agree 100%",
                    "score": -1,
                    "author": "mobsterpal"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Remember when popular racism sounded like, “but I don’t see color. I’m honestly colorblind when it comes to different races…” or were those my friends I’m remembering…",
            "score": 3,
            "author": "Automatic_Scholar686",
            "replies": [
                {
                    "level": 1,
                    "comment": "From what I remember, that was a common thing for liberals to say back in the 90s. Colorblind was considered the progressive way of looking at things back then.",
                    "score": 11,
                    "author": "Turqoise-Planet",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Until we realized that “colorblindness” was basically just pretending that glaring problems with systemic racism didn’t exist. It’s a laudable goal for a far off future, but a terrible solution to our existing issues.",
                            "score": 4,
                            "author": "fuck_the_fuckin_mods",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Review bombing is definitely becoming a problem, but so is shit movie making. Idk about this one yet but it does not look good. I think the live action remakes remove the emotion the originals delivered.",
            "score": 2,
            "author": "mrdlive"
        },
        {
            "level": 0,
            "comment": "If the review is bad “it’s a bot review bomb” - or maybe just maybe the movie is actually bad? And maybe it has everything to do with its terrible writing?",
            "score": 1,
            "author": "VictorHelios1"
        }
    ]
}