{
    "id": "13zlom2",
    "score": 2042,
    "title": "Ezra Miller to Attend 'The Flash' Premiere in Los Angeles",
    "author": "Neo2199",
    "date": 1685818009.0,
    "url": "https://www.reddit.com/r/entertainment/comments/13zlom2",
    "media_urls": [
        "https://movieweb.com/ezra-miller-attend-the-flash-premiere/"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Residents of LA are expected to take precautions.",
            "score": 891,
            "author": "Wazula23",
            "replies": [
                {
                    "level": 1,
                    "comment": "At least Hawaii is safe. For now.",
                    "score": 205,
                    "author": "ControlPrinciple",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You never know, he could be there in a flash",
                            "score": 108,
                            "author": "anonymous65789568",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "r/angryupvote",
                                    "score": 3,
                                    "author": "BigTimeSuperhero96"
                                },
                                {
                                    "level": 3,
                                    "comment": "🤦‍♂️",
                                    "score": 16,
                                    "author": "No_Repeat_229"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "![gif](giphy|XxCSxCoOWyyAz9umNd|downsized)\n\nEzra walking the red carpet",
                    "score": 25,
                    "author": "Pokii",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 326,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Last year, Miller was [arrested twice in Hawaii]( https://www.youtube.com/watch?v=WhmTT6Or70k), however, all charges and restraining order against Miller were dropped. \n\nThis year, and in Vermont this time, [Miller agreed to \"plead guilty to unlawfully trespassing as part of a plea deal to avoid going to prison\".]( https://www.bbc.com/news/entertainment-arts-64269515)",
                    "score": 496,
                    "author": "Neo2199",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A restraining order was also granted against him in Massachusetts protecting a mother and daughter whose house he broke into.\n\n“According to the Daily Beast's investigation, the family was at a downstairs neighbor's house in Greenfield, Mass., on Feb. 2, when Miller (allegedly a friend-of-a-friend of the neighbor) showed up. According to the visiting neighbor, as told to the Daily Beast, Miller was wearing a bulletproof vest and began acting erratically. The actor allegedly claimed that the board game Parcheesi has Rastafarian roots and, when questioned on the specifics of this claim, opened their jacket to reveal a gun and said, \"Talking like that could get you into a really serious situation.\"”\n\nhttps://ew.com/celebrity/ezra-miller-allegedly-harassed-minor-gun/",
                            "score": 162,
                            "author": "diglettdigyourself",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That’s hilarious and simultaneously terrifying.",
                                    "score": 116,
                                    "author": "MinfulTie",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I think they need help. I hope they get help. But that will always make me laugh.",
                                            "score": 41,
                                            "author": "diglettdigyourself",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Allegedly they moved in with their mom and have been receiving help.",
                                                    "score": 17,
                                                    "author": "KHRD-IT",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "It reads like a bit from I Think You Should Leave",
                                            "score": 4,
                                            "author": "GonzoRouge"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Holy Shit. First time hearing this. I just laughed outloud with that visual but terrifying at the same time because it actually happened.",
                                    "score": 12,
                                    "author": "ignatious__reilly"
                                },
                                {
                                    "level": 3,
                                    "comment": "Dude. Miller sounds schizophrenic. They need help. They need a mental institution. They don’t need 10 mil more dollars on a crappy movie and fancy premieres. Fuck hollywood, fuck rich people.",
                                    "score": 51,
                                    "author": "One-Cobbler-4960",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It’s not rich people that are going to be buying all of those tickets.",
                                            "score": 14,
                                            "author": "IllWorry8404",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "that situation isn’t funny but it’s also so fucking funny. i will continue to spread the parcheesi conspiracy theory",
                                    "score": 14,
                                    "author": "botjstn"
                                },
                                {
                                    "level": 3,
                                    "comment": "Parcheesi is an American adaptation of Parcisi, which originated in Ancient India. \n\n\nAnd if Ezra Miller is reading this....it definitely has rastafarian roots. I never doubted you, mister Miller. You are very normal and not crazy at all.",
                                    "score": 26,
                                    "author": "dlte24",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The rich are different. They suffer no consequences.",
                            "score": 320,
                            "author": "Top-Philosophy-5791",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If they (Warner) hadn't invested that much, he would have been left alone to solve his problems. \n\nBut time will probably R.Kelly the sh*t out of him.",
                                    "score": 117,
                                    "author": "bronco_y_espasmo",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Exactly, this is definitely becoming an R Kelly situation.",
                                            "score": 34,
                                            "author": "RightOpportunity7912",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "uh oh. I hope people bring umbrellas to the movie premiere.",
                                                    "score": 4,
                                                    "author": "Seafea"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "He would still probably solve those problems with his own money anyway.",
                                            "score": 5,
                                            "author": "Makath",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "bingo",
                                    "score": 12,
                                    "author": "bleepbloorpmeepmorp"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Thank you for the update!!",
                            "score": 47,
                            "author": "winterxsouth",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No problem.",
                                    "score": 24,
                                    "author": "Neo2199"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I’ve always said this but this weirdo has some major shit on a higher up executive because it doesn’t make sense that they keep him around with how much of a liability he is",
                            "score": 41,
                            "author": "Far-Yak-4231",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's because they already put too much into the movie to let it fail.  It's not like they could edit him out.\n\nIf the movie is a hit, we'll see what happens, but if it flops, we won't see Ezra in movies any more.",
                                    "score": 23,
                                    "author": "255001434",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "God, I hope it flops so bad.\n\nProbably not though, because geeks.\n\nAnyway, first thought I had was \"I see they let Ezra out of the hole they stashed them in for the last year. Good luck with that.\"",
                                            "score": 15,
                                            "author": "jenfullmoon",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "He actually pled guilty to the Hawaii Assault Charge, according to the BBC. So like, twice convicted felon fronting major WB release. Well done, WB - Hollywood's moral bankruptcy? If no-one else, it's y'all.",
                            "score": 53,
                            "author": "LucillaGalena",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Miller has been involved in so many stuff, that's hard to keep track on all of them!\n\n\n\n[BBC](https://www.bbc.com/news/entertainment-arts-64269515):\n\n&gt; The actor has been involved in a string of high-profile incidents and controversies, including being arrested twice in Hawaii in 2022.\n\n\n&gt; They were later charged with disorderly conduct and harassment and second-degree assault.\n\n\n&gt; They pled no contest to the assault charge and paid a $500 (£442) fine and $30 (£26) in court costs. The harassment charge was later dismissed.\n\n[Hawaii Tribune-Herald](https://www.hawaiitribune-herald.com/2022/04/19/hawaii-news/the-flash-actor-ezra-miller-arrested-after-alleged-pahoa-incident/): Ezra Miller pleads no contest to disorderly conduct, two other charges dropped - April 19, 2022\n\n&gt; Hours after Ezra Miller was arrested early this morning for an alleged chair throwing incident that injured a woman in Puna, the actor was fined $500 for a disorderly conduct charge from an incident in a Hilo bar last month.\n\n\n&gt; In return for Miller’s no contest plea, Hilo District Judge Kanani Laubach dismissed a charge of harassment from the same incident and a charge of obstructing a public sidewalk in a separate incident.\n\n\n[Variety](https://variety.com/2022/film/news/ezra-miller-restraining-order-dropped-1235232072/): Restraining Order Against Ezra Miller Dropped by Hawaii Couple - Apr 13, 2022\n\n\n&gt; A temporary restraining order against “The Flash” star Ezra Miller has been dropped, less than three weeks after it was filed and Miller was arrested for disorderly conduct and harassment in Hawaii.\n\n\n&gt; According to the Associated Press, a judge dismissed the restraining order on Tuesday after a request by the Hawaiian couple who had filed it on March 29. The restraining order claimed Miller burst into the couple’s bedroom and threatened them, and Miller allegedly stole some of the couple’s belongings, including a passport and wallet.",
                                    "score": 33,
                                    "author": "Neo2199",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Didn't he also assault someone in a bar in Iceland but was never charged? IIRC that happened before the Hawaii incidents. So he's technically an international criminal.",
                                            "score": 2,
                                            "author": "Intelligent-Tie-4466"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "That's not entirely correct. He pled no contest to disorderly conduct in Hawaii. The Hawaiian husband and wife did decide to drop their restraining order, but who knows why they did that. Perhaps Miller offered them payment.",
                            "score": 7,
                            "author": "Prestigious_Ad_5825"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "gonna be awkward if he gets served on the red carpet for any of his misdeeds",
            "score": 433,
            "author": "JustrousRestortion",
            "replies": [
                {
                    "level": 1,
                    "comment": "Photographer at premiere: “Ezra, Ezra over here! Ezra Miller!” *Snaps photo. Then hands him an envelope.* “You’ve been served.”",
                    "score": 17,
                    "author": "Omegawylo"
                },
                {
                    "level": 1,
                    "comment": "He'll use his Jesus powers.",
                    "score": 73,
                    "author": "DortDrueben",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He's the flash, he'll merely run away",
                            "score": 33,
                            "author": "Zrat11",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Miller: \"you cannot touch me, I am in another universe.\"",
                                    "score": 26,
                                    "author": "Neo2199"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"Somehow Ezra Miller returned\"",
            "score": 185,
            "author": "dickshark420",
            "replies": [
                {
                    "level": 1,
                    "comment": "The Flashpoint Paradox",
                    "score": 30,
                    "author": "Pickledbutterfly"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm so tired of watching this douchebag rewarded for piss-poor behavior.",
            "score": 731,
            "author": "RightOpportunity7912",
            "replies": [
                {
                    "level": 1,
                    "comment": "Why I’m not going to watch his movies.",
                    "score": 149,
                    "author": "Unlucky_Clover",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Be safe out there everyone. Erzra might try to fight/assault someone.",
            "score": 25,
            "author": "Western-Web2957",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This is very disappointing to hear… dude is a piece of shit and doesn’t deserve to enjoy the movies success at all. Not a good look for DC",
            "score": 266,
            "author": "almosthuman2021",
            "replies": [
                {
                    "level": 1,
                    "comment": "James gunn gonna have to field a lotta questions about it going forward. Better to just ditch the guy, and easier too! There’s probably some legally binding clause that ensure he does press and events for the film",
                    "score": 74,
                    "author": "KentuckyFriedEel",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Supposedly the movie is just that good so they’re willing to weather the storm.",
                            "score": 24,
                            "author": "2chainzzzz",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I’m in this same boat.  If the movie sucked,  why deal with a toxic person and a shit movie.  My guess is they see promise.\n\nBut I could be wrong and this ages like milk.",
                                    "score": 14,
                                    "author": "pabarb02",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "ive already seen it and it wasn’t good sorry to disappoint lol. the movie was generic imo, characters didn’t really shine and the cgi was terrible. although i can look past the cgi. there were a few nice surprises though. in my screening i didn’t have end credits though so no idea about that",
                                            "score": 14,
                                            "author": "alluvicqueen"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They cut amber heard but kept this fucking loser, the lack of consistency is ridiculous and another example why Hollywood is complete garbage",
                    "score": 26,
                    "author": "george_costanza1234",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hope Chris Hansen is there to greet him",
            "score": 20,
            "author": "jbish21"
        },
        {
            "level": 0,
            "comment": "You know it‘s bad when the lead gets a news article about attending their own premiere",
            "score": 141,
            "author": "EldenMiss"
        },
        {
            "level": 0,
            "comment": "Yeah, I don’t want to hear shit about cancel culture ever again.",
            "score": 808,
            "author": "Salty_Lego",
            "replies": [
                {
                    "level": 1,
                    "comment": "I mean Kevin Spacey was able to get work again a couple years ago so it’s not all that surprising.",
                    "score": 90,
                    "author": "Darnell5000",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well that was tiny indie film that was 1000% trying to ride on his notoriety and it really didn't work. I mean it's shitty that there's people still offering him work but he hasn't been welcomed back to mainstream tv/film in the slightest.",
                            "score": 84,
                            "author": "AlabastorRetard",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's coming",
                                    "score": 15,
                                    "author": "PetyrDayne"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Dude he just held some folks hostage and maybe kidnapped a kid.  \n\nNot like he said he was Christian or a republican.  Calm down.",
                    "score": 215,
                    "author": "MaliciousMirth",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I can't think of anyone who was \"cancelled\" who didn't deserve it lol",
                            "score": 63,
                            "author": "TheCrushSoda",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Peewee Herman",
                                    "score": 77,
                                    "author": "Henry_Cavillain",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Just some innocent wanky panky.",
                                            "score": 8,
                                            "author": "bear_sausage",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I mean, it was in a PORNO movie theater. I’ve always thought it was so weird that there were cops there trying to bust people for jerking it at a PORN theater.",
                                                    "score": 35,
                                                    "author": "ndg127",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Worst. Job. Ever.\n\nAside from being a porno theater janitor, I suppose.",
                                                            "score": 11,
                                                            "author": "cannonfunk",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Randal Graves : The jizz-mopper's job is to clean it up after each guy shoots a load, 'cause practically everybody does it right on the window. I don't know if you know this or not, but cum leaves streaks if you don't clean it right away.",
                                                                    "score": 2,
                                                                    "author": "[deleted]"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Meg Smaker",
                                    "score": 8,
                                    "author": "consequentialdust"
                                },
                                {
                                    "level": 3,
                                    "comment": "Al Franken.",
                                    "score": 140,
                                    "author": "recovery_room",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "James Gunn from GotG3, before Disney changed their minds",
                                    "score": 68,
                                    "author": "giantpotato"
                                },
                                {
                                    "level": 3,
                                    "comment": "Aziz Ansari",
                                    "score": 38,
                                    "author": "waitmyhonor",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Jesus I forgot about this shitshow lmao, but if I recall correctly the clown accuser lost the support of women real fast once the details came out.\n\nMany women tend to agree that people who use the power of the MeToo movement for their own personal agendas are horrible people",
                                            "score": 19,
                                            "author": "george_costanza1234",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Was he canceled? I just found him annoying and he stopped after his last comedy special.",
                                            "score": 12,
                                            "author": "Capt4in4m3rica"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Janet Jackson, at least for a few years.",
                                    "score": 2,
                                    "author": "SaintNutella"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yeah because everyone knows how often it is for celebrities to get cancelled because….Christianity? Even though some of the most adored celebrities in America are Christian y’all cannot stop with the self oppression of it all.",
                            "score": 12,
                            "author": "butterwuth"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "He was never cancelled",
                    "score": 12,
                    "author": "ExtremeBoysenberry38",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I never believed in it. the Chris Brown shit happened before it was a “thing” and that reinforced in me just how willing people are to support monsters.",
                    "score": 2,
                    "author": "aSpookyScarySkeleton"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Several women will end up choked and or kidnapped during this premiere",
            "score": 11,
            "author": "KingOfAllDownvoters"
        },
        {
            "level": 0,
            "comment": "It's insane they didn't just recast him. Nobody would have cared. Now the studio's tied themselves to a piece of shit, and the only thing people are saying about this movie is that the lead actor in their superhero movie a total creep and criminal.\n\nI'll pass on spending my time and money to see this movie.",
            "score": 10,
            "author": "tcmasterson",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's insane to me they took a loss on Batgirl but they'll release this considering the negative reactions. I'd honestly see a bad Batgirl movie than see The Flash. He's not even a good Barry.",
                    "score": 10,
                    "author": "ChelseaG12"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Allowing Ezra to attend the premier is WB showing they absolutely don't care about their crimes.\n\nEdit: Changed pronoun because I honestly forgot what Ezra identifies as.",
            "score": 28,
            "author": "SayaScabbard",
            "replies": [
                {
                    "level": 1,
                    "comment": "They’ve been showing that since the beginning. And Andy is singing his praises. It’s pretty disgusting. Even if it’s just PR, they go the extra mile to defend the indefensible and it’s not necessary.",
                    "score": 9,
                    "author": "ControlPrinciple"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I wouldnt if I was him. Dude be kidnapping and assaulting people.",
            "score": 9,
            "author": "fasterthanexpected20"
        },
        {
            "level": 0,
            "comment": "If this movie flops, it will be the funniest thing ever. Who doesn't want to see that instead?",
            "score": 9,
            "author": "Bog2ElectricBoogaloo"
        },
        {
            "level": 0,
            "comment": "We Need To Talk About Ezra",
            "score": 7,
            "author": "survivingspitefully"
        },
        {
            "level": 0,
            "comment": "&gt; **Embattled actor Ezra Miller will be making a public appearance this month in support of The Flash. Though Miller is the star of the superhero movie, the actor has not been taking part in any of the press coverage. That was expected, as there has been a lot of controversy attached to Miller over the past year due to the various criminal charges and serious allegations made against them (Miller uses they/them pronouns).** Last summer, Miller announced that they had sought professional help for their mental health struggles. The director and producers of The Flash have stood by Miller throughout the ordeal.\n\n\n&gt; Though Miller has kept a very low profile since making that announcement, Variety reports that **the actor will be in attendance at the Los Angeles premiere of The Flash on June 12. But while they'll be on the red carpet to pose for photos, Miller won't be participating in any interviews with press at the event.** \n\n&gt; **Michael Keaton, who co-stars in the film alongside Miller, won't be attending as he is currently working on a project in London.** Director Andy Muschietti will be present alongside The Flash stars Sasha Calle, Michael Shannon, and Ben Affleck.",
            "score": 45,
            "author": "Neo2199",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have no clue who Michael Shannon is as a person but I’d love to see him go Van Alden on Ezra in front of a live audience.",
                    "score": 26,
                    "author": "QueensOfTheNoKnowAge",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Something [like this](https://m.youtube.com/watch?v=dngOH9G4UPw)?",
                            "score": 16,
                            "author": "d0ctorzaius",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That was amazing",
                                    "score": 2,
                                    "author": "melbournediver"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I must have watched that scene with the irons over a hundred times easy, Van Alden was hilarious.",
                            "score": 2,
                            "author": "TheKingOfSting93",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Same.  Loved hearing that little bitch boy squeal.  And the little smirk Van Alden got when everyone was cowering was so satisfying after all the office bullshit he put up with.",
                                    "score": 2,
                                    "author": "QueensOfTheNoKnowAge"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’ve heard rumors they’re keeping them on as The Flash too.\n\nI hate that most people seeing The Flash aren’t even seeing it for The Flash, they’re seeing it for Supergirl and Keaton Batman, but if the movie is huge they’re going to attribute it to this fuckwad.\n\nMakes me not wanna see it.",
            "score": 73,
            "author": "KrookedDoesStuff",
            "replies": [
                {
                    "level": 1,
                    "comment": "They're recasting the entirety of the DC Universe and starting from scratch (aside from THE Suicide Squad, as that movie might be retroactively set in the new universe from this point onwards)\n\nI'm certain that they're just waiting until the flash movie has made them some money before publicly announcing that it's main actor is getting kicked out",
                    "score": 33,
                    "author": "Static-Space-Royalty"
                },
                {
                    "level": 1,
                    "comment": "Keaton is Batman to me and I didn't care about the movie until I found out he was in it. Now I have to see it but I will wait until it's on TV.",
                    "score": 15,
                    "author": "Amadai"
                },
                {
                    "level": 1,
                    "comment": "&gt;  they’re seeing it for Supergirl and Keaton Batman \n\nWho tf is seeing it for Supergirl",
                    "score": 15,
                    "author": "AccomplishedLocal261",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The parents of the actress",
                            "score": 14,
                            "author": "Countmardy"
                        },
                        {
                            "level": 2,
                            "comment": "I’d like to know as well…",
                            "score": 4,
                            "author": "Other_Zucchini_9637"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s odd to me that the studio is backing them so much because I don’t even think they’re that good in the role",
            "score": 83,
            "author": "BulbasaurCPA",
            "replies": [
                {
                    "level": 1,
                    "comment": "An actor playing a superhero in a tentpole release like this is supposed to be a role model, or at least behave like a functional human being in public.",
                    "score": 22,
                    "author": "RightOpportunity7912",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah man, this is just so uncomfortable and sad. They’re signing off on this behavior as worthy to put on the mask.",
                            "score": 7,
                            "author": "armageddidon"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Apparently the general audience said he acted his ass off in this movie.\n\nHe is a great actor, sucks that he is the way he is though",
                    "score": 26,
                    "author": "TheAlphaBeatZzZ",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 7,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Who is the *general audience?* It hasn’t even released yet so it’s not the average movie-goer. Is it a specific person with the rank of general that was named audience? Is there a corporal audience? What are their qualifications to critique movies or actors? They may be able to discuss troop movements and military strategy but being a general holds no weight when talking about movies. Everything about this claim is suspect.",
                            "score": 45,
                            "author": "BlueFox5",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "No thanks I don't support monsters.",
            "score": 31,
            "author": "Disastrous_Life_9385"
        },
        {
            "level": 0,
            "comment": "This movie and the endless BS people are putting out to justify this SOB being in it makes me want to vomit.\n\nCan’t wait for the asinine “well just don’t see the movie dude comments.”",
            "score": 31,
            "author": "StannisTheMantis93",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh I received one of those already, for another Ezra-related post I made. I told them to keep their snark to themselves.",
                    "score": 4,
                    "author": "RightOpportunity7912",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Fuck this asshole",
            "score": 8,
            "author": "buddycheesus"
        },
        {
            "level": 0,
            "comment": "Idc, I'm not watching the film. Hope it tanks at the BO.",
            "score": 34,
            "author": "BellTT",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I’m every picture all I can think is “that mask makes his face look ridiculous” it’s like he’s wearing big swim goggles all movie",
            "score": 6,
            "author": "CoachCrunch12"
        },
        {
            "level": 0,
            "comment": "Hide yo kids, Hide yo wives",
            "score": 7,
            "author": "SydneyPhoenix"
        },
        {
            "level": 0,
            "comment": "I thought this mf was a fugitive lmaoo",
            "score": 6,
            "author": "Goobah22",
            "replies": [
                {
                    "level": 1,
                    "comment": "I did too!",
                    "score": 2,
                    "author": "floofnstuff"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Jonathon majors must be sick his dumbass got caught abusing people AFTER his big box office movies came out.",
            "score": 47,
            "author": "slimmymcnutty",
            "replies": [
                {
                    "level": 1,
                    "comment": "His big box office movie was going to be Avengers: Kang Dynasty, which hasn't even started shooting yet",
                    "score": 16,
                    "author": "Taraxian"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hopefully people will show up and throw eggs at him",
            "score": 37,
            "author": "ilovelucy7734",
            "replies": [
                {
                    "level": 1,
                    "comment": "it fucking HURTS to get hit with eggs. one time i was walking downtown and this car drove by and threw two eggs right at my chest. i had bruises for weeks.\n\ncrossing my fingers this happens 🥚",
                    "score": 7,
                    "author": "annajoo1"
                },
                {
                    "level": 1,
                    "comment": "That's exactly what I said. And I hope the cameras are rolling when the eggs are thrown.",
                    "score": 7,
                    "author": "RightOpportunity7912"
                }
            ]
        },
        {
            "level": 0,
            "comment": "fingers crossed it’s with a police escort.",
            "score": 5,
            "author": "The_Last_Mouse"
        },
        {
            "level": 0,
            "comment": "He should be attending a prison cell…",
            "score": 6,
            "author": "Pktur3"
        },
        {
            "level": 0,
            "comment": "It would be so funny if he does something reprehensible at the premier, completely solidifying the psychosis of DC pressing on for so long with this clown.",
            "score": 6,
            "author": "itsGOOB"
        },
        {
            "level": 0,
            "comment": "He is a Predator",
            "score": 5,
            "author": "1stAlchemist"
        },
        {
            "level": 0,
            "comment": "I don’t care how much they try to pump this. It’s just not cool.",
            "score": 28,
            "author": "Repulsive_Mistake_13",
            "replies": [
                {
                    "level": 1,
                    "comment": "The positive reviews don't feel organic. It all feels bought-and-paid for. They will shove it down our throats even if they kill all of us in the process... that's the tone.",
                    "score": 13,
                    "author": "RightOpportunity7912",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They aren't organic. The movie is okay at best. They had an early screening at military bases, and I saw it a few hours ago. There are cool moments, and it is better than the last few DCU movies, but it still has issues tbh.",
                            "score": 8,
                            "author": "NeoEpoch"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Get that person a straight jacket with a Flash logo, and everyone will feel much safer. Instead of super speed, they have the power of super creepiness.",
            "score": 26,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Didn’t he kidnap a minor to sexually abuse? Why isn’t he in prison?",
            "score": 27,
            "author": "darling123-",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, that is one of the more serious accusations against him.",
                    "score": 9,
                    "author": "KellyJin17"
                },
                {
                    "level": 1,
                    "comment": "He’s the Flash!  They couldn’t catch him. Nobody can!",
                    "score": 6,
                    "author": "Omg-A-turkey-Sammie"
                }
            ]
        },
        {
            "level": 0,
            "comment": "He should be attending prison. Fuck him.",
            "score": 10,
            "author": "Disastrous-Ad-4494"
        },
        {
            "level": 0,
            "comment": "Can they please just stop with this fucking guy, I do want to watch the movie, but what the fuck with this man",
            "score": 12,
            "author": "drobythekey"
        },
        {
            "level": 0,
            "comment": "![gif](giphy|l1J3G5lf06vi58EIE)",
            "score": 16,
            "author": "SVS_Writer"
        },
        {
            "level": 0,
            "comment": "This is the reason I'm not seeing this movie. Miller needs to be fired.",
            "score": 5,
            "author": "TabulaRasaT888"
        },
        {
            "level": 0,
            "comment": "Rich people. Suffering no consequences for their actions.",
            "score": 3,
            "author": "TheManTheyCallHungo"
        },
        {
            "level": 0,
            "comment": "2023 is so unhinged I could scream 💀💀💀😭😭",
            "score": 5,
            "author": "Remarkable_Dig_4357"
        },
        {
            "level": 0,
            "comment": "Emile Hirsch while not as mainstream literally choked some chic out don’t remember what happened but no jail time this was before his small role in once upon a time in hollywood.",
            "score": 6,
            "author": "Movinfusion36"
        },
        {
            "level": 0,
            "comment": "I was offered a free screening from fandango for this but I don’t want to support this creep even for free. I’ll just watch Return of the King for the billionth time.",
            "score": 4,
            "author": "Medusagemini"
        },
        {
            "level": 0,
            "comment": "It’s a bold strategy cotton, let’s see how it plays out.",
            "score": 3,
            "author": "KickerofTale"
        },
        {
            "level": 0,
            "comment": "Watch out! He's a shover and a kidnapper",
            "score": 4,
            "author": "FreshBakedButtcheeks"
        },
        {
            "level": 0,
            "comment": "Fuck Ezra Miller and fuck this movie!",
            "score": 4,
            "author": "userloser11"
        },
        {
            "level": 0,
            "comment": "Gross! This person should not be allowed to attend!",
            "score": 4,
            "author": "AnywhereStunning8502"
        },
        {
            "level": 0,
            "comment": "I love the flash and hate I won’t be seeing a great flash movie in theaters but I just can’t support this film because WB seems to be fine with his behavior",
            "score": 3,
            "author": "JerrodDRagon"
        },
        {
            "level": 0,
            "comment": "Doesn’t he still have an active warrant???",
            "score": 9,
            "author": "Fresh-Till-4869",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Didn’t he like……. Indoctrinate a child activist?",
            "score": 9,
            "author": "HauntedMagnetar"
        },
        {
            "level": 0,
            "comment": "Hows he not in jail?!?!?",
            "score": 19,
            "author": "Nomanslav",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Good thing theater seats are bolted to the ground.",
            "score": 14,
            "author": "unequalflyer"
        },
        {
            "level": 0,
            "comment": "No idea why everybody is protecting him and saying that without Ezra there is no Flash. There are hundreds of anaemic white twinks in LA who would love to have this opportunity.",
            "score": 9,
            "author": "iSmellLikeBeeff",
            "replies": [
                {
                    "level": 1,
                    "comment": "When connections make THE difference…",
                    "score": 2,
                    "author": "hindusoul"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This just proves that cancel culture isn’t doing shit and doesn’t even exist. Obviously the studios aren’t scared of backlash, probably because there isn’t really ever any that actually effects them in a meaningful way. \n\nPeople will comment under this post that they’re “disgusted!” And “This person is horrible!” but then will go see the movie. I’m starting to become convinced that lots of people are just pretending to care or will get angry momentarily but “ooo the trailer looked good so I’ll just spoil myself and go teehee”. \n\nHope it tanks, but unless people put their money where their mouths are, Hollywoods gonna keep cashing in where they can.",
            "score": 7,
            "author": "babybat86",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Hollywood is a fucking joke.",
            "score": 7,
            "author": "MastersonMcFee"
        },
        {
            "level": 0,
            "comment": "Swat team on stand by",
            "score": 3,
            "author": "Youngerdiogenes"
        },
        {
            "level": 0,
            "comment": "Keep Your kids away from that place",
            "score": 3,
            "author": "YubNub81"
        },
        {
            "level": 0,
            "comment": "Quick, hide yo kids!",
            "score": 3,
            "author": "Guttersnipe_1980"
        },
        {
            "level": 0,
            "comment": "Not going to see it",
            "score": 3,
            "author": "KingFounderTitan"
        },
        {
            "level": 0,
            "comment": "This seems like a great idea 😬",
            "score": 3,
            "author": "Destryannn"
        },
        {
            "level": 0,
            "comment": "I don’t care how many batmen are in this movie I’m not watching it",
            "score": 3,
            "author": "centsei408"
        },
        {
            "level": 0,
            "comment": "I will never watch this movie or support this creep.",
            "score": 3,
            "author": "lit3myfir3"
        },
        {
            "level": 0,
            "comment": "What if he assaults someone at the premiere",
            "score": 3,
            "author": "berdonIlp"
        },
        {
            "level": 0,
            "comment": "So this will be in r/whatcouldgowrong after the premiere then.",
            "score": 3,
            "author": "brianlangauthor"
        },
        {
            "level": 0,
            "comment": "At least the chairs are bolted down",
            "score": 3,
            "author": "max9275ii"
        },
        {
            "level": 0,
            "comment": "This dude got arrested in Hawaii. Quite the trouble maker.",
            "score": 3,
            "author": "kaaikala"
        },
        {
            "level": 0,
            "comment": "![gif](giphy|s0I1WqQfEx3P2|downsized)",
            "score": 3,
            "author": "Low-Possession-4491"
        },
        {
            "level": 0,
            "comment": "I am not supporting him or this movie.",
            "score": 3,
            "author": "ghost11111113"
        },
        {
            "level": 0,
            "comment": "Going to wheel them in like Hannibal lector?",
            "score": 3,
            "author": "leggy89",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Ooooh can’t wait to see who he takes hostage",
            "score": 3,
            "author": "TWAT_BUGS"
        },
        {
            "level": 0,
            "comment": "Good to know, I'll be sure to miss that one",
            "score": 6,
            "author": "MrDeacle"
        },
        {
            "level": 0,
            "comment": "This to me, was the weakest part of justice league - it felt like an awkward projection of Justin Long. Add his bizarre episodes and I won’t be spending any time or money watching this. Seems when there’s money involved, there’s 2 sets of laws tho…",
            "score": 20,
            "author": "Admirable-Sink-2622",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Dudes a weirdo of all the canceling done this individual gets a pass from the pitch fork mafia it's wildly comical to me.",
            "score": 6,
            "author": "madtricky687"
        },
        {
            "level": 0,
            "comment": "Should be watching it from his prison cell.",
            "score": 3,
            "author": "dukenny"
        },
        {
            "level": 0,
            "comment": "Ugh. That guy needs to be locked up.",
            "score": 3,
            "author": "SiWeyNoWay"
        },
        {
            "level": 0,
            "comment": "I hope someone throws eggs at Ezra while he's walking the red carpet.",
            "score": 4,
            "author": "RightOpportunity7912",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Fuck Ezra Miller and honestly the movie looks like shit anyways. The only thing that interested me was &gt;! Having Keatons Batman in it !&lt; other than that it looks awful. At least in my opinion.",
            "score": 3,
            "author": "turk_turklton"
        },
        {
            "level": 0,
            "comment": "I got a pass to see a free screening of the movie this week. Not sure if I want to go, I wouldn't pay to see it but free, maybe.",
            "score": 2,
            "author": "Technicolor_Reindeer"
        },
        {
            "level": 0,
            "comment": "… in a straitjacket",
            "score": 2,
            "author": "Sour-Scribe"
        },
        {
            "level": 0,
            "comment": "Noooooo no no no no! Don’t do this Warner Discovery!",
            "score": 2,
            "author": "KentuckyFriedEel"
        },
        {
            "level": 0,
            "comment": "I can adore this movie and still disapprove of his behaviours, right?",
            "score": 2,
            "author": "theSaltySolo",
            "replies": []
        },
        {
            "level": 0,
            "comment": "He’s disgusting and so are WB and everybody running around with their hypocrisy",
            "score": 2,
            "author": "Sarahquikgo"
        },
        {
            "level": 0,
            "comment": "Hide yo kids, hide yo wives",
            "score": 2,
            "author": "WHATS_EATING_MY_FACE"
        },
        {
            "level": 0,
            "comment": "Better make sure the chairs are bolted down. Might as well keep all the women away from him to, just to be safe. And for God's sake, don't serve him any alcohol.",
            "score": 2,
            "author": "Dinobot29"
        },
        {
            "level": 0,
            "comment": "![gif](giphy|XxCSxCoOWyyAz9umNd|downsized)",
            "score": 2,
            "author": "Odd_Advance_6438",
            "replies": [
                {
                    "level": 1,
                    "comment": "I hate this meme because it conditions the public to expect the worst from Miller. If Miller is able to act like a normal human for two minutes, his gullible fans will declare him cured.",
                    "score": 2,
                    "author": "Prestigious_Ad_5825"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Everyone keep your women and children safe. Also 20 bucks says he gets arrested again on the premiere night.",
            "score": 2,
            "author": "Firamaster",
            "replies": [
                {
                    "level": 1,
                    "comment": "No, Miller will wait until next year to act up because they are currently on probation and want to prove to WB that they are reformed.",
                    "score": 2,
                    "author": "Prestigious_Ad_5825"
                }
            ]
        },
        {
            "level": 0,
            "comment": "https://www.cnn.com/2022/04/19/entertainment/ezra-miller-arrest/index.html",
            "score": 2,
            "author": "kaaikala",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Honestly… this is great news! So that there is a specific time and place he can be served without a way to dodge it.",
            "score": 2,
            "author": "spadiddle"
        },
        {
            "level": 0,
            "comment": "Is he going to be in a golden cage on red carpet?",
            "score": 2,
            "author": "beanedjibe"
        },
        {
            "level": 0,
            "comment": "DOUBLE STANDARDS!!! If ANY of us “normies” were to commit any of his crimes, we’d already be thrown in jail! $500 bail for a multi-million dollar earning actor? WOW. AND he can still attend the event, have his name blazoned all across the internet? Fuck me WHERE are people’s standards and morals!",
            "score": 2,
            "author": "daithi_dee"
        },
        {
            "level": 0,
            "comment": "I would not want to be in the same room as Ezra, under any circumstances.",
            "score": 2,
            "author": "Alucardra12",
            "replies": [
                {
                    "level": 1,
                    "comment": "happy cake day!",
                    "score": 2,
                    "author": "Bf4Sniper40X"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This person STILL being involved as the flash makes me not want to see this movie.",
            "score": 2,
            "author": "knottynate"
        },
        {
            "level": 0,
            "comment": "“Hide yo kids. Hide yo wife.”",
            "score": 2,
            "author": "MRintheKEYS"
        },
        {
            "level": 0,
            "comment": "Dude is scum &amp; I hope it flops",
            "score": 2,
            "author": "WaitingFor45sArrest"
        },
        {
            "level": 0,
            "comment": "Hide your wives. Hide your kids.",
            "score": 2,
            "author": "no1likesmods"
        },
        {
            "level": 0,
            "comment": "Hide your kids, hide your wives",
            "score": 2,
            "author": "ZIPPERGAMES"
        },
        {
            "level": 0,
            "comment": "I’m sure the studio has hired a minder for him to make sure he doesn’t get in too much more trouble.",
            "score": 2,
            "author": "chickennuggetsnsubs",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Thank god we have a role model like Ezra in the flash suit and thanks DC for firing Henry Cavill. I want my kids to have good role models to look up to /s",
            "score": 2,
            "author": "ThaddeusSimmons"
        },
        {
            "level": 0,
            "comment": "Super disappointed Stephen King took money to tweet about liking the flash movie \"I don't care what anyone says the flash movie is special\" LMAO 💀",
            "score": 2,
            "author": "tookmeyearstowrite"
        },
        {
            "level": 0,
            "comment": "Good luck being asked dozens of questions about your crimes at the premiere.",
            "score": 2,
            "author": "HM9719"
        },
        {
            "level": 0,
            "comment": "Remember kids - as long as you are attached to a huge franchise (and not black I.e Jonathan Majors) the studio will forgive anything.",
            "score": 2,
            "author": "Zestyclose-Let-6758",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Scrap everything and just continue with the ‘Superman &amp; Lois’ series, ‘The Batman’ and Peacemaker/Suicide Squad.\n\nThere isn’t much else worth keeping around at this point.",
            "score": 2,
            "author": "CtrlAltEvil"
        },
        {
            "level": 0,
            "comment": "There's always people in the DCU reddit groups defending this trash bag. Meanwhile he's hardly welcomed at his own movie premiere lolol",
            "score": 2,
            "author": "xMrBryanx"
        },
        {
            "level": 0,
            "comment": "Not a chance in hell will any of my  money will be funding this film. Fuck Warner brothers. Profit is more important than having a decent moral compass",
            "score": 2,
            "author": "Bellamac007"
        },
        {
            "level": 0,
            "comment": "Reminder that two different 12 year olds had to go to to court and get protective orders against Ezra Miller.",
            "score": 2,
            "author": "37119636"
        }
    ]
}