{
    "id": "1410y79",
    "score": 1866,
    "title": "Restarting The 'Pirates of the Caribbean' Franchise is a Priority at Disney",
    "author": "AliceTheMagicQueen",
    "date": 1685936319.0,
    "url": "https://www.reddit.com/r/entertainment/comments/1410y79",
    "media_urls": [
        "https://thedisinsider.com/2023/06/04/restarting-the-pirates-of-the-caribbean-franchise-is-a-priority-at-disney/"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Honestly, the cast and characters of the first POTC trilogy just can’t be beat. I mean, besides the main characters, Davy Jones and his crew? Tia Dalma/Calypso? Hard to top these characters. The subsequent storylines and their introduced characters haven’t felt nearly as magical.",
            "score": 1144,
            "author": "agen_kolar",
            "replies": [
                {
                    "level": 1,
                    "comment": "The chemistry and storylines between Jack, Will and Elizabeth were the glue that kept the franchise together. Without Will and Elizabeth the movies lost their footing",
                    "score": 64,
                    "author": "MercilessShadow",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "The later movies are just basically Captain Jack Sparrow swinging on random ropes and fighting while the pirates theme is played. Those earlier movies had more substance to them. They could be silly, but the characters and their stories were handled well.",
                    "score": 481,
                    "author": "PoofLightsSexy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think this is what the last two movies lacked. The first 3 movies could be silly, but the characters were still semi-serious and clever. Jack Sparrow wasn't a bumbling idiot all the time in the first 3 films, and definitely not in the original movie. He was funny, but he was also clever, smart and had his own motivations. The last few movies haven't had that depth to the characters.",
                            "score": 103,
                            "author": "neverclaimsurv",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;I think this is what the last two movies lacked.\n\nThat and it's used up now. When the first pirates came out it felt like something entirely new and exciting. Now we get the same movie with a new coat of paint, with less effort and polish. Sometimes with a new name like lone ranger, but still the same. But even if  they released a new movie with excellent effort and polish it still wouldn't be as good as the first ones, because we already have them.",
                                    "score": 24,
                                    "author": "alucardou",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "What about other movies though like Batman or Spider-Man? You can make movies that are essentially the exact same concept with different actors &amp; stories and they can still be good. I think there's life left in the IP, it's just missing the right people to put it all together.",
                                            "score": 5,
                                            "author": "neverclaimsurv",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The difference is Johnny Depp. While he isn't necessarily the mc, he IS pirates of the Caribbean. But it's an amazing character that has gotten old now for me. Batman and Spiderman doesn't rely on that gimmick, but i have gotten quite tired of the superhero genre as well. Just not to the same degree as they don't rely on a gimmick like Jack",
                                                    "score": 15,
                                                    "author": "alucardou",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "They need to give the original cast their roses and let it rest in peace. Be smart like universal and Harry Potter. Don’t touch your golden goose. You can use the same universe and make a new tangent story, like fantastic beasts. But knowing Hollywood, they’re gonna do 5 more pirates and they’re just going to cameo depp and bloom to start a sequel about the “the next generation”. Sigh.",
                                                            "score": 4,
                                                            "author": "robsteezy"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "He wasn’t too much of a bumbling idiot in the fourth film as well.  In the fifth film, he was pretty depressed and down in the dumps.\n\nI mean…heroes have their off days, but it really dragged down that production for me.",
                                    "score": 5,
                                    "author": "InnocentTailor"
                                },
                                {
                                    "level": 3,
                                    "comment": "Kinda feels like they lost the “Drunken Master” influence and gained too much from the Marvel house as the anthology went on",
                                    "score": 3,
                                    "author": "wormholeforest"
                                },
                                {
                                    "level": 3,
                                    "comment": "What really saddens me is that they cut out the scene in which we learn how Jack became brandmarked as pirate. I think this would have really made him more likable or rather relatable.\nFunny but he has his principles",
                                    "score": 2,
                                    "author": "Daedalus0815"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "My problem is the storyline.  The first trilogy was about the story of Will Turner.  Jack Sparrow was an integral part of that story.  The new movies feel more unfocused?  They feel more like a stand alone rather than a trilogy.  They are still great and I'll watch the next one that comes out.",
                            "score": 55,
                            "author": "Low_Impact681",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Unfocused feels very accurate. Like they were just checking boxes when making these later movies.",
                                    "score": 33,
                                    "author": "PoofLightsSexy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Unfocused because they took a side character (Jack Sparrow) and made movies centered around him. It could have worked if they didn’t flanderize him so bad. They took his silliness and extrapolated it.",
                                            "score": 17,
                                            "author": "Arocken_",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "They took the delicious desert and made it the whole meal. Sparrow works best to accentuate a movie not be the center of it.",
                                                    "score": 13,
                                                    "author": "jl_theprofessor",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "A succulent Chinese meal",
                                                            "score": 8,
                                                            "author": "Deruji",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I see you know your judo well",
                                                                    "score": 2,
                                                                    "author": "Nateh8sYou"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "dessert",
                                                            "score": 3,
                                                            "author": "al3xth3gr8",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Dammit.",
                                                                    "score": 3,
                                                                    "author": "jl_theprofessor"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "just like the disney sw trilogy sadly, and most marvel stuff post endgame",
                                            "score": 7,
                                            "author": "Tyken12",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The gift and curse of earning bigger budget.",
                                                    "score": 2,
                                                    "author": "PoofLightsSexy"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Yep, original trilogy worked for a variety of reasons, a big part is that they were about Will and Elizabeth with Jack Sparrow as an agent of chaos in their story.\n\n4 &amp; 5 were about Jack’s story which….isn’t as enticing. Jack is a spice that makes the dish better. He shouldn’t be the main entree.",
                                    "score": 23,
                                    "author": "aw-un",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": " But you have heard of them",
                                            "score": 13,
                                            "author": "Velenah42",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I am a 4 apologist.  I think Angelica and Philip were compelling characters.\n\nIf I were making a new trilogy, I would include a daughter of Angelica and Jack, a half brother for that daughter, from Jack and someone else, and bring back Anamaria and Philip.\n\nI would structure it as a story where \n\nPart 1: Son of Jack, J. Sparrow (Russell Brand) finds out there is a way to bring his dead father back to life.  He thinks if he accomplishes this, he will be able to escape the shadow of his fathers clown legacy and be treated with respect and sincerity by the world.  (Kinda a reverse Kylo Ren.)  He sails to Barbary Coast to track down an Ifrit/Jinn (sort of a Dracula type villain, Winston Duke.)  Befriended by a helpful Anamaria (who seeks her own freedom from the Ifrit) they set off into Morocco.  In a pivotal final scene, when tempted with using the unlimited power to save his father, he instead falls to the dark side, defeats the Ifrit, and assumes his power and mantel as the leader/worshiped-god of his tribe.\n\nPart 2: Sort of a combination of Fury Road, Rat Race, and Count of Monte Cristo.  Daughter of Jack and Angelica (Diane Guerrero) race against other crews, one helmed by Anamaria (working now for J Sparrow) one helmed by Philip and Syrena, throw in a couple other racers like Ana de Armas and Sofia Barclay cuz they are hot right now.  They all know that J. Sparrow getting it first is the end of the world.  Daughter gets there first, big multi way battle as they chase after her, something something.  Her getting the artifact puts her directly in J Sparrow's crosshairs.\n\nPart 3: each with an artifact (ring, bracelet etc) brother and sister need to outsmart each other to combine the two powers to acomplish either (saving father from death, saving brother from the dark side, can only have one)",
                                            "score": 2,
                                            "author": "entertainman",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The worst part of the newer ones is that Sparrow has gone from a cool suave pirate saying cool shit to just.....a drunken parody of itself? Like, unfunny quips and falling down",
                            "score": 7,
                            "author": "Offtherailspcast",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's weird, but I rewatched the first movie recently, and I was surprised by how skilled and smooth Jack Sparrow was. From his introduction to his first fight with Will Turner, it felt like he always had the situation under control.",
                                    "score": 3,
                                    "author": "DropThatTopHat"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yup that being said I’ll still pay money to see jack sparrowing his way across a screen.",
                            "score": 6,
                            "author": "IAALdope"
                        },
                        {
                            "level": 2,
                            "comment": "The first three films are an absolute treasure. The rest I can do without. The entire cast is captivating, from main characters, to ensemble. To just funny duos. And as a huge fan of the ride for the sensory details. I truly appreciate the magic and creativity behind developing that game into such a fun and beloved trilogy\n\nAgain I stress trilogy because yikes those last films were rough",
                            "score": 5,
                            "author": "OkBid1535"
                        },
                        {
                            "level": 2,
                            "comment": "It was good because it was original? Same with Indiana Jones and every goddam franchise.",
                            "score": 48,
                            "author": "NVDA-Calls",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No, it was good because it was originally diluted. \n\nOriginal POTC wasn’t about Jack Sparrow, it was about Elizabeth and Will. Jack Sparrow was a supporting character, and even when he started to take up more screen time there was enough going on with the *real* story that it was tolerable, if not beneficial. His presence provided levity and enhanced scenes, but that’s because the scenes and storyline didn’t rely on him as a character, he was the sprinkles, not the ice cream. \n\nOnce it became all Jack Sparrow all the time and the original storyline was gone, the quality really dived. Jack Sparrow is not a full enough character to base a movie on. He’s static- he doesn’t change, he doesn’t have an arc, he doesn’t learn lessons, it’s just Jack Sparrow wiggling his hands around and “acting” drunk. Let’s be honest, he’s a boring character when you get down to it.",
                                    "score": 168,
                                    "author": "BewBewsBoutique",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The fun was watching him fumble his way through each encounter or problem. It lost its charm once they leaned heavily in to that as his \"character\"",
                                            "score": 17,
                                            "author": "with_a_dash_of_salt"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "That was very insightful.",
                                            "score": 14,
                                            "author": "Guvnor513"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The plot made no sense in the 2nd and 3rd",
                            "score": 17,
                            "author": "Practical-Jelly-5320",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Maybe, but they were still better than 4 &amp; 5.",
                                    "score": 19,
                                    "author": "PoofLightsSexy",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "The original film was supposed to be an Orlando Bloom vehicle. Will Turner discovers his past and slowly becomes a swashbuckling anti hero Pirate. Add a pinch of star crossed lovers in the form of romantic interest Kiera Knightley and you had the recipe for a fun summer blockbuster and the begining of a trilogy.\n\n&amp;#x200B;\n\nHowever Johnny Depp stole the show once he came on screen as |Jack Sparrow. The movie wasnt about him but he was so much more interesting. He was funny, erratic, sarcastic and  morally ambiguous. He wasnt a hero or an anti hero he was the fool mocking both sides and taking the prize. \n\n&amp;#x200B;\n\nUnfortunately Disney seeing Jack Sparrows growing popularity decided to focus more on his character. Eventuall he became the protagonist which ruined the original fun of the character.",
                                    "score": 17,
                                    "author": "Dyskord01"
                                },
                                {
                                    "level": 3,
                                    "comment": "Especially in the third. “Why is there now a giant lady on the ship, what the hell is she saying, oh now she’s a bunch of crabs”",
                                    "score": 9,
                                    "author": "garyflopper",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I kinda admire the third film’s batshit insanity.  After the crab lady came a broadside fight in a maelstrom.  Disney even built the two ships and had them rocking during a stimulated rain storm.",
                                            "score": 2,
                                            "author": "InnocentTailor"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Lmaoo i cannot for the life of me even remember the stories of the later movies. I can remember jack sparrow running around and swinging to epic music tho.",
                            "score": 2,
                            "author": "joogiee"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Watch them get Timothee Chalamet to play a young Jack Sparrow. 😆",
                    "score": 213,
                    "author": "Wicked-Death",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Why did you have to put that out there, because that’s 100% what they’re going to do",
                            "score": 138,
                            "author": "moka_soldier",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If they do that I hope they get tom Holland to play Barbosa just to see how angry people get.",
                                    "score": 37,
                                    "author": "sisk91"
                                },
                                {
                                    "level": 3,
                                    "comment": "And I will 100% go watch it because that actually sounds good…",
                                    "score": 7,
                                    "author": "KEE_Wii"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Curse of The Italian Shoe",
                            "score": 14,
                            "author": "TonyDungyHatesOP",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yo-Ho-Ho and a bottle of Peach Melange!",
                                    "score": 11,
                                    "author": "Hunk-a-Cheese"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Disney execs: Write that down, write that down!",
                            "score": 6,
                            "author": "JakeArewood"
                        },
                        {
                            "level": 2,
                            "comment": "To be completely fair there were a series of books about the adventures of a young Jack Sparrow, with entirely different characters, that weren't actually half bad. Then again I read them ages ago.",
                            "score": 4,
                            "author": "ElMatasiete7",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Prequel movie about Jack saving the ship of 100 slaves by making a deal with Davy Jones sounds like a solid place to go for a prequel",
                                    "score": 2,
                                    "author": "aw-un"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Chalamet is the perfect genderless twink for Hollywood. He fits so many check boxes. \n\nHe can literally seem like a female on screen or a macho male. It’s wild",
                            "score": 3,
                            "author": "heybrehhhh"
                        },
                        {
                            "level": 2,
                            "comment": "This was my first thought as well. It's likely a minority opinion but I find that dude to be entirely charisma-less. How you gonna make a Jack Sparrow movie like that?",
                            "score": 3,
                            "author": "AcceptableSleep5002"
                        },
                        {
                            "level": 2,
                            "comment": "Directed by Wes Anderson",
                            "score": 9,
                            "author": "Think_Selection9571",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Of course not, directed by Taika Waititi",
                                    "score": 13,
                                    "author": "mythologue",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "I never watched the original set, but if Wes directed, I’m all in to watch.",
                                    "score": 2,
                                    "author": "LameJazzHands"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "And it’s a shame too, because when you start adding legendary pirates like Salazar and Blackbeard you have some really good and crazy history to build from. Someone like Blackbeard should not be part of some forgettable 5th sequel. Blackbeard should be equal to what they did with Davy Jones, a well-rounded and memorable character/villain.",
                    "score": 17,
                    "author": "CardinalCreepia"
                },
                {
                    "level": 1,
                    "comment": "I loved Kaya Scodelario in the last POTC movie.",
                    "score": 17,
                    "author": "Successful-Gene2572"
                },
                {
                    "level": 1,
                    "comment": "Keira Knightley and Orlando Bloom could have been replaced by a half dozen actors without issue.\n\nDepp, Rush, Nye all irreplaceable",
                    "score": 17,
                    "author": "Aestheticpash",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You’re not necessarily wrong, but that doesn’t make them bad or forgettable. They were still well written and performed.",
                            "score": 11,
                            "author": "CardinalCreepia"
                        },
                        {
                            "level": 2,
                            "comment": "I think those roles were, for lack of a better term, bland because those were the two characters with whom the audience was meant to identify.",
                            "score": 7,
                            "author": "Guvnor513",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "People forget that lead characters, by far and large, are bland. It’s the side characters that are really interesting and color the movie, but once you focus on the more interesting character, everything kind of goes off the rails. Look no further than this very franchise. The movies got worse the more they focused on Jack\n\n*note: bland does not mean poorly written.",
                                    "score": 5,
                                    "author": "aw-un"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Make a rated r pirate movie… argh",
            "score": 418,
            "author": "Dpsizzle555",
            "replies": [
                {
                    "level": 1,
                    "comment": "Did you mean ARGH rated ?",
                    "score": 188,
                    "author": "kmt112",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "...I see what you did there 😏",
                            "score": 9,
                            "author": "ike_tyson",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I “sea” also.",
                                    "score": 8,
                                    "author": "classless_classic",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Fruit prevents scurvy",
                                            "score": 3,
                                            "author": "Ok-Yogurtcloset5429"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "There are two different movie franchises called \"Pirates\", and one of them is for you!",
                    "score": 12,
                    "author": "Speideronreddit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Is it good like Black Sails?",
                            "score": 4,
                            "author": "Dpsizzle555",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Pirates and Pirates 2: Stagnetti’s Revenge or more fantastical and a bit of a different kind of adult than Black Sails, but any pirate movie completionist should check them out",
                                    "score": 9,
                                    "author": "CurseofLono88"
                                },
                                {
                                    "level": 3,
                                    "comment": "Oh, my sweet summer child…",
                                    "score": 2,
                                    "author": "bfhurricane"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'm good with Black Sails.",
                    "score": 18,
                    "author": "porscheblack",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was totally going to write “you just want Black Sails”.",
                            "score": 6,
                            "author": "whenthefirescame"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You know, I’ve got just the porn parody for you",
                    "score": 25,
                    "author": "BlerghTheBlergh"
                },
                {
                    "level": 1,
                    "comment": "Check out \"Pirates 2: Stagnettis revenge\"",
                    "score": 10,
                    "author": "kaazir"
                },
                {
                    "level": 1,
                    "comment": "It just 90 minutes of Jack, lifting the patch and fucking some pirate's eye-socket.",
                    "score": 22,
                    "author": "Squirrel_Master82",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And after Jack can just stand around and go like this\n\n![gif](giphy|85Q7aV4R5bxDO)",
                            "score": 26,
                            "author": "Silent-Boy2"
                        },
                        {
                            "level": 2,
                            "comment": "A Caribbean Film",
                            "score": 13,
                            "author": "The_Wrong_Band"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sean Bailey, the president of Walt Disney Studios Motion Picture Production, recently spoke with the New York Times to talk about Disney’s live-action projects and one of those projects was Pirates of the Caribbean.\n\nBailey says restarting the Pirates franchise is a priority at Disney. “We think we have a really good, exciting story that honors the films that have come before but also has something new to say.”\n\nFor those unaware, Disney is actually developing multiple Pirates projects and we highlight each project and share everything we know so far. So let’s set sail and get into the nitty-gritty.\n\nPirates Project #1\n\nBack in 2018, it was reported that Deadpool and Zombieland 2: Double Tap writers Paul Wernick and Rhett Reese, were brought on to write Pirates 6, but would drop out months later and were replaced by Chernobyl and The Last of Us creator Craig Mazin and Pirates alum Ted Elliot. While there have been no story details or massive updates on this project, it is still the main Pirates project Disney is actively working on. That said, in 2019, we exclusively reported that Guardians of the Galaxy star Karen Gillan was someone Disney was looking at to star. This project will exist in the previous Pirates of the Caribbean movies continuity, so a return from stars Orlando Bloom, Kiera Knightley, Brenton Thwaites, and Kaya Scodelario is definitely on the table.\n\nPirates Project #2\n\nIn 2020, a report surfaced that Harley Quinn herself Margot Robbie would star in a female-led reboot from Bumblebee writer Christina Hodson. This project is not intended to be a spinoff, but a new story, with new characters set in the Pirates universe. Despite rumors last year that this project was axed, franchise producer Jerry Bruckheimer dispelled that, saying “I think that that script will come forward at a certain point. We developed two different stories for Pirates and the other one’s going forward first, so that’s what we’re working on, to try to get that one made.” The story Bruckheimer is referring to would be the first project we talked about. We had heard when this project was in active development Disney was looking at some pretty big-name actors to star alongside Robbie, names we heard included Jason Momoa, Richard Madden, and Sebastian Stan.\n\nPirates Project #3\n\nA fun piece of information we shared on The DisInsider Show during our “Rumor of the Week” segment, is that Disney has put a Pirates of the Caribbean Disney+ on the drawing board and are in very early development stages. At this time, I don’t have any further information on this project as it is still in the early stages.\n\nThe Elephant in the Room\n\nIt’s what everyone wants to know, is Johnny Depp returning to the franchise as Captain Jack Sparrow? A role that garned him an Oscar nomination for his work in Curse of the Black Pearl. Despite rumors last year that the actor had actually closed a deal to appear in a sixth movie and that he was also planning to help co-write the film, after his very public defamation trial against Amber Heard last year, the actor made it very clear that he would never forgive Disney for the way they publicly distanced themselves from him. Some insiders believe he will return. Bruckheimer told Deadline earlier this year that he would still reach out to Depp because Johnny was both his friend and “an amazing artist.” Acknowledging that enough time has passed between him, Disney, and Depp, he explained his reasoning by saying, “You go through things in life that you wish you hadn’t done right.” Bailey was asked about Depp once again and said “Noncommittal at this point,” which is an inkling that a return is very possible.",
            "score": 105,
            "author": "AliceTheMagicQueen",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sounds like they are taking a page from Star Wars where everything gets a backstory or side mission.",
                    "score": 47,
                    "author": "Substantial_Sun_8477",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Please god no.",
                            "score": 8,
                            "author": "El--Borto",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Lol, I can guarantee that left to their own devices Disney will f-up this franchise as well. It's their been market of late. They've got serious currency in it. I honestly wouldn't want JD in it. Disney's a bloody mess atm, and this sounds like a bunch of desperate execs looking at their catalogue and searching for a hit.",
                    "score": 54,
                    "author": "strangealienworld",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "JD is the face of the franchise it’s gonna flop without him",
                            "score": 8,
                            "author": "The_local_man1"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I was at Disneyland 2 weeks ago and talked to a few off work cast members. I had not heard that there was going to be any additional pirate movies but one of them mentioned they were so excited Depp was going to revise Captain Jack. I didn’t necessarily believe it…but this is really interesting that they are going to make more of the movies.",
                    "score": 2,
                    "author": "Nodramallama18"
                }
            ]
        },
        {
            "level": 0,
            "comment": "dear god just make something original PLEASE",
            "score": 265,
            "author": "HeWhoHasSeenFootage",
            "replies": [
                {
                    "level": 1,
                    "comment": "Right? This is so stupid. The first pirates was a work of art, it was the perfect summer blockbuster, the subsequent movies were not my favorites but I know some people loved them. Just leave it alone, stop rebooting stuff period, but especially stuff that isn’t that old.",
                    "score": 62,
                    "author": "trulymadlybigly",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You have a really solid and well made trilogy that they should have stopped at. They then made forgettable ones with far less heart.",
                            "score": 28,
                            "author": "CardinalCreepia",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "In fairness, before the first movie came out and received a positive reaction from audiences &amp; critics, everyone was saying it was creatively bankrupt and mercenary for Disney to mine theme park rides for IP.",
                            "score": 9,
                            "author": "OIlberger",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Wait till you see the Ewok pirates!",
                    "score": 5,
                    "author": "Bostonterrierpug"
                },
                {
                    "level": 1,
                    "comment": "Disney has killed so much great IP.  Once they get ahold of something, they get rid of any edginess, water it down by releasing too many half baked projects, then act shocked when people stop watching.",
                    "score": 2,
                    "author": "Novelsound"
                }
            ]
        },
        {
            "level": 0,
            "comment": "How about a different pirate thing... could do Sea of Thieves movie or something",
            "score": 86,
            "author": "leonidganzha",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s not the Disney way. What do you think that new ideas just grow on trees?! They must recycle and remake all of their successful projects! All of these stupid live-action remakes and now they’re recycling the same damn ideas of everything. \n\nOriginality and innovation aren’t Disneys top priorities anymore.",
                    "score": 36,
                    "author": "JRansomBioDermKiller",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Brand recognition and everyone would just compare it to pirates of the Caribbean anyways.",
                    "score": 5,
                    "author": "eagleblue44",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Pretty much.  Age of Sail stuff these days get compared immediately to PoTC.\n\nHeck!  That is what killed momentum for a *Master and Commander: The Far Side of the World* sequel.",
                            "score": 2,
                            "author": "InnocentTailor"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "![gif](giphy|nXEbFijsWaGQM)",
            "score": 34,
            "author": "Crunchyfrozenoj"
        },
        {
            "level": 0,
            "comment": "It was fun, but it’s done. Pick another ride. Turn Space Mountain into a multi-picture epic about the future gold rush to colonize the moon and Mars and beyond. \n\nAh shit, The Expanse already exists …",
            "score": 54,
            "author": "Irrelevantitis",
            "replies": [
                {
                    "level": 1,
                    "comment": "Actually having space mountain be an unabashed “Western… IN SPACE!” Complete with a retro futuristic style would be wonderful to me",
                    "score": 8,
                    "author": "flyingace1234"
                },
                {
                    "level": 1,
                    "comment": "Disney should back the production of the last three books. They would get MY money on that one. On the other hand, they would also find a way to eff it up. The ring builders would be equated to the British, and the ring entities would be \"fighting against exploitation\".",
                    "score": 2,
                    "author": "Vesuvius5"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Please just kill it already. Let it die. I’m so sick of everything being remade or remastered or live actioned or whatever the fuck else.",
            "score": 44,
            "author": "SpicyLizards",
            "replies": []
        },
        {
            "level": 0,
            "comment": "No, let it go, please",
            "score": 136,
            "author": "scullyharp",
            "replies": [
                {
                    "level": 1,
                    "comment": "Monkeys Paw Curls\n\nDisney announces live action Frozen remake",
                    "score": 37,
                    "author": "TaylorMonkey",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Zendaya already cast as Elsa.",
                            "score": 28,
                            "author": "EMaylic",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Danny DeVito as Anna.",
                                    "score": 9,
                                    "author": "Bitey_the_Squirrel",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I would watch that",
                                            "score": 3,
                                            "author": "roxxtor",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This. Just make a new IP for fucks sake.",
                    "score": 41,
                    "author": "Insanity_Crab",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "In fairness, Disney has been coming out with some new IP too. Some of it is great, some of it flops badly.",
                            "score": 2,
                            "author": "BoringWozniak"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "How about a movie series about the actual pirates of the 17th and 18th centuries?",
            "score": 9,
            "author": "pbmcc88",
            "replies": [
                {
                    "level": 1,
                    "comment": "happy cake day!",
                    "score": 2,
                    "author": "Bf4Sniper40X",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "![gif](giphy|NSqQkXJjnsVpZQezfg)",
            "score": 6,
            "author": "endgame-colossus"
        },
        {
            "level": 0,
            "comment": "Disney exec 1: what franchise haven't we ruined yet!\n\nDisney exec 2: pirates of the Caribbean is well loved!\n\nDisney exec 1: I'm on it!",
            "score": 6,
            "author": "thewindburner",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I think pirates could work as a sort of anthology focused on different pirates but they'd need a strong script to prove it has sea legs without Jack steering the ship.\n\nPlus I feel like pirates as a genre isn't something that has been a big thing for a while and pirates are cool so I want more!",
            "score": 15,
            "author": "AquaGlowstick"
        },
        {
            "level": 0,
            "comment": "If we flog the dead horse hard enough, maybe it’ll come back to life",
            "score": 21,
            "author": "BoringWozniak",
            "replies": [
                {
                    "level": 1,
                    "comment": "The horse took the aztec gold",
                    "score": 3,
                    "author": "yaboinigel"
                },
                {
                    "level": 1,
                    "comment": "This worked for Fast &amp; Furious and Transformers",
                    "score": 2,
                    "author": "AliceTheMagicQueen",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Meh. The first one was cool but they kinda jumped the shark as they went on to the point I completely lost interest\n\nI don't think id want them to resemble much of what they'd already done, but I do like boats and sabers and cannons and stuff \n\nSo, if they make a neat swashbuckling adventure with a reason to see it that isn't 100% predicated on nostalgia for content I'm already ambivalent towards, hooray I guess",
            "score": 59,
            "author": "Embarrassed-Essay821",
            "replies": [
                {
                    "level": 1,
                    "comment": "I like they idea of a wholly original story set in the established universe, it seems like a waste to throw away all the background story that had been setup unless there is a specific reason to wipe the slate clean. If they want to reboot/restart and end up recasting a new Davy Jones or Blackbeard, what's the point, all that will do is draw conclusions to the previous films. Instead they can have stories that predate the originals or occur adjacent to already existing stories, which allows for tiny cameos from previous cast, I can easily picture a young Governor Swan in a brief exchange with one of the new main characters, or even a young Pintel and Ragetti in the background of a bar scene",
                    "score": 3,
                    "author": "thecheesefinder",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is why I hate people comparing something like this to the Disney remakes.\n\nBy all means, they should leave the originals untouched. They’re great. But this can definitely be similar to a Star Wars kind of world if they wanted it to. They’ve created this fun, cinematically unique world with a lot of interesting lore. They can totally have new stories with new characters in the world and have it feel fresh. They just need a great director and solid writing team. Perhaps the team that made the original (and let them make the movie with minimal studio interference). Bring back Verbinski. Or Gareth Edwards would also be a solid pick I think. I truly think this franchise can survive without Depp.",
                            "score": 2,
                            "author": "aw-un"
                        },
                        {
                            "level": 2,
                            "comment": "The world is definitely rich enough for new stories.  As you said, doing an original tale in the fantastic PoTC setting would be nice - recasting and rebooting what has come before like Davy Jones would be lame, wasteful and unwelcome.",
                            "score": 2,
                            "author": "InnocentTailor"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "“We’ll stop beating this dead horse when it stops spitting out money”\n\n- Bo Burnham",
            "score": 4,
            "author": "ReptilianOver1ord"
        },
        {
            "level": 0,
            "comment": "They’re running out of IPs",
            "score": 3,
            "author": "RevalHamada"
        },
        {
            "level": 0,
            "comment": "I'm 27 and feel like every movie series I grew up with is eventually going to get rebooted to hell until it's milked for every last cent and all its magic is destroyed. It's kind of annoying actually",
            "score": 22,
            "author": "Entire_Training_3704",
            "replies": [
                {
                    "level": 1,
                    "comment": "Welcome to adulthood where your childhood goes to die.",
                    "score": 17,
                    "author": "ike_tyson"
                },
                {
                    "level": 1,
                    "comment": "Most movies series you grew up on, were probably already reboots. I’m in my 30’s and am discovering many of my favorites were remakes from the 60’s that were remakes from the 30’s and 40’s. \n\nI am starting to think there is really only like 10 stories in the entire history of the human race.",
                    "score": 10,
                    "author": "Egad86"
                },
                {
                    "level": 1,
                    "comment": "They were made to make money back then, they're made to make money now, nothing has changed",
                    "score": 5,
                    "author": "CleanAspect6466"
                },
                {
                    "level": 1,
                    "comment": "Same here.   \n\n\nI think it's one of two things, possibly both combined. Either they are running out of fresh ideas that are actually guaranteed to work, or they are banking on nostalgia as being a key to success.  Thus, reboots, remakes, and \"basically something completely different, but with the same cast and/or characters\" are becoming more common.",
                    "score": 2,
                    "author": "Weird_Ad1170"
                }
            ]
        },
        {
            "level": 0,
            "comment": "FFS.\nAt least let us that saw it originally get dementia first!",
            "score": 8,
            "author": "Cpl_Hicks76"
        },
        {
            "level": 0,
            "comment": "It’s hard to make a better one than the original. They should do something else",
            "score": 3,
            "author": "testedonsheep"
        },
        {
            "level": 0,
            "comment": "Don’t care. You’ll never beat the first 3",
            "score": 3,
            "author": "0penedB00K"
        },
        {
            "level": 0,
            "comment": "No. Disney going back to creating original and new content should be the priority. \n\nNot continuously butchering Star Wars, oversaturating the MCU and making live action adaptations of the old classics, but with absolutely no heart behind them.",
            "score": 3,
            "author": "PM_ME_YOUR_SOULZ"
        },
        {
            "level": 0,
            "comment": "How about making \"coming up with a new and original IP\" their top priority...I loved pirates of the Caribbean, and whenever I want to watch it I can. So can anyone else. What would be the point of restarting the franchise?",
            "score": 3,
            "author": "crankycrassus"
        },
        {
            "level": 0,
            "comment": "They'll never be able to recapture the magic of that first movie",
            "score": 3,
            "author": "OuttatimepartIII",
            "replies": [
                {
                    "level": 1,
                    "comment": "I watch the first movie till this day! And it was the best one!",
                    "score": 2,
                    "author": "Kane-Aloha",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Same! It's easy to forget how special that movie was. It really gave me hope for cinema in the 21st century. To this day I have yet to see a better character introduction than Jack Sparrow in that movie.",
                            "score": 2,
                            "author": "OuttatimepartIII"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Leave it alone. Use all that money and think of something new.",
            "score": 3,
            "author": "Srigus"
        },
        {
            "level": 0,
            "comment": "Disney, once again, not learning that remaking old IP isn’t the move",
            "score": 3,
            "author": "michael_am"
        },
        {
            "level": 0,
            "comment": "I just rewatched these films to introduce them to my daughter. I literally do not think you can make these films without Johnny Depp. Maybe, if they'd put him in a secondary role in the 4th or 5th movie, but now? Nah. I just can't see it working.",
            "score": 3,
            "author": "ronearc",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I like the idea, but it needs to be done well.",
            "score": 3,
            "author": "live2travel4life"
        },
        {
            "level": 0,
            "comment": " It wont work without Johnny Depp. Thats just the reality for Disney.",
            "score": 3,
            "author": "Yummie23"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 57,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Saw him play with the Hollywood vampires. Was excellent. I would not count him out yet",
                    "score": 7,
                    "author": "joystick355"
                },
                {
                    "level": 1,
                    "comment": "You are just getting your information about the French film from tabloid gossip rags. Depp and the director/star walked hand in hand on the Cannes red carpet, and were all over each other. And half of Hollywood have massive substance abuse issues. They would absolutely have him back if he was willing to return. They'd make a shitload of money.",
                    "score": 6,
                    "author": "TheKingOfSting93",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Meh, that’s just for appearances. And I doubt he would bring in a lot of money. Dude is despicable.",
                            "score": 3,
                            "author": "SummerEmCat",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Disney are not serious people",
            "score": 6,
            "author": "Deepforbiddenlake",
            "replies": [
                {
                    "level": 1,
                    "comment": "If it is to be said, so it be, so it is.",
                    "score": 2,
                    "author": "aflockofcrows"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Disney out here killing franchises like there's no tomorrow. \n\nStar Wars? Dead.\n\nIndiana Jones? Stone cold dead.\n\nPotC? The guillotine is getting rolled out as we speak.",
            "score": 6,
            "author": "Overwatch_Joker",
            "replies": [
                {
                    "level": 1,
                    "comment": "Add National Treasure? Dead.",
                    "score": 2,
                    "author": "pierrrecherrry"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Please no. The last 4 were pretty bad.",
            "score": 10,
            "author": "Cuppajoe96"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 11,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "😂😂😂 This was a millennial trend. Let it die already. Depp is a washed up alcoholic piece of crap",
            "score": 5,
            "author": "Cursedcakes666"
        },
        {
            "level": 0,
            "comment": "Another bland creation without soul.",
            "score": 9,
            "author": "puducito"
        },
        {
            "level": 0,
            "comment": "Everyone in here hating on the movies. I rewatch them all the time I thought they were all great. Obviously the first one is the best but I love the entire series I’d love to see more :/",
            "score": 5,
            "author": "Budget-Way-3034",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I mean Johnny Depp isn’t getting any younger.",
            "score": 6,
            "author": "Zhukov-74",
            "replies": [
                {
                    "level": 1,
                    "comment": "Or more well behaved with crew",
                    "score": 12,
                    "author": "PaceTheRoom"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Well. No point in developing something new. Yawn. The movies were fun. They are also passé. Put them in a vault and rerelease them.",
            "score": 2,
            "author": "whyreadthis2035"
        },
        {
            "level": 0,
            "comment": "I never thought Disney could run out of ideas but I guess not.",
            "score": 2,
            "author": "bn351"
        },
        {
            "level": 0,
            "comment": "Then give us Treasure Planet 2 Disney!",
            "score": 2,
            "author": "colonelbc19"
        },
        {
            "level": 0,
            "comment": "Why create something new when you can recycle? 😉👍",
            "score": 2,
            "author": "Clydus1"
        },
        {
            "level": 0,
            "comment": ".....there's a south park episode with Lucas and Spielberg that explains my thoughts on the situation that is disney.",
            "score": 2,
            "author": "Arcadius274"
        },
        {
            "level": 0,
            "comment": "Why restart? Just take another rando, and hop on the see, a spinoff. But please no more cursed hald-dead baddies.",
            "score": 2,
            "author": "emkay_graphic"
        },
        {
            "level": 0,
            "comment": "Unless they actually continue with the loose ends set up in films 4 and 5 I wouldn't really care. Jack in Film 5 was so unlike Jack from Films 1-4 that it ruined the film for me. Not to mention the dumb retcon with the Compass. It feels like the people who worked on 5 never watched the other films. \n\nI would like to see some of the continuity fixed. Like maybe Penelope Cruz' character used the Voodoo doll to make Jack so un-Jack like in Film 5 that explains his weird different attitude and personality and stupidity. \n\nObviously have Davy Jones come back with Calypso and Will and Elizabeth and the kids. Re-explain how Jack got the compass from his dead captain and Calypso better. \n\nEnd the film in such a way that ends everything from the previous 5 films and sets it up for future movies with newer characters.",
            "score": 2,
            "author": "TaskMister2000"
        },
        {
            "level": 0,
            "comment": "Make them like the FIRST movie and they will be great,  they got worse and worse as time went on",
            "score": 2,
            "author": "CyberRaver39"
        },
        {
            "level": 0,
            "comment": "Sure, because Marvel and Star Wars aren’t generating enough revenue 😂",
            "score": 2,
            "author": "No-Exit6560"
        },
        {
            "level": 0,
            "comment": "No Depp no point to another movie",
            "score": 2,
            "author": "Andyrew1_2"
        },
        {
            "level": 0,
            "comment": "It ain’t pirates of the Caribbean WITHOUT Johnny Depp Disney, please know that!",
            "score": 2,
            "author": "Kane-Aloha"
        },
        {
            "level": 0,
            "comment": "WellX everything says this is Disney’s most financially successful live-action franchise and one of their most iconic, but doing it without Depp won’t be memorable. But they better keep the iconic theme.",
            "score": 2,
            "author": "HM9719"
        },
        {
            "level": 0,
            "comment": "![gif](giphy|Jev4iU72S9RYc)",
            "score": 2,
            "author": "zztop610"
        },
        {
            "level": 0,
            "comment": "I think I getting the pattern. 1. Work at these big entertainment. 2. write up something original with already new characters and story. 3. The head of the company denies doing such film cause of 'wasted money' bs excuse. 4. Company take original idea to reboot a classic film to milk more money out of it. \n\nPretty much how they do with little Mermaid they changed some stuff to sound like it could've been another film.",
            "score": 2,
            "author": "CuriousHeffa"
        },
        {
            "level": 0,
            "comment": "Ngl, I lowkey liked the new characters in the last movie. They filled the orlando bloom/kiera knightly roles pretty well. Decent supporting cast.\n\nThe thing that will be hard to replicate is the jack sparrow magic. Not sure if that’s been tapped out.",
            "score": 2,
            "author": "New_Needleworker6506"
        },
        {
            "level": 0,
            "comment": "Just rewatched the original a few days ago, that movie is fantastic.",
            "score": 2,
            "author": "Diomedes413"
        },
        {
            "level": 0,
            "comment": "I remember seeing the first trailer before the first one came out. I had no idea it would become so iconic",
            "score": 2,
            "author": "Bright_Ad_113"
        },
        {
            "level": 0,
            "comment": "The reboot will tank. The original only caught on because of Depp's performance.",
            "score": 2,
            "author": "SerialVandal"
        },
        {
            "level": 0,
            "comment": "You need a new trilogy but it must contain Depp or it’s dead in the water. However they likely won’t get Depp at this point.\n\nAlso get Hans Zimmer or it will still stink.",
            "score": 2,
            "author": "richman678"
        },
        {
            "level": 0,
            "comment": "Good luck getting lightening to strike twice. Orlando Bloom, Kiera Knightly and Johnny Depp complimented each-other so we’ll in the original series.",
            "score": 2,
            "author": "ollienorth19"
        },
        {
            "level": 0,
            "comment": "No Johnny Depp, idgaf",
            "score": 2,
            "author": "AVeryGayButterfly"
        },
        {
            "level": 0,
            "comment": "Nah no Depp No watch",
            "score": 2,
            "author": "BBALLISLIFE34"
        },
        {
            "level": 0,
            "comment": "I’m so tired of remakes and reboots, please please please just make some original content.",
            "score": 2,
            "author": "fakenews1999"
        },
        {
            "level": 0,
            "comment": "It probably would do okay at the box office but without Johnny, I do see a lot of people not really caring about it.",
            "score": 2,
            "author": "Mrsandman1118"
        },
        {
            "level": 0,
            "comment": "If Johnny Depp is out, then no point in really continuing with the series they have/had.  Those will always live on, as they are incredible films.  Now I kinda want to watch them again.",
            "score": 2,
            "author": "MrNothingmann"
        },
        {
            "level": 0,
            "comment": "Not watching it without Johnny Depp.",
            "score": 2,
            "author": "Memewalker"
        },
        {
            "level": 0,
            "comment": "I hoped they’d pick up from Dead Men’s post credits. At this point they can easily introduce a new protagonist. Barbosa had a child and so can Sparrow. The series can grow beyond Depp",
            "score": 2,
            "author": "Quirky-Pie9661"
        },
        {
            "level": 0,
            "comment": "They should be focusing on rebooting Tron or Tomorrowland.",
            "score": 2,
            "author": "LordOdin99"
        },
        {
            "level": 0,
            "comment": "Sounds petty, but I’m not interested without Johnny Depp as Jack Sparrow.",
            "score": 2,
            "author": "MrZombikilla"
        },
        {
            "level": 0,
            "comment": "Yeah how about something original? Like guardian's of the Galaxy did awesome why not try Alpha flight the Canada defenders",
            "score": 2,
            "author": "chihuahuaOP"
        },
        {
            "level": 0,
            "comment": "If they want to do new Pirates movie, just remake Treasure Planet.",
            "score": 2,
            "author": "SpiderScooby"
        },
        {
            "level": 0,
            "comment": "Replace Depp with Jack Black.",
            "score": 10,
            "author": "FeralPsychopath",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Well, Jawny can’t show up at the set unless he’s late, drunk, high and can’t remember his lines and have to fed him his through an ear piece. Good luck with that",
            "score": 5,
            "author": "WhiteHotForver"
        },
        {
            "level": 0,
            "comment": "How? Without Johnny Depp that's just going to be a waste of money.",
            "score": 5,
            "author": "Giantwalrus_82",
            "replies": [
                {
                    "level": 1,
                    "comment": "With Johnny Depp the last few were a waste of money too though. \n\nMaybe they should drop the franchise and (wild idea) make some more original content.",
                    "score": 2,
                    "author": "tittyswan"
                }
            ]
        },
        {
            "level": 0,
            "comment": "...go young, recast and make David Jones the protagonist...I don't know",
            "score": 4,
            "author": "lazyness92",
            "replies": []
        },
        {
            "level": 0,
            "comment": "How about a “Master &amp; Cdr” trilogy, Disney??",
            "score": 3,
            "author": "brucescott240"
        },
        {
            "level": 0,
            "comment": "FTFY: Suffocating creativity and placing the safest bets that won't work out anyway is a Priority at Disney",
            "score": 3,
            "author": "ChuckChuckChuck_"
        },
        {
            "level": 0,
            "comment": "Ugh.  Jesus Christ.  Haven't we already been subjected to enough of those horrible, horrible movies?",
            "score": 3,
            "author": "ABoyNamedSault"
        },
        {
            "level": 0,
            "comment": "Maybe get ur other shit in order first?",
            "score": 3,
            "author": "ifureadthisstfu"
        },
        {
            "level": 0,
            "comment": "OMG please don’t",
            "score": 2,
            "author": "D0nCoyote"
        },
        {
            "level": 0,
            "comment": "Go back and rejig. The Guybrush Threepwood Story",
            "score": 2,
            "author": "miletest"
        },
        {
            "level": 0,
            "comment": "It's been diminishing returns since the first one.  Why do they have to drive everything to the ground until it's ruined?",
            "score": 2,
            "author": "mitchkramer"
        },
        {
            "level": 0,
            "comment": "They really need to go with something new and let the old crap die.",
            "score": 2,
            "author": "omnichronos"
        },
        {
            "level": 0,
            "comment": "Let it die, let it die, let it die",
            "score": 2,
            "author": "Ok_Parsnip_3192"
        },
        {
            "level": 0,
            "comment": "Disney is never gonna get it are they?",
            "score": 2,
            "author": "AloneCan9661"
        },
        {
            "level": 0,
            "comment": "Wow shocker, Disney unable to generate new creative content and decides to revive yet another franchise to suck more money out of it",
            "score": 2,
            "author": "darthnyan39"
        },
        {
            "level": 0,
            "comment": "Who is making these pitches and decisions at Disney. No one is going to that.",
            "score": 2,
            "author": "dontforgetthef"
        },
        {
            "level": 0,
            "comment": "I don't know why people think a pirates movie without Depp would be profitable.",
            "score": 2,
            "author": "ThunkAsDrinklePeep",
            "replies": []
        }
    ]
}