{
    "id": "142k3y9",
    "score": 937,
    "title": "'The Crowded Room' Actress Emmy Rossum Defends Playing Tom Holland's Mom While Being Just 10 Years Older Than Him",
    "author": "Neo2199",
    "date": 1686066323.0,
    "url": "https://www.reddit.com/r/entertainment/comments/142k3y9",
    "media_urls": [
        "https://ew.com/tv/emmy-rossum-defends-playing-tom-holland-mom-10-years-older/"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "&gt; The upcoming Apple TV+ miniseries features Rossum as Candy, the mother of suspected criminal Danny Sullivan, played by Tom Holland. Rossum, 36, is only 10 years older than Holland, but she isn't irked by that, reasoning that Candy is meant to be a young mother.\n\n\n&gt; \"It makes sense when I read the script,\" the Shameless and Angelyne alum told Entertainment Tonight. \"Candy's a super young mom, she's almost a child in her own right when she becomes pregnant at age 16. You watch as I age from 25 to 35, which is actually younger than I am now.\"\n\n\n&gt; Premiering June 9 and inspired by a true story, 'The Crowded Room' is a psychological thriller set in New York City in the summer of 1979. It follows Holland's antisocial teen as he's arrested after a shooting at the Rockefeller Center. Through a series of discussions with investigator Rya Goodwin (Amanda Seyfried), Danny comes to better understand his own mental health, the people in his life, and the tragic events that led up to the incident.",
            "score": 62,
            "author": "Neo2199"
        },
        {
            "level": 0,
            "comment": "Actors out there pretending to be something they’re not - shocking",
            "score": 283,
            "author": "Ban_an_able",
            "replies": [
                {
                    "level": 1,
                    "comment": "Next you’re going to tell me Ian McKellan isn’t really a wizard",
                    "score": 4,
                    "author": "carcinoma_kid"
                },
                {
                    "level": 1,
                    "comment": "I’m sure they could have cast someone just as, if not more capable who is age appropriate for the role, but the movie industry is notorious for being agist towards women in particular. It’s not surprising, but it’s disappointing.",
                    "score": -120,
                    "author": "ellastory",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The actress actually addresses that in the article if you care to read it.",
                            "score": 55,
                            "author": "Ban_an_able"
                        },
                        {
                            "level": 2,
                            "comment": "Reading the article helps",
                            "score": 13,
                            "author": "TSE_Jazz",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I did and it still makes no sense to me. She said the character in the movie gave birth to his character at a young age, but with their respective ages, she would have had to have given birth at age 10.",
                                    "score": -4,
                                    "author": "ellastory",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Are you saying they should have found someone *exactly* the right age to play the mother? Cause 5 or 6 years really isn’t that big of a difference, especially if she’s suited for the role",
                                            "score": 4,
                                            "author": "TSE_Jazz"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Make Rossum's character 3-4 years older than her actress's age, make Holland's character 3-4 years younger than his actor's age.\n\nThere you go. 16-18 year age difference between his characters, and we're good.\n\nBrian Cox (Logan Roy) is only 10 years older than Alan Ruck (Connor Roy) who played his son in Succession.",
            "score": 569,
            "author": "BramptonBatallion",
            "replies": [
                {
                    "level": 1,
                    "comment": "Estelle Getty was 1 year younger than Bea Arthur when she played her mom on Golden Girls.",
                    "score": 117,
                    "author": "namdekan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What?!? I did not know this.",
                            "score": 3,
                            "author": "max5015",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, and they got pissed when she had plastic surgery to look younger because they had to work even harder to make her look older on the show.",
                                    "score": 16,
                                    "author": "BaconHammerTime"
                                },
                                {
                                    "level": 3,
                                    "comment": "I didn't know either until I looked on imdb, I was shocked, that she was the youngest behind Blanche.",
                                    "score": 10,
                                    "author": "namdekan",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I believe Betty White was the oldest of the bunch yet lived the longest.",
                                            "score": 11,
                                            "author": "Nop277"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Sean Connery was only 12 years older then Harrison Ford when he played his father in “Indiana Jones and the Last Crusade”. People overreact to much to stuff like this, it’s fiction.",
                    "score": 293,
                    "author": "abrainaneurysm",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Angela Lansbury was 10 years older than Elvis when she played his mother in Blue Hawaii",
                            "score": 91,
                            "author": "Traditional_Shirt106",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Lawerence Fishburn was only 6 years older than Cuba Gooding Jr when he played his father in Boyz in the Hood.",
                                    "score": 57,
                                    "author": "palabear",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "A big part of the Waynes Brothers movie \"Don't Be A Menace\" was a running joke on how close they were in age.",
                                            "score": 13,
                                            "author": "Waffleman75",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Where his dad was younger than him ha!",
                                                    "score": 3,
                                                    "author": "MoonSpankRaw",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "When he wouldn’t let his dad come to the party because he was too young lol",
                                                            "score": 1,
                                                            "author": "luisc123"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Yeah that was fuckin weird.",
                                            "score": 11,
                                            "author": "slom_ax"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Both Angela Lansbury and Lawrence Fishburn have that \"old soul\" feel to them though.",
                                            "score": 1,
                                            "author": "RagingAnemone"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "She was only 3 years older than Lawrence Harvey when she played his mom in The Manchurian Candidate.",
                                    "score": 32,
                                    "author": "Philodemus1984"
                                },
                                {
                                    "level": 3,
                                    "comment": "James Gandolfini was 37 when he first starred as Tony Soprano on the Sopranos. This isn’t relevant information.",
                                    "score": 24,
                                    "author": "RevelArchitect",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It really makes no sense -  I guess Tony is supposed to be at least 40 when the show starts and I guess Paulie is supposed to be the same age as Silvio, like 50 when the show started.  None of these guys look the right age.\n\nThere’s no way I believe that Tony and Carmella would get knocked up before they were in their mid twenties.  Even in the early 80s, even though they didn’t go to college.  It doesn’t really make sense neither of them finished university either.",
                                            "score": 5,
                                            "author": "Traditional_Shirt106"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Al Pacino was only 54 years older than his girlfriend when he squirted his hey wait a minute",
                                    "score": 148,
                                    "author": "OfficerBarbier",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thank you. I found myself reading the comments and just as I was forming the thought “what am I doing this?” BAM! Your comment. You broke the spell and I’m chuckling.",
                                            "score": 31,
                                            "author": "whyreadthis2035"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "She was just 3 years older than Lawrence Harvey when she played his mothering The Manchurian Candidate!!!!!!!",
                                    "score": 1,
                                    "author": "Crankyfrankly"
                                },
                                {
                                    "level": 3,
                                    "comment": "She was only 3 years older than Lawrence Harvey, her son in \"The Manchurian Candidate\"",
                                    "score": 1,
                                    "author": "TurbulentSkill276"
                                },
                                {
                                    "level": 3,
                                    "comment": "Sally Field is only 10 years older than Tom Hanks",
                                    "score": 1,
                                    "author": "KeithClossOfficial"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Difference there is that Connery looked way older than Ford, at least to me. Not sure if they did anything to make him look older or if he just looked that much older.",
                            "score": 11,
                            "author": "Mandalore108",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Connery always looked older than his age. He was 32 in the first Bond movie but looked like he was in his late 30s.",
                                    "score": 3,
                                    "author": "Brown_Panther-"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Lo and behold, it's called 'acting' folks.",
                            "score": 2,
                            "author": "LordScotchyScotch"
                        },
                        {
                            "level": 2,
                            "comment": "Exactly. Actors rarely play there age. They are playing characters. Their real age does not matter as long as they LOOK the part. \n\n&amp;#x200B;\n\nTons of actors play HS students but are mid to late 20s all the time.",
                            "score": 2,
                            "author": "jcaashby"
                        },
                        {
                            "level": 2,
                            "comment": "Jessie Royce Landis was 8 years older than Cary Grant when she played his mother in North By Northwest",
                            "score": 1,
                            "author": "AdoptAMew"
                        },
                        {
                            "level": 2,
                            "comment": "There's something in the water in Scotland... (It's whisky)",
                            "score": 1,
                            "author": "martylindleyart"
                        },
                        {
                            "level": 2,
                            "comment": "Its also acting. Think of all those school plays where some of those kids had to play parents or old people. Omg the horror of forcing kids to pretend to be someone else!!!!",
                            "score": 1,
                            "author": "Destronin"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Had to look Alan Ruck up and im shocked lol. He looks mabye around 50 years old in succession",
                    "score": 23,
                    "author": "PablosCocaineHippo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think he was already 30 when he filmed Ferris Bueller's day off.",
                            "score": 9,
                            "author": "MrJohnCockinass"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The problem is not the age. The problem is that she literally looks like she could be his sister, not his mother. Brian Cox looks OLD, that's why his case is believable.",
                    "score": 13,
                    "author": "MDNBLUES"
                },
                {
                    "level": 1,
                    "comment": "The mom of daya in orange is the new black was only 2 years older than the actor that played her daughter…",
                    "score": 10,
                    "author": "This_Lawfulness_8953",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lol really? She legitimately looked 15+ years older.",
                            "score": 3,
                            "author": "IggyBall",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "To me, they looked too close in age to be mother and daughter, but I went with it.",
                                    "score": 3,
                                    "author": "Street-Chocolate7205"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Weird how actors can just put on makeup and pretend to play a role, like what is that?? The process?",
                    "score": 21,
                    "author": "Otherwise_Carob_4057"
                },
                {
                    "level": 1,
                    "comment": "Kind of missing the point IMO. Women 'disappear' in the media after like 40 - that's why you get inappropriately young women playing mothers such as in this instance, or young love interests for *significantly* older actors. It's like men get to have a whole later life, but women are supposed to just quietly melt into the background. This sort of casting is part of a larger issue and I'm glad it's getting called out.",
                    "score": 26,
                    "author": "strawberrythief22",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This was exactly my issue with it -- it's not about casting actors who aren't always parental-child ages, but the steeply uneven dynamic on how Hollywood treats (and casts) women.",
                            "score": 7,
                            "author": "DumpedDalish"
                        },
                        {
                            "level": 2,
                            "comment": "It’s so cringey watching movies like “Houseboat” starring Cary Grant, who was born in 1904, and Sophia Loren, who was born in 1934, as love interests. Another instance is Jimmy Stewart (1908) and Grace Kelly (1929) in “Rear Window.” Ick.",
                            "score": 4,
                            "author": "Street-Chocolate7205"
                        },
                        {
                            "level": 2,
                            "comment": "Also, stop casting the same damn actors over and over again. Tom Holland has been in plenty of movies already. Michelle Yeoh is not the only Asian female in Hollywood. Just because Jenna Ortega did a good job on Wednesday doesn't mean she gets to appear in every film ever.",
                            "score": 0,
                            "author": "Locke_Moghan"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My wife was only 2 years younger than me when she played my mommy last night.",
                    "score": 8,
                    "author": "Straight_Broccoli_82",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "![gif](giphy|xT0BKL21U5nnlW4m6k)",
                            "score": 3,
                            "author": "Bowserbob1979"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Got nothing on Olivia Wilde playing Justin Timberlake’s mother whilst 3 years younger than him.",
                    "score": 14,
                    "author": "Teliby12",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well... No one in that movie was 25 or under.",
                            "score": 23,
                            "author": "Leifthraiser",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Really? No way!",
                                    "score": -4,
                                    "author": "Teliby12",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Maybe some of the extras were, but none of the stars were IIRC.",
                                            "score": 2,
                                            "author": "Leifthraiser"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "There were textual reasons for that one though",
                            "score": 15,
                            "author": "BarbarianCreature",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Really? No way!",
                                    "score": -8,
                                    "author": "Teliby12",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah, people stopped aging at 25 I believe in that movie",
                                            "score": 9,
                                            "author": "BarbarianCreature",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I don’t believe it",
                                                    "score": -4,
                                                    "author": "Teliby12"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Did you even watch the movie or are you just clowning?",
                                            "score": 1,
                                            "author": "MDNBLUES",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It's pretty blatant sarcasm. Their first comment. was a joke.\n\nEDIT: Changed a word",
                                                    "score": 1,
                                                    "author": "elhombreloco90",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "The guy is using sarcasm in every comment - it's kinda hard to understand whether or not he's serious after awhile.",
                                                            "score": 1,
                                                            "author": "MDNBLUES"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Amy Poehler is only 7 years older than Rachel McAdams, who played mother/daughter in Mean Girls.",
                    "score": 3,
                    "author": "DarZhubal"
                },
                {
                    "level": 1,
                    "comment": "When I started watching, I honestly thought Connor was Logan’s younger brother.",
                    "score": 2,
                    "author": "TheWholeOfTheAss"
                },
                {
                    "level": 1,
                    "comment": "Actors gonna act.",
                    "score": 2,
                    "author": "hevnztrash"
                },
                {
                    "level": 1,
                    "comment": "People here are being somewhat obtuse to the issue. Brian Cox and Sean Connery can get away playing these older roles because there was a believable visual age gap. With Tom and Emma, they look like they can play siblings.",
                    "score": 3,
                    "author": "quangtran"
                }
            ]
        },
        {
            "level": 0,
            "comment": "To be fair, Shameless viewers have become accustomed to seeing Emmy play someone who's raising people slightly younger than her",
            "score": 35,
            "author": "quarterthrowback",
            "replies": [
                {
                    "level": 1,
                    "comment": "too bad she suck’s apparently in real life",
                    "score": 4,
                    "author": "nofuture09",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I don't know why you're getting downvoted, Emmy Rossum has a terrible reputation and is well known for being toxic on set with a long string of co-stars who want nothing to do with her, including Shameless co-stars.",
                            "score": 11,
                            "author": "Round-Independent323"
                        },
                        {
                            "level": 2,
                            "comment": "You try carrying 10 seasons of Shameless while being underpaid.",
                            "score": 3,
                            "author": "TheeJackSparrow"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I mean, Anne Bancroft was only ~~10~~ 6 years older than Dustin Hoffman when they made The Graduate together. Not trying to compare this show with that film, but my point is that, if done well, it really doesn't matter.",
            "score": 20,
            "author": "OzyOzyOzyOzyOzyOzy6",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not even 10 years--he was 30 and she was 36 at the time the film was made.",
                    "score": 1,
                    "author": "OldMaidLibrarian",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wow you're right. I always heard it was 10!",
                            "score": 1,
                            "author": "OzyOzyOzyOzyOzyOzy6"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Tom Holland looks 12, so...",
            "score": 172,
            "author": "crabbiekins",
            "replies": [
                {
                    "level": 1,
                    "comment": "my thinking\n\n14 tho since he is jacked",
                    "score": 57,
                    "author": "typesett",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yea they goose him up a little bit",
                            "score": 2,
                            "author": "NYLotteGiants",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He's a real Troll Boy",
                                    "score": 2,
                                    "author": "ManlyVanLee"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Holland now has hot moms in this and Spiderman.",
                    "score": 6,
                    "author": "uncultured_swine2099"
                },
                {
                    "level": 1,
                    "comment": "Had to scroll way too far down to see this comment. I love Tom Holland but he truly looks like 12 year old.",
                    "score": 3,
                    "author": "tkp14"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sean Connery was 12 years older than Harrison Ford and he played his father in Indiana Jones and the Last Crusade \n\nIt’s called acting",
            "score": 71,
            "author": "RockNRoll85",
            "replies": [
                {
                    "level": 1,
                    "comment": "IIRC, Dick Van Dyke was older than the actor who played his character’s father in Chitty Chitty Bang Bang.",
                    "score": 3,
                    "author": "We_are_traumatised"
                },
                {
                    "level": 1,
                    "comment": "It was called acting. Alas, henceforth its known as another thing to target and whine about.",
                    "score": 10,
                    "author": "Unikanamnsuger"
                },
                {
                    "level": 1,
                    "comment": "Connery looked much older compared to Ford than this chick looks compared to Holland.",
                    "score": 8,
                    "author": "MDNBLUES"
                },
                {
                    "level": 1,
                    "comment": "Looked a lot older than that. These 2 look the same age lol",
                    "score": 2,
                    "author": "Pluckt007"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The problem is not the age. The problem is that she literally looks like she could be his sister, not his mother.",
            "score": 11,
            "author": "MDNBLUES"
        },
        {
            "level": 0,
            "comment": "Estelle Getty played Bea Arthur’s mom in The Golden Girls, even though she was a year younger than Arthur. This seems a bit stupid",
            "score": 10,
            "author": "WeirdBlueGuy"
        },
        {
            "level": 0,
            "comment": "What is the crowded room? That's 'Shameless' Actress Emmy Rossum",
            "score": 7,
            "author": "leijt"
        },
        {
            "level": 0,
            "comment": "My question is Tom going to eventually going to look old enough to play a parent himself?",
            "score": 6,
            "author": "XuX24",
            "replies": [
                {
                    "level": 1,
                    "comment": "He is old enough to be a parent. He looks old enough too. Maybe because I'm around the same age? He looks his age to me. 🤔",
                    "score": 1,
                    "author": "Ancient_Reply4583"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Tom Hollandia looks 10 years younger than he actually is so it cancels out",
            "score": 6,
            "author": "Greedy_Hat2643",
            "replies": [
                {
                    "level": 1,
                    "comment": "Fangin for a beer hey?",
                    "score": 2,
                    "author": "martylindleyart",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hahaha autocorrect lol Hollandias aren’t a bad drop though mate.",
                            "score": 2,
                            "author": "Greedy_Hat2643",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Haha there's worse, that's for sure",
                                    "score": 1,
                                    "author": "martylindleyart"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's fantasy. I'm my own grandpa. Don't overthink it. It's entertainment.",
            "score": 19,
            "author": "naliedel",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ohh, a lesson in not changing history from Mr. \"I'm My Own Grandfather\"! Let's just steal the damn dish and get out of here! Screw history!",
                    "score": 8,
                    "author": "TomWolfeRock"
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"thats RIGHT mom, you tell'm. now go get stuck in the dryer\"",
            "score": 4,
            "author": "Phantomht"
        },
        {
            "level": 0,
            "comment": "Saw a high school production of Footloose once and a junior was playing the role of the pastor while a senior was playing Kevin Bacon’s part. Completely ruined the immersion /s",
            "score": 12,
            "author": "generallylaidback",
            "replies": [
                {
                    "level": 1,
                    "comment": "Verisimilitude and high school theater seldom walk hand in hand",
                    "score": -2,
                    "author": "Kumirkohr"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wasn't the actors in \"teenagers from outer space\" in their mid thirties?\n\nThis isn't exactly the first time Hollywood has been weird with ages.",
            "score": 3,
            "author": "Reasonable-One-1981",
            "replies": [
                {
                    "level": 1,
                    "comment": "You mean the cast of “90210” back in the 90s weren’t school age?",
                    "score": 2,
                    "author": "smokeeater150"
                },
                {
                    "level": 1,
                    "comment": "In The OC, Mischa Barton and Ben Mackenzie played ~16-year olds Marissa Cooper and Ryan Atwood, but Mackenzie is 8 years older than Barton. And Barton’s mother, Julie Cooper, is played by Melinda Clarke who is only 10 years older than Mackenzie. Nikki Reed is 11 years younger than Mackenzie but played his apparently contemporary love interest, Sadie, and his adopted mother Kelly Rowan/Kirsten Cooper’s younger sister Hailey was played by Amanda Righetti who is 4 years younger than Mackenzie (and a couple younger than most of the ‘teen’ actors - Adam Brody, Rachel Bilson, Autumn Reeser, Chris Carmack etc). The relative ages of cast and characters was all over the place on that show.",
                    "score": 2,
                    "author": "MartayMcFly"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Tom Holland generally looks younger than he is at this point in his career. If the story is that she was a young mother (say 16 like the article says), Holland definitely passes as a 20 year old considering he literally just played Peter Parker who was passed off as an 18 year old as little as 2 years ago",
            "score": 3,
            "author": "thegodfaubel"
        },
        {
            "level": 0,
            "comment": "Is anyone out there actually upset about this? Why is she addressing this? Who gives a fuck?",
            "score": 3,
            "author": "inteliboy",
            "replies": [
                {
                    "level": 1,
                    "comment": "The answer is most likely Twitter.",
                    "score": 2,
                    "author": "obscureposter"
                },
                {
                    "level": 1,
                    "comment": "Cause why not actually cast someone in their 40s? 🤷‍♀️ This is why people say women over 40s in Hollywood don't get roles. Because they're willing to cast someone in their 30s to play to role of a 27 year old's mother and have people be confused AF than cast a woman over 40.",
                    "score": 2,
                    "author": "Ancient_Reply4583"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The age-gap is not the issue. It’s about believability. The showmakers are trying to sell  something that the viewers are not buying. It’s the same as watching Game of Thrones and asking, “How is Samwell Tarly still fat when he’s travelled the country end-to-end”? The answer the actor gives? “But there’s dragons!” Insulting the viewers intelligence is never good.",
            "score": 3,
            "author": "TheWholeOfTheAss"
        },
        {
            "level": 0,
            "comment": "There’s been a lot of female actors complaining their roles just go away after they enter their late 30s, isn’t this an example of where those roles go to?",
            "score": 3,
            "author": "Kutukuprek",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hollywood is willing to hire someone in their 30s, have them put on makeup to look older, have people be confused AF about the ages of the cast not making any sense... But not hire a woman in her 40s who will be old enough to be his mother, and will look the part no make-up needed and it won't be confusing. \n\nThey have every right to complain about that. 🤷‍♀️",
                    "score": 2,
                    "author": "Ancient_Reply4583"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My dad’s actual adoptive mom is only 11 years older than him.",
            "score": 3,
            "author": "AnInfiniteArc"
        },
        {
            "level": 0,
            "comment": "Why would she have to defend it? Who the hell is complaining g about such a thing?",
            "score": 3,
            "author": "BlunterSThompson_"
        },
        {
            "level": 0,
            "comment": "Don’t put this on the actors; anybody worth their salt is going to want to believe they can do a good job acting different roles. If this is a problem, it is a casting problem.",
            "score": 10,
            "author": "ubiquitous-joe"
        },
        {
            "level": 0,
            "comment": "Tomorrow’s headline… “Alan Tudyk defends playing a chicken while being a human”",
            "score": 6,
            "author": "CivilRuin4111",
            "replies": [
                {
                    "level": 1,
                    "comment": "I hear he went to Julliard.",
                    "score": 2,
                    "author": "Bowserbob1979"
                },
                {
                    "level": 1,
                    "comment": "*Alan Tudyk defends playing thousand-year-old alien while only being 52.*",
                    "score": 1,
                    "author": "Nessie"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Her defense?  She needs a paycheck.",
            "score": 6,
            "author": "Dennis_Reynolds_IRL"
        },
        {
            "level": 0,
            "comment": "“Frasier and his father Martin, portrayed by John Mahoney, are supposed to be decades apart on the showm, but in real life Mahoney is only 15 years Grammer's senior.” (Nydailynews.com)",
            "score": 2,
            "author": "MiniGoat_King"
        },
        {
            "level": 0,
            "comment": "“Suspension of Disbelief” it’s not like it’s the other way around… why do people argue this shit for movies? Literally watching Spider-Man and Lips sister act like they aren’t their, currently, most famous characters? \n\nIt’s not that hard to set yourself outside of any very fake portrayal and just enjoy it.",
            "score": 2,
            "author": "A_Gent_4Tseven"
        },
        {
            "level": 0,
            "comment": "This whole discussion seems odd. People in Hollywood get their jobs because they are famous, not because of age. They also have to look good. Joan Rivers was over 80 when she died but didnt look it. \n\nI am never shocked anymore after the Golden Girls because Betty White was the oldest and all.",
            "score": 2,
            "author": "JustKayedin"
        },
        {
            "level": 0,
            "comment": "Looking at this photo I actually buy it. I can totally see her as a young mom to Tom Holland.",
            "score": 4,
            "author": "supersonic8593"
        },
        {
            "level": 0,
            "comment": "I think it's called acting. This is dumb as fuck",
            "score": 4,
            "author": "whatisreddittou"
        },
        {
            "level": 0,
            "comment": "Remember, in some states, I'm betting they would like that 10 is just the right age for a girl to be pregnant and forced to keep the baby per their thinking.",
            "score": 3,
            "author": "jokerZwild"
        },
        {
            "level": 0,
            "comment": "You all act like you've never had a parent just 10 years older than you.",
            "score": 3,
            "author": "Gurablashta",
            "replies": [
                {
                    "level": 1,
                    "comment": "I mean there was a pregnant 10 year old in the news not that long ago. Shit is weird and sad and not necessarily out of the realm of possibility",
                    "score": 2,
                    "author": "MelonOfFury"
                },
                {
                    "level": 1,
                    "comment": "Right?!",
                    "score": 1,
                    "author": "BeneficialChance3672"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This isn't a new phenomenon, it's been happening for a while.",
            "score": 2,
            "author": "jokerZwild"
        },
        {
            "level": 0,
            "comment": "What’s to defend? Is someone criticizing this choice? As if it’s so implausible based on looks.",
            "score": 2,
            "author": "Educational-Poet9203"
        },
        {
            "level": 0,
            "comment": "Sally Field played Tom Hanks’ mom in Forrest Gump and they are only 10 years apart. \n\nWhat’s the big deal?",
            "score": 2,
            "author": "horkus1"
        },
        {
            "level": 0,
            "comment": "it’s not real life. who gives a fuck.",
            "score": 2,
            "author": "captainyami21"
        },
        {
            "level": 0,
            "comment": "While an animated series, The Great North features Nick Offerman playing Beef Tobin, father of four children. The eldest child, Wolf Tobin, is played by Will Forte who is older than Offerman. It’s called acting.",
            "score": 1,
            "author": "mioxm"
        },
        {
            "level": 0,
            "comment": "Well, the GQP thinks that 10 is a good age to start birthing, so I guess it coulda happened",
            "score": 1,
            "author": "Tim-in-CA"
        },
        {
            "level": 0,
            "comment": "Yeah it’s called acting",
            "score": 1,
            "author": "Raph2051",
            "replies": []
        },
        {
            "level": 0,
            "comment": "It’s called “acting” because one does not have to be something to perform as such. Quit acting weird people, or there is a sign somewhere that will be tapped, and you won’t like what it says in regard to this particular situation. Mark my words.",
            "score": 1,
            "author": "YawaruSan"
        },
        {
            "level": 0,
            "comment": "It’s called acting…… they are acting.",
            "score": 1,
            "author": "SoBadit_Hurts"
        },
        {
            "level": 0,
            "comment": "I’d hate the general public if I had to answer senseless questions like this as an actor",
            "score": 0,
            "author": "Lucky_Employ2045"
        },
        {
            "level": 0,
            "comment": "Is this that big of a deal ? Tom plays young all the time ?? It’s not hard to see Emmy as a young mother",
            "score": 1,
            "author": "Aggravating-Tale810"
        },
        {
            "level": 0,
            "comment": "In all fairness, he looks really young.\n\nIt’s not like she’s RDJ’s mom😂",
            "score": 1,
            "author": "JMDeutsch"
        },
        {
            "level": 0,
            "comment": "It's called acting",
            "score": 1,
            "author": "dRi89kAil"
        },
        {
            "level": 0,
            "comment": "In the TV show Blue Bloods Tom Selleck is just over 5 years younger than Len Cariou who plays his dad.",
            "score": 1,
            "author": "Savage_SoCal_Guy"
        },
        {
            "level": 0,
            "comment": "Jessie Royce Landis was only eight years older than Cary Grant in North By Northwest, despite playing his mother.",
            "score": 1,
            "author": "square3481"
        },
        {
            "level": 0,
            "comment": "It’s called acting. Literally and figuratively",
            "score": 1,
            "author": "Zuulkins"
        },
        {
            "level": 0,
            "comment": "What are they? Actors? They… *act*?\n\n*Gasp*",
            "score": 1,
            "author": "GiantChocoChicknTaco"
        },
        {
            "level": 0,
            "comment": "Really. An actor had to defend their true age vs the age of a character? Have you seen a teen movie? Ever? Is Neo2199 a real person? I’d just like to know.",
            "score": 1,
            "author": "whyreadthis2035"
        },
        {
            "level": 0,
            "comment": "Back to the Future had people playing MJF’s parents at his same age. Who cares. Just do the makeup and act!",
            "score": 1,
            "author": "Ok-Yogurtcloset-2735",
            "replies": [
                {
                    "level": 1,
                    "comment": "But why not cast an actual 40 something year old? Why cast a 30-something year old so you have to add makeup for to make them look a different age ... When you literally could have gotten someone who is already that. 🤷‍♀️",
                    "score": 1,
                    "author": "Ancient_Reply4583",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Why make Harrison Ford or Patrick Stewart or Robert DiNero look 30 with CGI when they’re all 70 plus?! Why not hire someone who’s 30?!\n\nMy question was obviously rhetorical to illustrate a point. Hiring younger to look older has been as common in the acting field as long as there’s been acting.",
                            "score": 1,
                            "author": "Ok-Yogurtcloset-2735",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "True, but they were reprising their previous roles.",
                                    "score": 1,
                                    "author": "Ancient_Reply4583"
                                },
                                {
                                    "level": 3,
                                    "comment": "Also, kinda not fair to compare the star power of the likes of Ford and DiNero with Emmy's.",
                                    "score": 1,
                                    "author": "Ancient_Reply4583"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s called acting for a reason. What’s not to understand?",
            "score": 1,
            "author": "bananatimemachine"
        },
        {
            "level": 0,
            "comment": "It’s called acting guys. Jfc",
            "score": 1,
            "author": "organizim"
        },
        {
            "level": 0,
            "comment": "Have these fucks never heard of makeup?",
            "score": 1,
            "author": "Reasonable_Highway35"
        },
        {
            "level": 0,
            "comment": "People should instead question why Tom Holland continues to get work",
            "score": 1,
            "author": "CrasVox"
        },
        {
            "level": 0,
            "comment": "For some reason i thought it was another spiderman 😂 until I read the article.",
            "score": 1,
            "author": "ekalav83"
        },
        {
            "level": 0,
            "comment": "Well, he’s got a baby face and she’s got a MILD face, so it works out perfectly. \n\n\nPS: MILD - Mom I’d Like to Date",
            "score": 1,
            "author": "McRedditz"
        },
        {
            "level": 0,
            "comment": "And 20 year olds play high schoolers. It’s acting…",
            "score": 1,
            "author": "agrostereo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Older playing younger as long as they look like they could be that young is different from younger playing older. Especially because it happens because Hollywood hates women over 40.",
                    "score": 1,
                    "author": "Ancient_Reply4583"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wasn’t Sean Connery only 10-12 years older than Harrison Ford in The Last Crusade playing his dad?",
            "score": 1,
            "author": "Nekodon"
        },
        {
            "level": 0,
            "comment": "Nobody's seen Benjamin Button?",
            "score": 1,
            "author": "17FeretsAndaPelican"
        },
        {
            "level": 0,
            "comment": "It's called \"acting\". It's when you pretend to be something that you aren't in reality.",
            "score": 1,
            "author": "Alimbiquated"
        },
        {
            "level": 0,
            "comment": "Next you’ll tell me she’s not even his mother ?",
            "score": 1,
            "author": "A-Chntrd"
        },
        {
            "level": 0,
            "comment": "America is the land of teen moms, so its not a big deal",
            "score": 1,
            "author": "Fisktor"
        },
        {
            "level": 0,
            "comment": "People should look up the supernatural cast",
            "score": 1,
            "author": "bkfu2ok"
        },
        {
            "level": 0,
            "comment": "At first I thought this was a biopic series about Tom Holland’s family, or some scandal his actual mom was involved in lol\n\nBut yeah with Hollywood magic I think this is a non-issue.",
            "score": 1,
            "author": "hijole_frijoles"
        },
        {
            "level": 0,
            "comment": "She’s playing his mom but she didn’t even give birth to him also!! What a joke.\n\nActing is still when people pretend to be other people right? Different ages and lives and stories right?",
            "score": 1,
            "author": "ResponsibleAnt9496"
        },
        {
            "level": 0,
            "comment": "To defend, wouldn’t she have to be challenged?",
            "score": 1,
            "author": "Diggable_Planet"
        },
        {
            "level": 0,
            "comment": "If anybody is actually raising a stink that actors are acting, they can go fuck themselves.",
            "score": 1,
            "author": "AndarianDequer"
        },
        {
            "level": 0,
            "comment": "Defend? How? “I look old for my age…”",
            "score": 1,
            "author": "Mental5tate"
        },
        {
            "level": 0,
            "comment": "People get offended/outraged over the weirdest things, these days lmao",
            "score": 1,
            "author": "OptimisticRealist__"
        },
        {
            "level": 0,
            "comment": "Isn’t it called acting?\nShe is an “actress”",
            "score": 1,
            "author": "58LS"
        },
        {
            "level": 0,
            "comment": "In above the rim tonya pinkins was only three years older than duane Martin.",
            "score": 1,
            "author": "JOMO_Kenyatta"
        },
        {
            "level": 0,
            "comment": "Wow, it’s almost like acting is pretend!",
            "score": 1,
            "author": "brtlblayk"
        },
        {
            "level": 0,
            "comment": "“Defending” from whom. \nThis isn’t an article it’s an ad for the show.",
            "score": 1,
            "author": "smginstl"
        },
        {
            "level": 0,
            "comment": "Not even sure why this is a debate. Actors rarely play their actual age.\n\n&amp;#x200B;\n\nThe black girl (can not think of her name) from that show SWARM and PROJECT POWER is like 31 but plays a teen and looks like a teen",
            "score": 1,
            "author": "jcaashby"
        },
        {
            "level": 0,
            "comment": "Who cares about the age difference. The only real disparity is Emmy Rossum is a nightmare and just okay!",
            "score": 1,
            "author": "Csolex"
        },
        {
            "level": 0,
            "comment": "Side note - does anyone know why Tom Holland constantly has that expression on his face? It looks like someone photographs him in the middle of being a bad ventriloquist.",
            "score": 1,
            "author": "fistingcouches"
        },
        {
            "level": 0,
            "comment": "It’s going to be shitty anyway",
            "score": 1,
            "author": "freshkangaroo28"
        },
        {
            "level": 0,
            "comment": "HAVE THESE GUYS WATCH HOUSE OF THE DRAGONS??",
            "score": 1,
            "author": "awkardandsnow111"
        },
        {
            "level": 0,
            "comment": "next thing they will say that adults were playing college students in the movies all these years; movies don't have to reflect real age, if visually it passes - good",
            "score": 1,
            "author": "Popular_District9072"
        },
        {
            "level": 0,
            "comment": "It’s called acting 🎭",
            "score": 1,
            "author": "SolidContribution688"
        },
        {
            "level": 0,
            "comment": "We should take solace in the fact that of all the controversial disagreements we have here on Reddit, most of us don't give a shit about things this trivial.",
            "score": 1,
            "author": "Kelburno"
        },
        {
            "level": 0,
            "comment": "The TV show Grounded for Life had the same age gap between actresses between the mom and daughter and it worked out perfectly fine.",
            "score": 1,
            "author": "AkuraPiety"
        },
        {
            "level": 0,
            "comment": "All those apologist comments Here.\n\nNo it is Not okay, it's absolutely gross and questionable.\n\nAnd it absolutely hurts the Outcome. Dune would have been a flawless movie if it hadn't been for Timothee Chalamet and Rebecca Ferguson looking at each other like they were ready to get it on, in most of their scenes, because they had an age gap of only 12 years",
            "score": 1,
            "author": "Sutech2301"
        },
        {
            "level": 0,
            "comment": "The problem isn't that she doesn't look like his mom. Of course she doesn't. She's way too young - even if you make her look older. The problem is; why not cast an age appropriate actress? Why is Hollywood so afraid of older women? Couldn't they find anyone over 40 to play this role?",
            "score": 1,
            "author": "Ancient_Reply4583"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 1,
            "author": "[deleted]"
        }
    ]
}