{
    "id": "142pj5i",
    "score": 1103,
    "title": "The Little Mermaid’s Box Office Drop Is Horrible For Disney’s Live-Action Remakes",
    "author": "radioforce",
    "date": 1686077107.0,
    "url": "https://www.reddit.com/r/entertainment/comments/142pj5i",
    "media_urls": [
        "https://screenrant.com/the-little-mermaid-box-office-drop-disney-remakes/"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "A fundamental criticism is the run time. The movie is for families but it is 135 minutes (2h 15m). Making kids sit 135 minutes doesn’t make sense.",
            "score": 762,
            "author": "rentalfloss",
            "replies": [
                {
                    "level": 1,
                    "comment": "What is all the extra time spent on?",
                    "score": 79,
                    "author": "Otherwise_Ad233",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Songs by Lin Manuel Miranda and fleshing out things that were purposely not included in the original in service of a shorter run time",
                            "score": 211,
                            "author": "BidnessBoy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Exact same issue Beauty and the Beast had.\n\nWe didnt need explanations of how much the villagers knew of the Castle, or where Mr Potts was. These remakes miss the forest for the trees.",
                                    "score": 135,
                                    "author": "HVYoutube",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Especially for children. Their brains aren't yet wired enough to go deep diving into plot nuances. It appears Disney have forgotten who their audience is and how their content should cater to them. Basic 101 of storytelling.",
                                            "score": 51,
                                            "author": "strangealienworld",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It’s because these remakes ***aren’t*** aimed at children. \n\nThey’re aimed at the parents who will take their children to them for nostalgia purposes. It’s an “*addition*” to the original content, created to rake in cash from parents who loved the original franchise as a child.",
                                                    "score": 69,
                                                    "author": "Craico13",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "The screening I went to definitely drew a lot of parents, but the theater was also about half kids and you could tell after about an hour 45 that they were getting restless. I still think they enjoyed it, though, and I think the worst that comes of that is they break it up and watch it in more parts when it hits Disney+ later.",
                                                            "score": 9,
                                                            "author": "weed-n64"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "You know, I hadn't seen these Disney remakes in that way before. Thanks. Now it makes better sense. \n\nPoor kids, though. I feel cheated on their behalf.",
                                                            "score": 21,
                                                            "author": "strangealienworld",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I hear you but stupid babies don’t appreciate shit anyways is my counter argument 🤷🏻‍♂️",
                                                                    "score": 2,
                                                                    "author": "stuntmanhi"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "That's a good point...\n\nAlso, these box office numbers are *dwarfed* by Disney+ revenue.  Just churning these things out, even if they're bad, *especially* if they are controversial, keeps people engaged to the core product.\n\n\"Hey, let's go see the new Little Mermaid!\"  \"That sucked, not as good as the original.. well we've got that at home, at least.\"\n\nThat's still eyeballs, conversation, and wallets on Disney, rather than Illumination or Netflix.",
                                                            "score": 3,
                                                            "author": "StinkyBrittches"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "It sounds like they were making it that way so CinemaSins can’t nitpick on them.\n\nJokes on them though *ding*",
                                            "score": 2,
                                            "author": "Dearth_lb"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Sounds like a whole lot of what they *think* we want",
                                    "score": 45,
                                    "author": "holamuneca",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Probably but they also know it'll end up on streaming and kids will skip the parts they don't care about anyway.",
                                            "score": 14,
                                            "author": "Kelbotay"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I don’t think people realise how big this actually is. Early Disney stuff is normally just over an hour. Constant beats along the way with the story and not overly long for kids. Made for a great experience.",
                    "score": 486,
                    "author": "TRTVitorBelfort",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Part of the shorter run time was the limitations of the medium. Hand drawn and painted animated cells that would also need to be photographed by hand was a long and expensive process (it’s why we see [some assets get reused](https://youtu.be/vd09WdOgOeg) in films. \n\nToday animation and special effects can be made faster and cheaper, so they can be longer. It makes for problematic viewing in the theater with young kids, but for parents who let a movie play in the background while their kid is eating or playing they may prefer a longer run time, if only to not have to listen to the same thing every 39-40 minutes.",
                            "score": 54,
                            "author": "notquitesolid",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Unfortunately, “movies to play in the background” is probably not a great product for Disneys bottom line",
                                    "score": 63,
                                    "author": "L3thal_Inj3ction",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "What do you mean? It’s been their MO in all of their franchisees at this point lol",
                                            "score": 10,
                                            "author": "mattdom96",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I’m sure you mean this as an insult to their quality, which I agree with, but huge box office performance has been important to their success",
                                                    "score": 9,
                                                    "author": "L3thal_Inj3ction"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "No way my kids will sit that long. ~1.5hr max is all that they can handle. Even with a movie they like",
                    "score": 21,
                    "author": "Rags2Rickius"
                },
                {
                    "level": 1,
                    "comment": "It's also the tone and filming style. It's supposed to be a colorful musical, but it feels like one of those muddy-looking films from 2009. All of the remakes do, lately.",
                    "score": 116,
                    "author": "Humble_Animal_998",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's what killed all these live-action remakes for me. I saw Beauty and the Beast - it was ok, at best. It felt like a really, really high-budget BBC production more so than a Disney movie. Not a negative, but not really what was expected.\n\nThen I saw Aladdin. The problem is that Aladdin's really only a memorable movie for Robin Williams; imagine Will Smith's live-action genie acting that way. You don't get Disney magic; you get The Mask with Jim Carrey. But having Genie-Smith be basically him, but blue, just kind of dulls the film into something unremarkable and easily forgotten.\n\nIt wasn't really the fables and faerie tales that drew people into Disney and cemented its place as one of the preeminent animation studios in the world. It was the magic they wove into those stories, and they seem to have forgotten that.",
                            "score": 56,
                            "author": "Graega",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They need to bring in Baz Luhrman to direct these films lol",
                                    "score": 13,
                                    "author": "Zhuul"
                                },
                                {
                                    "level": 3,
                                    "comment": "Beauty and the Beast was one of the darkest looking films I’ve ever seen. Everything was dark. I did not like it.",
                                    "score": 2,
                                    "author": "bottlerocketz"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It's all the CGI and green screen use I think. The scale of big budget blockbusters these days feels really small.",
                            "score": 2,
                            "author": "Zeraw420"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Spider-Verse is just as long. I actually heard several kids complaining to their parents in that one. I think both movies were too long, but didn’t hear any noticeable restlessness in Mermaid. \n\nThe animated Little Mermaid is a fast movie, so the added time for pacing makes sense to me and it was needed. But 2:15 is just too long for a kids movie. In both cases. Should have been two hours tops.",
                    "score": 26,
                    "author": "ExcellentDish80",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I liked Spider-Verse, but the fact its so long and doesnt have a third act or climax is a notable issue",
                            "score": 28,
                            "author": "HVYoutube",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Half the theatre audibly groaned or some version of “what??” At the end of spider verse",
                                    "score": 10,
                                    "author": "flewidity"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "\"Spider-Verse\" is also too long as well, though I'm sure it's better than this tepid cash grab.  I was glad my daughter was able to sit through it.  Could have had twenty to thirty minutes trimmed without affecting the movie at all, but indulgence is the watchword of the day and economy of story has been thrown out the window.",
                            "score": 2,
                            "author": "Koala-48er",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Spiderverse is a genuine artistic masterpiece though, while the Little Mermaid is just another live action cash grab remake. It had genuinely no slow or filler moments, what could they have cut?",
                                    "score": 2,
                                    "author": "Venvut"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Lol the original was 83. That’s like an extra day to a kid.",
                    "score": 6,
                    "author": "marblecannon512"
                },
                {
                    "level": 1,
                    "comment": "Mario was less than 90 minutes and I think that is a big reason it dominated the box office. It’s very doable with kids",
                    "score": 5,
                    "author": "mojo-jojo-was-framed",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Sometimes I even have a hard time focusing that long. An antsy kid? Forget it.",
                    "score": 4,
                    "author": "WealthMagicBooks"
                },
                {
                    "level": 1,
                    "comment": "I took my kids to see the OG Ninja Turtles film during throwback Thursday a few weeks ago, and at barely over 90 minutes, it was almost too long for them.  Getting them to sit for nearly 3 hours if you include ads and previews is not happening.",
                    "score": 3,
                    "author": "bluegiant85"
                },
                {
                    "level": 1,
                    "comment": "I see a lot of excuses made for this movie…. Most of them started with claiming people are being racist because they chose to use a black actor 🙄. But to be completely honest this movie just wasn’t good. There was nothing really enjoyable about it at all. My kids and I have felt the same way about all of the live action Disney remakes, they just seem so uninspiring. As if Disney knew they were going to make money off of them no matter what so they just didn’t even really try.",
                    "score": 15,
                    "author": "MaterialExcellent987",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "That’s the fundamental criticism? Is that the main one?",
                    "score": 8,
                    "author": "smeerzye",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "lol, yeah that's it",
                            "score": 3,
                            "author": "citoloco"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Is the movie for families or is it for Disney Adults? They seem confused about what they're actually going for and aren't hitting anything.",
                    "score": 6,
                    "author": "Agreeable-Meat1",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "thats also why most of illumination movies are around 90 minutes long. and they all have great box office retention",
                    "score": 2,
                    "author": "azrieldr"
                },
                {
                    "level": 1,
                    "comment": "Across the spider vers is art. Amazing in almost all metrics. But there are too many slow parts too keep kids engaged. I went to a 330 showing on a Friday after school had let out. Wow that was a mistake. \nGwen having a heartfelt talk with her dad is met with kids in the theater fidgeting and complaining to parents",
                    "score": 5,
                    "author": "muppethero80",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Fundamental criticism… most families probably don’t even check the runtime before going. Realistically, not my opinion, but the woke stuff in the news has actually alienated families who are starting to turn away from Disney. Other thing hurting the release, it’s not very good; I’ve seen it.",
                    "score": 5,
                    "author": "Ok-FoxOzner-Ok"
                },
                {
                    "level": 1,
                    "comment": "But the story! PoC Ariel! /s",
                    "score": 1,
                    "author": "beanedjibe"
                },
                {
                    "level": 1,
                    "comment": "I mean this stuff is the definition of NOT for me (44yo male, I brought my kids), but I found this excruciating after the first 90 minutes. There's no good reason this shit needs to be more than 90 minutes!",
                    "score": 2,
                    "author": "echomanagement"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Will this film even hit $450mill global?  They're saying $640 million just to break even.",
            "score": 122,
            "author": "Jeekobu-Kuiyeran",
            "replies": [
                {
                    "level": 1,
                    "comment": "“With a $250 million production cost and a reported $140 million marketing cost, The Little Mermaid, under the most generous of projections, needs to gross approximately $560 million at the worldwide box office, according to Hollywood insiders, to reach its break-even threshold.”",
                    "score": 88,
                    "author": "OhHelloJason",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Other projections say it may barely hit $300mil domestically.\n\n“You add those numbers up. That doesn’t get you to $625 million which is its break-even point. So, yeah, not a good look overall for The Little Mermaid going forward,” he declared.\"\n\n\"But even if it did $650 million would be a minimal profit and according to some metrics be a financial loss. It really depends on whether your break even is 2.5 or 3 times the budget.”\n\nhttps://boundingintocomics.com/2023/06/05/the-little-mermaid-declared-a-massive-flop-for-disney-by-box-office-analyst/",
                            "score": 33,
                            "author": "Jeekobu-Kuiyeran",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "bounding in to comics is not a real analyst or anything, its an alt right nerd website that has an agenda against this movie for reasons\n\nThe math doesnt support it \"barely hitting $300M domestically\". Its second weekend drop and daily performance shows it trending higher than that",
                                    "score": 14,
                                    "author": "not_a_flying_toy_",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm not trying to side with the assholes, but barely breaking $300m doesn't seem like that far of a stretch.\n\nIts at $191m right now, does it have the legs to do another $110m+?\n\nWe're really not going to know until after this weekend, but if it falls another 50%+ it doesn't really look ideal for it.\n\nEven if it hits $300m on the dot its still going to have a 3.15x multiplier from its opening Fri-Sun. Thats not seemingly an outlier from other Disney live action adaptations.\n\nDumbo opened at $45m and ended at $115m for a 2.55X multiplier.\n\nThe Lion King opened to $191m and hit $543m domestic for a 2.84x multiplier.\n\nBeauty and the Beast opened to $174m and ended up at $504m for a 2.89X multiplier.\n\nAlladin opened to $91m and ended up at $356m fror a massive 3.91x Multiplier. Alladin had incredible legs. Its fall weekend 2-3 was only 42%, from there it was incredibly low for the next several weeks not breaking 35% once, until weekend 12.\n\nIts possible this movie has Alladin type legs, but we really just don't know yet. The picture will clear up this weekend. If it manages a 35%-45% drop then its possible that something really remarkable could be in store for it, but if it takes a real hit then cresting just over $300m is a real possibility. \n\nNone of this speaks to the quality of the movie, which I'm sure is great, or the credibility of bounding into comics, which is garbage as are they. Just that we don't really know where this movie is going to end up yet and after its start $300m is not a bad number.",
                                            "score": 5,
                                            "author": "UsidoreTheLightBlue"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "That website is an insult to nerds, they complained about Satan in movies and games lmao",
                                            "score": 5,
                                            "author": "Andy_Liberty_1911"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "https://boundingintocomics.com/2023/06/05/the-little-mermaid-declared-a-massive-flop-for-disney-by-box-office-analyst/amp/",
                                    "score": 2,
                                    "author": "Ryansmith54789"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Break even? That’s just the cost of keeping the IP for another 75 years",
                    "score": 3,
                    "author": "redditckulous",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "It’s tracking for $310-$350m domestically and is currently at $141m international so even if it was immediately pulled from all other countries outside US/Canada it would still hit $450m global.",
                    "score": 28,
                    "author": "hatramroany"
                },
                {
                    "level": 1,
                    "comment": "It’s $650 now? Last week people were saying $500. I can’t keep track!",
                    "score": 13,
                    "author": "newtoreddir",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I go by the production budget times 2.5. In this case $625 million. There was an article out where the writer broke down breakeven around $500 million but he also noted that this would include Disney paying itself $100 million to put the movie on Disney+. I think that’s more moving around money than making a profit so I didn’t pay too much stock in that.",
                            "score": 10,
                            "author": "huhzonked"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "yes, it will absolutely hit $450M WW. \n\nits trending on a day to day basis almost identical to Aladdin, and will make between $340M-$360M domestically, give or take. It is currently very domestically heavy, about 57% Domestic, and if that stays steady it will hit about $600M. However, its legs are improving in Latin America and Europe relative to the US (likely due to a low european opening but decent word of mouth, it got a A cinemascore). Plus it hasnt opened in Japan, and while it isnt likely to do gangbusters it japan that could easily be another 10M-30M on top of that. In the end this will probably end up close to a 50/50 split and around $640M WW\n\nA disappointment in the international market since these historically did almost 70% internationally, but hardly the failure most people are saying",
                    "score": 3,
                    "author": "not_a_flying_toy_",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "And yet they’ll make another, and another, and another, and we’ll all be back here arguing over it as if it matters.",
            "score": 388,
            "author": "Salty_Lego",
            "replies": [
                {
                    "level": 1,
                    "comment": "Only one I want to see is Hunchback, but Disney won't have the guts to do it. It's also the movie best suited to live-action.\n\nI'd like to see another version of Hellfire!",
                    "score": 148,
                    "author": "louploupgalroux",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I want to see treasure planet",
                            "score": 83,
                            "author": "RA12220",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Atlantis and Treasure Planet would be box office gold",
                                    "score": 73,
                                    "author": "CowFckerReloaded",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Atlantis is a really underrated gem. Even Disney fans I know often haven't heard of it, let alone seen it.",
                                            "score": 29,
                                            "author": "Graega",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I LOVED Atlantis as a kid, I wanted to be Kida, she was so cool!!!!",
                                                    "score": 10,
                                                    "author": "goldberry-fey"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I don't want a live action remake because Mrs Packard won't be a chain smoker anymore",
                                                    "score": 2,
                                                    "author": "Stucklikegluetomyfry"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "They could easily take the place of the Pirates franchise if they wanted to.",
                                            "score": 3,
                                            "author": "Darnell5000"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Treasure Planet is such an amazing movie. I watched it once years ago to ‘kill time’ and ended up falling in love with it. Watched it with my kid recently on D+. It’s held up remarkably well and my kid ended up watching it on repeat for weeks after (as kids tend to do).",
                                            "score": 6,
                                            "author": "itehbitehlolcomiteh"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "They should honestly rerelease the animated version. It would probably do well with enough marketing.",
                                    "score": 13,
                                    "author": "Salty_Lego",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Man a 4k Blu-Ray with HDR would look seriously gorgeous, honestly with how underappreciated it is and recently having done Wall-E, I shall dream about a Criterion release tonight.",
                                            "score": 6,
                                            "author": "ArklightThePCVirgin"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Checkout the broadway version with Patrick. Page playing Frolo - excellent rendition and absolutely chilling.  An aside, I want to try my hand at turning it into a metal song for fun at some point cause I think some big ass guitars would sound great in that song haha.",
                            "score": 15,
                            "author": "Mixoblivian",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Dang, he's got a good voice and looks just like the movie Frollo. Thanks for sharing.\n\nIt seems that show was in NJ. As far as I know, Disney has never given the green light for a NYC Broadway show.\n\nAnnapantsu has a pretty good female cover that doesn't really go that dark, but her voice is always impressive:\n\nhttps://youtu.be/ADTA2rU-l-8",
                                    "score": 5,
                                    "author": "louploupgalroux"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Why wouldn’t they ?",
                            "score": 9,
                            "author": "KirbbDogg213",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Depictions of Roma as thieves. Deformed man being tortured and humiliated by a crowd. A judge saying that a woman is too sexy, so he has to burn her alive. Same judge kills a migrant Roma woman in the first scene and steals her baby. Shadowy hooded figures and songs about damnation or the selfishness of religious crowds. The list goes on.\n\nAll that probably seems riskier than doing stories like Bambi. I would like to be wrong though. Who knows?",
                                    "score": 41,
                                    "author": "louploupgalroux",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Hear me out: Adult Disney Movie. Cut the gargoyles out and the Topsy Turvy Day song and you can barely justify it’s for children anyway. \n\nPlus adults watch Disney movies on their own now, it’d be a big market. Pirates of the Caribbean was PG-13 and now we can’t kill the damn series, Disney’s first Rated R movie being about bigotry in the wake of the Florida drama would be *chef’s kiss* for press.",
                                            "score": 17,
                                            "author": "VogonSlamPoet42",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "If you are gonna go that direction, might as well go with the book plot. It's way darker and in the public domain. \n\nOne of the love interests even &gt;!chooses to save the goat instead of Esmeralda.!&lt; 😮\n\nhttps://en.wikipedia.org/wiki/The_Hunchback_of_Notre-Dame",
                                                    "score": 6,
                                                    "author": "louploupgalroux",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I mean, the stage musical has more in common with the book, so they could just go with that!",
                                                            "score": 2,
                                                            "author": "MrsMaiselsBrisket"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "The King and I remake was PG -13, I think. They could do it like that if they had the guts.",
                                            "score": 4,
                                            "author": "EastwoodBrews"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "All they'd have to do is have Quasimodo played by [Idris Elba](https://www.youtube.com/watch?v=TUABYUuX84I)",
                                            "score": 2,
                                            "author": "Bezbozny"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Make Atlantis now it would be amazing seeing the under water scenes.",
                            "score": 31,
                            "author": "justhereforthehumor",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The underwater scenes in the Little Mermaid has been widely panned for being too dark and dull. What makes you think it'll be any different for an Atlantis movie?",
                                    "score": 8,
                                    "author": "-boozypanda"
                                },
                                {
                                    "level": 3,
                                    "comment": "These are legitimately the first two live action remake ideas that I actually like.",
                                    "score": 12,
                                    "author": "JRansomBioDermKiller"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "IMDb says the live action Hunchback is expected July 19, 2024",
                            "score": 4,
                            "author": "Hup110516",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; IMDb says the live action Hunchback is expected July 19, 2024\n\nIMDb is also user edited, so anything there that hasn't been officially announced should be taken with a grain of salt",
                                    "score": 9,
                                    "author": "Lint6"
                                },
                                {
                                    "level": 3,
                                    "comment": "As I understand it, back in 2019 there was a hoax going around with that date and the media ran with it. The listed actors and music director said they had no idea about any project.\n\nDisney has some TBA slots announced for 2024, but we have no idea what those are. Hunchback isn't listed on the schedule. 🤷‍♂️",
                                    "score": 4,
                                    "author": "louploupgalroux"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I am hoping they don't do it. They will tone down Frollo which defeats the fact that he is arguably the best Disney villain due to how realistic he is. (I read they were changing the lyrics to Poor unfortunate souls, so if their radar picked that, I doubt Frollo would go untouched)",
                            "score": 3,
                            "author": "pmgbove"
                        },
                        {
                            "level": 2,
                            "comment": "There are already quite a few live-action hunchback movies already in existence.",
                            "score": 2,
                            "author": "HappyHarry-HardOn"
                        },
                        {
                            "level": 2,
                            "comment": "I assume the other one that they've had to talk executives off the ledge with is Pocahontas...",
                            "score": 2,
                            "author": "Idellentr"
                        },
                        {
                            "level": 2,
                            "comment": "Big W here. Hellfire is my favorite Disney villain song. He's so evil",
                            "score": 2,
                            "author": "CheeseWarrior17"
                        },
                        {
                            "level": 2,
                            "comment": "Oh I hope they do, cause another casting controversy and we can bring out the Simpsons joke The Blunch Black of Blotre Blame",
                            "score": 3,
                            "author": "Shimakaze81"
                        },
                        {
                            "level": 2,
                            "comment": "They’ll eventually have to do Song of the South if they want to stay in Florida.",
                            "score": 3,
                            "author": "Velenah42"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'll rewatch the hell out of a live action Black Cauldron.",
                    "score": 7,
                    "author": "hopelessbrows"
                },
                {
                    "level": 1,
                    "comment": "Most of the others made a ton of money. They've started to not do as well now.",
                    "score": 2,
                    "author": "uuuiuuuw"
                },
                {
                    "level": 1,
                    "comment": "I will shit myself if they remake The Emperer’s New Groove , squeekity Squeek  squeaks sqeak",
                    "score": 4,
                    "author": "SmellMyFingerMel",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "agreed. it truly doesn’t matter. i honestly liked it. at the end of the day disney will keep pumping\nthem out.",
                    "score": 2,
                    "author": "captainyami21"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I remember being a kid and seeing the trailers for the original. The colors were so vivid, the sidekicks were cute rather than hyper realistic, and everything just looked so fresh and exciting! I couldn't wait to see it! The trailers for this version just didn't make the movie look nearly as exciting.",
            "score": 267,
            "author": "spinereader81",
            "replies": [
                {
                    "level": 1,
                    "comment": "It just seems like animation, which has always been their strength, is their strength. Weird!",
                    "score": 93,
                    "author": "WiserStudent557"
                },
                {
                    "level": 1,
                    "comment": "Yeah, the drained of all color trend in film is horrible.",
                    "score": 43,
                    "author": "snowgorilla13"
                },
                {
                    "level": 1,
                    "comment": "Yes when you compare the 'Part of your world' scenes the live action version is just so.. boring? Halles singing is great don't get me wrong but how the shots are set up etc.. it feels not as dynamic as the 89 version. I think that's true for the other remakes aswell.",
                    "score": 68,
                    "author": "summerchild__",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Honestly musical theater was the perfect vehicle for live action retelling of Disney movies. Lion King is legendary and so is Beauty and the Beast.",
                            "score": 35,
                            "author": "RA12220",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This is exactly the point my boyfriend and I made when discussing all these remakes. Take them to Broadway or something rather than do a live-action movie remake.",
                                    "score": 13,
                                    "author": "BucherundKaffee"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Saw a good analysis showing that although Halle has an incredible singing voice, she sings without that musical theatre touch which attaches an emotional investment. \n\nTo be exact, the example I saw used the \"one day I'll be\" line, which Halle sings in a manner which shows off her vocal range, but in the original it's sung with a melancholy that lands more powerfully with the viewer. The old Disney movies were always careful to get the \"I want\" songs right, and by not making Halle's \"I want song\" an emotional experience you just don't feel the same investment in her character as in the originals.",
                            "score": 37,
                            "author": "Jackmcmac1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Respectfully I disagree. I saw the movie in theater and felt her painful longing through her acting and voice.\nI think this is a subjective thing, and one can’t make a blanket statement saying “no one feels anything when she sings” because I certainly did.",
                                    "score": 6,
                                    "author": "fjgfjudvjudvj",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I respect your difference of opinion and am glad you enjoyed the movie",
                                            "score": 12,
                                            "author": "Jackmcmac1"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "This is very subjective",
                                    "score": 3,
                                    "author": "rumpumposh"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is the exact feeling I have with all the remakes. As a kid, I would’ve loved to see the cartoons done in cinema. I was OBSESSED with The Lion King. I made my family take me to the theater 8x to watch it as a child. When I heard they were making a movie I almost shat myself. Then I watched it and shat myself at how awful it was. Haven’t bothered with any of these films. They feel like petty cash grabs. The Little Mermaid was my second favorite and the washed out colors….was a very strange choice. It looks like Lifetime produced it.",
                    "score": 4,
                    "author": "junhatesyou"
                },
                {
                    "level": 1,
                    "comment": "My theory is that this movie did so well at the start because of the diversity.  Because little black girls wanted to see someone like them as a disney princess.  But beyond that it's as uninteresting as any of the other live action remakes and not anything actually worth watching because the original was all that was ever needed.",
                    "score": 3,
                    "author": "meatball77",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I just went this weekend with my 5 year old. She took no interest in watching the cartoon version. My oldest daughter said it’s because it’s too “flat and old looking”.   \n\nIn the theater I was surprised there was no children beside mine. It was a lot of adult Black women. \n\nI’m mixed, Black/Asian. I enjoyed it for the most part. I liked the slight expansion of the story line to make it all fit together. \n\nMy 5 year was engaged in the beginning, lost interest during the courting, but the Shuttle Butt song pulled her back in. \n\nShe came home and wanted to see the cartoon version or what she calls the “real one” because it’s the original. She  lost interest pretty quick. \n\nI don’t think it’s dark and dreary no more than the original. Heck going back I was shocked Ursula calls her a “little tramp” in the cartoon because my 5 year old picked it that real quick.\n\nThe live action for the most part stayed to the script of the original. \n\nI think Disney needed to modernize The Little Mermaid with better graphics. Was the live action necessary? No. However I am glad they did take the risk. \n\nComing from a time as a little girl where seeing Black characters much less toy dolls representation - this was a sense of “finally” kind of feeling. My real life mermaid as a kid was Darryl Hannah. Omg I would have loved to see an Asian or Black woman as a “live action”.    At age 45 I finally got to see it. Which is pretty cool- esp when my daughter can say “mommy there’s a mermaid like Grandma when she was young” (referring to Asian) and also seeing one like herself.  \n\nI hope people give it a chance and watch it rather than shut it down.",
                            "score": 2,
                            "author": "Greedy_Wolverine4184",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I saw it this weekend with my kids and they loved it. I thought it was fine, the original is near and dear to me since we had a VHS of it growing up and used to watch it constantly. This version had a different vibe, it seemed a little less fun to me. Halle did justice to the music though, she sang the songs beautifully.",
                    "score": 15,
                    "author": "TeaEarlGrayHotSauce"
                },
                {
                    "level": 1,
                    "comment": "This one did look dark and dreary! Not light and airy.",
                    "score": 2,
                    "author": "PlantedinCA"
                },
                {
                    "level": 1,
                    "comment": "I mean, one is a cartoon with exaggerated everything and one is live action trying to be more “real”.  There’s gonna be a significant visual difference.",
                    "score": 0,
                    "author": "Filmmagician"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm wondering if it's just too many dropped too quickly. I now see stories about planned live-action remakes of animated movies and I'm really not interested.",
            "score": 110,
            "author": "SmittyFjordmanjensen",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'd be interested if I really enjoyed a single one.\n\nThough I will say, I would love a quality Treasure Planet live action movie. That could be dope as hell",
                    "score": 57,
                    "author": "SevroAuShitTalker",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Or a live action Atlantis",
                            "score": 20,
                            "author": "Zachariot88",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "A live action Atlantis that’s a little more serious and geared at the adults who saw the original cartoon film would be cool but idk these live actions have not been appealing at all to me",
                                    "score": 20,
                                    "author": "PrisonSlides",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Atlantis deserves an actual all out, Avatar-esque scifi live action.",
                                    "score": 4,
                                    "author": "party_tortoise"
                                },
                                {
                                    "level": 3,
                                    "comment": "That’s a role Tom Holland would actually be great for",
                                    "score": 3,
                                    "author": "DoublePelix"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Would you be more interested in a brand new, original Disney princess?",
                    "score": 12,
                    "author": "midnight_toker22",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Disney did too many, too fast. They have been coming out like every year. They seem to be milking their IP and not doing anything new. Everyone is bored.",
            "score": 12,
            "author": "PlantedinCA"
        },
        {
            "level": 0,
            "comment": "This movies are supposed to be for kids, but kids need bright colours and stuff, not almost a soap opera built...",
            "score": 65,
            "author": "BaronZeroX",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think you’re thinking of the first trailer. \n\n[The movie got much better with color grading in post production](https://pbs.twimg.com/media/FtnI4LhXgBg2Vcn?format=jpg&amp;name=large)\n\n[A lot better](https://hips.hearstapps.com/hmg-prod/images/tlm-stills-request-04-4k-rec709-20230320-646f6e2998ca2.jpg)",
                    "score": 4,
                    "author": "NickRomanovf",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ohhh well I'm just based on what cousin told me he took kids to the movie none of them saw half the movie",
                            "score": 2,
                            "author": "BaronZeroX"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Has anything ever been good for the live action remakes? The best they usually get is a “passable” and I don’t know anyone who has seem them more than once.",
            "score": 7,
            "author": "-tobi-kadachi-"
        },
        {
            "level": 0,
            "comment": "Good. Stop making them. Lol. So many fairytale from so many countries to draw inspiration from. Go back to animation for a kick.",
            "score": 73,
            "author": "CozmicBunni",
            "replies": [
                {
                    "level": 1,
                    "comment": "They litteraly release animated movies that are mostly original stories every year: Wish, Elemental, Strange World, Red Alert, Encanto, Coco, Luca, Raya And The Last Dragon, Soul, Onward, Zootopia…",
                    "score": 15,
                    "author": "Spellambrose",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Onward, Luca, Coco, Elemental, Soul and Turning Red are all made by Pixar the company that is there to make the animated films. \n\nSo the only ones in that list Disney made themselves are: Wish, Zootopia, Strange World, Encanto and The last dragon. \n\nThat’s 5 movies in 7 years at an average of 1 movie every 17 months.",
                            "score": 10,
                            "author": "International_Car586",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "But the Pixar Animation Studios, (which are not the only studio in charge of the animated movies btw) are part of the Disney company, just as much as the Walt Disney Animation Studios.\n\nAnd if they’re specifically talking about the Walt Disney Animation Studios:\n\nThat’s a movie every year if we count the sequels (Frozen II, Ralph Breaks The Internet) with most of them still being originals.\n\nOne movie per year is pretty standard for an animation studio and that has been their way of doing for decades including the 90s golden era. They didn’t slow down because of the live-action versions. These remakes are not being made instead of animated movies. Live-action and animation co-exist at Disney since basically forever.\n\nSo I don’t see the point of saying \"go back to animation\" as if they gave it up so they could focus of live-action remakes, when they absolutely did not. It’s just that there is a new trend of remakes among the live-action movies. But it doesn’t have any impact on the animated movies. These kind of snarky/gotcha remarks topically come from people who complain about something they know nothing about.",
                                    "score": 7,
                                    "author": "Spellambrose",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don’t care for the live action remakes. The live action spins off like Malevolent (probably not the right title) was very entertaining",
            "score": 5,
            "author": "greenneckxj",
            "replies": []
        },
        {
            "level": 0,
            "comment": "They'll keep making them because they don't know how to do anything else at this point.  Creativity and effort is anathema to today's Hollywood.  \n\nDon't get me wrong, there are bright spots among the skid marks of Hollywoods underwear, but the vast majority of its output is as mindless as its lack of creativity.",
            "score": 79,
            "author": "Homo-Boglimus",
            "replies": [
                {
                    "level": 1,
                    "comment": "I feel like movies are just declining in pop culture. It seems most of the prestigious stories and acting is found in TV these days. All the effort is going there, and films are being phoned in.",
                    "score": 20,
                    "author": "Poeafoe",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "The idea that Hollywood is out of ideas is a stupid idea. It’s spread like some “gotcha” comment by internet people and it’s not based in any reality. \n\nHollywood today, right now, currently, is sitting on a treasure trove of great idea. On every desk and computer in every studio are brilliant scripts — ideas. Lower level people within the walls talk about these scripts. They’re Black List winners, context winner, bold concepts from young writers and passion projects from big name directors. \n\nWe’re talking about epic war dramas, period pieces, romantic comedies, buddy comedies, queer love stories, dark thrillers — practically every brilliant concept imagined under the sun. \n\nEnd of the day, Hollywood is a business. Their raison d’être is to make money and job security. And job security is tied to making money. If you produce a film that bombs, there’s a good chance you’re getting axed. Or you’re going to have a helluva hard time making another one. \n\nPeople don’t go to movies anymore. They’re not the cultural phenomena that they used to be. At least not in scale, and definitely not for the “good ones.” \n\nLook at the list of last year’s academy nominees for best picture. Everything Everywhere, Banshees, Tár, etc. Few broke $100 million box office. Many didn’t break $50 million. \n\nAnd despite being smaller productions, movies never cost more to make. So ROI is slim. \n\nHollywood isn’t out of ideas. With increased free time and global artists and ubiquitous technology, there are more people writing “good ideas” than ever. \n\nBut Hollywood sticks to remakes, sequels, and existing IP (video games and books and such) because it’s guaranteed box office. Guaran-fucking-teed. \n\nIf Banshees of Inisherin made $300 million dollars, you’d see a never ending deluge of facsimiles trying to capitalize on that good, original idea. But Banshees didn’t make a lot of money. Avatar did. Disney live actions did. Marvel did. \n\nAnd Hollywood, despite being famous for movies, is still behind TV production. Television series have never been better. From Mad Men and Sopranos of yesteryear, to The Bear and Succession of today. That’s Hollywood. Behind good ideas. \n\nThe difference is that they are going where people are: on their couch. \n\nWhy risk an indie crime thriller or bloated-budget war piece about something obscure about the Siege of Malta when you can just churn out remakes and existing IP to guarantee box office, and simultaneously create prestige television to capture audiences in their homes? \n\nThis is rant worthy. And I apologize. But the idea that Hollywood is out of ideas is false. They have access to unknown writers everywhere from Newark to Buenos Aires. They have thousands of brilliant scripts collecting dust in their offices. They have access to signed and established directors/writers/actors who have their own brilliant scripts that they’ve been working on for years. There are more accessible ideas than ever. \n\nBut, to beat a dead horse, you don’t go to theaters. Not YOU. Maybe YOU do. But people don’t. At least not for the “good ideas.” But they sure as shit will go when Thor or a video game character is on screen. \n\nThat’s why there are fewer good movies made from good ideas. People don’t go see them, thus they don’t make money, thus they don’t have a large ROI even when they do have moderate success, they they don’t get made. \n\nHollywood is risk averse. Not because they’re out of ideas. But because missing on a “good idea” financially could sink a company or sink a career.",
                    "score": 42,
                    "author": "giro_di_dante",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is the correct answer. Hollywood isn't out of ideas. Hollywood can't reliably *sell* ideas. Not on the big screen, anyway. The reason why Hollywood sells big, loud and dumb as a bag of hammers is because there is a large component of the audience that does not care how dumb the script is so long as it's big and loud. Also, the foreign box office is more and more important, and \"smart\" is, quite literally, more difficult to translate. Also, the people who do want smart scripts don't go to movie theaters. They stay home and watch HBO.\n\nThis isn't hyperbole, or some kind of smart-aleck statement about moviemaking. No, HBO has deliberately cultivated an audience that likes its scripts engaging and complex. They've taken on loss leaders like *The Wire*, which was never watched particularly heavily, just to establish their brand. When shows like *Game of Thrones* start looking really loud and stupid, their showrunners get shitcanned. By contrast, *Transformers: Revenge of the Fallen* was known in advance to have no script, was known in advance to be directed by a guy who did not know, nor care, what story he told, and was specifically advertised on the basis of how many hard drives they melted to render the CGI. Everyone knew that this would be two-and-a-half hours of your brain being reduced to tapioca as Michael Bay's unvarnished id splooged itself across the screen.\n\nAnd *Transformers: Revenge of the Fallen* still made $400m domestic, and over $800m once you counted the overseas box office, rentals and video sales. Hollywood sells what people want to buy. And as much as people keep saying that they'd like to see big, bold, smartly written stuff on the big screen, our behavior says we are perfectly willing to watch robots appropriate cultures that don't even exist, so long as they also smash each other up in big and loud ways.",
                            "score": 14,
                            "author": "RedditOfUnusualSize",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Couldn’t say it better. At the end of the day all studios exist to make money if they see one type of movie is making money they will make more movies like that.",
                                    "score": 5,
                                    "author": "RayenR61995"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yep. In the modern age of the internet they have more ideas that ever thought possible. They could hire a hundred people off Twitter to deliver them a hundred original ideas by the end of the week and in 10 minutes work have a 1,000 original ideas in a week. Hollywood is not in the business of original ideas, they are in the business of money. They fund what the demand is.",
                            "score": 8,
                            "author": "Asplashofwater"
                        },
                        {
                            "level": 2,
                            "comment": "&gt; Avatar did. Disney live actions did. Marvel did. \\[make money\\]\n\nBut did it though? With specific emphasis on Disney live actions? Seems to me that the main topic of the thread is that the Little Mermaid may actually end up losing them money. And they're burning through trust in existing IP faster than a M1 Abrams burns fuel. Just look at the drop in returns on SW. \n\nAlso, just looked it up, EEAAO apparently earned 10 times its budget. Not sure what pays off more.",
                            "score": 6,
                            "author": "Draugdur",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "High quality tangent. Thank you for sharing.",
                            "score": 2,
                            "author": "epidemicsaints"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I dunno.. Encanto was pretty good, and totally fresh.",
                    "score": 6,
                    "author": "nsfwtttt"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Disney made the mistake of just remaking movies as live action versions and not rethinking them. \n\nMoney is bad",
            "score": 34,
            "author": "zorbathegrate",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same with Pixar. Every movie of there's feels like a carbon copy and they've become so mawkish.",
                    "score": 13,
                    "author": "nevereatpears"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why is every article about this movie either saying it’s a total box office flop OR that it’s taking in unprecedented amounts?",
            "score": 19,
            "author": "newtoreddir",
            "replies": [
                {
                    "level": 1,
                    "comment": "Because this movie has been unnecessarily politicized so now any reporting on it has a bias and should be taken with a large grain of salt.\n\nI’ve not seen the film, but I assume like the couple Disney live action movies I’ve seen it’s too long, uninventive, and can’t decide whether it wants to be for kids or for adults trying to relive their childhood. \n\nI bet the movie is mediocre but not terrible, and thus it’s probably making meh money.",
                    "score": 7,
                    "author": "TheGreekMachine",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I actually thought it was pretty good for a Disney live action, and honestly one of the better ones. I wasn’t super overly impressed with everything, and it felt the tiniest bit long, and some of the cgi is wonky sometimes or merpeople just look kinda awkward as fuck while halfway out of the water, but those were small things and I ignored them and enjoyed the movie. I wish it wasn’t this politicized because I’d honestly consider seeing it a second time.\n\nI will say though that it’s absolutely not a kids movie/kid friendly length. It’s meant for millennials that wanted something a bit more tangible than the original animated film.",
                            "score": 2,
                            "author": "MrThorntonReed"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "They say \"horrible,\" I say \"wake-up call.\"\n\nThey can't coast on these anymore. They go in with the misconception that live-action is inherently better than animation, and create these bloated, colorless messes.\n\nThere certainly was vote brigading on this film, but if they had made a better movie to begin with, and if the trailers were better, they still could have come out ahead.",
            "score": 4,
            "author": "square3481"
        },
        {
            "level": 0,
            "comment": "Stop doing them. Nobody wanted any of them. The beast, lion king, Aladdin …",
            "score": 31,
            "author": "finalattack123",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I dunno… maybe… write new movies instead of filming the same ones over and over? \n\nBut what do I know.",
            "score": 14,
            "author": "-Gramsci-",
            "replies": []
        },
        {
            "level": 0,
            "comment": "No one ever asked for live action remakes.",
            "score": 14,
            "author": "Technicolor_Reindeer"
        },
        {
            "level": 0,
            "comment": "I’d love them to stop making these remakes. I’m gonna see little mermaid but the clips I’ve seen it looks absolutely joyless.",
            "score": 16,
            "author": "Musicaltheaterthrow"
        },
        {
            "level": 0,
            "comment": "Good, let this trend die. These live action remakes end up robbing the magic of the originals.",
            "score": 18,
            "author": "Brown_Panther-"
        },
        {
            "level": 0,
            "comment": "Can we just stop with the live action remakes. They are all terrible.",
            "score": 8,
            "author": "keving691"
        },
        {
            "level": 0,
            "comment": "My daughter loves the little mermaid and this movie just didn’t hit the mark. Aerial in the cartoon was infatuated with Eric, and was a complete teenage girl in her boy crazed/obsession. There just didn’t seem to be any chemistry in the live remake. It seemed she was more interested in the human world and exploring more than she was into Eric.I felt this way about Aladdin too, the passion between the characters just wasn’t there in the live remakes.",
            "score": 33,
            "author": "dstar-dstar",
            "replies": []
        },
        {
            "level": 0,
            "comment": "And yet all the ~~bribed~~ _genuine and heartfelt_ professional critics tried so hard to give ~~simpering~~ _honest and insightful_ reviews to ~~astroturf~~ _critique and analyze_ this film’s clearly ~~cynical and pandering~~ _passionate and progressive_ artistic and casting choices.\n\nI knew as soon as Rotten Tomatoes locked down their fan review scores for this, we had a ~~dud~~ _timeless and exceptional_ movie on our hands.",
            "score": 27,
            "author": "nileism",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I’m surprised  there’s no water pun",
            "score": 3,
            "author": "MasterTeacher123"
        },
        {
            "level": 0,
            "comment": "Maybe Disney should be reconsidering Disney's live action remakes?  Like before they perpetrate them?",
            "score": 3,
            "author": "robreddity"
        },
        {
            "level": 0,
            "comment": "I am really tired of Disney live action remakes. They pale in comparison to the original Disney animations.",
            "score": 3,
            "author": "ItsMichaelVegas"
        },
        {
            "level": 0,
            "comment": "I'll just never forgive Disney for deviating from the source material.  \n\n\nThe Little Mermaid I grew up with, she died at the fucking end lol",
            "score": 3,
            "author": "SmoothSlavperator"
        },
        {
            "level": 0,
            "comment": "Disney's live-action remakes are horrible.\n\nI don't give a shit about \"copy &amp; paste\" movies with a worse overall production with terrible CGI. Just give me new characters and stories in an animated movie. Hell, it can be live-action if they want it to. Just make new shit damn it!",
            "score": 3,
            "author": "Mrhappytrigers"
        },
        {
            "level": 0,
            "comment": "Length and I think Spider-Verse ripping through the box office.",
            "score": 3,
            "author": "WhoAllIll"
        },
        {
            "level": 0,
            "comment": "Idea everyone hated finally not making money",
            "score": 11,
            "author": "piratecheese13"
        },
        {
            "level": 0,
            "comment": "People heard the Scuttlebutt on YouTube and they don’t wanna make their ears bleed with a theater sound system.",
            "score": 11,
            "author": "Johnny_Menace",
            "replies": [
                {
                    "level": 1,
                    "comment": "Seriously. Who thought that song was a good idea",
                    "score": 7,
                    "author": "Maverick_Raptor"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This was never going to be a good film.",
            "score": 9,
            "author": "GoHawksMatt"
        },
        {
            "level": 0,
            "comment": "Ah, some good news at last.",
            "score": 13,
            "author": "ConfusedGrundstuck"
        },
        {
            "level": 0,
            "comment": "Are you kidding?  The live action Little Mermaid movie was so good I just had to watch the Annie remake.\n\n**SAID NOBODY EVER.**",
            "score": 17,
            "author": "Ice_Pirates"
        },
        {
            "level": 0,
            "comment": "Good fuck the live action bullshit cash grabs",
            "score": 5,
            "author": "couldjustbeanalt"
        },
        {
            "level": 0,
            "comment": "Well reactions on the movie are not super positive so not really surprised … Even if Halle seems to do a good job in it, it’s not gonna be enough ..",
            "score": 8,
            "author": "winterxsouth"
        },
        {
            "level": 0,
            "comment": "Disney just gonna write this off on their taxes",
            "score": 10,
            "author": "Realhoodjesus",
            "replies": [
                {
                    "level": 1,
                    "comment": "You don't even know what a write off is.",
                    "score": 3,
                    "author": "Pluckt007"
                }
            ]
        },
        {
            "level": 0,
            "comment": "There was a lot not to like about the movie... and that's ignoring the elephant in the room that nobody wants to address",
            "score": 11,
            "author": "Chr1s78987x",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was going to add to that. But I don’t feel like being banned because of Reddits sensitive censorship",
                    "score": 9,
                    "author": "LayneCobain95"
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Disney is out of ideas.",
            "score": 5,
            "author": "DoublePelix"
        },
        {
            "level": 0,
            "comment": "I am glad Disney was not in charge of making Dune.",
            "score": 3,
            "author": "Cerlog"
        },
        {
            "level": 0,
            "comment": "We’re letting Disney off the creative hook with these remakes anyway.",
            "score": 2,
            "author": "Ozzloh"
        },
        {
            "level": 0,
            "comment": "The genre is silly. Animation allows for the fantastical to be enjoyed without suspending disbelief. Live action just has you looking for the ridiculous.",
            "score": 2,
            "author": "whyreadthis2035"
        },
        {
            "level": 0,
            "comment": "Disney is loosing their touch",
            "score": 2,
            "author": "Worth-Environment-13"
        },
        {
            "level": 0,
            "comment": "Also kids like cartoon movies because they’re colorful, a live action movie will not be able to hold the attention of children",
            "score": 2,
            "author": "item_raja69"
        },
        {
            "level": 0,
            "comment": "I mean it did come out around the time of Fast X, and then spiderverse came out (spiderverse I feel is a vastly superior film, even though the runtime is about the same as Little Mermaid it never felt that long)",
            "score": 2,
            "author": "Razmatazzer"
        },
        {
            "level": 0,
            "comment": "Disney needs to figure out how to make these movies' runtimes shorter. Mermaid, Lightyear, Strange World... they all seem to suffer from this issue. Hopefully they can crack the code on this",
            "score": 2,
            "author": "smeerzye"
        },
        {
            "level": 0,
            "comment": "All I can hope for is that major studios like Disney decide that taking risks is okay. Audiences are getting fatigue from remakes of movies that came out in their lifetimes, endless sequels and the same Superhero movie over and over again.\n\nI am an avid movie watcher, I studied film in school and I'm a huge nerd. I used to go to the movies at least a couple times a month. Now, I hesitate going to the movies unless I know it's going to be something truly remarkable.",
            "score": 2,
            "author": "r3d_ra1n"
        },
        {
            "level": 0,
            "comment": "We don’t want live action remakes. All of Hollywood is just a remake factory. Let’s get original stories and original characters",
            "score": 2,
            "author": "BearsFan8523"
        },
        {
            "level": 0,
            "comment": "So, great for movies goers then?",
            "score": 7,
            "author": "mr_britten"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 11,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I just think it's time for something to change in Hollywood. Casting diverse actors and actresses doesn't excuse not coming up with new ideas anymore and just remaking everything you've already done. Making original movies needs to become less of a risk for studios or studios need to start ignoring the risk on behalf of the viewer.",
            "score": 4,
            "author": "RealJonathanBronco"
        },
        {
            "level": 0,
            "comment": "Spider-Man was released that weekend… no wonder it dropped",
            "score": 3,
            "author": "captain_poptart"
        },
        {
            "level": 0,
            "comment": "Good to hear that",
            "score": 3,
            "author": "GroundbreakingCrew99"
        },
        {
            "level": 0,
            "comment": "Oh no, not those poor Disney Live-Action remakes!",
            "score": 3,
            "author": "fanboy_killer"
        },
        {
            "level": 0,
            "comment": "The sea life didn’t play instruments in Under the Sea, Eric had an unnecessary solo song, Ariel “sings in her head” while mute, there was no cook scene trying to kill Sebastian and there’s a new scuttlebutt song so awkwafina can rap… \n\nI actually liked the scuttlebutt rap but the rest of the changes were totally unnecessary and should’ve stayed on the cutting room floor.   \n\nOTHERWISE… they did Ursula well.  I was really nervous they’d take a different approach to that character but it was REALLY close to original and I appreciated that.  Ursula is just a character that didn’t need anything to perfect it.  Good job, Melissa McCarthy on that one! \n\nHalle was a very cute version of Ariel - she did well I feel with what she got.  Eric was a dud, tho. \n\nBut Javier Bardem as King Tritan?  Lord knows I’ve grown up since seeing the original cartoon because damn… he could make more than the ocean wet!   He was definitely my favorite character.",
            "score": 3,
            "author": "LittlePlasticStar"
        },
        {
            "level": 0,
            "comment": "I wish people would stop citing racism for everything, they're being too generous to the amount of racists in america, besides, if you want to base it off of racists only not seeing the movie, everyone else seeing it should have made it a box office blockbuster, sometimes people just think it's a bad movie, stop making excuses...",
            "score": 3,
            "author": "DANAP126"
        },
        {
            "level": 0,
            "comment": "Why she black ?",
            "score": 9,
            "author": "Sea_Knowledge8574",
            "replies": []
        },
        {
            "level": 0,
            "comment": "My 5 year loved this movie. Just saying.",
            "score": 4,
            "author": "PeachesPeachesPeachs"
        },
        {
            "level": 0,
            "comment": " Should have went with **Halley Berry** instead",
            "score": 3,
            "author": "citoloco",
            "replies": []
        },
        {
            "level": 0,
            "comment": "If you had to listen to “Scuttlebutt” before you saw the movie, you wouldn’t see the movie.  The singing is a violation of the Geneva Convention.  However, Ursula crushed it, so there’s that.",
            "score": 3,
            "author": "Valgar_Gaming"
        },
        {
            "level": 0,
            "comment": "I haven’t liked any of the live action Disney movies. Disney needs to stop going back to the well and hire (and pay) good writers for new creative IP.",
            "score": 2,
            "author": "OhHelloJason"
        },
        {
            "level": 0,
            "comment": "Did pinnichio even have a box office release?",
            "score": 2,
            "author": "horsepuncher"
        },
        {
            "level": 0,
            "comment": "they don’t know their audience anymore. not only are these films far too long for a child to sit through, but they are far too focused on the movies looking so polished that they become boring. not only did we see this in movies like the lion king, but i saw the same thing in this one. i 100% blame the director, i don’t blame halle, because i noticed the same thing in other characters, specifically the mermaids, but it looks as if she’s constantly posing for the camera, to the point where it completely overshadows any acting. it feels like the characters are aware of the camera which completely takes you out of it. the reason why the original movies, specifically the early 2d ones were so successful was because they were fun. these are dull and uncreative.",
            "score": 2,
            "author": "brewhoneymilk"
        },
        {
            "level": 0,
            "comment": "Besides the runtime maybe it’s just not good? Disney has other movies that have a long run time but we’re successful (anyone remember Fantasia?) Some movies start off strong on reputation or franchise alone, but, once enough people cycle through and share their opinion(s) movies either pick up in interest or they lag.",
            "score": 2,
            "author": "roxywalker"
        },
        {
            "level": 0,
            "comment": "I never was interested in any live action remakes.",
            "score": 2,
            "author": "AtuinTurtle"
        },
        {
            "level": 0,
            "comment": "I know ones perspective isn’t an indication  of how well something is doing. But I saw it this weekend and almost every theater seat was sold out.  No joke.  And that’s on its second week.",
            "score": 2,
            "author": "Odd_Cake3759"
        },
        {
            "level": 0,
            "comment": "Good, please stop",
            "score": 2,
            "author": "Zahn91"
        },
        {
            "level": 0,
            "comment": "Just like the Star Wars pre-quels, there will be loud adults for years to come about how they hate the remakes. While kids today will grow up loving them as a part of their childhood. Let’s be honest, most kids that are the target audience don’t use Reddit or Facebook. They won’t realize the importance or lack of it of these movies until they grow up.",
            "score": 2,
            "author": "medusasfury71"
        },
        {
            "level": 0,
            "comment": "It couldn't really compete with both Super Mario and SpiderVerse releasing close together. Between the two films, it probably ate up the biggest chunk of audiences, namely kids and POC.",
            "score": 2,
            "author": "StressedCatAbbu"
        },
        {
            "level": 0,
            "comment": "Screenrant is...objectively wrong on this one\n\nTLM's drop was average at worst. Marginally worse than Aladdin, but a smaller drop percentage wise than The Lion King. The International opening was weak, but legs are looking decent in every market except China and Korea. \n\nThe movie is performing in a way that is, at worst, average domestically and a little disappointing internationally. it will end up somewhere around $600M World wide, which would have been an outright success had it not been for the added costs of reshooting with COVID restrictions",
            "score": 3,
            "author": "not_a_flying_toy_"
        }
    ]
}