{
    "id": "143i1up",
    "score": 0,
    "title": "Michael Cieply: Will A Long Writers Strike Sideline Hollywood In The Culture Wars?",
    "author": "Neo2199",
    "date": 1686155772.0,
    "url": "https://www.reddit.com/r/entertainment/comments/143i1up",
    "media_urls": [
        "https://deadline.com/2023/06/long-writers-strike-sideline-hollywood-culture-wars-commentary-michael-cieply-1235383145/"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "&gt; But having intensively covered two prior such strikes, in 1988 and in 2007, **I’ll risk one modest observation about the current conflict: If it continues as at present for another few months, it will begin to shift the cultural balance of power.**\n\n&gt; **In the past, at least in the modern era, Hollywood’s labor wars haven’t had much bearing on the socio-political life of the country as a whole.** Whether guild writers plied their craft or sat out for five months, George Herbert Walker Bush was going to bury Michael Dukakis in the presidential election of 1988; that’s how the current was running.\n\n&gt; Indeed, **it was only post-Trump, with the election of 2016, that many movies, much series television and most late-night talk became noticeably aligned (with some exceptions, say, Gutfeld! or Real Time with Bill Maher) with a progressive point of view** that is as proudly on display in this year’s pro-gun control season finale of Law &amp; Order as in the films or Jay Roach and Adam McKay or the monologues of John Oliver and Jimmy Kimmel.\n\n\n&gt; **Contemporary Hollywood is a powerful, vocal, left-leaning cultural and political force. The Oscars and Emmys annually underscore its core beliefs.** Jane Fonda, with her recently expressed notions about climate, patriarchy and racism, is more rule than exception.\n\n\n&gt; **But most of it requires writers, who, for the moment, aren’t writing.**",
            "score": 2,
            "author": "Neo2199"
        }
    ]
}