{
    "id": "143ojcm",
    "score": 465,
    "title": "Tom Holland Announces ‘I’m Taking a Year Off’ Due to Brutal ‘Crowded Room’ Shoot: ‘The Show Did Break Me’",
    "author": "DemiFiendRSA",
    "date": 1686170908.0,
    "url": "https://www.reddit.com/r/entertainment/comments/143ojcm",
    "media_urls": [
        "https://variety.com/2023/film/news/tom-holland-acting-break-one-year-crowded-room-1235636278/"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Imagine being wealthy enough to take an *entire year* off of working, and being so in-demand that you know you can start making absolutely insane amounts of money again whenever you're ready to get back to it.\n\nGod that would be amazing.  Good for you Tom -- I hope you have a hell of a year.",
            "score": 92,
            "author": "Vanish_7",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ikr, some people really out here living life. While the rest of us morons go back to the mines!",
                    "score": 27,
                    "author": "Dipsi1010"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wish I could take a year off from work..",
            "score": 206,
            "author": "chgd1767",
            "replies": [
                {
                    "level": 1,
                    "comment": "Have you tried being Spider-Man?",
                    "score": 92,
                    "author": "WorldsWeakestMan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Have you tried working for a tech company? My vacation started on February 1st!",
                            "score": 28,
                            "author": "proscriptus",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Put me on",
                                    "score": 5,
                                    "author": "NendoroidAshe"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "you could if you’re successful enough",
                    "score": -17,
                    "author": "Homedelivery27",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "*rich enough",
                            "score": 38,
                            "author": "MethodEater",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Which is weird considering he’s among the poorest heroes",
                                    "score": 2,
                                    "author": "RBVegabond"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sucks that he put so much effort into this show, only for it to be shit.\n\nHe clearly wants to be taken more seriously as an actor, but he/his agent keep picking the wrong projects to branch out with. Maybe A24 has some coming projects that he'd be good in?",
            "score": 176,
            "author": "ExtensionLemon-47",
            "replies": [
                {
                    "level": 1,
                    "comment": "He’s too thirsty and looking for classic Oscar/Emmy bait “drah-ma-tique” roles where he thinks he can get praise for doing the “most” acting. He should be trying to play into his strengths as an actor and look for something totally out of left field to wow the critics, rather than just showing how much he can suffer on screen.",
                    "score": 148,
                    "author": "newtoreddir",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think you’re right I thought he was really good in that church movie",
                            "score": 45,
                            "author": "Entire-Salamander-88",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The one with batman in it? Yeah that was pretty decent",
                                    "score": 35,
                                    "author": "Leavingtheecstasy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The Devil All the Time",
                                            "score": 33,
                                            "author": "woljifjefto"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Not my Batman",
                                            "score": -20,
                                            "author": "Entire-Salamander-88",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Not a good opinion*",
                                                    "score": 9,
                                                    "author": "DeMonstaMan"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "There will be blood, wow, that was Tom Holland?!",
                                    "score": 5,
                                    "author": "Bright_Ad_113",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Not sure if you’re being sarcastic, but just in case, no.",
                                            "score": 5,
                                            "author": "pugofthewildfrontier",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yes,\nSarcasm.",
                                                    "score": 3,
                                                    "author": "Bright_Ad_113"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I he's talking about Spider-Man 3, I didn't even recognize Holland there",
                                            "score": 2,
                                            "author": "alepher"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I think going the Daniel Radcliffe route and getting totally unhinged roles would be great for him.",
                            "score": 12,
                            "author": "prettyfacebasketcase",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He’s got the action bonafides. He needs to find his Everything Everywhere All At Once.",
                                    "score": 4,
                                    "author": "newtoreddir"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "If that’s his goal, then at this point he should just try and go for working with established directors like Scorsese, Spielberg, Aster, Peele etc.",
                            "score": 6,
                            "author": "OutLiving",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Scorsese don't choose big actors just because they are big...\n\nAs far as I know, he is very very selective...\nBut once the actor is in his project even for a small role, he will cast that actor again...\n\nLike Jesse plemons...",
                                    "score": 5,
                                    "author": "newredditwhoisthis",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Jonah Hill was willing to star in Wolf of Wall Street for free. He simply wanted to work with Scorsese. \n\nHolland definitely has the money to do something similar.",
                                            "score": 5,
                                            "author": "SpaceMyopia",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "if tom was smart he would do that, instead he’s out there spouting off about how scorcese has never made a marvel film so how would he know blah blah. he needs. a new agent to get him into a diff headspace and make savvier choices",
                                                    "score": 4,
                                                    "author": "EdisonZoeyMarlo"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Which is why I said try and listed multiple directors, Scorsese and Spielberg are probably unlikely but it’s not impossible",
                                            "score": 2,
                                            "author": "OutLiving"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "He should go back to stage work. Non-Marvel movies aren't for everyone. Just like Marvel movies don't work with just any old actor.",
                                    "score": 3,
                                    "author": "Emperor_FranzJohnson"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "He also should've known better that working with shit directors and writers would get him less chance to be taken seriously because even if he's giving it all the projects are still shit",
                            "score": 8,
                            "author": "deemoorah"
                        },
                        {
                            "level": 2,
                            "comment": "yeah, he's doing a Copy+Paste of timothee chalamet, with a RDJ sized savings account. Actually, all of this generation's actors are doing it and it's getting old. \n\nHe has two more Spider-Men movies with a $20 mill per film contract. Glad he is throwing in the towel for a year, or more, because it's not working out. He has one cash cow, milk it and maybe go back to stage acting.",
                            "score": 2,
                            "author": "Emperor_FranzJohnson"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "At his stage of success, it’s almost certainly his manager making these calls, not him. Agents handle high volumes of talent, focusing on getting them as many auditions and jobs as possible. On the other hand, managers have a handful of clients at most, and spend more time weighing the pros and cons of a project and how it may affect the career of their client. Your agent is like an investor in you, your manager is like your investment broker.\n\nApple TV has had hit after hit on its shows lately, and TV has often proven the key to breaking an actor out of type. My guess is his manager told him it would be a good investment, and it didn’t work out. Sucks for him though, I don’t think he’s a bad actor at all.\n\n(I’m an actor with a film and tv agent, so this is my wheelhouse)",
                    "score": 5,
                    "author": "Sweeney_Toad"
                },
                {
                    "level": 1,
                    "comment": "How do you know it’s shit, it’s not out yet right?",
                    "score": 3,
                    "author": "Fireblasterman",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": -2,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "These 7 reviewers must be correct!",
                                    "score": 2,
                                    "author": "HammerJammer02",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 1,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Ofc which is why listening to like 7 meta critic reviews probably isn’t indicative of a lot",
                                                    "score": 1,
                                                    "author": "HammerJammer02",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 1,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "And I’m saying your answer makes little sense",
                                                                    "score": 0,
                                                                    "author": "HammerJammer02",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[deleted]",
                                                                            "score": 1,
                                                                            "author": "[deleted]",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "What makes little sense is that someone knows it’s shit because of a handful of early reviews.",
                                                                                    "score": 1,
                                                                                    "author": "HammerJammer02",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This was really not a good film to go after either. Seems like agents doing a favor to offload a stinker.",
                    "score": 1,
                    "author": "SpaceTabs"
                },
                {
                    "level": 1,
                    "comment": "He is a trash actor, what happened to real action actors of the 80s like Stallone &amp; sea gal",
                    "score": -15,
                    "author": "Debaser-IRK",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What happened? Seagal has been a talentless fat pos for 25 years. Fake martial arts, self titled “king of improv”. Widely regarded as the worst snl host in the shows history. Have you seen the clips of him running? The dude is a joke.",
                            "score": 2,
                            "author": "GalacticSalsa"
                        },
                        {
                            "level": 2,
                            "comment": "I’ve been watching Seagal for like 47 years",
                            "score": 1,
                            "author": "itsalwaysunnyinhell"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Tom Holland:\n\n&gt;“It was it was a tough time for sure. We were exploring certain emotions that I have definitely never experienced before, and then on top of that being a producer dealing with the day-to-day kind of problems that come with any film set added that extra level of pressure,” the actor said.\n\n&gt;“I love the learning curve of becoming a producer,” Tom continued. “I’m no stranger to hard work. I’ve always sort of lived by this idea that hard work is good work. I really enjoyed it, but then again, the show did break me. There did come a time where I was sort of like, ‘I need to have a break.’ I disappeared. I went to Mexico for a week and had some time on a beach. And I’m now taking a year off, and that is a result of how difficult this show was.”",
            "score": 37,
            "author": "DemiFiendRSA",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s easy to be cynical, but you’ve gotta feel for him here. Sounds like he bit off a tad more than he could chew. Between this and Euphoria, I can’t imagine he and Zendaya really enjoy talking about their work.",
                    "score": 6,
                    "author": "danielbauer1375"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I saw an actor roundtable interview where Evan Peters said something similar about playing Dahmer. It was kind of sad how tired and hollow he looked.",
            "score": 35,
            "author": "catsandnaps1028",
            "replies": [
                {
                    "level": 1,
                    "comment": "With Evan I could see it. \nThat show was a cash cow off the victims but it appears they knew it would get eyes so they did it anyway.\n\nThere was definitely no fun had on that set. They tried to take it as seriously as they could and not lend any humanizing factors to Dahmer, but it still felt wrong that they did the show anyway. It just seems like it should've never been made. \n\nThe guy who played him seems dead inside right now and for what? The show should receive no awards. Was it quality? Yeah I think it was. But it's tone deaf and the victims families are pissed about it. \n\nWho'd they do the show for? For lots of money. It's senseless art.",
                    "score": 37,
                    "author": "Leavingtheecstasy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Crowded Room is kind of similar in that many, many, many people with dissociative disorders as well as psychs and therapists were begging for years for them to not go through with the project (which adds heavy stigma to an already stigmatized and misunderstood mental health issue). \n\nI’m fine with it crashing and burning. Everyone involved was well aware that it could cause harm and nobody cared because $$$.",
                            "score": 7,
                            "author": "oogybob",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "So him and Zendaya are just good at producing projects about really messed up portrayal of mental health when they’re not doing Spider-Man?",
                                    "score": 6,
                                    "author": "lightningpresto"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The show did receive awards",
                            "score": 24,
                            "author": "DisneyDreams7"
                        },
                        {
                            "level": 2,
                            "comment": "U sound triggered",
                            "score": -15,
                            "author": "Debaser-IRK"
                        },
                        {
                            "level": 2,
                            "comment": "Then again a whole new generation and half the people around the world didn't know Dahmer or knew very little about him. Most people turn away if the headline says \"serial killer that ate people\" . That's enough for people to avoid looking further. But this show shed light on the victims, the circumstances of why it took so long to catch and convict him, and how Jeff was as a person. It's not just about his crimes. This is why you sympathize with the families of these victims now. Before this show, most people didn't know these families either. This happened over the span of a decade about 40 years ago. If people really wanted to know more about Dahmer and his victims, it has been available for public scrutiny for at least 20 years now. So this outcry from social media now, is a bit too late and virtue signaling in a tacky way. Jeffery Dahmer has been dead for years so he's not coming after anyone anymore. Evan Peters is just an actor playing him. He's not the real Dahmer but people want to put the blame on someone for retraumatizing a few family members. Did they ask for your attention and help before this show came out? No. Are they still asking for your attention? No. Why is it your concern now long after this show has ended? Evan can't talk about it anymore because it will hurt the families again? Did they tell him not to talk about it anymore? I'm sure they can't stop a discussion between colleagues about his experience on set. That's what they were all there for. People need to learn to separate reality from the characters the actors play. That's your problem not his or the families.",
                            "score": 0,
                            "author": "Roof-Substantial"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Vant blame him. If I had his kind of money I'd take a year off too",
            "score": 7,
            "author": "RedStar9117",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, I think a lot of us would take the opportunity to take a break after going through a tough work experience (whatever that work experience may be).\n\nETA: I’m not passing judgement on him for having the privilege to take the time off, I’m blaming the systems that don’t afford everyone the same privilege.",
                    "score": 4,
                    "author": "NippleFlicks",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ikr, i know several people who have had bad injuries or gotten mentally broken, but they just have to show up to work again. Otherwise they lose their job and home",
                            "score": 1,
                            "author": "Dipsi1010"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "An actor finally has to act and it “breaks” him.",
            "score": 19,
            "author": "Repulsive-Studio-120",
            "replies": [
                {
                    "level": 1,
                    "comment": "thank you for saying this..  this shit had me laughing..",
                    "score": 13,
                    "author": "yerfondofmebiscuits",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I worked in Hollywood for years and am so sick of this shit 😂",
                            "score": 8,
                            "author": "Repulsive-Studio-120",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "hollywood people are cut from a different cloth thats for sure my man.",
                                    "score": 5,
                                    "author": "yerfondofmebiscuits"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "He had to finally try a role that wasn't all, \"squeaky voiced quirky unassuming man\" and it just devastated his fragile ego lmao",
                    "score": 11,
                    "author": "Nanostreak"
                },
                {
                    "level": 1,
                    "comment": "He’s been in other movies before lol. That wasn’t acting in your mind? Why don’t you give those roles a try",
                    "score": 2,
                    "author": "HammerJammer02",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I would for sure! Have you tried acting?",
                            "score": 3,
                            "author": "Repulsive-Studio-120",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I haven’t, but I’m not the one claiming acting in marvel movies isn’t acting. If it were really that \n easy then way more people like me would be \n major parts of those movies. Curious how that isn’t the case…",
                                    "score": 4,
                                    "author": "HammerJammer02",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "“I try to apply it to everything I do: no acting required,” Hopkins told The New Yorker in 2021 about acting in Marvel movies. [https://www.imdb.com/news/ni63954451](https://www.imdb.com/news/ni63954451)\n\nI worked in Hollywood the past 20 years as an actor &amp; producer who has been in films on Netflix and network TV.",
                                            "score": 3,
                                            "author": "Repulsive-Studio-120",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Firstly the article you linked posts another actor with an entirely different experience, so why should Antony Hopkins be the sole arbiter here. Secondly he’s talking specifically about acting in front of a green screen. Thirdly regardless of what anyone says, when Antony Hopkins is playing Odin he’s by definition acting",
                                                    "score": 2,
                                                    "author": "HammerJammer02"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I love Antony Hopkins but he’s just wrong. He’s by definition acting even if he doesn’t like the writing",
                                                    "score": 2,
                                                    "author": "HammerJammer02"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m just now realizing that Tom Holland is *not* the actor that played Abraham Woodhull/Samuel Culper on Turn.  How many of my other memories are wrong?",
            "score": 9,
            "author": "cocoon_eclosion_moth",
            "replies": [
                {
                    "level": 1,
                    "comment": "How many other lies have I been told by the council",
                    "score": 2,
                    "author": "jerem1734"
                },
                {
                    "level": 1,
                    "comment": "Tom Holland was billy Elliot on stage - that guy was billy Elliot in the movie. You aren’t that far away.",
                    "score": 2,
                    "author": "honestbae"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The early reviews aren’t good. I’m sure this is just promo shit and he had planned this break long ago.",
            "score": 21,
            "author": "Chipder"
        },
        {
            "level": 0,
            "comment": "Wait so… when is the next spiderman set to film?",
            "score": 2,
            "author": "AlexMelillo",
            "replies": [
                {
                    "level": 1,
                    "comment": "I heard that do the writer strike it’s on hold.",
                    "score": 3,
                    "author": "Firebat-045"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Damn didn’t he take a break after Spider-Man as well? I hope he’s doing okay mentally seems like these movies are having a huge impact",
            "score": 2,
            "author": "lasvegashomo"
        },
        {
            "level": 0,
            "comment": "Having money + Zendaya: year off is short",
            "score": 2,
            "author": "fattytuna1985"
        },
        {
            "level": 0,
            "comment": "I mean, the SAG Strike is only a few weeks away and depending on how long that lasts, his announcement may not have been needed.",
            "score": 2,
            "author": "Darnell5000"
        },
        {
            "level": 0,
            "comment": "This might be an unpopular opinion but he's not a great actor. He's got decent screen presence and is a \"movie star\" but not a good *actor* right now\n\nEdit: missed out the key word NOT. LOL",
            "score": 8,
            "author": "Radio-No",
            "replies": [
                {
                    "level": 1,
                    "comment": "He really isn't. I think many people give him a pass because he's British. He's pretty one dimensional.",
                    "score": 2,
                    "author": "_kevx_91"
                },
                {
                    "level": 1,
                    "comment": "May be due to bad roles and writing. Imo he was pretty great in Devil ALL the time.",
                    "score": 2,
                    "author": "Logical-Juggernaut48"
                },
                {
                    "level": 1,
                    "comment": "Is he a movie star or just a famous actor? I think he's just a famous actor at this point. His girlified is a movie star.  \n\nHe seems more like studio creation from the old studio system then a real stand alone star. Many old Hollywood stars had contracts with studios that created incentives for the studio to push anything to place them into the best light. But many of the studio creates fell flat on their faces once outside of the studio's protective bubble. \n\nMarvel makes all of their leads into famous actors, but that doesn't mean that are all movie stars. It's like the difference between Kate Winslet's post Titanic experience, and Leo's. Both actors, but one is a legit movie star. The other is a famous actress. Both elevated their popularity due to a gigantic film/studio push. \n\nBased on Tom's non-marvel work, he, like Chris Harmsworth, is no movie star (yet), just very famous actor. And that's alright.",
                    "score": 1,
                    "author": "Emperor_FranzJohnson"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Awww so hard acting. 🥲🥲🥲 Tone deaf a-hole.",
            "score": 2,
            "author": "twelvebegin",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, if it was that easy then you could do it too. Let's see you try to break into a Hollywood superstar actor. You know nothing either.",
                    "score": 2,
                    "author": "Roof-Substantial"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hell, Tom, why not make it a whole decade?",
            "score": 2,
            "author": "Nanostreak"
        },
        {
            "level": 0,
            "comment": "That's what happens after being part of a bad show",
            "score": 1,
            "author": "Hyper_2005"
        },
        {
            "level": 0,
            "comment": "Or... he just needs to make sure, that Zendaya will not run with Timotheé from him...",
            "score": 1,
            "author": "MeCritic",
            "replies": [
                {
                    "level": 1,
                    "comment": "Considering how rich Tom is on his own, likely wealthier than Zendaya since he was the lead in Spider-Man, even if Z dropped him, he can have another famous actress  or model on his arm for the rest of his life. Dude is pulling $20 mil a Marvel film with residuals. He'll be fine no matter what.",
                    "score": 2,
                    "author": "Emperor_FranzJohnson",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He wasn't a huge star when the first one came out. He supposedly got 10 mill for No Way Home. He's definitely not on a 20mil a movie contract. \n\nI think you're underestimating just how big zendaya and her fanbase is",
                            "score": 3,
                            "author": "Radio-No",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He has 3 more on deck with $20 mill contract. Plus he had Avenger movies. His bank account is phat!",
                                    "score": 2,
                                    "author": "Emperor_FranzJohnson"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You mean you had to do some actual acting instead of being a quirky teen in front of a green screen?",
            "score": 1,
            "author": "ftwin"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -24,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": -5,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": -6,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yawn. Who gives a fuck",
            "score": -1,
            "author": "justforlooks88"
        },
        {
            "level": 0,
            "comment": "..then he got paid",
            "score": 1,
            "author": "DiceStrike"
        },
        {
            "level": 0,
            "comment": "![gif](giphy|Ei5f5XHCPSLuVAymwh)",
            "score": 1,
            "author": "ultraholo"
        },
        {
            "level": 0,
            "comment": "That's one way to advertise the show.",
            "score": 1,
            "author": "JustBrowsingIt28"
        },
        {
            "level": 0,
            "comment": "I kind of understand this. I'm by no means a best-ever actor, but I did a play back in November in which my character was constantly harassed and in an abusive relationship. Didn't realize the toll it took on me until it had wrapped up and had to talk about it in therapy. Acting is fun but can be a bitch. Happy for Tom. Hope his year is enjoyable.",
            "score": 1,
            "author": "HappyHammy7"
        },
        {
            "level": 0,
            "comment": "His best movie is Uncharted, should make part 2.",
            "score": -1,
            "author": "DaisukeJigenTheThird"
        }
    ]
}