{
    "id": "145k2ef",
    "score": 6,
    "title": "New ‘Leprechaun’ Movie in the Works at Lionsgate",
    "author": "AliceTheMagicQueen",
    "date": 1686352737.0,
    "url": "https://www.reddit.com/r/entertainment/comments/145k2ef",
    "media_urls": [
        "https://www.hollywoodreporter.com/movies/movie-news/leprechaun-new-movie-in-the-works-1235510562/"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "![gif](giphy|8GThBNZevxSGh8D5QG)",
            "score": 2,
            "author": "Yomminator"
        },
        {
            "level": 0,
            "comment": "Didn't they already try to reboot it as a more serious horror movie with Leprechaun Returns in 2018? It feels like they are going to try and take a horror approach again with what producer is taking the helms.\n\nI personally think making it a serious horror movie is the wrong way to go. It was already tried and didn't work. They need to go back to it's roots and start making some hilariously bad leprechaun movies again.",
            "score": 1,
            "author": "SweeT_MaviS"
        },
        {
            "level": 0,
            "comment": "nobody tell james a. janisse",
            "score": 1,
            "author": "HappyHammy7"
        },
        {
            "level": 0,
            "comment": "Is this talking about that super bad movie with Jennifer Aniston?",
            "score": 1,
            "author": "ForTheLoveOfPop"
        },
        {
            "level": 0,
            "comment": "Lionsgate in gearing up for a new search for the pot of gold at the end of the rainbow.\n\nLeprechaun, the longest-running franchise in Lionsgate history, will get a fresh start as the studio reimagines the horror title for a new generation of moviegoers. \n\nFelipe Vargas, helmer of the award-wining short film Milk Teeth, will direct the new feature project that has a script by Mike Van Waes, who worked on the live-action Lilo &amp; Stitch movie that is now in production.\n\nRoy Lee, one of the Hollywood’s horror lynchpins whose credits include Barbarian and the It movies, will produce via his banner Vertigo Entertainment. The company’s Miri Yoon will also produce.\n\nLeprechaun hailed from low-budget home entertainment producer Trimark Pictures who made the first movie in 1993 with Warwick Davis starring as a shoe-shining, gold-protecting, vengeance-dispensing leprechaun. The movie became notable for featuring Jennifer Aniston in her film debut but it also became a surprise theatrical moneymaker, launching a franchise that spanned three decades. Davis played the wily leprechaun in six films but skipped the last two, 2014’s Leprechaun: Origins and 2018’s Leprechaun Returns. Davis is not expected to reprise the role for the new iteration.\n\nThe films became part of Lionsgate in 2000 when the company acquired Trimark, making the low-budget cult series on paper something that predates homegrown franchises such as Saw, The Hunger Games, and John Wick. The films have shown an enduring popularity and Syfy Network runs a Leprechaun marathon every St. Patrick’s Day.\n\n“Thirty years after its debut, this franchise still casts a spell, and we’re thrilled to be bringing it back with a new vision,” Erin Westerman, president of production for Lionsgate’s Motion Picture Group, said in a statement. “Roy and Miri are two of our most trusted producers, especially with this genre, and we’re excited by Felipe’s vision for the film as a director. In his hands, this movie should be very scary and a ton of fun.”\n\nMeredith Wieck and Jon Humphrey will oversee for Lionsgate.\n\nVargas’s short Milk Teeth told of a boy in an orphanage who sets of a tooth-separating frenzy amongst his fellow orphans when he finds a creature that trades coins for teeth. Teeth was a hit on the festival circuit, honored with a DGA Student Film Award and Imagen Award and winning an award at the Fantasia Film Festival.\n\nVargas is currently set to direct his feature debut Rosario in Colombia. He is repped by CAA, Magnolia Entertainment, and Gang Tyre.",
            "score": 0,
            "author": "AliceTheMagicQueen"
        }
    ]
}