{
    "id": "1462kyc",
    "score": 5297,
    "title": "\"Middle-Aged Men Squealing\": Spielberg's Letter To Last Of Us Crew Got Great Reactions",
    "author": "summercloudsadness",
    "date": 1686409579.0,
    "url": "https://www.reddit.com/r/entertainment/comments/1462kyc",
    "media_urls": [
        "https://screenrant.com/last-of-us-show-steven-spielberg-response/?taid=64837a46f016640001092991&amp;utm_campaign=TrueAnthem-SR&amp;utm_medium=Social-Distribution&amp;utm_source=Twitter"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "I thought it was a true to life veiw of alot of gay relationships which are not portrayed in media. Regular guys in a regular relationship.",
            "score": 1673,
            "author": "Cyberzombi",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hey we’re not all fighting zombies in deserted communities! Most of us yes, but not all of us.",
                    "score": 590,
                    "author": "The-Implication-0",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Right, I really like how they captured our universal understanding of booby traps and survival skills.",
                            "score": 73,
                            "author": "OrphanDextro",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Mooby traps broseph they are dudes.",
                                    "score": 31,
                                    "author": "Dystopian_Divisions",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Right, gay men have an implicit understanding that boobies are traps",
                                            "score": 34,
                                            "author": "trottindrottin",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Damn you, couldn’t you have shared this knowledge before now! I’ve been trapped by so many boobies in my life this all could have been avoided!",
                                                    "score": 11,
                                                    "author": "youknowwhyimhere89"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Man-catchers.",
                                            "score": 11,
                                            "author": "DrButtFart"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Not all of us.\n\nBut certainly The Last of Us",
                            "score": 561,
                            "author": "Oldschoolhollywood",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Dear lord, save this one.",
                                    "score": 105,
                                    "author": "Wyrdthane",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Gluttony is a sin. He is to be shared.",
                                            "score": 34,
                                            "author": "ShaggysInsideOutAnus"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "![gif](giphy|GA1sltMVrl4YJgMyh5|downsized)",
                                    "score": 21,
                                    "author": "gocrazy305"
                                },
                                {
                                    "level": 3,
                                    "comment": "Ahhh, get outa here!",
                                    "score": 6,
                                    "author": "Talcove"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It's  hard when all you are wearing is speedos and using glow sticks to slap the clickers with.",
                            "score": 26,
                            "author": "Cyberzombi",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Roller skates and handfuls of glitter (self-defense) works for me.",
                                    "score": 16,
                                    "author": "ImpressionEast7805",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Speedos? I wasn’t aware I needed my formal wear.",
                                    "score": 8,
                                    "author": "LeicaM6guy"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Sounds like Palm Springs",
                            "score": 4,
                            "author": "codenamechaosss"
                        },
                        {
                            "level": 2,
                            "comment": "Us Bisexuals on the other hand…\n\nFull zombie apocalypse warriors. All of us.\n\n![gif](giphy|ZkWQHXcmdKBc6j7g8R)",
                            "score": 4,
                            "author": "bengringo2"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "There’s a moment toward the end of the episode where Frank’s struggling to paint while Bill waters the flowers Frank planted and they look at each other and Bill winks at Frank. I had to pause the episode to take in how perfectly illustrated their relationship was.",
                    "score": 138,
                    "author": "g_deptula"
                },
                {
                    "level": 1,
                    "comment": "I agree. \n\nI'm put off by intimacy in media in general, and this episode didn't once make me roll my eyes at the screen or feel like it was corny. Romances almost always do. \n\nCompound it with it being about a gay relationship, which I can't think of many good examples from other movies/shows, and I think this episode was just really impressive. \n\nLike - I hate romances. So I'm sure someone with more love for them could provide some great examples, but this episode is the best romance I've ever seen.",
                    "score": 195,
                    "author": "B-BoyStance",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Best gay relationship I can recall seeing in media. Boy they did a good job",
                            "score": 59,
                            "author": "JungleBoyJeremy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It was one of the best/most realistic romances I’ve seen period.",
                                    "score": 38,
                                    "author": "Hereslookingatmekid"
                                },
                                {
                                    "level": 3,
                                    "comment": "Best?  BEST?!? &gt;!THEY DIED!&lt; Ugly tears over here.  \"Best\" harumph.",
                                    "score": 17,
                                    "author": "Ok-Juggernaut-353",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "True, but everyone dies eventually, regardless of relationship status or sexual orientation--you can be madly in love with each other for 50 years, but eventually one of you will die and leave the other behind, unless the two of you manage to go together at the same time. I just don't see this is an example of the usual \"kill the gay(s)\" tropes; it's the story of a love lasting until death, which--if we're lucky--anyone can have.",
                                            "score": 15,
                                            "author": "OldMaidLibrarian"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I think it may be because other than when Frank first asks Bill if he’s been with a man before there’s no discussion about any of it. It’s just two people who love each other. It’s easily one of my favourite pieces of media from the last 10 years",
                                    "score": 4,
                                    "author": "MrSteveBob"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Recently saw Six Feet Under and the portrayal of the gay couple was somehow even better and more realistic than many of the recent shows considering that show is kind of old.",
                            "score": 62,
                            "author": "summercloudsadness",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Six feet under gets you right in the feels",
                                    "score": 19,
                                    "author": "smashdoggyyyyyy"
                                },
                                {
                                    "level": 3,
                                    "comment": "Agreed.",
                                    "score": 5,
                                    "author": "ReallyGlycon"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Damn good episode. This episode alone caused me to recommend the series to my 17 year old Daughter.",
                            "score": 23,
                            "author": "Soggy-Type-1704",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I watched it with my 16 year old whose classmate recently lost both parents in a car accident the day before.  We just sat and cried after.  It was a moment I’ll never forget.  Sometimes you just feel pure love.",
                                    "score": 5,
                                    "author": "Yzerman_19"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Same,this is one of the big problem I have with many of the mainstream romance movies. Many LGBTQ movies that are celebrated as the best in that category often has so much unnecessary violence/hypersexualization attached to it,it's almost nauseating. I don't even want to start with the toxic stuff that is passed off as romance in the hetero movies. Portrait of a Lady on Fire was such a refreshing watch,one of my personal favorites of all time.",
                            "score": 22,
                            "author": "summercloudsadness"
                        },
                        {
                            "level": 2,
                            "comment": "It felt corny the moment the Max Richter song started playing. That song needs to be retired from TV/film, I can’t help but roll my eyes when I hear it.",
                            "score": 2,
                            "author": "Ginny_Frenulum",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "True, this was my favourite episode.",
                    "score": 13,
                    "author": "Impressive-Ad-6969"
                },
                {
                    "level": 1,
                    "comment": "And like you said, they're literally regular guys and not the cartoonishly flamboyant couples that are the typical Hollywood portrayal of gay men. I think that's very important for people to realize that that's not accurate to the whole gay community. It's incredibly well directed, written and acted.",
                    "score": 50,
                    "author": "thatminimumwagelife",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’ve sucked dick and skinned a coyote the same day recently, just want representation is all.",
                            "score": 66,
                            "author": "TulkasRouser",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I didn’t know the Road Runner was gay. Good for him though.",
                                    "score": 27,
                                    "author": "Roguespiffy"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Not to say gay couples don’t get worse representation. But it’s also rare to see any other type of couple not be some overly dramatized or crazy for each other caricature of adult relationships.",
                            "score": 3,
                            "author": "_OriamRiniDadelos_"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I thought it was the best true to life portrayal of a gay couple and relationship in any movie or series. Maybe brokeback mountain as well.",
                    "score": 11,
                    "author": "Vlvthamr",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "And to add to this I think this was one of the best episodes of any television show ever",
                    "score": 5,
                    "author": "Its_me_mikey"
                },
                {
                    "level": 1,
                    "comment": "Yes. One of the most appropriate same sex relationship ever ironically given the setting.",
                    "score": 2,
                    "author": "ShinRaiYoken"
                },
                {
                    "level": 1,
                    "comment": "My biggest gripe was the retcon. Bill should've been in the show longer,kind of thought it was setting up the scenario from the game.",
                    "score": 4,
                    "author": "Personplacething333"
                },
                {
                    "level": 1,
                    "comment": "Just guys being dudes.",
                    "score": 4,
                    "author": "Metrilean"
                },
                {
                    "level": 1,
                    "comment": "A few years back, when outrage twitter was more active you’d be accused of being an heteronormative gay. Nobody gave a fuck. It was the dumbest purity test, ever in any community. \n\nI only judge gays on their voting record. I don’t care how you dress or what music you listen to. If you don’t vote, or vote republican, you are dead to me.",
                    "score": 1,
                    "author": "trent58",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Love this show.  Love this episode.\n\nFrank: You live in a psycho bunker where 9/11 was an inside job and, and the government are all Nazis. \n\nBill: The government ARE all Nazis!",
            "score": 920,
            "author": "copperblood",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 254,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s key to the quote",
                            "score": 111,
                            "author": "Domainframe",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The piece of fiction that unlocks the fantasy.",
                                    "score": 17,
                                    "author": "MysticalMike2"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I don’t usually cry when watching series and movies, but man, me and my girlfriend were bawling our eyes out by the end of that episode. \n\n\nThey really did a great job with TLoU. Literally one of my top 5 series ever, right now.",
                    "score": 95,
                    "author": "kamratjoel",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Same! My boyfriend was like holding me in his arms while I sobbed",
                            "score": 20,
                            "author": "pottymouthgrl"
                        },
                        {
                            "level": 2,
                            "comment": "I don't know a single person who didn't feel some fucking big emotion during that one",
                            "score": 8,
                            "author": "Sapowski_Casts_Quen"
                        },
                        {
                            "level": 2,
                            "comment": "i wasn't even watching the show with my boyfriend, but this episode really drew me in and i was crying like a baby at the end. i'm getting a little emotional just thinking about it.",
                            "score": 9,
                            "author": "richestotheconjurer"
                        },
                        {
                            "level": 2,
                            "comment": "It was fantastic.  Probably my favorite episode so far.  Doesn’t hurt that I’ve always day dreamed of having a hidden bunker lol.  I thought the way they handled the romance and ensuing relationship was awesome.  Keep trying to get my wife to finish the episode prior so she can watch this one.",
                            "score": 2,
                            "author": "Napol3onS0l0"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I mean, yeah, NOW.",
                    "score": 17,
                    "author": "katieleehaw"
                },
                {
                    "level": 1,
                    "comment": "“Well yeah, now”\n\nPretty reaction to when you’re in an argument with a partner and realise they are right about something but are still angry. Loved this episode so much, made me watch the show",
                    "score": 20,
                    "author": "BetaThetaOmega"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I really didn't see this episode coming. For the first 20 or so minutes I thought I was watching a different show. But that's not a bad thing. It's always nice to take a look at people's lives within the apocalypse and sometimes the quieter episodes leave the biggest impacts.",
            "score": 394,
            "author": "PM_ME_YOUR_SOULZ",
            "replies": [
                {
                    "level": 1,
                    "comment": "I cried my eyes out for an hour and yelled at the TV \"this was not in the game!\" Because I felt blindsided by the feels",
                    "score": 168,
                    "author": "Schmetterling190"
                },
                {
                    "level": 1,
                    "comment": "That's the only thing I didn't like. \n\nAt first I was just waiting for more last of us and this episode just kept going, after about 15 minutes I realized it was just going to be them and accepted it. \n\nSuch a fantastic episode though. I would take a whole show of mini episodes of stuff like this.",
                    "score": 63,
                    "author": "Ianilla1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was sad when they wrecked Offerman’s truck.",
                            "score": 36,
                            "author": "ProjectFantastic1045",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That part was identical to the game so was to be expected.",
                                    "score": 28,
                                    "author": "cantwejustplaynice"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The episode itself is good but the show’s main story was rushed especially at the end",
                            "score": 15,
                            "author": "paperclipestate",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I was happy with what it was and had to be. But it definitely could have used another 2 episodes to flesh things out more.\n\nBut I watched it with people who had not played the game and they loved it.",
                                    "score": 19,
                                    "author": "Ianilla1"
                                },
                                {
                                    "level": 3,
                                    "comment": "It’s been a minute since I played the game but I thought there was enough material for 2 seasons. And I was very disappointed that it ended so soon.",
                                    "score": 5,
                                    "author": "blahmeistah",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Meh u can beat the last of us in 12 hours and most of that is filler gaming stuff, it's really not a long game at all",
                                            "score": 2,
                                            "author": "zdbdog06"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "After this ep, I had my hopes really high for an Ish and sewer settlement episode, or an expansion of things hinted at in all the flavor text. Sad we didn’t get that.",
                            "score": 2,
                            "author": "Actual_Shower8756"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This episode was beautiful. Love Offerman’s rendition of Long Long Time.\n\nEdit: as someone who knows too much about unrequited love take I can relate to those lyrics, ever painfully so.",
            "score": 496,
            "author": "crimsonhues",
            "replies": [
                {
                    "level": 1,
                    "comment": "I haven't been that tearful for two aged people falling in love since Pixar's Up.",
                    "score": 143,
                    "author": "InterstellarAshtray",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I cried at a cartoon, and I don’t care who knows",
                            "score": 40,
                            "author": "ParamedicCareful3840",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Me too.",
                                    "score": 20,
                                    "author": "crimsonhues",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Offerman's casting was brilliant. He plays that part amazingly well. I'm awestruck how much emotion he shows with so little.",
                    "score": 14,
                    "author": "dtelad11",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Agree. Brilliant acting and screenplay",
                            "score": 8,
                            "author": "crimsonhues"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Honestly probably the best love story of the past decade if not that definitely since the pandemic. It was just so tasteful and beautiful funny made you laugh and cry and angry and so relatable regardless of who you are. It was really really well written and executed.",
                    "score": 97,
                    "author": "nth03n3zzy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They played perfectly off of each other. I had only seen Murray Bartlett in White Lotus. He showed night-and-day depth in LoU from his role in White Lotus. Whenever you thought their relationship would turn too sappy, there would be a great realistic barb thrown in bringing it back down to earth in such a human and naturally performed way.",
                            "score": 34,
                            "author": "Solid-Mud-8430",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I couldn’t get those over the top scenes of him in White Lotus but fortunately, his character in Last of Us provided some eye bleach relief.",
                                    "score": 5,
                                    "author": "luxii4"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It was at least the most interesting love story I’ve seen in a long while. Also by and far the best episode of the last of us. Hopefully they can reach those heights again with season 2.",
                            "score": 45,
                            "author": "Albuwhatwhat"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "One of the best episodes the first season. It was beautifully written and didn’t feel like it was extra or unnecessary, but great backstory to the plot.",
                    "score": 13,
                    "author": "Unlucky_Clover"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was never afraid before you showed up.",
            "score": 91,
            "author": "Jabroni306",
            "replies": [
                {
                    "level": 1,
                    "comment": "The writing was fucking UP there, man, I don't think a single line was wasted",
                    "score": 20,
                    "author": "Sapowski_Casts_Quen",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Everyone bled their whole fucking heart into that episode.",
                            "score": 5,
                            "author": "thefallenfew"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It was a heartbreaking episode. I didn’t think Nick Offerman could make me cry like a baby.",
            "score": 218,
            "author": "keving691",
            "replies": [
                {
                    "level": 1,
                    "comment": "I cried so hard with this episode. So beautifully done and so real.",
                    "score": 60,
                    "author": "No_Maintenance_3355",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I cried so hard that I started laughing at how hard I was crying… very strange mix of emotions.  That’s some powerful TV shit",
                            "score": 24,
                            "author": "AdventurousPumpkin"
                        },
                        {
                            "level": 2,
                            "comment": "Yeah, they felt real. They argued and compromised on things.",
                            "score": 22,
                            "author": "keving691"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "People get really bogged down that things aren't perfect in the LGBT or racism realm that they forget to see how far we have come as society.\n\n25 years ago this would have caused massive outrage. 25 years ago I would have personally been disgusted by this episode and probably used some not nice language to describe it.\n\nWhen it aired I cried. It's one of the greatest episodes of television I've ever seen.",
            "score": 136,
            "author": "Jonesyrules15",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was raised to be bigoted. As an adult I realized I’m Pan and am an ardent member of the LGBTQ community. My dad, still as Republican but softened over the years, watched this episode with me and quietly wept at the end. “It was a good love story” we both agreed.",
                    "score": 46,
                    "author": "Nekodoshi",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You love to see it. Go Dad",
                            "score": 14,
                            "author": "thedonjefron69"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "it still caused massive outrage, or at least minor outrage. a bunch of shitheads review-bombed it and were going berserk online because they’re insecure",
                    "score": 12,
                    "author": "dcnairb",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Who’s downvoting this? Do you guys not remember conservatives blasting the series whenever this episode released? Even my mom who knows nothing about videos games did.",
                            "score": 10,
                            "author": "Cowsifur"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thankfully Facebook didn't exist back then and you didn't write a comment like that on it. Or you would have been cancelled if you tried to host the Oscar. \n\nI don't want to undermine the idea that homophobia is terrible but I believe through your comment it's important to realise that indeed people can change their opinion. So  hunting for evidence from 10+ years ago should not be a thing.",
                    "score": 5,
                    "author": "kaam00s",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Its like the goal is for people to change and become more tolerant, but then when they do their past is put as evidence of how bad they are. That change should be commemorated!",
                            "score": 2,
                            "author": "pepinodeplastico"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Murray Bartlett is going to be the next Tom Hanks in terms of delivering high quality content…mark my words. He is the next superstar.",
            "score": 49,
            "author": "Icehotel1",
            "replies": [
                {
                    "level": 1,
                    "comment": "The majority of the praise is going to Nick Offerman (and he deserves a lot of praise!) but Murray Bartlett was so good too!",
                    "score": 28,
                    "author": "Beatupmymenweek"
                },
                {
                    "level": 1,
                    "comment": "He was also phenomenal in White Lotus. Glad he got an Emmy for that role.",
                    "score": 13,
                    "author": "ladeeedada",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "1000%. Every character he plays is so fully unique and nuanced, he’s crazy talented. Easily my favorite actor at the moment.",
                    "score": 3,
                    "author": "superdopeshow"
                }
            ]
        },
        {
            "level": 0,
            "comment": "“I wasn’t afraid until I met you..”\n\nRipped me to shreds.",
            "score": 49,
            "author": "Nexrender"
        },
        {
            "level": 0,
            "comment": "I personally love that nick offerman showed gay men can be manly as well not just straight men. He honestly is a genuine guy.",
            "score": 16,
            "author": "Longwillybillytully"
        },
        {
            "level": 0,
            "comment": "I loved the fact that they were ordinary.  Not overtly gay; not special; just people.  Also, having played the game, and seeing them start to fight, and thinking I knew what was coming - it was cool how they subverted expectations",
            "score": 127,
            "author": "examinedliving",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Did I read the headline as “Middle-aged Men Squirting”? Yes, yes I did. Did I then proceed to reread it as squirting a few more times? Yea, so what if I did?",
            "score": 12,
            "author": "gstroble"
        },
        {
            "level": 0,
            "comment": "One of the best stand alone episodes of prestige TV I have ever seen. It felt bigger because lost in the plot we got this beautiful story of love which was completely unexpected as someone who never played the game or did background before I started watching the show",
            "score": 106,
            "author": "Puzzleheaded_Pound31",
            "replies": [
                {
                    "level": 1,
                    "comment": "As someone who played the game this episode took me by surprise as well.",
                    "score": 19,
                    "author": "deanolavorto"
                },
                {
                    "level": 1,
                    "comment": "Don’t wanna ruin the game for you if you ever intend to play it but this episode blind sided pretty much everyone because Bill was not like this in the game. I’m glad they did this and gave the character more depth.",
                    "score": 19,
                    "author": "bugman573"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Amazing episode.  Should have won every Emmy available.\n\nI'm not gay, but it was a beautiful love story.  Beautifully, perfectly written and acted.",
            "score": 10,
            "author": "lunch0000",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I genuinely believe that this episode will go down in history as one of the best moments of tv ever made. It was its own standalone short film while still staying connected to the main plot. And the emotional response is unlike anything I’ve seen in recent memory.",
            "score": 22,
            "author": "Fictional_Apologist",
            "replies": [
                {
                    "level": 1,
                    "comment": "And, in a more clever sense, it made the climax of the story more ambiguous, morally so.\n\nJoel’s choices were driven by Bill’s story and letter. It begs to wonder what being selfish really is.",
                    "score": 2,
                    "author": "russellamcleod"
                }
            ]
        },
        {
            "level": 0,
            "comment": "One of the most beautiful love stories I’ve ever seen.",
            "score": 7,
            "author": "StrikingApricot2194"
        },
        {
            "level": 0,
            "comment": "I bawled and I was mad I didn’t expect it. Such a beautiful episode.",
            "score": 7,
            "author": "tiffanyknightbbw"
        },
        {
            "level": 0,
            "comment": "Honestly one of the best episodes on television hands down. I hate romantic drama shit in shows but this one really tugged on my heart and played with my emotions man. Honestly amazing job from everyone involved. I watched the episode a while ago and even thinking about it just makes me wanna tear up",
            "score": 81,
            "author": "MGjoker09",
            "replies": [
                {
                    "level": 1,
                    "comment": "Right? They found love at the bottom of a hole that one of them built out of fear of what the world had become. And then that person brought the other person out of where he had been stuck. Something about the way it even just began like that was just utterly perfect for the subject of 'love in the time of everything ending.'",
                    "score": 18,
                    "author": "Solid-Mud-8430"
                },
                {
                    "level": 1,
                    "comment": "This and Mythic Quest s2e8 are two of the most incredible side story episodes I’ve ever seen.",
                    "score": 20,
                    "author": "2chainzzzz",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Throw in the “Death” episode of Sandman and we’ve got a stew going",
                            "score": 18,
                            "author": "BrainKatana",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "*Time's Arrow has entered the chat.*",
                                    "score": 5,
                                    "author": "m_Pony"
                                },
                                {
                                    "level": 3,
                                    "comment": "Don’t forget “kiksuya” from S2of west world!",
                                    "score": 8,
                                    "author": "PecorinoFailure"
                                },
                                {
                                    "level": 3,
                                    "comment": "Did someone say we got a stew going!?\n-Carl Weathers probably",
                                    "score": 3,
                                    "author": "masiker31"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It’s interesting how they told their whole story in one episode and it was so impactful. A lot of shows love stories take seasons to tell the audience why we should be rooting for the relationship to work and still do it so ham fisted and cheesy ways.",
                    "score": 7,
                    "author": "jethropenistei-"
                },
                {
                    "level": 1,
                    "comment": "It's the only television episode of anything that I watched twice within the past 15 years.",
                    "score": 2,
                    "author": "madcow44820"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Played the games, \nLOVED the show!",
            "score": 42,
            "author": "Highonlovesdelight"
        },
        {
            "level": 0,
            "comment": "Beautiful episode. Most heart I’ve ever seen in an episode of television.",
            "score": 4,
            "author": "gideon513"
        },
        {
            "level": 0,
            "comment": "My wife had already watched the episode. I though I was primed for how emotional it would be. It just hit me like a load of bricks. I couldn’t watch anything else after because I just needed to digest it.",
            "score": 5,
            "author": "megaman368"
        },
        {
            "level": 0,
            "comment": "That episode started out with so much suspense. I was really worried he was in danger and that something bad would happen. Then it completely flipped and told such a beautiful story. Such a fantastic work of art that episode is",
            "score": 5,
            "author": "theseustheminotaur"
        },
        {
            "level": 0,
            "comment": "I read some spoilers about this episode before watching, and I knew it would break me. So I kept putting it off for a few weeks until my partner finally demanded we watch it so we could continue the series. \n\nI SOBBED for the last 30 minutes and he just kept apologizing to me for “making” me watch it.",
            "score": 13,
            "author": "creamily_tee"
        },
        {
            "level": 0,
            "comment": "Dont know why these types of things get to me. San Junipero and this episode is some of the most emotional shit ive ever seen.",
            "score": 2,
            "author": "RDO-PrivateLobbies",
            "replies": []
        },
        {
            "level": 0,
            "comment": "They gay love made me cry",
            "score": 3,
            "author": "TheycallmeCheapsuits"
        },
        {
            "level": 0,
            "comment": "It's a beautiful episode.",
            "score": 10,
            "author": "leprotelariat"
        },
        {
            "level": 0,
            "comment": "Spielberg watching ep. 3 of last of us. “Oh my god! I think it moved!”",
            "score": 3,
            "author": "trent58"
        },
        {
            "level": 0,
            "comment": "This episode made me cry the hardest I have ever cried watching anything… the way the it told Love truly touched me.",
            "score": 3,
            "author": "conradish"
        },
        {
            "level": 0,
            "comment": "Im just so happy it didn't take the liberty to make them into every single stereotype of gay men possible. It was a refreshing believable relationship and a beautiful love story.",
            "score": 3,
            "author": "FBIaltacct"
        },
        {
            "level": 0,
            "comment": "My wife and I started watching The Last of Us a bit late, well after the hype train had started rolling, so I had high expectations for the show. After two episodes, I said to her, “I like this, but I’m not sure I get the hype. I really hope this show gives me something I haven’t seen before.”\n\nThen we got to the third episode, which was like nothing I’ve seen before in this genre or maybe any genre. Just a breathtaking episode of television that left us both crying on the couch. At one point we looked at each other and busted out laughing because we both had tears streaming down our faces while watching a show based on a video game.\n\nI thought about this episode every day for like two weeks after and still think about it from time to time now. Beautiful, incredible stuff.",
            "score": 3,
            "author": "zYelIlow"
        },
        {
            "level": 0,
            "comment": "This is cool, but come on, the article says that “The letter was addressed to Mazin, who shared it with Hoar, Offerman, Bartlett, and cinematographer Eben Bolter.”\n\nThat’s not the “crew” by any means. Technically, the DP is below the line crew, but in practice, they’re much closer to ATL (“above the line” talent and producers). \n\nI **wish** crew got recognition like this, but the hundreds of people who work behind the scenes seldom do.",
            "score": 10,
            "author": "allthejackets"
        },
        {
            "level": 0,
            "comment": "My dad cried at this episode. My Christian, Republican dad. That was the mark of a great episode.",
            "score": 10,
            "author": "solojones1138",
            "replies": []
        },
        {
            "level": 0,
            "comment": "My only issue was it took me at least half the episode to get over seeing Ron Swanson in a serious role. \n\nThat’s not to rag on Nick Offerman. He was fantastic. It was my own hang up from being such a big Parks and Rec fan.",
            "score": 15,
            "author": "Dakzoo",
            "replies": [
                {
                    "level": 1,
                    "comment": "The pit/\nI was in it, the pit/\nYou were in it, the pit/\nWe all fell in the pit",
                    "score": 8,
                    "author": "trottindrottin"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It was a beautiful episode, and I was really happy to have a meaningful addition to the game lore.",
            "score": 12,
            "author": "goboxey"
        },
        {
            "level": 0,
            "comment": "If you watched this episode and didn’t cry, you might want to consider giving therapy a shot.",
            "score": 4,
            "author": "SothaSillyGoose",
            "replies": [
                {
                    "level": 1,
                    "comment": "Or you're simply a homophobe.",
                    "score": 4,
                    "author": "phaetae",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "true, in which case you’d still likely need therapy.",
                            "score": 9,
                            "author": "SothaSillyGoose"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I didn't watch the show as it aired.i binged it a couple months later. I'd already seen a crazy amount of hyperbolic headlines proclaiming the show to be the greatest thing ever to happen on television. I really did enjoy it the show overall but found it a bit overhyped. This episode though was a truly lovely &amp; moving piece of work.",
            "score": 21,
            "author": "KneeHighMischief",
            "replies": [
                {
                    "level": 1,
                    "comment": "It was good, but it definately seemed injected into the series for an Emmy nomination. After it aired I felt like, “cool love story bro, but now I have to wait another week to progress the story I came here to see.”",
                    "score": -26,
                    "author": "Give_me_grunion",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You must not have played the game, the “main” story line was mostly a vehicle to present these side stories",
                            "score": 33,
                            "author": "wellhiyabuddy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "In the game they don’t even show their relationship, just hints through conversation and letters.\n\nIf the main story line in the game was truly just a vehicle to present these stories then they did a pretty poor job. While playing the game, I was more engaged in Joel/Ellie’s story than Bill and Frank’s",
                                    "score": 2,
                                    "author": "paperclipestate",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I don’t think they did a poor job at that at all. The story wasn’t about a zombie apocalypse or even about finding a cure, those were just the settings of the story. The story was about how people find meaning and a reason to live when the society we are used to collapses. Some people found the need to aggressively try and rebuild the order and structure that was missing, some wanted to build a new society different from the old one, some felt compelled to seek a cure, some saw an opportunity to live selfishly and only for themselves, some found meaning in family, some people just wanted to be left alone. It was a very rich world that played out a lot of different coping mechanisms. If you were only interested in Joel and Ellie that’s fine, that’s what resonated with you, but there was a lot of other things to enjoy about the story as well",
                                            "score": 3,
                                            "author": "wellhiyabuddy"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I did. I recognized him from the game. His part in the game did not warrant an entire episode in the show. Again, good episode… felt force into the plot line. Especially since it deviated from the game and went full back story on them.",
                                    "score": -22,
                                    "author": "Give_me_grunion",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "what? his inclusion in the game did warrant an entire episode. an entire segment of the game is dedicated to bills town and that segment is anywhere from an hour to an hour and a half",
                                            "score": 5,
                                            "author": "e_xotics"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "The main plots not that interesting anyway. Would prefer more of these side stories honestly",
                                            "score": 11,
                                            "author": "Yedin07",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I enjoyed the main plot. Difference in opinion",
                                                    "score": -4,
                                                    "author": "Give_me_grunion"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "It was there to show that some people’s lives really *were* better after the apocalypse. And that adds weight to Joel finding his brother and discovering him and all these people are thriving. It helps you believe it’s real without a nagging sense of “something must be wrong here.”",
                                            "score": 2,
                                            "author": "Rook_to_Queen-1"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I thought it was an interesting choice. I liked the episode all in all. I disliked that the school bit was skipped and found the contrast between the relationships bill and Frank have in the game vs the show a little jarring. In the game Frank leaves bill to get a battery to leave the town and meet up with a smuggler to get to the Boston quarantine zone. He ends up getting bitten and hangs himself, then Joel and bill find him later on and find the letter he left bill. In the letter he calls bill and asshole and says dying is better then spending one more day with him. I just would like to have a comprehensive break down on what made them kinda flip this story for the tv show. Perhaps it gives a little more hope in a story that is very bleak overall.",
            "score": 9,
            "author": "BlackWolf127",
            "replies": [
                {
                    "level": 1,
                    "comment": "Bill serves as a sort of mirror to Joel to push him along in helping Ellie. In the game he represents what Joel could end up being if he continues to close himself off to everyone. Bitter and alone. In the show he represents what Joel could be if he starts letting people in. Full of life. So he served the same purpose as a character in a new an interesting way. And it would be pretty boring if the show was exactly the same as the game. Minor changes that don’t change the overarching story are welcome in my eyes",
                    "score": 21,
                    "author": "McLovin_OD",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I see I didn’t think about bills character that way. That’s a good point",
                            "score": 5,
                            "author": "BlackWolf127"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Out of the adjustments they made on the story, this was probably my favorite. Offerman and Bartlett did an amazing job as Bill and Frank. The only thing I miss would have been the dialogue between Bill and Ellie. Great adaptation, probably the best video game adaptation.",
            "score": 2,
            "author": "EngelSterben"
        },
        {
            "level": 0,
            "comment": "Bill was always my favorite character. Even more so with the show portraying him as they did. Nick Offerman is fantastic. Dude’s a G.",
            "score": 2,
            "author": "lilhippieboi"
        },
        {
            "level": 0,
            "comment": "I loved everything about this series and esp episode 3. It was super powerful",
            "score": 2,
            "author": "diarrhea_planet"
        },
        {
            "level": 0,
            "comment": "I really loved this episode. It felt like a genuine relationship",
            "score": 2,
            "author": "rebel_child12"
        },
        {
            "level": 0,
            "comment": "That episode was so well done.",
            "score": 2,
            "author": "The-Fanta-Menace"
        },
        {
            "level": 0,
            "comment": "That was a great episode.",
            "score": 2,
            "author": "HenryGrosmont"
        },
        {
            "level": 0,
            "comment": "I’m not a cryer by any means and this episode got me SO damn hard. Even days later I would think of it and tear up. I’m thinking of it now and getting a bit misty. Best episode of television I’ve seen in a LONG time.",
            "score": 2,
            "author": "Capable_Impression"
        },
        {
            "level": 0,
            "comment": "Not gay, made me cry.  One of the best episodes in TV history while still keeping it all tied to the overall show!",
            "score": 2,
            "author": "EmmittFitz-Hume"
        },
        {
            "level": 0,
            "comment": "Best romance I’ve ever seen in TV",
            "score": 2,
            "author": "DurinsBane20"
        },
        {
            "level": 0,
            "comment": "I thought it was sweet. The world ended and a simple request for shelter turned into this.\n\n\nI skipped through the sex scene cause I just don’t like sex scenes. But their relationship and how blah blah blah (watch the show it’s fucking good) happened kinda left me feeling crappy. \n\n\nGotta tell you, media adaptations of video games have been really good these past couple of years. This, Sonic, and Mario have been bangers.",
            "score": 14,
            "author": "mjknt2688",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sex scene was actually very brief and tasteful. Wasn’t just a bunch of banging, it was classy",
                    "score": 30,
                    "author": "staarfawkes",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah I know he was guiding him through and being sweet to him and everything it’s just i have personal reasons cause the last few people I’ve slept with made me uncomfortable with sexual/erotic stuff\n\nAside from that though the love story was beautiful and tragic. Very well written. And it’s cool because I played the game and you never really got to know his story. All you got was him saying he had a partner, a couple of passive-aggressive letters and then seeing his partner’s skeleton hanged in a part of the house, which…ehh you see why the TV version was better lol",
                            "score": 5,
                            "author": "mjknt2688"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Don't you dare feken jinx it😬",
                    "score": 3,
                    "author": "Pale-Office-133",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Incoming gritty, R-rated Crash Bandicoot",
                            "score": 13,
                            "author": "AintAintAWord",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Lol did u see Halo???",
                    "score": 2,
                    "author": "Homies-Brownies",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I’m sorry, I absolutely can’t agree about Sonic and Mario lol\n\nBut this show? Yeah, definitely.",
                    "score": 3,
                    "author": "that1LPdood",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "This and Arcane are the real pinnacle at the moment. Arcane seems to be slipping in visibility a bit though, which is a shame.",
                    "score": 1,
                    "author": "Enkundae"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It was very good! I didn’t finish the series because the episode after this felt like…not a path I wanted to go down. But I’m weird",
            "score": 2,
            "author": "tyfromtheinternet"
        },
        {
            "level": 0,
            "comment": "I’m still crying about this episode today",
            "score": 2,
            "author": "coding-on-skis"
        },
        {
            "level": 0,
            "comment": "Cool episode but it's a shame how the rest of the season turned out tbh.",
            "score": -8,
            "author": "BallsMahogany_redux",
            "replies": [
                {
                    "level": 1,
                    "comment": "My only complaint was not enough scenes with the infected.",
                    "score": 11,
                    "author": "Frank_chevelle",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The finale really fell flat. I felt like the first 3 episodes were so good, but it really went downhill after. It just ended up being very disappointing.",
                            "score": 4,
                            "author": "BallsMahogany_redux",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No infected anywhere so ofc finale felt flat. There is no real sacrifice.\n\n\"Let's kill this one girl so we can get immunity\"\n\n\"Immunity from what? cities are empty!\"",
                                    "score": 3,
                                    "author": "TheLinden"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I really liked this episode, but really hated they deviated from the original source material. Even if the love story between Frank and Bill remained, Bill served as a cautionary tale for Joel in the video game. A tragic hero, if you will. They created such a wonderfully complex character just to kill him off without creating any kind of obstacle for Joel and Ellie to reach their goal. I would have like to see him revert back to his “old” frame of mind after Frank’s death for at least one more episode.",
            "score": -2,
            "author": "toddles84",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not doing that was kind of the point. Bill serves the exact same function in the story but from the opposite end of the spectrum; Instead of a dire warning of what Joel might become if he continues as he is, Bill’s instead a light on what Joel could have if he lets himself heal. It makes the story not merely an adaptation of the original, but an actual companion piece that expands on it. That’s incredibly rare to see. \n\nThe change also serves the incredibly important function of injecting some joy, bittersweet as it is, into a show that without it would have just been straight misery porn. The show does a remarkably good job of examining the  concepts of grief and loss by showing different *kinds* of it with each new set of characters- all of which themselves reflect snd inform Joel and Ellie’s story. The alternate take on Bill and Franks story is an important piece of that. \n\nLastly it subverts the trope of introducing a queer character just to have them suffer and die. Instead we get to see a pair of gay men live out a full and fulfilled life, something hardly ever put on screen. Especially it projects of this size.  \n\nFrom every angle I think they made the absolute best choice with the change.",
                    "score": 13,
                    "author": "Enkundae",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You make great points. But this is very Campbell-Esque in the way it serves our main protagonist. Was it a perfect blend? No. I disagree there. Plot drives the story. Obviously, character conflict contributes to it, but in this instance, there was none. The goal for Ellie and Joel was to reach Bill to replace the stolen car battery that Tess and Joel had acquired and lost in the sub-plot. That was the obstacle and it was ignored. Bill and Frank die and leave the car for them to continue their journey without any obstacle and/or conflict. Like I said, he was a wonderful and complex character. I would have liked to see more where Bill serves as that final warning. This is what life will be like without her.",
                            "score": -3,
                            "author": "toddles84",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Plot driven story telling is only one kind of story telling. This is a character driven and focused story. Acquiring the truck is just a mechanical function of the plot, a device to get the character narratively from A to B so the real point of that narrative can be explored; the importance of human connection and it’s potential power to heal. The actual obstacle isn’t acquiring physical transportation, thats just a background goal to give the story a loose direction, the actual obstacle at the heart of the story is Joel’s inability to face connection, something showcased with him walking away from Tess without a word the previous episode and starting this one refusing to confront what she meant to him. He achieves the background goal of the truck after being pushed to start making a real connection with Ellie and that is done through Bill’s letter, the weight of which the audience feels because of how the episode informed us of his life with Frank. And that weight is reflected in what Joel *could* have had with Tess if he’d let himself open up back then, and what he *can* have with Ellie if he does so now.",
                                    "score": 5,
                                    "author": "Enkundae",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "We’re going to agree to disagree here. Your points are completely valid. I’m not the show runner so what does it matter?  All I’m saying is that plot should trump character. Bill served a purpose in both interpretations. My only point is that when it comes to survival horror, plot should alway trump character arc especially when you simply designated one episode to explain it all. Bill, Joel, and Ellie deserved much more exploration into this theme than just a cut and dry, black and white scenario. Maybe it’s me just being selfish and wanting more Bill. I don’t think that’s hard to understand. Taking care of someone with a terminal illness isn’t that way. Trust me. I know. It’s not easy. There’s a lot of bitterness and resentment you feel towards the world. We could have explored that lore with Bill.",
                                            "score": 0,
                                            "author": "toddles84"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Fake ass Joel and Tommy.",
            "score": 1,
            "author": "Mypossesonbroadwayy"
        },
        {
            "level": 0,
            "comment": "The changes they made from the game were definitely for the better. This episode gave me the feels.",
            "score": 1,
            "author": "Development_Infinite"
        },
        {
            "level": 0,
            "comment": "Whole season was poorly done. I would've considered it a great show if they had zombies in the background of their drama, like in the The Walking Dead.....",
            "score": -6,
            "author": "Longjumping_Visit718",
            "replies": [
                {
                    "level": 1,
                    "comment": "I consider It the most faithful adaptation of a video game to screen.\n\nThey have literal lines of dialogue and scenes recreated because, 10 years ago, they were already perfect.",
                    "score": 4,
                    "author": "Tyndael87",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "But no clickers. Go figure. They're there the first 2 episodes, then the 4th, and then we might as well be watching a long-form Children of Men rip-off. I don't mind if people felt it copied The Walking Dead too much but not enough zombies really ruins the vibe for me. Big long sections of it were just talking, with no tension, because the threats they're facing don't feel real or compelling.",
                            "score": 0,
                            "author": "Longjumping_Visit718",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well,\n\nThey were never going to make a 1-1 remake.\n\nIf you want that, you already got that in the game.\n\nWhat this did, was take the points you WOULD complain about (the talky points) to help expand on the universe.\n\nThere are decisions in the show that in my opinion are miles better than the game.\n\nGood example is the bill episode.\n\nI did not want an epaidoe of the three of them shooting clickers with shotguns. I got that in the game.\n\nWhat i did want (done beautifully) is a deeper dive into who bill is, so that I can appreciate him more in the game.\n\nFuck, that episode alone was a perfect love story/zombie film on its own accord.",
                                    "score": 2,
                                    "author": "Tyndael87",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I never said I wanted that, what I want is for the Clickers to be relevant to the plot again. Most of the show played out a cheap soap and the Clickers would have been a big part of making that not true...",
                                            "score": 1,
                                            "author": "Longjumping_Visit718"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "CENSORED - NO OPINIONS!",
            "score": -30,
            "author": "the_REVERENDGREEN",
            "replies": [
                {
                    "level": 1,
                    "comment": "Disagree, just felt like expansion of the world",
                    "score": 21,
                    "author": "FingerDrinker",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "EXACTLY. Loved the game and loved the show, and this was my favorite change between the two.\n\nIn the game, Bill is a DEPRESSING example of what Joel could become. Surviving for nothing, with nobody at all. Driving away anyone who could possibly love him. Game version of Frank abandons Bill as a hopeless maniac and curses him out to his last breath. He quite literally names Bill and his suicide note and says he is a piece of shit. Because Bill remained bitter and realist and destroyed their relationship.\n\nIn the show, Bill is a HOPEFUL example of what Joel could become. They are identical people, the ruthless realists who defend their idealist partners (Frank for Bill, Tess and later Ellie for Joel). Bill has everything he needs to live a long long time in this apocalypse...but his relationship with Frank proves his survival alone would not be a LIFE, and what is the point of survival without a life? \n\nSo Bill saw the light. He realized that Joel has the chance to not just survive, but be happy, if he opened up to Tess the same way Bill opened up to Frank. His letter is a gift from one \"violent motherfucker\" to another to be happy.\n\nThe beautiful tragedy is, **it's too late**. Tess is already dead, and they never had their chance to be anything more because Joel never opened his heart up. Kept it locked tight after losing his daughter.\n\nThis is a critical catalyst for Joel and Ellie. Bill is the closest mindset and personality to Joel that we ever see in the show. If even Bill thinks that Joel should open up and love someone, then Joel knows it's legitimate advice and it's real. Tess is no longer there and there's only one person Joel can live for now, and that's Ellie.\n\nHe continues to become more and more paternal to her from this moment onward. Staying up all night and not waking her up for a shift on watch in the next episode, making sure she's okay after she kills a man in the next episode after that, and so on and so on and so on until he has fully committed to being her \"father\".\n\nThis episode isn't just an expansion of the world, it is a crucial piece of storytelling. \n\nGame version of Bill and Frank is great for the game. Show version of Bill and Frank is great for the show. Overall this episode is a great example of why you need to decide if you SHOULD change things and HOW in an adaptation to another medium.",
                            "score": 9,
                            "author": "Nitrostoat"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Not everything has to advance the plot. Sometimes, you just want to linger. As to how did this contribute to the show in any meaningful way: we are talking about it right now. Not about the fungus zombies or some badass action sequence, but about two men... who found love in the apocalypse.",
                    "score": 15,
                    "author": "NeuroticKrill",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "James Cameron has said the same thing - executives wanted to cut some of the scenes just showing the beauty of avatar - lingering flying scenes I think",
                            "score": 6,
                            "author": "blowhardV2"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Tell me more how you don't understand world building, thematic parallels, or character expansion",
                    "score": 6,
                    "author": "sprint6864",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "It’s not a problem. I don’t think anything with it was wrong.\n\nA lot of people really enjoy seeing side stories. It’s like in video games when people choose to read all the non related emails on computers. This is just an expansion on one of those which I thought was great and fun. I enjoy reading those when I play games! \n\nIt was mostly a world building episode that helped set the universe. This episode, to me, mattered because it expanded on the world in a different way. We saw a genuinely happy who had their faith in humanity resorted. This is very different from literally every other thing we’re shown about the world now. Our heroes are jaded and the future is bleak, but the episode showed us that hope and light still exist. It’s their love for one another that influenced Joel and Tess positively in unique ways.\n\nThe more I think about it, the more I love that it is two gay men. The apocalypse happened in 2003, that’s prior to gay marriage being legalized and when many states had gay sex criminalized. In this universe, these characters specifically benefited from the apocalypse happening. They would’ve never been truly happy if it didn’t. The series shows how awful life is now, but this specific side story showed that it isn’t all awful. Some people achieved true freedom. It’s a taste of life outside of corruption! \n\nThis episode gave us a more balanced view of the world as it is in the wake of the apocalypse.",
                    "score": 2,
                    "author": "Psychological_Car849"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lol I'll be honest I'm an ally and all that. But fuck this episode it was so god damn dumb and full of plot holes. Who tf stands in the middle of an open street without cover and let's people take potshots at them while they stand out in the middle of the rain. Was dumb AF.",
            "score": -19,
            "author": "Mrhood714",
            "replies": [
                {
                    "level": 1,
                    "comment": "He was doing fine until Frank distracted him",
                    "score": 3,
                    "author": "emcee70"
                },
                {
                    "level": 1,
                    "comment": "This comment is the equivalent of an, “I’m not racist but…!”",
                    "score": 18,
                    "author": "chadwicke619",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I don’t think you know what a plot hole is.",
                    "score": 8,
                    "author": "saucehot2000",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Only episode that really mattered to me. Skipped rest of show.",
            "score": -10,
            "author": "Firm_Masterpiece_343",
            "replies": [
                {
                    "level": 1,
                    "comment": "If you didn’t watch the other episodes how could you know if they did or did not matter?",
                    "score": 16,
                    "author": "cedarvalleyct",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "People are just raggin to be contrarians",
                            "score": 12,
                            "author": "sprint6864",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Because I beat the game. And Part 2 aka murder simulator.",
                            "score": 2,
                            "author": "Firm_Masterpiece_343",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Ironically its the episode that caused me to fall off entirely lol",
                    "score": -2,
                    "author": "VanillaVideo",
                    "replies": []
                }
            ]
        }
    ]
}