{
    "id": "146hej4",
    "score": 767,
    "title": "Tenoch Huerta has been accused of sexual assault",
    "author": "SwimGood22",
    "date": 1686448195.0,
    "url": "https://www.reddit.com/r/entertainment/comments/146hej4",
    "media_urls": [
        "https://www.reforma.com/aplicacioneslibre/preacceso/articulo/default.aspx?__rval=1&amp;urlredirect=/maria-elena-rios-senala-de-depredador-sexual-a-tenoch-huerta/ar2620608"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Marvel PR trying to make it through a single week\n\n![gif](giphy|QMHoU66sBXqqLqYvGO)",
            "score": 615,
            "author": "grinch1225",
            "replies": [
                {
                    "level": 1,
                    "comment": "He isn't really a top priority for Marvel, hr can easily go down as a one and done character. Jonathan Mayors on the other hand the whole new saga is made around him so he is really important to the MCU.",
                    "score": 188,
                    "author": "XuX24",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wasn’t everyone’s cup of tea but Lovecraft Country was rad and I was looking forward to him doing more weird sci-fi horror stuff. Too bad he turned out to be a human pile of trash.",
                            "score": 91,
                            "author": "FuktOff666",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Lovecraft country was awesome, I hated that it got canceled.",
                                    "score": 53,
                                    "author": "XuX24",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I mean it couldn’t really go on tbh. It feels like Michael K. Williams died a month after the last episode. You could write around that, but i think it’s maybe better to leave it a self-contained work rather than butchering it. Seeing West World from start to finish has seriously shaken my confidence on HBO",
                                            "score": 38,
                                            "author": "B1-Bloom",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You should check out a show called Game of Thrones.",
                                                    "score": 5,
                                                    "author": "Champaganthony"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Seriously, season one was a goddamn masterpiece of television, and it just went off a cliff with season two. I never did finish season 3, had like three episodes left when I finally said “why am I wasting my time on this” and just bailed on it.",
                                                    "score": 18,
                                                    "author": "RedLightsBurning75"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "They really blew it with WW. All they had to do was a couple few seasons in different parts of the park slowly teasing out the sentience angle. The show should’ve ended with the machines taking over the park.",
                                                    "score": 8,
                                                    "author": "Sharticus123"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "They couldn't give us the final season. They could've animated the last season of Westworld to cut down on price.",
                                                    "score": 2,
                                                    "author": "J_Beyonder"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "wasn’t canceled just a one and done miniseries. was based on a book and the show covered everything in the book",
                                            "score": 8,
                                            "author": "aquanautical"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "The plot are terrible only work for 3 first eps, it say lovecraft but only dog monster which appaer in this show, then tentacle girl if she part of Lovecraftian.\n\nAnd what tuef with the ending really confusing, the chars switch side and side very fast",
                                            "score": -1,
                                            "author": "stormatombd"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I’m sure this will get buried, but you have to understand what a horrible take that is. I literally know nothing about this man at all and have no stake in this game, but I find it  a palling, a man who has not even a even been charged with a crime. Hell, I can’t even find an article about these accusations in my native language so for you to write him off instantly as a human piece of garbage is a little absurd, We shouldn’t question accusers and we shouldn’t demonize the accused. Honestly, the court of public opinion should stay out of these matters in general.",
                                    "score": -1,
                                    "author": "TTommyfresh",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I mean he hit his girlfriend and then thought it was appropriate to release texts from her where she apologizes for grabbing his phone, which allegedly led to him hitting her. Like clear Stockholm syndrome shit.\n\nRegardless of the scale of his actions, it’s becoming quite clear he’s not a good dude. I mean the theatre community didn’t hesitate to co-sign the abuser accusations.",
                                            "score": 23,
                                            "author": "FKDotFitzgerald"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Im not OP.  When Majors got arrested I asked a few friends who have been in NYC acting circles for decades who know him. No one was surprised that he was charged with assault. Apparently he has a history of this.",
                                            "score": 10,
                                            "author": "Fusion_Corp"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I mean everything he released in his defence stacked up to him being a domestic abuser. Disney aren’t exactly closing ranks around him. That’s not because of public outrage. It’s cause he is guilty as fuck. Do you wait for a criminal conviction before you decide someone sucks? It’s court of public opinion and this dude can eat shit.",
                                            "score": 31,
                                            "author": "b3834330"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I understand where you are coming from, but the problem with sexual assault is that most rapes aren't reported, and even amongst those reported, a minority of them result in an actual prosecution. There is a reason why public opinion when it comes to sexual assault is not innocent until proven guilty. The burden of proof is placed on survivors of sexual assault so much that most of them don't want to even go through the procedures of reporting. Besides, we have to acknowledge that verdicts in court are approximations of cases and not necessarily reflective of reality.",
                                            "score": 17,
                                            "author": "IamHere-4U"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I think this is exactly the problem, and the fact that no one‘s willing to see this is sad. I took one view at the comments to what I said, and it’s just indecisive discourse. We have laws in place as a society for a reason and while they are not full proof, we can’t just go around touting our own in this righteous conviction and not a single person has agreed on what this dude did because in reality two parties were there the accuser and the accused, so yeah, it’s ridiculous for us to debate this. In the comments we should just let this play out in the law, and if we feel like some injustice took place in that court of law, then we have outcry. But until then, this is all futile and just muddying the waters. Once again, I don’t know who this dude is, but everyone has the right to not be judged until some kind of circumstantial evidence comes out to prove they did the crime they’re accused of until then it’s none of our business, lastly, until there’s some kind of hard evidence no one should be making a legal decision on this man’s guilt",
                                            "score": 0,
                                            "author": "TTommyfresh"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Have I read the wrong news or what? I thought it came to light that she was lying and there were witnesses",
                                    "score": -8,
                                    "author": "mofongoDorado",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Haven’t seen that yet, last I heard only one of the charges were dropped against him but a bunch of others came forward with additional allegations of abuse.",
                                            "score": 11,
                                            "author": "SIEGE312"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Majors? At first there was spin that came out saying there was proof he was innocent...\nBut at least part of that \"proof\" was a text the abused woman sent him, from the hospital, saying something like \"I'm sorry I made you hit me, I shouldn't have taken your phone. Please don't leave me, I didn't even want them to press charges\". Classic victim language, blaming themselves. Poor thing.\n\nIt's not clear if it was Majors who thought it would clear him, but it obviously backfired, and he got dropped by his management &amp; PR - which is basically them saying he's a hot piece of trash they can't save. Which is saying something.",
                                            "score": 10,
                                            "author": "vololov"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "You misunderstood the news. The NYC DA is still prosecuting him. He is facing prison time for this.",
                                            "score": 3,
                                            "author": "Fusion_Corp"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Here’s the problem, you automatically take an accusation as fact and throw the dude under the bus. Lame",
                                    "score": -1,
                                    "author": "MasChingonNoHay"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Jonathan majors can easily be replaced with John Boyega",
                            "score": 6,
                            "author": "MaliScholar",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I wouldn’t mind this. Especially after how the Star Wars franchise did him dirty. He easily had the most interesting and original storyline that they just dropped.",
                                    "score": 6,
                                    "author": "tabascorascal1",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "only problem is mouse owns star wars and marvel. he may not be interested.",
                                            "score": 2,
                                            "author": "AweHellYo"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Kang is super easy to recast though as Kang can be anyone or anything. They can recast Sally Field as Kang knowing they are getting someone who likely hasn't been an abusive creep in a while.",
                            "score": 7,
                            "author": "Fusion_Corp"
                        },
                        {
                            "level": 2,
                            "comment": "You are high if you think Namor isn’t a major Marvel character. He’s actually one of the only characters officially confirmed for the next Avengers movie.",
                            "score": 13,
                            "author": "meme_abstinent"
                        },
                        {
                            "level": 2,
                            "comment": "Dude Namor is supposed to be a recurring enemy/anti hero. He is supposed to interact with F4",
                            "score": 5,
                            "author": "jotyma5"
                        },
                        {
                            "level": 2,
                            "comment": "I agree about Majors, hands down. Really hoping the allegations are unfounded but just have to wait and see\n\nAs for Huerta, I’d disagree that Marvel doesn’t have priority. Introducing Talokan and their super powered people will likely have roles (setting up the Wakanda/Talokan ally ship at the end) and replacing a person who played their 500 year old deity is somewhat major\n\nNot as important as Kang, I agree, but still important",
                            "score": 2,
                            "author": "grinch1225"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Do people forget that these folks are innocent until proven guilty? This is America.",
                    "score": 0,
                    "author": "KingMurchada",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Do people really not understand that PR has little to do with the outcome and everything to do with appearances?",
                            "score": 2,
                            "author": "grinch1225",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Did you really miss that I was actually observing and making remarks about the comments here instead? Lol",
                                    "score": 1,
                                    "author": "KingMurchada"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Gotta say…the Marvel casting director is *nailing* these villains.",
            "score": 378,
            "author": "Sixtyhurts",
            "replies": [
                {
                    "level": 1,
                    "comment": "He really was without love.",
                    "score": 53,
                    "author": "The_Wrong_Band"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Canonically accurate Namor behavior",
            "score": 140,
            "author": "TheCorinater",
            "replies": [
                {
                    "level": 1,
                    "comment": "Is it wrong I laughed because of the accuracy?",
                    "score": 33,
                    "author": "thereverendpuck",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I haven’t read the article but if the woman he assaulted was a blonde white lady who gets ignored by her husband constantly?\n\nThen this was the absolute worst form of method acting imaginable.",
                            "score": 4,
                            "author": "Gladiatornoah"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Kang and Namor are really doing the most these days.",
            "score": 14,
            "author": "ike_tyson"
        },
        {
            "level": 0,
            "comment": "accused of sexual assault by saxophonist María Elena Ríos.\n\nRios also answers a few commentators and seemingly confirms that she was sexually assaulted by Huerta and that there are several other victims as well. She also tells another user that there she is in no rush to provide details, but implies that those will be out in due time, presumably as more victims come forward.",
            "score": 102,
            "author": "blac_sheep90",
            "replies": [
                {
                    "level": 1,
                    "comment": "Forgot to mention, María Elena Ríos, acid attack and feminicide attempt survivor. If the allegations are true, Tenoch is a bigger garbage human being than the rest of them. But knowing the kind of person he is, he just tried to get closer to her to appeal to the feminists and appear more \"ethnic\" since she's from Oaxaca. Tenoch is seen in México as an opportunist already but this is low, even for him.",
                    "score": 87,
                    "author": "elathan_i",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Damn didn't know that.",
                            "score": 23,
                            "author": "blac_sheep90",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He's an opportunistic piece of human garbage, he probably did it to try to use her fame for publicity.",
                                    "score": 22,
                                    "author": "elathan_i",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;But knowing the kind of person he is, he just tried to get closer to her to appeal to the feminists and appear more \"ethnic\" since she's from Oaxaca. \n\nHow do you know all this shit?",
                                            "score": 32,
                                            "author": "stormatombd",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "He has a long history in Mexico and is heavily disliked here for it. He’s an opportunistic, hypocritical sell out.",
                                                    "score": 26,
                                                    "author": "a_dry_banana",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Lol, it suprising how they survive for 3 phase before without any their actor doing bad shit.... If we not count william hurt allegation that really thin like air adn rdj shit before he got ij iron man, all 3 phase actor are clean. Then somehow now we got major, this guy and the father from ms marvel",
                                                            "score": 4,
                                                            "author": "stormatombd"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "What? I thought he was an anti racist?",
                                                            "score": 4,
                                                            "author": "Youwontbreakmysoul",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "He’s anti racist in the way black Israelites are anti racist.",
                                                                    "score": 11,
                                                                    "author": "a_dry_banana"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "He uses race and \"brown-ness\" to get popularity, but outside of the US facade, in México he's a classist, homophobic, machista dumbass.",
                                                                    "score": 14,
                                                                    "author": "elathan_i",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Plus a fucking capital centric ass hole, it’s known that the guy likes to denigrate people from outside the capital and when criticized he always protects him self with calling everyone a racist.",
                                                                            "score": 9,
                                                                            "author": "a_dry_banana"
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Oh my, I had no idea. Especially about the homophobia.",
                                                                            "score": 5,
                                                                            "author": "Youwontbreakmysoul",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "He literally has a face for English speakers and another for Spanish speakers. That's why he's hated here.",
                                                                                    "score": 7,
                                                                                    "author": "elathan_i",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "His only card is \"I'm ethnic, look at me\", it's a guess honestly but it wouldn't surprise me if he used the currently most famous feminist activist from an ethnic background, to increase his popularity. He's a grifter.",
                                                    "score": 2,
                                                    "author": "elathan_i"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "How hard is it to *not* sexually assault someone?!",
            "score": 151,
            "author": "DiscussionExpert90",
            "replies": [
                {
                    "level": 1,
                    "comment": "Given that so many people have experienced a sexual assault in their life, its apparently really difficult somehow",
                    "score": 35,
                    "author": "Itz_Hen"
                },
                {
                    "level": 1,
                    "comment": "Idk I just do this thing where I don’t touch people who don’t want me to touch them and it works pretty well for me.",
                    "score": 61,
                    "author": "--Stabstract--",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah I hate it when I accidentally had even the slightest physical contact with a stranger. I don't get why you'd want to touch others other than your SO.",
                            "score": 4,
                            "author": "ReDevilShin",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I literally avoid touching people if I’m slipping through anything even slightly crowded. Everything from my arms, hoodie, even my footing will avoid anything close to contact.\n\nTruly puzzling",
                                    "score": 1,
                                    "author": "Nox11399"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "For someone who gets everything? Probably a 7",
                    "score": 3,
                    "author": "ShinRaiYoken"
                },
                {
                    "level": 1,
                    "comment": "I mean, what else can you do when they don’t want to have sex with you?  /s",
                    "score": 3,
                    "author": "irotinmyskin"
                },
                {
                    "level": 1,
                    "comment": "It's like the people who crave limelight and fame are also highly prone to be abusive piece of shits. Like CEOs tend to be psychopaths.",
                    "score": 10,
                    "author": "-boozypanda"
                },
                {
                    "level": 1,
                    "comment": "How hard is it for Marvel to vet their actors?",
                    "score": 7,
                    "author": "StudBoi69",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Tbf, what are you gonna do? Call every person that every actor has ever talked to? If she didn't come forward until now, it can likely be assumed she hadn't told a ton of people.",
                            "score": 23,
                            "author": "BalonSwann07",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He had allegations in Mexico years before BP2",
                                    "score": 37,
                                    "author": "StudBoi69",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ah, yeah. Sloppy then",
                                            "score": 15,
                                            "author": "BalonSwann07"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Black Fanther",
                                            "score": 1,
                                            "author": "armless_tavern"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "To be fair, they started with Robert Downey Jr.",
                            "score": 2,
                            "author": "MLein97",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Drug addicts and physical abusers are not the same thing",
                                    "score": 9,
                                    "author": "AdmiralCharleston",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Lol tell that to ppl still accuse depp until now",
                                            "score": -8,
                                            "author": "stormatombd",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I mean, depp is both a drug addict and an abuser, not a great example",
                                                    "score": 6,
                                                    "author": "AdmiralCharleston",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "How he abuser?\n\nSo you one of those ppl",
                                                            "score": -4,
                                                            "author": "stormatombd",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Because he is one? Idk what you know about the trial beyond social media but the idea that he is innocent in that regard is completely against the facts and his own word",
                                                                    "score": 5,
                                                                    "author": "AdmiralCharleston",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I watch his entire trial. And he is innocent so\n\nSo, I asking again how he abuser!",
                                                                            "score": -6,
                                                                            "author": "stormatombd",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "If you watched the trial you'd know that he wasn't found innocent, it was a libel trial which was heavily biased given that the unsealed court documents prove he was lying about most of the instances of him being supposedly abused and not bringing up the timed he had admitted to abusing Amber.  Not to mention that he lost the UK trial where he was found to be responsible for 23 instances of abuse",
                                                                                    "score": 3,
                                                                                    "author": "AdmiralCharleston",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "i think it’s borderline impossible for dudes with money",
                    "score": 2,
                    "author": "jonsbryhill"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Disney can recast/grab a Namor from a different universe, no big deal. Who is going to remember this one if a new Namor pops into a Fantastic Four movie some years down the road anyway.",
            "score": 100,
            "author": "JustrousRestortion",
            "replies": [
                {
                    "level": 1,
                    "comment": "Honestly, he didn't even do that great of a Namor. \n\nThe kid from the flash back scene, when he orders the massacre of those priests tho? He fucking killed it",
                    "score": 52,
                    "author": "oxP3ZINATORxo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Idk if he did a great namor or not bc I haven’t read many comics but I thought he acted well",
                            "score": 55,
                            "author": "superduperdoobyduper",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah. People are gonna start acting like they didn’t like his performance cause of this news. \n\nLike he can be a goof actor and an abuser lol",
                                    "score": 86,
                                    "author": "mellowgang__",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah he done goofed.",
                                            "score": 15,
                                            "author": "palaceofexile"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I'm not denying that he did a good job or that he's a good actor. Just that he didn't lean in hard enough to one of Namor's most prominent personality features. Which is why I said the kid did a better job of that. And I've maintained that since the movie came out\n\nKid came out of the bushes on the priests. Looks around and doesn't like what he sees. Rises into the air, while simultaneously ordering his men to attack by raising his arms. All while not saying a word. All while maintaining the same apathetic look. Like it was all beneath him\n\nIt was beautiful",
                                            "score": 5,
                                            "author": "oxP3ZINATORxo",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Lol the kids even not talking single line 🤣, how do you now he deliver it better🤣",
                                                    "score": 4,
                                                    "author": "stormatombd"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "In this case he wasn't great at all though. That movie peaked in the first 10 minutes when they had the funeral.",
                                            "score": 2,
                                            "author": "autistic_hybrid"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I love comic Namor. Homie did well.",
                                    "score": 6,
                                    "author": "--Stabstract--"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Probably cause he wasn’t white huh",
                            "score": -15,
                            "author": "thuggishhh",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Do you think you're gonna get far accusing people of not liking any actor who isn't white, or? \n\nI didn't particularly like this guy's acting but I also thought he was given bad writing. But I think Jonathan Majors is one of the best actors to come out in the last few years. \n\nBut skin color or some such",
                                    "score": 5,
                                    "author": "BalonSwann07",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I rescind my statement. It was made in ignorance. Maybe I’m a bit biased because of my Mexican heritage so maybe I was watching the movie through a different lens and ignored the writing.",
                                            "score": -3,
                                            "author": "thuggishhh"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "What? No? The kid wasn't white either? It's cuz he didn't play the arrogance hard enough. Namor is a huge fucking ass hole in the comics, like barely worth his time to look at you arrogant",
                                    "score": 4,
                                    "author": "oxP3ZINATORxo",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Honestly I thought it was played great one of the better villains in the MCU in awhile.",
                                            "score": 3,
                                            "author": "thuggishhh",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I'm not denying that he did a good job. Just that he didn't lean in hard enough to one of Namor's most prominent personality features. Which is why I said the kid did a better job of that.\n\nKid came out of the bushes on the priests. Looks around and doesn't like what he sees. Rises into the air, while simultaneously ordering his men to attack by raising his arms. All while not saying a word. All while maintaining the same apathetic look. Like it was all beneath him\n\nIt was beautiful",
                                                    "score": 0,
                                                    "author": "oxP3ZINATORxo",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Right but the has a scene or two to play with where as Huerta has the whole film. More room for him to have some scene that miss. Can you say he didn’t have one that had the same effect?",
                                                            "score": 1,
                                                            "author": "thuggishhh"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "But the delicate marvel mind can’t handle it! That’s what all the anti recast TChalla people say",
                    "score": 2,
                    "author": "Screenwriter6788",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "difference being that the first Black Panther was a good movie and Huerta didn't deliver a memorable performance after which he suddenly died",
                            "score": 0,
                            "author": "JustrousRestortion"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Ik it wouldn’t fit the vibe they’re going for for this version but uhh… Luke evans would kill it",
                    "score": 1,
                    "author": "ItssHarrison"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lol, it suprising they survive 3 phase without any scandal before 😅",
            "score": 8,
            "author": "stormatombd",
            "replies": [
                {
                    "level": 1,
                    "comment": "Was it the new CEO in charge? I blame that guy.",
                    "score": -1,
                    "author": "NotSoNiceO1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The new CEO is actually the old CEO.",
                            "score": 8,
                            "author": "secretreddname",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "But it was the new CEO during the period of bleh then the old CEO retook-over, no?",
                                    "score": 1,
                                    "author": "NotSoNiceO1",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "But ceo not deal anything with any casting shit and the behavior of the actor, it casting director job",
                                            "score": 3,
                                            "author": "stormatombd"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Yup. Replacement was mucking things up for Disney as a whole so the board kicked him out and brought back the old guy.",
                                            "score": 2,
                                            "author": "secretreddname"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "They are still playing the villain a little too much.",
            "score": 30,
            "author": "Rohit_BFire"
        },
        {
            "level": 0,
            "comment": "Ugh. Why, oh why.",
            "score": 29,
            "author": "trent58"
        },
        {
            "level": 0,
            "comment": "I’ll take “Not reading the fucking article” for $800, Alex",
            "score": 5,
            "author": "Senior-Jaguar-1018"
        },
        {
            "level": 0,
            "comment": "We need to differentiate between \"formally\" accusing and \"social media\" accusing. It's an important distinction and the court of public opinion can be ruthless without a single shred of proper evidence.",
            "score": 17,
            "author": "JustAnotherAlgo",
            "replies": [
                {
                    "level": 1,
                    "comment": "This article doesn't even have an author and it wants you to sign in with a social media account. Looks like click bait designed to steal your data. When there is an actual news article I will take it seriously.",
                    "score": 4,
                    "author": "Whisky_Wolf"
                },
                {
                    "level": 1,
                    "comment": "It's quite interesting that an accusation is all that people need 🤷‍♂️",
                    "score": 9,
                    "author": "Fruloops"
                },
                {
                    "level": 1,
                    "comment": "most sane comment, only for these types of allegations where a woman accuses a man is it “guilty until proven innocent” whereas with every other allegation its “innocent until proven guilty” … case in point all the rabid comments in the thread",
                    "score": 5,
                    "author": "darthseedious"
                },
                {
                    "level": 1,
                    "comment": "Doubt this will ever be this a thing unfortunately. People really like to get that pitch fork out. When it comes out it’s bs nothing will be corrected and this guys rep will just go down the drain.",
                    "score": 1,
                    "author": "Talexis"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So the other article on this topic points out that the accuser also accused several members of the anti-racism organization he’s a part of. She’s also accusing them of not paying her for a podcast appearance. I think we should wait for details before making a judgement call",
            "score": 2,
            "author": "Maria-Stryker"
        },
        {
            "level": 0,
            "comment": "Method Acting for Namors next big screen appearance",
            "score": 5,
            "author": "NotInstaNormie"
        },
        {
            "level": 0,
            "comment": "Can we take note that no reliable big source news website has posted about this yet, it all the sites people always say not to trust (comic book movie, we got this covered, the direct etc)",
            "score": 8,
            "author": "MIAxPaperPlanes",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s being heavily reported in Mexican media. The woman who accused him is a well known member of the feminist and anti femenicide movement in Mexico.",
                    "score": 14,
                    "author": "a_dry_banana"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Replace him with his brother Diego Luna.",
            "score": 3,
            "author": "Ronburgundy2099"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Wow you all will really hate someone and attack them without any proof. It's like people wait for these accusations. It's such a lie because she didn't get paid by somebody and is now looking for attention. I'm a woman myself and I don't believe these celebrity accusations anymore.",
            "score": 3,
            "author": "PinkPrincess-2001"
        },
        {
            "level": 0,
            "comment": "Everyone is comparing this to Jonathon Majors, I for one will wait for more information to come out before forming an opinion.\n\nI did the same with Majors, then the texts came out where she apologized for grabbing his phone, was pretty damning, and then his team said they’d release the videos, and I thought “Okay, I’ll wait for the videos.”\n\nThen they never came, and Majors’ PR team and attorneys dropped him. That to me said more guilt than anything, and here we are months later, still no videos, or any proof Majors is innocent, so I can assume he did it.\n\nThis seems… less genuine, but still a potential actual thing that happened.",
            "score": 2,
            "author": "KrookedDoesStuff"
        },
        {
            "level": 0,
            "comment": "Meh....I still think they should recast weasel (TJ Miller) in Deadpool 3 with a black dude.",
            "score": -8,
            "author": "Vladius28",
            "replies": [
                {
                    "level": 1,
                    "comment": "This could actually work just because it's Deadpool.\n\nNo one notices but him and it freaks him out and he struggles to express it and worries about getting canceled. Have him grumble about casting continuity.\n\nReference the Black Tom joke, have Cable turn the tables on him without realizing it.\n\nThen near the end of the movie he just kind of gets over it and accepts it as the cast needing more diversity and just goes with it while still being aware of it.\n\nIf they really want to go all in on it, have Weasel reference scenes from previous movies and reshoot them with the new actor as a flashback, only have Deadpool be very confused about the flashback featuring the new actor and have him insist something is different without being able to say exactly what it is.\n\nThis would work with any actor really, but having them be as physically different from TJ Miller as possible would just make it funnier.\n\nCast Lavell Crawford as Weasel.\n\nMake Wade sound like he's freaked out because he's black for the whole movie, and then in a post credits scene reveal he's really just freaked out because he's so much bigger.",
                    "score": 4,
                    "author": "contrabardus",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think its a perfect and topical Deadpool gag. In my mind, they do weasels first scene (with a weasel-like black dude)  like nothing is different. At the end of the scene Deadpool lifts his mask, looks at the  audience and says \"deal with it... or comments section should be fun...\"  and then never address it again",
                            "score": 1,
                            "author": "Vladius28"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Easiest way to fuck up a man’s career. Now if’s true, fuck this guy.",
            "score": 1,
            "author": "lenchoreddit"
        },
        {
            "level": 0,
            "comment": "It’s called method acting",
            "score": 1,
            "author": "georgelamarmateo"
        },
        {
            "level": 0,
            "comment": "&amp; just like that Namor was no more",
            "score": 1,
            "author": "Dr-A-1"
        },
        {
            "level": 0,
            "comment": "Method acting to be Namor",
            "score": 1,
            "author": "neon_sin"
        },
        {
            "level": 0,
            "comment": "Shocked pikachu face?",
            "score": 1,
            "author": "Dr_Will_Kirby"
        },
        {
            "level": 0,
            "comment": "Marvel can’t catch a break!!!! Now recast TChalla to draw attention away!",
            "score": -1,
            "author": "Screenwriter6788"
        },
        {
            "level": 0,
            "comment": "Also, shouldn't his character in \"Black Panther\" have had a body that looked like it actually spent some time swimming.  Worst swimmers body ever..dad body with  winged feet....hahaha",
            "score": -1,
            "author": "Business_Ad3142"
        },
        {
            "level": 0,
            "comment": "Guilty until proven innocent IG",
            "score": -1,
            "author": "throwaway69662"
        }
    ]
}