{
    "id": "146l3jv",
    "score": 3440,
    "title": "Sylvester Stallone Says Arnold Schwarzenegger “Was Superior”: “He Had The Body, He Had The Strength”",
    "author": "AliceTheMagicQueen",
    "date": 1686460078.0,
    "url": "https://www.reddit.com/r/entertainment/comments/146l3jv",
    "media_urls": [
        "https://deadline.com/2023/06/sylvester-stallone-arnold-schwarzenegger-superior-1235413733/"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Sylvester Stallone and Arnold Schwarzenegger are best known for their action movies from the 80s. As part of the Netflix docuseries Arnold, Stallone is recalling his former bitter rivalry with Schwarzenegger and giving him props.\n\n“The ’80s was a very interesting time because the definitive ‘action guy’ had not really been formed yet,” Stallone says. “Up until that time, action was a car chase like Bullitt or The French Connection, and a film all about intellect and innuendo and verbal this and verbal that.”\n\nStallone determines that it was with First Blood, released in 1982, that action movies changed saying, “You actually relied upon your body to tell the story. Dialogue was not necessary. I saw that there was an opportunity, ’cause no one else was doing this… except some other guy from Austria, who doesn’t need to say much.”\n\nThe Rocky star was referring to Schwarzenegger who acknowledged that he was propelled to best himself adding, “Every time he came out with a movie like Rambo II, I had to figure out a way of now outdoing that.” \n\nWith films like The Terminator and Commando, Schwarzenegger became Stallone’s rival and “became incredibly competitive.” Stallone said they were like Muhammad Ali and Joe Frazier “or great warriors that are traveling the same course: There was only room for one of us.”\n\nAlthough they were both action stars, Stallone gives the edge to Schwarzenegger saying, “He was superior. He just had all the answers. He had the body. He had the strength. That was his character.”\n\n“I had to get my ass kicked constantly, whereas Arnold, he never got hurt much,” Stallone added. “And I’m going, ‘Arnold, you could go out and fight a dragon and you’d come back with a Band-Aid.'” \n\nSchwarzenegger pointed out that “without Stallone, I maybe wouldn’t have been as motivated in the ’80s to do the kind of movies that I did and to work as hard as I did. I’m a competitive person.”",
            "score": 511,
            "author": "AliceTheMagicQueen",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think Arnold’s movies were just a lot more fun to watch.  Arnold had range from Terminator to Twins. All classics.",
                    "score": 267,
                    "author": "Bright_Ad_113",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How dare you. Stallone had “Stop! Or My Mom Will Shoot!” /s\n\nHere’s a funny video of Arnold claiming he tricked Stallone into doing that movie\n\nhttps://youtu.be/GxYrTe7LDp4",
                            "score": 124,
                            "author": "JeffBoyardee69",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I actually watched it one time hoping for \"so bad it's good\" but in fact it wasn't terrible, the title is the worst part",
                                    "score": 37,
                                    "author": "jockc",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I remember seeing it and laughing as a kid, but I couldn’t tell you anything else about it. Haven’t seen it as an adult",
                                            "score": 11,
                                            "author": "JeffBoyardee69",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Demolition Man is awesome.",
                                                    "score": 23,
                                                    "author": "Charosas",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yeahp. And I was 11 and LOVED Judge Dredd.",
                                                            "score": 5,
                                                            "author": "bronco_y_espasmo"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "The title is definitely an artifact of the era.",
                                            "score": 3,
                                            "author": "omgFWTbear"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "That movie and Don't Tell Mom The Babysitter's Dead are two underrated and similarly titled gems for me, I guess I'm just easily entertained",
                                    "score": 10,
                                    "author": "shirinsmonkeys",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "So I Married an Axe Murderer",
                                            "score": 10,
                                            "author": "TheeExoGenesauce"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Don’t tell mom the babysitters dead is amazing",
                                            "score": 8,
                                            "author": "armen89"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Throw Mama From The Train",
                                            "score": 3,
                                            "author": "knuckleprod"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "And don’t forget about Ocsar. An absolutely wonderfully fun film!!",
                                    "score": 7,
                                    "author": "thedarkhalf47"
                                },
                                {
                                    "level": 3,
                                    "comment": "Tango and Cash is Fantastic ❤️❤️❤️❤️❤️",
                                    "score": 6,
                                    "author": "wintermoon138"
                                },
                                {
                                    "level": 3,
                                    "comment": "Demolition Man was awesome too!",
                                    "score": 4,
                                    "author": "Retiredstallion",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I don’t know about more range. Just different range. Arnold has comedic timing that Stallone doesn’t (a bane of actors everywhere really. Comedic timing can be painfully difficult to learn if you don’t have it naturally.)\n\nBut Stallone wrote and starred in an Oscar best picture winner. Arnold hasn’t done that. \n\nA lot of Stallone’s creative diversity happens behind the camera instead of in front of it.",
                            "score": 75,
                            "author": "foxscribbles",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And Rocky 1 introduced the revised \"training montage\" cliche that we see in movies all the time, even today \n\nRocky 1 is seriously a work of art of a film. Everything from the acting to the symbolism of red being worn as a show of courage. Adrian was always so quiet and reserved but for the total fight she wears the red and becomes more active in cheering for Rocky.",
                                    "score": 57,
                                    "author": "Currie_Climax",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Not to mention First Blood was a deep and realistic portrayal of severe PTSD that was decades ahead of itself. Arnold’s movies might have been more fun but they aren’t necessarily better for it.",
                                            "score": 27,
                                            "author": "BikesBooksNBass",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "First Blood should have won best picture too.  Nothing Arnold did until Predator came close.",
                                                    "score": 15,
                                                    "author": "Yzerman_19",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Argument can also be made that Arnold essentially wrote and re-wrote the book on “following your idols careers, and doing it better.” \n\nHe became a bodybuilder after being inspired by Reg Park. He became an actor after being cast by chance in Hercules then told not to continue to which he promptly said “fuck off losers,” and politics probably was a powertrip lets be real. I think he approached these career opportunities as challenges to win and become the greatest by which ever metrics he deemed worthy.\n\nComparing that to Stallone, whose first credits were actually a softcore film, IIRC, is tricky. Yes they were both the quintessential action heroes of the 80s, but given Stallone‘s prowess as a writer/Director, this guy seemed more interested in storytelling than being the number one name in the game.",
                                                            "score": 6,
                                                            "author": "gfatcho"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Rocky movies are still happening and for the most part have been of a high quality and caliber. Contrast that with Terminator. Which just exemplifies your point.",
                                    "score": 19,
                                    "author": "Ruleseventysix",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Well, Rocky is the timeless story of the underdog trying to get by.\n\nWhereas Terminator is a twist on the timeless tale of Oedipus Rex, where instead the son sets his father up to sleep with his mom.",
                                            "score": 15,
                                            "author": "omgFWTbear",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Let’s not overload First Blood.  Sly is much more than a boxer.",
                                                    "score": 7,
                                                    "author": "BobLonghorn",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "First Blood is also an underdog trying to get by. “Move along,” “just let me be,” etc etc",
                                                            "score": 4,
                                                            "author": "omgFWTbear"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I dunno. I've been watched Tulsa King and frankly I wouldn't have if Stallone hadn't been so goddamned charismatic. He has a dry humor that plays better as he gets older, I think.",
                                    "score": 5,
                                    "author": "Faptain__Marvel"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Bright_Ad_113 you are fined five credits for repeated violations of the verbal morality statute. ;)",
                            "score": 9,
                            "author": "LinguoBuxo"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Who could forget the time Arnold went Super Saiyan and this ticked Stallone off to the point of nearly breaking in two-- only to attain that power for himself shortly afterwards through brutal training",
                    "score": 10,
                    "author": "OffTheDollarMenu",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What does all this mean?",
                            "score": 1,
                            "author": "Yzerman_19",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's a dragon ball z reference. Goku, who was of loley origins on his home planet kind of just naturally reached a super form on his own, that at that time was sort of legendary and nobody had achieved it in forever. Vegeta who was a noble and thought he would be the obvious one to reach it first didn't, but was pushed to do so by his rival getting there so easily. However for Vegeta, he had to bust his ass and nearly die to get there. \n\nI may be misremembering a detail here or there but I haven't watched DBZ since the early 00s",
                                    "score": 3,
                                    "author": "CerberusC24",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I liked these guys in the 80s more than these guys in their 80s",
                    "score": 14,
                    "author": "LordHyperious",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Eh, Arnie is pretty cool in his 80s",
                            "score": 20,
                            "author": "coacoanutbenjamn",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Except for Fubar. That is some God awful television.",
                                    "score": 1,
                                    "author": "Grace_Upon_Me",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I couldn’t get past ep 2. I like him but I just couldn’t.",
                                            "score": 0,
                                            "author": "SSSJJJUUU",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Don’t smack talk Arnold on here. He’s always on Reddit, waiting, watching.",
                            "score": 10,
                            "author": "Friendly-Matter-3819",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Every morning after feeding his donkey 🫏",
                                    "score": 5,
                                    "author": "Swiss-princess"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I mean, as far as I am concerned, both complemented the other.\nFirst blood could only have been by stalone. It's an amazing film.\nI'd want to see nobody else as the terminator.\nA golden era of action films thanks to those two.",
            "score": 330,
            "author": "Accomplished-Ad-3528",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m sorry, but this take is entirely too reasonable.",
                    "score": 149,
                    "author": "WakeNikis",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Alert the townsfolk. I'll grab the pitchforks.",
                            "score": 37,
                            "author": "panamaspace",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "These guys above are hugest Chads, both of you guys should receive awards for being good people you fuckers",
                                    "score": 11,
                                    "author": "HBPhilly1"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "According to the documentary, they were going to go with OJ fucking Simpson as the terminator.",
                    "score": 38,
                    "author": "sushirolldeleter",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "chasing a blonde lady around trying to kill her? i don’t see it.",
                            "score": 62,
                            "author": "AweHellYo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Just completely out of the ordinary for OJ. Definitely not what I envision.",
                                    "score": 21,
                                    "author": "TrippieBled"
                                },
                                {
                                    "level": 3,
                                    "comment": "Funnily, that's why they didn't do it. No one would buy OJ as an emotionless killing machine.",
                                    "score": 11,
                                    "author": "AngryCrowTF"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Is that the story where they famously passed on him cause they couldn’t see him as a killer lol?",
                            "score": 14,
                            "author": "ItsAmerico"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt; I'd want to see nobody else as the terminator.\n\n\"He was great in that!\"\n\n-Jack Slater, *Last Action Hero*",
                    "score": 20,
                    "author": "AtlasShrunked",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That was awesome",
                            "score": 3,
                            "author": "PT10"
                        },
                        {
                            "level": 2,
                            "comment": "Just watched this today on Netflix lmao",
                            "score": 2,
                            "author": "Zeraw420"
                        },
                        {
                            "level": 2,
                            "comment": "The reference I came looking for.",
                            "score": 2,
                            "author": "theprophecysays"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I actually think they both embodied different parts of the action hero persona (strength/durability vs resilience) to the utmost degree, respectively. \n\nWhenever Arnold was on screen back then, it was always like ‘oh shit somebody about to get wrecked. With Stallone, I always thought ‘this motherfucker about to get beat to shit but still pull out the W’.",
                    "score": 12,
                    "author": "aelysium"
                },
                {
                    "level": 1,
                    "comment": "I believe that Schwarzenegger is the better actor, but that Stallone is the better artist, because he is also a screenwriter and director.\n\nBoth are major inspirations to me, less from their roles and more from who they are as people.",
                    "score": 15,
                    "author": "AwakeAtNights",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I dunno, man.  I couldn’t see Arnold giving that monologue at the end of First Blood",
                            "score": 12,
                            "author": "Mal_Terra",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I can't either.\n\nI'm not saying Stallone is a bad actor.  I think he's a great actor.\n\nBut Schwarzenegger is a better performer.  He knows how to get crowds going, a talent he likely developed during his days in competitive bodybuilding.\n\nStallone doesn't drum up a crowd the way Schwarzenegger does, but I feel like the reason why is because he's a bit more contemplative and reflective.  Which is why I consider him to be a better artist since he can sit down and write a screenplay, or consider all the things a director needs to in order to direct a movie.",
                                    "score": 11,
                                    "author": "AwakeAtNights",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Arnold is the better comedic actor and sly is the better dramatic actor. It’s really pretty simple.",
                                            "score": 12,
                                            "author": "skylinecat",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[I need your clothes, your boots, and your motorcycle](https://youtu.be/AQvCmQFScMA)",
                    "score": 3,
                    "author": "Chole031"
                },
                {
                    "level": 1,
                    "comment": "Last Action Hero pokes fun at this with a poster of Stallone on the cover of Terminator",
                    "score": 2,
                    "author": "CerberusC24"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This should never have been a question.  Arnold blew away everyone in the body building world.",
            "score": 130,
            "author": "MadJackandNo7",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah for serious just watch the documentary “Pumping Iron”\n\nFun fact: he smokes a huge joint (on camera) after he wins, because it’s SA and legal.",
                    "score": 73,
                    "author": "Touch_Of_Legend",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Haha have you seen the sequel documentary about how Pumping Iron was like 60% fictional",
                            "score": 31,
                            "author": "SurfiNinja101",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Nope but I can see that’s true.\n\nIf you watch the film from todays backwards lenses you can clearly see it was “semi” staged in the way they stage the reality shows of today.\n\nOne scene were all going to meet up and work out and start some “drama”\n\nAnother scene will be back at the hotel when we do the solo discussions and extend the “he said she said” into more drama.\n\nAt some point the hero of the film wins (that part is 100% real but everyone knew he would win at the time anyway)\n\nAfter that we have some celebratory drama and call it all fun and games like “oh that’s just locker room talk”\n\nNow they close out the film and shelf it until AFTER he gets famous so it actually sells.\n\nSo while I never saw the second documentary I can pretty much say with certainty it’s true “pumping iron” was as staged, and fake drama, as the Kartrashions.\n\nMy comment was more to point out that Arnold really was a body builder at the highest level so much to the point they made a (semi staged) documentary film about it hahaha.\n\nSo his body earned it for sure even if his acting chops didn’t.\n\nLike Sylvester said in the interview there was no denying that body.. Old days he was stacked that’s no lie and the rest of the “acting world” had some catching up to do in the gym (that part you can’t fake)\n\nLike how at one time it’s really true Hulk Hogan was a serious body. Sure his wrestling was fake but those boa constrictor arms and that 6 foot 7 inch frame was way to real….\n\nFake wrestlers at the time had to step back because that dude will hurt you and can actually suplex unlike the earlier gen of wrestlers who were really like early days basketball.\n\nIt was still below the ropes and without crazy moves and that’s the same was basketball was when it was the below the rim era (before dunks and 3 pointers when bounce passing was king)\n\nArnold, Hulk Hogan, and yeah the Dunk and 3 point shots came from the 70’s/80’s and changed the game forever.\n\nNo longer could you claim to be an action star without the body to live up to these amazing feats.\n\nNo longer could you be a wrestler if you can’t carry 6’5” person upside down on your shoulder (the suplex was king of the 80’s) and if you aren’t 6’5”/285 and cut to back up the story\n\nNo longer could you just bounce pass and lay up your way to the title now you have to defend the far line for 3 pointers AND you have to block from dunks.\n\nSo the 70’s and 80’s changed the whole board not just the game and yeah if you know how they fake reality TV of todays era that’s basically how they faked the pumping iron film.\n\nStill like I said he had the body to back it up and the votes to win the competition hands down.\n\nAnd the joint he smoked was real too so just like watching some Kim K they sprinkle enough real in with the fake to make it palatable to the audience.\n\nProblem with the Kartrashions was they didn’t get that money from earning it. She sex slaved her daughter after seeing the publicity from Paris Hilton which was an actual stolen and leaked video…\n\nAt least in Arnold’s defense… He wasn’t the terminator or the governor or even an “anybody” yet when they filmed the film. He was just an elite body builder doing his thing (early days reality Tv is how I look at the scene changes from the lens looking back)\n\nSo yep totally agree it’s probably 60% fake drama and the only parts that are real are that he actually DID win and that he actually did smoke a joint.\n\nOh and he moves a small car with his bare hands so.. Dude was never weak or a chump lol\n\nThat’s the essence of what I think Sylvester was really saying was… Dude was STRONG and you just had to give it to Arnold because he was cut and big and… yeah the real deal (even if it’s all fake and acting anyway)",
                                    "score": 15,
                                    "author": "Touch_Of_Legend",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You could no longer be an action hero without the body?\n\nCounterpoint: Bruce Willis and Michael Keaton\n\nBut, for some movies like Commando, you’re totally right.",
                                            "score": 2,
                                            "author": "qcubed3",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Counterpoint: There is a reason they put Keaton in a suit with the musculature literally sculpted into it. No way was he gonna wear an Adam West style Batman suit and look like an action hero.",
                                                    "score": 4,
                                                    "author": "WokenMrIzdik",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "That was an entertaining read, thanks for the insights man",
                                            "score": 2,
                                            "author": "Emissary_of_Darkness"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Huge joint???? That’s a pinner.",
                            "score": 5,
                            "author": "mapletable82",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Agree it’s a weak joint looking back.. Honestly we don’t even smoke joints being from the 90’s we used to smoke Phillies haha\n\nWe live in a legal state so you can see from my posts yeah we still smoke and I’ll agree. It’s a pinner haha you must be from the old school tho too because I haven’t heard anyone say the word pinner since the old days haha \n\nSo hopefully you’re having a high day too!",
                                    "score": 1,
                                    "author": "Touch_Of_Legend",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Being from Canada, I haven’t really had to deal with trouble from smoking grass. Sure, in high school in the 90’s you’d get in trouble if you got caught with it but other than that the mood has been pretty relaxed here on it. Even when it was illegal, if you didn’t flaunt it you were ok.",
                                            "score": 1,
                                            "author": "mapletable82"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "What does SA stand for?",
                            "score": 1,
                            "author": "Umikaloo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "South Africa",
                                    "score": 2,
                                    "author": "optimusfiner",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ah, just what I thought, thanks!",
                                            "score": 1,
                                            "author": "Umikaloo"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Both of them were absolute titans. A film with them as a leading duo would’ve literally been unstoppable in the box office. It’s a shame they were railroaded so hard against eachother by Hollywood, PR and the media.",
            "score": 31,
            "author": "GrievesODJ",
            "replies": [
                {
                    "level": 1,
                    "comment": "Though it came out in 2013, I still think Escape Plan was solid and a fun time to have both of them co-starring.",
                    "score": 18,
                    "author": "Fact420"
                },
                {
                    "level": 1,
                    "comment": "Should've had them in a Contra movie.\n\nThat said, Escape Plan is one of my guilty pleasures.",
                    "score": 5,
                    "author": "PT10",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’d watch that movie if the filmed it today.",
                            "score": 2,
                            "author": "Yzerman_19",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hell, just make it CGI where they do the voice over and I’m on board.",
                                    "score": 2,
                                    "author": "VironicHero"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Maybe that opportunity was Tango And Cash.",
                    "score": 2,
                    "author": "Toxic-Park"
                }
            ]
        },
        {
            "level": 0,
            "comment": "All that being said, Sly has an Oscar under his belt",
            "score": 188,
            "author": "Vladius28",
            "replies": [
                {
                    "level": 1,
                    "comment": "And Oscar under his belt",
                    "score": 49,
                    "author": "sixtus_clegane119",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Does he have a grouchy penis?",
                            "score": 11,
                            "author": "tacobellandheroin"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I don't think Arnold has anything that can compete with Rambo 1 or Rocky 1. I think Preditor and T2 were his best work, but those just don't hit the same way.\n\nI am going to say it, the Italian Stallion is a better actor.",
                    "score": 63,
                    "author": "lordph8",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s been the consensus since the 80’s. Everyone knows Sly is the better actor. Arnold was just better looking with a better body and he chose better roles. Sly has a long run of really horrible movies. Arnold’s we’re way more entertaining despite his lack of acting skills.",
                            "score": 27,
                            "author": "btotherad",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Some of us like Tango and Cash, Cobra, Over the Top. Don’t forget Arnold in Junior. May be the worst of both their catalogs. That said… still prefer Arnold lol",
                                    "score": 14,
                                    "author": "iviicrociot",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I’m not picking sides, they both have great catalogues. I’m just saying Sly’s bad movies are MUCH worse and more abundant than Arnie’s. I’ll take Junior over Stop Or My Mom Will Shoot any day.",
                                            "score": 12,
                                            "author": "btotherad",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Oh shit I forgot about that one",
                                                    "score": 2,
                                                    "author": "iviicrociot"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Cobra fucking rules",
                                            "score": 5,
                                            "author": "dbolx1800s",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Always thought there’d be more bad guys clinking axes and shit in life.",
                                                    "score": 2,
                                                    "author": "iviicrociot"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Total Recall could have been awful without Arnold.",
                                    "score": 6,
                                    "author": "KINGPrawn-"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Apparently, you’ve never heard of Kindergarten Cop.",
                            "score": 42,
                            "author": "Heortecg",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Who is your daddy and what does he do?",
                                    "score": 18,
                                    "author": "cigarandcreamsoda"
                                },
                                {
                                    "level": 3,
                                    "comment": "It's not a TUMAH.",
                                    "score": 13,
                                    "author": "Stui3G",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It’s not a DOG it’s a FERRET!",
                                            "score": 5,
                                            "author": "JeffBoyardee69"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "And Stallone wrote Rocky, didn’t he? I don’t think Schwarzenegger, as much as I love him, has written anything.",
                            "score": 36,
                            "author": "Message_10",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That’s how he became famous, he refused to sell the rights of rocky to a producer unless he got to play the lead role - and for which they offered him pennies if I recall correctly",
                                    "score": 32,
                                    "author": "peejr"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I'll take t2 over Rambo or Rocky 1 any day. T2 stands as one of the best action movies of all time.",
                            "score": 6,
                            "author": "Contralogic"
                        },
                        {
                            "level": 2,
                            "comment": "lol Predator and Terminator (both) are some of the greatest sci-fi classics of all time, Rocky and Rambo don't come remotely close.",
                            "score": -3,
                            "author": "brenobnfm",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You're not giving Rocky and Rambo enough credit, honestly. Both of those are generally considered to be among the greatest classics of their genres as well. Hell, Rocky won three Oscars including **Best Picture**.",
                                    "score": 13,
                                    "author": "TangoZulu"
                                },
                                {
                                    "level": 3,
                                    "comment": "![gif](giphy|F3G8ymQkOkbII)",
                                    "score": 5,
                                    "author": "Tsmalls1887"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "*golden globe",
                    "score": 3,
                    "author": "jonproject"
                },
                {
                    "level": 1,
                    "comment": "But was he governor?",
                    "score": 9,
                    "author": "SpottedSnuffleupagus",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "He may have been in a film called Oscar (1991), but he's never won one. He has 3 nominations but 0 wins.",
                    "score": 10,
                    "author": "KingCaiser",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Didn’t he write rocky and it won best picture. Regardless of the category stuff I’m giving him that W over Arnold for sure",
                            "score": 17,
                            "author": "Any-Entertainment385",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He did and Rocky did win Best Picture but only the producers get the award so Irwin Winkler and Robert Chartoff. \n\nFor what it's worth I think Sly was more talented then Arnold but I wanted to clear up that he doesn't have an Oscar.",
                                    "score": 16,
                                    "author": "KingCaiser"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Nominated for 3, never won.",
                    "score": 6,
                    "author": "Funmachine"
                },
                {
                    "level": 1,
                    "comment": "He must have a good marketing team….",
                    "score": -7,
                    "author": "prvhc21",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He wrote the screenplay for Rocky. And did a damn good job too.",
                            "score": 36,
                            "author": "neonchicken",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I love this post career peak humbleness a lot of those guys from 80's are showing. The competition is over, younger dudes are in the ring, so it's cool to peel back the mask and give us insight to the respect they have for one another.",
            "score": 16,
            "author": "wowlolcat"
        },
        {
            "level": 0,
            "comment": "Stallone’s bigger gift is as a filmmaker. He writes well and knows the genre of action needs things like drama, grief, and suspense to work. \n\nEven though we know that what we are watching is a pure testosterone action movie, Stallone still somehow has the ability to make us care and feel something for characters. \n\nFFS, the villain’s name from Expendables 2 was Vilain…literally villain with one less “L”. Yet, somehow, it still ended up being a totally fun movie and Van Damme made a solid bad guy.",
            "score": 14,
            "author": "sllh81",
            "replies": [
                {
                    "level": 1,
                    "comment": "Stallone has nothing to be embarrassed about with his physique. His body is insanely fantastic.\n\nArnold is bigger, that's it. I really liked Arnold in Predator, but...he looked like a body-builder instead of an elite special forces soldier.\n\nStallone was in great shape for Rambo, but he was closer to an elite athlete, compared to a bodybuilder.\n\nTerminator was one of Arnold's top five movies, and in his iconic scenes, he's dressed in black leather. You see his body a few times, but not like Predator.",
                    "score": 2,
                    "author": "series_hybrid"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Fun fact. Stallone got duped into *Stop! Or My Mom Will Shoot* by Arnold cuz Arnold hyped it up like he wanted it and Stallone went for it 🤣",
            "score": 37,
            "author": "bigdiesel1984",
            "replies": [
                {
                    "level": 1,
                    "comment": "Haha any footage of Stallone talking about this so funny because you can see him recalling the exasperation.",
                    "score": 15,
                    "author": "gongalongas"
                },
                {
                    "level": 1,
                    "comment": "“I gave him bad advices.” Arnold’s a legendary troll.",
                    "score": 3,
                    "author": "VerticleSandDollars"
                },
                {
                    "level": 1,
                    "comment": "Has Sly ever passed on anything?",
                    "score": 1,
                    "author": "spasske"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s nice knowing that Stallone is well aware of his place on the totem pole.",
            "score": 66,
            "author": "JoeyBurson",
            "replies": [
                {
                    "level": 1,
                    "comment": "Only as an actor. \n\nStallone could write, and create characters (Rocky, Rambo, Creed, Expendables, to name a few) which Arnold never even tried.",
                    "score": 22,
                    "author": "clorox2",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s a fair distinction… Sly even had to demand to be given a chance as an actor off the back of his writing for Rocky.",
                            "score": 4,
                            "author": "JoeyBurson"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "For what it's worth, he's a better actor.",
            "score": 35,
            "author": "Tehloneranger44",
            "replies": [
                {
                    "level": 1,
                    "comment": "And writer.",
                    "score": 7,
                    "author": "rjcarr"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sly has the acting chops though  \n\nNot to take away anything from Arnold who's a solid actor outside of action movies",
            "score": 39,
            "author": "Laj3ebRondila1003",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sly has Copland. I love Arnie but he has nothing that shows him as a vulnerable underdog and where his acting skills are more important than physical strength.",
                    "score": 14,
                    "author": "blahmeistah",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Untrue. \n\nThe movie ‘Maggie’ was one where Arnold plays a more serious role and has no real action. \n\n\nIt was pretty much ignored because it was a lower budget ‘indie’ project and it was Arnold’s first role in such a movie. Frankly I find it to be one of, if not *the* best performances he’s ever done.\n\nWorth a watch. It’s borderline criminal how overlooked it is. \n\n[Trailer](https://youtu.be/AQ5Vz8qE8R8) for those interested.",
                            "score": 11,
                            "author": "CtrlAltEvil",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I learned today. Never heard of that movie, I will try to find it on streaming somewhere\n\nThanks",
                                    "score": 1,
                                    "author": "blahmeistah"
                                },
                                {
                                    "level": 3,
                                    "comment": "That movie was great!",
                                    "score": 1,
                                    "author": "SkippyTeddy83"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Watched Cop Land 2 days ago and his performance genuinely surprised me.",
                            "score": 2,
                            "author": "RangoDjangoh"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "And he was a good writer.",
                    "score": 8,
                    "author": "TheSyrphidKid"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Stallone had a tougher expression. Go Cobra!",
            "score": 5,
            "author": "asenz"
        },
        {
            "level": 0,
            "comment": "Top 3 (in no order) for me growing up was Sly, Arnold, and Van Damme. They all made the same type of movies but they all felt very different. Arnold was always larger than life and very superhero like in his movies. Sly’s movies felt like “soldier of fortune and your every day man pushed to the brink”. Van Damme was the cool guy with the special moves that also got all the ladies.",
            "score": 5,
            "author": "thatsmyopinionbro"
        },
        {
            "level": 0,
            "comment": "But Tulsa King is better than Fubar",
            "score": 5,
            "author": "dr4wn_away",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I don't think either of them won over the other.\n\nAS maybe had a few more movies that did bigger box office but SS had some more serious movies and even won an Oscar for his Rocky Script.\n\nThe real winner of any competition between the two is us the fans. I loved the hell out of both of their movies.\n\n&amp;#x200B;\n\nEdit: Correction: Sly was nominated for the Oscar not won it.",
            "score": 20,
            "author": "Doright36",
            "replies": [
                {
                    "level": 1,
                    "comment": "Rocky did not win best screenplay, Network by Paddy Chayefsky did.",
                    "score": 3,
                    "author": "KingCaiser",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You are right. I got the nominated and win messed up. I added a correction. Thanks.",
                            "score": 2,
                            "author": "Doright36"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Sly never won an Oscar.",
                    "score": 2,
                    "author": "jonproject",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "So many articles are being written about statements in the three piece Arnold doco on Netflix. It’s insane to me that journalism is like this. \nI understand why, but it still infuriates me.",
            "score": 9,
            "author": "Oubilettor",
            "replies": [
                {
                    "level": 1,
                    "comment": "Seriously. Like writing click bait articles of 5 minutes of the documentary.",
                    "score": 5,
                    "author": "secretreddname"
                }
            ]
        },
        {
            "level": 0,
            "comment": "To young me, Arnold was better because he did comedy better. Both in straight up comedies but also action flicks like True Lies and The Last Action Hero.",
            "score": 10,
            "author": "TheVenged",
            "replies": [
                {
                    "level": 1,
                    "comment": "Demolition Man though, that shit was funny.",
                    "score": 10,
                    "author": "BritOnTheRocks",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Even has a nod to Schwarzenegger being superior, the brief mention of him being President in the skipped time.\n\nIt gets even better with age too, they have the perfect mix of ridiculously wrong and spookily prescient predictions of the future.",
                            "score": 5,
                            "author": "WillSym",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "“The Schwarzenegger Library‽... I don’t want to know.“",
                                    "score": 2,
                                    "author": "BritOnTheRocks"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is exactly what I didn't want, to get into another discussion about men's physiques",
            "score": 10,
            "author": "mr_funk",
            "replies": [
                {
                    "level": 1,
                    "comment": "The mass alone",
                    "score": 9,
                    "author": "Gunner1Cav",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's important to tack on mass",
                            "score": 4,
                            "author": "jim_bob64128"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Humble in his age.",
            "score": 3,
            "author": "NonSupportiveCup"
        },
        {
            "level": 0,
            "comment": "The house that steroids built",
            "score": 3,
            "author": "visitprattville"
        },
        {
            "level": 0,
            "comment": "I just want to say thanks to both",
            "score": 3,
            "author": "Ok_End1867"
        },
        {
            "level": 0,
            "comment": "Stallone is a superior actor, though. A serious actor and a great writer.",
            "score": 3,
            "author": "ImprovizoR"
        },
        {
            "level": 0,
            "comment": "Somewhere along the way Stallone has turned into a legitimately interesting man.",
            "score": 3,
            "author": "Educational-Poet9203"
        },
        {
            "level": 0,
            "comment": "Stallone is a far better actor - the range shown in Tulsa King???? Cmon …no way Arnie is pulling that off.\n\nLike Bill Burr said - the guy should be unloading trucks in Transylvania.",
            "score": 10,
            "author": "Everyonelovesatwinki",
            "replies": [
                {
                    "level": 1,
                    "comment": "AS was successful before he started acting",
                    "score": 3,
                    "author": "jason80",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "According to the new Netflix doc he was a millionaire before he started acting from real estate",
                            "score": 2,
                            "author": "cham89"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The most incredible thing is these dudes are still in the limelight even in their mid to late 70’s",
            "score": 2,
            "author": "zztop610"
        },
        {
            "level": 0,
            "comment": "Arnold was always my favorite action hero and grew up watching his movies",
            "score": 2,
            "author": "horrorkesh"
        },
        {
            "level": 0,
            "comment": "As an 80’s child im a fan if both, Stallone is the better actor.  Arnold was a better governor.",
            "score": 2,
            "author": "AboveTheRimjob"
        },
        {
            "level": 0,
            "comment": "I’ve been noticing a lot of articles/posts about the Terminator lately. I’m guessing it’s either PR to promote upcoming works or we’re in for some sad news (as in he might be ill or something like f that nature). Always been a fan and hope it’s just positive posts for him for the sake of it and not the latter :(",
            "score": 2,
            "author": "FarOutlandishness180"
        },
        {
            "level": 0,
            "comment": "Conan, Predator, Commando, Total Recall, Terminator 1 &amp; 2,  Batman &amp; Robin, True Lies, Twins vs Rocky, Rambo, Demolition Man, and Judge Dredd.\n\nI think that Arnonld’s list is broader and better.",
            "score": 2,
            "author": "zyrkseas97",
            "replies": [
                {
                    "level": 1,
                    "comment": "Arnold was great in action movies but Stallone was the better actor.",
                    "score": 4,
                    "author": "Mr_Mouthbreather"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Definitely room for both of these guys. I’m glad they tried to give us the best they could. Whatever edge they needed to find to get out of bed and make kick ass movies, I’m glad they found it.",
            "score": 2,
            "author": "MrOSUguy"
        },
        {
            "level": 0,
            "comment": "But could Arnold use the three seashells?",
            "score": 2,
            "author": "Krypson"
        },
        {
            "level": 0,
            "comment": "Ehhh…Chuck Norris could take both these guys with his hands tied 😁",
            "score": 2,
            "author": "Sly3n"
        },
        {
            "level": 0,
            "comment": "Yea but Stallone had the WRITING. Acting may be one thing but the man wrote Rocky for christ’s sake",
            "score": 2,
            "author": "xRaY_Koala",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I love all these guys just giving each other supportive sweet compliments. 🥹",
            "score": 2,
            "author": "MeowMistiDawn"
        },
        {
            "level": 0,
            "comment": "I love both their movies.  These guys know who to get us to eat popcorn with a stupid smile on our faces and forget about the real world for a few hours.  That's what matters to me in the end.",
            "score": 2,
            "author": "Notchersfireroad"
        },
        {
            "level": 0,
            "comment": "But Sly had the snarl and a few more acting chops. Plus, he wrote his own breakthrough movie. \n\nThey were both great additions to American cinema at the time.",
            "score": 2,
            "author": "KantanaBrigantei"
        },
        {
            "level": 0,
            "comment": " The world will always be inspired by Arnold. What a legend! &lt;3",
            "score": 2,
            "author": "Yummie23"
        },
        {
            "level": 0,
            "comment": "You put Arnold in Copland and it would be awful",
            "score": 2,
            "author": "bambinoquinn",
            "replies": [
                {
                    "level": 1,
                    "comment": "I agree, I love Arnold, but he couldn’t have done it.  My favorite Sly film.",
                    "score": 3,
                    "author": "dmonkey1134"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Fans won in the end. Nothing Arnold did will hold a candle to rocky 1",
            "score": 1,
            "author": "Slowmexicano"
        },
        {
            "level": 0,
            "comment": "Roids will do that",
            "score": 0,
            "author": "jim_bob64128",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sly is on them too. Irrelevant here.",
                    "score": 1,
                    "author": "ImAMaaanlet"
                }
            ]
        },
        {
            "level": 0,
            "comment": "They both had steroids, human growth hormone, and long histories of sexual assault.",
            "score": -5,
            "author": "SpottedSnuffleupagus",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’ve never heard about Stallone doing that",
                    "score": 2,
                    "author": "Odd_Advance_6438",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "1986 he raped a 16year old girl. \n\nhttps://amp.theguardian.com/film/2017/nov/17/sylvester-stallone-sexual-assaulting-girl",
                            "score": 1,
                            "author": "SpottedSnuffleupagus"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "“I had the Oscar.”",
            "score": 1,
            "author": "throw123454321purple"
        },
        {
            "level": 0,
            "comment": "Although I love the guy, Arnie went off the boil a bit with movies after terminator 2. The more family friendly stuff doesn't work for me.  Stallone continued to put out amazing movies right up to the current day. I forgive him for his Dredd performance. I don't think it was all his fault.\n\nI particularly love the street scenes on the Rocky movies where he walks around buying groceries and chatting to random people. Beautiful scenes.",
            "score": 1,
            "author": "IllDeer4990",
            "replies": [
                {
                    "level": 1,
                    "comment": "Honestly, I like Dredd! For what it is. Cliffhanger is also great.",
                    "score": 1,
                    "author": "Message_10"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I just watched this episode and what I took from this part is that Sly was referring to their characters. While he was saying that, their movies were showing Sly being beaten and Arnold having a grenade exploding 3 feet from him and his character gets up shooting. I think he meant Arnold's characters were superior and always on top, while his characters were always beaten and needed to fight to survive. That's why he added the dragon thing afterwards.",
            "score": 1,
            "author": "rikeoliveira"
        },
        {
            "level": 0,
            "comment": "So basically, Stallone saying he is physically smaller than Schwarzenegger. I think we knew that already. \n\nBy this logic I am superior to Danny Devito. BOW TO ME DANNY!",
            "score": 1,
            "author": "Isteppedinpoopy",
            "replies": [
                {
                    "level": 1,
                    "comment": "No, he´s saying that Arnold has the size and the physique were its believable that he fucked a dragon and came away without a scratch.   \n\n\nAnd that he Stallone, couldnt do the same and make it believable , without him coming back and needing hospital assistance.    \n\n\nThat stallone plays the underdog and arnold the hero.",
                    "score": 1,
                    "author": "SvenniSiggi"
                }
            ]
        },
        {
            "level": 0,
            "comment": "He also had the articulation, accent aside.",
            "score": 1,
            "author": "kalonjiseed"
        },
        {
            "level": 0,
            "comment": "I know it must have been hard for stallone back then, but he was going against basically an elite athlete. \n\nNo shame in that",
            "score": 1,
            "author": "John_e_caspar"
        },
        {
            "level": 0,
            "comment": "Awww, these guys.",
            "score": 1,
            "author": "alexanderhope"
        },
        {
            "level": 0,
            "comment": "Stallone only could have been in Rocky, and Arnold was the only Terminator.\n\nOne was Rambo, and one was Conan. Both were titans of their eras, so there had to be a \"rivalry\" It's tradition.",
            "score": 1,
            "author": "Cinemasaur"
        },
        {
            "level": 0,
            "comment": "I mean Stallone's physique was no chopped liver",
            "score": 1,
            "author": "ibraw"
        },
        {
            "level": 0,
            "comment": "Arnold was more consistent and had less duds, but Stallone definitely had better peaks with Rocky and First Blood. Terminator is only Arnold movie that comes close to those two.",
            "score": 1,
            "author": "pad264"
        },
        {
            "level": 0,
            "comment": "Vegeta at the end of the Buu saga:",
            "score": 1,
            "author": "Icy_Chemist_532"
        },
        {
            "level": 0,
            "comment": "But Stallone got three Oscar nominations. The rocky franchise lives on",
            "score": 1,
            "author": "NDMac"
        },
        {
            "level": 0,
            "comment": "Vin Diesel would rather die than say anything like this",
            "score": 1,
            "author": "213_"
        },
        {
            "level": 0,
            "comment": "Humility is a strength of its own. Both legends for sure.",
            "score": 1,
            "author": "SpacejamOnVhs"
        },
        {
            "level": 0,
            "comment": "No shit Sherlock lmao",
            "score": 1,
            "author": "Codyss3y"
        },
        {
            "level": 0,
            "comment": "Arnold wrote the book on modern bodybuilding....literally.  the encyclopedia of modern bodybuilding came out in 1985, and is one of the most important fitness/bodybuilding books ever made.  In terms of pure physique and training this isn't even a close comparison to me.",
            "score": 1,
            "author": "DaveinOakland"
        },
        {
            "level": 0,
            "comment": "Jesus Christ this headline made me think we lost Arnold",
            "score": 1,
            "author": "DrDreidel82"
        }
    ]
}