{
    "id": "1476jzj",
    "score": 781,
    "title": "Terry Gilliam on Never Compromising in Hollywood: “You Don’t F**k With the Stories”",
    "author": "AliceTheMagicQueen",
    "date": 1686520354.0,
    "url": "https://www.reddit.com/r/entertainment/comments/1476jzj",
    "media_urls": [
        "https://www.hollywoodreporter.com/movies/movie-news/terry-gilliam-never-compromising-hollywood-monty-python-brazil-time-bandits-1235512315/"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Say this for Gilliam, he could have been much more successful but chose his art and principles over convention. Respect.",
            "score": 22,
            "author": "Wittywats",
            "replies": [
                {
                    "level": 1,
                    "comment": "He’s a Python lol \n\nWhat more success does he need? \n\nThe man’s a legend",
                    "score": 7,
                    "author": "CarlMarcks",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He also directed Brazil, 12 Monkeys, and The Fisher King. Amazing career even keeping his principles. But he could have sold out and been one of the biggest directors in the business.",
                            "score": 8,
                            "author": "Wittywats"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That dude rocks",
            "score": 74,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Imaginarium of Dr Parnassus is creepy as FUCK not only the movie itself .. the tarot the movie, heath ledger dying etc. I won’t spoil it more . But watch it. Crazy shit",
                    "score": 27,
                    "author": "UhYeahOkSure",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think I will! I loved Brazil so much, watched in college with some friends. And ofc seen all monty python.",
                            "score": 14,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Time Bandits is required viewing as well as 12 Monkeys",
                                    "score": 9,
                                    "author": "Akindmachine",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 1,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Which one? Time Bandits has the same feel as Munchausen and Brazil, 12 Monkeys is grittier tho. That is easily one of my favorite movies ever, and the third season of the TV show is surprisingly good as well",
                                                    "score": 1,
                                                    "author": "Akindmachine"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The Terrys are the most underappreciated of the Pythons.",
                    "score": 14,
                    "author": "ThunkAsDrinklePeep",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh no he isn’t!",
                            "score": 2,
                            "author": "JupiterRecruit",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "OOOHHH yes he is!",
                                    "score": 5,
                                    "author": "quixoteland",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Look I don’t want to argue about that, I came here for an argument not just contradiction.",
                                            "score": 3,
                                            "author": "wiggywithit",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "No you didn't. \n\n(But also that's Palin and Cleese.)",
                                                    "score": 2,
                                                    "author": "ThunkAsDrinklePeep"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Who’s more under appreciated and why?",
                                    "score": 1,
                                    "author": "Thac0"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Haha— what?!",
                            "score": 1,
                            "author": "LeastChartLost"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Fear and Loathing was (still is) one of my favourite comedies. And then I say “Withnail and I”, and I was like; “Oh he lifted most of it”",
            "score": 10,
            "author": "SmashTagLives",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not at all, it’s s supremely faithful adaptation of the novel. And also Bruce Robinson ruined the Rum Diary, so, yeah, there’s that.",
                    "score": 9,
                    "author": "ChedwardCoolCat",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ugh… I was waiting for you, or rather the first person to make this comment. I’ve read Fear and loathing. And you’re correct, is supremely faithful. \n\nBut before we get into this discussion, have you seen “Withnail and I”? \n\nI ask in good faith, I’m not trying to start anything or be a dick.",
                            "score": 3,
                            "author": "SmashTagLives"
                        },
                        {
                            "level": 2,
                            "comment": "Really? I thought the Rum Diary movie was pretty faithful to the book.",
                            "score": 2,
                            "author": "Foolgazi",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It’s a terrible movie. And not faithful. Though I’d have to reread and rewatch to point out why, since it’s been a minute.",
                                    "score": 0,
                                    "author": "ChedwardCoolCat",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You should check out “Fear and loathing in Aspen”.\n\nIf you have a hunter itch to scratch, give it a try. I came in with zero expectations, and was pleasantly surprised",
                                            "score": 2,
                                            "author": "SmashTagLives",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Haven’t heard of this, but loved LV and Campaign Trail 72. Will scope it out!",
                                                    "score": 1,
                                                    "author": "ChedwardCoolCat",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Nice. Also, just to reiterate; Fear and Loathing is still one of my all time favourite movies. I’ll forget my children’s names before I forget how to quote it line for line. But it really did take, let’s say: “inspiration” from “Withnail and I”.\n\nThis isn’t a bad thing, just a thing. Actually I would recommend you give that movie a shot too.\n\nHappy watching, whatever you decide!",
                                                            "score": 1,
                                                            "author": "SmashTagLives",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I’ve seen them both several times. I’m not really sure what you are trying to say. They are similar in that both are about pairs of belligerent drunks and feature Ralph Steadman art (though the characters are all very different personalities). Both movies are based on biographical novels from the early 70’s. But in terms of chronology, Where the Buffalo Roam (the first Fear and Loathing movie w/ Bill Murray) was made in 1980 and a Fear and Loathing project was in development since the mid 70’s. Withnail is 1987, and Fear and Loathing Directed by TG is 1998. It’s a snake eating itself. Robinson inspired by WTBR, makes WAI, and then Terry G makes F&amp;L.\n\nHowever, the OP specifically said Fear and Loathing “Lifts” all its good parts from Withnail and I, when most of the scenes and dialogue are taken directly from Fear and Loathing the book so I just don’t get that argument at all. It lifts from the source material that predates WAI by almost two decades. \n\nJohnny Depp did want Bruce Robinson to direct it, so you can definitely say his performance is inspired by Withnail. But this thread isn’t about him, it’s about Terry Gilliam who ultimately made a visually stunning movie that looks and feels totally different from WAI.\n\nThat’s my point. That’s why I’m correct. And it hopefully gets you to adjust your strange thinking on the topic.",
                                                                    "score": 1,
                                                                    "author": "ChedwardCoolCat"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "It’s been a while for me too, but FWIW the book wasn’t my favorite thing HST ever did so the movie didn’t have to meet a super-high bar.",
                                            "score": 1,
                                            "author": "Foolgazi",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It was way more like Hemmingway than his other Gonzo stuff which is why I loved it. The movie didn’t get that across at all.",
                                                    "score": 2,
                                                    "author": "ChedwardCoolCat"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "No longer a comedy, now it’s a deep state conspiracy. Adrenochrome, bro!!!11!",
                    "score": 2,
                    "author": "odubenthuziast"
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt; being “queer” in the original sense of the term: Which used to be about being eccentric, bizarre, about having fun. [Now] everything is driven by hate\n\nI don't see him being all that wrong.\n\nBut I'm sure that will be met with hate.",
            "score": 20,
            "author": "MrCaul",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, kinda, I dunno, I think he’s saying being different used to be cool but now people hate it, and then different people hate the haters? Sort of an all sides take? Not great, but overall, I dunno, I am not gonna get worked up over the words of an 83 year old man. He has a legit POV even if it’s super flawed.",
                    "score": 7,
                    "author": "ChedwardCoolCat"
                },
                {
                    "level": 1,
                    "comment": "When I hear the “everything is driven by hate” viewpoint from someone who is anti-trans and has called the Me Too movement a “witch hunt” I can pretty accurately guess where the hate really comes from. Seems like projection.",
                    "score": 3,
                    "author": "Foolgazi",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "An edgelord comic from the 60’s said an edgelord comic thing, followed it up with this: “You can hate what I just said. That’s fine! No problem. I mean, you can believe whatever you want to believe, but fundamentalism always ends up being, ‘You have to attack other people who are not like you,’ and that’s what makes me crazy.”\n\nAnd your takeaway is he is anti-trans? \n\n🤷‍♂️",
                            "score": 2,
                            "author": "ChedwardCoolCat"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Are we calling criticism hate now? Of course we are.",
                    "score": 0,
                    "author": "FuckKeanu",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Criticism in and of its self isn’t hate, but it can be driven by hate that’s for sure",
                            "score": 1,
                            "author": "hemphog5000"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "His animation looks like The Garden of Earthly Delights.",
            "score": 2,
            "author": "Grump_Monk"
        },
        {
            "level": 0,
            "comment": "He’s one of my favorite directors ever. Love him",
            "score": 3,
            "author": "Thac0"
        },
        {
            "level": 0,
            "comment": "All these old dudes who can't keep up creatively keep turning into conservative stooges who claim young people get too offended because no one finds their shit funny or creative anymore.",
            "score": -19,
            "author": "kazh",
            "replies": [
                {
                    "level": 1,
                    "comment": "Labeling Terry Gilliam of all people \"an old dude who can't keep up creatively\" is obtuse as hell. Have you ever even seen his films?\n\nWho he is as a person is totally up for debate though; his politics can suck.",
                    "score": 26,
                    "author": "Humble_Animal_998"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yeah, but the majority your shit sucks, Terry. Maybe you should start compromising.",
            "score": -1,
            "author": "LeastChartLost"
        },
        {
            "level": 0,
            "comment": "I have a lot of issues with him as a person and especially his whole view on cancel culture, but tideland slaps and its one of my favourite films of all time",
            "score": -10,
            "author": "AdmiralCharleston"
        },
        {
            "level": 0,
            "comment": "He may be a cool guy but I despise almost all of his films",
            "score": -5,
            "author": "rithvik2001"
        },
        {
            "level": 0,
            "comment": "I wish he took the same approach to protecting his actors on set, I really cannot love him anymore after Sarah Polley's stirring segement in her book:\n\nBasically, Gilliam made the set incredibly unsafe for her as a child actor, to the point that she thought she would die just based on reading this.\n\nhttps://www.theguardian.com/books/2022/jun/12/sarah-polley-terry-gilliam-run-towards-danger-baron-munchausen-interview",
            "score": 1,
            "author": "Satean12",
            "replies": [
                {
                    "level": 1,
                    "comment": "Did you read the whole thing? They make up in the end. Didn’t really seem like it was Gilliam’s fault. He was struggling to keep the whole production running and her parents consistently pushed her to keep going and not reveal her terror to Gilliam since they were so excited to have their daughter in the movie.",
                    "score": 5,
                    "author": "Arpeggiatewithme"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Edited my observation for the offended down voters.\n\nAs much as I’ve loved his films in the past I can’t get past a guy who doesn’t cast a black actors in prominent roles in a film. I can’t give a pass for someone who made one of the best films I’ve seen in Brazil. He let me down like many artists that inspired me in my youth let me down. \nTo be very specific for those making excuses for Terry, in 46 years of directing, he’s cast one black actor in a supporting role. That’s called a pattern. Don’t at me b/c you saw a few extras named on the credits. He could have kept his contempt for Black Panther to himself but nope, couldn’t help himself. \n\nSo not once I thought. Correction: one guy in the 80’s in 3 films. I wouldn’t have known b/c guys got a mask over his face in Brazil and Time Bandits. I never liked Barron and that’s the one he got screen time on. Don’t remember much of that one at all. Thanks to the person who passed that on or I’d have never known that.",
            "score": -37,
            "author": "Quirky-Pie9661",
            "replies": [
                {
                    "level": 1,
                    "comment": "https://www.imdb.com/name/nm0219577/\n\nWinston Dennis is in 3 of his films",
                    "score": 27,
                    "author": "Moonface_Killah",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s weird, because if you look at the at cast of 12 monkeys, there’s 5 black actors listed. It’s almost like they didn’t even check their ‘facts’.",
                            "score": 28,
                            "author": "AdopeyIllustrator"
                        },
                        {
                            "level": 2,
                            "comment": "I’ll withdraw “not one” with “one guy in 3 films in the 80’s” (his face is behind a mask in 2 of them). It’s not making a dent in my take on Terry’s history of hiring black actors in his 46 years as a director",
                            "score": -37,
                            "author": "Quirky-Pie9661"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "So your fake racist claim was disproven, I guess you spoke up for absolutely nothing. Oh well, better luck next time.",
                    "score": 9,
                    "author": "exophrine",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s weird the lengths white people on social media go to to try and prove someone “isn’t racist,” despite having substantially low rate of appointing black actors that clearly isn’t a coincidence.",
                            "score": -8,
                            "author": "odubenthuziast"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Nobody is obligated a job because of their skin color.",
                    "score": 8,
                    "author": "GrimAcademia",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The objection is that they allegedly haven't done it, not that they are failing some obligation to do so based solely on skin color.",
                            "score": 2,
                            "author": "thatHecklerOverThere",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Except for the fact that his entire issue is literally predicated on the notion that black people *have* to be casted in a movie otherwise the director is racist. \n\nIf he wasn’t insinuating an obligation to do so, then why exactly is he complaining, and why is he directly using this as ‘evidence’ of racism?",
                                    "score": 5,
                                    "author": "GrimAcademia"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Matt Gaetz how aren’t you in prison??",
                            "score": -2,
                            "author": "odubenthuziast",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You’re doing your argument no favors.",
                                    "score": 3,
                                    "author": "GrimAcademia"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "who dis?",
            "score": 0,
            "author": "Motor_Sock459"
        }
    ]
}