{
    "id": "147bptb",
    "score": 875,
    "title": "Alex Newell Becomes First Nonbinary Acting Tony Winner for ‘Shucked’",
    "author": "thetrilogy911",
    "date": 1686534298.0,
    "url": "https://www.reddit.com/r/entertainment/comments/147bptb",
    "media_urls": [
        "https://variety.com/2023/legit/news/alex-newell-nonbinary-acting-winner-tonys-shucked-1235640382/"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Then a few minutes later there was a second",
            "score": 275,
            "author": "meatball77",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thought you were joking.\n\nYou were not joking.",
                    "score": 137,
                    "author": "The_OtherGuy_99",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The best dressed of the night",
                            "score": 25,
                            "author": "meatball77"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They can thank the producers for the ordering.  Then again we do remember buzz aldrin",
                    "score": 17,
                    "author": "guesting",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Is that the guy from Toy Story?",
                            "score": 11,
                            "author": "KoniecLife",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No silly, it's the guy from 30 Rock that yells at the moon.",
                                    "score": 6,
                                    "author": "Zachariot88"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;Then a few minutes later there was a second\n\nThey were so close!",
                    "score": 4,
                    "author": "Evorgleb"
                },
                {
                    "level": 1,
                    "comment": "Sucks to be them",
                    "score": 2,
                    "author": "Ake-TL"
                },
                {
                    "level": 1,
                    "comment": "Damn id hate to be that person",
                    "score": 2,
                    "author": "daisyymae"
                },
                {
                    "level": 1,
                    "comment": "Isn’t then decided by the organisers by which award is given in which order?",
                    "score": 2,
                    "author": "PayaV87"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What I don’t really understand about non binary is that it is based on stereotypical gender norms which are assumptions about what a man or woman is like. That assumes there are rules. \n\nWhen really there are no rules. We are all non binary if you ignore gender stereotypes.\n\nIf they are happy as NB good for them but I don’t think I will ever get why they can’t just be happy without a new label.\n\nTrans I get a little more. Because it’s based on gender dysphoria. You feel the opposite of what biology and society says you are. And you want to live as the individual you feel yourself to be.",
            "score": 74,
            "author": "scullyharp",
            "replies": [
                {
                    "level": 1,
                    "comment": "I feel the same way, I just don't get it.  But. . . . I can respect what they want.",
                    "score": 27,
                    "author": "meatball77",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; I just don't get it.\n\nI think this is why some people mix up confusion with 'hate'. Its really hard to wrap your head around and often times when asked most people cant even properly describe it. Instead they call you insensitive. Just read the thread after this question was asked. There still isnt a clear answer. Kind of explains why society in general is confused\n\nAt the end of the day, we just need to be nice to each other. No matter who you are. I feel this message gets lost in the identity parading that goes on these days.\n\nThe US is way more divided by class and income than any identity",
                            "score": 30,
                            "author": "mractor111"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "We wouldn’t know they were nonbinary unless they said so, because there’s not a single objective detail about their body or behavior that could possibly inform us of that otherwise. \n\nSo there’s that.",
                    "score": 7,
                    "author": "Heretic_Chick"
                },
                {
                    "level": 1,
                    "comment": "It’s all made up, everybody just wants you to get along with it.\n\nBasically don’t be an asshole and question it.",
                    "score": 8,
                    "author": "DoneDidNothing",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think we are starting to create terms and definitions and this is a space that isn’t fully explored. It’s like how scientist study things independently and name their discoveries different things. Eventually the community comes to a consensus on the term but we haven’t gotten there with gender and sexuality. I’d say it’s even more true with so many people discovering themselves on their own, it takes a while to find an accepting community.",
                            "score": 6,
                            "author": "berticus23",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There will never be a consensus because people will always have different frameworks.",
                                    "score": 2,
                                    "author": "ThenAnAnimalFact"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I think questioning things are OK as long as it's done respectfully.",
                            "score": 4,
                            "author": "BaconCheeseBurger"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Gender isn’t just about expression. Also, neither gender dysphoria nor gender euphoria exist on a strict gender binary. We don’t feel “the opposite”, we just feel different. Non-binary people can also experience dysphoria, and what makes them happy is to be called something besides a woman or a man.\n\nIk it’s difficult to understand because of how different it is to the way most people experience their own gender, but it’s worth trying to understand, and it really important to us that people do. Especially right now.",
                    "score": 8,
                    "author": "vivixnforever",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes I guess it’s the - I feel different - which is hard to understand for me as cis person because many cis people feel different to social stereotypes of gender but still don’t feel NB. It’s the social stereotypes which are wrong, not the feelings of the individual which are out of step with those social stereotypes. \n\nThank you for sharing - I appreciate it seems to be more complex than this and identity is always difficult to explain to others. \n\nI would always look to respect someone’s preferred pronouns. I’m just keen to try to understand experience so I can better see perspective.",
                            "score": 10,
                            "author": "scullyharp",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I cant speak on all NB experience, esp bc im a cis man but if I’ve learned anything from my closest friend who is nb, it’s that the feeling of dysphoria can be directed at the binary itself.\n\nLanguage is pretty imprecise here, but when you say that many ppl feel different to social stereotypes of gender, I’m not sure if you meant like just the giant labels of male or female or specific things like what a father looks like. Bc feeling different about what a father looks like doesnt necessarily point to someone feeling disphoria. Feeling very uncomfortable/depressed about being thought of as a woman/man, being referred to as a woman/man, that edges into the function of non binary.\n\nAnd I think when you were talking abt getting rid of stereotypes or gender entirely, that would be agender/nongender. Nonbinary isnt the rejection of gender but as others have said a third separate label where ppl feel much better being thought of and referred to as something different.",
                                    "score": 6,
                                    "author": "Jekh",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I meant really all labels attached to the word man or woman given by society.\n\nWhat is it that makes someone uncomfortable to be referred to as a man or woman. Is it just a feeling of being uncomfortable. What is it that make someone question their identify. That’s where I get confused.\n\nIs it looks, traits, interests. Not feeling like a ‘normal’ man or woman. But what’s normal outside of gender stereotypes. \n\nLots of people are gender stereotype non conforming without that further step of being NB. \n\nIDK maybe it’s just impossible for a cis person to get it because you have to experience it to really get it.",
                                            "score": 3,
                                            "author": "scullyharp",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "So many experiences will yield different answers to your questions, so that’s one difficult aspect of trying answer your questions. I think reading/listening abt first person non-binary reports/stories (and not a select few) would be a good start.\n\nAs far as the nb ppl in my life are concerned, I’ve noticed that the ppl assigned female at birth tend to notice early on in childhood that being female and being expected to act/look a certain way immediately stigmatizes the binary in their worldview. The labels and the behaviors/appearances are closely related for them. And boys don’t have it much better. So if someone was to reject the binary and the appearances/social behaviors, then that’s more liberating for them. \n\nAnd men and women can also feel the burdens of their gender too, but not as strongly to go out of their way to change their pronouns/looks/name. Like I don’t feel weird dressing like I do and being referred to like I am, but for the ppl that feel uncomfortable being thought of as a male or female, identifying as nb is the ideal.\n\nFood for thought but if everyone was given the chance to change their pronouns and have all their community accept them and immediately use their desired pronouns and not be alienated, bullied, or flat out ignored, I’m sure more ppl would come out as nb. Gender and disphoria exist on spectrums, and social pressure adds a whole other layer of complexity.",
                                                    "score": 3,
                                                    "author": "Jekh"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Am non-binary. Born male and thought I was just bisexual my whole life. Then I started thinking back and realizing how envious I would be of girls and how they got to present as pretty while (me living in the Bible Belt) was expected to be clean cut and proper.\n\nWhen I was finally grown and out of the area I had been in, I started asking myself if I really was a woman and realized while I want to be feminine, I still have masculine things that I enjoy and feel define me as well. So I felt caught in between who I was and who I wanted to be then realized I can just find my own happy medium, as me enjoying whatever I felt like being at the time, right there in the middle. \n\nThat’s my experience anyway, but I’m also still constantly growing and realizing things about myself as I go through every day. Took me until almost thirty to learn this so who knows what’s in store 😂",
                    "score": 7,
                    "author": "googlyeyes93",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;then realized I can just find my own happy medium, as me enjoying whatever I felt like being at the time, right there in the middle\n\nSure but can I ask (I mean this completely respectfully, I'm really interested in your insight) why you can't present and live that way without officially calling yourself non-binary?\n\nI just think society was creeping towards a place where we were saying \"men and women can dress and act however they like, it doesn't make them less of a man or woman\" but then non-binary took over instead. I thought the other approach was really positive and a nice big \"fuck you\" to damaging gender norms. I agree with the OP who said that non-binary reinforces the idea that gender norms are legit, which seems counterintuitive.\n\nBut I do want people to be happy in themselves, of course. I guess I'm curious about how the definition helps you feel more yourself? It's something I want to understand more, if you (or other NB posters) are happy to explain.",
                            "score": 13,
                            "author": "bfm211",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes.  Honestly, much of the modern trans movement is puzzling to me in how much it essentializes gender.  In the 80s and 90s, queer theory was all about breaking out of the prison of stereotypical gender norms.  Gender was seen as just a performance, and the goal was moving beyond it.\n\nThe modern trans movement seems to have just created a shit-ton more gender identities to imprison ourselves in, and they take an in credibly reductive and essentialist perspective on them, viewing them as biological characteristics.\n\nIt seems a huge step back to me, and seems weirdly conservative, relative to where the LGBTQ movement was headed in the 90s.",
                                    "score": 3,
                                    "author": "Juan_Carlo"
                                },
                                {
                                    "level": 3,
                                    "comment": "Chiming in — people want to box and label everyone all the time. I can’t be a woman that likes masculine things because im a tomboy in their eyes, or I can’t be a man that likes feminine things because im metrosexual, or this or that. Putting a label on yourself before they can also helps with that and it puts yourself at peace",
                                    "score": 11,
                                    "author": "raptorclvb",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah I just have a dream where we don't need any of these boxes and just let people fucking be. No \"masculine things\", no \"feminine things\", just \"things\". Women and men who enjoy what they enjoy. That's what I'd love society to work towards. But thanks, I do understand what you're saying.",
                                            "score": 8,
                                            "author": "bfm211",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah, I wish for that too. Life would be great if all of that wasn’t a thing. \n\nI definitely fall in “box this person” territory and have even been… mis-everything. Even as a kid before I knew what all this was. I don’t really identify as anything now because I know my own truth and skin so that’s good. But I understand why a lot of people need it. I was there, too, before. \n\nI also appreciate how you asked genuinely curious and everyone else responded nicely too. I wish more conversations like this happened. I hope you have a good day",
                                                    "score": 2,
                                                    "author": "raptorclvb"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt; You feel the opposite of what biology and society says you are. \n\nNB people feel that way too, but without \"opposite,\" as the concept in use. Opposite implies a binary, which is what is in contention.  I know we get hung up on dimorphism but that is just a biological tendency. I'm not nb but I'm just not too stuck on the idea that we can have perceptions and needs for our bodies and expression outside of a hard lever switch in a way that is discrete from simply not subscribing to 'girls cook boys football,' surface level gender norms.",
                    "score": 1,
                    "author": "fallout-crawlout",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I still don’t get it I’m afraid. Thanks for trying to educate me. Will need to keep trying. \n\nUltimately I guess I don’t get why you can’t just say yes I am a woman - which is biological and factual - why that causes someone distress and instead saying I’m neither man or woman helps someone. \n\nI find it all very head scratching as a woman and mother of daughters who historically would have been described - in sexist manner - as tomboys to try to put myself into the shoes of a NB female person.",
                            "score": 14,
                            "author": "scullyharp",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh, sure, I'm not the expert either. My best take is that it's like... preference vs discomfort? Like, the crushing weight of behaving and being perceived a way that doesnt just have a place to go, versus a general and admirable 'fuck you gender norms,' kind of thing. It sounds confusing and complicated to me, but I'm trying to keep up too.",
                                    "score": 7,
                                    "author": "fallout-crawlout"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Gender roles are made up - but they do exist. They are arbitrary, and should change over time, but they have meaning to our society and culture. It's not an intrinsic meaning, it's an assigned meeting to this societal construct we call gender.\n\nThis may sound like an oxymoron, but you will find most elements of culture and society follow a similar principle - for example we know religious interpretations have change over time based on current events, but that doesn't change its meaning to those who subscribe to that religion. Race is another great example - we know there is no scientific definition of race, its a cultural definition with no firm boundary and it has changed over the years, yet it still matters. Racism still exists. Dictionaries do not dictate meaning, they reflect the meaning of things as we use them in the real world. \n\nNon-binary gender expression is the same way. Binary gender expression is still the norm in our society, but that is changing. The gender binary still exists, there *are* gender norms, and there are people that exist outside of that. This is a natural evolution of our societal construct of gender.",
                    "score": 4,
                    "author": "gawag",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "But shouldn’t we saying screw gender norms. It’s nonsense that to be man you have to be like x or women be like y. Just be you. \n\nRather than saying we in effect accept these gender norms and because we do, some of us are neither male or female because we don’t fit those norms.",
                            "score": 6,
                            "author": "scullyharp",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes, that's why it's important to accept non-binary people. Maybe someday our society will have progressed past the need for gender, but in the meantime, gender is still an idea with value - trans people are living proof. I don't think anyone would argue binary gender expression is inherently problematic, the only issue is when it's treated like an absolute. Same thing with religion, race, etc. It's important to acknowledge these things are part of your identity and have value as such, but it doesn't mean they define you (in fact you define them) *and* that value they have is not absolute.",
                                    "score": 3,
                                    "author": "gawag"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "But that isn't the point. Giving someone an award that doesn't deserve it just to virtue signal is wrong. There are deserving winners that should have had a chance instead.",
                    "score": 4,
                    "author": "Cheap-Idea",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Shucked is an entertaining but extremely middling show; Alex is the only memorable thing about it and  gives a performance that elevates the mediocre material.  The award is well-deserved.",
                            "score": 3,
                            "author": "cookiecompass"
                        },
                        {
                            "level": 2,
                            "comment": "Alex deserved it, they often get a mid show standing ovation after their solo because it's that good",
                            "score": 2,
                            "author": "meatball77"
                        },
                        {
                            "level": 2,
                            "comment": "I don’t know enough about nominees to evaluate talent. The rules are the rules. If they are allowed to submit and people thought their performance was best then fair enough. But I can appreciate other nominees may feel it’s a little unfair.",
                            "score": 1,
                            "author": "scullyharp",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Why would the other nominees think it's unfair? What category should Alex submit themselves into? They were the best and they won because of that.",
                                    "score": 1,
                                    "author": "theMaidenandtheCrone",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Because Alex doesn’t identify as a man but competed in a male category. Alex could also have presumably competed in female category. So as a NB has more choice, which may seem a little unfair. That’s all.",
                                            "score": 1,
                                            "author": "scullyharp",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Ahaha the idea the male supporting actor this year was an easier category is laughable - if they were trying to hedge their bets they would have competed in the actress category to not split votes with Kevin Cahoon.  They don't have a category so had to pick and in their own words, the reason they picked actor was that they felt it was a more gender-neutral term than actress. \n\nIt would have been unfair if they couldn't compete or competed in two categories. They played by the same rules as everyone and when forced to pick a category tried to pick the one that rang most true to them.",
                                                    "score": 1,
                                                    "author": "theMaidenandtheCrone",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Sure but they had a choice right - a cis person has no choice- that’s all I am saying. But honestly I don’t care. Awards are all nonsense anyway!\n\nIf a male NB actor won the actress category I’m sure that would have been considered more problematic. It will happen at some point, I’m sure.",
                                                            "score": 1,
                                                            "author": "scullyharp"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Why do you assume they didn't deserve the award? Have you seen Shucked and all the other nominees or have you just assumed there is no way a non-binary person could win unless it wasn't fair?",
                            "score": 1,
                            "author": "theMaidenandtheCrone"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Adding to your comment because I feel similar. I had a good friend who’s going to be sibling in law (she now goes by female) once identified as an egg. They said they were non binary and identify as the egg at creation. Then moved over to being a girl. Obviously people would say this is gender fluid. But it just doesn’t make sense. Identifying as nothing causes more issues than something. My buddy knows she just has issues. But it’s wild that people take offense when you can’t discern the identity on first glance. I personally think you are male or female and you have basically a sliding scale of 0-100 on your personality traits in those binaries, unless of course you were born with both body parts and such. I don’t care how people identify, just wish clarity was a focus.",
                    "score": 3,
                    "author": "reenactment"
                },
                {
                    "level": 1,
                    "comment": "I identify as NB and I see it as rejecting any stereotypical norms at all and just being yourself\n\nI think in an ideal word what you said should be true, everyone should be comfortable with themselves and shouldn’t have to face so much pressure and scrutiny from society and existing gender norms",
                    "score": 0,
                    "author": "KeepYourHeadOnTight",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ok, well that’s me too, but for me just being yourself true of many men and women.\n\nBut if helps you and makes you happy then pleased for you that gives you peace!\n\nI have seen sexism even more clearly since being a parent of both girls and boys and will keep fighting it. Honestly I feel in many ways kids childhoods have become more subject to sexist stereotypes not less in recent years. I see it in schools, other parents, media. Depressing.",
                            "score": 7,
                            "author": "scullyharp"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The rules have already been created. Non-binary is choosing what does and doesn’t apply for yourself those rules being relatively static from your day to day. \n\nI think its close to gender fluid where I feel like the traits vary, can mix and then separate. \n\nI think there is some overlap too and the most important aspect is how the person feels about themself.",
                    "score": 1,
                    "author": "berticus23",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sure, I guess I reject the binary construct. I’d prefer to say stuff the so-called rules. So it seems like going backwards to accept they exist and therefore come up with a third category. \n\nBut if makes people happy fair play. I will respect their choice.",
                            "score": 5,
                            "author": "scullyharp",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I certainly reject the rules myself. I just meant that currently there are a set of social gender rules that exist in order for myself to reject them.\n\nEdit: With my rejection of the rules it’s how I choose to apply them. Others can reject all of them and create a brand new set or just live without them.",
                                    "score": 1,
                                    "author": "berticus23",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The gender stereotypes are also pretty specific to different cultures. Common for platonic straight men friends to kiss each other and hold hands in certain cultures. Others that wouldn’t be seen as norm for a straight man. So no one set of ‘rules’ either!",
                                            "score": 3,
                                            "author": "scullyharp",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "For sure! Culture norms can be adapted to yourself and the community you form too. If you do something not based in a norm that others follow, it will become a norm for your circle, community and culture too. Wasn’t “Hello” a greeting created for the telephone? I think Edison coined it and Alexander Graham Bell pushed for “Ahoy”.  Only on ships did “Ahoy” catch on lol",
                                                    "score": 1,
                                                    "author": "berticus23"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "If someone considers themselves non-binary they are accepting that there are only two genders, which kinda goes against what other LGBT folks say",
                    "score": -2,
                    "author": "NaRaGaMo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "2 sexes.  Lots of genders.",
                            "score": -2,
                            "author": "absolute_bobbins"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "it’s less about gender stereotypes and more about an internal sense of being. you can be happy presenting as stereotypically masculine or feminine and still be non-binary, or present androgynously and be non-binary. it’s more about how we feel on the inside and how we choose to express it",
                    "score": -3,
                    "author": "CoolArtFromSpace",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The point the guy is making (I think), is that, since all gender roles are basically made up, isn't everyone non-binary?",
                            "score": 8,
                            "author": "MattSouth",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Gender roles are made up, but that doesn’t mean that they are nonexistent, being NB is acknowledging that and rejecting gender roles and society norms. \n\nMany people feel that they can’t be themselves because of how others will judge them, due to those societal norms. \n\nFor example a guy wants to wear a dress, but he feels that he can’t because that’s “not what guys do”",
                                    "score": -1,
                                    "author": "KeepYourHeadOnTight",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "See but that makes it seem like it's a circle back to bigotry, \"I can't be a guy that wears dresses, because that's not what guys do, so I can't just be a guy\". You have to buy into the gender roles you are fighting against. Does that not make you part of the problem?",
                                            "score": 2,
                                            "author": "MattSouth"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Dunno why ppl are downvoting ya for this- we’re nb- but we also present masculine.",
                            "score": 1,
                            "author": "Throwawanon33225"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "There’s still gender dysphoria, it’s just not as direct. For me, certain feminine features cause dysphoria, but so do certain masculine features. Lots of non-binary people medically transition in some way. It’s still being trans, it’s just another form of it.",
                    "score": 1,
                    "author": "NottaBought",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah many of my NB friends have felt enough dysphoria that they choose to take hormones and/or get top surgery. It’s definitely deeper than just rejecting gender norms. For me as an AFAB woman who has no problem being perceived as a woman — but also doesn’t adhere to the many rules or labels assigned to “womanhood” — I can sympathize but I don’t feel the need to be NB.",
                            "score": 1,
                            "author": "crims0nwave"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Alex is correct when she says that all actors are non-binary. Men play women, women, play men. It’s been that way since the first play was performed in a cave somewhere. They are more comfortable, presenting as female and hey, that’s fine by me.",
            "score": 121,
            "author": "jyar1811",
            "replies": [
                {
                    "level": 1,
                    "comment": "It used to be only dudes playing everything",
                    "score": 25,
                    "author": "FoxJonesMusic"
                },
                {
                    "level": 1,
                    "comment": "It’s just fucking clothes and hair. Who gives a shit?",
                    "score": 99,
                    "author": "profstenny",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’ve heard that it’s very important to one of the parties in the United States",
                            "score": 52,
                            "author": "KoniecLife",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "One of them, anyway.",
                                    "score": 13,
                                    "author": "Consistent_Case_5048"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Dude so many people give so much of a shit. Nobody would give a shit, if everyone accepted non binary people and LGBTQIA’s as a whole, but alas they don’t. So it’s a thing when things like this happen, because of the hate they have to endure to get there.",
                            "score": 8,
                            "author": "Abstractpants",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Most of them don’t even know to think about any of it until their news personality tells them to",
                                    "score": 2,
                                    "author": "FoxJonesMusic"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Playing a man as a woman or a woman as a man/crossdressing is a very reductive way of thinking of what non-binary is.",
                    "score": 22,
                    "author": "Liddlebitchboy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Gender is a performance. We wouldn’t have gender theory without performance theory.",
                            "score": 21,
                            "author": "schwatto"
                        },
                        {
                            "level": 2,
                            "comment": "Then what is it? Do you think it’s something essential with a biological origin, or do you think it’s a matter of the *soul*? Is there even a consensus on what it *means*? Judith Butler not only popularized the term “non-binary”, but arguably was the largest influence on our contemporary understanding of gender identity, and they argued that gender *is* performance.\n\nSure, you can cross-dress without being non-binary, and be non-binary without “cross-dressing”, but if so, what does it *mean* beyond simply identifying as so? If presenting outside of the gender binary is not the meaning of being non-binary, and if there is no essential origin, then the meaning must be completely up for interpretation. What is the non-binary experience outside of personal identity and expression? Do most people experience their inner-world through a strict gender binary? \n\nTo argue that being non-binary is essential, you’d have to also argue that the gender binary is essential, but we really have no way to define the gender binary outside of sex and gender roles. To equate gender to sex would amount to the erasure of transgender people, but to equate gender to *gender roles* would amount to honesty more than I can unpack in a Reddit comment, though gender roles are ultimately a matter of culture and/or personal choice\n\nTo assume gender is 100% physiological is not only a slippery slope, it also disregards that there is no clear consensus on what gender even is. Most intersex people identify within the binary, so it is not just a matter of endocrine abnormalities leading to people identifying as non-binary. Even within the study often cited, it is inconclusive, though there are multiple studies that argue against a physiological cause. There is no proof of a physiological origin. Ultimately, no human physiology proves essential gender (or lack thereof), wether you identify as non-binary or not. \n\nDefine what it means to be non-binary without using gender expression or gender norms in the description. And if the answer is that you “don’t feel like you belong within the gender binary”, how is that proof of gender essentialism? How do you define the gender binary without gender norms and gender expression?",
                            "score": 27,
                            "author": "_WeepingSong_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; To argue that being non-binary is essential, you’d have to also argue that the gender binary is essential, but we really have no way to define the gender binary outside of sex and gender roles. \n\nThe whole point is to reject the binary system, but it is the system that is used throughout the world so the word/identity of being non-binary is introduced.  \nEither way, you're inferring a lot from a comment in which I just said that the non-binary identity as we know it is MUCH more than just dressing up as 'the other sex' from which you were born.",
                                    "score": -3,
                                    "author": "Liddlebitchboy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You did imply in another comment that “it’s science”. If it’s a matter of rejecting the gender binary, that is implying that it is a choice and not something biologically essential, so which is it? If there is a “point” to being non-binary, that means it is a goal-oriented concept, and not something essential. \n\nIf it’s “scientific discourse”, that means that this is something that can be tested and quantified vs a philosophical discussion.\n\nAnd if it is much more than gender expression, what is it? Rejecting the gender binary in what ways if you do not transgress it via gender expression and/or norms?",
                                            "score": 7,
                                            "author": "_WeepingSong_"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I’m super curious how is it “MUCH” more?",
                                            "score": 12,
                                            "author": "Joedude26",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Because the non-binary umbrella encompasses a lot of people that don't identify as either male or female, it's a lot more than simply crossdressers/people playing the opposite as the OC implied",
                                                    "score": -4,
                                                    "author": "Liddlebitchboy"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Why is that so important? The vast majority of people are binary and straight. And that’s ok.",
                                            "score": 8,
                                            "author": "jgrace2112",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "No one is saying they're not, stop it with the victim complex. No one was even talking about sexuality. I was just responding to a comment that was ignorant/incomplete, that's all.",
                                                    "score": -3,
                                                    "author": "Liddlebitchboy",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Believe me. The majority of straight binary people don’t care. And we certainly don’t feel like victims.",
                                                            "score": 5,
                                                            "author": "jgrace2112"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Genuinely curious: how so? \n\n\n\nThere have been several other cultures which openly allowed for people to be accepted as a third or fourth gender vs trying to force someone into a binary system, and to many being non-binary is yesterdays gender-fluid, whereby whatever smock one wore was often “permitted” based on societal expectations &amp; exemptions — what we have here is two individuals who are presenting themselves as they wish to be accepted; however, they wouldn’t [or, shouldn’t based on certain physiological criteria..] be allowed to go to a women’s prison if they committed a felony. \n\nSo.. where does the reduction come into play; or are you making a mountain out of a hill? \n\n[I’ll add this: with 1.6 mil people (in the US) identifying as trans/ nonbinary vs 1.7% of all births being intersex (which is some 5.7mil in the US) - when do we open up our gender nomenclature instead of rewarding people for being a representation of something that they are not from a biological standpoint?]",
                            "score": 7,
                            "author": "ksixnine"
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": -9,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Relax? I'm just saying, when people talk about the non-binary identity they are NOT referring to people born as men identifying as women and vice versa (though some include it, and both fall under the trans umbrella), and also not to crossdressing. And fwiw, these are scientific discourses, not 'quasi intellectual' as you love to throw around.",
                                    "score": 5,
                                    "author": "Liddlebitchboy"
                                },
                                {
                                    "level": 3,
                                    "comment": "this coming from the guy who uses “woke” unironically as an insult. lmfaooooo",
                                    "score": 2,
                                    "author": "shadoinfante"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I think I can see your point. That it’s more the definition of being gender-fluid while non-binary is more about not relating to either gender or classical gender norms?",
                            "score": 1,
                            "author": "jraw692"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I saw this show several weeks back. This is a well deserved award. I could listen to Alex sing for hours!",
            "score": 8,
            "author": "Elaine_Benes_Lovr"
        },
        {
            "level": 0,
            "comment": "Lmao, sucks for the 2nd NB person straight afterwards who can't claim the coveted 'first' for their gram.",
            "score": 13,
            "author": "Overwatch_Joker",
            "replies": [
                {
                    "level": 1,
                    "comment": "They won the Tony for best lead actor in a musical - quite literally the highest award in their field. I think they will be okay with it.",
                    "score": 2,
                    "author": "theMaidenandtheCrone",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, but let's be real, being 'first' has that certain *je ne sais quoi* to it, and of course the bragging rights.\n\nEveryone remembers the first man on the moon, but not all remember Buzz.",
                            "score": 1,
                            "author": "Overwatch_Joker",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If you really want to get technical they were the first non binary person to win lead actor in a musical. But idk this idea that J. only wanted to win to be first is a wild take, they've spent 10+ years working in theatre from ensemble roles to regional theatre and now have won the highest award they can. The idea they would feel anything but joy in this moment.",
                                    "score": 2,
                                    "author": "theMaidenandtheCrone"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Alex is not only talented and beautiful but also so inspiring, I’ve loved them since Glee and will be a life long fan!!",
            "score": 27,
            "author": "Yummie23",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s just funny to think Alex won an award and Lea Michelle finally got to perform the same night 😂though Funny Girl couldn’t get awards I just thought that that must have been an interesting back stage all things given",
                    "score": 9,
                    "author": "kgal1298",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "To be fair, I think this is Lea’s like 5th time performing at the Tonys and I think she’s even sang Don’t Rain on my Parade there. I saw she posted a pic with her and Alex congratulating Alex so maybe they’ve made up? But yeah big night for former Glee cast members lol. \n\nEither way, so happy for Alex! Haven’t seen the show but they’re fantastic. Been a fan since Glee.",
                            "score": 5,
                            "author": "Craphole-Island"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 13,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "They were born a man so they’d prolly appreciate you noticing they don’t conform to gender norms.",
                    "score": 9,
                    "author": "CallMeAmakusa"
                }
            ]
        },
        {
            "level": 0,
            "comment": "![gif](giphy|uLy4Bo680hZxm)",
            "score": 17,
            "author": "CaptBeatsCheeks",
            "replies": [
                {
                    "level": 1,
                    "comment": "Actors love celebrating themselves",
                    "score": 13,
                    "author": "Dropped-pie"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Alex has an amazing voice, loved them in Zoey's Extraordinary Playlist.",
            "score": 4,
            "author": "PaleontologistClear4",
            "replies": [
                {
                    "level": 1,
                    "comment": "They were hands down the best singer on that show.",
                    "score": 6,
                    "author": "irishgirl1981"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I REALLY don’t care what anyone’s preference/pronouns are.",
            "score": 7,
            "author": "hemi06",
            "replies": [
                {
                    "level": 1,
                    "comment": "You should care. It shows you respect someone.",
                    "score": 2,
                    "author": "iwascompromised"
                },
                {
                    "level": 1,
                    "comment": "ok then why did you comment",
                    "score": 7,
                    "author": "CoolArtFromSpace"
                },
                {
                    "level": 1,
                    "comment": "It’s a good thing they’re not doing it for you!",
                    "score": 4,
                    "author": "Howtothnkofusername"
                },
                {
                    "level": 1,
                    "comment": "You cared enough to open the post, click reply, type out a comment, and hit reply.",
                    "score": 1,
                    "author": "magic1623"
                },
                {
                    "level": 1,
                    "comment": "Yep, and I love all religions , races, sexualities , this stuff has gone way too far",
                    "score": -1,
                    "author": "LeadershipSevere6730",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "“This stuff”?",
                            "score": 1,
                            "author": "amateurbeard"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Too bad, the narcissists demand your obedience!",
                    "score": -5,
                    "author": "LuckyEstateSaleGuy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Alex is the best... loved them in Glee back in the day!!",
            "score": 7,
            "author": "NessieSenpai",
            "replies": [
                {
                    "level": 1,
                    "comment": "Boogie Shoes was one of my favorite songs from Glee.",
                    "score": 5,
                    "author": "Consistent_Case_5048"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Americans consistently seem to give themselves awards",
            "score": 5,
            "author": "liberaldouches",
            "replies": [
                {
                    "level": 1,
                    "comment": "what is eurovision?",
                    "score": 6,
                    "author": "BorodinoWin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A piss take party. Your point?",
                            "score": -6,
                            "author": "liberaldouches",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "euros do the exact same thing. \n\nso do arabs and africans and asians.",
                                    "score": 5,
                                    "author": "BorodinoWin",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Nothing like on the same level as Americans. EVERY damn day there is an award show. And the funny thing is, it means SO much to them. When the Brits get up there for something like the Brit awards, it's really an excuse for a night out , a drink and a laugh; but Americans see garbage like Golden Globes and MTV awards as a major achievement lol. Hilarious.",
                                            "score": -3,
                                            "author": "liberaldouches",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "so whats the award show tomorrow?",
                                                    "score": 0,
                                                    "author": "BorodinoWin",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Imma give them a pass. But guess what, there's ANOTHER tv awards show critics choice on the 16th haha.\n\nyes I'm sure Arabia and AFrica has as many.....",
                                                            "score": 1,
                                                            "author": "liberaldouches",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "so whats the award show on the day after?",
                                                                    "score": 0,
                                                                    "author": "BorodinoWin",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Baseball awards . Can you tell me what African awards are up? You know, a continent with 54 countries? As this apparently compares to Americans back slapping each other every day. I don't see why you feel so personally attacked . Didn't you get your participation award?  🤣🤣",
                                                                            "score": 1,
                                                                            "author": "liberaldouches"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Where you from?",
                    "score": 3,
                    "author": "FoxJonesMusic",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sudan",
                            "score": -1,
                            "author": "liberaldouches"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It is a very competitive culture so people need a lot of signifiers to figure out where they stand in the competition. Every grocery store has the employee of the month posted by the checkouts. And every kid is on the “travel team.”",
                    "score": 3,
                    "author": "ktreddit"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "yea...like this is the first time i've heard of them, not even 100 percent sure what non-binary means isn't that like asexual or something. either way, i guess it's a win for they/he/she",
                    "score": 0,
                    "author": "Youngworker160",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I mean do you follow theatre and the new york theatre scene? Why would you have heard of them if not? People in that industry have known who they are for a long time. They have been in leading roles on Broadway for six years now, and have worked for this moment since they entered the industry 12 years ago. It's much deserved and earnt.",
                            "score": 1,
                            "author": "theMaidenandtheCrone"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What happens if the choose a gender later? Do they need to hand back the award?",
            "score": -2,
            "author": "bakedgamerboi",
            "replies": [
                {
                    "level": 1,
                    "comment": "Elliot Page didn’t get his Oscar nomination revoked because of his transition, even though he was nominated for best lead actress.",
                    "score": 11,
                    "author": "OkTrouble3361",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is true. \n\nBut then can’t you say it’s not Elliot’s award? It’s Ellen’s?",
                            "score": 2,
                            "author": "bakedgamerboi",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No, because Elliot is the current owner of the award. There is no Ellen. There was an Ellen, but there is not presently an Oscar nominated actor whose legal name is Ellen Page, so the award would not be Ellen’s.\n\nAlso, he didn’t win, so it wouldn’t be his award either way, but I figured that that isn’t relevant to the conversation at hand.",
                                    "score": -2,
                                    "author": "OkTrouble3361"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The award was for acting… and even if they “choose a gender”, it doesn’t change the fact that they were non binary when they won.",
                    "score": 7,
                    "author": "El--Borto",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I see",
                            "score": 1,
                            "author": "bakedgamerboi"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "No. Similar to athletics - if you win a medal as a man and then transition to a woman and win another medal. You keep both.",
                    "score": 2,
                    "author": "londoner4life"
                },
                {
                    "level": 1,
                    "comment": "Non binary is a gender",
                    "score": -18,
                    "author": "AdmiralCharleston",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Biologically no, identifying yes",
                            "score": 13,
                            "author": "LilTendie",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There is no such thing as biological gender, thats called sex",
                                    "score": 13,
                                    "author": "onewaytojupiter"
                                },
                                {
                                    "level": 3,
                                    "comment": "Biological gender is an oxymoron, sex is biological and gender is psychological.  Also both sex and gender are on a spectrum and not binary, that's just facts. There are a many intersex people in the world as there are ginger people",
                                    "score": -5,
                                    "author": "AdmiralCharleston"
                                },
                                {
                                    "level": 3,
                                    "comment": "Intersex individuals exist biologically.",
                                    "score": -11,
                                    "author": "Maximum-Row-4143",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Intersex humans are still male or female depending on the conditions",
                                            "score": 9,
                                            "author": "Argazdan"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yeh I’m saying if they ditch the non-binary and say ‘I’m male or female now’.",
                            "score": -9,
                            "author": "bakedgamerboi",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I mean, they've lived pretty consistently as gender non conforming for years so I highly doubt that is going to happen, but if it did then idk, I don't think it would be that wild of an event, only weirdos would focus on it",
                                    "score": 3,
                                    "author": "AdmiralCharleston",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "So what are non-binary people before they’re gender non-conforming for certain amount of years?",
                                            "score": 2,
                                            "author": "bakedgamerboi",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That's irrelevant. They identify as non binary now and that's the only thing that you should even consider calling them",
                                                    "score": 5,
                                                    "author": "AdmiralCharleston",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Seems kinda relevant. I mean can I call myself non-binary today and then not non binary next week?",
                                                            "score": 2,
                                                            "author": "bakedgamerboi",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "And if you did that I would exclusively refer to you as what you currently asked me to.  Ignoring the fact that the vast majority of non conforming or trans people don't hop between different identities every single day, the literal only thing that matters in the context of 99% of situations is what they currently identify as.",
                                                                    "score": 1,
                                                                    "author": "AdmiralCharleston"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Why does it matter what they were 'before'? You know, they've probably felt this way their entire lives but were unable to, for whatever reason, live their life fully identifying outwardly as non-binary. So no, this is not just some trend that someone does for a year or a week.",
                                                                    "score": 0,
                                                                    "author": "Liddlebitchboy",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "So all their own experiences ‘before’ they identified as non binary aren’t important? \n\nYou can’t just say, oh it’s now and future stuff only, disregard the past of anyone.",
                                                                            "score": 2,
                                                                            "author": "bakedgamerboi",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "No one is song that, we're simply saying that if someone used to identify as a cis man and now identifies as non binary, you don't refer to their past self as anything other than what they identify as now. If you're talking about things that happened prior to them switching to non binary pronouns you would still use non binary pronouns. \n\nAlso the fact remains that it literally doesn't matter how someone used to identify if you aren't some weirdo that feels the need to interrogate celebrities you don't know about their identity for your own curiosity",
                                                                                    "score": 2,
                                                                                    "author": "AdmiralCharleston",
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "What the fuck are you trying to say right now? Their experiences before they identified publicly as non-binary were most likely ones where they were figuring out their identity, coming to terms with it, or in many cases trying to hide from intolerant family, society, etc.",
                                                                                    "score": -1,
                                                                                    "author": "Liddlebitchboy",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "No, that would be absurd",
                    "score": -5,
                    "author": "meatball77"
                },
                {
                    "level": 1,
                    "comment": "I assume not. I guess it would work like winning a marathon but then becoming the worst marathon winner, it would be strange to hand back the award for the first marathon afterwards.",
                    "score": -5,
                    "author": "Lapis_Zapper",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How you become the worst marathon runner? I don’t get your analogy",
                            "score": 2,
                            "author": "bakedgamerboi",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The same way someone is bad at any sport from my understanding.",
                                    "score": 0,
                                    "author": "Lapis_Zapper",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "But running is a behaviour. There’s good and bad running. \n\nGender is not a behaviour, yes? So how you have good and bad gendering?",
                                            "score": 1,
                                            "author": "bakedgamerboi",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "They didn't win the award for gendering, although that sounds like a fun sport.",
                                                    "score": 0,
                                                    "author": "Lapis_Zapper"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Thats the point, dude.\n\nIt's a methaphor to make clear it would not makes no sense at all and people should just stop caring.",
                                    "score": -1,
                                    "author": "Kackegranate"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Bruce Jenner is a good example here, I guess.",
                            "score": 1,
                            "author": "HogwartsPlayer"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "congratulations!!!",
            "score": 3,
            "author": "_Democracy_"
        },
        {
            "level": 0,
            "comment": "If you have to point to gender, ethnicity and or sexual orientation to point out a story/news your are contributing to the divisive discourse. Alex Newell won a Tony. That should be enough of a headline",
            "score": -1,
            "author": "lenchoreddit",
            "replies": [
                {
                    "level": 1,
                    "comment": "it’s not divisive, it highlights those who are part of a demographic who have been put down or even discriminated against for years, and it brings joy to those who are part of that demographic to see someone like them win something",
                    "score": 4,
                    "author": "CoolArtFromSpace"
                },
                {
                    "level": 1,
                    "comment": "So, by your logic, Jackie Robinson played baseball. Thurgood Marshall was a judge. Barack Obama was elected.\n\nReally, there’s nothing else significant worth calling out?",
                    "score": 2,
                    "author": "caro312"
                },
                {
                    "level": 1,
                    "comment": "Should be ,,Person won” to not divide people further, right? Or maybe just don’t report things at all",
                    "score": -3,
                    "author": "CallMeAmakusa",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How am I being divided from you by acknowledging that they’re the first of their demographic to win the award?",
                            "score": 2,
                            "author": "comeradenook",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You’re not,  I’m not, person above me clearly thinks it divides people.",
                                    "score": -2,
                                    "author": "CallMeAmakusa"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Loved Alex when they were on the glee reality show and I knew they’d go far! What a talent",
            "score": -1,
            "author": "wolfingitup"
        },
        {
            "level": 0,
            "comment": "Good for them… but no one cares.",
            "score": -5,
            "author": "WeekendSuspicious486",
            "replies": [
                {
                    "level": 1,
                    "comment": "It obviously made an impact in your life, because here you are, caring enough to comment about it.",
                    "score": -4,
                    "author": "UnknownFea"
                }
            ]
        },
        {
            "level": 0,
            "comment": "![gif](giphy|o7dCp9kCqPc8o)\n\nThen what are these exactly?",
            "score": -5,
            "author": "Everyonelovesatwinki"
        },
        {
            "level": 0,
            "comment": "josh groban must be absolutely losing it",
            "score": -4,
            "author": "EntertainmentOver32",
            "replies": [
                {
                    "level": 1,
                    "comment": "I can promise you he is not.",
                    "score": 14,
                    "author": "Rosemarys_Gayby"
                },
                {
                    "level": 1,
                    "comment": "I think Groban is probably handling it way better than his fans are. I'm sure he's genuinely thrillef for JHG. He also knows better than anyone how winning or not winning a Tony (or Grammy) has no bearing on how successful one can be or how much they are loved. He's been in the biz for 20+ years and just keeps getting better!",
                    "score": 2,
                    "author": "angie50576"
                },
                {
                    "level": 1,
                    "comment": "No I don’t think so the reviews weren’t that favorable to Sweeney Todd 🥴 though seems like the audience is enjoying it which matters most. I",
                    "score": 1,
                    "author": "kgal1298",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The reviews were nothing but favorable.",
                            "score": 0,
                            "author": "petrichors",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Almost all of the reviews mentioned amplification and almost all the reviews praised Groban. That’s the issue though a musical isn’t just about it’s lead. Go ahead and read feedback about it. Overall in comparison to Akimbo and other shows this season it wasn’t the top.",
                                    "score": -2,
                                    "author": "kgal1298"
                                },
                                {
                                    "level": 3,
                                    "comment": "Almost all of the reviews mentioned amplification and almost all the reviews praised Groban. That’s the issue though a musical isn’t just about it’s lead. Go ahead and read feedback about it. Overall in comparison to Akimbo and other shows this season it wasn’t the top.",
                                    "score": -2,
                                    "author": "kgal1298",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Didtheylikeit.com\n\nNot sure you can say the reviews were unfavorable with out of 14 major publications, 13 of them were positive with only 1 middling review.\n\nWe get it, *you* didn’t like it.",
                                            "score": 1,
                                            "author": "petrichors",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I'm not in NYC to watch it, but all the reviews focused on Groban. I went through them to see if I wanted to see it. Did you actually read the reviews? And watch the YouTube reviews?\n\nAnyway saying he or Sweeney Todd was robbed when people clearly didn't read the reviews is a bit of kick in the bucket. You can either read the reviews and understand why it didn't sweep or not. And when you dig enough it's just that Groban doesn't come across quiet as menacing as the role would allow, but what would I know it's not like I read the reviews or anything to understand why he didn't win.",
                                                    "score": 1,
                                                    "author": "kgal1298",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I didn’t say Groban was robbed? \nI also don’t watch YouTube reviews? Wtf lmao. \n\nI don’t think you know how Tony voting works.",
                                                            "score": 2,
                                                            "author": "petrichors",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "No I know. Do you? Because the reviews wouldn’t matter in that aspect I’m just saying if you read the reviews you can see why he didn’t win. Also did you see it? Because you’re going off like you did, but I was just replying to the person that said he’s kicking dirt and people thinking he should have won, I’d argue with this years slate he didn’t.",
                                                                    "score": 1,
                                                                    "author": "kgal1298",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I’ve seen every musical in Sweeney’s category….not to flex. but I still don’t know how you’re jumping to these conclusions when Sweeney was a critical darling.\n\nIt was always Parade’s and J. Harrison Ghee’s night to win",
                                                                            "score": 1,
                                                                            "author": "petrichors",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Because when you read into the reviews the criticism came from the tone changes. Amplification, how menacing Groban was…yes reviews can be positive but never free of criticism. That’s why I said they weren’t that favorable especially when compared to the other contenders. \n\nDid you think Groban deserved to win for his portrayal?",
                                                                                    "score": 1,
                                                                                    "author": "kgal1298",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "And Sara Bareilles, they both didn't win academy awards again. . . . \n\nThey can sing their song again",
                    "score": 1,
                    "author": "meatball77"
                },
                {
                    "level": 1,
                    "comment": "But Josh didn't lose to Alex. He lost to J. Harrison Ghee (who would have had a harder time winning as him and Christian will have split votes) and tbh if they weren't in the category he would have lost to Ben Platt.",
                    "score": 1,
                    "author": "theMaidenandtheCrone"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Congratulations to them; were there better actors? Yes. Was this a great win for Alex, yes.",
            "score": 1,
            "author": "Halidcaliber12"
        }
    ]
}