{
    "id": "7ybvwx",
    "score": 4,
    "title": "To people considering going to cap for their first year...",
    "author": "mistaketogo",
    "date": 1518925863.0,
    "url": "https://www.reddit.com/r/CapU/comments/7ybvwx",
    "media_urls": [],
    "other_urls": [],
    "postText": "You need to know what you are getting yourself into. If you choose to go to cap you should not expect anything different to high school. The cafeteria is abandoned and empty by 4pm every day, everybody leaves after their classes (why stay if there is nothing to do??). Want to meet some new friends? just join one of the 5 clubs you actually qualify to participate in because some of them are exclusive for a certain demographic! Or start your own club and have 2 rsvps, then one meeting with four attending before giving up... Watch the school sports for some school spirit? Enjoy sitting with the fans of whatever other uni is visiting because nobody from here watches the games! Do you like greasy fried food? Good news because for the low price of 10$ for a burger or 7$ for chicken tenders which are sometimes still slightly frozen in the middle you can enjoy the nourishing and healthy caf food! [the stir fry is good if you manage to be there for the two hours a day they are actually open] Or stand in line for tim hortons at 3:57pm and panic as one of the ladies watches the clock like a hawk waiting to close the curtain the moment it switches to 4 so she can deny service to the line no matter how short or long it may be... Sit in the conveniently always empty communal spaces or go for a walk around the forced detours due to permanent construction here or there on campus. Feel like going to a party with more than 15 people drinking in a basement? Good luck finding anything bigger than a high school ass house party with a bunch of people who have known each other for years and years. cap is just an extension to high school if you go for your first year of university, if you have a shred of self respect, a desire to meet new friends, or feel like you'd enjoy participating in events and clubs, then either temper your expectations, or prepare to feel like high school just started costing thousands of dollars per year. \n\nDon't go in with high hopes like I did, it will only hurt more",
    "comments": [
        {
            "level": 0,
            "comment": "Yo if you want decent food go down to Superstore and get something the deli. It's $6 for butter chicken or you could buy cup noodles. The only problem is that it's a bit out of the way, but you could bus. ",
            "score": 2,
            "author": "the1trueseagull"
        },
        {
            "level": 0,
            "comment": "TLDR CAP IS DEPRESSING IF YOU EXPECT TO MAKE LOTS OF FRIENDS OR PARTICIPATE IN ACTIVITIES/EVENTS",
            "score": 2,
            "author": "mistaketogo"
        }
    ]
}