{
    "id": "b3y01y",
    "score": 4,
    "title": "Mopa Students , how long after the interview did you hear back from the school about their decision?",
    "author": "maymay81",
    "date": 1553212898.0,
    "url": "https://www.reddit.com/r/CapU/comments/b3y01y",
    "media_urls": [],
    "other_urls": [],
    "postText": "I had my interview a month ago and on the application regarding the decision it shows \"reviewed-remains pending\". So I was wondering how long did it take for you guys to hear back from the school?",
    "comments": [
        {
            "level": 0,
            "comment": "Yo what the fuck? A month ago? I applied for early admission and they still haven’t even sent me an email regarding when my interview is. I asked them when I’d hear back and they said “we’re constructing interviews at the moment, interviews will take place in the next few weeks.” That was the first week of March.\n\nEDIT: “early admission”, not “early application”",
            "score": 1,
            "author": "MrLazyCanuck",
            "replies": [
                {
                    "level": 1,
                    "comment": "There were interviews in February during reading week, as well as this week on Wednesday. I’m a current MOPA student who volunteered during the interviews. \n\nI applied for early admissions in Dec 2017, had a Skype interview in mid Feb 2018, and was admitted very early May 2018. \nEDIT: Double checked my emails and I actually got my admission notice on March 16th. \n\nHowever, I was speaking to one of the instructors in charge of the interviews and she mentioned they hadn’t even reviewed all the applications yet, and haven’t made any decisions yet. There seems to be quite a high volume this year, and they’ve also drastically changed the interview structure which might be why there’s a delay. ",
                    "score": 2,
                    "author": "themacaron",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ah I see I see. Well that’s a huge relief then. Would you possibly have any idea what the changes could be? I remember then asking like “why did you choose Cap” and stuff. Do you think they’ll still ask questions like that still?",
                            "score": 1,
                            "author": "MrLazyCanuck",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I actually signed a NDA regarding the contents of the interview this year but the biggest change is that they’ve changed from a one on one format to a group interview. When my peers and I did our interviews it was you, and two instructors. I think my interview took around 15-20 minutes. Now it’s a group of 5-7 interviewees with two instructors and the entire process runs about an hour. It’s their first year doing this process so I imagine they had to fine tune their decision making process with the new structure. \n\nI also know they’ve already interviewed probably close to 400 students, and the class size for 1st year is around 100-120 so it’ll be a competitive decision. ",
                                    "score": 1,
                                    "author": "themacaron",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Holy shit already 400 kids! Damn dude. Wait so what if you’re literally on the other side of the world and can’t make it to the interview? Can they still do it over Skype?",
                                            "score": 1,
                                            "author": "MrLazyCanuck",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah they still do Skype for international/out of province students, although we did have people fly in from London and LA for their interviews. ",
                                                    "score": 1,
                                                    "author": "themacaron",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Jesus Christ. Well unfortunately I don’t have Warren Buffet as my parent so I don’t think I’ll be able to fly in from France",
                                                            "score": 1,
                                                            "author": "MrLazyCanuck",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Don’t stress. I did a Skype interview from out of province and I got in. Feel free to message me if you have any other questions about the program. ",
                                                                    "score": 1,
                                                                    "author": "themacaron"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I applied back in December for early admission and still haven't gotten an interview yet. They keep saying they'll get back to me in a few weeks :/",
            "score": 1,
            "author": "AryanGupta2809"
        },
        {
            "level": 0,
            "comment": "Applied for early admission, did my interview near the end of February, and got the acceptance email March 15th. A friend who also applied got their email the same day.",
            "score": 1,
            "author": "chipsay"
        },
        {
            "level": 0,
            "comment": "I sent in my application January 8th, 2019. I got the email for the interview February 11th, 2019. The interview I had was on February 21st and I did the on-campus interview. I was sent my acceptance on March 15th, 2019 at 3:20pm. One of the other people in my group interview also got in but one of the other ones hasn't yet so you never know.",
            "score": 1,
            "author": "ouathollander"
        }
    ]
}