{
    "id": "cjr2un",
    "score": 3,
    "title": "Any advice?",
    "author": "fakecamus",
    "date": 1564489794.0,
    "url": "https://www.reddit.com/r/CapU/comments/cjr2un",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi guys.\nI'm looking for a university at VANCOUVER and wanna know about Cap u.\nIf are a current student at Cap u please write your experiences( both + &amp; -) down here.\nAbout profs, staff, education quality , dorms, campus life etc.\nThanks",
    "comments": [
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Tnx for your response",
                    "score": 1,
                    "author": "fakecamus"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The dorms aren’t super fantastic in terms of the food and the buildings are dated but I did my first year in the dorms and it’s where I made my core group of friends (and now we’re getting a place together for second year!) I’m an out of province students and honestly res was just the easier option than stressing about finding a place to rent the first year, and if it’s your first year of university and living away from your parents, not having to cook or clean does take a load off of your plate. Cap is also very much a commuter school, and the social life isn’t crazy, so res is a good way to meet people and participate in social events.\n\nI’m in MOPA, so I think my class experience will be a lot different than other programs but I personally really enjoy the program and the instructors. My instructors for non-MOPA electives were all really great too.",
            "score": 1,
            "author": "themacaron"
        },
        {
            "level": 0,
            "comment": "lol capu is shit if you dont have a car, campus iss in the middle of nowhere and bus os only every 30 mins",
            "score": 1,
            "author": "SawSomeStabbingsOnDt"
        }
    ]
}