{
    "id": "hpbzmx",
    "score": 3,
    "title": "Can't apply for ENGL 100! Please Help!",
    "author": "[deleted]",
    "date": 1594481814.0,
    "url": "https://www.reddit.com/r/CapU/comments/hpbzmx",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi, fall 2020 will be the start to my freshman year in cap u. Since applications begun, I have been making my schedule and everything was fine up until I tried to sign up for ENGL 100!!! I've tried every single sections and all of them seem to have either a Program Restriction? or I'm getting an error that says \"Prerequisite and Test Score error\"?? Maybe I dont have a \"qualifying EDT score, an LPI score or an exemption as outlined in the university calendar\" Please help, my program is Bachelor of Communication, and I reach out to reddit since everything is online this year, I dont even know who to email for assistance...",
    "comments": [
        {
            "level": 0,
            "comment": "I had issues signing up for an English course the other day. I found that the CRN I was given was wrong... you should be able to search for the class on the search tool, find the specific class number, and select it that way.",
            "score": 1,
            "author": "Lord-Exeggutor"
        },
        {
            "level": 0,
            "comment": "I had this same error and I got registration to override the request.",
            "score": 1,
            "author": "CatGuzzler"
        },
        {
            "level": 0,
            "comment": "Idk if you figured it out yet, but it does sound like it might be your EDT score ? I don't really know how they mark it because they don't release the scores. Contact the registar's office  and ask them why that prompt is popping up for you (because there shouldn't be any problems with registering for Eng 100). \n\n[registration@capilanou.ca](mailto:registration@capilanou.ca)\n\n 604-984-4900",
            "score": 1,
            "author": "Doolset23"
        },
        {
            "level": 0,
            "comment": "Definitely reach out to the program coordinator.. i did today and was given an override for one of the courses that i was missing a prereq for! I was an anxious wreck today..",
            "score": 1,
            "author": "i_goturweenus"
        }
    ]
}