{
    "id": "kk715a",
    "score": 2,
    "title": "The motion of Picture Arts Program competitiveness",
    "author": "tomlol1",
    "date": 1608934432.0,
    "url": "https://www.reddit.com/r/CapU/comments/kk715a",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm applying to the MOPA program for 2021 fall and just wondering how is the acceptance rates? Do they look at grades more or are they looking more for the content in the letter of intent?",
    "comments": [
        {
            "level": 0,
            "comment": "As far as I know, acceptance is pretty lenient. It’s a fairly large group.\n\nGrades aren’t super competitive though it is nice to keep them up. If you focus your energy into your letter of intent (and supplemental materials if they’re doing that this year) then you’ll be sitting pretty.\n\nAlso, the ‘interviews’ can make a positive impact if you’re struggling. The process is actually quite fun/exciting, and I’m sure you’ll find yourself in your element on the day. Good luck.",
            "score": 2,
            "author": "Lord-Exeggutor",
            "replies": [
                {
                    "level": 1,
                    "comment": "ok ok, Thank you so much!",
                    "score": 2,
                    "author": "tomlol1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m happy to help. Feel free to dm any more questions.",
                            "score": 2,
                            "author": "Lord-Exeggutor"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is what I was told by my instructors in my first year so take it with a grain of salt because they might have been exaggerating to make the problem sound more competitive but in my year there were about 450~ applicants, and 125 accepted to the program. \n\nI assisted with some of the entrance interviews in my first year and the number of applicants had increased though I don’t remember the exact number. While grades are considered, the letter of intent and interviews are really the key imo. This program and this industry is highly collaborative and they’re looking to see who you are as a person and if you can play nicely with others tbh.",
            "score": 2,
            "author": "themacaron",
            "replies": [
                {
                    "level": 1,
                    "comment": "okok got it, thanks for the info!",
                    "score": 1,
                    "author": "tomlol1"
                }
            ]
        }
    ]
}