{
    "id": "mwxpv6",
    "score": 4,
    "title": "CAEL Test - how is it?",
    "author": "Kendonintendo237",
    "date": 1619191436.0,
    "url": "https://www.reddit.com/r/CapU/comments/mwxpv6",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello! \n\nSo I’ve recently graduated from SFU with two bachelors. I was going over the application requirements for the paralegal diploma and I need to take the CAEL test. Has anyone taken it? I never took English 100 and that’s why I have to take it.",
    "comments": [
        {
            "level": 0,
            "comment": "Hello, I am currently planning to take CAEL too. I found some free resources on their website. Maybe you can check their youtube page for some tips.",
            "score": 1,
            "author": "joo1a",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh thank you. Yes I found the resources on their page. I just was curious how the test was to take in person. I’ve done the practice test at home several times. But it’s always different when you’re actually taking it. I was more curious if I had to take the whole time or if I could finish early etc.",
                    "score": 1,
                    "author": "Kendonintendo237",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They allow you to tale a pre-test but there are requirements. Try to sign up for it :)",
                            "score": 1,
                            "author": "joo1a",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Did you take the test yet?",
                                    "score": 1,
                                    "author": "Kendonintendo237",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Not yet. I scheduled it tho this June. How about you? So stressed over it. I’m taking the computer test bec its near where Iive",
                                            "score": 1,
                                            "author": "joo1a",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I took it at the beginning of May and I passed. One thing I found extremely distracting was that you could hear everyone else taking the test speaking their answers. Just a heads up because I found it very awkward and distracting. Otherwise everything else was in line with the practice test. 🙂\n\nGood luck!",
                                                    "score": 1,
                                                    "author": "Kendonintendo237",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Thanks! Ugh. I’m stressing about writing. Hopefully everything goes well.",
                                                            "score": 1,
                                                            "author": "joo1a",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I’m sure you’ll do great! The long writing part is only 250 words and it keeps count for you. You are not limited to the 250 words though! So if you feel like you could expand on the topic with the information they provided do so!",
                                                                    "score": 1,
                                                                    "author": "Kendonintendo237"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Oh I forgot to mention since I’m a natural English speaker I was super stressed too but honestly I didn’t do anything special for studying or prepping...I watched some of the Cael videos that featured Brandy...but in all honesty her critiques were really hard and made me stress more. In the end where I thought I would bomb the oral/speaking based on her guidelines and criteria I ended up getting 90. So I think it’s just best to go in relaxed. 🙂",
                                                    "score": 1,
                                                    "author": "Kendonintendo237"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}