{
    "id": "146s3jn",
    "score": 161,
    "title": "Looking for a lipcolour",
    "author": "Dazzling-Yam-1151",
    "date": 1686484615.0,
    "url": "https://www.reddit.com/r/MakeupAddiction/comments/146s3jn",
    "media_urls": [
        "https://i.redd.it/rbjoybnmod5b1.jpg"
    ],
    "other_urls": [],
    "postText": "Hi lovely people,\n\nI'm looking for a lipcolour. I never wear lipstick but I got the comment that my lips are too pale and some lipgloss would look good. I suck at makeup but I googled and I found Mac whirl, and google said that colour looks good on everyone. Is that true? Would that look good? I want something that looks natural so not like red or anything. I bought a lot of lipsticks over the years and I still have a lot at home but I can never get the shade right. It's either way too dark/pigmented or it makes my lips look evrn more pale. I want to get permanent makeup on my lips eventually but maybe I can try a lipstick/gloss first.\n\nDoes anyone know of a brand/colour that would look good? Thank you very much 🙏💕",
    "comments": [
        {
            "level": 0,
            "comment": "I bet you could wear any color, gloss or tint.  You are beautiful.  I would wear a natural or nude color something to only enhance your natural lip color.",
            "score": 36,
            "author": "Boofofus",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you, that's exactly what I want, something to enhance my natural lip colour, but I just can't seem to find the right shade. It's either way too pigmented or it makes my lips way lighter which makes me look sick.",
                    "score": 7,
                    "author": "Dazzling-Yam-1151",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you’re looking for something easy and more sheer but still gives you a pop of natural color, I’m actually always surprised by how much I love a simple tinted chapstick like Burt’s Bees in Rose, Hibiscus, Magnolia, etc…",
                            "score": 13,
                            "author": "dumblepup",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's a great tip!! I love the magnolia one. I'll see if they sell them in my country, thanks so much! 🙏",
                                    "score": 3,
                                    "author": "Dazzling-Yam-1151"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yes maybe try MAC in colors like taupe or cherish, just to enhance your natural look",
                    "score": 3,
                    "author": "snpcosmopolitan"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think Clinique Black Honey or Charlotte Tilbury Pillow Talk would look lovely on you.",
            "score": 26,
            "author": "cabal21",
            "replies": [
                {
                    "level": 1,
                    "comment": "I just ordered that first one and the mac lustreglass in pda colour.",
                    "score": 8,
                    "author": "Dazzling-Yam-1151",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 2,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm really excited to see what it will look,like on me",
                                    "score": 1,
                                    "author": "Dazzling-Yam-1151",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Can you show us? I'd love to see the black honey in particular because i want to buy it myself, but i am also super curious to see any others, too. You're so beautiful!",
                                            "score": 3,
                                            "author": "mysticdeer",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I'll make another post once I have them. They will be deliveted wednesday or thursday, although I have to wait till my skin clears up. I just had fractional laser treatment so I look WEIRD now. My eyes are swollen en my skin is bright red",
                                                    "score": 1,
                                                    "author": "Dazzling-Yam-1151",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Hehe, i understand. Wishing you a speedy recovery. \n\nDo you always get fractional or is it your first time? Should your eyes be swollen?",
                                                            "score": 2,
                                                            "author": "mysticdeer",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Very first time and I paid for 3 Treatments upfront but I not so sure anymore if I want the other 2 as well. I kinda underestimated it 😅\n\nI don't know if it's normal that my eyes are swollen I keep calling but they won't answer haha. I hope it's normal cause I'm kinda freaking out.",
                                                                    "score": 1,
                                                                    "author": "Dazzling-Yam-1151",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I have never had it, and so i dont want to alarm you or anything, i could be off base, but i dont think it is normal! \n\nI would have thought it would not go near your eyes because the skin is so delicate, and the risk to your sight... i had a laser skin treatment [not fractional, can't remember what it was], but they gave me goggles to wear. \n\nHave you tried putting a cool compress on them? If you're pain, it might be worth speaking to a doctor rather than the clinic. Or call a different clinic that offers it and explain the situation and ask if it's normal? At least then you will know not to go back to that clinic and to demand a full refund.\n\nEyes are precious things... you wanna be careful :)",
                                                                            "score": 2,
                                                                            "author": "mysticdeer",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Thanks, they didn't put it near my eyes and I did wear goggles but they are still swollen.",
                                                                                    "score": 1,
                                                                                    "author": "Dazzling-Yam-1151",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I think you'll really like the Clinique Black Honey- It's very buildable and you can adjust how much pigment you get. I have a similar hair color to yours and I think it really compliments it",
                            "score": 2,
                            "author": "Asuka--M",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks! I'm really excited for it to arrive. I think it's a great start as I'm not used to wearing any lip colour at all.",
                                    "score": 2,
                                    "author": "Dazzling-Yam-1151"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I was also going to recommend Black Honey!",
                    "score": 3,
                    "author": "thedesignproject"
                },
                {
                    "level": 1,
                    "comment": "I was just looking at the black honey before! Great suggestion for her!",
                    "score": 1,
                    "author": "mysticdeer"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I feel like burnt orange or merlot type of colors would look amazing! Do you happen to know your color season?",
            "score": 14,
            "author": "hyprsxl",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh man I wish!!",
                    "score": 2,
                    "author": "Dazzling-Yam-1151"
                },
                {
                    "level": 1,
                    "comment": "That would make it so much easier right! I'm dying to find out but I have no idea how. I found a company nearby where.you can do a colour test kinda thing but it costs more than 100 euros. I did every kinda test on youtube I can find but I can't figure it out 😔",
                    "score": 2,
                    "author": "Dazzling-Yam-1151",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Do you have an idea of what colors you tend to buy or reach for most frequently? My color season (true spring) was kinda easy for me to figure out because my whole closet was filled with coral, spring green and orange-red tones",
                            "score": 2,
                            "author": "hyprsxl",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Black. 95% of the clothing I own is black. I'm usually in all black. Shirt, cardigan, trousers, shoes, socks, underwear. If I do ever get a different color it's an earthy tone, like brown or dark green, but that's mainly because I'm scared to try real colours.",
                                    "score": 3,
                                    "author": "Dazzling-Yam-1151",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Haha I wear so much black too because it's so versatile 😅 I think you have warm features so it's worth checking out the spring and autumn color seasons, and especially celebrities that fall into those categories who might have similar coloring as you. If you wear a shade of orange, do you prefer coral &amp; tomato tones, or do you go more for fall leaf and burnt orange ones?",
                                            "score": 3,
                                            "author": "hyprsxl",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I love orange. If I do ever get something in orange I tend to look for burnt orange and fall leaf.\nSomeone told me I would be Warm spring and cool winter, I wrote that down on my phone but I don't know what it means. \n\nI though there were 2 choices, you are either cold or warm.\nSomeone who can wear gold jewellery or silver jewellery. All of a sudden I found out there were 4 choices which made it even more complicated and recently somebody told me there are way more than 4 choices. So I just kinda gave up 😅",
                                                    "score": 1,
                                                    "author": "Dazzling-Yam-1151",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Haha! Well if those are the types of oranges you go for, then DEFINITELY check out the autumn season. For each season I believe there are 3 subtypes, so it'd just be a matter of figuring out which you fall into. There are tons of websites that help, and I even have a Pinterest board for my season because there are a bajillion resources on there for seasonal color analysis. Knowing your season will help SO much with choosing makeup colors!!",
                                                            "score": 2,
                                                            "author": "hyprsxl",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Yeah I just can't figure it out. Cause when I do a test online it always says I'm a cool tone so I should wear silver jewellery and pink makeup shades and bright colour clothes. But I think I look awefull in all of that, I always go for warm colours, but according to the tests those colours don't work on me.\n🤷‍♀️",
                                                                    "score": 1,
                                                                    "author": "Dazzling-Yam-1151",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Yeah I totally disagree with that- especially if you search for a pic of a known cool toned celebrity and flip back and forth between your pictures, I think you're definitely warm, if not a warm-leaning neutral. A ton of people were suggesting pink on this thread and I honestly didn't understand why cuz I couldn't really imagine that on you! The Concept Wardrobe does have [suggestions](https://theconceptwardrobe.com/colour-analysis-make-up-palettes/the-true-autumn-make-up-palette#makeup-colours) for Warm Autumns; you should check it out and see if you agree with those colors!",
                                                                            "score": 1,
                                                                            "author": "hyprsxl",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "But then again. Autums don't have blue eyes.",
                                                                                    "score": 1,
                                                                                    "author": "Dazzling-Yam-1151",
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "I have been reading the link you sent me and it's funny how I always gravitated towards all the colours mentioned in the article. Even using the bronzer as contour haha",
                                                                                    "score": 1,
                                                                                    "author": "Dazzling-Yam-1151"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "You definitely look like a warm spring to me. \n\nCelebs like Jessica Chastain, Amy Adams, Nicole Kidman, and Christina Hendricks are warm springs. Reddish hair, light eyes and fair skin.",
                                                            "score": 2,
                                                            "author": "CakeForBreakfast08",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Thanks! I was on the fence between autum and warm spring myself. They said warm spring is a bit brighter where autumn is more muted and I think muted looks better on me, although when I compare myself with celebrities I indeed feel I fall more into the warm spring categorie.",
                                                                    "score": 1,
                                                                    "author": "Dazzling-Yam-1151"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I dont think you're a winter. I agree that you may be autumn.... or a spring. You should repost this pic in the colour analysis sub and ask what people think :)",
                                                            "score": 1,
                                                            "author": "mysticdeer"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That would make it so much easier right! I'm dying to find out but I have no idea how. I found a company nearby where.you can do a colour test kinda thing but it costs more than 100 euros. I did every kinda test on youtube I can find but I can't figure it out 😔",
                    "score": 1,
                    "author": "Dazzling-Yam-1151"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think if you’re not used to wearing color, a matte lipstick like Whirl might look too harsh. For myself, I feel like I need a full face of makeup to make it work, but I also like to have some color on my lips no matter what. So, introducing tinted balm-esque products! A little expensive but Clinique’s Almost Lipstick in the shade Black Honey is a cult favorite and looks amazing on almost everyone. I really like the Neutrogena Revitalizing Lip Balm in the shade sunny berry, Burt’s Bees also makes a great one. I find that I can even put all of these on the cheeks for a dewy glow. And btw, I love your hair- it looks so healthy and shiny!",
            "score": 8,
            "author": "nyli07",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much! The black honey one was the second recommendation by google. I'll go with that one then. I love it that it's not that pigmented.",
                    "score": 7,
                    "author": "Dazzling-Yam-1151"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You are absolutely stunning 😍 \nMaybe try lipstick queen frog prince or something similar? It enhances your natural lip colour. I absolutely love those, long lasting and it gives a super natural look.",
            "score": 3,
            "author": "Funny_Tale_6516",
            "replies": [
                {
                    "level": 1,
                    "comment": "Omg that's so weird, I have never seen anything like that, but I love the colour! Thank you so much 🙏",
                    "score": 2,
                    "author": "Dazzling-Yam-1151"
                },
                {
                    "level": 1,
                    "comment": "Lipstick queen is amazing!",
                    "score": 1,
                    "author": "WhiningforWine"
                }
            ]
        },
        {
            "level": 0,
            "comment": "For just that sheer, me but better with a little glossy but not sticky feel, I love the makeup by Mario Moisture glow plumping lip serum. I have a similar complexion to you and I love the color pink glow. Pinky mauve would probably work really really well on you too",
            "score": 3,
            "author": "FelineRoots21",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much 🙏",
                    "score": 1,
                    "author": "Dazzling-Yam-1151"
                }
            ]
        },
        {
            "level": 0,
            "comment": "L'Oreal Timeless Rose  110 (infallible). I am pale and it looks lovely. Definitely would suit you!",
            "score": 2,
            "author": "ComposerConfident311",
            "replies": [
                {
                    "level": 1,
                    "comment": "A lot of people said a pink shade. I hate pink so much on me but looks like I have to give it another shot.",
                    "score": 1,
                    "author": "Dazzling-Yam-1151"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You and I have similar natural color palette, and I love these sheer buildable lipsticks by Drew Barrymore. I have two of the neutral ones which I love, the berry color one, and a bright red. They can be very subtle or you can put on several layers on, and they have some really beautiful neutral-pinks that might be what you’re looking for. I’d recommend trying the color Peony or Tiger Lily. They go on much more subtle than the lipstick itself looks.\n\nhttps://preview.redd.it/lb2qodwebf5b1.jpeg?width=1170&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=d39ed7a0e6c6d7b311b6294b43a064e2b2d43d0d\n\nThey’re sold out on the official site but I got mine at a grocery store, they’re available pretty much anywhere they sell makeup.",
            "score": 2,
            "author": "craftwagon",
            "replies": [
                {
                    "level": 1,
                    "comment": "I looooove the idea of a buildable lipstick! I never wear any colour on my lip so I was scared a very pigmented lipstick would be too extreme to start with. This is perfect, thank you so much! I just ordered the buildable black honey lipstick by clinique",
                    "score": 2,
                    "author": "Dazzling-Yam-1151",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oooh I just looked that up and I might have to order it too… 👀 What a beautiful color!",
                            "score": 2,
                            "author": "craftwagon",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Right! It's told to work on every skin tone because it has the perfect amount of red and blues in it. So it works on really pale people, asian people, black people, litterally every skin tone. Your own lip shade but better. I'm really excited to try it!",
                                    "score": 2,
                                    "author": "Dazzling-Yam-1151",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ah I remember some articles about lip colors that mimic the color of blood being really good for all skin tones because we all have hints of that color under our skin- I’ll definitely be ordering some of this!",
                                            "score": 1,
                                            "author": "craftwagon"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Sometimes I use them as a gloss on top of a neutral lipstick to add a little bit of a color tint to match my outfit/vibe for the day. Like I’ll wear a cheap wet &amp; wild neutral lipstick and put a layer of the Flower brand berry color on top to make it warmer and slightly pink, to look more like an enhanced version of my actual lip color",
                    "score": 1,
                    "author": "craftwagon"
                }
            ]
        },
        {
            "level": 0,
            "comment": "i think bright red would match your skin tone and your hair🥰❤️",
            "score": 2,
            "author": "Jazminmaddern",
            "replies": [
                {
                    "level": 1,
                    "comment": "Omg girl I could never 😳",
                    "score": 3,
                    "author": "Dazzling-Yam-1151",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "awww why not🥺",
                            "score": 1,
                            "author": "Jazminmaddern",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I wish I could pull off any kind of red, but I'm too pale for that. I always look like a kid that played with mommys makeup if I dare to try a red lipstick.",
                                    "score": 2,
                                    "author": "Dazzling-Yam-1151",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "same here! xD",
                                            "score": 1,
                                            "author": "Jazminmaddern"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "i love your hair btw! you are absolutely gorgeous ❤️❤️❤️",
                            "score": 0,
                            "author": "Jazminmaddern"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": " your make up tone look clean and you look good on it so better use nude colors or lip gloss only",
            "score": 2,
            "author": "Im_Oil2435",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you 🙏",
                    "score": 1,
                    "author": "Dazzling-Yam-1151"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think pink or nude with a lip gloss",
            "score": 2,
            "author": "EmbarrassedGuava6998",
            "replies": [
                {
                    "level": 1,
                    "comment": "2 of the colours I absolutely hate, but a lot of people suggested pink so seems like i have no choice haha",
                    "score": 1,
                    "author": "Dazzling-Yam-1151"
                }
            ]
        },
        {
            "level": 0,
            "comment": "MAC Cosmo or a sheer coral color",
            "score": 2,
            "author": "kebuburdie"
        },
        {
            "level": 0,
            "comment": "https://preview.redd.it/3hvv4bxyeg5b1.jpeg?width=1164&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=75e4f03c911b94fad3afa22f1d49eebf8416f4db\n\nThis could also be affective in being complimentary with your eyes",
            "score": 2,
            "author": "summjeni",
            "replies": [
                {
                    "level": 1,
                    "comment": "Beautiful but again, I couldn't 😅",
                    "score": 1,
                    "author": "Dazzling-Yam-1151"
                }
            ]
        },
        {
            "level": 0,
            "comment": "A nice, deep pink. Something that will darken your lips just a touch, but if I were you I’d keep that gorgeous hair the main focus!",
            "score": 2,
            "author": "IceHot88"
        },
        {
            "level": 0,
            "comment": "Like a Matte pink, not a bright pink, almost a nude type color.",
            "score": 2,
            "author": "Geto_Suguru13",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you 🙏",
                    "score": 1,
                    "author": "Dazzling-Yam-1151"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Glossier Generation G in Like",
            "score": 2,
            "author": "JunoD420"
        },
        {
            "level": 0,
            "comment": "I recently got the glossier ultralip. It's a sheer high shine lipstick that still looks pretty natural. I think just about any of the colors would look good on you tbh. Plus it's nice and comfortable if you aren't used to wearing anything on your lips.",
            "score": 2,
            "author": "gotissuesiguess",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah I'm not used to wearing any lip colour so that wouldbe perfect",
                    "score": 1,
                    "author": "Dazzling-Yam-1151"
                }
            ]
        },
        {
            "level": 0,
            "comment": "how about this revlon one? I think it would look gorgeous on you\n\nhttps://preview.redd.it/lm6l0w79xh5b1.jpeg?width=736&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=10bcac0cef8d9d48912a9fd6ff44658e77e3ff82",
            "score": 2,
            "author": "veemah",
            "replies": [
                {
                    "level": 1,
                    "comment": "I love that colour!!!",
                    "score": 2,
                    "author": "Dazzling-Yam-1151"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think you can try MAC. They have various of matte lipsticks. If you don’t favor red tone, you can try their nude collection. I think the peachy nude would fits you!",
            "score": 2,
            "author": "nomorework11",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you! I just ordered a MAC one",
                    "score": 2,
                    "author": "Dazzling-Yam-1151"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I havent seen a singly person who looks bad with Clinique’s Black Honey. Don’t be scared by the colour in the tube, it’s milder on the lips :)",
            "score": 2,
            "author": "FaelleTheFae",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah I ordered that one! And I'm super excited to try it. I think it's a great start as I never wear any lip colour at all.",
                    "score": 1,
                    "author": "Dazzling-Yam-1151"
                }
            ]
        },
        {
            "level": 0,
            "comment": "As a fellow auburn girly: BROWN/ORANGE mate liquid lipsticks😍 my all time fav",
            "score": 2,
            "author": "saltywqffle",
            "replies": [
                {
                    "level": 1,
                    "comment": "I love brown/orange!",
                    "score": 2,
                    "author": "Dazzling-Yam-1151"
                },
                {
                    "level": 1,
                    "comment": "Oh and happy cake day!!",
                    "score": 2,
                    "author": "Dazzling-Yam-1151",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you☺️",
                            "score": 1,
                            "author": "saltywqffle"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don’t have any helpful advice because I also have so much trouble with lip color - but I just wanted to say your hair color is so gorgeous!! I’m super jealous over here 😅",
            "score": 2,
            "author": "cheecheebun",
            "replies": [
                {
                    "level": 1,
                    "comment": "Aw thanks, I hate my hair so much, I can barely imagine someone likes it. I wish I had straight, frizz free easy hair",
                    "score": 1,
                    "author": "Dazzling-Yam-1151",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I have a similar texture and curl pattern, I feel you. Oil on the ends and a very lightweight mousse helps me somewhat, but I usually just spend 500 years blowing it straight.",
                            "score": 2,
                            "author": "cheecheebun",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh wooooow that's pricey, how long does that last?",
                                    "score": 1,
                                    "author": "Dazzling-Yam-1151",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Oh I was just being silly about the length of time it takes me to blow dry straight. It takes forever. Sorry for the confusion!",
                                            "score": 1,
                                            "author": "cheecheebun",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Oh oops, English is not my native languahe, sometimes I screw up a bit",
                                                    "score": 1,
                                                    "author": "Dazzling-Yam-1151"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "***Thank you for contributing to MUA! If this is your first post, please be sure to check out our rules in the subreddit sidebar. If you are on mobile, they can be viewed by tapping the*** ⓘ ***symbol.***\n\n**A few quick highlights:**\n•  \n\n• Looks, hauls, and flatlays require a [product list in the comments, complete with shade names within 20 minutes of posting.](https://www.reddit.com/r/MakeupAddiction/wiki/productlist)\n\n• Photos must not be [edited or filtered. This includes automatic beauty and portrait modes found on many phones and newer cameras.](https://www.reddit.com/r/MakeupAddiction/wiki/photoediting)\n\n• Lastly, our [Helpful Guides for Navigating MUA](https://www.reddit.com/r/MakeupAddiction/wiki/helpfulguides) in the sidebar explains some of the basics of the community as well as commonly misinterpreted rules.\n\n**Is your post just a search away?**\n\nBefore you make a post, search with Reddit's search feature or use this handy [customised Google search.](https://cse.google.com/cse?cx=008480394191906358284:aflieg73nqm)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MakeupAddiction) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Hi! This post was submitted during Pride Month 2023. If you have a look to share, please feel free to enter it in our [Pride Month Contest](https://www.reddit.com/r/MakeupAddiction/comments/13xm7a9/pride_2023_contest/)! If you don't have a look to share, that's okay, but you should still check our contest out!!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MakeupAddiction) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "If you want to see more pictures of me I posted a few yesterday.",
            "score": 1,
            "author": "Dazzling-Yam-1151"
        },
        {
            "level": 0,
            "comment": "I think a nude, a light pink or maybe even a peachy color would be perfect, i would say something \"natural\"",
            "score": 1,
            "author": "Out-gros-papa",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks I want to get something natural definitely. Whenever I get pink it's often too light and makes me look sick or way too pigmented. I just can't seem to find the right shade. But I just ordered 2 so let's hope these ones will be a good fit",
                    "score": 2,
                    "author": "Dazzling-Yam-1151"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think a purply/pink would go so good with your eyes.  Or a nude/light pink or coral. You're so pretty",
            "score": 1,
            "author": "fancyandfab",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks. I really disliked the pink/peach colours on me. But more people here recommended pink/peach so I'll give it another try!",
                    "score": 1,
                    "author": "Dazzling-Yam-1151"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would def go with pink!",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks I'll give pink another try",
                    "score": 2,
                    "author": "Dazzling-Yam-1151"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Bobbi Brown lip tint ftw! Bare Melon and Bare Punch  are my faves.",
            "score": 1,
            "author": "OhSoSensitive",
            "replies": [
                {
                    "level": 1,
                    "comment": "Omg I love the bare melon one",
                    "score": 2,
                    "author": "Dazzling-Yam-1151"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ulta luxe lipstick has a color called Sugar and Spice that would look amazing on you! I’ll mix it with a gloss for a lighter/sheerer color",
            "score": 1,
            "author": "Theaterandacnh"
        },
        {
            "level": 0,
            "comment": "Loreal colour riche in Nature's Blush (shade #840) it's a creamy satin color that would look great on you",
            "score": 1,
            "author": "MochaSublime",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, looks like I have to give pink another try 😅",
                    "score": 1,
                    "author": "Dazzling-Yam-1151",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You could always go with a lip tint as well there's lots out now that area great if you don't want to commit to a lipstick like ummm periphera lip tint you can find them on Amazon they are great",
                            "score": 2,
                            "author": "MochaSublime",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'll have a look thanks so much!!",
                                    "score": 1,
                                    "author": "Dazzling-Yam-1151"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have similar coloring as you, but I have blonde hair. I  love MAC \"thanks it's MAC\" and Merit \"Baby.\" Both nude lipsticks. Clinque \"Black Honey\" is also really pretty and kind of sheer it looks kind of \"jammy\" and juicy.",
            "score": 1,
            "author": "livibeeboo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Those look beautiful as well!",
                    "score": 1,
                    "author": "Dazzling-Yam-1151"
                }
            ]
        },
        {
            "level": 0,
            "comment": "https://preview.redd.it/6e0iqtfreg5b1.jpeg?width=1164&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=1faa754941cf3d8b9386b163e0b15c5fb749de10\n\nI love the color bringing out your whole face",
            "score": 1,
            "author": "summjeni",
            "replies": [
                {
                    "level": 1,
                    "comment": "I see it, but I would be way too self concious walking out like this",
                    "score": 1,
                    "author": "Dazzling-Yam-1151"
                }
            ]
        },
        {
            "level": 0,
            "comment": "https://preview.redd.it/zwwsj9h9fg5b1.jpeg?width=1164&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=d18d46b7d146ac549966c70870a60fdacb6a10ba",
            "score": 1,
            "author": "summjeni",
            "replies": [
                {
                    "level": 1,
                    "comment": "See I really don't see the pink, everyone keeps saying pink but I think it looks weird on me.",
                    "score": 1,
                    "author": "Dazzling-Yam-1151",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This has more of a blue or purple hue",
                            "score": 1,
                            "author": "summjeni"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Your hair is very bright (and beautiful) so something that pops a bit more not pink or red, something in the wine area. It'll give you some color and balance",
            "score": 1,
            "author": "no_nonsense_206",
            "replies": [
                {
                    "level": 1,
                    "comment": "I love a wine colour!",
                    "score": 1,
                    "author": "Dazzling-Yam-1151"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I love the hair, a red would be insane 🥰🥰😍\n\nBut there is a shade i have from the Disney Villans collection, and I think Hades would be really pretty on you for a more day to day wear.\n\nI mean you could literally pull of any colour or gloss you are stunning! 🥰😍",
            "score": 1,
            "author": "raggydoll7568"
        },
        {
            "level": 0,
            "comment": "I had this issue and I’m a little more tan than you.\n\nI found Dior Lip Glow, there’s different shades and you can see them in store at Sephora! \nIt’s now my daily lip since I don’t like wearing gloss or lipstick and just need a hint of color.",
            "score": 1,
            "author": "kttuatw",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks. We don't have a sephora in the Netherlands",
                    "score": 1,
                    "author": "Dazzling-Yam-1151"
                }
            ]
        },
        {
            "level": 0,
            "comment": "A bright redddd",
            "score": 1,
            "author": "Leeanii",
            "replies": [
                {
                    "level": 1,
                    "comment": "Haha noooo I can't pull that off, and even if I could I couldn't",
                    "score": 1,
                    "author": "Dazzling-Yam-1151"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You’re gorgeous",
            "score": 1,
            "author": "Prestigious_Ad_8458",
            "replies": [
                {
                    "level": 1,
                    "comment": "Agree to disagree 😬",
                    "score": 1,
                    "author": "Dazzling-Yam-1151"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You should definitely go to a department store, Srphora, or Ulta and try on different shades. It will be easier for you in the long run and you will find the best product.",
            "score": 1,
            "author": "catcat944",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you we don't have those in the Netherlands. I once went to a tiny Mac department in a store and they did my makeup, she told me I was cool toned and I walked out with some blue undertone lipsticks in the most horrendous shades on me. I thought well she is the professional, I might not like it but if she says it looks good on me 🤷‍♀️ I walked around like the biggest idiot for a while and I was very glad when my husband said: can you please not wear those lipsticks again, they look horrible.\n\nThat was my only ever experience with someone doing my makeup (and makeup store) and I'm never doing it again.",
                    "score": 1,
                    "author": "Dazzling-Yam-1151"
                }
            ]
        },
        {
            "level": 0,
            "comment": "A newer trend is to match your nipple color. 🙃",
            "score": 1,
            "author": "Funcheckers",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh goodness 😅",
                    "score": 1,
                    "author": "Dazzling-Yam-1151"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Pink",
            "score": 1,
            "author": "SunnyDispo23"
        },
        {
            "level": 0,
            "comment": "Anything light and warm would look stunning! Corals, peaches even oranges.",
            "score": 1,
            "author": "lordeughan"
        },
        {
            "level": 0,
            "comment": "If you want something natural, I’d say go towards light pinks, kinda like baby pink",
            "score": 1,
            "author": "The_Death_Flower"
        },
        {
            "level": 0,
            "comment": "Do you have a Sephora near you? That's where I went to find my perfect match \"natural\" lipstick, it's like my own lips but better. I tried several shades I was iffy on but settled on Dior's Nude Touch",
            "score": 1,
            "author": "nosomewhereat",
            "replies": [
                {
                    "level": 1,
                    "comment": "No we don't have those in the Netherlands.",
                    "score": 1,
                    "author": "Dazzling-Yam-1151"
                }
            ]
        },
        {
            "level": 0,
            "comment": "A mauve-y color!",
            "score": 1,
            "author": "Live_Review3958"
        },
        {
            "level": 0,
            "comment": "My favorite \"every day\" lip color is Mac Lipglass in Spite",
            "score": 1,
            "author": "Wise_Movie_9389"
        },
        {
            "level": 0,
            "comment": "You’re beautiful. Would love to make you a tribute",
            "score": -1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Beautiful",
            "score": 0,
            "author": "RefrigeratorOk2785"
        }
    ]
}