{
    "id": "147sde5",
    "score": 1,
    "title": "Need some help picking a red lipstick",
    "author": "SleepyheadAsmr",
    "date": 1686590308.0,
    "url": "https://www.reddit.com/r/MakeupAddiction/comments/147sde5",
    "media_urls": [],
    "other_urls": [],
    "postText": "So I love red lipstick, but I’m not sure what undertone to pair it with coral/peach tone blushes. I have a very yellow neck but a pretty pink face. I like to wear coral/peach toned blushes because they look more natural and the best on me compared to pinker blushes. Don’t get me wrong I love pink blushes but coral and peaches look the best on me. I need a bit of help picking out a red lipstick preferably a liquid matte lipstick. I love one size and was thinking about the one size red or no speed limit since these two in my opinion are a favorite. I do have joelapuss since it pairs so well with my blush, but I want a red one and I’m not sure if it’ll go with peachy blush.",
    "comments": [
        {
            "level": 0,
            "comment": "***Thank you for contributing to MUA! If this is your first post, please be sure to check out our rules in the subreddit sidebar. If you are on mobile, they can be viewed by tapping the*** ⓘ ***symbol.***\n\n**A few quick highlights:**\n•  \n\n• Looks, hauls, and flatlays require a [product list in the comments, complete with shade names within 20 minutes of posting.](https://www.reddit.com/r/MakeupAddiction/wiki/productlist)\n\n• Photos must not be [edited or filtered. This includes automatic beauty and portrait modes found on many phones and newer cameras.](https://www.reddit.com/r/MakeupAddiction/wiki/photoediting)\n\n• Lastly, our [Helpful Guides for Navigating MUA](https://www.reddit.com/r/MakeupAddiction/wiki/helpfulguides) in the sidebar explains some of the basics of the community as well as commonly misinterpreted rules.\n\n**Is your post just a search away?**\n\nBefore you make a post, search with Reddit's search feature or use this handy [customised Google search.](https://cse.google.com/cse?cx=008480394191906358284:aflieg73nqm)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MakeupAddiction) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Hi! This post was submitted during Pride Month 2023. If you have a look to share, please feel free to enter it in our [Pride Month Contest](https://www.reddit.com/r/MakeupAddiction/comments/13xm7a9/pride_2023_contest/)! If you don't have a look to share, that's okay, but you should still check our contest out!!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MakeupAddiction) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        }
    ]
}