{
    "id": "1484jln",
    "score": 16,
    "title": "I’ve taken a lot of advice for heavier glam looks, how is my overall finish? (evenness, smoothness, etc) MTF transformation 🏳️‍⚧️",
    "author": "brittanybanksthanks",
    "date": 1686624366.0,
    "url": "https://www.reddit.com/r/MakeupAddiction/comments/1484jln",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Gorgeous application, but one thing I would recommend is either adding a bit more bronzer to darken the foundation a bit more or to find a foundation shade that’s a bit more olive undertoned. Other than that, you’re doing fabulously love!!",
            "score": 2,
            "author": "Omniartindividual"
        },
        {
            "level": 0,
            "comment": "That is a very nice, smooth full coverage look! Were you going for a more goth aesthetic or a heavier glam look? The main thing you'd want to change for a glam look would be to have an at least slightly dewier foundation and to add just a touch of highlighter to your cheeks so that they pick up the light. If you're after a goth look, you're perfectly there! Any adjustments would be a matter of preference more than critiques on technique.",
            "score": 2,
            "author": "turnoffthe8track"
        },
        {
            "level": 0,
            "comment": "Where did you get your top/dress? I love the sleeves.",
            "score": 1,
            "author": "ultraviolet_333"
        },
        {
            "level": 0,
            "comment": "Very pretty face and feminine",
            "score": -3,
            "author": "3inchdicklettt"
        },
        {
            "level": 0,
            "comment": "Hi! This post was submitted during Pride Month 2023. If you have a look to share, please feel free to enter it in our [Pride Month Contest](https://www.reddit.com/r/MakeupAddiction/comments/13xm7a9/pride_2023_contest/)! If you don't have a look to share, that's okay, but you should still check our contest out!!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MakeupAddiction) if you have any questions or concerns.*",
            "score": -1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "***Thank you for contributing to MUA! If this is your first post, please be sure to check out our rules in the subreddit sidebar. If you are on mobile, they can be viewed by tapping the*** ⓘ ***symbol.***\n\n**A few quick highlights:**\n•  \n\n• Looks, hauls, and flatlays require a [product list in the comments, complete with shade names within 20 minutes of posting.](https://www.reddit.com/r/MakeupAddiction/wiki/productlist)\n\n• Photos must not be [edited or filtered. This includes automatic beauty and portrait modes found on many phones and newer cameras.](https://www.reddit.com/r/MakeupAddiction/wiki/photoediting)\n\n• Lastly, our [Helpful Guides for Navigating MUA](https://www.reddit.com/r/MakeupAddiction/wiki/helpfulguides) in the sidebar explains some of the basics of the community as well as commonly misinterpreted rules.\n\n**Is your post just a search away?**\n\nBefore you make a post, search with Reddit's search feature or use this handy [customised Google search.](https://cse.google.com/cse?cx=008480394191906358284:aflieg73nqm)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MakeupAddiction) if you have any questions or concerns.*",
            "score": 0,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "you are BEAUTIFUL!!! smoothness is awesome and i love the purple lip on you",
            "score": 0,
            "author": "Brave_Sweet5535"
        },
        {
            "level": 0,
            "comment": "Omg! Stunning🥰 I absolutely love your eyes/lip look!!",
            "score": 0,
            "author": "memopepito"
        }
    ]
}