{
    "id": "148gjzc",
    "score": 6,
    "title": "Does anyone know how to cover up a small, somewhat raised scar on the face?",
    "author": "messedupmylegs",
    "date": 1686666041.0,
    "url": "https://www.reddit.com/r/MakeupAddiction/comments/148gjzc",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello! 👋 I am new to posting here, although I have been lurking on this sub for a while now. I am also new to using makeup as well.💄 I have a small, somewhat raised white scar on my face. It is located in between my nose and lips. Unfortunately I fell face first a few years back. ☹️ Anyway, I was hoping to get some suggestions on how to cover my scar up with some makeup. Please let me know any methods and products that I should use. Thanks so much! 🙏\n\nEDIT: I posted a photo of the scar in the comments. ❤️",
    "comments": [
        {
            "level": 0,
            "comment": "https://preview.redd.it/c0xkw428os5b1.jpeg?width=438&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=5425d3af1eab8fa53b087a89d875bca317fd914a\n\n⬆️ Here is a photo of the scar.",
            "score": 3,
            "author": "messedupmylegs"
        },
        {
            "level": 0,
            "comment": "Hi, I'm not experienced with makeup enough to give a great answer. Sorry this isn't directly relevant but if you want to try to reduce the scar you may want to check out the skincare subs for advice there as well. r/SkincareAddiction if/when it becomes public again. r/SkincareAddicts\n\nI've actually used Mederma on facial scars and had a lot of success, I've more recently started using tretinoin which you can get an Rx for online. Of course, what works for me may not work for you so do research and patch tests. \n\nHope this comment doesn't break rules, I looked at the rules but if I missed something I'll delete. Sorry again that this isn't makeup advice but just wanted to share. 🙂",
            "score": 3,
            "author": "HaveASeatChrisHansen",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks I appreciate your advice!🙏I did want to ask you if you know why that sub isn’t public? I’ve heard about a Reddit blackout, but I have no idea what’s going on. Is that sub related to the blackout? 🤔",
                    "score": 3,
                    "author": "messedupmylegs",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, it's a protest against the way Reddit is handling access for 3rd party apps.\n\nBasically, Reddit is charging an huge fee with little notice that'll kill 3rd party apps that lots of people use, including myself.\n\nThere's a whole lot of other issues around it. How Reddit is handling it, accusations,  making things harder for mods, content restrictions, accessibility for blind users.\n\nSome subs are dark temporarily, some indefinitely, some read only. [Here's an in depth write up about it.](https://www.reddit.com/r/explainlikeimfive/comments/147vis2/eli5_why_are_so_many_subreddits_going_dark) . There's also a lot of external articles about it if you Google around.\n\n[Also, this explanation. ](https://www.reddit.com/r/OutOfTheLoop/comments/147fcdf/whats_going_on_with_subreddits_going_private_on)",
                            "score": 2,
                            "author": "HaveASeatChrisHansen"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "***Thank you for contributing to MUA! If this is your first post, please be sure to check out our rules in the subreddit sidebar. If you are on mobile, they can be viewed by tapping the*** ⓘ ***symbol.***\n\n**A few quick highlights:**\n•  \n\n• Looks, hauls, and flatlays require a [product list in the comments, complete with shade names within 20 minutes of posting.](https://www.reddit.com/r/MakeupAddiction/wiki/productlist)\n\n• Photos must not be [edited or filtered. This includes automatic beauty and portrait modes found on many phones and newer cameras.](https://www.reddit.com/r/MakeupAddiction/wiki/photoediting)\n\n• Lastly, our [Helpful Guides for Navigating MUA](https://www.reddit.com/r/MakeupAddiction/wiki/helpfulguides) in the sidebar explains some of the basics of the community as well as commonly misinterpreted rules.\n\n**Is your post just a search away?**\n\nBefore you make a post, search with Reddit's search feature or use this handy [customised Google search.](https://cse.google.com/cse?cx=008480394191906358284:aflieg73nqm)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MakeupAddiction) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Hi! This post was submitted during Pride Month 2023. If you have a look to share, please feel free to enter it in our [Pride Month Contest](https://www.reddit.com/r/MakeupAddiction/comments/13xm7a9/pride_2023_contest/)! If you don't have a look to share, that's okay, but you should still check our contest out!!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MakeupAddiction) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Can you take a picture of it with the skin relaxed vs taunt? \nBear in mind you can cover said scar but you can’t make it even to the skin. \nI would put a pore refining primer lightly across the face like smash box pore minimize one as it will give a smoothness to the skin. \nThen I would suggest lightly stippling a light bisque color corrector on the scar and either apply foundation over it or stipple a concealer that matches your skin tone to blend it into your skin. Good luck!",
            "score": 1,
            "author": "sociosexualfun",
            "replies": [
                {
                    "level": 1,
                    "comment": "https://preview.redd.it/9t20jvvsvt5b1.jpeg?width=470&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=b295adb0033232602808b40ed1babbbbbf10a2f5\n\nI hope this picture is better. I have no idea what you meant about it being taunt and relaxed. So you think the primer will make it look less raised? Do you know anything that will help with the shinyness by any chance?",
                    "score": 1,
                    "author": "messedupmylegs",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The primer will help give it a smoothness and mattify the area for when you put the product on top of it. Based off your skin tone I would recommend the Nars radiant creamy concealer in shade honey.",
                            "score": 1,
                            "author": "sociosexualfun"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "https://preview.redd.it/u6a5s495wt5b1.jpeg?width=619&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=cfdabb3c954a11c8f61cc24e203f614c14b186a5",
                    "score": 1,
                    "author": "messedupmylegs"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So, topology isn't really easy to hide in everyday makeup (raised skin, dents, inflamed pimples etc) if you wanted not to be noticeable in real life, just thought I should set expectations.\n\nThat being said, you can make the scar less visible using a little concealer since it seems lighter than your skin tone.\n\nIf you wear makeup on your entire face (doesn't have to be full coverage), you can get away with a bit more coverage and especially powder. Powder will remove shine, which will make shadows and highlights much more diffuse and give a flatter appearance to your skin\n\nIf you are new to makeup and don't want to wear much, I'd advice to go for a stick concealer for starters. Just dab it on and blend with your fingers. It should have a more matte finish while being more forgiving than a liquid concealer\n\nIf it was for me, as I wear a BB cream most days with some powder, I'd go for a dab of liquid concealer and light powder",
            "score": 1,
            "author": "Pelm3shka",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks so much for your detailed response! 🙏Okay a few things… I do not wear makeup on my entire face. I usually don’t wear any makeup at all. The only makeup that I wear sometimes is mainly eye stuff like eye liner, mascara and eye shadow. That’s only sometimes though. Oh and concealer too for my under eyes and the scar. But I feel like the concealer doesn’t cover the scar much. Anytime I feel like I have good coverage, I feel like it goes away like a minute later. Any advice on that? Also yes the scar is a bit shiny. Any product recommendations to help with that? And any concealer recommendations? Sorry for all the questions, you just seem helpful! 😃",
                    "score": 1,
                    "author": "messedupmylegs"
                }
            ]
        }
    ]
}