{
    "id": "148swjc",
    "score": 1,
    "title": "Eyelash recommendations",
    "author": "Fun-Translator8333",
    "date": 1686699462.0,
    "url": "https://www.reddit.com/r/MakeupAddiction/comments/148swjc",
    "media_urls": [],
    "other_urls": [],
    "postText": "hi all, I was getting professional eyelash extensions done for almost a year but recently developed an allergy to them which sucks so I’m not going to get them done anymore. I’ve used magnetic lashes in the past and liked them a lot better than the typical lashes with glue. Any recommendations for temporary lashes for everyday wear? Easy, quick, voluminous (preferably any good recommendations for sensitive eyes. Idk how I developed this allergy after getting them done 6x before experiencing severe allergies.)",
    "comments": [
        {
            "level": 0,
            "comment": "***Thank you for contributing to MUA! If this is your first post, please be sure to check out our rules in the subreddit sidebar. If you are on mobile, they can be viewed by tapping the*** ⓘ ***symbol.***\n\n**A few quick highlights:**\n•  \n\n• Looks, hauls, and flatlays require a [product list in the comments, complete with shade names within 20 minutes of posting.](https://www.reddit.com/r/MakeupAddiction/wiki/productlist)\n\n• Photos must not be [edited or filtered. This includes automatic beauty and portrait modes found on many phones and newer cameras.](https://www.reddit.com/r/MakeupAddiction/wiki/photoediting)\n\n• Lastly, our [Helpful Guides for Navigating MUA](https://www.reddit.com/r/MakeupAddiction/wiki/helpfulguides) in the sidebar explains some of the basics of the community as well as commonly misinterpreted rules.\n\n**Is your post just a search away?**\n\nBefore you make a post, search with Reddit's search feature or use this handy [customised Google search.](https://cse.google.com/cse?cx=008480394191906358284:aflieg73nqm)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MakeupAddiction) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Hi! This post was submitted during Pride Month 2023. If you have a look to share, please feel free to enter it in our [Pride Month Contest](https://www.reddit.com/r/MakeupAddiction/comments/13xm7a9/pride_2023_contest/)! If you don't have a look to share, that's okay, but you should still check our contest out!!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MakeupAddiction) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Eyelash glue allergy gets worse every time you apply them. It’s most likely acrylates, it happened to me too. I found I can tolerate falscara and some pre-glued lashes. I think KISS just came out with pre-glued lashes that work like falscara and they come in a few different kinds, I like those.",
            "score": 1,
            "author": "nudes-bot"
        },
        {
            "level": 0,
            "comment": "Why don’t you try latisse ? Another good option for growing your own is a obagi lash lengthining product",
            "score": 1,
            "author": "Muffycola"
        }
    ]
}