{
    "id": "iz8z7w",
    "score": 45838,
    "title": "I makeup meme’d myself. What do you think?",
    "author": "Natural-but-BEAT",
    "date": 1600992396.0,
    "url": "https://www.reddit.com/r/MakeupAddiction/comments/iz8z7w",
    "media_urls": [
        "https://i.redd.it/vpl5ioiuq6p51.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "These comments are locked while the mods clean up and haul away astronomical amounts of sodium, please stand by. 🧂🧂 \n\nEdit: Unfortunately, the pure salt this thread generated has overwhelmed us. The thread is staying locked. Have a nice night folks!\n\n^#blacklivesmatter ^#JusticeForBreonna",
            "score": 1,
            "author": "TheYellowRose"
        },
        {
            "level": 0,
            "comment": "Top left: what Sims 2 devs think is everyday makeup",
            "score": 2395,
            "author": "potheadmed",
            "replies": [
                {
                    "level": 1,
                    "comment": "Any sims game really",
                    "score": 280,
                    "author": "lemons_for_deke"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Product list Primer-elf poreless putty primer Color corrector-la girl pro orange\n\nBrows-NYX brow gel in espresso Concealer to clean up-la girl pro concealer in fawn Eyeshadow base-blank canvas Eyeshadow- Huda beauty obsessions palette in warm brown and I used the black from the Smokey palette Blue shadow from Glamour palette by Arri and co Eyeliner-kiss lash glue liner Eyelashes-an Amazon brand\n\nFoundation-maybelline fit me matte and poreless in shade 365 Highlighting concealer-elf 16hr camo concealer in deep cinnamon Bronzer-black radiance dark to deep contour palette Blush-Saharan blush volume 1 palette (orange) Highlighter-gold from the Saharan blush palette\n\nSetting powder-morphe (banana rich) Setting spray-maybelline lasting fix\n\nLipstick-Milani matte lip crayon in shade “off the wall” Bright red lipstick is Fenty beauty stunna red lip paint",
            "score": 384,
            "author": "Natural-but-BEAT",
            "replies": [
                {
                    "level": 1,
                    "comment": "How do you like the ELF putty primer? Your skin looks amazing but is it heavy? Light?",
                    "score": 68,
                    "author": "tritonbio2",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The first time I used it this summer it seemed oily, but I decided to try it again today since I’m working on using exclusively inexpensive makeup for a project, and I love it! It’s very lightweight. If you’ve ever used the primer by tatcha, it’s basically the exact same thing except one is $50, and the other is $5-ish",
                            "score": 123,
                            "author": "Natural-but-BEAT"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I love that bright lipstick, it's totally my jam (is it wrong that I'm usually a Top Left??) Thanks for sharing what brand and shade it was!",
                    "score": 47,
                    "author": "celestialwreckage",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not op, but there is nothing wrong with being top left! The only thing I would recommend is using a softer/neutral color for the lips if you want to do bright eyeshadow, and vice versa. But do whatever makes you happy!",
                            "score": 50,
                            "author": "roryunicornprincess"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I had a man say to me that he thought women should wear little-to-no makeup, “like Kim Kardashian.” No disrespect to Kim, but...\n\nLawwwwwd.",
            "score": 3524,
            "author": "gmeldotcom",
            "replies": [
                {
                    "level": 1,
                    "comment": "Circa 2009 an ex boyfriend had the biggest crush on Kim Kardashian because he thought she was a natural beauty and didn't use a lot of make up.",
                    "score": 916,
                    "author": "amusedbemused"
                },
                {
                    "level": 1,
                    "comment": "I just laughed so hard I snorted.",
                    "score": 550,
                    "author": "Missmimi888"
                },
                {
                    "level": 1,
                    "comment": "ITS LITERALLY BECAUSE she mostly wears neutral colors. You can have a carved out contoured face and falsies and men will think it’s natural, as long as you DoNt wEaR a dArK LiP, tHaT’s UnAtTrAcTiVe tO mEn! 🥴",
                    "score": 982,
                    "author": "FloraFit"
                },
                {
                    "level": 1,
                    "comment": "This took me out🤣🤣",
                    "score": 348,
                    "author": "Natural-but-BEAT",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I've had the same shit happen. I didnt like the guy in question(coworker) to begin with so I told him to tell his gf that and see what her response was after trying to explain how wrong he was. Apparently that caused an arguement and when he came in later bitching about it my coworkers (mostly married men who fuckin know better) gave him hell too for being an idiot.",
                    "score": 91,
                    "author": "snailmints"
                },
                {
                    "level": 1,
                    "comment": "I got recommended a \"Kim K\" makeup tutorial once iny YouTube feed with a guy that does Jennifer López's makeup.\n\nAs a guy that's never worn makeup and likes watching videos on things I don't know about it, I gave it a shot.\n\nI had to skip forward a bunch because Holy shit it took forever. I imagine it goes faster when you're doing it everyday and not having to explain what you're doing as you're doing it. Even still, that's like 30-45 minutes in a chair every day just doing shaping and contouring and getting all your lines right. Not to mention the crazy cost of high end cosmetics.\n\nAll the power to men and women who like to glam up with a high end look, but I am too damn impatient. I imagine taking that much makeup off at the end of the day feels like taking off your socks and boots at the end of the day where you just feel a weight off you.",
                    "score": 136,
                    "author": "4Eights"
                },
                {
                    "level": 1,
                    "comment": "This is hilarious.",
                    "score": 87,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 83,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": -3,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "To be fair men care a lot more about women's makeup than men think they do. Cuz as soon as you see a woman without her makeup it's \"oh God are you sick?\" and as soon as she does heavy makeup it's \"you don't need it; I like girls without makeup/who are more natural; I hate that shit on a woman\" and the majority of comments like that come from men",
                                    "score": 95,
                                    "author": "insanityoverhaul"
                                },
                                {
                                    "level": 3,
                                    "comment": "The men who claim they don't care and that they like the natural look are the same that see a woman without makeup for the first time and ask them if they're feeling sick.",
                                    "score": 60,
                                    "author": "girlywish"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": -93,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "*eternal eye roll*",
                                    "score": 37,
                                    "author": "themagichappensnow"
                                },
                                {
                                    "level": 3,
                                    "comment": "They sure are, glad we’re on the same page :)",
                                    "score": 9,
                                    "author": "justhereforthepuppos"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Lol dude she's fucking claymation.",
                    "score": 35,
                    "author": "Booshur"
                },
                {
                    "level": 1,
                    "comment": "That's next level",
                    "score": 13,
                    "author": "_jeremybearimy_"
                },
                {
                    "level": 1,
                    "comment": "Jesus. Regardless, no one fricking cares about that guys dumb ass opinions anyway.",
                    "score": 6,
                    "author": "DirtyDanil"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I had a man tell me that he likes that I don’t wear makeup because I am beautiful without it. I was wearing a full face of makeup. He refused to believe me when I told him I was wearing a ton of makeup. 🙄",
            "score": 254,
            "author": "chocolatebuckeye"
        },
        {
            "level": 0,
            "comment": "The post: here's a joke playing off the fact most men don't wear makeup and as a result some men will mistake certain looks for 'heavy makeup' or 'no makeup'\n\nThe men in the comments: wtf fuck you why do you hate us for being men",
            "score": 1207,
            "author": "roxadox",
            "replies": [
                {
                    "level": 1,
                    "comment": "Swear to god😂🤣",
                    "score": 411,
                    "author": "Natural-but-BEAT"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Jesus Christ, the #notallmen brigade has already invaded this post. Can’t you fools let us enjoy a silly meme without getting all butthurt over it?",
            "score": 1222,
            "author": "The_Late_Gatsby",
            "replies": [
                {
                    "level": 1,
                    "comment": "what’s wrong with tall men :(",
                    "score": 588,
                    "author": "tossmeinthetraaash"
                },
                {
                    "level": 1,
                    "comment": "Right like if all memes had to reflect reality perfectly we’d have like 3 memes",
                    "score": 145,
                    "author": "bassplaya13"
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": -30,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "See my comment underneath reindeerhotdog. It’s a media standard and that’s what should insult the fuck out of you.",
                            "score": 57,
                            "author": "The_Late_Gatsby",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Haha this is perfect! I have been accused of wearing 'heavy makeup' when I have a fairly bare face but have put lipstick on.",
            "score": 495,
            "author": "zoyathedestroyer",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Your natural makeup IS SO GOOD",
            "score": 86,
            "author": "stormybitch"
        },
        {
            "level": 0,
            "comment": "Please tell me how you so flawlessly cover your undereye creases!",
            "score": 205,
            "author": "NathansRattail",
            "replies": [
                {
                    "level": 1,
                    "comment": "I use 2 coats of full coverage concealer. Let the first layer dry completely, then add the 2nd. And don’t forget your setting powder and spray!",
                    "score": 220,
                    "author": "Natural-but-BEAT",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Possibily dumb question: do you do setting powder between the two layers or only after the second layer? I've never gotten the hang of setting powder- it always seems to set in the creases and make my under eyes look really wrinkled.",
                            "score": 56,
                            "author": "Bail-Me-Out",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You may not need it al at all, or need a lighter layer of it. Are you full on baking your under eye or just dusting a small amount of powder?",
                                    "score": 18,
                                    "author": "mAdm-OctUh"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Thank you!!",
                            "score": 6,
                            "author": "NathansRattail"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Oh this is golden, you put into photos what I've been saying for years!",
            "score": 465,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "This is so well done! Also...you have a beautiful face and look amazing in all four photos.",
            "score": 299,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes! And that contour in the 2nd one is on point.",
                    "score": 77,
                    "author": "BodybyPastry"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is so accurate!",
            "score": 505,
            "author": "mwf902507",
            "replies": []
        },
        {
            "level": 0,
            "comment": "My favorite part about this is that you have the same hair, expression, and lighting in every photo. It bothers me so much when there's a with/without comparison and more than the thing in question has changed.",
            "score": 152,
            "author": "IggySorcha"
        },
        {
            "level": 0,
            "comment": "1000%",
            "score": 54,
            "author": "internetsuperfan"
        },
        {
            "level": 0,
            "comment": "Thank you all so much, it’s posted on the internet, so I don’t mind if it’s shared. I do appreciate people who asked though! 😂❤️",
            "score": 214,
            "author": "Natural-but-BEAT"
        },
        {
            "level": 0,
            "comment": "Solution: normalize men wearing makeup so they know! \n\n(I'm a man and I low-key really want to use light amounts of makeup but feel like I get enough crap in my life to have the balls to do it.)",
            "score": 225,
            "author": "30phil1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Like honestly I always wonder why straight men don’t simply pop some concealer on sometimes lol",
                    "score": 187,
                    "author": "Natural-but-BEAT",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Bold of you to assume I'm straight. I'm trying to improve my chances with everyone! I'm a bisexual man with a plan!",
                            "score": 113,
                            "author": "30phil1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I didn’t assume you’re straight. I specified straight men because a lot of bi and gay men have no issue wearing makeup!",
                                    "score": 114,
                                    "author": "Natural-but-BEAT",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Nah I was just joking around. You're awesome.",
                                            "score": 62,
                                            "author": "30phil1"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Come out of quarantine looking \"slightly better.\" Nobody will be able to figure it out.\n\nAnd hi from another bi, but instead of plans, I just have chapstick.",
                    "score": 95,
                    "author": "itealaich"
                },
                {
                    "level": 1,
                    "comment": "I 100% am in support of any gender of any sexual orientation wearing makeup!❤️",
                    "score": 96,
                    "author": "Natural-but-BEAT"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So many hidden comments.. what in tarnation",
            "score": 95,
            "author": "CyonHal"
        },
        {
            "level": 0,
            "comment": "This is hilarious, you nailed it 👏🏻👏🏻",
            "score": 60,
            "author": "dianerml"
        },
        {
            "level": 0,
            "comment": "Even my mum is all like \"You look fine without makeup.\" when she hasn't seen me without any on in years.\n\nAin't nobody needs to know I got eye bags like Gollum and skin that shines like the sun.",
            "score": 87,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I love this! Would you mind if I post this on Instagram story?",
            "score": 83,
            "author": "Joce7",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for asking, post away",
                    "score": 67,
                    "author": "Natural-but-BEAT"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That nose contour is so good! On the upper right! I suck at contouring :(",
            "score": 37,
            "author": "ukulaylie"
        },
        {
            "level": 0,
            "comment": "I laughed.\n\nAny idea what insecure teenage boy subreddit/discord is brigading? This thread is bananas. So many goobers.",
            "score": 92,
            "author": "KD_Konkey_Dong"
        },
        {
            "level": 0,
            "comment": "Isn't that the truth!? It's like their makeup vision is dependent on the color range.",
            "score": 84,
            "author": "DrStinkbeard"
        },
        {
            "level": 0,
            "comment": "TRUTH",
            "score": 74,
            "author": "fetalpiggywent2lab"
        },
        {
            "level": 0,
            "comment": "You look gorgeous in every photo!",
            "score": 37,
            "author": "mschanandlerbong___",
            "replies": [
                {
                    "level": 1,
                    "comment": "I wanted to say this too!",
                    "score": 12,
                    "author": "bethybonbon"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ngl, you pull off the 80s look better than most!",
            "score": 71,
            "author": "BishonenPrincess"
        },
        {
            "level": 0,
            "comment": "Lord, your \"actually natural\" is faaaaar better than *my* \"actually natural\" haha. # jelly",
            "score": 102,
            "author": "pellmellmichelle"
        },
        {
            "level": 0,
            "comment": "Came from r/all say this is a good meme, compliment those nice earrings and leave\n\nEdit: the heck is going on with some of these comments... Complaining about this meme is like complaining about the \"girls bathroom boys bathroom\" template of r/memes. Some very petty thing to get mad about.",
            "score": 66,
            "author": "Random_Stealth_Ward"
        },
        {
            "level": 0,
            "comment": "Lmao at panel 1. It’s like the makeup gun.",
            "score": 72,
            "author": "dchaid",
            "replies": [
                {
                    "level": 1,
                    "comment": "🤣🤣🤣",
                    "score": 31,
                    "author": "Natural-but-BEAT"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 152,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ohhh that’s an emoji?! I always wondered what I needed to type to get that😂",
                    "score": 67,
                    "author": "Natural-but-BEAT",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah if your phone's emoji keyboard lets you search you can find it just with \"TM\"",
                            "score": 22,
                            "author": "insanityoverhaul"
                        },
                        {
                            "level": 2,
                            "comment": "There is a unicode ™, which is by definition supported on every device without issue.\n\nYou could copy that and set is as a text replacement when you type \"tm!\" or something.",
                            "score": 30,
                            "author": "JugglerNorbi",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh that's pretty smart",
                                    "score": 7,
                                    "author": "insanityoverhaul"
                                },
                                {
                                    "level": 3,
                                    "comment": "I do this! I have keyboard replacement “commands”. When I type /trademark, it turns into ™.",
                                    "score": 6,
                                    "author": "lilacpeaches"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ahhh yes, very graphic explanation for people with little to no knowledge on makeup artistry, this.is.what.was.needed!!!! Thank you for taking thd trouble to do this, it's really good and useful!\n\n I'm tempted to print it and carry it on my wallet for quick reference!!! Lol",
            "score": 46,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 98,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "The point is that they think poorly applied makeup always=a ton of makeup. Someone could be wearing a cakey foundation that leaves a mask ring around their face and lipstick. Many people who aren’t familiar with makeup will assume that that person is wearing a ton of makeup. Meanwhile number 3 on this list is a literal face full of makeup that people who aren’t familiar with makeup, wouldn’t blink an eye at",
                    "score": 527,
                    "author": "Natural-but-BEAT",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": -129,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 73,
                                    "author": "[deleted]",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": -64,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "bruh do other men not hang around when their gfs are doing makeup?  lol",
            "score": 35,
            "author": "nightdrive82"
        },
        {
            "level": 0,
            "comment": "I love these",
            "score": 13,
            "author": "Catsblahblahblah"
        },
        {
            "level": 0,
            "comment": "I think I learned something new today, thank you.",
            "score": 38,
            "author": "Cake_Adventures"
        },
        {
            "level": 0,
            "comment": "As a guy this was a very important lesson to learn.",
            "score": 47,
            "author": "DrDudeatude"
        },
        {
            "level": 0,
            "comment": "Congrats on hitting the front page - nice meme.  I was in my 20s when I realised women wear make-up for themselves, not for men, and can and should wear it however the hell they like.  \nWhether it's as an avenue to express yourself, or to feel more secure, or just to feel good, I think it's awesome.\n\nA lot of us, as a jaunt through this comments will reveal, are still immature or ignorant about a thing roughly half the population do, and stuff like this and discussions around it can change people's perceptions. I'm also curious, if #3 could \"pass\" as a natural face to other women/make-up wearing men?  Other than maybe the eyebrows and lashes, I don't think I could tell there's make-up.",
            "score": 74,
            "author": "Chebbio"
        },
        {
            "level": 0,
            "comment": "That contour on your top right pic is stunning",
            "score": 25,
            "author": "Restonlady"
        },
        {
            "level": 0,
            "comment": "How do you get your under eyes to not look hollow? I use a Nyx concealer and it kind of does the job, but it’s still visible, and setting it with powder makes me look cakey 😩",
            "score": 26,
            "author": "nadia102"
        },
        {
            "level": 0,
            "comment": "Love this hahah",
            "score": 16,
            "author": "awww_shit45"
        },
        {
            "level": 0,
            "comment": "Oh wow, this is you OP? I absolutely love this!\n\n\nBtw....what lashes are you using in the lower left photo?",
            "score": 16,
            "author": "spiced_latte",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sorry they are ardell twin pack wispies in black",
                    "score": 14,
                    "author": "Natural-but-BEAT",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh ok thanks!\n\n\nI had those (switched to 110 black), you definitely pull them WAYYYYY better than I do.",
                            "score": 2,
                            "author": "spiced_latte"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "So accurate!!",
            "score": 15,
            "author": "dee62383"
        },
        {
            "level": 0,
            "comment": "You’re so beautiful and this is so spot on!",
            "score": 14,
            "author": "smamicorn"
        },
        {
            "level": 0,
            "comment": "Love this!",
            "score": 6,
            "author": "Asmatarar"
        },
        {
            "level": 0,
            "comment": "This is so well done, thank you.",
            "score": 13,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I tried to start wearing makeup my second year of college to cover blemishes and such. But as soon as you stop people ask if something is wrong. I didn't think makeup should speak so loudly for me so I stopped all together and I have horrible acne lol.",
            "score": 33,
            "author": "onatureal"
        },
        {
            "level": 0,
            "comment": "Accurate and also you have such beautiful eyes and lovely skin! So pretty :)",
            "score": 9,
            "author": "Salt-Soaked"
        },
        {
            "level": 0,
            "comment": "I think you’re somehow rocking the “what men think is heavy makeup” and I want to know what you used to blend under your eyes for “what men think is natural”.",
            "score": 14,
            "author": "AdelineRose-"
        },
        {
            "level": 0,
            "comment": "okay but aside from the obvious you are drop dead GORGEOUS in all FOUR photos, what lashes are you wearing in the heavy makeup photo? zooming in i am just STUNNED!",
            "score": 11,
            "author": "hgielatan"
        },
        {
            "level": 0,
            "comment": "Damn that's accurate.",
            "score": 18,
            "author": "frugal_masturbater"
        },
        {
            "level": 0,
            "comment": "Hahahaha this is perfect! I love your \"natural look\"!",
            "score": 10,
            "author": "Hannah_and_peonies"
        },
        {
            "level": 0,
            "comment": "So beautiful! I would love to know about your process for that amazing cut crease in the top right photo! I wish I could make my eyes pop like that 😍",
            "score": 8,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "This is accurate",
            "score": 11,
            "author": "vince2td"
        },
        {
            "level": 0,
            "comment": "All of em beautiful",
            "score": 17,
            "author": "TheOrkin"
        },
        {
            "level": 0,
            "comment": "I LOVE THISSSS",
            "score": 9,
            "author": "rollinavi"
        },
        {
            "level": 0,
            "comment": "She has very nice skin",
            "score": 11,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "So true!! I love it great job!!",
            "score": 7,
            "author": "Panache-Palette"
        },
        {
            "level": 0,
            "comment": "Absolutely beautiful!",
            "score": 5,
            "author": "TinHawk"
        },
        {
            "level": 0,
            "comment": "As a man who doesnt know the first thing about makeup, what would be the proper term for bottom left?",
            "score": 23,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Everyday make-up",
                    "score": 60,
                    "author": "alltheyarnthings"
                },
                {
                    "level": 1,
                    "comment": "Most people refer to it as a “no makeup” makeup look or a more natural beauty look. Basically you’re adding a minimal amount of makeup to bring out the natural features of your face. Hope I explained that well enough!",
                    "score": 46,
                    "author": "AReallyNiceLeafPile",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 61,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah that’s my mistake, usually when I or my friends do no makeup makeup looks we include small falsies so that’s why I called it that. My bad lol I’m still trying to learn the terminology :)",
                                    "score": 15,
                                    "author": "AReallyNiceLeafPile"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "And all are amazing",
            "score": 6,
            "author": "holyspiderman1"
        },
        {
            "level": 0,
            "comment": "Ok your eyeshadow on number 2 is on point I’m in awe lol",
            "score": 8,
            "author": "sujugraffiti1"
        },
        {
            "level": 0,
            "comment": "You look great in all of them! And yes you're pretty spot on about the judgements lol.",
            "score": 8,
            "author": "dyvrom"
        },
        {
            "level": 0,
            "comment": "This is the bestest most bestest and I’m saving this. Also, your makeup skills are on point, and you’re just beautiful. Doesn’t hurt that you’re funny as well.",
            "score": 9,
            "author": "HopterChopter"
        },
        {
            "level": 0,
            "comment": "I love your hair !!",
            "score": 10,
            "author": "liz2e"
        },
        {
            "level": 0,
            "comment": "Honest question, what's it actually called when you do your makeup like the lower left box?",
            "score": 9,
            "author": "Crusty_Vato"
        },
        {
            "level": 0,
            "comment": "What would you call what men think is natural?",
            "score": 24,
            "author": "YoloMcSweggins",
            "replies": [
                {
                    "level": 1,
                    "comment": "A full face of neutral toned makeup",
                    "score": 96,
                    "author": "Mindelan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh ok neutral toned that makes sense I dont know much about makeup thanks",
                            "score": 41,
                            "author": "YoloMcSweggins",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, she's wearing just as much as many full face 'glam' looks, but many guys don't know it's a *lot* of makeup simply because it's in natural colors. Many guys just think obvious lipstick+eyeshadow=heavy makeup",
                                    "score": 52,
                                    "author": "Mindelan"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You’re gorgeous!!",
            "score": 7,
            "author": "beachbaby413"
        },
        {
            "level": 0,
            "comment": "I like the actually natural you, you’re beautiful! And very good at makeup",
            "score": 13,
            "author": "MissHillary"
        },
        {
            "level": 0,
            "comment": "Ummm 🔥🔥🔥",
            "score": 8,
            "author": "Ahfekz"
        },
        {
            "level": 0,
            "comment": "😂 hehehe love it!",
            "score": 4,
            "author": "cottonpuff_"
        },
        {
            "level": 0,
            "comment": "Hahaha love it!",
            "score": 4,
            "author": "bikewander"
        },
        {
            "level": 0,
            "comment": "I love this so much. You look so good!",
            "score": 4,
            "author": "rosesonthefloor"
        },
        {
            "level": 0,
            "comment": "This is great! I want to make one.",
            "score": 3,
            "author": "cwjadalark"
        },
        {
            "level": 0,
            "comment": "Love this!",
            "score": 4,
            "author": "snickertink"
        },
        {
            "level": 0,
            "comment": "This is spot-on! I love it!!",
            "score": 4,
            "author": "pepperedpaprika"
        },
        {
            "level": 0,
            "comment": "I LOVE this. It really captures the differences",
            "score": 5,
            "author": "tritonbio2"
        },
        {
            "level": 0,
            "comment": "Love this",
            "score": 4,
            "author": "kimliptiredmom"
        },
        {
            "level": 0,
            "comment": "Too true!",
            "score": 3,
            "author": "whittykitty31"
        },
        {
            "level": 0,
            "comment": "LOVE the layered meanings of your username, especially with this post. Great work.",
            "score": 3,
            "author": "knottedscope"
        },
        {
            "level": 0,
            "comment": "Yes. Yes. Yes!!!!!",
            "score": 4,
            "author": "Tossit4223"
        },
        {
            "level": 0,
            "comment": "You are perfect.",
            "score": 4,
            "author": "madlipps"
        },
        {
            "level": 0,
            "comment": "***Thank you for contributing to MUA! If this is your first post, please be sure to check out our rules in the subreddit sidebar. If you are on mobile, they can be viewed by tapping the*** ⓘ ***symbol***\n\n**A few quick highlights:**\n\n• If you are posting a look, haul, or flatlay, please be sure to include a [product list, complete with shade names within 20 minutes of posting.](https://www.reddit.com/r/MakeupAddiction/wiki/productlist)\n\n• Also, please ensure your pictures are not [edited or filtered. This includes automatic beauty modes found on many phones and newer cameras.](https://www.reddit.com/r/MakeupAddiction/wiki/photoediting)\n\n• Lastly, our [Helpful Guides for Navigating MUA](https://www.reddit.com/r/MakeupAddiction/wiki/helpfulguides) in the sidebar explains some of the basics of the community as well as commonly misinterpreted rules.\n\n**Is your post just a search away?**\n\nBefore you make a post, search with Reddit's search feature or use this handy [customised Google search.](https://cse.google.com/cse?cx=008480394191906358284:aflieg73nqm)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MakeupAddiction) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator",
            "replies": [
                {
                    "level": 1,
                    "comment": "Product list Primer-elf poreless putty primer Color corrector-la girl pro orange\n\nBrows-NYX brow gel in espresso Concealer to clean up-la girl pro concealer in fawn Eyeshadow base-blank canvas Eyeshadow- Huda beauty obsessions palette in warm brown and I used the black from the Smokey palette \nBlue shadow from Glamour palette by Arri and co\nEyeliner-kiss lash glue liner Eyelashes-an Amazon brand\n\nFoundation-maybelline fit me matte and poreless in shade 365 Highlighting concealer-elf 16hr camo concealer in deep cinnamon Bronzer-black radiance dark to deep contour palette Blush-Saharan blush volume 1 palette (orange) Highlighter-gold from the Saharan blush palette\n\nSetting powder-morphe (banana rich) Setting spray-maybelline lasting fix\n\nLipstick-Milani matte lip crayon in shade “off the wall”\nBright red lipstick is Fenty beauty stunna red lip paint",
                    "score": 20,
                    "author": "Natural-but-BEAT"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Your poor skin! 3 beats in one day? I have done this before and my eyelids were screaming at me afterwards!",
            "score": -44,
            "author": "LoseSmallMind"
        },
        {
            "level": 0,
            "comment": "Forgot red spots of blush cheeks for top left.",
            "score": -55,
            "author": "Beejsbj"
        },
        {
            "level": 0,
            "comment": "All 4 pics beautiful in their own way. Lower left most attractive to me personally but definitely illustrates the point well.",
            "score": -114,
            "author": "SouthQuackalacky"
        },
        {
            "level": 0,
            "comment": "Is it weird idc if women wear makeup? Like I’m not gonna say don’t do it or do it. My wife looks wayyy more beautiful without it, but if she wants to feel beautiful to wear it that’s her choice. I think she looks beautiful either way.",
            "score": -142,
            "author": "Joecus90",
            "replies": [
                {
                    "level": 1,
                    "comment": "no, it's not weird. that's how everyone should be ❤",
                    "score": -98,
                    "author": "vincentvanghosts"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I like the natural 😊",
            "score": -121,
            "author": "Conlink"
        },
        {
            "level": 0,
            "comment": "You are just awesome without makeup",
            "score": -108,
            "author": "ishkvr"
        },
        {
            "level": 0,
            "comment": "A lot of women look great with no makeup whatsover.",
            "score": -127,
            "author": "Abductee666"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -8,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -7,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -25,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "also if you don't care about makeup, don't come to our makeup subreddit 😊😊😊😊",
                    "score": 86,
                    "author": "vincentvanghosts"
                },
                {
                    "level": 1,
                    "comment": "stop telling us what we do and don't experience as women if you're not a woman then 😊",
                    "score": 78,
                    "author": "vincentvanghosts"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hah men so dumb",
            "score": -83,
            "author": "Mikerinokappachino"
        },
        {
            "level": 0,
            "comment": "Top 2 are both pretty heavy.",
            "score": -101,
            "author": "MungTao"
        },
        {
            "level": 0,
            "comment": "So what is #1?",
            "score": -76,
            "author": "neesters",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well applied version of middle school/first make-up lewks. We don't talk about those dark times.",
                    "score": 98,
                    "author": "[deleted]"
                }
            ]
        }
    ]
}