{
    "id": "12ysrwl",
    "score": 1,
    "title": "Are there any Digital Audience alumni here? I cant find anyone who has taken MCO 439, and that’s freaking me out. Is it that bad?",
    "author": "StuffedCrustWhore",
    "date": 1682449774.0,
    "url": "https://www.reddit.com/r/ASU/comments/12ysrwl",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Hey there! I took MCO 439 last fall and it was one of my favorite classes in the Digital Audiences program. It's a challenging course but I learned a ton. You get assigned an actual, real-life client and develop strategic recommendations to improve their digital channels. The content the class creates is actually used by the client, so it's super interesting to see what performs well, what doesn't, etc. \n\nThe course builds on the previous classes for the major, with a focus on SEO, paid search, organic social, and paid social. The professor interfaces with the client directly, so you're not responsible for that part. Professor Mays is great. In addition to all of the digital expertise she brings to the class, she's very caring/supportive. She hold office hours weekly, which I recommend taking advantage of. Even when I didn't have a question, hearing my classmates questions often sparked ideas. \n\nIn order to do well in the class, you need to spend time researching the client, studying their social content, analyzing their Google Analytics, etc. All of the recommendations you provide need to be backed up with actual numeric data points, so the research/analysis you do is critical. There's a solid amount of work, so it's important to get ahead when you can and not put anything off until the last minute. Understanding how to navigate Google Analytics and Meta/Facebook Ad Manager is also important. As soon as you have access to the client's accounts, you should definitely start exploring to get comfortable. \n\nLet me know if you have any follow-up questions!",
            "score": 1,
            "author": "exciting_and_awful",
            "replies": [
                {
                    "level": 1,
                    "comment": "Was there anything specific you could recommend for brushing up on those skills? Idk if it’s imposter syndrome or if I really am just coasting by by sheer luck and hitting due dates, I feel like I don’t know anything at all",
                    "score": 2,
                    "author": "StuffedCrustWhore"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm planning to go into this too.  Hope it's not TOO challenging.  Working full time.",
            "score": 1,
            "author": "Limp_Damage4535"
        }
    ]
}