{
    "id": "12z1q2k",
    "score": 1,
    "title": "How hard is it to get non local internships for business majors?",
    "author": "Alternative-Ease-377",
    "date": 1682470584.0,
    "url": "https://www.reddit.com/r/ASU/comments/12z1q2k",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am majoring in business data analytics and I want to get internships in the summer but hopefully not in the phoenix area to avoid the heat. I live in the Bay Area so for example, how hard would it be to get an internship there?",
    "comments": [
        {
            "level": 0,
            "comment": "Put in the work and you can get internships where you want. Join student business associations, go to meetings, and attend their conventions with career fairs. I'm in engineering not business but networking always goes a long way. Oftentimes student associations will invite companies to meetings and they'll announce internship positions available. If you want specific areas, look at companies/firms that have regional offices/headquarters in that area. Also get your resume reviewed, companies may also have mock interviews and resume workshops at these student meetings. They do this with engineering clubs all the time so it would really surprise me if business clubs don't get a similar experience.",
            "score": 5,
            "author": "robertxcii"
        },
        {
            "level": 0,
            "comment": "im not a buisness major, im cs, so idk if buisness hiring is as bad as tech rn, but I think at this point if you haven't been applying to every internship you see on linkedin since last august, your chances of getting an internship this close to summer is slim to none.",
            "score": 2,
            "author": "toomuchcoffeenosleep"
        },
        {
            "level": 0,
            "comment": "I’m a CS major (live in Phoenix year-round). I’ve had a hard time getting out of state internships (most companies don’t want to pay relocation, transportation, etc). I did sign an offer for this summer though none of the expenses are paid. I think in your situation if you are local to the Bay Area and housing/commuting isn’t a problem you may have a good chance",
            "score": 1,
            "author": "CodingDrive"
        }
    ]
}