{
    "id": "1303nqr",
    "score": 4,
    "title": "Compassionate Withdrawal - How long does it take for courses to be removed from MyASU",
    "author": "penned_anonymous",
    "date": 1682552894.0,
    "url": "https://www.reddit.com/r/ASU/comments/1303nqr",
    "media_urls": [],
    "other_urls": [],
    "postText": "I applied for and was approved for a compassionate withdrawal for two of my session B courses. I first applied last week and was given the approval today that I will be withdrawn from those two courses. I was just wondering if anyone has any insight on how long it takes for the classes to be removed from your Canvas/ show up as withdrawn on your My ASU",
    "comments": [
        {
            "level": 0,
            "comment": "I think for me it took less than two weeks but as it is the end of the semester, could take more time but the courses don’t necessarily get removed, they turn into withdrawals (W) which can count against your satisfactory academic progress if you’re using financial aid",
            "score": 4,
            "author": "babystarlette",
            "replies": [
                {
                    "level": 1,
                    "comment": "Did you just get your final grade for the course and then they retroactively changed it to a W after the fact?",
                    "score": 1,
                    "author": "penned_anonymous",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That I would not know as my grades had been posted by 2 years by that point I did a medical withdrawal. I would assume you would get the W if they can process it in time but if not, then the grade will be posted first most likely until whatever volume of requests the school is dealing with can go back and reverse it.",
                            "score": 1,
                            "author": "babystarlette"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Email the office that handles that and they can answer your question more effectively than us on Reddit. There may be some people who have had compassionate withdrawals in the past but aren’t crazy active on this Reddit page. Otherwise I hope someone gives you an effective answer.",
            "score": 3,
            "author": "cpetit1105"
        },
        {
            "level": 0,
            "comment": "I’ve seen it happen in as little as a couple days. Sometimes it can take about a week or two. Just depends on how long it takes to work through the people who process it.",
            "score": 1,
            "author": "persephone_24"
        }
    ]
}