{
    "id": "130fbdi",
    "score": 0,
    "title": "Make me love ASU",
    "author": "Old-Reward6149",
    "date": 1682587767.0,
    "url": "https://www.reddit.com/r/ASU/comments/130fbdi",
    "media_urls": [],
    "other_urls": [],
    "postText": "I have two colleges in my mind that I would love to attend ASU-Tempe and PSU-University Park. But, for some reason, there's a lot of negativity about ASU in my mind resulting in me into lean toward attending PSU. I’ve received scholarships at ASU reducing my EFC by 40k. \n\nAlso, I am majoring in CS and would minor in business/philosophy/psychology. Can y'all please tell me about your experiences and why should I pick ASU. \n\nAnd, please tell me about internships, job opportunities, on-campus jobs, undergraduate teaching, etc.",
    "comments": [
        {
            "level": 0,
            "comment": "well, what’s the negativity you associate with ASU?",
            "score": 18,
            "author": "RightRespect"
        },
        {
            "level": 0,
            "comment": "\\#NumberOneInInnovation #LustforASU 🤣\n\nOn serious note though, it is a good university for CS majors favoring research and jobs but not a great one for classroom experience",
            "score": 14,
            "author": "CrastersSafe"
        },
        {
            "level": 0,
            "comment": "Only you can make you love ASU",
            "score": 10,
            "author": "yerdad99"
        },
        {
            "level": 0,
            "comment": "Im OOS for both schools and just chose ASU over PSU, Pitt, Ohio State, Maryland and many others. Came down to merit and honors college as well as the program (WP Carey). ASU accepted every DE and AP credit I have. Orientation went great. Got every class/ professor I wanted and both my program advisor and honors advisor were very helpful. I liked PSU but no merit for OOS tuition was the dealbreaker.",
            "score": 8,
            "author": "HopeMel"
        },
        {
            "level": 0,
            "comment": "What’s the cost difference?\n\nDo you care about the weather difference?\n\nSome people say they feel Penn State is too rural 🤔 how do you feel about that?\n\nWho has the better CS program?",
            "score": 7,
            "author": "throwawaygremlins"
        },
        {
            "level": 0,
            "comment": "Every time someone on this subreddit asks if they should come to ASU everyone says no. The reason is ASU is over populated both in class sizes and available housing. So no, don’t come to ASU, we have too many people as is",
            "score": 11,
            "author": "shid3ater"
        },
        {
            "level": 0,
            "comment": "What negativity is in your mind?",
            "score": 3,
            "author": "ScumDogPope"
        },
        {
            "level": 0,
            "comment": "You probably wouldn’t like it.  Better go with the other one.",
            "score": 14,
            "author": "cadred000",
            "replies": [
                {
                    "level": 1,
                    "comment": "why?",
                    "score": -7,
                    "author": "Old-Reward6149"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Here’s something you may not consider: Tempe is in the heart of a very bustling and thriving city/valley. We have an international airport 10 minutes away from campus. Penn state isn’t anywhere near an actual city, and is almost 2 hours away from the nearest airport. Also, tf is there to do around University Park, PA as opposed to A R I Z O N A",
            "score": 3,
            "author": "cavalos32"
        },
        {
            "level": 0,
            "comment": "If you want the more traditional college experience and town feel then you’ll probably be disappointed with ASU. Don’t get me wrong, ASU has some great opportunities especially for STEM since they’ve put so much money towards that over the past decade(s) to try and get rid of the “party school” nameplate; but, it also can feel more like a business than a university imo.",
            "score": 4,
            "author": "69dildoswaggins420",
            "replies": [
                {
                    "level": 1,
                    "comment": "All universities are businesses",
                    "score": 8,
                    "author": "kendrach",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "True, I just feel that Tempe lacks the coziness of a smaller college town (well, cause it isn’t)",
                            "score": 2,
                            "author": "69dildoswaggins420",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Opinion wanted: I’m local so I laugh when I see others describe ASU Tempe as an “urban campus.”  To me that’s a place like UPenn (integrated with Philly) or the Boston/Cambridge schools.  I consider ASU a suburban campus. Maybe I’m wrong here tho? 🤔",
                                    "score": 7,
                                    "author": "throwawaygremlins",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah definitely suburban more than urban. Campus itself is nice but the surrounding area is suburban sprawl af",
                                            "score": 1,
                                            "author": "69dildoswaggins420"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Have you checked out the Polytechnic Campus?",
                                    "score": 1,
                                    "author": "kendrach",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "On a tour before I attended yea, I didn’t have any classes there tho",
                                            "score": 1,
                                            "author": "69dildoswaggins420"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Go to PSU. I regret going here all the time.",
            "score": -1,
            "author": "Weird_Pirate"
        },
        {
            "level": 0,
            "comment": "They just raised our tuition 3-4% as they do almost every year. So there’s that. ASU = profit over student experience, always.",
            "score": 0,
            "author": "Slight-Revenue-5036",
            "replies": [
                {
                    "level": 1,
                    "comment": "Eh, most other schools do this too. I just saw another school said they’ll be raising tuition 7% each year 😳💀 that’s just business.",
                    "score": 10,
                    "author": "throwawaygremlins"
                }
            ]
        }
    ]
}