{
    "id": "132comz",
    "score": 15,
    "title": "Which rooms are A1 and A2 at Cereus Hall? It doesn’t say and I’m pretty confused",
    "author": "goofyahredditor",
    "date": 1682723286.0,
    "url": "https://www.reddit.com/r/ASU/comments/132comz",
    "media_urls": [
        "https://i.redd.it/7onsguj90rwa1.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Each “half” prolly has its own room number yeah? The rooms were kinda similar in tooker and the window bed was A2 but idk if it matches",
            "score": 14,
            "author": "rysmorgan",
            "replies": [
                {
                    "level": 1,
                    "comment": "I ended up calling housing and they confirmed that!! that you so much",
                    "score": 5,
                    "author": "goofyahredditor"
                }
            ]
        },
        {
            "level": 0,
            "comment": "For the quad dorms the beds are A1, B1, C1, D1, so i would expect A1 and A2 are two beds in the same room. A was usually on the left once you walk in, so I’d assume both beds are on the left.",
            "score": 6,
            "author": "Ace_of_Snass"
        },
        {
            "level": 0,
            "comment": "I don't think it's very clear. My roommate and I just agreed on one side or another.",
            "score": 3,
            "author": "Realistic-Set-7937",
            "replies": [
                {
                    "level": 1,
                    "comment": "Just a note, when damage charges are assessed at the end of the year, or if alcohol or other prohibited items are found during the winter break room inspections, the fines will be assessed based on who is assigned which bed. So if roommates do agree to switch, it's probably a good idea to email housing and ask if it's possible to note it officially on the contract/assignment. You never know what might happen during the year and whether the other roommate will always be as accommodating, honest, or protective as they agree to be at the beginning of the year.",
                    "score": 5,
                    "author": "HandsNeverEmpty"
                }
            ]
        },
        {
            "level": 0,
            "comment": "A2 is the bed by the window. A1 is by the door. In this image of a shared room/shared bath at BRC (Barrett Residential Complex), there are two room numbers, each with their own entry door off of the hallway. Inside each room the beds are A1 and A2.\n\nI am a parent with a student in Cereus this year. LMK if you have other questions.",
            "score": 3,
            "author": "HandsNeverEmpty"
        },
        {
            "level": 0,
            "comment": "They always basically go in order as if you're reading left to right. I think for the four person it starts with the lower left hand room.",
            "score": 1,
            "author": "yelloworgold"
        }
    ]
}