{
    "id": "1333p54",
    "score": 14,
    "title": "Handicap Accessible Apartments Around Tempe campus?",
    "author": "Significant_Ask_7437",
    "date": 1682794564.0,
    "url": "https://www.reddit.com/r/ASU/comments/1333p54",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Majority of these apartments should be accessible. However, when I lived at The Union, my cousin in a wheelchair was able to get around just fine. Doors would open on their own, elevator to all floors, including the parking lot. \n\nHallways were wide enough for him and so were the apartment doors. The showered are just showers, no tubs so very easy for him to get into.\n\nThe open concept of the whole place really helped him get around!",
            "score": 13,
            "author": "amourxloves",
            "replies": [
                {
                    "level": 1,
                    "comment": "I know for a fact that the apartment Atmosphere isn't handicap accessible they don't have a single automatic door in the building. I brought it up to the people there, and they straight up said it isn't our problem. Those people made me sick.",
                    "score": 3,
                    "author": "Significant_Ask_7437",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think Tempe's is having some ridiculous structural problems. They seem to not want to enforce building codes, nor do the bare minimum to make their traffic lights safer (with leading pedestrian signals).\n\nAlso I don't think I've seen a single person in city hall. Ever.",
                            "score": 3,
                            "author": "BenjiStokman"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "San Palmilla, although their management is shitty, and lots of roaches, and old, and their gates never close, and no enough covered parking, and expensive. \n\nTheir bathroom has lower sink, lower &amp; wider toilet. I'm not sure if it's a standard setting and I don't really recommend living there (had very bad interaction with the management), just FYI.",
            "score": 2,
            "author": "AncomDuck"
        },
        {
            "level": 0,
            "comment": "Alight Tempe",
            "score": 0,
            "author": "Additional_Sky1507",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don’t exactly second this (none of the exterior doors have auto openers) but it is fairly decent compared to older building. \n\nThough make sure your lease has some clause about elevators and what happens when one is down.",
                    "score": 2,
                    "author": "gutz00"
                }
            ]
        }
    ]
}