{
    "id": "13c8wbq",
    "score": 2,
    "title": "Bachelors degree posting status",
    "author": "JamesBummed",
    "date": 1683589316.0,
    "url": "https://www.reddit.com/r/ASU/comments/13c8wbq",
    "media_urls": [],
    "other_urls": [],
    "postText": "I applied for graduation but didn't attend any ceremonies. On MyASU my graduation application still says \"Applied\". Have they been updated for any of you? Just curious, as I need my bachelors degree status to enroll in graduate courses.",
    "comments": [
        {
            "level": 0,
            "comment": "Final grades are due today. Then the next couple of days are end of term processing. \n\nThey will likely start posting degrees next week. The best thing you can do is run your DARS and make sure everything is still green after end of term processing. \n\nKnow that as far as the diploma, it can take about 6 weeks for you to receive. Make sure your mailing address is up to date on MyASU.",
            "score": 4,
            "author": "persephone_24",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for the reply. I obsessively checked with my advisor to see if I'm meeting graduation requirements so I should be good.",
                    "score": 2,
                    "author": "JamesBummed"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It will never change from Applied. As long as your DARS is satisfied and all your grades get posted you'll get your degree in the mail in about late June/early July. Once your grades are posted your transcript will show you earned your bachelor's and you'll also get an email regarding purchasing an e-diploma for like $5 which is just a protected PDF file. You can use your official transcript to show you've earned your degree if you're enrolled in another graduate institution.",
            "score": 2,
            "author": "robertxcii",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you!",
                    "score": 1,
                    "author": "JamesBummed"
                }
            ]
        }
    ]
}