{
    "id": "13d1iiq",
    "score": 6,
    "title": "can I just add a random class to my schedule?",
    "author": "Lyaeth",
    "date": 1683656398.0,
    "url": "https://www.reddit.com/r/ASU/comments/13d1iiq",
    "media_urls": [],
    "other_urls": [],
    "postText": "I want to add MUS 146 to my schedule so that way I can have access to the practice rooms and sing to my hearts content without annoying dorm mates. Could I just add it without speaking to an academic advisor? Esp as someone who is going into my 1st year here this upcoming fall? I already do have a pretty loaded plate with my Finance major and the fact I have The Human Event on top of everything. Can I add this class? And if I can, would it be way too much work to do 22 credit hours my freshmen year?",
    "comments": [
        {
            "level": 0,
            "comment": "It’s first semester, try to ease into it. \n\nBut yes you can add whatever classes you want, you may need approval for over 18 hours however, especially as a freshmen.",
            "score": 14,
            "author": "xhaydnx",
            "replies": [
                {
                    "level": 1,
                    "comment": "You will need an overload no matter what year you are in at asu to take over 18 credit hours during any semester.",
                    "score": 3,
                    "author": "Callof4632",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I more meant it as like they would be less likely to give to a first semester freshmen .",
                            "score": 2,
                            "author": "xhaydnx"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You won’t be able to take more than 18 credits as a first year student. And the Human Event is not “on top of everything” - it’s counting for your  Humanities requirement, which you would need two classes for no matter your Barrett status. \n\nAs a first semester business student, you should be in 16 to 18 credits, depending on what math you take and if you are trying to knock out a science with lab instead of another course.",
            "score": 5,
            "author": "persephone_24",
            "replies": [
                {
                    "level": 1,
                    "comment": "First year I got a credit approval to 19 after my first sem",
                    "score": 1,
                    "author": "AZCARDINALS21",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How do you apply to take an extra credit, I am taking a lab and was wanting to add one more class to the semester",
                            "score": 1,
                            "author": "coffee_now_plz_asap",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It’s in your my asu",
                                    "score": 1,
                                    "author": "AZCARDINALS21"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I am currently enrolled in 2 humanity courses then. Should I only have one?",
                    "score": 1,
                    "author": "Lyaeth",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What is the other Humanities course you have?",
                            "score": 1,
                            "author": "persephone_24",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Lost tribes and buried cities. It is the humanities course I was allowed to select myself",
                                    "score": 1,
                                    "author": "Lyaeth",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Gotcha. So that counts for HU or SB, as well as G and H. \n\nWith the Human Event sequence, you’ll have the 6 credits of lower division HU covered as well as H. \n\nAs a business major, you are required to take an international business course later on, around junior year. That will cover the G. \n\nWhat won’t be covered in your major is C, so I would look for a Cultural course instead if you don’t already have credit for one. Or if you don’t have the two science courses complete, you could find a course for that. Just make sure that the lab is included on your schedule. \n\nAs you make these changes, be sure to check in with your academic advisor to have another set of eyes checking your selected classes.",
                                            "score": 1,
                                            "author": "persephone_24"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "That's a waste of time and you don't need it. Human Event 1 &amp; 2 cover both lower HU requirements. ENG302 and WPC480 cover the L requirements. Psy &amp; Soc cover the lower SB requirements. That leaves one upper HU or SB. SOC352 is a good option for that, but there's a lot of interesting classes out there too to choose from. REL320 is a nice option for WPC majors for the C class and is also an Upper HU. Take the SQ classes on Universal Learner unless you like science.",
                                            "score": 1,
                                            "author": "Traveller1323"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is going to sound pompous, but I don't mean to. Are all \"in person\" courses the full 16ish weeks? OP states that they are taking 22 credits, yet I'm taking 36 online and active duty this year. I'm genuinely curious because I was convinced that one could get a degree faster in person",
            "score": 1,
            "author": "That_Guy_Red",
            "replies": [
                {
                    "level": 1,
                    "comment": "….what? Full time is 12+ 36 credit hours would be like 12 classes? Most people take 4-6",
                    "score": 1,
                    "author": "Cucumber_Altruistic",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He said 22 credits for the year was a lot. I'm taking 36 credits this year. I thought in person students take more than 4 per semester. So that's why I asked if in person does A/B sessions or are they always full semester length classes.",
                            "score": 1,
                            "author": "That_Guy_Red",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh for the year ?? I see",
                                    "score": 1,
                                    "author": "Cucumber_Altruistic",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I may have phrased it wrong, that's on me.",
                                            "score": 1,
                                            "author": "That_Guy_Red",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It’s all gravy",
                                                    "score": 2,
                                                    "author": "Cucumber_Altruistic"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "He asked if taking 22-hours \"in my Freshman year\" was too much. I'm taking that to mean, would taking a 22 credit semester be too much as a Freshman. You are allowed to take 18.25 credits without an override. Up to 27 credits with one.",
                    "score": 1,
                    "author": "Traveller1323",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Gotcha. Thank you!",
                            "score": 1,
                            "author": "That_Guy_Red"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You must be pretty loaded to be able to spend an additional $561-$1343/credit hour just to utilize a room.",
            "score": 1,
            "author": "TheAvocadoSlayer",
            "replies": [
                {
                    "level": 1,
                    "comment": "haha efc of 0 and lots of debt!",
                    "score": 1,
                    "author": "Lyaeth"
                },
                {
                    "level": 1,
                    "comment": "Tuition caps at 12-credit hours. You can take as many more credits as they will allow for $0 more. Many people take 20+ credits. I know one that's at 27. It doesn't cost any more.",
                    "score": 1,
                    "author": "Traveller1323",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Got it. \n\nSo is the Undergraduate Excess Hours Tuition Surcharge not a thing anymore?",
                            "score": 1,
                            "author": "TheAvocadoSlayer"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You could take Barrett Choir. It's for non-music majors. You can get up to 4 upper division Honors credits taking it. WPC will not allow a Freshman to take more than 19 credits. Once you've taken some classes, they will allow you to increase 3-credits per semester. However yes, 22 credits is too much while you are also acclimating to a new living situation and environment.",
            "score": 1,
            "author": "Traveller1323"
        }
    ]
}