{
    "id": "13edng4",
    "score": 97,
    "title": "lord help me i am driving 2000 miles across the hottest states in america (south FL to phoenix) in the middle of august with a 1995 f-150 that has poor AC just to go to yalls school",
    "author": "soooshimix_X",
    "date": 1683781688.0,
    "url": "https://www.reddit.com/r/ASU/comments/13edng4",
    "media_urls": [],
    "other_urls": [],
    "postText": "to add a cherry on top ill be car camping because i am not old enough to rent a hotel room",
    "comments": [
        {
            "level": 0,
            "comment": "You've got a couple months to get your ac working right.\n Recharge it or fix the leak. Phoenix is a rough place to live without ac",
            "score": 124,
            "author": "OneHumanSoul",
            "replies": [
                {
                    "level": 1,
                    "comment": "yuuuuup my AC finna be good by then but the main issue is that im not old enough to rent a hotel room so ill be car camping in the 110 degree summertime desert💀",
                    "score": 18,
                    "author": "soooshimix_X",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How about Airbnb? Not sure if those are the same restrictions",
                            "score": 13,
                            "author": "jk021",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "hmm, i could def try! game plan was to drive far enough from the city n find a motel rundown enough to simply not give a fuck abt my age😭",
                                    "score": 7,
                                    "author": "soooshimix_X",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "For Airbnb you only need to be 18 I’m pretty sure, that probably would be your best option",
                                            "score": 1,
                                            "author": "Drewsonnnn"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "car camping?? good lord i wish you all the luck (but are you sure you don’t have another alternative that is insane 😭)",
                            "score": 23,
                            "author": "iamnotmothman",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "thank youuu😭 yes thats pmuch my only option, hopefully i find a rundown motel that wont check 4 ID cuz imma b spendin almost a week out on that i10",
                                    "score": 6,
                                    "author": "soooshimix_X",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I did that coming out to Arizona, it's cool at night in all the places you're driving through. If it's too hot, just sleep in your car away from major cities, basically anywhere where there's a lot more dirt than concrete. Dirt areas generally get quite cool at night. You'll be fine, you could probably make it on one or two sleeps anyway",
                                            "score": 5,
                                            "author": "juhurrskate"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Man just pay someone the check in the room",
                                            "score": 1,
                                            "author": "Guilty-Resort-4665"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I lived in my car when I was 16 lol. Make sure you have window tint. Az doesn't have a legal limit for the rear windows. I've been running 15% in the front with no problem for years",
                            "score": 7,
                            "author": "OneHumanSoul",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "my car is a single cap :( prolly just gonna get some windshield covers n curtains",
                                    "score": 4,
                                    "author": "soooshimix_X"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You can rent a room from someone! I have before and they never checked ID. Will you be working and have an income?\n\nWhat are your majoring in?",
                            "score": 3,
                            "author": "Kerpleku",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "yoooo fuck yea fr? bet bro imma start out in psychology but def gonna explore the options, as far as income im starting fresh cuz phoenix is a new city for me",
                                    "score": 3,
                                    "author": "soooshimix_X",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You should look into overnight jobs for in home caregiving / group homes. Pay is low but you'll essentially just do your homework all night while the client sleeps. Even if only a few nights a week.  One of my family members manages group homes and they always need people. It's like baby sitting high functioning adults",
                                            "score": 3,
                                            "author": "Kerpleku",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Do you need a ssn to work these jobs?",
                                                    "score": 1,
                                                    "author": "nakli_newton",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Not sure if you need an SSN, but you'd need to be legal if that's what you're asking. It's a \"real\" job where your check is taxed.",
                                                            "score": 1,
                                                            "author": "Kerpleku"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Only need to be 18 for some hotels. You can call and ask their check in age. Or you can just have someone 18 book an Airbnb and if it has contactless check in, shouldn’t be an issue. Or just car camp 🤷‍♂️",
                            "score": 3,
                            "author": "Weird-Emu-5308"
                        },
                        {
                            "level": 2,
                            "comment": "If you’re 18 Fairfield inn will allow you to stay 99% of the time. Just call the hotel and ask if you can checkin at being 18 by yourself.",
                            "score": 1,
                            "author": "Mrbell11",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "im 17 tho :/",
                                    "score": 1,
                                    "author": "soooshimix_X"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You definitely want to get your AC in Prime working order, Arizona is not a place to be without great air conditioning. Good luck!",
            "score": 34,
            "author": "Felicia513"
        },
        {
            "level": 0,
            "comment": "Best of luck. I did that journey over a weekend and it was not fun. Stopped in Baton Rouge and El Paso.",
            "score": 7,
            "author": "jk021",
            "replies": [
                {
                    "level": 1,
                    "comment": "damnnnn did you take the i-10?",
                    "score": 5,
                    "author": "soooshimix_X",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, all through Texas I was right by the border and had no radio or cell signal. Would've been miserable if I didn't have Spotify songs already downloaded. \n\nMake sure you have gas and water just in case, and download the map for offline use.\n\nMy brother drove with me and then I paid for his flight back to Miami. It wasn't bad because I caught a cheap flight through Spirit. If someone can go with you that is old enough to rent a car/hotel, I'd recommend it.",
                            "score": 2,
                            "author": "jk021"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ah yes the ASU pilgrimage. If it makes you feel any better, I drove a 2003 Volkswagen Passat from Virginia to ASU in August and am about to drive it back. If a temperamental German wagon can do it, then your f150 should have no issues.",
            "score": 19,
            "author": "will10891089",
            "replies": [
                {
                    "level": 1,
                    "comment": "IS THAT WHAT ITS CALLED?!? THE ASU PILGRIMAGE?!?!💀💀 god thats hilarious brooo, good shit that u made it!",
                    "score": 9,
                    "author": "soooshimix_X"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Skill issue",
            "score": 5,
            "author": "NinjaRadish138",
            "replies": [
                {
                    "level": 1,
                    "comment": "💀💀💀bruh",
                    "score": 1,
                    "author": "soooshimix_X"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why are you coming here.",
            "score": 5,
            "author": "-Sniperteer",
            "replies": [
                {
                    "level": 1,
                    "comment": "to get the fuck out of this hellhole of south florida",
                    "score": 1,
                    "author": "soooshimix_X",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What makes you think AZ is any better",
                            "score": 2,
                            "author": "-Sniperteer",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "what makes you think AZ is somehow any worse",
                                    "score": 2,
                                    "author": "soooshimix_X",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Don’t come here.",
                                            "score": 3,
                                            "author": "-Sniperteer",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Sniperteer woke",
                                                    "score": 2,
                                                    "author": "8R4U5"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "too late brah im alr finacially committed 2 the college n i got my classes set n everything",
                                                    "score": 1,
                                                    "author": "soooshimix_X"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It's more costly here than south Florida. But we have less mosquitoes so that may be worth it.",
                            "score": 1,
                            "author": "will10891089"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’ve done that trip lol, but I started in Houston so not as long as you. I-10 going thru TX is gonna be a straight shot but all you’re gonna see is plains for like 12 hrs. Avoid rush hr when passing houston and pay attention to the signs/GPS. There’s like 6 exits in the span of like every miles thru downtown houston. \n\nGet a portable fan and a cooler with a bunch of drinks to keep that temp down. Ain’t gonna get much better than that w/o AC.",
            "score": 3,
            "author": "thatasiandude99",
            "replies": [
                {
                    "level": 1,
                    "comment": "the portable fan and cooler idea is so smart! i def gotta get one for the trip, thank u so much!!",
                    "score": 2,
                    "author": "soooshimix_X"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Abandon all hope ye who shall drive 2000 miles across the hottest states in America in the middle of August with a 1995 f-150 that has poor AC",
            "score": 3,
            "author": "Heavenly_Moon"
        },
        {
            "level": 0,
            "comment": "Might as well add a picture and say Roast Me.\n\nPark in the shade.",
            "score": 3,
            "author": "NotMyBestEffort",
            "replies": [
                {
                    "level": 1,
                    "comment": "def gonna come back to this post in six months with a photo of me at the ‘welcome to phoenix’ sign (granted i make it) w the words captioned “THE TREK HAS BEEN DONE” or sum stupid shi like that",
                    "score": 1,
                    "author": "soooshimix_X"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you can at least drive with someone 1 way and they fly home… 2 drivers have to stop to sleep a lot less than 1. \n\nIf you’re over 18, someone else can rent a hotel for you; there’s a form they’ll have to email with credit card info. All major chains do this. Don’t leave a mess, take photos on your way out. Bring anything you can’t afford to replace upstairs with you. \n\nI drive cross country a lot. I like the home2 suites and Hampton inns. They generally have kitchens and/or free breakfast and aren’t super sketchy looking or much more than the sketchy places. There’s sometimes laundry machines too if you need to freshen your wardrobe. \n\nAlso, turn off tolls on Google coming through Houston. Definitely stop in Fort Stockton. Carry a gas can at least through west Texas if you’re rocking a 1995 F-150. Pay cash for gas when you can so you don’t get hit with the $100 holds on your card. Wear sunscreen. This concludes my Ted talk.",
            "score": 3,
            "author": "OneRaisedEyebrow",
            "replies": [
                {
                    "level": 1,
                    "comment": "thank you dude! im def gonna rent a room at least once over the trip 4 a comfy bed (but im 17 so it finna b hard) \nkinda got no choice so as far as driving alone tho :( \nu think its a smart move to get a gas cart? my truck does have two tanks but she chomps thru that shit like a white guy with a can of lays chips\n\nthank you so much 4 the help!",
                    "score": 1,
                    "author": "soooshimix_X"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wym you’re not old enough to get a hotel room? Do you not have a credit card?",
            "score": 2,
            "author": "italiandevil3",
            "replies": [
                {
                    "level": 1,
                    "comment": "nope, plus im 17",
                    "score": 2,
                    "author": "soooshimix_X",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Your parents can reserve for your name. Most places will accept that as good enough",
                            "score": 9,
                            "author": "lil-mona"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you do night driving you won't need the ac.",
            "score": 2,
            "author": "KWKSA",
            "replies": [
                {
                    "level": 1,
                    "comment": "i have the little triangle openey air thingie cuz my trucks old as fuckkkk so i think ill be good during the day, gotta use the night to sleep",
                    "score": 1,
                    "author": "soooshimix_X"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I used to buy a big styrofoam cup drink from circle k back in the day when I had no ac. Definitely helps keeping you cool. So I recommend having some ice cold drink while driving. That’s it really.",
            "score": 2,
            "author": "amiranda00",
            "replies": [
                {
                    "level": 1,
                    "comment": "smart mfffff thank u",
                    "score": 2,
                    "author": "soooshimix_X"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Stick to the mountain states as long as your engine and trans are in good working order and don’t overheat. It may take a little longer but you can slee at higher elevation and cooler areas. Come through southern Colorado and flagstaff on the 40.",
            "score": 2,
            "author": "brute313",
            "replies": [
                {
                    "level": 1,
                    "comment": "idk if id be able to detour that far but thank you!",
                    "score": 1,
                    "author": "soooshimix_X",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I hear you, I’ve personally done multi state road trips in my AC-less Wrangler and this has always worked for me though. Would probably only add a day or so to the trip and you would get to see some beautiful sights along the way! Don’t underestimate how incredible the Rockies are\n\nIf you go through Texas and maybe Kansas it’s going to SUCK",
                            "score": 1,
                            "author": "brute313"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "On a positive note, you'll be doing something not many people do in their lifetime. Enjoy the trip!!",
            "score": 2,
            "author": "baldegle"
        },
        {
            "level": 0,
            "comment": "This is insane. You are old enough to travel alone but not old enough to rent a hotel.",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "yuppppp travellin @ 17",
                    "score": 1,
                    "author": "soooshimix_X"
                },
                {
                    "level": 1,
                    "comment": "AMERICA 🇺🇸 🦅 FUCK YEAH",
                    "score": 1,
                    "author": "soooshimix_X"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You’ll survive.  If you live in Florida you will be pleasantly surprised about our heat when you arrive.  (I’m from Florida)",
            "score": 2,
            "author": "asurob42",
            "replies": [
                {
                    "level": 1,
                    "comment": "frrrrrrr the when i visited last summer i asked my pops “yo how hot is it rn? it feels like 85 max” and he showed me the temperature and it was 110+😭 its a whole other typa heat but so much less nasty than FL",
                    "score": 2,
                    "author": "soooshimix_X",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "exactly.  In florida it's 3 showers a day.  Arizona not so much.  Don't get me wrong...it's hot but it's not that nasty hot.",
                            "score": 2,
                            "author": "asurob42",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "forreaaalllllzzz man floridas heat is much worse to deal with IMO",
                                    "score": 1,
                                    "author": "soooshimix_X"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Get your A/C fix and drink lots of water\n\nBest of luck fam",
            "score": 2,
            "author": "Vengenz_13"
        },
        {
            "level": 0,
            "comment": "blessings be stowed upon you, son. \n\nbe sure to get a tune up, oil change and new tires (if needed).",
            "score": 2,
            "author": "ShannonTwatts"
        },
        {
            "level": 0,
            "comment": "Lol why",
            "score": 2,
            "author": "Railinggazer"
        },
        {
            "level": 0,
            "comment": "My friend and I  checked into an Airbnb when we were 16. If I remember correctly her parents booked it and then texted the person saying that she’d be checking in or smthing like that and it worked out fine",
            "score": 2,
            "author": "Tieshuu",
            "replies": [
                {
                    "level": 1,
                    "comment": "not a bad idea tbh thank u",
                    "score": 1,
                    "author": "soooshimix_X"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I didn’t have a car with AC for three years when I was an undergrad. It sucks but plenty of people do it.\n\nBring a change of clothes wherever you go and don’t lean your back against your seat driving cuz you’re gonna be SWEATYYY all the time",
            "score": 2,
            "author": "slowelevator"
        },
        {
            "level": 0,
            "comment": "Bring 4-5 gallon jugs of water for both you and the truck if it starts to over heat. Carry an extra container of coolant and a quart of oil and keep an eye on your gas and you'll be great.\n\nIf it gets hot as hell douse your tee shirt in water- you'll drop your air temp 20 degrees.",
            "score": 2,
            "author": "capmanor1755"
        },
        {
            "level": 0,
            "comment": "Did the same, from NC to AZ",
            "score": 3,
            "author": "Caci-que",
            "replies": [
                {
                    "level": 1,
                    "comment": "bless u doggg :0 what highway did u take?",
                    "score": 1,
                    "author": "soooshimix_X",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You got me there, cause I just put the gps to Tempe AZ and drove😅",
                            "score": 2,
                            "author": "Caci-que",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "a drive’s a drive brother",
                                    "score": 2,
                                    "author": "soooshimix_X"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "not worth it",
            "score": 2,
            "author": "frogjams",
            "replies": [
                {
                    "level": 1,
                    "comment": "LMAO how so?",
                    "score": 0,
                    "author": "soooshimix_X"
                }
            ]
        },
        {
            "level": 0,
            "comment": "🙏",
            "score": 1,
            "author": "Packedapunch1"
        },
        {
            "level": 0,
            "comment": "Make sure you hit up Buc-ee’s along the way in FL, AL, and TX.",
            "score": 1,
            "author": "ct_dooku",
            "replies": [
                {
                    "level": 1,
                    "comment": "I FUCKING LOVE BUCEEEEEES",
                    "score": 2,
                    "author": "soooshimix_X"
                }
            ]
        },
        {
            "level": 0,
            "comment": "KOAs. Most have showers and pools",
            "score": 1,
            "author": "Zestyclose_Spare_745"
        },
        {
            "level": 0,
            "comment": "I’ll be driving from Virginia to asu",
            "score": 1,
            "author": "Botchyyyy"
        },
        {
            "level": 0,
            "comment": "I have driven back and forth between FL and AZ multiple times on the 10! My mom still lives in AZ and doesn’t have AC in her car, it’s tough but I wish you luck",
            "score": 1,
            "author": "delaneydeer"
        },
        {
            "level": 0,
            "comment": "why not use airbnb?",
            "score": 1,
            "author": "yelloworgold"
        },
        {
            "level": 0,
            "comment": "I mean swing north on the trip?",
            "score": 1,
            "author": "treetoptoaster27"
        },
        {
            "level": 0,
            "comment": "If you have parents they can call if you put it in there name for most hotels",
            "score": 1,
            "author": "Extreme-Town-438"
        },
        {
            "level": 0,
            "comment": "Good for acclimation to the climate 🤣",
            "score": 1,
            "author": "scandal1313"
        },
        {
            "level": 0,
            "comment": "This might sound obvious, but have extra water with you in the car at all times. For you to drink and to help cool the engine if needed. I’ve made your exact drive several times with a buddy. It’s worth it to take someone with you and have them fly back if you can swing it. Either way, good luck and be safe! (Oh and try to time west Texas for mostly day driving so that you can take advantage of higher speed limits.)",
            "score": 1,
            "author": "earreset"
        },
        {
            "level": 0,
            "comment": "Drove from Gainesville, FL to Tempe last June - bring lots of water and just keep driving dude!! I bet you can do it with only stopping one night!!",
            "score": 1,
            "author": "truebluejackson"
        },
        {
            "level": 0,
            "comment": "!updateme",
            "score": 1,
            "author": "northerngrowmie"
        },
        {
            "level": 0,
            "comment": "You need a shemagh",
            "score": 0,
            "author": "VP_Keith_David",
            "replies": [
                {
                    "level": 1,
                    "comment": "whats that bro ?",
                    "score": 1,
                    "author": "soooshimix_X",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The best desert adapted piece of clothing you'll ever own, since stillsuits aren't a real thing.\n\nAwesome for dust and sun protection for your face, neck and head / shoulders.\n\nJust wet it down and drape it over your neck/ head and you'll cool right off provided the humidity isn't too high (so, west Texas and points west).\n\nThey are cheap and come in any color you could want.",
                            "score": 1,
                            "author": "VP_Keith_David",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "shiiii i might have to cop",
                                    "score": 1,
                                    "author": "soooshimix_X"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}