{
    "id": "13fvu5v",
    "score": 2,
    "title": "Dars help- electives",
    "author": "sammysalamis",
    "date": 1683922684.0,
    "url": "https://www.reddit.com/r/ASU/comments/13fvu5v",
    "media_urls": [
        "https://i.redd.it/p4hhee3p2iza1.jpg"
    ],
    "other_urls": [],
    "postText": "I’m confused on my dars audit and my advisor is out for the summer. At the very bottom of the audit under electives, it says I have earned 34 but need 36. Do I need 2 more credits? Thank you in advance.",
    "comments": [
        {
            "level": 0,
            "comment": "1. What major are you in.\n2. I would need to see more of the DARS reports before making any statements",
            "score": 6,
            "author": "ASU_knowITall",
            "replies": [
                {
                    "level": 1,
                    "comment": "[dars](https://imgur.com/a/rfiW2u5)\n\nI linked the top section of my Dars. I am an economics major within the liberal arts college. I really appreciate your help.\n\nI have 9 more credits until I fulfill the major and upper division requirements.",
                    "score": 2,
                    "author": "sammysalamis",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "As it's under an optional tag, and your major and college requirements are being met with the rest of your classes, you look all set to graduate after your next semester!",
                            "score": 1,
                            "author": "nahbah77",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you so much! These DARS audits are super confusing. After 4 years you would think that I would have it down.",
                                    "score": 1,
                                    "author": "sammysalamis",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Again, just double check with another advisor. There should be a general advising email.for your major/college and just request that someone looks over it to ensure you are all set to graduate.",
                                            "score": 2,
                                            "author": "nahbah77"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yes you need two more credits, if I’m not mistaken.",
            "score": 2,
            "author": "endlesslyfe",
            "replies": [
                {
                    "level": 1,
                    "comment": "Even if it is under the opt (optional) category?",
                    "score": 1,
                    "author": "sammysalamis",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, just from the way the description is worded you just need 2 credits* of any elective to meet the criteria. Definitely double check with your advisor as soon as they get back into office so you have time to enroll in something before deadlines. I genuinely hate the way that the DARS is organized, it’s very confusing haha",
                            "score": 1,
                            "author": "endlesslyfe",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Super confusing. The 2 elective credits aren’t even showing up in the top of my Dars where the bars and pie are located.",
                                    "score": 1,
                                    "author": "sammysalamis",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "At this point I don’t bother with the DARS, I just follow the major maps (which are only SLIGHTLY less confusing) because they also include a list of track focus electives and stuff",
                                            "score": 1,
                                            "author": "endlesslyfe"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "No, since it’s marked as optional, having that section incomplete does not impact graduation.\n\nJust make sure that everything else is looking good. And if you have ever repeated classes, make sure credit has only been retained from one attempt (you can check that in the Repeated Courses section toward the top).",
                            "score": 1,
                            "author": "persephone_24"
                        }
                    ]
                }
            ]
        }
    ]
}