{
    "id": "13m52rn",
    "score": 6,
    "title": "On Campus Job",
    "author": "Guilty-Creme-2543",
    "date": 1684524051.0,
    "url": "https://www.reddit.com/r/ASU/comments/13m52rn",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey, I am an International sophomore student and since last Fall I am applying for On-campus jobs but have still not been able to get any. I really need a job for Fall 2023 as I am struggling financially. Is anyone currently hiring for Fall 2023? Also if you know there is an opening or can refer me to a job it would help a lot.",
    "comments": [
        {
            "level": 0,
            "comment": "There have been a few similar posts on this sub about the same subject. A few of them have some very detailed answers from those people who hire many student workers every semester. The key is to have a well-formatted and easy to read cover letter and resume. Also, tailor your cover letter and resume to the job you are applying to. There's nothing that turns a hiring manager off more than generic cover letters.",
            "score": 3,
            "author": "ASU_knowITall"
        },
        {
            "level": 0,
            "comment": "Do you have a US drivers license?  I know of a few jobs coming open soon but they require a license.",
            "score": 1,
            "author": "Borrowed_Pizza",
            "replies": [
                {
                    "level": 1,
                    "comment": "No, unfortunately I don’t have a license yet.",
                    "score": 1,
                    "author": "Guilty-Creme-2543",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’ll keep an eye out for any jobs that don’t require a license.  If I come across anything I’ll let you know.  But definitely keep applying.  Something will come up.  Try not to stress too much!",
                            "score": 1,
                            "author": "Borrowed_Pizza",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks alot!",
                                    "score": 1,
                                    "author": "Guilty-Creme-2543"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you are interested in sports at all do Intramural ref it’s easy work on campus",
            "score": 1,
            "author": "Banana-Man201"
        }
    ]
}