{
    "id": "13pe833",
    "score": 2,
    "title": "College Attainment Grant",
    "author": "XxdragonxX88",
    "date": 1684817053.0,
    "url": "https://www.reddit.com/r/ASU/comments/13pe833",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey all,\n\n# IMPORTANT UPDATE: \n\n**Gave them a call just now because I remembered the answering machine sometimes has a message with known issues on it, and infact it is a known issue that should be resolved by the end of the week about College Attainment and Obama scholarships being removed.** \n\n**So for those of you who have had the same thing happen, I would still give them a call so they can 100% identify your account (as the message said they are working to identify affected accounts), but you should be all good :)**  \n\n\nOriginal Post:\n\nHoping for some advice or something here, obviously I will be contacting finance as soon as is physically possible, but I am trying to gather any information if at all possible prior to or anything that may help me in case this gets significantly tedious.\n\nGot the worst set of emails tonight (22nd) stating that apparently I'm out a good chunk of money and after some very quick investigating it would appear that ASU has retroactively/since I graduated (or shortly prior to at least) pulled my college attainment grant for both semesters in the 2022-2023 semester. Has this ever happened to anyone? I met or exceed all requirements (24 credit hours total, 12 each semester, graduated with a 3.78, SAP is showing as meeting). All three previous years I got the grant no problem, no issue, but the grant is completely gone now (And I know darn well I got it the first and second semester as otherwise I would have gotten this notification of a outstanding balance in 9/22/2022(ish) rather than today, on 5/22/2023 (as the first charge is dated 8/25/22 and the second 1/25/2023)\n\nThere is no shown record of me getting (or failing to get) the college attainment grant on the finance website or in the charge/payment history, it is just completely gone (not even a line for it in the awards section) but it is still there for all previous semesters/years.\n\nFor context also all four years I had the exact same aid and similar setup with the same grants, loan amounts, etc. and just paying off the remaining balance out of my account (which I did which is also how I know I zeroed it out and definitely didn't leave a massive charge)\n\nThanks, Let me know if any other information may be helpful, Ill keep you all updated tomorrow morning as the payment deadline rapidly approaches (since they didn't send me a notification like right as it charged my account only now that its 3 days from being sent to collections or whatever nightmare they do after \"30 days\" -\\_-)",
    "comments": [
        {
            "level": 0,
            "comment": "That’s awful.  I’m sorry.",
            "score": 2,
            "author": "DeerEmbarrassed8341"
        },
        {
            "level": 0,
            "comment": "what number did you call? i got the exact same issue rn",
            "score": 2,
            "author": "Pristine-University9",
            "replies": [
                {
                    "level": 1,
                    "comment": "Just went through the number listed on my asu (the one that says 24/7 support) it has a directory for your call and picked the first one (number one) and that’s the message. (And is also the redirect to finance office)",
                    "score": 1,
                    "author": "XxdragonxX88",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "yep talked to FAFSA and they confirmed it was a glitch and they are manually fixing the issue rn",
                            "score": 2,
                            "author": "Pristine-University9"
                        }
                    ]
                }
            ]
        }
    ]
}