{
    "id": "13rr2yz",
    "score": 92,
    "title": "I graduated a year ago with a degree in mathematics, and have been working as an engineer since. This is how it's going...",
    "author": "666moneyman999",
    "date": 1685043449.0,
    "url": "https://www.reddit.com/r/ASU/comments/13rr2yz",
    "media_urls": [],
    "other_urls": [],
    "postText": "So this post is basically for the stem majors and what to expect when you land your first job. \n\nAs stated I graduated with a math degree. Now I was told that math was super important for engineering, however, since I started working I have not used any math whatsoever. A bit surprised by this but I'm not really complaining about that.\n\nA big difference between school and work that I noticed is the type of problems you need to solve. In school, when you are given an assignment, there are very clear guidelines for how to get the problem done. There is also an end goal. You know what you are working toward. At work this is not the case. If I am given a problem at work, my boss will give me maybe 5% of the information and tools I need to get it done.\nThis is where I had to become an engineer and ask questions, try things out, fail and break stuff, then try again until I iterate to a correct (or reasonable) answer.\n\nAlso, school and work are formated COMPLETELY different from each other. In school, I was given material to study, then  I was given an exam on the material and my grade was based off how I did. At work I was basically thrown into the fire first, then learned as I went along. This was the biggest eye opener for me because I had to be diligent and precise on topics I had never seen before because the systems I work on are large and expensive. \n\nLast thing: software. In school, again, assignments are well defined and strict guide rails are put up for relatively small projects in a coding class. Because of this, u don't really need to learn to much to get a project done. HOWEVER, at work, software projects are GIANT and if I was asked to make a change to projects, it was impossible to really know how the change fit into the project as a whole. Because the repos are so large, it would take me 6 months to a year to get through every file and understand how the software, tools, and equipment and entangled together.\n\nI know this was long but if you made it to the end know this:\nWhen you get your first job:\n*Don't be scared if you are intimidated by the scale of the project you are working on\n\n*Don't be scared if after the first 6 months to a year you still feel like you are lost\n\n*Don't worry to much about the material you learned in school, focus more on basic computer knowledge and troubleshooting skills\n\n*Ask questions and show you are willing to learn. Take notes of what people tell you so you are not asking the same question over and over.\n\n*Make mistakes! Even after all the things I typed ( while I'm at work, supposed to be working), your boss will understand you are new. They expect you to break things at first.",
    "comments": [
        {
            "level": 0,
            "comment": "I've been working in \"engineering\" (automated industrial controls) for the last 17 years and am now back at school to actually get an engineering degree because my employer requires it for certain positions. Your post is spot on.\n\nNothing ever goes 100% smooth. You'll always be making mistakes. \n\nFor what I do math can be important as we work in a lot of 3d coordinate systems but talking with the engineers at my work, they rarely use calculus. Which was made my struggles with calculus all that much more enjoyable.",
            "score": 28,
            "author": "Mordicant85"
        },
        {
            "level": 0,
            "comment": "I'd imagine it's easier to get into the software side of engineering with a math degree compared to a civil engineer.\n\nBut yes, I also don't use real analysis at work, etc. At the end of the day, I believe that anyone could do my job without a degree.",
            "score": 11,
            "author": "hamta_ball",
            "replies": [
                {
                    "level": 1,
                    "comment": "Seriously, that's why I was saying, the material you learn in school is not that important. As bad as it sounds lol",
                    "score": 5,
                    "author": "666moneyman999"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Systems engineering and discipline engineering can be very different animals in terms of the technical nature of the job.  I routinely use linear algebra, dynamics, and calculus in my day to day work in aerospace GN&amp;C.",
            "score": 3,
            "author": "BPC1120",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's exactly what I do, I'm a systems engineer that mainly works on rf towers and other communication systems. So far it's way more conceptual then anything else",
                    "score": 2,
                    "author": "666moneyman999"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Even if it's more than a year, it's okay to ask questions about stuff. If you've been on for a year, you're showing promise and growing to the team.",
            "score": 3,
            "author": "AcordeonPhx"
        },
        {
            "level": 0,
            "comment": "I assume you were fairly computer-savvy along with being strong in math. I graduated with a B.A. in Math, but the only job I qualified for was teacher. I only took two computer science courses, and one was C++ programming, which I did not understand, whatsoever.",
            "score": 2,
            "author": "Imaginary_Ad_3912",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yea my degree was also Computational math so I got a good amount of computer courses in there. Tbh they teach u everything u need to know on the job",
                    "score": 3,
                    "author": "666moneyman999",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I am glad that has been your experience. Mind you, I graduated years ago. However, I was hired for an engineering position and given a huge manual to read as my \"training.\" I never took any engineering or drafting courses in high school or college.\n\nThere was one other individual who had been hired approximately a year prior to me. He also had a math degree and had formerly been a teacher. When he brought over a drawing to show to one of the senior members and ask a question, the senior member informed him he had the drawing upside down.",
                            "score": 2,
                            "author": "Imaginary_Ad_3912"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Superb insight and advice from OP.  Kudos!",
            "score": 2,
            "author": "eTransporter"
        },
        {
            "level": 0,
            "comment": "Well said, I agree in the differences you've experienced. I graduated in 2019 with a B.S in CIS/BDA and largely felt the same. I did have the advantage of 2 internships where my boss was like \"Nobody knows how to do this, go figure it out\". \n\nI was hired directly out of college as a Business Intelligence Analyst with an insurance company (that you've never heard of). Anyways, I knew nothing about insurance. You're 6 month period is really accurate. I felt like I was finally starting to contribute after month 4-5. \n\n&gt;*Ask questions and show you are willing to learn. Take notes of what people tell you so you are not asking the same question over and over.\n\nBig emphasis on this. The thing is that where you are going to work most likely has a SME (subject matter expert) that you can lean on to learn so many things. Treat this person like an angel and it really says a lot about your desire to learn and contribute. Just don't drown them with questions :D",
            "score": 1,
            "author": "Synikx"
        },
        {
            "level": 0,
            "comment": "i got a swe job after graduating in mathematics and although i don’t technically use math directly, i appreciate the problem solving abilities that have become second nature as a result of logic based pure math courses",
            "score": 1,
            "author": "Trenblack"
        },
        {
            "level": 0,
            "comment": "I haven’t graduated yet but have some experience. Read the SOPs and other pubs the company has to figure out, and at least have an idea where it might be for future reference",
            "score": 1,
            "author": "Living-Reference1646"
        },
        {
            "level": 0,
            "comment": "Can I ask you what classes you took? Did you take abstract algebra and group theory and abstract math or did you focus more on applied math or both? Thx",
            "score": 1,
            "author": "Delicious-Dirt3459",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yea I did. I took group theory and abstract algebra. Besides that it was mainly applied. I took scientific computing and computational methods (421 and 424) I also took statistics and probability(stp420 and 421)",
                    "score": 1,
                    "author": "666moneyman999",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ah okay I see, thx",
                            "score": 1,
                            "author": "Delicious-Dirt3459"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thank you for this! I tell students similar things all the time. For most careers, you are going to learn what you really need to know on the job. A bachelor's degree should be helping you build those skills for learning. Every bullet point is true for learning in your degree:\n\n\n*Don't be scared if after the first 6 months to a year you still feel like you are lost\n\nAbsolutely true for first-year students at ASU. So many are afraid that they don't belong when they are still lost. \n\n*Don't worry to much about the material you learned in school, focus more on basic computer knowledge and troubleshooting skills\n\nWhile more specific to your field, focusing on being really good at basic writing, math, and critical thinking during college is important. \n\n*Ask questions and show you are willing to learn. Take notes of what people tell you so you are not asking the same question over and over.\n\nWhy don't people take notes anymore? Some people take them on the computer, but getting in the practice of taking notes and organizing them will help you in the real world. Asking questions is also important and people tend to think they will look bad if they ask. You look engaged and interested when you ask questions. \n\n*Make mistakes! Even after all the things I typed ( while I'm at work, supposed to be working), your boss will understand you are new. They expect you to break things at first.\n\nSuch good advice. We learn best by making mistakes and struggling a bit. It is good for us.\n\nSorry to get on my soapbox, but I think it can be hard to see why some things in college actually do help in your career.",
            "score": 1,
            "author": "accidentally_on_mars",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for the comment! \nI don't want people to think that college doesn't help at work, it definitely does, but not in the sense of the material you learn. It's more of the ability to stay consistent with something, reaching out for help, keeping your work organized, learning how to solve problems in general (not specific material). The mental gymnastics I did as a math undergraduate allowed me to think abstractly and understand conceptually difficult subjects. I took that into work and tailored that thinking into the things I need to know at work.",
                    "score": 2,
                    "author": "666moneyman999"
                }
            ]
        },
        {
            "level": 0,
            "comment": "25+ years industry experience.  These are great insights.\n\nI would point out however in my case, my career has been very math intensive.  YMMV",
            "score": 1,
            "author": "LittleBallofMeat"
        }
    ]
}