{
    "id": "13w67o7",
    "score": 3,
    "title": "ALEKS Math Placement Test",
    "author": "fxde123",
    "date": 1685490705.0,
    "url": "https://www.reddit.com/r/ASU/comments/13w67o7",
    "media_urls": [],
    "other_urls": [],
    "postText": "If I take my second and third attempt on the math placement test, do the problems get harder?",
    "comments": [
        {
            "level": 0,
            "comment": "No it's the same difficulty",
            "score": 10,
            "author": "robertxcii",
            "replies": [
                {
                    "level": 1,
                    "comment": "ok thx",
                    "score": 0,
                    "author": "fxde123"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Nope, it's the same question &amp; same test",
            "score": 2,
            "author": "Felicia513",
            "replies": [
                {
                    "level": 1,
                    "comment": "so the same questions again?",
                    "score": 0,
                    "author": "fxde123",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Basically the same questions but the numbers are different, the test gets harder the better you do",
                            "score": 5,
                            "author": "pugguy42",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "So similar questions the second time. And if i do better that time, the test harder the third time?",
                                    "score": 0,
                                    "author": "fxde123",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "No, as you take the test it gets harder the better you do. So for instance, if the first question was 2+2 and you got it right, the next question might be 2x6, so slightly harder. If you get that right, it keeps increasing. If you get things wrong, it goes back down. But the tests will always start easy and then increase with difficulty. The system doesn't take your other tests into account, it just starts out the same for everyone.",
                                            "score": 1,
                                            "author": "itsurbro7777"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "No so basically as you do the test the questions become harder or easier, if you get multiple questions correct in a row the test starts giving you harder questions, if you get multiple wrong then it gives you easier questions.",
                                            "score": 1,
                                            "author": "pugguy42"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Not the same exact exact questions but yes, very similar ones",
                            "score": 1,
                            "author": "Felicia513"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm psure it adapts and gets rid of the questions you did well on in the previous tests. My first test was mostly Algebra 2 stuff, which I did alright on, and my second test was filled with insane trig problems",
            "score": 2,
            "author": "ByteBuff",
            "replies": [
                {
                    "level": 1,
                    "comment": "Damn",
                    "score": 1,
                    "author": "fxde123",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If that is the case, make sure to brush up on your trig identities, like the Pythagorean and double-angle ones.",
                            "score": 2,
                            "author": "Imaginary_Ad_3912",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "retook it this friday and got a 64. so i’m chilling now",
                                    "score": 2,
                                    "author": "fxde123"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Same lvl, if you know the concepts just put a calculator and phine with mathway under ur screen and do it. Or ur gonna be placed in a lower lvl math class and pay 6 credits of tution and graduate late",
            "score": 0,
            "author": "nugget9465"
        },
        {
            "level": 0,
            "comment": "You’ll get similar questions but I’d say they’re pretty much the same except the numbers are different",
            "score": 1,
            "author": "monniexsweet"
        }
    ]
}