{
    "id": "13zv310",
    "score": 7,
    "title": "MAT 210 Universal Learner",
    "author": "ZJums",
    "date": 1685838412.0,
    "url": "https://www.reddit.com/r/ASU/comments/13zv310",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m in MAT210 summer class right now and I don’t think i’m going to pass because i’m on vacation right now and am finding it hard to find time to get the topics done and quizzes done. I’m thinking of withdrawing so I don’t get an F, the withdrawal date is June 5, a couple days from now. I’m thinking of doing MAT210 on Universal Learner; do I get the same credit once I pass the class on Universal Learner as I would if I passed MAT210 summer class?",
    "comments": [
        {
            "level": 0,
            "comment": "Yes, you can take MAT210 on Universal Learner, and it counts exactly the same as a campus class. MAT210 is offered as a self-paced class. That means you can start it at anytime and finish it at your own pace, whether that be 3-weeks or 1-year. Be aware though that if you do not finish by August, your Fall classes may be affected if any require 210 as a pre-requisite.",
            "score": 3,
            "author": "Traveller1323"
        },
        {
            "level": 0,
            "comment": "If you’re an admitted student to the university then you are ineligible for universal learner.",
            "score": 0,
            "author": "adelfina82",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not true. Current ASU students can take Universal Learner classes. It was opened to current students in Summer 2020. Not a recent update. There has been Absolutely Nothing said by ASU that this will be changing again. In fact, the last word issued by Universal Learner was in the opposite direction, saying they will allow Grade Replacement from their courses.",
                    "score": 5,
                    "author": "Traveller1323"
                },
                {
                    "level": 1,
                    "comment": "Do you know where it says that? If so can you provide the source. [ASU ULC](https://www.reddit.com/r/ASU/comments/11u14g5/take_advantage_of_universal_learner_courses_to/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=ioscss&amp;utm_content=2&amp;utm_term=1) This says that even if you’re a current student you can take it.",
                    "score": 2,
                    "author": "ZJums",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "In the past asu has not restricted who can participate in ULCs. But that is changing as of august I believe. The intent behind ULCs is to capture potential students. So while it is not explicitly stated on their website it will be soon.",
                            "score": 0,
                            "author": "adelfina82",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Will I be able to sign up for it before August and take it?",
                                    "score": 1,
                                    "author": "ZJums"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I took a transferable equivalent of the class in a community college and they accepted it. Use their resources to check if it transfers \n\nhttps://webapp4.asu.edu/transfercreditguide/app/searchcourses?init=false&amp;nopassive=true",
            "score": 1,
            "author": "freebird007"
        },
        {
            "level": 0,
            "comment": "Are you already in a major?\n\nMy advisor said you are not able to earn any universal learning credits if you are.\n\nJust stick it out and do well on the exams. They are worth like 70% of the grade",
            "score": 1,
            "author": "sammysalamis"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "r/ASU enforces a requirement that all accounts must meet a minimum account age and karma threshold before they are able to post to this subreddit. This is in place to prevent bot/troll accounts. **There are no exceptions to this rule. Do not message the mod mail regarding account age or minimum karma removals.**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ASU) if you have any questions or concerns.*",
                    "score": 1,
                    "author": "AutoModerator"
                }
            ]
        }
    ]
}