{
    "id": "141ndp6",
    "score": 8,
    "title": "ASU Football Game",
    "author": "WutDuhF",
    "date": 1685989270.0,
    "url": "https://www.reddit.com/r/ASU/comments/141ndp6",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey everyone,\n\nMy best bud is getting hitched soon and I am responsible for planning the bachelor party. We are looking at flying down from Calgary AB to Scottsdale for a weekend in November, or possibly October.\n\nHe had mentioned the idea of going to a college football game. There will be about 10 of us going and we are just looking to catch some highlights of the City, maybe golf, and party away from snowy Canada over a few days! \n\nAny recommendations on which game to attend and things to do before and after the game? Where to sit? Is it pricy for tickets and booze? Etc… all insight is super appreciated.\n\nBonus question - ASU football game or Arizona cardinals game for a bachelor party?",
    "comments": [
        {
            "level": 0,
            "comment": "ASU Football at least has a shot of being decent this year as opposed to the Cardinals who are a steaming pile of shit, lol. Plus ASU is in Tempe and not far from Scottsdale, whereas the Cardinals stadium is out in Glendale and you will spend the better part of an entire day getting to and from the game.",
            "score": 36,
            "author": "deserteagle3784",
            "replies": [
                {
                    "level": 1,
                    "comment": "Haha this is great information, thank you!",
                    "score": 2,
                    "author": "WutDuhF",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Of course! Ticket prices are usually reasonable especially compared to pro sports but will definitely depend on who we are playing. \n\nIf you’re all really looking to club Old Town Scottsdale is definitely the way to go but be prepared to pay an arm and a leg for it. Tons of great golf courses, your options are endless there but if you won’t have cars look for something near where you’re staying. Actually map things out- the valley is deceptively large and I have known many people who plan trips without realizing that some of their stops are actually going to be an hour or more away from where they’re staying. \n\nEnjoy!",
                            "score": 3,
                            "author": "deserteagle3784"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "ASU game for sure. Closer to Scottsdale, stay closer to Old Town Scottsdale, that way you’ll be closer to both Old Town’s Clubs and Bars and ASU Clubs and Bars.",
            "score": 11,
            "author": "ShaneyB909"
        },
        {
            "level": 0,
            "comment": "Home schedule for this time period:\n\nOct 7th vs Colorado (new coach Deion Sanders)\n\nOct 28th Washington State (Homecoming)\n\nNov 18th Oregon (Salute to Service aka military appreciation)\n\nNov 25th Arizona (one of the top rivalries in college football, supremely underrated, but also Thanksgiving/Black Friday weekend here, I learned about Canadian Thanksgiving from HIMYM lol)\n\nAny of these games would be good, but I'd for sure recommend Oregon or Arizona (aka Poo of A) if for no other reason the weather will be much more reasonable. It's often still breaking 100F during the day by Halloween. ASU has been playing well against much better Oregon teams lately at home, and you can never go wrong seeing a Duel In The Desert.",
            "score": 11,
            "author": "staticattacks",
            "replies": [
                {
                    "level": 1,
                    "comment": "Fantastic. It was the two late November games that jumped out to me so I’m happy to hear that you would recommend either!",
                    "score": 2,
                    "author": "WutDuhF",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "UofA and Arizona will be packed so I would buy tickets sooner rather than later. The earlier games probably won’t fill half the stadium",
                            "score": 2,
                            "author": "tummydisrupt"
                        },
                        {
                            "level": 2,
                            "comment": "Now just make sure everybody gets some Sun Devil gear and have some fun!",
                            "score": 1,
                            "author": "staticattacks"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would also choose an ASU football game over a Cardinals game. If you have the option of picking another NFL football team that is competitive I would suggest that, maybe the steelers? Maybe the Chargers? Not the Cardinals",
            "score": 5,
            "author": "Felicia513"
        },
        {
            "level": 0,
            "comment": "Just checked the schedule, but ASU has 8 home games vs 4 away games. Crazy.\n\nBut if you can make it down for the Oregon game on Saturday the 18th, the weather will be prime, It'll be a good game (Oregon is pretty good!) and it'll likely be a day game so you can go find something fun to do afterwards in Scottsdale.\n\nMill Ave is a great tourist location, but it's more of a University/Younger vibe. From my experience, most tourists *not* younger than 25 prefer to go to Old Town over Mill Ave.\n\nHit up the daily chat on r/Phoenix to ask for good deals for golf/hotels and things to do.  \n\nLastly, keep in mind that the Air Traffic coming to and from the city will be EXTREME because lots of snowbirds are flying in and that weekend is around USA's Thanksgiving.",
            "score": 3,
            "author": "MalleableBee1",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is awesome information to know. Thank you thank you!!!",
                    "score": 2,
                    "author": "WutDuhF"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The ASU homecoming or vs UCLA or UofA would all be great rivalry games with great atmosphere!",
            "score": 3,
            "author": "Felicia513"
        },
        {
            "level": 0,
            "comment": "I’d shoot for the UofO or UofA game, but any should be fine. Go to Mill Ave or Old Town Scottsdale after the game to party.",
            "score": 3,
            "author": "theromanempire1923"
        },
        {
            "level": 0,
            "comment": "ASU hockey game at the Mullett. You are Canadian after all eh?",
            "score": 3,
            "author": "berkeleybikedude"
        },
        {
            "level": 0,
            "comment": "I know it’s a long shot but the Friday or Saturday after thanksgiving is the Territorial cup and that’s the biggest game as it’s a rivalry. At ASU Tempe.",
            "score": 2,
            "author": "MaddMarchisano"
        },
        {
            "level": 0,
            "comment": "Definitely ASU instead of cardinals. Nov 18 is against oregon which would probably be a pretty good game. Oct 28 against WSU might be good too especially since it's homecoming. If you can push it all the way to the end of November, the U of A game will be great because it's our rival.\n\nAlso, all these games are on Saturday, so if it's an afternoon game, go to Mill Ave after and get sloshed. If it's an evening game, go daydrinking on Mill lol.\n\nTry to sit between the 25 yard lines on the lower levels.\n\nIf getting hammered isn't your thing, you could go for a hike on A mountain (that's the mountain that the stadium is built into). You could also go to Old Town Scottsdale where there's a lot of restaurants and stuff.",
            "score": 2,
            "author": "knutt-in-my-butt"
        },
        {
            "level": 0,
            "comment": "Definitely stick in the Scottsdale/Tempe area.\n\nOne thing that throws a lot of people, even a lot of Americans is that the Phoenix Metro area is gigantic.  Maricopa and Pinal county covers 14,500 sq miles.  You can go over 30 miles east to west, and never leave the urban/suburban environment.  You will pass through a number of different cities, but you would never know it unless you are paying attention to the small signs.\n\nI have to give my two recommendations for food:\n\nThe Chuckbox is a Temp/ASU institution that's been around forever.  They serve burgers and chicken.  The food is cool in front of you when you order it.  They only accept cash, so plan at least $20/person with drink and a side.\n\nHaji Baja's is a casual restaurant attached to a market that serves traditional Middle Eastern food.  It is a small business that has been in Tempe for 40+ years.",
            "score": 2,
            "author": "ASU_knowITall"
        },
        {
            "level": 0,
            "comment": "If you’re planning on golfing, keep in mind that some courses could be closed in Nov due to overseeding grass. You’ll be able to find open courses, but something to consider.",
            "score": 2,
            "author": "Owl55"
        }
    ]
}