{
    "id": "142tgbo",
    "score": 3,
    "title": "Question for GI Bill students",
    "author": "Lunar_LiOH",
    "date": 1686086019.0,
    "url": "https://www.reddit.com/r/ASU/comments/142tgbo",
    "media_urls": [],
    "other_urls": [],
    "postText": "Do we receive the grants given, or are they applied to our account? I’d like the GI bill to cover my tuition so I can use the grant money for living expenses. Any help is appreciated!",
    "comments": [
        {
            "level": 0,
            "comment": "The grant money is applied to your account first, to pay off what you owe, usually it's not enough to pay everything off. Once the GI Bill pays for your classes, the excess amount will be direct deposited back into your account. Works the same for Fasfa",
            "score": 3,
            "author": "pregnantOCTOPUS_",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah but once you fill out your enrollment activity form, your “balance due” is pushed back to the end of the semester (giving the VA time to process all the paperwork). So would the grant money still be applied in this case? I also heard about some some type of form that I can fill out to get my fin aid early since I’m using Chap 33 benefits. Do you know anything about that?",
                    "score": 1,
                    "author": "Lunar_LiOH",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's how it has always worked for me in both ASU and ge Maricopa county college system. And as for requesting the early.. I haven't heard about that or done that. Your question would be better asked to the Patt Tillman center, they can give you the most accurate answers for your situation",
                            "score": 1,
                            "author": "pregnantOCTOPUS_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh that’s weird. Just seems like a waste of grant money when tuition will be covered by the VA anyway. But yeah if no one else replies to this post I’ll just reach out to the PTVC",
                                    "score": 1,
                                    "author": "Lunar_LiOH",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I mean you still get the money back, you just have to wait until your account is paid in full. At the end of the day, ASU is going to make sure they get paid back, so they will apply it to what you owe first, regardless of the VA confirms that they will pay before the end of the semester",
                                            "score": 1,
                                            "author": "pregnantOCTOPUS_",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I just spoke with the PTVC and the form I was talking about is called the “anticipated payment request” form. If I fill that out before the start of each semester then the school will pay out my fin aid early. Thanks for your help anyway!",
                                                    "score": 3,
                                                    "author": "Lunar_LiOH"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I understand what youre asking, make sure you're filling out the [Anticipated Payment Request](https://veterans.asu.edu/forms) form before the semester starts. Normally I do it right after I do my enrollment verification and get it on the posted dates for refunds.",
            "score": 3,
            "author": "PapayaTastesLikePuke",
            "replies": [
                {
                    "level": 1,
                    "comment": "Tysm!",
                    "score": 1,
                    "author": "Lunar_LiOH"
                }
            ]
        }
    ]
}