{
    "id": "fky2ht",
    "score": 495,
    "title": "Am I the only one that never heard of Zoom before last week?",
    "author": "HEADZO",
    "date": 1584568668.0,
    "url": "https://www.reddit.com/r/ASU/comments/fky2ht",
    "media_urls": [
        "https://i.imgur.com/zf907Tk.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Just wait until you have a \"real job\" and your calendar is filled with inane zoom meetings. Think of this as practical experience.",
            "score": 66,
            "author": "thewatusi00",
            "replies": [
                {
                    "level": 1,
                    "comment": "My work is hooked on MS Teams. Gotta have that outlook reminder/notification integration so nobody has an excuse for not knowing about them.",
                    "score": 1,
                    "author": "nbagf",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "We do that but we have Skype, MS Teams, AND Zoom, which are all basically the same program 🤪",
                            "score": 3,
                            "author": "ColdBrew719"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "ASU loves zoom. I’ve only been working for ASU for 8 months and 90% of the time my meetings are on zoom, even if that person is in the same building",
            "score": 60,
            "author": "sum1inphx"
        },
        {
            "level": 0,
            "comment": "Staff here - we have been using it for almost all of our meetings for the past two years to pick up consultants and contractors that can't make it to campus.  Heck I've been on Zoom meetings for executives in different buildings on the same campus.",
            "score": 35,
            "author": "Stevedaveken"
        },
        {
            "level": 0,
            "comment": "Obviously not an ASU Online student posting this.",
            "score": 7,
            "author": "Crow556"
        },
        {
            "level": 0,
            "comment": "Weirdly enough none of my professors are using zoom. We’re pretty much just using Canvas.",
            "score": 2,
            "author": "stainedclassking2",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm a fully online student and my first zoom class is this semester. I'm graduating in May. Most of my professors upload lectures we can watch at our leisure. It works out well!",
                    "score": 3,
                    "author": "look2thecookie",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I have 3 classes that were pushed to online and they pretty much did the same thing. I definitely prefer this",
                            "score": 1,
                            "author": "lava172"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yikes",
                    "score": 0,
                    "author": "CuriousFit"
                }
            ]
        },
        {
            "level": 0,
            "comment": "🤔 🤔",
            "score": 10,
            "author": "TributumFraudisMMXX"
        },
        {
            "level": 0,
            "comment": "Yes u r",
            "score": 9,
            "author": "yoohoooos"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "It costs money otherwise?? I didn’t know this",
                    "score": 2,
                    "author": "CuriousFit"
                },
                {
                    "level": 1,
                    "comment": "Not exactly “free” —Basic Zoom is free but has limited use. ASU pays for more robust features and is the only university in the country with an institution-wide contract with zoom so all faculty, staff &amp; students have access to the features as a licensed user.",
                    "score": 2,
                    "author": "ChaseDaSinger"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Very alone on this one my dude haha",
            "score": 1,
            "author": "look2thecookie"
        }
    ]
}