{
    "id": "hvjtgf",
    "score": 448,
    "title": "What if...",
    "author": "LiterallyCannott",
    "date": 1595379039.0,
    "url": "https://www.reddit.com/r/ASU/comments/hvjtgf",
    "media_urls": [
        "https://i.redd.it/y5c1a3lg3bc51.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "What if🧐teachers recorded lectures🥺👉🏻👈🏻instead of requiring them to be viewed🤗live so students could work full time🥰💵during an economic meltdown🔥💁🏼‍♀️",
            "score": 368,
            "author": "welldamnitjerry",
            "replies": [
                {
                    "level": 1,
                    "comment": "Damn, this one hit right here",
                    "score": 74,
                    "author": "Slight-Escape",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "i had to take a job that was much lower hourly after being laid off and being able to make up the pay cut with more hours wouldve been nice buuuuuuut lol",
                            "score": 35,
                            "author": "welldamnitjerry"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I’m an online student and our lectures are recorded! But I actually don’t like that. They’re usually very out of date and have terrible sound issues. One of my recent classes, the speaker must’ve been filming her voiceovers outside because all I could hear were planes and dog squeaky toy.",
                    "score": 29,
                    "author": "chasing-ennyl"
                },
                {
                    "level": 1,
                    "comment": "i think they might?? (crossing my fingers) i read that anything that is ASUSync must be viewable at anytime because there are international students. So if they decide to do a live zoom lecture at 3pm they have to record and upload it bc that is incredibly unfair to international students that would have to be up at who knows what hour to watch it live \n\nbut maybe not bc they never actually do that 🥰",
                    "score": 7,
                    "author": "anxietyprincesss"
                },
                {
                    "level": 1,
                    "comment": "Right! Is those something we can suggest to professors?",
                    "score": 6,
                    "author": "SpicyRamen1"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 10,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Then they would have to cover your insurance, which they don't want to do.",
                            "score": 6,
                            "author": "TheEmpireStrikesCat",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's my understanding that if an employee works more than 30 hours/week for 120 days, they would be considered a full-time employee under the Affordable Care Act. That would require ASU to offer health benefits to student employees.",
                                            "score": 3,
                                            "author": "TheEmpireStrikesCat",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Also, there are  federal regulations that prohibit students who receive federal aid from working over a certain amount of hours, so in some cases you couldn’t even if it were allowed.",
                                                    "score": 3,
                                                    "author": "never-not-late"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My girlfriends university required all lectures be recorded and uploaded.  Its pretty convenient.",
                    "score": 4,
                    "author": "drock121"
                },
                {
                    "level": 1,
                    "comment": "Wait, you guys have had to watch shit live?",
                    "score": 2,
                    "author": "Shift84"
                },
                {
                    "level": 1,
                    "comment": "The fact that there are instructors that don't allow the Zoom recording of the class to be view afterwards is just mind boggling. It's already recorded and there, just share the damn thing.",
                    "score": 2,
                    "author": "IteachatASU"
                },
                {
                    "level": 1,
                    "comment": "If you're working full time, then you should be signing up as an online student... Then you can do exactly what you're asking to do.",
                    "score": -20,
                    "author": "Saik0Shinigami",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "unfortunately if you are instate it would cost more to become an online student and then you would have to fight tooth and nail to become an on campus student for any remaining years or semesters",
                            "score": 28,
                            "author": "welldamnitjerry"
                        },
                        {
                            "level": 2,
                            "comment": "Not all majors are offered online though.",
                            "score": 14,
                            "author": "tatooines",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "yeah that too. mine isnt!",
                                    "score": 2,
                                    "author": "welldamnitjerry"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I started my degree as an online student and the course selection was garbage. Not all classes are currently offered online",
                            "score": 1,
                            "author": "bking158"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What if Apollo let people out of leases 🥺👉🏼👈🏻",
            "score": 92,
            "author": "PaxEtUnity",
            "replies": [
                {
                    "level": 1,
                    "comment": "Is it even gonna be finished in time? I haven't been watching too closely",
                    "score": 14,
                    "author": "sxnvids",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No clue, I haven’t been in Tempe since before spring break. Hopefully not though because that might allow some leverage in terms of legal action against them to get out of it.",
                            "score": 14,
                            "author": "PaxEtUnity",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I can see the construction from my apartment; they're almost done building it",
                                    "score": 15,
                                    "author": "strongdogs",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "i’ve driven by it and the first floor is still entirely concrete and dirt with walls around it so hopefully they can finish but it’s gonna be close",
                                            "score": 11,
                                            "author": "CrispyPie5222"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It would truly be a kiss to die for",
            "score": 24,
            "author": "PeachyQuxxn"
        },
        {
            "level": 0,
            "comment": "Haha just kidding. Unless...",
            "score": 6,
            "author": "TLP34"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": -11,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Covid shmovid we gotta get to that party 🥺👉👈",
                    "score": 30,
                    "author": "beasterbeaster"
                },
                {
                    "level": 1,
                    "comment": "what dude insane observation",
                    "score": 2,
                    "author": "HandicappedWeeb"
                }
            ]
        }
    ]
}