{
    "id": "kveend",
    "score": 582,
    "title": "happened to me this morning",
    "author": "LordUrkelTheGreat",
    "date": 1610405851.0,
    "url": "https://www.reddit.com/r/ASU/comments/kveend",
    "media_urls": [
        "https://i.redd.it/greu5kyv9sa61.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "This morning I joined first and became the host :/ Lol",
            "score": 75,
            "author": "SuggestionStrange408",
            "replies": [
                {
                    "level": 1,
                    "comment": "Under ASU policy, you are now obligated to teach the class",
                    "score": 13,
                    "author": "iankenna",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I should have done everyone a favor and ended meeting for all",
                            "score": 8,
                            "author": "SuggestionStrange408"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "There's some glitch or something with Zoom that even if you have it set so people can't join until the owner joins, people can still join. I don't know if it's because I use my personal room code or what, but there's no settings that have worked to make sure I'm first in my rooms.",
                    "score": 7,
                    "author": "IteachatASU",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ah I see. Nevertheless, I remained host the entire meeting with my professor as co-host 😎",
                            "score": 10,
                            "author": "SuggestionStrange408",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's pretty funny, they must have use a class specific meeting number instead of their personal room. Which is probably a smarter way to do it, but I'm lucky I can get zoom to half do what I want, so personal room it is. Generally, if the room has it's own zoom it will be co-host but if I leave first then it takes over and if I want to have that leave the meeting then I have to make a student the host or just log back in.",
                                    "score": 3,
                                    "author": "IteachatASU"
                                },
                                {
                                    "level": 3,
                                    "comment": "How much do you get paid for this?",
                                    "score": 1,
                                    "author": "gretchsunny"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Did you make that face at people as they entered?",
                    "score": 1,
                    "author": "Negrodamu5",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Closer to 😬",
                            "score": 1,
                            "author": "SuggestionStrange408"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I missed my first lecture. I sent an email to my professor and he said \"way to manage expectations\"",
            "score": 23,
            "author": "gsells937",
            "replies": [
                {
                    "level": 1,
                    "comment": "LMAO",
                    "score": 3,
                    "author": "Boom_Chicken321"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I've been online at ASU since the beginning of my degree, before covid. My heart goes out to all of you who have to attend zoom lectures; asynchronous class on my own time is all that makes distance learning bearable.",
            "score": 25,
            "author": "Lobobster"
        },
        {
            "level": 0,
            "comment": "Just gave me a flashback to a review session that I jumped on. It was just me and the teacher.  After like 5 seconds I left and didn't come back.  I get embarrassed just thinking about this.",
            "score": 22,
            "author": "plantmom77",
            "replies": [
                {
                    "level": 1,
                    "comment": "Trust me, it's just as awkward on our side, but don't worry about it. When you join a room just make sure you're muted and your facecam is off. Then once class starts you can turn your cam on if required. If I'm in class extra early I mute my facecam as well. \n\nConversely. Use a funny background/dress in a costume or something and I will die laughing, which is great at breaking the tension.",
                    "score": 13,
                    "author": "IteachatASU"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is why I always sign in one or two minutes late lol",
            "score": 9,
            "author": "_irunwithscissors"
        },
        {
            "level": 0,
            "comment": "I had a couple breakout sessions today and they were so awkward. Nobody had their cameras on or spoke and I wanted to but I felt too awkward to do anything",
            "score": 6,
            "author": "b00psn00ts"
        },
        {
            "level": 0,
            "comment": "LMAOOO that's why I wait until the last sexond to join",
            "score": 1,
            "author": "gracelisicki"
        },
        {
            "level": 0,
            "comment": "I don’t have any zoom classes!☹️",
            "score": 1,
            "author": "maddykopitar",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 4,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They are all online. We just watch videos😕",
                            "score": 1,
                            "author": "maddykopitar",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 2,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I really wish my classes were done live. I feel like I learn more when it’s done that way.",
                                            "score": 1,
                                            "author": "maddykopitar"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}