{
    "id": "yjinlo",
    "score": 655,
    "title": "saw this on campus today, pls take them down if you see them",
    "author": "firenationfairy",
    "date": 1667331059.0,
    "url": "https://www.reddit.com/r/ASU/comments/yjinlo",
    "media_urls": [
        "https://i.redd.it/u46c8fqq5ex91.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Awful. Thanks for the heads up",
            "score": 169,
            "author": "jacobs1113",
            "replies": [
                {
                    "level": 1,
                    "comment": "OP printed and placed it there",
                    "score": -12,
                    "author": "JonStowe1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You're not a smart person",
                            "score": 6,
                            "author": "YoureNotSpecialLol"
                        },
                        {
                            "level": 2,
                            "comment": "Most sane Kanye fan.",
                            "score": 2,
                            "author": "Donovan_Wilson_GOAT"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Geeezzuuuss. Nazi punks fuck off!",
            "score": 85,
            "author": "RobotSeaTurtle"
        },
        {
            "level": 0,
            "comment": "If these are anything like the stickers you see around be careful taking them off. Sometimes people hide razor blades underneath them.",
            "score": 100,
            "author": "Syranth",
            "replies": [
                {
                    "level": 1,
                    "comment": "You can lightly rub your hand across the poster to check if any part is raised! If yes, or just to be doubly cautious, a pen/pencil/marker/folder is good at lifting this bullshit off.",
                    "score": 16,
                    "author": "samonella1"
                },
                {
                    "level": 1,
                    "comment": "jesus christ wtf",
                    "score": 47,
                    "author": "yungbaddreamer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Your post has been automatically removed due to inappropriate slurs.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ASU) if you have any questions or concerns.*",
                                    "score": 1,
                                    "author": "AutoModerator"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "i checked before i took it off bc i was worried about that",
                    "score": 33,
                    "author": "firenationfairy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You should probably alert the police before removing",
                            "score": 1,
                            "author": "scamthescamers",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Police can’t do anything. Them taking it down would be a violation of free speech. \n\nIt’s the wrong speech, but nonetheless",
                                    "score": 7,
                                    "author": "ovr9000storks",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "So I can come into your house a post a sign and you can't remove because it's a violation of free speech?",
                                            "score": -4,
                                            "author": "scamthescamers",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "No I can because I’m not a government entity. Plus at that point it would be trespassing, possibly breaking and entering anyways. \n\nIt’s the same reason Twitter, Facebook, and the likes can remove your posts for whatever they feel like as long as it stays true to their terms of service agreement, political or not. They are not government entities. They are free companies that may govern their product/service as they please",
                                                    "score": 12,
                                                    "author": "ovr9000storks",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Oh so you think ASU put the flyer on their own news stand?",
                                                            "score": -5,
                                                            "author": "scamthescamers",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "What are you talking about? If you’re talking about in regards to littering, they would have to get approval from ASU directly in that case, and probably be forced to take down all posters that aren’t posted by ASU. \n\nWhy are you so defensive about this? All I’m saying is the police are not the ones who are able to do this. Even if they got permission, they would need to place a good team of 4-5 officers to just stroll around campus ripping down posters. They would rather put those officers in better places, not to mention it would stir up a very odd sight to see government workers ripping down posters everywhere",
                                                                    "score": 7,
                                                                    "author": "ovr9000storks",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Glad we agree now removing the poster is not a violation of free speech",
                                                                            "score": -2,
                                                                            "author": "scamthescamers",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Let’s lay out the facts here.\n\n-Police are a government entity \n\n-ASU is a privately owned institution \n\n-If police remove posters on private property with no instruction from the institution to do so, it’s a violation of free speech\n\n-If they are directly told by the institution it is litter, they would probably have the right to remove it (not really all that sure, but seems logical)\n\n-The police department has no direct concern about cleaning up litter\n\n-Police should be involved if a situation is about to, or already is causing direct harm to citizens\n\n-It would be much easier for ASU (if they cared about this stuff) to hire a team of their own faculty to go around cleaning it up instead\n\nThere, now that that’s out of the way, why do police need to be involved?",
                                                                                    "score": 5,
                                                                                    "author": "ovr9000storks",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "ASU is a public school. Therefore it's an open form for all viewpoints. They cannot start removing pro anything or anti anything view points or they have to remove them all. Any public space is free game. People really need to start understanding the difference between commercial, public, and private. If I own something then you have no right to do anything on it I have the rights (private). If I own something that is providing a service or monetary gain and need licensing from the government. I can run it as I see fit to a certain point, see Americans with disability act, civil Rights act ect (commercial).  If we as a society own something we all have the rights to it (public).",
                                                                    "score": 1,
                                                                    "author": "real__pale",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "You should take the school to the Supreme Court\n\nhttps://www.google.com/amp/s/www.12news.com/amp/article/news/local/valley/asu-investigating-anti-semitic-posters-nov-2021/75-f9c64f5d-df54-4cf5-839c-5ad4703132e9",
                                                                            "score": -1,
                                                                            "author": "scamthescamers"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Alert the police to what? No crime has been committed. In this country you HAVE the right to say stupid hurtful shit. YOU also have the right to ignore it. Be kind every day! But NO speech should ever be limited for if the people in charge are the hateful WE will need the inalienable protection of our constitution.",
                                    "score": 3,
                                    "author": "real__pale"
                                },
                                {
                                    "level": 3,
                                    "comment": "He's the one who put it there lmao.",
                                    "score": -2,
                                    "author": "bonejohnson8",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Why do you think this is unlikely to be true? Do you have any evidence?",
                                            "score": 3,
                                            "author": "Han-Shot_1st",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "A few hints make me suspicious. One copy. OP took it down without reporting it. Nobody else saw any of them. Printed on a home printer with full color so unlikely to have been mass produced. \n\nJust cries foul to me. Nazis would usually include some sort of links or something for more info. This is just for attention.",
                                                    "score": -3,
                                                    "author": "bonejohnson8",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "So you have “feeling” it’s fake. Got it 👍",
                                                            "score": 3,
                                                            "author": "Han-Shot_1st"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m so fkin disgusted and disappointed. Ty for sharin.",
            "score": 87,
            "author": "deathcab4qts"
        },
        {
            "level": 0,
            "comment": "What the actual hell is wrong with people? Does any one know where this is and whether or not it’s been reported ?",
            "score": 29,
            "author": "Rich-Cantaloupe-6312",
            "replies": [
                {
                    "level": 1,
                    "comment": "Why would OP report self",
                    "score": -5,
                    "author": "bonejohnson8",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How'd you draw that conclusion? Why would op put the effort to go into shit they are vehemently against",
                            "score": 8,
                            "author": "IndycarFan64",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ask Jussie Smollett",
                                    "score": -5,
                                    "author": "bonejohnson8",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "One guy did a false flag and now everything is a false flag, brilliant critical thinking here. Nothing real ever happens in the world, you truly have it all figured out",
                                            "score": 7,
                                            "author": "Nervewing",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Find me another person who saw it on campus, because it seems a little suspiciously isolated and without witness.",
                                                    "score": -1,
                                                    "author": "bonejohnson8"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That’s completely fucked. Thanks for the heads up",
            "score": 35,
            "author": "Coolman38321"
        },
        {
            "level": 0,
            "comment": "This is horrific. Hopefully I catch the person hanging these because that's 🤢🤢",
            "score": 69,
            "author": "mangoimoi",
            "replies": [
                {
                    "level": 1,
                    "comment": "[ Removed by Reddit ]",
                    "score": 43,
                    "author": "DEETDEET47",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 4,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "One of your recent posts or comments was determined to be uncivil by one or more of our moderators.",
                                    "score": 1,
                                    "author": "ASU-ModTeam"
                                },
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": -7,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "One of your recent posts or comments failed to address any ASU-related topics or didn't add to any discussion concerning ASU.",
                                            "score": 0,
                                            "author": "ASU-ModTeam"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That's horrific",
            "score": 10,
            "author": "PheobusThePlant"
        },
        {
            "level": 0,
            "comment": "Sickening, i'll keep an eye out thank you for sharing",
            "score": 8,
            "author": "OppositeOdd9103"
        },
        {
            "level": 0,
            "comment": "it's sad how much effort people put into hating other people and trying to get a reaction out of them",
            "score": 63,
            "author": "Possible-Advance3871",
            "replies": [
                {
                    "level": 1,
                    "comment": "this isn't even trying to get a reaction like some edgy 12 year old saying the n word. These people legitimately hate jews it's terrible.",
                    "score": 43,
                    "author": "Immediate-Load-6095"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I went to ASU when it was a party school (no idea if it still is) but that wasn't acceptable when it was one, it's not now.",
            "score": 9,
            "author": "Accomplished-Fruit83"
        },
        {
            "level": 0,
            "comment": "Imagine the cowardly incel who’s going around putting these up… pathetic",
            "score": 47,
            "author": "Zahn91",
            "replies": [
                {
                    "level": 1,
                    "comment": "Antisemite* not incel. Obviously.",
                    "score": 9,
                    "author": "thelifeofcarti"
                },
                {
                    "level": 1,
                    "comment": "I dont think you know what the definition of an incel is",
                    "score": -1,
                    "author": "ZakWhatTheFak",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lol sure buddy whatever you say.",
                            "score": 2,
                            "author": "Zahn91"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": -16,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Are you the one putting these up???",
                            "score": 7,
                            "author": "samonella1"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wtf",
            "score": 6,
            "author": "Junior-Slide-9639"
        },
        {
            "level": 0,
            "comment": "Wtf?!",
            "score": 6,
            "author": "romanapplesauce"
        },
        {
            "level": 0,
            "comment": "Could you share where this was?",
            "score": 6,
            "author": "Madacatta",
            "replies": [
                {
                    "level": 1,
                    "comment": "Looks like it’s outside of the Student Services Building.",
                    "score": 11,
                    "author": "isthatweird"
                }
            ]
        },
        {
            "level": 0,
            "comment": "4chan is leaking again.",
            "score": 9,
            "author": "DataMasseuse"
        },
        {
            "level": 0,
            "comment": "fuck those idiots",
            "score": 10,
            "author": "MifflerTripod"
        },
        {
            "level": 0,
            "comment": "Where exactly was this posted? :(",
            "score": 3,
            "author": "Chbirabbek"
        },
        {
            "level": 0,
            "comment": "absolutely awful shit jfc. i bet its a conservative club doing this too.",
            "score": 54,
            "author": "Immediate-Load-6095",
            "replies": [
                {
                    "level": 1,
                    "comment": "most likely CRU (college republicans united). I wouldn’t put it past them, they’ve done some awful stuff in the past",
                    "score": 56,
                    "author": "Hayasaka-Fan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Looks like this might be the annual CRU-caught-being-racist incident. An interesting change from the usual group DM leaks.",
                            "score": 14,
                            "author": "CaptainofChaos"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I bet a Kari Lake supporter did this.",
            "score": 42,
            "author": "RelevantDay4",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well she is a Buddhist. They are notorious for hating Jews /s",
                    "score": -59,
                    "author": "Andaelas",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 13,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I agree, OP's attempt to paint all supporters of a Buddhist political candidate is tasteless.",
                                    "score": -46,
                                    "author": "Andaelas"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You... Wtf",
            "score": 3,
            "author": "RequirementRequired"
        },
        {
            "level": 0,
            "comment": "wrong on so many levels. Am Yisrael Chai",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Free Palestine",
            "score": -22,
            "author": "No-Neighborhood1784",
            "replies": [
                {
                    "level": 1,
                    "comment": "Jewish people ≠ The Israeli government",
                    "score": 11,
                    "author": "swimmingincircIes",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Shhh they can’t think critically",
                            "score": 4,
                            "author": "Xorilla"
                        },
                        {
                            "level": 2,
                            "comment": "Shhh they can’t think critically",
                            "score": 1,
                            "author": "Xorilla"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": -41,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "i thought about that too, wasn’t sure what to do so i posted it. thanks for your opinion tho sorry ab the downvotes",
                    "score": 8,
                    "author": "firenationfairy"
                },
                {
                    "level": 1,
                    "comment": "It's much better to contextualize it this way than to ignore it or speak about it in hushed voices. Otherwise, the only context is the crazy conspiracy rhetoric, and, even in front of a small audience, we've seen that this stuff doesn't die in the dark.\n\nLeverage capitalism and make these ideologies financially and socially destructive to those who spread them by bringing it to light.",
                    "score": 17,
                    "author": "ThreatOfFire",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": -9,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If you think about it memetically, a generalized description leaves a lot more room for mutation as it goes from person to person, and opens the door for the \"it may not be that bad\" knee-jerk reaction that often muddies the discussion in favor of trying to further personal understanding.\n\nGiving the tangible image doesn't make it valid or true. And, again, hiding any aspect of it doesn't kill it off. It's important to contextualize it and show solidarity that it's not acceptable, but being afraid of showing it makes that very difficult to do.",
                                    "score": 7,
                                    "author": "ThreatOfFire"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Looks like someone is trolling.",
            "score": -34,
            "author": "GrampaSquidz",
            "replies": [
                {
                    "level": 1,
                    "comment": "You say that, but I've met people on campus who unironically believe this type of shit....",
                    "score": 24,
                    "author": "RobotSeaTurtle"
                }
            ]
        },
        {
            "level": 0,
            "comment": "OP printed this and put it there. \n\n/u/jonstowe1",
            "score": -1,
            "author": "bonejohnson8",
            "replies": [
                {
                    "level": 1,
                    "comment": "yes 100% \n\nthis is bait",
                    "score": -3,
                    "author": "JonStowe1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is like a Fanny joke but on Kanye.",
                            "score": -1,
                            "author": "bonejohnson8"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Your post has been automatically removed due to inappropriate slurs.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ASU) if you have any questions or concerns.*",
                    "score": 1,
                    "author": "AutoModerator"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you can't at least try to CONVINCE ME you insult me",
            "score": 1,
            "author": "YikesDawg_",
            "replies": [
                {
                    "level": 1,
                    "comment": "Also this is just blatantly stupid. U can't have satanic Jews. How tf you gonna worship God and Satan bruh",
                    "score": 2,
                    "author": "YikesDawg_"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "r/ASU enforces a requirement that all accounts must meet a minimum account age and karma threshold before they are able to post to this subreddit. This is in place to prevent bot/troll accounts. **There are no exceptions to this rule. Do not message the mod mail regarding account age or minimum karma removals.**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ASU) if you have any questions or concerns.*",
                    "score": 1,
                    "author": "AutoModerator"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Problem is that if we take them down you feed into their narrative that the big government or whatever else wants to silence them, do what you want, but know the outcome",
            "score": -18,
            "author": "WoodpeckerFamous",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wtf are you talking about LMAO! Citizens taking shit down isn’t big government. Schools aren’t big government.\n\nYou really just tried to make shit up to excuse this.",
                    "score": 5,
                    "author": "FordMaverickCubby"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -19,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Found them",
                    "score": 8,
                    "author": "ShinigamiLeaf"
                },
                {
                    "level": 1,
                    "comment": "Because they've met any number of the millions of Jews around the world who are just regular people? They're not some secretive cabal of a few dozen evil masterminds controlling the world. They're regular fucking people like you or me. When you attack and demean Jewish people as evil, corrupt, untrustworthy, etc., you're not hurting the few who have power and influence, you're hurting the overwhelming majority who don't, who have to drive to their regular 9-5 job and see people doing Nazi salutes over the freeway, who see posters and graffiti from their own neighbors labeling them as evil, who have to question whether it's even safe for them to go to their place of worship without getting shot or stabbed. This is exactly the type of rhetoric that led to the brutal, systematic slaughter of over half of Europe's Jewish population in the 1930s and '40s.",
                    "score": 3,
                    "author": "U_R_A_BoldOne"
                },
                {
                    "level": 1,
                    "comment": "White people literally own MORE media and banking companies.\n\nNow what do you have to say?",
                    "score": 1,
                    "author": "FordMaverickCubby",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "most jewish people are white (at least in america)",
                            "score": 1,
                            "author": "leodonaldson",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No they’re not lol",
                                    "score": 1,
                                    "author": "AggravatingPotatoe"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Isn’t that an oxymoron though",
            "score": -9,
            "author": "anartsydrummer",
            "replies": [
                {
                    "level": 1,
                    "comment": "Can’t believe people like you exist.\n\nGoing to start doxxing idiots on my lunch break. Enjoy the phone call.",
                    "score": 0,
                    "author": "FordMaverickCubby"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Honestly if this is anything like the other acts of hate speech vandalism lately I think this is a hoax idk. No proof so probably best not to assume it is but it just feels a bit too blatant to be real.",
            "score": -2,
            "author": "Monkeymanvao"
        },
        {
            "level": 0,
            "comment": "I’m not gonna guess who did it, but you already know who it’s...",
            "score": -1,
            "author": "Thekidfromthegutterr"
        },
        {
            "level": 0,
            "comment": "Graphic design is my passion",
            "score": 0,
            "author": "usernumberzero"
        },
        {
            "level": 0,
            "comment": "holy shit wtf? i thought AZ was better than this. well i cant expect much ive been racially profiled just for walking with spray paint because they thought i was gonna do some devious shit and called me several racial slurs. so yeah fuck america nvm why am i surprised",
            "score": 0,
            "author": "doclout"
        }
    ]
}