{
    "id": "12mfau9",
    "score": 4,
    "title": "How long is everyone’s commute?",
    "author": "throwaway-4728372",
    "date": 1681509922.0,
    "url": "https://www.reddit.com/r/csuci/comments/12mfau9",
    "media_urls": [],
    "other_urls": [],
    "postText": "This is my top choice to transfer and it wouldn’t be until fall 2024 but I wanted to see what other people’s commutes are like? If admitted I don’t really anticipate spending money on housing so I’d stay at home which is a 40 minute commute",
    "comments": [
        {
            "level": 0,
            "comment": "I live on campus but home is around an hour away.",
            "score": 10,
            "author": "matt_Nooble12_XBL"
        },
        {
            "level": 0,
            "comment": "40 minutes, northern part of Oxnard near the 101 freeway. Add an extra 10 minutes for finding parking and walking to class.",
            "score": 6,
            "author": "Playahcenati0n"
        },
        {
            "level": 0,
            "comment": "For me coming from The Valley it is an hour on a good day but could be an hour plus with traffic added on-top, one way. Hope to stay on campus or find roommates nearby.",
            "score": 5,
            "author": "Remote_Session8255"
        },
        {
            "level": 0,
            "comment": "I’m also in the sf valley so it takes an hour… drive isn’t as bad when you have a friend you’re carpooling with",
            "score": 3,
            "author": "pimpcess_vee"
        },
        {
            "level": 0,
            "comment": "i do 40-60 min commute! i really got used to it and eventually found it peaceful, definitely give yourself time for finding parking as well!!",
            "score": 1,
            "author": "PuzzleheadedSpeed276"
        },
        {
            "level": 0,
            "comment": "I live in port hueneme and my drive about 15 to 20 min. Depending on traffic or bad drivers.",
            "score": 2,
            "author": "One-Distribution1415"
        },
        {
            "level": 0,
            "comment": "45-59mins",
            "score": 1,
            "author": "steppenwolf_23"
        },
        {
            "level": 0,
            "comment": "15 min, I live in Ventura",
            "score": 1,
            "author": "UntiedStatMarinCrops"
        },
        {
            "level": 0,
            "comment": "I'm about an hour away, but I take the train there and back.",
            "score": 1,
            "author": "Quickdraw92"
        },
        {
            "level": 0,
            "comment": "10-20 minute drive depending on traffic and construction. \n\nHour bike ride cause not as in shape.",
            "score": 1,
            "author": "jelly_bee"
        },
        {
            "level": 0,
            "comment": "I live in Camarillo so getting onto campus is about 15 minutes for me. Last semester, I went to CSUN and my commute was about 45 minutes. Ended up transferring bc I personally couldn’t do the drive every day. A lot of people do it though but it’s just not for me",
            "score": 1,
            "author": "electricsunflower0"
        },
        {
            "level": 0,
            "comment": "SB so on average ~1 hr",
            "score": 1,
            "author": "teamseshollowaterboy"
        },
        {
            "level": 0,
            "comment": "Im from South Oxnard and it takes me 15 mins to get to school on the 1 and hueneme road. Parking times however can vary depending on when you get there",
            "score": 1,
            "author": "SmokeAlarm10"
        }
    ]
}