{
    "id": "794fw0",
    "score": 3,
    "title": "Probably spring transfer with a couple questions",
    "author": "[deleted]",
    "date": 1509123093.0,
    "url": "https://www.reddit.com/r/csuci/comments/794fw0",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello, I accepted my invitation for the spring 18 semester, transferring from LAHC. \n\nAnyways I had some questions about campus life and how it flows.\n\n1) dorm life: what's it like? Is it the hot sweaty smelly mess i picture? As a transfer I'm going to be 22 there so I'll be older, is it worth it to live on campus or is it cheaper to get a roommate or two for an apartment? How much is student housing anyway? How much is a typical apartment out there?\n\n2) leftist danger: is there any antifa presence or any other group like that that seeks to cause destruction and harm to those with opposing views? I've seen the footage from other campuses and was wondering if CSUCI was a hotbed for any kind of group I'd rather stay away from. \n\n2)romantic life: What are the girls like there? What are they into? What's a typical CSUCI lady looking for? A chad, a hypebeast, a well tailored suit, a hipster, grunge? I can be anything they want lv just wondering what to keep in mind. \n\n3) social life: how do people even make friends at CSUCI? Is there Greek life? What are good clubs for meeting people? Or for meeting potential SO's. Anything helps I guess. \n\nSo yeah that's about it, if y'all have any other tips let me know, I'm planning on driving up from LA to visit the school next week to check out the place (and the outlet mall of course) so yeah let me know and if anyone could show me and my friends around I'll buy them lunch lol ",
    "comments": [
        {
            "level": 0,
            "comment": "Hey there, CI alumn here, still closely associated with the campus so I'm happy to help provide any info I can. \n\n1) dorm life is slightly nicer than other campuses I've been to. There are traditional style dorms for freshmen, but transfers and upperclassmen are typically provided apartment style accommodations. The pricing varies depending on your room situation but you view rates at CSUCI.edu/housing \n\nSince you're older you might want to look at off campus options if you plan on partying and really getting \"the college experience\" but if you're just trying to get your degree and get out then it might be nice to be on campus since commuting can be kind of a bitch. \n\n2) while there aren't any far left groups on campus it is a pretty liberal environment. There has been a few marches and peaceful gatherings of students but nothing violent or aggressive. \n\n3) the ratio of women to men is like is something like 3 to 1, so my advice is to be yourself. Your odds of finding someone you're campitable with are decent. \n\n4) there are a lot of clubs and organizations on campus you can join to meet people with similar interests. If you live in housing then you'll probably be living with/near other transfers and people close in age to you. Greek life is growing, but right now I think there's only one established frat and a few sororities. The former president wasn't a fan of the fraternity scene but it's something students have really been pushing for with the new administration. I expect it to really get going within the next two years. \n\nIf you're going to be in the area you can contact admissions and see if there's anyone that can provide a tour. \n\nBest of luck! ",
            "score": 1,
            "author": "danisaurrrr"
        }
    ]
}