{
    "id": "af3z6w",
    "score": 5,
    "title": "Anyone up for joining me in picketing with the LAUSD teachers? Also, other ways to show support.",
    "author": "ThisIsMyRental",
    "date": 1547267793.0,
    "url": "https://www.reddit.com/r/csuci/comments/af3z6w",
    "media_urls": [
        "https://www.reddit.com/r/csuci/comments/af3z6w/anyone_up_for_joining_me_in_picketing_with_the/"
    ],
    "other_urls": [
        "https://wearepublicschools.org/strike-watch/),"
    ],
    "postText": "Hi, everyone. So as of tonight it appears that the LAUSD teachers' strike will in fact be happening starting Mon, Jan. 14th. I feel for the teachers, the LAUSD students, and the parents of these kids because the teachers are having lots of issues with the district overcrowding classrooms, not updating textbooks and other materials, and allowing charter schools to take up LAUSD classrooms even if they don't end up paying their promised rent to the LAUSD. \n\nI wanted to help support the strike and the students/parents affected by it (especially since 80% of LAUSD students are eligible for free/reduced-price meals), so I asked on the LA sub to see what they needed help with.\n\nApparently the best ways for people who live outside LA to help with this strike is to 1) [donate for food, etc. somewhere on this website](https://wearepublicschools.org/strike-watch/), 2) call businesses near LAUSD school sites and see if they're OK with strikers coming in to use their restrooms, and most importantly 3) actually physically join the picket lines themselves.\n\nI'm an unemployed college student (I go to CSUCI, which doesn't start again until the 22nd) living in Camarillo who can't drive, so the thought of going to and from somewhere in LA using public transit alone is VERY daunting for me. I actually have a lot of doubts my parents will be okay with me doing this, since they've already vetoed the idea of me taking public transit to visit my cousin in West Hollywood on a sunny day.\n\nAnyone here with the time and resources to form a public-transit group with me (I don't feel comfortable taking private transportation with total strangers, especially going to a big city like LA) so we can join the pickets? Or even just tips for taking public transit into LA from Camarillo to join the strikers?\n\nI'm also posting this question in as many of the other Ventura County county, city and school subs as I can. On top of that I'm probably making a FB group and doing SOMETHING through Twitter as well.",
    "comments": []
}