{
    "id": "tssqdf",
    "score": 8,
    "title": "Pros/Cons of CI?",
    "author": "ImpressiveAd65",
    "date": 1648704596.0,
    "url": "https://www.reddit.com/r/csuci/comments/tssqdf",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey! I'm a senior and looking into Channel Islands! Can y'all tell me the top things you like about this school, and the cons? My biggest values are a college where people are nice, there's good student life, a lot of people living in the dorms, good classes, and a good study abroad program!",
    "comments": [
        {
            "level": 0,
            "comment": "Hi there, \n\npros:\n\n- smaller class sizes\n\n- faculty who care (in my experience)\n\n- smaller campus so you won't need your car often\n\n- relatively cleaner air\n\n- close to the beach\n\n- strong special interest clubs/organizations\n\ncons:\n\n- most people keep to themselves, no real community outside of clubs\n\n- we are in farmland so a car is required to go off campus\n\n- lack of food options on campus\n\n- i sort of feel like there is a general lack of school pride\n\n- lack of sports on campus \n\nthese might be good or bad depending on who you are:\n\n- campus is overwhelmingly female (66% female)\n\n- majority of the campus is White (54%) and Latino (27%) so roughly 19% is everyone else \n\n- our campus is mainly older buildings, using Spanish style architecture (also probably haunted if you are into that)\n\n- quieter campus, less noise more often\n\n- you have to actively look for people to be friends with.",
            "score": 10,
            "author": "DormDeed_79",
            "replies": [
                {
                    "level": 1,
                    "comment": "Another pro, along with faculty, there's staff willing to help. This helps even after graduation.\n\nNot sure they're cons\n\nThe community is there if you find it.\n\nThere is food options on campus. Not sure if towncenter is still like a grocery store. In casé you don't wanna eat at pizza pie, island cafe, lighthouse, freudian sip, tortillas, all the time.\n\nThe pride is there. It's just shown different.\n\nThere's club and intramural. Having the sports you want would jack off tuition.\n\nGood or bad\n\nIf you're looking for a girl, you should be alright.\n\nThe haunted part can create convos.\n\nOnce you find friends, hang on to them.",
                    "score": 1,
                    "author": "Extension_Penalty374"
                }
            ]
        },
        {
            "level": 0,
            "comment": "There is no prominent student social life but people are generally nice. Anyone is open to conversation for the most part but typically no one goes up to you to talk. There are a lot of people in dorms though, and that's where most of the student life resides. The classes are solid and the professors are understanding, kind, and intelligent; to be fair though I only choose the favored professors from [ratemyprofessor.com](https://ratemyprofessor.com). Lastly, the transfer program has a lot of options and information, so I'd say it's solid as well.",
            "score": 2,
            "author": "david_lozano805"
        },
        {
            "level": 0,
            "comment": "I plan on attending CSUCI 2023. I read the other comments and I would still like to go.",
            "score": 2,
            "author": "makeouthill2nd",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;ost people keep to themselves, no real community outside of clubs  \n&gt;  \n&gt;we are in farmland so a car is required to go off campus  \n&gt;  \n&gt;lack of food options on campus  \n&gt;  \n&gt;i sort of feel like there is a general lack of school pride  \n&gt;  \n&gt;lack of sports on campus\n\nRemember to submit intent to enroll by May 1!",
                    "score": 2,
                    "author": "ImpressiveAd65"
                },
                {
                    "level": 1,
                    "comment": "I’m planning on attending fall 2023 as well!",
                    "score": 1,
                    "author": "ThaHotChocolate"
                }
            ]
        }
    ]
}