{
    "id": "x6ggyv",
    "score": 5,
    "title": "Mountain Lion Sighting",
    "author": "YabbaYabbaDooo",
    "date": 1662385169.0,
    "url": "https://www.reddit.com/r/csuci/comments/x6ggyv",
    "media_urls": [],
    "other_urls": [],
    "postText": "FWD: A message from CSU Channel Islands\n\nA California Mountain Lion who lives in the nearby Santa Monica Mountains was seen by several diferent people this evening on the main part of the campus near the A3 Parking Lot footbridge at El Dorrado Park and in Big Rock Park near Camarillo Street and Rincon Drive. The last sighting was at approximately 9:28 p.m. near the A3 Parking Lot.\n\nMore than half of California is mountain lion habitat and mountain lions generally exist wherever deer are found. They are solitary and elusive, and their nature is to avoid humans. Mountain lions primarily eat deer, but, if allowed, they will prey on vulnerable pets and livestock.\n\nThe following safety information is a compilation taken from wildlife managers, wildlife officers and scientists that study mountain lion behavior. Although no strategy in the event of an encounter is guaranteed to be successful in every situation, these tips will help keep you safe.\n\nDo not hike, bike, or jog alone. Stay alert on trails.\n\nAvoid hiking or jogging when mountain lions are most active – dawn, dusk, and at night.\n\nKeep a close watch on small children.\n\nOff leash dogs on trails are at increased risk of becoming prey for a mountain lion.\n\nNever approach a mountain lion. Give them an escape route.\n\nDO NOT RUN. Stay calm. Running may trigger chase, catch and kill response. Do not turn your back. Face the animal, make noise and try to look bigger by waving your arms, or opening your jacket if wearing one; throw rocks or other objects. Pick up small children.\n\nDo not crouch down or bend over. Squatting puts you in a vulnerable position of appearing much like a 4-legged prey animal.\n\nBe vocal; however, speak calmly and do not use high pitched tones or high pitch screams. \n\nTeach others how to behave during an encounter. Anyone who runs may initiate an attack.\n\nIf a lion attacks, fight back. Research on mountain lion attacks suggests that many potential victims have fought back successfully with rocks, sticks, garden tools, even an ink pen or bare hands. Try to stay on your feet. If knocked down, try to protect head and neck.  If a mountain lion attacks a person, immediately call 911.",
    "comments": []
}