{
    "id": "145idk8",
    "score": 402,
    "title": "No one was allowed to smoke, yet everyone did: my oldest sister's wedding in 1984",
    "author": "cherryisback",
    "date": 1686348489.0,
    "url": "https://www.reddit.com/r/OldSchoolCool/comments/145idk8",
    "media_urls": [
        "https://i.redd.it/yedc12yuf25b1.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Everyone was allowed to smoke in 1984, and most of us did",
            "score": 72,
            "author": "Bewildered_Beaver",
            "replies": [
                {
                    "level": 1,
                    "comment": "It was the 70s, but one of my favorite scenes in The Exorcist is when the doctor is talking to the mother in the hospital while he smokes a cigarette lol.",
                    "score": 23,
                    "author": "CRSRep",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I remember working with someone who told me she remembered smoking behind the desk in the hospitals.  It was so trippy to discuss.  I definitely remember sitting in the smoking sections in restaurants with my parents. good times man hahaha",
                            "score": 6,
                            "author": "WifeAggro",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I was working at the front desk at a doctor's office at the end of 80s/early 90s and we had a shared ashtray for patients and personnel directly at the desk",
                                    "score": 1,
                                    "author": "pm_me_all_ur_money"
                                },
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "yea i always thought it was hilarious too. thr half walls. Even as a child i knew it was pointless.",
                                            "score": 0,
                                            "author": "WifeAggro"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You weren't supposed to smoke in government buildings, including the community spaces/houses of culture (where a lot of wedding receptions happened). Nobody cared enough to enforce it most of the time though",
                    "score": 9,
                    "author": "cherryisback",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I didn't spend a lot of time in government buildings in ‘84. But I remember smoking in the hallway between classes in college. And in movie theaters. And in restaurants. And at the grocery store. And in the hospital. And on airplanes... \n\nI don't remember anybody ever telling me to put it out, ever. Don't even remember seeing a NO SMOKING sign anywhere.",
                            "score": 25,
                            "author": "Bewildered_Beaver",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I know!  Now, I walk through a parking lot, and I'm genuinely surprised to smell cigarettes when people drive past.  Not sure how they afford it, some of them.",
                                    "score": 15,
                                    "author": "hmmm_thought_pig",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I once had a guy randomly beg me for a cigarette at a train station. When I said I didn't have any he was like, \"F***, no one even smokes anymore!\"\n\nSomehow I didn't consider it the tragedy he did. Did feel bad for him with his addiction, though. He obviously had a bad case of it.",
                                            "score": 4,
                                            "author": "genomerain",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt;I once had a guy randomly beg me for a cigarette\n\nIt was probably me",
                                                    "score": 3,
                                                    "author": "Bewildered_Beaver"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "A couple years ago I took the kid and some of her friends to Disney Land/California Adventure. I would usually hang out with them in line when the pass/scheduling scheme didn't work out quite right and then while they were on the ride I would dodge out for a cigarette. I had thought the little areas with benches and trash cans were designated smoking areas and every once in awhile someone would join me which only reinforced my belief.\n\nTurns out I am just an absolute asshole and not once did anyone say anything to me about any of it. The kids even knew better and just assumed I didn't care.\n\nAnyway, no \"no smoking signs\" and people too polite to run us off for smoking doesn't always mean what we think it means.",
                                    "score": 3,
                                    "author": "Distant_Stranger",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;no \"no smoking\" signs and people too polite to run us off for smoking doesn't always mean what we think it means.\n\nNot now, but it did in 1984",
                                            "score": 4,
                                            "author": "Bewildered_Beaver"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "You could smoke most places, sure. Just not in buildings that were direct arms of the government, like hospitals, family and other registry offices, schools, etc. Most community spaces independently banned it because they didn't want to deal with the smell getting stuck in the curtains or making the ceiling brown.",
                                    "score": -4,
                                    "author": "cherryisback",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Cuba is the last bastion of smokers heaven.\n\nAs soon as I set foot in the airport terminal I was blasted in the face with musty Cuban cigar smoke. I found heaven.\n\nThose people smoke cigars and drink rum practically everywhere in that country. And as a cigar and rum  aficionado, I was with my people.",
                                            "score": 5,
                                            "author": "KorporalKarnage"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Were you alive in 1984 or just going on what you've heard from others? Maybe we lived in different regions or something, but I don't know anybody who gave a crap about smelly curtains or brown ceilings. \n\nGovernment hospitals? Do you mean, like, on an army base? I was also in quite a few hospitals back then and smoked in every single one... in the hallway, in the lobby, and in the patient's room. The only place we DIDN'T smoke was on elevators.\n\nI'm not tryna be an asshole, I'm genuinely curious how we can have two completely different recollections of smoking in 1984!\n\n#edit\n####(op blocked me)\n\nI see you are not the type who can gracefully handle being bested. You made a bunch of rude and defensive remarks and then blocked me so I couldn't respond. Indeed, the actions of a coward.\n\nYou should have figured out by now from the comments that most people thought you were speaking of the US, and hence your title is inaccurate. That's why I, and other people, reacted the way we did. You didn't have to take such a defensive stance. Everybody makes mistakes.\n\nTo address the comments you tried to block me from addressing:\n\n&gt;you cited sources that don't exist\n\nFalse. I cited Reddit.com. The figures I quoted are published and accurate *You* are the one who didn't cite a source.\n\n&gt;accused me of lying about life in a country you've never been to\n\nFalse. (a) I didn't previously accuse you of lying, and (b) how do you know what countries I've been to? There you go again, spewing assumptions.\n\n&gt;you got embarrassed\n\nBa-hahaha! You're the one making a fool of yourself. \n\n&gt;It's obvious you're a new user\n\nAww, you figured out my account age all by yourself? You looked at my profile and think that tells you something? I'd say the same to you—that you'll figure things out around here eventually—but I doubt it. You're too dim.\n\nYou are a child. Maybe put more thought into your post next time? Or at least face the people you accuse instead of hiding behind the block feature.\n\nAt this point, I can only conclude that mental health issues are involved. Sea kelp.",
                                            "score": 7,
                                            "author": "Bewildered_Beaver",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Some people went to community college which is like high school with ashtrays",
                                                    "score": 5,
                                                    "author": "NegAm69420"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I'm assuming you're American, or western at any rate. That's probably where the confusion comes from. That's just to say, different places have and had different rules, laws, and cultural attitudes.",
                                                    "score": -4,
                                                    "author": "cherryisback",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Are you not American? Maybe just mention that.",
                                                            "score": 7,
                                                            "author": "Rusty_Ferberger",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "r/USdefaultism",
                                                                    "score": 2,
                                                                    "author": "not_your_red"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I hold an American passport. But oddly enough, people move and other countries exist. ~99.8% of people are *not* American. I will never understand the absolute fascination to assume everyone is. The hostility is absolutely not needed.",
                                                                    "score": -7,
                                                                    "author": "cherryisback",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "&gt;~99.8% of people are not American.\n\nOkay, but ~50% of Redditors *are* (reddit.com)\n\nEdit: Added source",
                                                                            "score": 5,
                                                                            "author": "Bewildered_Beaver",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Where do you get those stats from?",
                                                                                    "score": -1,
                                                                                    "author": "genomerain",
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "I've always heard ~40%. At the very least it's not a majority. Majority American English speaking, sure. It's the most taught variant. But no matter. It's not proper to make assumptions about people when there's literally no evidence to support it. You know what they say about the word \"assumption\" right?",
                                                                                    "score": -1,
                                                                                    "author": "cherryisback",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Nope… you could smoke there too",
                                            "score": 1,
                                            "author": "Medium_Tangelo2789"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "You are correct .., anywhere anytime",
                                    "score": 1,
                                    "author": "Medium_Tangelo2789"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "People were smoking in hospitals in 1984.",
            "score": 24,
            "author": "bored_in_NE",
            "replies": [
                {
                    "level": 1,
                    "comment": "Cigarettes were still good for you back then.",
                    "score": 3,
                    "author": "insultant_"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I remember people smoking in the grocery store in the mid-late 80s.",
            "score": 7,
            "author": "ClittyMcPenis"
        },
        {
            "level": 0,
            "comment": "I recall folks smoking on planes still in 84.",
            "score": 15,
            "author": "Key-Jelly-3702"
        },
        {
            "level": 0,
            "comment": "Did a small edit to the colour and removed the white on the right also removed a few blemishes. Enlarged a bit as well. Hope you like it.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/bv3r32yn165b1.jpeg?width=1260&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=c1bc69d2e401ed80576fbe946333cea3b431b142",
            "score": 3,
            "author": "WiseAcanthocephala58"
        },
        {
            "level": 0,
            "comment": "How is yr sister’s marriage?",
            "score": 2,
            "author": "Unfair-Sell-5109"
        },
        {
            "level": 0,
            "comment": "Our high school had a smoking section outside for students, we called them “the hoods”.. I would visit the smoking section couple of times and I felt like I was being bad 😬",
            "score": 2,
            "author": "Super-Letterhead-916"
        },
        {
            "level": 0,
            "comment": "Why were wedding dresses so awful in the 80s?",
            "score": 2,
            "author": "casino_night"
        },
        {
            "level": 0,
            "comment": "Girls who smoke, poke.",
            "score": 1,
            "author": "Rkozlow",
            "replies": [
                {
                    "level": 1,
                    "comment": "You joke, but there really was something about smoking in a social sense, especially once the ‘90s hit and we were all exiled outside. Smoking meant instant friends. Instant friends increased your dating pool. Personally, that was way more addictive than the nicotine itself.",
                    "score": 5,
                    "author": "OccamsYoyo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And also girls who smoke show they are more inclined to risky behavior. I wasn’t joking. It’s definitely true.",
                            "score": 2,
                            "author": "Rkozlow"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Damn she pretty, is she single",
            "score": 2,
            "author": "sukoshidekimasu",
            "replies": [
                {
                    "level": 1,
                    "comment": "She ded.",
                    "score": -4,
                    "author": "ishitintheurinal"
                }
            ]
        },
        {
            "level": 0,
            "comment": "She's purty... even with the cig.",
            "score": 1,
            "author": "hmmm_thought_pig",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": -6,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Getting downvoted but you're right, a disgusting habit",
                            "score": 3,
                            "author": "slick57"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Now I want a cigarette.....",
            "score": 3,
            "author": "SafecrackinSammmy"
        },
        {
            "level": 0,
            "comment": "those were the days.",
            "score": 1,
            "author": "Vicarious-Lee-Eye"
        },
        {
            "level": 0,
            "comment": "She  is pretty hot, cool.",
            "score": 0,
            "author": "AfraidShutting998"
        },
        {
            "level": 0,
            "comment": "Nothing cool about this.",
            "score": -4,
            "author": "Alan_Smithee_",
            "replies": [
                {
                    "level": 1,
                    "comment": "Don’t be a prude.. she looks awesome",
                    "score": 3,
                    "author": "Medium_Tangelo2789"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Definitely Tapable.",
            "score": 0,
            "author": "M4croM4n"
        },
        {
            "level": 0,
            "comment": "That and some Columbian cocaine.",
            "score": 0,
            "author": "OppositeAtr"
        },
        {
            "level": 0,
            "comment": "I am Italian and 40 y.o. i remember smoking in the highschool toilets... nobody cares un the late 90s",
            "score": 1,
            "author": "Successful-Panic5305",
            "replies": [
                {
                    "level": 1,
                    "comment": "This was 1984 .. people cared even less",
                    "score": 1,
                    "author": "Medium_Tangelo2789"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Considering the year, that could be the groom too. \n80s kids will get it.",
            "score": 1,
            "author": "PoochyMoochy5",
            "replies": [
                {
                    "level": 1,
                    "comment": "No — none of the guys were that pretty.",
                    "score": 1,
                    "author": "OccamsYoyo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I do not miss all the cigarette smoke.  Ugh.",
            "score": 1,
            "author": "percy_faucet"
        },
        {
            "level": 0,
            "comment": "I graduated high school in 1980. My high school had a designated smoking area for students. It was outside and the state (WI) told the administration they should find an indoor smoking area for the students.",
            "score": 1,
            "author": "spred5"
        },
        {
            "level": 0,
            "comment": "The 80s were awesome, I remember smoking on airplanes, good times...",
            "score": 1,
            "author": "TattooedB1k3r"
        },
        {
            "level": 0,
            "comment": "Smoking isn't cool",
            "score": -2,
            "author": "T_raltixx"
        },
        {
            "level": 0,
            "comment": "Everyone knew such scenes. I'm sure the husband is away with a drink",
            "score": -5,
            "author": "not_your_red"
        }
    ]
}