{
    "id": "1473in3",
    "score": 46,
    "title": "Richard Belzer and Hulk Hogan moments before disaster (1985)",
    "author": "GameStopInfidel",
    "date": 1686513281.0,
    "url": "https://www.reddit.com/r/OldSchoolCool/comments/1473in3",
    "media_urls": [
        "https://i.redd.it/491fdmbv1g5b1.jpg"
    ],
    "other_urls": [
        "https://youtu.be/i7n_SHrK408)"
    ],
    "postText": "Richard Belzer (host of the show *Hot Properties* at the time) and Hulk Hogan (along with a not pictured Mr. T) in 1985 who were there live promoting their upcoming WWF WrestleMania I tag team match. Belzer requested some wrestling demonstrations including having Hogan putting Belzer in a hold. Hogan initially denied but Belzer persisted which lead to Hogan placing him in a front chin lock that caused Belzer to pass out. Belzer slipped from Hogan’s grasp and ended up cracking his head on the floor requiring 9 stitches. Belzer sued Hogan for $5 million and used the funds to purchase a home for he and his wife, which he dubbed “Chez Hogan.” All this to say: don’t try this at home, kids. \n\n[You can watch the incident here. Warning: it is a little upsetting and there is blood.](https://youtu.be/i7n_SHrK408)",
    "comments": [
        {
            "level": 0,
            "comment": "*Law and Order dun-dun*",
            "score": 5,
            "author": "IfItWerentForHorse"
        },
        {
            "level": 0,
            "comment": "I spy another \"Behind the Bastards\" listener :)",
            "score": 4,
            "author": "man_bored_at_work",
            "replies": [
                {
                    "level": 1,
                    "comment": "  When I first heard it was going to be a 4-parter, I was unsure there would be enough material.\n\nI was so wrong!",
                    "score": 1,
                    "author": "CristabelYYC"
                }
            ]
        },
        {
            "level": 0,
            "comment": "![gif](giphy|MWHtQeRPLCog1TCxJT|downsized)",
            "score": 2,
            "author": "wontlastlonghere"
        },
        {
            "level": 0,
            "comment": "Safe to say he got his Bel(zer) rung that day.",
            "score": 1,
            "author": "drummingcraig"
        },
        {
            "level": 0,
            "comment": "what happened",
            "score": 1,
            "author": "CAT_AC6969",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hogan acted in kids movies like “Santa With Muscles” and 3 ninjas.   An epic disaster.",
                    "score": 8,
                    "author": "Lord-Velveeta",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Dont forget the never nominated for an award wonder of TV \"Thunder in Paradise\".",
                            "score": 5,
                            "author": "Koma79"
                        },
                        {
                            "level": 2,
                            "comment": "belzer cracked his skull got seriously hurt and sued the fuck out of Vince McMahon",
                            "score": 1,
                            "author": "Kooky-Director7692"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Belzer was being a cute prick and asked hogan to put him in a hold. He flinched and cried out when hulk barely touched him and the audience laughed. So the Hulkster put Belzer in a guillotine and choked him unconscious in about 7 seconds flat. He then dropped him like a sack of shit and belzers head split open when he hit the floor. \n\nHe sued, he won. It’s on YouTube if you’re interested. Hulk was wrong for doing it but Belzer was asking to get checked. Hulk wasn’t a legit tough guy but he was ya know a foot taller and probably 200 lbs heavier than a geek talk show host",
                    "score": 8,
                    "author": "nimrodfalcon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wrong for dropping him. Other than that he consented to being put in a chokehold.",
                            "score": 1,
                            "author": "Rogan4Life",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": " Both sides were wrong. Belzer shouldn’t have come after the business like that, back then Kayfabe meant everything in wrestling. By insinuating to viewers that wrestling is fake he was messing with the wrestlers’ livelihood",
                                    "score": 1,
                                    "author": "macNy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "“Please put me in a choke hold”",
                                            "score": 0,
                                            "author": "Rogan4Life"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "follow the link above. looks like a scammer.\nisn’t it appropriate to shave the wound for desinfektion and for good stitches?",
                    "score": 1,
                    "author": "Plus_Mathematician_4"
                }
            ]
        },
        {
            "level": 0,
            "comment": "He pissed off Mr. T (called him Ms. T if I remember correctly) and Hulk came out to stand up for his buddy - intentionally putting Belzer in a sleeper. Then dropped him like a sack of potatoes on the floor. Mr. T thought it was funny. What a bunch of assholes. I know Belzer was intentionally being a dick, but he bit off a little more than he could chew. The old \"fuck around and find out\".",
            "score": -8,
            "author": "philfix",
            "replies": [
                {
                    "level": 1,
                    "comment": "You call out two guys as fakes for an entire interview rather than treat them with respect. He then asked the guy to put him in a chokehold. What a moron lol. Then he was so coked out of mind, a little bit of pressure put him to sleep lol.",
                    "score": 6,
                    "author": "Rogan4Life"
                },
                {
                    "level": 1,
                    "comment": "That’s not what happened at all, watch the clip. He called him Mrs. T when recounting the situation as a joke. Hulk felt badly about what happened to him afterward and was in no way intentional. That’s why there was a civil suit and not an assault charge..",
                    "score": 4,
                    "author": "GameStopInfidel"
                }
            ]
        }
    ]
}