{
    "id": "147aqds",
    "score": 730,
    "title": "Canadian Praries - 1930s Great Depression Birthday celebration",
    "author": "emkcude",
    "date": 1686531439.0,
    "url": "https://www.reddit.com/r/OldSchoolCool/comments/147aqds",
    "media_urls": [
        "https://i.redd.it/49sn3iyujh5b1.jpg"
    ],
    "other_urls": [],
    "postText": "My Grandmother once told me about a birthday she remembered fondly, and I just came accross this photo of the occasion. \nHer family lived in the back of a pickup , traveling around the praries during the Great Depression looking for work for my Great Grandfather. They had a couple chairs,  mattress and some cooking necessities and they would set up crude camps and sleep in the bed of the truck. Needless to say they had a rough childhood. One particular Birthday her mom wanted to do something special and she managed to make a small cake for my Grandma, and it was a big highlight of those years. When she told me about it she even recalled them having taken a photo to commemorate the occasion, but that she hadn't seen it in years. I was quite pleased to find this, knowing the story behind it.",
    "comments": [
        {
            "level": 0,
            "comment": "My mom would tell me stories like that , she was raised on a farm in Canada. Christmas they got an orange for a present. During the depression the government would pass out dried whitefish.",
            "score": 20,
            "author": "sandbuggy90",
            "replies": [
                {
                    "level": 1,
                    "comment": "Dad would tell me about how exciting it was to get fruit for Christmas.",
                    "score": 9,
                    "author": "Iaintyourclownbro",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not fruit, but my Grandma and her siblings talked about the boon of local hunters in rural KY bringing by the leftovers from a harvested deer.  Said it might as well have been christmas.\n\nTough bunch, those old people (all born in the 40's I think).  A whole lot of grit.",
                            "score": 2,
                            "author": "If_you_just_lookatit"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don't think people could cope with an era like that now.  But I bet your grandma had a lot of good memories of her childhood anyway.  Parents that care make all the difference.",
            "score": 47,
            "author": "TraditionScary8716",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes she certainly does. And it's funny because she always considered her bright ginger hair more of a tribulation than living in their truck.",
                    "score": 20,
                    "author": "emkcude",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "was her name Anne with an E ;)",
                            "score": 5,
                            "author": "sassykittygurl",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Haha it would have been appropriate! Thankfully I was blessed with her red hair as well and have always been a fan of Anne.",
                                    "score": 2,
                                    "author": "emkcude"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I can’t imagine being a parent during the Great Depression. Must’ve been hard beyond words.",
            "score": 36,
            "author": "numero-one",
            "replies": [
                {
                    "level": 1,
                    "comment": "Exactly, as a kid her stories made me empathize with her experience, but now as an adult I can't even imagine how it would feel to have that uncertainty and struggle with two children to care for.",
                    "score": 20,
                    "author": "emkcude"
                },
                {
                    "level": 1,
                    "comment": "Especially in the Canadian prairies (it gets extremely cold in the winter).",
                    "score": 4,
                    "author": "weedcakes"
                }
            ]
        },
        {
            "level": 0,
            "comment": "She seems soo happy and she is so adorable",
            "score": 7,
            "author": "saiyanultimate"
        },
        {
            "level": 0,
            "comment": "Such an intriguing look she has in this photo, curiosity maybe?  Thanks for sharing the story, those were unbelievably hard years, few of us can imagine what that had to have been like.  An adventure for the kids, hell for the adults.  I hope life got easier for them.",
            "score": 6,
            "author": "Razberrella",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you, it did get easier, they settled in Ontario, found work and built a nice life. I was very close with her and always loved when she would open up about her childhood and give me a glimpse into such a different existence.",
                    "score": 9,
                    "author": "emkcude"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I can barely recognise the prairies without all the Dodge Rams and F150s.",
            "score": 3,
            "author": "SideshowOfFreaks"
        },
        {
            "level": 0,
            "comment": "All this mental disease nowadays WISHES it could have a single iota of the appreciation for anything present in that generation.",
            "score": -12,
            "author": "psichodrome",
            "replies": [
                {
                    "level": 1,
                    "comment": "No need to bring that type of energy into this",
                    "score": 4,
                    "author": "Ecstatic_Belt3501"
                },
                {
                    "level": 1,
                    "comment": "🙄",
                    "score": 0,
                    "author": "dmode112378"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Happy Super Soft Birthday  there Big Shoots.",
            "score": 1,
            "author": "noofa01"
        },
        {
            "level": 0,
            "comment": "First, sleeping in a bed of a pick up with only a couple of chairs for possessions, where did the oven to bake a cake come in?\n\nSecond, given the abject poverty, a camera? Where did that come from?\n\nEither there’s some shenanigans or the best parts of the story have just been glossed over.",
            "score": -18,
            "author": "Bagmasterflash",
            "replies": [
                {
                    "level": 1,
                    "comment": "I believe it's just a couple of stacked pancakes. And yes I'm sure there was a lot more to their story. I know when they left B.C. they had a house there so I would imagine the camera was one of the few possessions they took/ kept.  I know they had a sewing machine too which helped get them by.",
                    "score": 10,
                    "author": "emkcude",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Pancakes, of course.  All in all it looks like the family has done a fine job raising their descendants.",
                            "score": -3,
                            "author": "Bagmasterflash"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt; First, sleeping in a bed of a pick up with only a couple of chairs for possessions, where did the oven to bake a cake come in?\n\nCampfire cooking is a thing. So is borrowing the use of an oven from someone they did some work for on their travels. It’s not exactly a tall or fancy cake, and there’s lots of ways they might have improvised it.\n\n&gt; Second, given the abject poverty, a camera? Where did that come from?\n\nMany people who became nomads or homeless during the Great Depression had had homes full of  possessions before they lost those homes. One thing that was shocking about the Great Depression was that so many families went so quickly from financially secure to homeless poverty. There are depression era pictures of evicted people with their furniture piled outside and nowhere to go. Nothing weird about once having had the money to buy a camera.",
                    "score": 3,
                    "author": "smallbrownfrog"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I wonder how/why they had money for a camera and film.",
            "score": 0,
            "author": "rdubya864",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same way they were able to pull a cake together. Pick things up here and there, and use them sparingly.",
                    "score": 1,
                    "author": "rob1969reddit"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Cake for native people are from other \"solution\"...",
            "score": 0,
            "author": "andrews_fs"
        }
    ]
}