{
    "id": "147o41y",
    "score": 64,
    "title": "On this day in 1948, women were officially made part of the regular US Military (with equal pay) by an act of Congress. At the encouragement (and pressure) of Generals Eisenhower, MacArthur and other top armed forces officers, the World War II era auxiliary forces were made permanent and full time.",
    "author": "HawkeyeTen",
    "date": 1686576364.0,
    "url": "https://www.reddit.com/r/OldSchoolCool/comments/147o41y",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "For any wondering, they were in fact racially integrated beginning around this time as well (evidently Truman made this a condition for the ladies being made permanent). The reason everyone looks so stressed and on needles in the first photo is probably because the Soviets were blockading Berlin at the time, and World War III looked like a terrifyingly real possibility. Scary times for all involved.\n\nOn another note, it's ASTOUNDING how little attention this landmark achievement for American women has received in recent years, even from \"women's history\" organizations.",
            "score": 5,
            "author": "HawkeyeTen",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think the issue is kind of hard because feminism is anti war. I say this as a female vet with mixed feelings about my service.",
                    "score": 1,
                    "author": "Smart-Rip-3733"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My mother ran away from home, lied about her age and joined the Women's Army Corp (WACs) during WW2.  Left as a Corporal.  Was active in local and national WAC organizations.  Not sure if she was in when this occurred.",
            "score": 2,
            "author": "g_ppetto",
            "replies": [
                {
                    "level": 1,
                    "comment": "Pretty badass.",
                    "score": 1,
                    "author": "Smart-Rip-3733"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Crazy to think it'd be another 20 years before women had the explicit right to open a bank account in their own name. I wonder if the military helped facilitate the banking end of things, or if all these women were forced to either live on cash or funnel their money through the account of a spouse or male relative.",
            "score": 1,
            "author": "ArrozConmigo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wasn't that just for married women? And besides, from I've read it was up to individual banks on setting policies before that legislation, there was no universal ban. So it was hit and miss.",
                    "score": 1,
                    "author": "HawkeyeTen"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Mother told me, yes, she told me, I'd meet girls like you\n\nShe also told me, \"Stay away, you'll never know what you'll catch\"\n\nJust the other day I heard of a soldier's fallin' off\n\nSome Indonesian junk that's goin' 'round\n\nFather says, \"Your mother's right, she's really up on things\n\nBefore we married, mommy served in the WACs in the Philippines\"\n\nNow I had heard the WACs recruited old maids for the war\n\nBut mommy isn't one of those, I've known her all these years",
            "score": 0,
            "author": "PastelFlamingo150"
        }
    ]
}