{
    "id": "147x5u3",
    "score": 92,
    "title": "Earl's Breakdown - Foggy Mountain Boys 1962",
    "author": "Separate-Apricot-728",
    "date": 1686602664.0,
    "url": "https://www.reddit.com/r/OldSchoolCool/comments/147x5u3",
    "media_urls": [
        "https://www.youtube.com/watch?v=3wC62YOY_kc"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "I wanna know how he knows where to put the tuning peg back to where it should be while playing.",
            "score": 5,
            "author": "Klin24",
            "replies": [
                {
                    "level": 1,
                    "comment": "He had extra shafts on his banjo headstock that held adustable cams. Tune the string to the main note, then flip the cam, adjust the cam to get the desire second note, and then you can flip back and forth between them at will.\n\nHe invented them I believe. The concept was later improved by Bill Keith who built tuners that could do the same thing without having the extra hardware on your headstock.",
                    "score": 3,
                    "author": "Adddicus"
                },
                {
                    "level": 1,
                    "comment": "He was a total master of the instrument. I would say pulling something off like that would take intimate familiarity with the instrument, muscle memory, hard practice, and a fine tuned ear!",
                    "score": 2,
                    "author": "Separate-Apricot-728",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No, it was a mechanical device. He describes how he made them (along with drawings and measurements) in his book Earl Scruggs and the 5-String banjo.",
                            "score": 6,
                            "author": "Adddicus",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Really! That's pretty cool, I didn't know that",
                                    "score": 1,
                                    "author": "Separate-Apricot-728"
                                },
                                {
                                    "level": 3,
                                    "comment": "A friend of mine was a really good banjo player and he had a set of those special tuners",
                                    "score": 1,
                                    "author": "fangelo2"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Damn those men could PLAY! 😎🥃",
            "score": 2,
            "author": "SpiritedTie7645"
        },
        {
            "level": 0,
            "comment": "One of the sounds I took for granted growing up - when you learn how inventive and innovative Scruggs was in the context of music history, it becomes way more impressive. To be at this level in your life’s pursuit and passion is what makes a legend.",
            "score": 2,
            "author": "FitSeeker1982",
            "replies": [
                {
                    "level": 1,
                    "comment": "You know an interesting thing about Bluegrass too was its reaction to cultural shift. Bill Monroe said anyone in his band had to fulfill a certain amount of farm work each week to even remain a member. The artistry on some of the players in bluegrass was very high level and very unique",
                    "score": 2,
                    "author": "Separate-Apricot-728",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m a little embarrassed to admit that most of what I know about the history of the genre I learned from Ken Burns’ “Country Music” series… although I grew up around it, I’ve always preferred rock/pop and even classical and jazz to American country music. I’m more drawn to the folk-like styles of country, and some western, Appalachian, and bluegrass. What I sometimes refer to as goat-roper pop - the silly lyrics and sound-alike, good old boy vocals - is mostly just awful to my ears.\nThis “roots” music, however, is pure and full of joy.",
                            "score": 2,
                            "author": "FitSeeker1982"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Outstanding",
            "score": 2,
            "author": "snowyoda5150"
        },
        {
            "level": 0,
            "comment": "Anyone remember Bonnie and Clyde with Warren Beatty and Faye Dunaway from the late 60s? Great movie. This was pretty much the sound track.",
            "score": 1,
            "author": "CrassCritter"
        }
    ]
}