{
    "id": "kdvnu9",
    "score": 79290,
    "title": "My grandma and great aunt (50’s)",
    "author": "My_Oxymoron",
    "date": 1608069892.0,
    "url": "https://www.reddit.com/r/OldSchoolCool/comments/kdvnu9",
    "media_urls": [
        "https://i.redd.it/0guwpxrvbf561.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "My dad put tinsel on our tree just like that! One damn piece at a time.",
            "score": 1353,
            "author": "fishinbarbie",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm in my mid-50s.  I remember helping put on tinsel, one strand at a time.  It really fell out of favor in the late '60s.",
                    "score": 489,
                    "author": "Straelbora",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "In the 1950s my grandparents saved and reused the tinsel, so it went on one strand at a time, then came off the tree one strand at a time. (Like a lot of people, growing up very poor in the Depression really shaped them.)",
                            "score": 324,
                            "author": "bicyclecat",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; grandparents saved and reused the tinsel\n\nPeople just throw out tinsel now? That seems pretty wasteful when it's made of plastic and metal so will last for pretty much forever and can just be stored alongside all of the other Christmas decorations.",
                                    "score": 121,
                                    "author": "KiltedTraveller",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Only ever throw out tinsel if it's a piece that broke off that's too small to hang anywhere. No need to throw it out otherwise",
                                            "score": 12,
                                            "author": "cr0ss-r0ad"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Oh, ours certainly got put up a strand at a time and taken down for reuse in the same manner.  My mom grew up during the Depression, too.",
                                    "score": 74,
                                    "author": "Straelbora",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "My aunt totally has a box of the old school tinsel- it's really heavy compared to the plastic stuff you can buy today. She is super careful with it and still uses it on her tree every year!",
                                    "score": 74,
                                    "author": "Castianna",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "yeah it’s the old school highly toxic lead that’ll do that.",
                                            "score": 58,
                                            "author": "Dayman_oo00oo",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Darn right! Hence why we weren't allowed to touch it as kids...",
                                                    "score": 36,
                                                    "author": "Castianna",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "what about the chain smoked ciggaretes in the same room as the kids catching the incredibly flammable tinsel alight.",
                                                            "score": 35,
                                                            "author": "Dayman_oo00oo",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "My grandpa smoked so much around his kids that one year they decided to make a garland out of his cigarette butts and I'm told when their dad saw that was the most frightening moment of their lives, even half a century later.",
                                                                    "score": 34,
                                                                    "author": "putting-on-the-grits",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I am interpreting this as your grandpa was faced with his waste of money and harm he had inflicted on his children and then raged out on them? was this like young children not knowing any better or shit eating grin 15 year olds? was it not about looking in an ugly mirror but actually he was mad at a mess made of burnt loose tobacco falling out of the butts? was this like a years worth of ciggaretes saved up in malicious compliance with having to empty his ashtrays? also sorry about the trauma merry covid",
                                                                            "score": 30,
                                                                            "author": "Dayman_oo00oo",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "I’m traumatized by this summation",
                                                                                    "score": 11,
                                                                                    "author": "once-in-a-blue-spoon"
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "This comment was a wild ride",
                                                                                    "score": 5,
                                                                                    "author": "saturnencelade"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "My dad did this up until about 15 years ago.  One at a time. Was mind blowing how long it took.",
                                    "score": 32,
                                    "author": "kill-dash-nine"
                                },
                                {
                                    "level": 3,
                                    "comment": "My mum and I used to thread popcorn into garlands every year (in the 80s-90s) to decorate the tree, never realized that was super poor people shit until I was older.",
                                    "score": 47,
                                    "author": "notabigmelvillecrowd",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "We did that this year with some air popped stuff! It looks really pretty and we did it while watching Elf. Last year my husband tried it without me using microwave popcorn and the assistance of our two kids. That did not go nearly as well - he had maybe 2 ft, oddly draped in the middle somewhere.",
                                            "score": 41,
                                            "author": "poprevivalism",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "My American flatmate did our tree like that this year. Looks like it’s coming back into fashion!",
                            "score": 77,
                            "author": "lackingsavoirfaire",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It never went out for me. I've always had it on my trees, even with cats and dogs. At night after everyone is gone to bed I always just sit in the dark, only the tree lights on, and watch it shimmer. Then when the sun shines on the tree in the afternoon I just love the bright reflections. It reminds me of my childhood,  when my granny saved every single crinkly lead icicle for the next year's tree. Those shimmery strands and the smell of an orange are all I need to summon every sweet Christmas memory of my life. Never mind the cat poo linked like strand, ball, strand, ball. They all lived very long lives.  The dogs, too. All gone now, and most of my family.  But I imagine I'll do a tree until I'm gone, too.",
                                    "score": 67,
                                    "author": "imrealbizzy2",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": ":,(",
                                            "score": 11,
                                            "author": "guavawater"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Has your flatmate done American Easter, including 'Easter grass,' the thin plastic strips that go in baskets?  Both Easter grass and tinsel turn up months later on the bottom of your socks.",
                                    "score": 49,
                                    "author": "Straelbora",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The glitter of holiday decorations",
                                            "score": 17,
                                            "author": "SoupBowl69"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I did tinsel this year as well.  My cats love it.",
                                    "score": 22,
                                    "author": "lancebaldwin",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "If you are serious then tinsel can cause death in cats as it gets wrapped around their intestines when they eat it. Get it off and see your vet for an X-ray ASAP.",
                                            "score": 22,
                                            "author": "ReflectiveWave",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Ours did too, but they also ate some of it.  Be on the lookout for sparkly poop!",
                                            "score": 7,
                                            "author": "fishinbarbie",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 15,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Make sure you don’t pull it and just cut it. It could be tied up and will pass with the next movement.",
                                                    "score": 11,
                                                    "author": "otartyo",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I’m 38 and my dad to this day is putting tinsel on like that, he takes three strands at a time though haha. After Christmas it went back into the box, laid flat. It was the nice heavy tinsel, not the light stuff that barely drapes over the twigs. He also insisted on only silver ornament balls and some wooden painted ornaments that all had been in the family forever. It was always fun.",
                            "score": 32,
                            "author": "Fireplum",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Time: mid-60s. Me:just 60.  My little sister and i had the task of unscrewing every single 1 or 2 inch bulb on several strands, put on an aluminum foil reflector, and replace the bulb. I was 6, she was 5, and we were jazzed.  Fam then decorated the tree, and *then my dad would apply the tinsel,    strand.   by.    strand.  After that, perpetual adjusting.  We had an Irish Wolfhound and a Siamese cat, but i haven't any recollections of critter mayhem.",
                                    "score": 12,
                                    "author": "awsm-Girl",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "We were definitely doing tinsel all through the 80s.",
                            "score": 29,
                            "author": "megamoze",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I did tinsel into the early 90s with my family",
                            "score": 21,
                            "author": "kinokohatake",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Oh I remember it was still easy to find and see on trees in the 80’s. I think tinsel fell out of favor with the rise in popularity of artificial trees, because you have to remove it. Have you ever removed tinsel from a pine tree? It’s not fun. However, when I can find the thin string tinsel I buy it because sometimes you just want that twinkly nostalgia (no matter what kind of headache you’re creating when it’s time to put it all away).",
                            "score": 18,
                            "author": "AlvinTaco"
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 9,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Do you have a link to the tin smith's shop please?",
                                    "score": 7,
                                    "author": "borgchupacabras",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Can you even buy tinsel anymore- I never see and my parents stopped putting on the tree around 92",
                    "score": 27,
                    "author": "Snake-N-Roses",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 23,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "We called them icicles for some reason.",
                    "score": 20,
                    "author": "dan1101",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So did we.  We called these icicles, and we called the shiny garland tinsel.",
                            "score": 14,
                            "author": "BabyUKnowWhereUAre"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I was just thinking “oh, that’s why my mom loved tinsel on the tree- her mom probably did it when she was little”. I hated that shit hahah",
                    "score": 11,
                    "author": "earthangelbaby"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Looks like an advertisement I’d see looking through the old National Geographic’s my school had laying around. This was in the 90’s/00’s and they had an extensive collection ranging from the 30’s through late 80’s but nothing newer",
            "score": 164,
            "author": "DaBokes",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Those colors. This would fit perfectly in an old issue of Time magazine. It’s just so beautifully 50s.",
            "score": 490,
            "author": "apittsburghoriginal",
            "replies": []
        },
        {
            "level": 0,
            "comment": "twins?",
            "score": 755,
            "author": "miltondelug",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yep! Identical twins. Fun fact: they were Dick Cavett’s magician’s assistants for their high school talent show.",
                    "score": 1395,
                    "author": "My_Oxymoron",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "are they single?",
                            "score": 634,
                            "author": "SealTeamNips",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No, they're twins!!",
                                    "score": 1482,
                                    "author": "Amstelodamum",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Twins, Basil!",
                                            "score": 114,
                                            "author": "Zazierx",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Well fook me",
                                                    "score": 25,
                                                    "author": "MistaTorgueFlexinton",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Fook Yu.",
                                                            "score": 9,
                                                            "author": "_BallsDeep69_"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Asking the real question",
                                    "score": 42,
                                    "author": "jtothaizzo"
                                },
                                {
                                    "level": 3,
                                    "comment": "Word.",
                                    "score": 12,
                                    "author": "phthophth"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "This photo is exquisite. It hits so many notes, including pangs of nostalgia for the Christmases of my childhood (even though I'm only 46). I think this portrait counts as art.",
                            "score": 69,
                            "author": "phthophth",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "There are two people I've met in my life about whom I could say \"I'm pretty sure no one else has met those two people\". Nope.  DICK FUCKING CAVETT. \n\nSo, I'm two degrees of separation from your grandma and great aunt.\nAnd that's kind of fun to think about. I've talked with a guy, who talked with a guy, who talked with these people.",
                            "score": 102,
                            "author": "cake_boner",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Dick Cavett has definitely met at least 100 people.",
                                    "score": 12,
                                    "author": "MundaneInternetGuy",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "I've tried several times, but I just can't parse your comment",
                                    "score": 73,
                                    "author": "MUSICEATPEOPLE",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I....I think he’s saying he met Dick Cavett. Or maybe he met someone who met Dick Cavett. I’m not quite sure.",
                                            "score": 58,
                                            "author": "Nwcray",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "If he's two degrees of separation from the twin then he means he met Dick Cavett.",
                                                    "score": 8,
                                                    "author": "Viking_Lordbeast"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Sorry. I found myself thinking one day, \"how many people have met both this guy, and that guy\" it turns out, yes, Dick Cavett met them both. For the record it was Paul Tibbetts and Bjorn Ulvaeus. Two... vastly different people. So me, to one of those guys, to Dick Cavett, to that guy's grandmum. One of them dropped the atom bomb, another wrote \"Take a Chance On Me.\"\n\nNot sure if OP's relatives dropped any bombs or hit singles, but it just shows how small the world is.",
                                            "score": 12,
                                            "author": "cake_boner"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "My grandmother was also a twin. Because of her and her sister’s closeness, we had an incredible relationship with my great aunt. \n\nThey both passed away a few years ago. My great aunt died first and my grandmother said it was like a piece of her was missing. She specifically said, “I’ve never had a Christmas without her.” She died the November of that same year, so she never did.",
                            "score": 9,
                            "author": "xtul7455",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Wow what a beautiful story. Unfortunately, my great aunt Jean died in her late-30’s and my grandma had to spend a lot of her life without her. My grandma passed in 2002, but the name Jean has lovingly been living in my family ever since.",
                                    "score": 9,
                                    "author": "My_Oxymoron",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "This is going to sound like an unbelievable coincidence, but my great aunt’s name was also Jean! Jane and Jean were my grandmother and great aunt. \n\nIt’s wonderful y’all are keeping the name in the family. I’m sure that meant a lot to your grandmother.",
                                            "score": 5,
                                            "author": "xtul7455"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just so beautiful her stance , the colors , the pose the tinsel the outfits stunning thanks for sharing you should frame it write on the back so generations later know who they Are\n\nThanks guys !",
            "score": 6556,
            "author": "turribultina",
            "replies": [
                {
                    "level": 1,
                    "comment": "As a kid I loved tinsel! And an adult with kids and a cat I will never buy tinsel again.",
                    "score": 1689,
                    "author": "Newtiresaretheworst",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I remember the last year we had tinsel on the tree as a kid. It started disappearing from the tree. Then a few days later our dog started dropping sparkly poops in the backyard.\n\nSo we took the tinsel off, leaving it only on the top. It still disappeared, and the sparkly dog poops resumed.\n\nAfter some detective work by my parents, it turns out it was not the dog that was eating the tinsel. It was the cat. Who pooped in the litter box, and the dog decided they looked delicious.\n\nMy innocence shattered, I have not let a dog lick me on the face since.",
                            "score": 1221,
                            "author": "SillyFlyGuy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Dogs LOVE kitty litter turds. My roommate loved my dog because he never had to clean the box",
                                    "score": 341,
                                    "author": "navin__johnson",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Of all the shit I've seen on the internet today, this is the worst.",
                                            "score": 288,
                                            "author": "TheUltimateSalesman",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Of all the shit you’ve seen on the internet today, this is the worst *so far.*",
                                                    "score": 103,
                                                    "author": "onandpoppins",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Technically you didn’t see any shit because the dog ate it.",
                                                            "score": 86,
                                                            "author": "Drunken_HR",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "🎅🎄🎵*Have a holly, jolly rancher*🎵🎄🎅",
                                                    "score": 22,
                                                    "author": "DetectiveDing-Daaahh",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I hate this a whole lot. Can I borrow your dog?",
                                            "score": 175,
                                            "author": "azdevil08",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "When I was younger we had a really old cat who would shit rock hard turds before we had to put her down. We would doggy sit my grandmas dog often and she fucking loved scarfing those crunchy treats right out of the catbox. The dog that is, not my grandma.",
                                            "score": 57,
                                            "author": "m00ndr0pp3d",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That last sentence put the funniest image in my head. Dyin’.",
                                                    "score": 11,
                                                    "author": "MindfuckRocketship"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "They also love chicken poop. My dogs will follow our chickens around like they're little pez dispensers.",
                                            "score": 44,
                                            "author": "rjmartin73",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "How did we get here from such a lovely Christmas scene??? And so fast!",
                                                    "score": 26,
                                                    "author": "woodcider"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "We call them sand biscuits around here",
                                            "score": 59,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "\"Kittie krunchies\" here. Lol",
                                                    "score": 36,
                                                    "author": "sarahandy",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Kitten nuggets",
                                                            "score": 17,
                                                            "author": "SpaceToot",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Kitty Roca",
                                                    "score": 17,
                                                    "author": "j4yne",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I've read that it may be due to the fact that cats are obligate carnivores. Ergo their poop has more protein. So the dogs smell it and well think 'meat' more than 'waste' but dogs also eat dog shit so maybe meaty poop is a delicacy",
                                            "score": 19,
                                            "author": "euclidtree",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "In my dogs case, I think it had more to do with the cat food. My dog *LOVED* cat food—more than anything else in the world. I bet the turds tasted somewhat similar",
                                                    "score": 19,
                                                    "author": "navin__johnson",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Is this not bad for them? Not trying to sound accusatory, I honestly just don’t know and am curious.",
                                            "score": 17,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "My dog lived to be 15 and died of old age. That beagle was a tank",
                                                    "score": 38,
                                                    "author": "navin__johnson",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 56,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "For the most part dogs basically eat anything and if its bad for them they throw it up. Then they sometimes eat it again.\n\nIf it isn't cooked chicken bones, rat poison or automotive antifreeze no problems. Other than some vomit and diarrhea. Dogs are pretty wash and wear.",
                                                    "score": 18,
                                                    "author": "dirtydownstairs",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "My dog ate a glass jar a little over a year ago.\n\nIn her defense, the jar had once contained cheese sauce before I rinsed it out and put it in the recycling.",
                                                            "score": 14,
                                                            "author": "Nearby-Confection",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "jeez thats intense, even for a dog.",
                                                                    "score": 8,
                                                                    "author": "dirtydownstairs"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "My dog once ate 8 cooked chicken bones and she’s still kickin it at 16. She actually acted as if it never happened and she weighs about 20 lbs max. Dogs are weird creatures!",
                                                            "score": 7,
                                                            "author": "twinbaked"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "My dog once drank a bucket of the old frying fat... he then vomited all of it into my fathers old leather boots. Those looked shiny as heel when they where cleaned again :)",
                                                    "score": 7,
                                                    "author": "henkheijmen",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "That’s actually genius. If your roommate has a dog, get a cat. Cat will just move the poop down the line for you, the dog owner to ultimately clean the kitty litter.",
                                            "score": 8,
                                            "author": "vipertitzPURR"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "My dad always called them \"Kittie krunchies,\" as our wonderful german shepherd loved to crunch on 😂",
                                            "score": 14,
                                            "author": "sarahandy"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Who’s hungry not me!!",
                                    "score": 10,
                                    "author": "4904burchfield"
                                },
                                {
                                    "level": 3,
                                    "comment": "On the bright side, you figured out that your dog enjoys/enjoyed eating cat poop.",
                                    "score": 7,
                                    "author": "ivegotaqueso"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "As a kid in the 1950’s the tinsel was made out of lead and not the plastic type used later. We had our tree on a train platform and if the tinsel fell onto the tracks the electric train would short out and not run. I was born in 1949.",
                            "score": 164,
                            "author": "Agreeable-Scratch424",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I loved that old leaded tinsel.  It had weight to it, so that if you blew into or walked quickly towards it it made really cool movement patterns.  Newer tinsel isn't worth bothering with. Sucks that it had to be poisonous.",
                                    "score": 91,
                                    "author": "ChuckitThrower",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Me and my siblings used to hold the lead-filled tinsel on the big glass bulbs wrapped around the tree until it got warm and you could stretch it. We would do it over and over again until the 12\" tinsel was twice that length. I shudder to think how many IQ points we lost.",
                                            "score": 100,
                                            "author": "LittleLarry",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "My brother would save the tinsel and melt it down to make fishing sinkers.",
                                                    "score": 34,
                                                    "author": "Agreeable-Scratch424",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "and really only poisonous if you ate it. Frickin' cousin larry couldn't keep that tinsel out of his mouth and now we all are paying the price",
                                            "score": 21,
                                            "author": "dirtydownstairs",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Well if you are melting it you definitely don't want to breathe any of the atomized lead...",
                                                    "score": 18,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Well yeah I should have used the word ingesting it. Probably shouldn't inject it, use it as a subdermal implant, insert it anally, or use it as a urethral sounding rod.\n\nI actually used to use melted lead in blocking optical lenses before they were surfaced. Now we mostly use specialized wax though.",
                                                            "score": 18,
                                                            "author": "dirtydownstairs",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[deleted]",
                                                                    "score": 8,
                                                                    "author": "[deleted]",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Did y'all just put lead into everything?",
                                    "score": 50,
                                    "author": "Petrichordates",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Well, on occasion we'd run short of asbestos and lead was the next best thing.",
                                            "score": 93,
                                            "author": "warm-saucepan",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The old house I grew up in had asbestos siding.",
                                                    "score": 12,
                                                    "author": "arya_aquaria",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "My vet misses the old tinsel because it would show up on x-rays while the new type is invisible on x-rays until it starts to cause serious damage.",
                                    "score": 40,
                                    "author": "science_with_a_smile",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "This is ALSO scary and awesome at the same time, lol",
                                            "score": 24,
                                            "author": "sarahandy",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah we became a no garland/tinsel house after that visit.",
                                                    "score": 8,
                                                    "author": "science_with_a_smile"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Intestine floss!",
                            "score": 65,
                            "author": "acery88",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Long glitter",
                                    "score": 41,
                                    "author": "CCDestroyer",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Cat poop string",
                                            "score": 15,
                                            "author": "ebunzzle",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I love it, too! I put tinsel on a tree ONE time after I got my first cat and he attacked it like a ravenous beast trying to eat it. Nine years without tinsel is too long.",
                            "score": 26,
                            "author": "shanotron",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Never heard of a cat eating tinsel or any dog eating cat poop with tinsel.  \nWe always had a cat and a dog at the same time too.  \nCat went outside to poop n pee, no questions, shovel a path out back for the dog.  \nEating each others shit in your living room ...oh man wtf.  \nONE CAT did not nuts on the low hanging ornaments, whacked them off and wacked them all over,",
                                    "score": 6,
                                    "author": "Different-Secret-291",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I find tinsel distracting. I have a pole.",
                            "score": 28,
                            "author": "MachReverb",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I don’t have a pole and I find tinsel distracting.  \n\nWe… we are still talking about Christmas trees, right?",
                                    "score": 10,
                                    "author": "LillyPip"
                                },
                                {
                                    "level": 3,
                                    "comment": "Ive got a lot of problems with you people",
                                    "score": 9,
                                    "author": "Bigbadwolf6049"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "My mother used to put it on her tree when i was a kid. Shit went everywhere. Its like glitter, youll find it months later.",
                            "score": 18,
                            "author": "SwoleWalrus",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Tinsel and easter grass, the banes of american parents for 70 years!",
                                    "score": 27,
                                    "author": "redwoods81",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Buy the chromed, twisted metal icicles or the mercury glass ones. Same basic look, not as dangerous to cats and dogs. It took me years to buy as many as needed to cover  an 8-9 foot tree but it’s been worth it. So pretty!",
                            "score": 10,
                            "author": "alwaysboopthesnoot"
                        },
                        {
                            "level": 2,
                            "comment": "Cats love Christmas trees, and ornaments lol. I had a cat that literally opened all the Christmas presents under the tree, when we were all asleep on Christmas morning. We were all *shooed* back upstairs while my parents rewrapped everything. There must have been twenty presents that little asshole unwrapped.",
                            "score": 7,
                            "author": "FappleFritter"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "As a woman in 2020, I'm usually in disbelief the bullshit women went through to get lessons in grace--finishing school and all that. Seems like such a waste of time. Then I see a photo like this and I'm like \".....is there like a YouTube video I can watch to teach me how to stand like an angel?\"",
                    "score": 371,
                    "author": "pseudo_meat",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ballet is good for that kind of body-awareness, &amp; there's plenty of lessons posted online too!",
                            "score": 109,
                            "author": "redwoods81",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I took ballet lessons 3x/week from age 9-16 and will forever appreciate how it taught me to carry myself gracefully.  It also made it easy for me to stay in shape for the last 50+ years.",
                                    "score": 63,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "\"it won't feel natural at first, and it's not supposed to, it's supposed to look *elegant*.\" -my ballet instructor, who tried to teach me (a dude) lol.",
                                            "score": 16,
                                            "author": "DandyLyen",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "As an old man in 2020, I can personally attest that lessons in manners, style, and grace were not limited to women.",
                            "score": 126,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Sounds like someone had to attend Saturday dance classes! Or was it the other type ie learn how to use what fork, spoon, how to walk etc. My mother and grandmother told me about those classes - what were they called?",
                                    "score": 23,
                                    "author": "weehawkenwonder",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Etiquette classes? Cotillion?",
                                            "score": 12,
                                            "author": "Mirminatrix",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Cotillion! &lt;&lt;Shudder&gt;&gt; Thats it. Every Sat morning along w dances and language lessons.",
                                                    "score": 9,
                                                    "author": "weehawkenwonder",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "They both look like they are about to dance.",
                            "score": 24,
                            "author": "Dispatcher12",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Even the damn gift box matches the outfits.",
                    "score": 64,
                    "author": "discombobulatedhomey",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "To be fair, this photo has been colorized so whoever did the colorization made that gift box green.",
                            "score": 78,
                            "author": "chipsandsourcream1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Every dream I’ve ever known just died.",
                                    "score": 62,
                                    "author": "discombobulatedhomey",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Be sure and drink your Ovaltine!",
                                            "score": 26,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "A crummy commercial?",
                                                    "score": 12,
                                                    "author": "anyeyeball",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Is it colorized or kodachrome?",
                                    "score": 11,
                                    "author": "stoopidquestions",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Hmm didn’t think of that. Hopefully OP will answer!! I’d like to know! If it’s been colorized, whoever did it did a great job.",
                                            "score": 6,
                                            "author": "chipsandsourcream1"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I’m always impressed at how feminine and well put-together women were in these old pics.",
                    "score": 257,
                    "author": "IoSonCalaf",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Me, too.  Kinda envious also because I want to look this elegant.",
                            "score": 135,
                            "author": "Smokedeggs",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah I want to be able to look like this one day and then be stomping up to the gondola for first lifts with my snowboard in hand the next day. \n\nNeither of those things will ever happen because first lifts are just far too early and I am not graceful, on or off the snow.",
                                    "score": 95,
                                    "author": "ShreddedKnees",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Part of the reason is because taking pictures was an *event*. Pictures were “set-up”-much like this one was. Also it was more likely that cameras were busted out for major events and holidays, and so people would naturally be more “made up” because it was a party",
                            "score": 146,
                            "author": "navin__johnson",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I mean, there are plenty of candid shots from this era. This photo almost looks like an ad because of how staged it is--even for the time. I wouldn't be surprised if this was for a Christmas card, which people still do today.\n\nIt's not like this is the late 19th/early 20th century. The Brownie had been around for decades already and there were many, many other cameras being sold at various prices.",
                                    "score": 71,
                                    "author": "Thin-White-Duke",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "As I understand it, this was also mostly due to the cost of developing film. Cameras were pretty common, but film and getting it developed were expensive. So people would often only use it at special occasions and then get their film developed maybe once or twice per year. \n\nNot an expert on this by any means, it's just what I've read before somewhere.",
                                    "score": 35,
                                    "author": "HH_YoursTruly",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I still only get pics printed once or twice a year. I have 5k+ plus in my phone/google photos dating back to 2007. I have 1 picture waiting for me at Walgreens right now from a few summers ago.",
                                            "score": 13,
                                            "author": "nessao616"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "It wasn’t that long ago that developing film was commonplace.  It’s only been ten years since I last used a film camera.  \n\nThat being said the cost of developing pictures went down in the late 90’s.  In the early nineties a roll of film would be around 15-20 dollars for 25 images.  Some rolls were longer and it cost the same, but the most you would typically get was 30 pictures from a roll.  By the late 90’s early 2000’s it was $11 to develop a roll.  I remember it being around 5-7 dollars when I was a kid in the 80’s.  Depending on your job, it was around 1-2 hours wage for a working class teenager.\n\nThese are Canadian prices by the way.  I don’t remember currency rates, but it was much cheaper in states when I was young even factoring for exchange rates.",
                                            "score": 8,
                                            "author": "spelunk8",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Good point.",
                                    "score": 11,
                                    "author": "TheUltimateSalesman"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It's undergarments. My mom is in her 70s and she had to wear girdles, slips, stockings, etc. Everything is meant to make clothing look smooth and you can't slouch because it bunches up and stabs you. Those women are very uncomfortable. \n\nAlso they ironed everything and most women knew enough sewing to trailer their hems and sleeves. People don't iron anymore.",
                            "score": 109,
                            "author": "potscfs",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "True story. The fiancé and I don’t even have an ironing board. Anything that has wrinkles, we have one of those steamers to do the job.",
                                    "score": 20,
                                    "author": "ItsjustJim621",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I don't have an iron or a steamer. I strategically buy clothes that don't need to be ironed, and hang something in the bathroom while I'm showering if I really need to.\n\nThere's a reason I'll never look this elegant...",
                                            "score": 35,
                                            "author": "HerDarkMaterials",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I feel this in my soul.",
                                                    "score": 13,
                                                    "author": "ElleVignetta"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It's because they spent like 3 hours every day getting ready.",
                            "score": 28,
                            "author": "psychoacer",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I mean, it’s comfy and all, but there’s a down side to sweatpants and pajamas becoming acceptable daytime attire.",
                            "score": 46,
                            "author": "sirgoofs",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Don't forget about rocket titty bras and metal boned corsets",
                            "score": 5,
                            "author": "bitterberries",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Dude that carpet is magnificent too. Real style all around. Clothes are impeccably tailored. Just a great composition all around. Lovely.",
                    "score": 16,
                    "author": "SecondaryLawnWreckin",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "This would make a beautiful Christmas card to send to your family members.",
            "score": 372,
            "author": "fyrefly_faerie",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don’t know why but I love the asymmetry of the Christmas tree.",
                    "score": 15,
                    "author": "earthdweller11",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 1292,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "He should have seen the twins in Shining. Oh Boy what a set!",
                    "score": 22,
                    "author": "saurusAT",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Headlights on to boot!",
                    "score": 126,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Headlights where always on in the 50s.",
                            "score": 69,
                            "author": "chocki305",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "damn it's like a norman rockwell painting",
            "score": 128,
            "author": "beepbeep_dog",
            "replies": [
                {
                    "level": 1,
                    "comment": "Was about to say exactly this. Total Rockwell vibes. Great pic.",
                    "score": 9,
                    "author": "onemanmelee"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So, what are they doing Saturday night seventy years ago?",
            "score": 322,
            "author": "Dogs_Akimbo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Bout time I finish tinkering on my time machine and give it a trial run!",
                    "score": 47,
                    "author": "PinstripeMonkey",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Why wanna get retroactively shot down in stereo?",
                            "score": 12,
                            "author": "mynameisalso",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Falling in love with one Calvin Klein",
                    "score": 18,
                    "author": "DegenerateWizard",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is better than anything on Instagram",
            "score": 22,
            "author": "MIERDAPORQUE"
        },
        {
            "level": 0,
            "comment": "How gorgeous! It's like a painting almost...",
            "score": 33,
            "author": "chroove",
            "replies": []
        },
        {
            "level": 0,
            "comment": "\"I give you the gift of...my soul.\" \n\n\"Thank you, I already borrowed your's while you were sleeping anyway.\"",
            "score": 105,
            "author": "FamousOhioAppleHorn",
            "replies": []
        },
        {
            "level": 0,
            "comment": "They are beautiful.",
            "score": 22,
            "author": "Upshot12"
        },
        {
            "level": 0,
            "comment": "I thought this was an elaborate photoshop trick at first",
            "score": 60,
            "author": "90059bethezip",
            "replies": [
                {
                    "level": 1,
                    "comment": "I thought it was from an old magazine.",
                    "score": 26,
                    "author": "fromthewombofrevel",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "It does seem to be colorized, which could explain the intitial surrealism.",
                    "score": 21,
                    "author": "Aruazaura"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wow this looks like a vintage Christmas advertisement! So beautiful.",
            "score": 19,
            "author": "13keex"
        },
        {
            "level": 0,
            "comment": "Kodachrome, baby. Nothin' like it.",
            "score": 18,
            "author": "imrealbizzy2",
            "replies": []
        },
        {
            "level": 0,
            "comment": "*monotone* “Take this gift. I made it for you.”",
            "score": 45,
            "author": "Uniblab_78",
            "replies": [
                {
                    "level": 1,
                    "comment": "“Oh. Okay. Thank you.”",
                    "score": 24,
                    "author": "thereal_lucille"
                }
            ]
        },
        {
            "level": 0,
            "comment": "/r/accidentalrenaissance",
            "score": 52,
            "author": "kthejoker",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Twins, Basil! Twins!",
            "score": 27,
            "author": "Busted_Knuckler"
        },
        {
            "level": 0,
            "comment": "That’s very similar to Queen’s Gambit in the style.",
            "score": 114,
            "author": "knityourownlentils",
            "replies": [
                {
                    "level": 1,
                    "comment": "Coincidentally, that was a young girl in the 1950s, as well.",
                    "score": 58,
                    "author": "ass_hamster",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's almost as if they gave actors costumes based on the time period. Crazy.",
                            "score": 82,
                            "author": "destiny24",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Queens gambit?",
                    "score": 23,
                    "author": "Scarboroughwarning",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "From British X-Men",
                            "score": 102,
                            "author": "simpkill",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Lol",
                                    "score": 16,
                                    "author": "Scarboroughwarning"
                                },
                                {
                                    "level": 3,
                                    "comment": "Wasn't that the prequel to Zed-Men?",
                                    "score": 14,
                                    "author": "Billbeachwood"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "A show on netflix",
                            "score": 14,
                            "author": "taybay462",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks... Good lord, so much great clothing. A brief glance at an image search, had me very pleased.",
                                    "score": 22,
                                    "author": "Scarboroughwarning",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You should give it a watch, if you have the ability. It’s only around 9 episodes. Some of the most on-point costume and set design I’ve ever seen. There were points where I was pausing the show to just gaze at the wallpaper in rooms.",
                                            "score": 19,
                                            "author": "DonnerPartyAllNight",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Itsss so good. I thought it would be boring but finally put it on and literately could not stop watching it!!",
                                            "score": 6,
                                            "author": "BareLeggedCook",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is your grandma the queen?",
            "score": 20,
            "author": "WestoT",
            "replies": []
        },
        {
            "level": 0,
            "comment": "See that tinsel?\n\nThat shit is straight up lead. \n\nLead. Somehow polished and shiny. \n\nI used to wad it up in a ball and chew on it to make a really heavy little weight. Kind of like a fishing sinker. \n\nDifferent times folks.",
            "score": 12,
            "author": "Relax-Enjoy"
        },
        {
            "level": 0,
            "comment": "Hope they didn’t have a cat with all that tinsel!",
            "score": 15,
            "author": "Kitty-Idaho"
        },
        {
            "level": 0,
            "comment": "This has to be a posed photo, it’s gorgeous but I can’t imagine someone doing this candidly. If it is candid, that’s a damn lucky shot. Looks like a painting, I love it.",
            "score": 265,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nah that's how I deliver and accept all my gifts",
                    "score": 28,
                    "author": "Pipupipupi"
                },
                {
                    "level": 1,
                    "comment": "Of course its posed.",
                    "score": 104,
                    "author": "dronepore"
                },
                {
                    "level": 1,
                    "comment": "My guess is that this was a Christmas card photo.",
                    "score": 14,
                    "author": "Thin-White-Duke"
                },
                {
                    "level": 1,
                    "comment": "Is them posing supposed to make it any less cool or something?",
                    "score": 55,
                    "author": "Palin_Sees_Russia",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "What? No duh it's posed lol",
                    "score": 24,
                    "author": "Jaugust95"
                }
            ]
        },
        {
            "level": 0,
            "comment": "well damn, my black ass probably would have gotten lynched for saying it but, your grandma and great aunt were dimes.",
            "score": 12,
            "author": "lolwutbro_",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This is so melancholy.",
            "score": 13,
            "author": "bizbizbizllc"
        }
    ]
}