{
    "id": "136o8b9",
    "score": 5,
    "title": "Online asynchronous summer courses - time &amp; difficulty?",
    "author": "barkingformakima",
    "date": 1683125279.0,
    "url": "https://www.reddit.com/r/bostoncollege/comments/136o8b9",
    "media_urls": [],
    "other_urls": [],
    "postText": "I plan to apply to a Biology MS eventually, but I majored in an unrelated field for my undergrad, so I'm trying to take some courses to make a stronger application. I currently work full time at BC so I get free tuition. I'm unable to take most courses during the fall and spring semesters because they're offered outside my work hours, but the online asynchronous summer courses are a golden opportunity for me. \n\nHas anyone taken online asynchronous courses over the summer at BC? I'm looking to take Ecology &amp; Evolution and Intro to Physiology at the same time (5/17-6/28). How big of a workload is a summer class? With a full-time job, would two concurrent summer courses be a ridiculous amount of work?",
    "comments": [
        {
            "level": 0,
            "comment": "I'm only doing online async as a working student, and I wouldn't recommend two at once. Is there something you can take in Summer 2 instead?",
            "score": 2,
            "author": "antraxsuicide",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ah OK, I was hoping to load both courses into Summer 1 so I could take a vacation in Summer 2 without worrying about school. Would you be able to describe what the workload/stress level is like for a summer async course?",
                    "score": 1,
                    "author": "barkingformakima",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Stress isn't bad. Workload is a few assignments per week, without really a lull in there. Your midterm will be 3-4 weeks after your first day and your final is another 3-4 weeks after that, so the pace can be a lot if you can't dedicate time each week to get your stuff done. If you're on top of it, it's super manageable.",
                            "score": 1,
                            "author": "antraxsuicide"
                        }
                    ]
                }
            ]
        }
    ]
}