{
    "id": "iilpn7",
    "score": 42,
    "title": "First-Year Day 1: Already see the cracks",
    "author": "[deleted]",
    "date": 1598672550.0,
    "url": "https://www.reddit.com/r/bostoncollege/comments/iilpn7",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey everyone, I hope you’re all adjusting as well as reasonably possible. I just got my negative test today, so I decided to make the trip over to the main campus to check things out. Here are a few observations:\n\n1. Six feet apart isn’t happening and it won’t ever happen. It doesn’t help that it’s impossible to always be six feet apart from people the way things are structured, but people also just aren’t trying.\n2. I saw a bunch of people just walking around without masks on, even when there were a lot of people around.\n3. The dining halls make no sense. I feel like it defeats the purpose of social distancing when people can just sit and eat close together at the same table. Also, there was no disinfectant spray at the table where it was supposed to be, which is kind of weird.\n4. I heard a group of freshman talking about a party already, so that’s fun.\n5. The shuttles to/from Newton campus are way too crowded and the windows aren’t open.\n\nSorry if I come across as whiny, but I’m less than reassured by my first impression. I can already see the cracks, but let’s hope they’re not enough to sink this ship!",
    "comments": [
        {
            "level": 0,
            "comment": "Valid concerns. I have some comments on them also as a freshman. 1. 6 feet is totally not able to happen. In orientation meetings today (I had three) they had hundreds of us meet in the same places and then we broke into our groups...but walking to and from was a joke. 2. I haven’t seen anyone without masks yet...but I’ve heard people say “put your mask on” and most people listen so just speak up. 3. Dining halls make no sense. It’s really dumb...but what else can you do besides not allow seating indoors. I think this is inevitable bc idk how else we could do it. 4. The freshman have been gathering outside on upper (don’t know about newton) at night from like 7-1. Doesn’t seem to be any alcohol but who knows. I think people are just trying to meet each other. Let’s just pray they’re negative. 5. Newton busses are going to be a problem for sure. Again, it might be inevitable. \n\nCrossing our fingers everyone can stay!",
            "score": 18,
            "author": "bostoncollegestudent"
        },
        {
            "level": 0,
            "comment": "These things don’t concern me nearly as much as upperclassman, off-campus gatherings in basements without masks. On-campus activity can be regulated enough by social norms and administration to prevent meaningful covid spread. Freshmen won’t sink our ship, juniors on Foster street will",
            "score": 7,
            "author": "OhMyLemon"
        },
        {
            "level": 0,
            "comment": "So what you’re saying is I shouldn’t unpack when I get here? /s",
            "score": 6,
            "author": "Eugene-Spirit-Dragon"
        },
        {
            "level": 0,
            "comment": "Newton bus is definitely a big one. Extremely long lines that arnt spaced out and they are over crowding them. Hard to blame students as there really arnt many options",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "So... anyone wanna bet on when we’re going home? I say 13 Oct",
            "score": 0,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "That late? I’m giving it till the end of September",
                    "score": 14,
                    "author": "[deleted]"
                }
            ]
        }
    ]
}