{
    "id": "jlswc0",
    "score": 76,
    "title": "Have not made any friends yet :(",
    "author": "thegoatss",
    "date": 1604188904.0,
    "url": "https://www.reddit.com/r/bostoncollege/comments/jlswc0",
    "media_urls": [],
    "other_urls": [],
    "postText": "i haven’t made friends yet. none. not even one. i don’t know how to do it. i don’t know what’s wrong with me. i’m sitting all alone in my dorm this weekend as i usually do every weekend but this one hurts especially bad because its halloween and everyone is out there having fun. it feels like i’m wasting my college experience. it’s making me feel very sad",
    "comments": [
        {
            "level": 0,
            "comment": "Hey homie don’t think there’s anything wrong with you; I’m in the same spot! I feel a lot of college students go through this and this COVID thing isn’t really helping. I’m alone too today and my plans are to binge one of my favorite shows atm and eat candy! This Halloween may not have turned out well for you, but there’s always next year, so try to make the best out of this situation.\n\n-we can be long distance friends if ya want or just need someone to talk to!-",
            "score": 43,
            "author": "linsertoriginalnamel"
        },
        {
            "level": 0,
            "comment": "Honestly same. Like I know some people but they kind of already have friend groups so it makes it kind of awkward. Sometimes it makes me feel better to remember that there’s probably a bunch of people here that feel the same way, we just don’t know it.\n\nEdit: If you never need someone to talk to, feel free to pm me",
            "score": 17,
            "author": "throwaccount3333222"
        },
        {
            "level": 0,
            "comment": "Not just you boss, in the same boat",
            "score": 25,
            "author": "Adorable_Judgment_74",
            "replies": [
                {
                    "level": 1,
                    "comment": "ah, i guess it helps to know i’m not alone",
                    "score": 13,
                    "author": "thegoatss"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You’re definitely not only one. Remember that (except for the kids that all went to the same Philadelphia prep school) everyone arrived in late August without knowing anyone. And it’s definitely not too late now to make friends. Some of my best friends now (I’m a senior) I met sophomore year or later. W/ covid I know it changes this drastically, but nothing’s stopping you from knocking on the door of someone from your hall/zoom class that you think you may get along well with and just chatting them up and maybe seeing what they’re doing for the weekend/if they want to hang out and join you for a hobby you enjoy. Try this tomorrow afternoon (or next weekend, whenever) with someone on your hall!! Think it sounds weird to just hit up a stranger like that? I get that, but consider what you would do if another freshman asked you to hang out. I’m sure you’d accept! Go into any conversation with CONFIDENCE because I’m sure there are tons of others in the same boat, looking for friends. Good luck!",
            "score": 10,
            "author": "fantasyfool"
        },
        {
            "level": 0,
            "comment": "If you wanna talk or meet up sometime feel free to reach out! This goes for anyone who’s feeling alone and needs someone to talk to. I went through HS feeling alone far more often than I’d care to admit so it’d be my pleasure to help anyone who’s going through anything similar",
            "score": 9,
            "author": "RoyalSloth"
        },
        {
            "level": 0,
            "comment": "All of you who agree should all hang out!",
            "score": 6,
            "author": "not_mrsrobinson"
        },
        {
            "level": 0,
            "comment": "hiya buddy",
            "score": 4,
            "author": "dr-johndorian"
        },
        {
            "level": 0,
            "comment": "I went to BC for grad school and worked with freshmen a lot in ResLife. It’s really hard to adapt to BC’s culture, especially if you’re not sort of the prototypical straight athletic person. You’ll find folks though. It’s hard during the pandemic I’m sure but there are lots of great people there.",
            "score": 6,
            "author": "Quarantined_Queer"
        },
        {
            "level": 0,
            "comment": "maybe focus on making friends through coursework and extracurricular activities rather than Halloween parties.",
            "score": 7,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "hard to do that w covid going on :/",
                    "score": 7,
                    "author": "thegoatss"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm so so sorry that you're going through this, it takes time to find friends and it takes A REALLY LONG TIME to find real friends. The only advice I can give you is to join something, anything. There are tons of clubs that are still running virtually. I've heard really great things about Freshman League and Ascend. There are service clubs like 4Boston that are still accepting applications. I (senior) have found some of my best friends through clubs/activities",
            "score": 2,
            "author": "im_just_the_milkman"
        },
        {
            "level": 0,
            "comment": "When I went to BC, I always wish I joined more clubs and activities. \n\nNot only are some great on resumes or good for networking, but I think that is how people made their friends. I didn't start joining until Senior year, and I regret it. \n\nSo, I would encourage you to do that. And as annoying as \"you're not alone\" is, seriously, this happens to so many. It is sad. I try not to be cynical about BC as well, but it may be a little harder to make friends there. Just join stuff, even if it makes you uncomfortable, even if you just go to an event or meeting once, to test it out. \n\nIf I could re-do BC, I would try to join everything! Good luck, you will figure it out. Promise.",
            "score": 2,
            "author": "WastingMyTime2013"
        },
        {
            "level": 0,
            "comment": "Aye homie I feel you. It’s been tough, there’s nothing wrong with you. I recommend joining some sort of club or community just to get to know some people. It can get really lonely in the weekends sometimes, but I promise you’ll find your pack. Just give it time. Shoot me a DM if you wanna be friends, I’m down!!",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Same boat, I talk to my neighbors sure but I’m more an acquaintance to them I’m guessing, but I find it quite advantageous to have the whole weekend to get ahead on coursework. Does suck to not be able to do anything, but I definitely recommend joining a few clubs, they definitely help with the loneliness phase when you have something to at least look forwards too on weekends, even if it’s virtual",
            "score": 1,
            "author": "OmegaElf"
        },
        {
            "level": 0,
            "comment": "Same boat dawg :(",
            "score": 1,
            "author": "XxShinyBlastoise"
        },
        {
            "level": 0,
            "comment": "I made a discord for this exact thing! \n\nHere's a link: https://discord.gg/rma9zseqce",
            "score": 1,
            "author": "Trumq"
        }
    ]
}