{
    "id": "mq5krr",
    "score": 60,
    "title": "No parents allowed at graduation",
    "author": "NLBLUE",
    "date": 1618330575.0,
    "url": "https://www.reddit.com/r/bostoncollege/comments/mq5krr",
    "media_urls": [],
    "other_urls": [],
    "postText": "This announcement is honestly one last fuck you to seniors. My parents care so much more about the ceremony than I do this is insulting. I honestly just want the diploma at this point.",
    "comments": [
        {
            "level": 0,
            "comment": "I  just can't believe they waited this long to make an announcement. Some of us aren't rich and our families bought plane tickets and hotels early to save money ??",
            "score": 47,
            "author": "Jaded-Coconut5832",
            "replies": [
                {
                    "level": 1,
                    "comment": "Facts",
                    "score": 11,
                    "author": "ofjdrews"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Literally no point in having in person graduation  if my family can’t come.",
            "score": 33,
            "author": "Select_Accident5731"
        },
        {
            "level": 0,
            "comment": "As a low level admin, my heart goes out to all of you in classes of 2020 &amp; 2021. They handled this so poorly for both classes and I’m sorry you all got shafted. \n\nFor class of 2020- it was brought up in commencement meetings last year that there was a very good chance that the October ceremony wouldn’t happen yet they wouldn’t let the individual schools do anything “official” in May to take away from the now-nonexistent October ceremony. They want to do something over alumni weekend this year for 2020 but so many of you have left and I honestly doubt alumni weekend will even happen this year too. \n\nFor class of 2021 - for most of this year, they had us meet under the guise a normal ceremony would be happening when most of us knew logically that it wouldn’t. They still haven’t clarified if there can be school diploma ceremonies, which is bullshit too. \n\nBC upper admin love to put their head in the sand when shit is happening, then act all surprised when they sit up and shit is on fire.",
            "score": 15,
            "author": "bringonthebullshit",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was told that each school is deciding on their individual ceremonies. One of the biz school deans said that CSOM is trying to plan their ceremony now and the logistics of it",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "One of the biggest issues is that a lot of the schools hold their diploma ceremonies under a tent or in an enclosed building. With the delay in the announcement and the social distancing guidelines, it will be very hard to find a tent to rent at this point to hold a ceremony in person as planning has been on hold without a decision from the university. If they had told everyone of this decision months ago, it may have been more logistically possible but now its looking like most school ceremonies will have to occur virtually, probably on a different day than May 24.",
                            "score": 4,
                            "author": "bringonthebullshit"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If it's in alumni, then there is no reason why parents shouldn't be able to come and be socially distanced. Feel for the seniors cause this is brutal.",
            "score": 29,
            "author": "SammyD543"
        },
        {
            "level": 0,
            "comment": "So here is my question for BC admin: why can you not do what Northeastern is doing? Northeastern is doing an in person graduation allowing undergrads to bring two guests (presumably parents). Northeastern has more students, 14,676 undergrads, roughly 3670 seniors and is hosting in Fenway park which has a capacity of 37,755 compared to Alumni Stadium’s capacity of 44,500. We have less students, 2,412 in the class of 2021, and more capacity. What is the problem? It’s obviously not the city of Boston or the State. Who has the problem? The City of Newton or BC? This decision pretty much goes against the science about outdoor transmission and we know it is feasible because is being done 4 miles away by a comparable school.",
            "score": 32,
            "author": "00Civin",
            "replies": [
                {
                    "level": 1,
                    "comment": "Do they not want parents to be traveling maybe? It sucks",
                    "score": 1,
                    "author": "not_mrsrobinson",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Parents are traveling anyway to come pick their kids up and move them out!",
                            "score": 3,
                            "author": "Two_Shoez"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Almost as insulting as mailing the class of 2020 their diplomas and having no ceremony virtual or inperson.",
            "score": 23,
            "author": "ArrowHelix"
        },
        {
            "level": 0,
            "comment": "As my mother put it when she heard the news: \"so it's us parents who foot the bill but we're not even allowed to attend commencement?\"",
            "score": 16,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Leahy &amp; Co. should be ashamed of themselves for this decision. The vaccine is widely available by the 19th, so there’s no reason why seniors couldn’t have 2/3 guests at their graduation. Alumni has a capacity of close to 44,000!!!",
            "score": 15,
            "author": "StretchOwn133"
        },
        {
            "level": 0,
            "comment": "As a 2020 grad, I'm so jealous of you all.",
            "score": 7,
            "author": "ItWillbeZeroOff",
            "replies": [
                {
                    "level": 1,
                    "comment": "Frankly, I'm not. I'd rather have your senior year than mine. All we have to speak of for senior year is graduation; we didn't get anything else. I would kill to have gotten annihilated at a football game this year, or go on spring break.\n\nI guess the grass is always greener on the other side. This isn't to diminish your suffering. You got railed, too.",
                    "score": 16,
                    "author": "HeresW0nderwall",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh for sure our situations both suck. It’s just as a first gen student it was my parents’ dreams to at least see me walk so seeing this makes me super jealous of you all.",
                            "score": 5,
                            "author": "ItWillbeZeroOff",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I got you man. I’m sorry, it’s so unfair.",
                                    "score": 6,
                                    "author": "HeresW0nderwall"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you think this came from BC and not the state then you’re kidding yourself. BU is in-person with no guests, Harvard is all virtual, Northeastern is doing two ceremonies (splitting the graduates in half) and is allowing one guest each. If the state let BC have parents, BC would have parents. It’s not even a question.",
            "score": 4,
            "author": "MrNumberOneMan",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hi. I just want to clarify some things about Northeastern. They are doing two ceremonies because they are doing both the class of 2020 and 2021 so it would make sense that there are two ceremonies as they have twice as many students. Also, as of their website each student is allowed two guests not one. Given Northeastern was approved for their plan I don’t think it is an accurate assumption that this is a statewide policy, unless NE is somehow exempt from the rule.",
                    "score": 5,
                    "author": "00Civin"
                },
                {
                    "level": 1,
                    "comment": "If it’s just the state, which (along with Boston) allows 12% capacity on stadiums, then why can NE still allow guests? I would rather BC follow NE’s example than this charade.",
                    "score": 1,
                    "author": "pretentious_pudding",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It may not just be about capacity. It may also be about the influx of visitors from out of state. I just think assuming BC wanted to avoid having commencement is backwards thinking because even last year they held out before announcing there wouldn’t be one in the hopes they could make it happen. If they could have done it I really believe they would have. Who knows why or how NU is pulling theirs off.",
                            "score": 0,
                            "author": "MrNumberOneMan",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Visitors who will be here anyways to help seniors move out. They seriously did not think this through, unless they’re giving seniors a housing extension, which is begging for trouble",
                                    "score": 1,
                                    "author": "pretentious_pudding",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You’re blinded by your anger about this. BC wanted to do a commencement and would be doing a bigger one if they could. Sorry but it’s true.",
                                            "score": 2,
                                            "author": "MrNumberOneMan",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": " No, I’m bringing up valid points the administration failed to consider. How can you ask hundreds of parents to come pick up their kids and move them out of college the day of their graduation, some flying or driving hundreds of miles, and then tell them “sorry, you’re not gonna see your kid graduate it doesn’t make sense especially when you consider that parents won’t be able to see it anyway for the most part on Zoom because they’ll be traveling to help kids move out.",
                                                    "score": 4,
                                                    "author": "pretentious_pudding"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "People are literally dying",
            "score": 4,
            "author": "sm4269a"
        },
        {
            "level": 0,
            "comment": "i love when everyone starts complaining about covid restrictions and then goes ahead and supports every liberal policy\n\nEdit: people downvoting as if its not true",
            "score": 9,
            "author": "bcthrowaway2024"
        }
    ]
}