{
    "id": "txy11b",
    "score": 3,
    "title": "Corporate finance with Aimee Smith or Simcha Barkai?",
    "author": "bcro928",
    "date": 1649284026.0,
    "url": "https://www.reddit.com/r/bostoncollege/comments/txy11b",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "I took Barkai... he's a great professor and is always willing to help.  He makes sure the class goes through the course slowly to understand.  There were 4 group cases which also were not terrible.  The one thing that sucks is the tests, which are not open notes (not even formulas).  However, the material on these tests comes directly from examples we did in class or the powerpoint, so there are very few curveballs.  Overall can't go wrong.",
            "score": 3,
            "author": "Medium_Holiday_3904",
            "replies": [
                {
                    "level": 1,
                    "comment": "Is he a tough grader?",
                    "score": 2,
                    "author": "alexa-logic"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hard disagree with the other comment about Barkai. The man is an absolute bot and does not have any humanity whatsoever. One of the people in our case groups had a medical emergency so our group could not complete the case on time...he gave us a whopping two hour extension. He is a very smart man, but is a horrible teacher who does not take the time to explain concepts to the class. The only people who understood the class were the ones that already recruited for banking so they had done technical prep, everyone else was absolutely lost. The 4 group cases referenced were bad because Barkai did not bother to teach or explain the concepts involved in the cases, so we were completely flying blind (I know cases inherently involve some aspect of this but other teachers generally will point you in the right direction).  Also, Barkai does not provide feedback on the cases in a timely manner, so we could not use that feedback to improve on the next case which was due. Overall stay away.",
            "score": 1,
            "author": "derp08"
        },
        {
            "level": 0,
            "comment": "neither. Take a class that isn't just about making money for rich people",
            "score": -8,
            "author": "willyleahy",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s not just about that… you also learn how to minimize your taxes",
                    "score": 1,
                    "author": "Costco_Whoresale"
                },
                {
                    "level": 1,
                    "comment": "Investors need to know how to read a balance sheet",
                    "score": 1,
                    "author": "sm4269a"
                }
            ]
        }
    ]
}