{
    "id": "zyp32e",
    "score": 4,
    "title": "Thoughts on Globalization with Paul Christensen?",
    "author": "Friendly-Ad-8058",
    "date": 1672369238.0,
    "url": "https://www.reddit.com/r/bostoncollege/comments/zyp32e",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi! I am interested in taking this course but was wondering if anyone could share their experiences with the workload. In particular, how long is the writing for the research project and take home exams? Thanks! ",
    "comments": [
        {
            "level": 0,
            "comment": "I just took Comparative Revolutions with him this past semester, and I think the course structure is at least somewhat similar to his globalization class so I think this should help. In total I don’t think the workload was terrible - as you noted, there’s basically no busywork, it’s just a couple huge assignments. It really depended on the week.\n\nThe research project was no joke at all. At least in my course, you had to pick your topic over a month before it was due, and this was legitimately an assignment where if you didn’t start working at least 2 weeks in advance you would be in big trouble. It was legitimately probably the hardest I have ever worked on an assignment, my total project came out to like 17 pages including citations. With that said, it wasn’t *that* difficult — the actual content was pretty easy to understand and write about — but it was just an incredible amount of effort.\n\nThe take home essays were a lot tamer, basically what you’d expect from like an upper level Polisci class. The first one was like 8 pages and the final exam was 2 different essays that combined for 10 pages. While he’s certainly not the type of professor to give everyone an A, he is also a pretty easy grader in my experience. Like a 6-7/10 easiness.\n\nLectures are interesting, although I thought the content in my course was a bit too niche for my tastes. He is a good lecturer and it’s extremely obvious that he’s a crazy smart and knowledgeable guy. He also knows an insane amount about Russia-Ukraine (it is like his speciality) which I believe the globalization class will touch on a lot. He’s also a really nice guy outside of class and is not an asshole at all about like extensions etc.\n\nOverall I’d recommend! He’s a solid prof. But just… watch out for that research project.",
            "score": 3,
            "author": "Choice_Rice_1178",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much for your thoughtful reply! I really appreciate your help",
                    "score": 1,
                    "author": "Friendly-Ad-8058"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I took that class with him maybe 6 years ago, so things may have changed. I honestly don't remember how much time I spent on the exams or research paper, but I remember feeling like the workload was reasonable even with my full course load, part-time job, and volunteering. I'm sorry I can't be more helpful with regard to your actual question, however, I really recommend taking a course with Christiansen. He was literally one of my favorite professors.",
            "score": 2,
            "author": "PinceOfThieves",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much for your help!",
                    "score": 1,
                    "author": "Friendly-Ad-8058"
                }
            ]
        }
    ]
}