{
    "id": "13oxqfl",
    "score": 217,
    "title": "AI-assisted architectural design iterations using Stable Diffusion and ControlNet",
    "author": "Alternative_Lab_4441",
    "date": 1684777545.0,
    "url": "https://v.redd.it/yieje1az6f1b1",
    "media_url": "https://v.redd.it/yieje1az6f1b1",
    "comments": [
        {
            "level": 0,
            "comment": "\"super duper uber realistic\" lol\n\nedit: fantastic work!",
            "score": 12,
            "replies": [
                {
                    "level": 1,
                    "comment": "haha thanks!",
                    "score": 1
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 9
        },
        {
            "level": 0,
            "comment": "Awesome work! Also, the tune slaps, what is it?",
            "score": 6,
            "replies": [
                {
                    "level": 1,
                    "comment": "thanks! music by me and a couple of friends, glad you like it!",
                    "score": 2,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hell yeah! Got it online anywhere?",
                            "score": 1
                        },
                        {
                            "level": 2,
                            "comment": "It's awesome.  Got anything to share?",
                            "score": 1,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "https://soundcloud.com/ismailseleit",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You know someone is the real deal when the showcase video itself is well-produced.",
            "score": 5
        },
        {
            "level": 0,
            "comment": "This was amazing and it took the super duper Uber realistic prompt quite well!",
            "score": 3
        },
        {
            "level": 0,
            "comment": "Nice. What's that version of stablediffusion you're using?",
            "score": 2,
            "replies": [
                {
                    "level": 1,
                    "comment": "version 1.5 with realistic vision v2 as checkpoint",
                    "score": 4
                }
            ]
        },
        {
            "level": 0,
            "comment": "Awesome work there mate! \nRepo?",
            "score": 2,
            "replies": [
                {
                    "level": 1,
                    "comment": "thanks! what's a repo?",
                    "score": 1,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Repository (source code)",
                            "score": 1,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Stable Diffusion - Automatic1111 web UI\n\n[https://github.com/AUTOMATIC1111/stable-diffusion-webui](https://github.com/AUTOMATIC1111/stable-diffusion-webui)\n\n&amp;#x200B;\n\nControlNet 1.1\n\nhttps://github.com/lllyasviel/ControlNet-v1-1-nightly",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is what i was trying to search for ! I am an architecture student and i was curious if i could have the basic elevation views or sections in Revit and them let AI render instead of Enscape or Lumion .",
            "score": 2
        },
        {
            "level": 0,
            "comment": "omfg this is amazing. Really changes concept designs and napkin sketches forever. Could you share the complete prompt you used? Thanks!",
            "score": 2,
            "replies": [
                {
                    "level": 1,
                    "comment": "I realized after posting this on the stablediffusio sub that I am really messy with my prompts and that a lot of stuff there is useless but here's one:\n\nparameters\nRAW photo, exterior shot, residential tower, ((((beautiful building proportions)))), (((golden ratio))), ((((photo composition)))), (((white concrete material))), (((night shot))), (((contemporary style))), ((reflections)), (((motion blur))), (((city night life environment))), ((a lot of trees)), ((architectural masterpiece)), rooftop bar, city center background, (((20 persons around building))), ((atmospheric lighting)), night photography, ((((sculptural masterpiece)))), hyper detailed, 8k, super realistic, (((architecture design))), low key, noise offset, fujifilm, film grain\nNegative prompt: EasyNegative, badhandv4, monochrome, out of frame, lowres, text, error, cropped, worst quality, low quality, jpeg artifacts, ugly, duplicate, morbid, mutilated, out of frame, extra fingers, mutated hands, poorly drawn hands, poorly drawn face, mutation, deformed, blurry, dehydrated, bad anatomy, bad proportions, extra limbs, cloned face, disfigured, gross proportions, malformed limbs, missing arms, missing legs, extra arms, extra legs, fused fingers, too many fingers, long neck, username, watermark, signature\nSteps: 25, Sampler: DPM++ 2M Karras, CFG scale: 7, Seed: 424680968, Size: 768x1024, Model hash: c0d1994c73, Model: realisticVisionV20_v20, ControlNet Enabled: True, ControlNet Preprocessor: scribble_xdog, ControlNet Model: control_scribble-fp16 [c508311e], ControlNet Weight: 1, ControlNet Starting Step: 0, ControlNet Ending Step: 1, ControlNet Resize Mode: Crop and Resize, ControlNet Pixel Perfect: False, ControlNet Control Mode: My prompt is more important, ControlNet Preprocessor Parameters: \"(512, 32, 64)",
                    "score": 2,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you!\n\nbtw I guess for architectural uses this part:\nxtra fingers, mutated hands, poorly drawn hands, poorly drawn face, mutation, deformed, blurry, dehydrated, bad anatomy, bad proportions, extra limbs, cloned face, disfigured, gross proportions, malformed limbs, missing arms, missing legs, extra arms, extra legs, fused fingers, too many fingers, long neck\n\ncan be removed?",
                            "score": 1,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "for sure, like i said i an still really bad and messy with my prompts.. but sometimes this messiness brings out some interesting stuff",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I love how everyone is like \"Great work!\"\n\nIt's like he walked into a room, flicked the light switch and everyone applauded when the room got bright.",
            "score": 2,
            "replies": [
                {
                    "level": 1,
                    "comment": "Which right after the electric bulb was invented, would have elicited similar responses.\n\nAlong with - Burn the Witch!",
                    "score": 1,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I feel like that kind of reaction is warranted during that era. Nobody knew how electricity worked. People had never been exposed to that kind of technology in their daily lives. Literature and education were hard to come by compared to today where - a lot of people already understand what these things are, how they operate and people are largely exposed to new and interesting technologies on an almost yearly basis. \n\nI really think a large part of the problem is that a lot of people who use AI (Not necessarily OP) WANT this kind of reaction.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "  \nYa I would prefer a real architect over see any AI based designs.",
            "score": 2,
            "replies": [
                {
                    "level": 1,
                    "comment": "I run a small boutique real estate marketing firm. These visualizations are not meant to replace architectural drawings but are very often used for pre-construction sales, helping foreign customers get a vibe, etc. Generally, I will have my 3D team work of CAD and accompanying architectural drawings to build out a hyper realistic rendering of the building. This will cost the client ~$2,500 - $7,500 per image. In this case, I see myself cutting a significant amount of the costs and still having great marketing material for a RE project.",
                    "score": 2,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I am glad to hear that you do not trust an AI to do the actual blueprint of the building.",
                            "score": 1
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Have you ever worked with an architect? They are all useless. Expensive, slow, most dont have a good vision. Give me an AI architect any day of the week.",
                    "score": -5,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Most architects I know have great vision. The problem is the clients and their unwillingness to properly budget out for unseen occurrences; which inevitably leads to overshooting the budget; which inevitably leads to cutting every cool design feature; which inevitably leads to ending up with just another glass box.",
                            "score": 1,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "AI in its present form is unreliable and can't tell fiction from fact.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Artify Labs livedraw has a Photo style that would probably make this easier. You can also edit the sketch on the fly. \n\nhttps://artifylabs.io/livedraw",
            "score": 1
        },
        {
            "level": 0,
            "comment": "Lit",
            "score": 1
        },
        {
            "level": 0,
            "comment": "What's the extension for prompt autocomplete?",
            "score": 1,
            "replies": [
                {
                    "level": 1,
                    "comment": "https://github.com/DominikDoom/a1111-sd-webui-tagcomplete",
                    "score": 2,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you!",
                            "score": 1
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I second this.",
                    "score": 1
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "replies": [
                {
                    "level": 1,
                    "comment": "havent tried it, but i would recommend testing out the 'inpainting' feature in stable diffusion it is sort of like an ai photoshop where you can edit certain parts of an image using prompts.. dont know if this answers your question",
                    "score": 2
                }
            ]
        },
        {
            "level": 0,
            "comment": "Nice!",
            "score": 1
        },
        {
            "level": 0,
            "comment": "Content is impressive, tho I admit I was put off by the rapid change of flashing images in the intro.",
            "score": 1,
            "replies": [
                {
                    "level": 1,
                    "comment": "all iterations here:\nhttps://www.linkedin.com/posts/ismailseleit_architecture-aiarchitecture-ai-activity-7058067551653703680-jalE?utm_source=share&amp;utm_medium=member_android",
                    "score": 1
                }
            ]
        },
        {
            "level": 0,
            "comment": "Omg thanks! I was looking for some tutorial like that!!! Awesome!",
            "score": 1
        },
        {
            "level": 0,
            "comment": "Okey have a question for portofolios, lets say u drew a picture how u imagine a new building... U came to an Ai, u found good looking pic than u use it to make blueprints and now u have to present everything in portofolio. WOULD it be possible to make same photos (basicily same building) from another angles to present them?",
            "score": 1
        }
    ]
}