{
    "id": "13penvo",
    "score": 117,
    "title": "Wharton School's Prof. Ethan Mollick asks students to use Bing for assignment: Formulate 'Impossibly Ambitious' business Ideas and simulate critique from famous founders",
    "author": "wyem",
    "date": 1684818352.0,
    "url": "https://i.redd.it/7byqp1naki1b1.jpg",
    "media_url": "https://i.redd.it/7byqp1naki1b1.jpg",
    "comments": [
        {
            "level": 0,
            "comment": "Nice! This is exactly the approach that needs to be adopted, as a tool to complement your skill[s]et.\n\nEdit: a letter",
            "score": 13,
            "replies": [
                {
                    "level": 1,
                    "comment": "Indeed, a spatula would complement it nicely.",
                    "score": 4
                }
            ]
        },
        {
            "level": 0,
            "comment": "I love that he’s incorporating it in the class. It’s a pretty groundbreaking move, it must have been the talk of the faculty.\n\nMy only concern is that it still might not be a big enough workload given how quickly one can gun through those prompts, especially since it’s a team project. He might have to see how it goes and strike a balance if they find it too easy still.\n\nThe fact that he’s making business management students make a functioning app/website would have seemed ridiculous two years ago, but now it adds a level of complexity that is just necessary with ChatGPT in the picture, it can’t just be a PowerPoint or basic project document anymore.",
            "score": 22
        },
        {
            "level": 0,
            "comment": "ChatGpt imo weeds out the bad teachers/prodessors from the good ones. A bad professor will be lazy and not find ways to utilise it to reach and blame students for plagiarism, a good teacher/professor will be able to maximise methods and find new creative ways to teach.",
            "score": 4
        },
        {
            "level": 0,
            "comment": "Finally someone who gets it",
            "score": 2
        },
        {
            "level": 0,
            "comment": "Super smart!",
            "score": 2
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 8,
            "replies": [
                {
                    "level": 1,
                    "comment": "he's a twitter influencer. almost certain he shared this",
                    "score": 18,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You're right.  He did.  He's https://twitter.com/emollick",
                            "score": 7
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "He himself shared on Twitter: https://twitter.com/emollick/status/1660794981286641670",
                    "score": 3
                }
            ]
        },
        {
            "level": 0,
            "comment": "What are some of the projects that have been created?",
            "score": 2
        }
    ]
}