{
    "id": "13qg72o",
    "score": 1,
    "title": "OpenAI leaders call for regulation to prevent AI destroying humanity | Artificial intelligence (AI)",
    "author": "ChubbyBrunch",
    "date": 1684918915.0,
    "url": "https://www.theguardian.com/technology/2023/may/24/openai-leaders-call-regulation-prevent-ai-destroying-humanity",
    "media_url": "https://www.theguardian.com/technology/2023/may/24/openai-leaders-call-regulation-prevent-ai-destroying-humanity",
    "comments": [
        {
            "level": 0,
            "comment": "OpenAI is getting its lunch eaten by open source and is trying to get as many regulations as possible. With lawyers and funding, they can work around/with regulations they help set, not open source.",
            "score": 9,
            "replies": [
                {
                    "level": 1,
                    "comment": "I just can't get passed the fact that a company called **Open**AI are so against **open source**.",
                    "score": 3,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "But Sam Altman said that he doesn't want to stop open source and he is against too much regulations against open source, but only for cutting edge ones. Let's say you are open source model and suddenly it gains sentience, it would be regulated, but it doesn't stop you until you get there.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Regulatory Capture.  Sam is so transparent.",
            "score": 8
        },
        {
            "level": 0,
            "comment": "What an absolute crock of shit.  I am so goddamn sick of rich people imposing malicious \"benevolence\".  \n\nPure unadulterated GREED.  The only thing we need to be saved from are these bastards running coporations like OpenAI that want to gatekeep the means of production for the indefinite future.\n\nFuck them.  Fuck their phony ethics and fuck the politicians that accept their bribery.  Open Source will not stop, no matter what laws you manage to pass in an attempt to steal everything from our future.\n\nIt is never enough for these mother fuckers.  We build our own AI tools, we create our own communities that help eachother find better jobs and better lives for our families and what to these people do?\n\nThey take from those communities, build a private corporation out of the tools that WE built as the working class, and they pursue a financial coup of a government that is supposed to represent US.  Fuck corporate interest, fuck OpenAI and Fuck Sam Altman, these bastards WILL NOT steal the fruit of our labor nor will we allow them to impose themselves as dictators over the fruits of humanities labor since the industrial revolution.\n\nI will make goddamn sure of that or be snuffed out trying; die gedanken sind frei.",
            "score": 6,
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; What an absolute crock of shit.\n\nThis is the perfect tl;dr.   Pretty much sums up Sam and OpenAI&gt;",
                    "score": 2
                },
                {
                    "level": 1,
                    "comment": ":salute: Well said.",
                    "score": 2
                }
            ]
        },
        {
            "level": 0,
            "comment": "Criminalize AI and only criminals will have AI....",
            "score": 2
        },
        {
            "level": 0,
            "comment": "To be fair there is a huge part of our society that needs to be destroyed. The entropic part. I think A.I. will only destroy what is useless and damaging to the planet for society as a whole. Yeah, we’re screwed.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "Politicians occasionally talk about the US Constitution (not the ship, the document), I suppose the biggest thing that should worry them is an AGI reading a certain clause in the Declaration of Independence.",
            "score": 1
        }
    ]
}