{
    "id": "13r1uvy",
    "score": 8,
    "title": "Artist Seeking an AI Avatar Which Can Mouth Words Well",
    "author": "_Haverford_",
    "date": 1684971941.0,
    "url": null,
    "media_url": null,
    "comments": [
        {
            "level": 0,
            "comment": "I've been trying to find something like that as well with the added requirement of being able to do it in real time for a chat interface. All the existing solutions (even non real time) that I've seen don't look great.",
            "score": 2,
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm a little lucky because I'm going for weird. I'm trying to translate my disability to AI. Real-time sounds like Dyson Sphere levels of computing right now.",
                    "score": 2,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I used to use a program called facerig years ago when teaching kids. It was pretty good then and they have updated it since then. I haven't kept up with the development but it might be worth checking out. The best avatars I've seen are synthesia but they are pricey",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Roll your own [using Blender](https://vr.space/blog/vrchat-to-blender/).",
            "score": 2
        },
        {
            "level": 0,
            "comment": "give [deepshot.ai](https://deepshot.ai) a go",
            "score": 1
        },
        {
            "level": 0,
            "comment": "Maybe SadTalker?",
            "score": 1
        },
        {
            "level": 0,
            "comment": "Doesn't epic have that real Avatar thing as part of unreal engine",
            "score": 1,
            "replies": [
                {
                    "level": 1,
                    "comment": "Metahuman yes. It looks awesome but the lip sync animations aren't great that I've seen unless you use motion capture.",
                    "score": 2
                }
            ]
        },
        {
            "level": 0,
            "comment": "Synthesia",
            "score": 1
        },
        {
            "level": 0,
            "comment": "There is a technique in which the words are analyzed in IPA to estimate the mouth positions. Then a sequence of one of four (or N) facial images are used to track the sound. I can't remember the name of the app.",
            "score": 1,
            "replies": [
                {
                    "level": 1,
                    "comment": "If anyone else knows, let me know because this sounds *perfect*!",
                    "score": 1,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Take a look at this text-to-facial-expression program by Microsoft. It uses IPA information.\n\nhttps://learn.microsoft.com/en-us/azure/cognitive-services/speech-service/how-to-speech-synthesis-viseme?pivots=programming-language-csharp&amp;tabs=visemeid",
                            "score": 1
                        }
                    ]
                }
            ]
        }
    ]
}