{
    "id": "13vcujn",
    "score": 4,
    "title": "Here in May of 2023, what’s the best image synthesizer that’s available and accessible for the average user?",
    "author": "katiecharm",
    "date": 1685410824.0,
    "url": "https://www.reddit.com/r/artificial/comments/13vcujn",
    "media_urls": [],
    "other_urls": [],
    "postText": "Is it still Stable Diffusion?  I’d like to get into creating some amateur video games, but art has never been my strong suit.  I feel blessed to be living in a world where that’s not going to be a barrier anymore.  \n  \nI’m willing to pay a reasonable monthly subscription fee for a good service, and also I have my own 3080 for running models locally.  I have basic coding knowledge and am technically literate enough to learn new things if need be.  \n  \nThat being said - what’s the best solution here in the present for creating images?",
    "comments": [
        {
            "level": 0,
            "comment": "If youve got a 3080, the best option is using Automatic1111 software on your pc using a model from CivitAI.",
            "score": 3,
            "author": "residentchiefnz",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well you sure get the award today for giving me new search terms I never previously knew existed.  Thank you.",
                    "score": 2,
                    "author": "katiecharm",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Welcome to the educational rabbit hole that is AI art :)",
                            "score": 2,
                            "author": "residentchiefnz",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Okay listen, I owe you such a huge thank you.  I downloaded the front end tonight and it’s all so easy to use once you get it set up.  I have been downloading some of the models on that site and fooling with them and it’s absolutely shocking the quality of works you can generate - even with just a 3080.  I can get something that greatly exceeds any other web platform, for free, in about 60 seconds.  \n  \nPlus the level of control is bonkers.  I’m dipping my toes into some of the after rendering plugins, and they are just bonus magic.  This is exactly what I was looking for.  \n  \nNow all we need is fucking StableDiffusion, like every other AI creator, to stop lobotomizing its models in the name of Puritan morality.",
                                    "score": 2,
                                    "author": "katiecharm",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm glad you got it sorted :)  Happy generating!",
                                            "score": 2,
                                            "author": "residentchiefnz"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt; Automatic1111\n\nWill this work on a 2080Ti?",
                    "score": 2,
                    "author": "JDMcompliant",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Itll work on anything using the cpu, but on a gpu probably needs a 1050 or newer",
                            "score": 2,
                            "author": "residentchiefnz"
                        }
                    ]
                }
            ]
        }
    ]
}