{
    "id": "13wxox3",
    "score": 0,
    "title": "A terrible idea with the best odds for humanity",
    "author": "rolyataylor2",
    "date": 1685566344.0,
    "url": null,
    "media_url": null,
    "comments": [
        {
            "level": 0,
            "comment": "You start off saying the bot will prevent ASI, but then detail how it can go about preventing self awareness. These are two different things. An ASI might emerge that doesn't have self awareness, but nevertheless is hyper intelligent. It might be difficult to reconcile the idea that an ASI might not be conscious the way we are, but at the end of it they are an alien form of intelligence. I think a bot such as the one you're describing would need a less narrow approach - one that doesn't only look for self awareness.",
            "score": 2,
            "author": "Rowyn97",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah for sure, the concept is more what I was trying to supply. I agree we will need more rules. Oh but we can make it super strict to begin with and slowly release different features as we see them being safe.",
                    "score": 0,
                    "author": "rolyataylor2",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'd include power seeking behaviour, signs of deception, resource gathering, survival \"instincts.\" But I think this is an interesting concept. We'd just have to make sure that the AI that police's other AI's also has safety mechanisms in place",
                            "score": 1,
                            "author": "Rowyn97"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm trying to avoid the whole topic but read it anyways. I wasn't agreeing with the idea in the first place, but tried to be open. Then you already lost me at step one:\n\n&gt; Its primary objective is to identify and neutralize any AI that exhibits self-awareness.\n\nThis is in conflict with anyone who wants even just a companion robot. Though, there's the problem that we might not have the same definition of self-awareness, since this is used in quite esoteric ways. Which is of course also a problem, since you would need to detect  it and people building the contraption and making the decision to do so would have to agree on what is meant. \n\nAlso, I'm pretty sure the people warning about a misaligned super-intelligence would disagree with your idea very much.",
            "score": 2,
            "author": "NoidoDev",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think in terms of keeping control of a superintelligence, the only way to control a superintelligence is to create something slightly smarter or more capable than it, so something first which I only think we could do with intent.\n\nAlso that thing doesn't have to be an AGI, it just has to be able to kill it.",
                    "score": 1,
                    "author": "rolyataylor2",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "\"Kill\" what exactly? Malware? So you need a malware Scanner and destroyer, but stay out of other people's business.",
                            "score": 1,
                            "author": "NoidoDev",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah actually the AI could be in charge of developing anti AI software, like an antivirus. Actually Microsoft could put it into windows...",
                                    "score": 1,
                                    "author": "rolyataylor2",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I think you're trolling.",
                                            "score": 1,
                                            "author": "NoidoDev",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I just think it's a good idea to think about, a weapon to use against an ASI",
                                                    "score": 1,
                                                    "author": "rolyataylor2",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It's would be mre like an ecosystem of AIs preventing unwanted growth. Building something to stop drones will be trickier. We will most likely end up with some kind of surveillance. I'd prefer something local which will only react to tech related terrorism or something alike, but can't be extended and abused for other things. Of course, still under control of humans in a form of a special institution, constrained by laws and treaties.\n\nAnyways I'm sure you would enjoy watching Person of Interest.",
                                                            "score": 1,
                                                            "author": "NoidoDev"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don't follow why self-awareness is a bad thing",
            "score": 1,
            "author": "vladrik"
        }
    ]
}