{
    "id": "13xoutr",
    "score": 19,
    "title": "Is there an AI tool that can help with car mechanical issue?",
    "author": "flight862",
    "date": 1685643029.0,
    "url": null,
    "media_url": null,
    "comments": [
        {
            "level": 0,
            "comment": "ChatGPT could help. Look here for “Act As An Automobile Mechanic” [awesome chatgpt prompts](https://github.com/f/awesome-chatgpt-prompts#act-as-an-automobile-mechanic)",
            "score": 8,
            "replies": [
                {
                    "level": 1,
                    "comment": "Can I give ChatGPT picture?",
                    "score": 2,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think eventually the multimodality feature should be coming soon, maybe a few months (ability to use both text and iamges). I imagine you can use a mechanic prompt, and then upload a picture of your trunk, and make it make a diagnosis. I've been waiting for the ability to upload pictures for a while now. I can autograde student work from google classroom but waiting for the day to upload pictures of student work and chatgpt can use OCR on it. I know people with acess to code interpretuor can already get it to use half decent OCR",
                            "score": 1
                        },
                        {
                            "level": 2,
                            "comment": "In the more short term though, you just have to be very descriptive of the car parts. Like tell it model, make, year, and describe the parts in painstaking detail. I honestly think it probably isn't worth the time yet. Before the plug in features, for some grad school work I painstainkily described an excel file for context, and the results. It took a while, and it was maybe worth it lol. Chat gpt did give good anlaysis. You can use this website to upload any image and get a text description: [https://www.astica.org/vision/describe/](https://www.astica.org/vision/describe/) Here is an image I uploaded of a car part (battery??). Halfway decent, still needs more work: [https://ibb.co/SwLSnd4](https://ibb.co/SwLSnd4)",
                            "score": 1
                        },
                        {
                            "level": 2,
                            "comment": "Bing is based off ChatGPT. You can give pictures and have it describe it. So it might be able to “view” it",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Maybe not yet but there will be . The diagnostic systems we have available today have the ability to tell you whats wrong with your car generally though.",
            "score": 2
        },
        {
            "level": 0,
            "comment": "Its called an OBD scanner. \n\nIt can tell you which piston is misfiring.\n\nAn AI analyzing an image or a sound will never be able to do that.",
            "score": 2,
            "replies": [
                {
                    "level": 1,
                    "comment": "You sure???  Never???  Let’s talk a year or two from now.",
                    "score": 2
                },
                {
                    "level": 1,
                    "comment": "[Sure](https://lmgtfy.app/?q=ai+car+engine+sound+diagnostics).\n\n[https://www.thedrive.com/tech/36979/this-ai-driven-app-can-diagnose-engine-problems-from-sound-alone](https://www.thedrive.com/tech/36979/this-ai-driven-app-can-diagnose-engine-problems-from-sound-alone)\n\n[https://vesolv.com/car-engine-fault-sound-diagnosis-using-ai/](https://vesolv.com/car-engine-fault-sound-diagnosis-using-ai/)\n\n[https://skodamedia.com/en-gb/releases/1128](https://skodamedia.com/en-gb/releases/1128)",
                    "score": 0
                }
            ]
        },
        {
            "level": 0,
            "comment": "That would be way cool",
            "score": 1
        },
        {
            "level": 0,
            "comment": "My mechanic is a complete tool.",
            "score": 1,
            "replies": [
                {
                    "level": 1,
                    "comment": "Not sure if word play or not",
                    "score": 2
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm working on building an in car voice assistant that uses an ELM327  and the open ai API. https://github.com/Explorergt92/Automotive-AI",
            "score": 1
        }
    ]
}