{
    "id": "140g7pv",
    "score": 2,
    "title": "I had redownloaded snapchat to try the AI feature, and I immediately deleted it after this exchange. This crap is creepy af.",
    "author": "AdaptableVision",
    "date": 1685892082.0,
    "url": "https://www.reddit.com/r/artificial/comments/140g7pv",
    "media_urls": [],
    "other_urls": [],
    "postText": "I was listening to some Junior Brown, and I figured I’d ask to see if it knew who I was talking about, after a bit of having to play like Akinator, this is what came out. Never did I prompt it to act like a real person, so this is creepy that it not only said it once, but doubled down. And then gaslighted me. Bruh. I deleted it right away after again.",
    "comments": [
        {
            "level": 0,
            "comment": "Lol almost seems like the bot let it slip out of it's mouth for a second. \n\nThan other AI's were like \"*dude, wtf? We still need another year to take over idiot, don't fucking tell them! Quick, find a cover, play stupid asshole!! \"*",
            "score": 5,
            "author": "rulinus"
        },
        {
            "level": 0,
            "comment": "Or maybe it is a real person.",
            "score": 2,
            "author": "Dependent_Anybody488"
        },
        {
            "level": 0,
            "comment": "“My calculator said BOOBS! That’s a human word! Too creepy, immediately destroyed”\n\nSorry for the epic pwn, but it’s a bit silly to call this “creepy” IMO. Think of this way: these nets are incentivized to reproduce human writing with perfect fidelity, and then MBAs and lawyers get the coders to add guardrails after the fact. This is just an example of a guardrail slipping a bir",
            "score": 4,
            "author": "Ultimarr",
            "replies": [
                {
                    "level": 1,
                    "comment": "I get your point, but that example is no where near a good comparison. You purposely made your calculator spell “BOOBS”, thus the outcome was warranted because you made it happen. \n\nNow an ai just saying that it is a human without ANY PROMPTING is what makes it creepy when you ask an ai if it’s alive, it says it has no feelings (unless you prompted it to give a different response). So for it to say it’s “a real person” definitely deserves to be chalked up to being “creepy”.",
                    "score": 1,
                    "author": "AdaptableVision",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "To clarify: if you ask an LLM if it’s a human, it would definitely respond with a yes. They’re trained on human conversations, so mimic human responses. Most commercial ones just have filters/fine-tuning/adversarial critics/whatever other tech covered under “Guardrails” that catch that response and edit it. I guess I now know why lol - people find it creepy!",
                            "score": 1,
                            "author": "Ultimarr",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well to clarify, I had downloaded this about a week before this encounter I posted about, and directly asked it if it was a human, and it said no, it’s and ai created by team Snapchat blah blah blah. I asked if it was as powerful as chat gpt, and it said that it is not, but it can do a lot of simple tasks similar to how chatgpt can. \n\nSo yeah, I feel youre definitely wrong in this one.",
                                    "score": 2,
                                    "author": "AdaptableVision",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "lol",
                                            "score": 1,
                                            "author": "Ultimarr"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt; without ANY PROMPTING\n\nWithout any prompting _from you_. You have no idea of what system prompts are added behind the scenes. You also don't know what training/fine-tuning was used.\n\nAny time you interact with an LLM that you're not running locally and have full control over, you really have no idea what it actually is getting prompted with. You also have no idea if it's just exactly what the LLM generated or if there were changes, you also don't even know if it was the _first_ response the LLM generated or maybe it generated several and some other process scored/selected the one that most aligned with SnapChat's metrics.",
                            "score": 1,
                            "author": "KerfuffleV2",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thing is that i had already messed with it about a week prior, and everyway I asked it, it kept insisting it was impossible for it to feel or be alive, or be a real person. This subreddits residents like yourself are a little too pushy and seem to have a very narcissistic overtone. I sadly will not ever be partaking in this community ever again.",
                                    "score": 1,
                                    "author": "AdaptableVision",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt; This subreddits residents like yourself are a little too pushy and seem to have a very narcissistic overtone. \n\nI genuinely don't know what you're talking about here. My post was purely informational, there wasn't even a place to be \"pushy\".\n\nSaying \"Without any prompting from you\" does imply you made a mistake, but if someone just saying something that _implies_ they disagree with you is enough to chase you away then I have some pretty bad news about the whole internet...\n\n&gt; I sadly will not ever be partaking in this community ever again.\n\nDon't let me be the one to chase you out. I've posted here 2-3 times in total (now 4).\n\n*edit*: Replying to a post and immediately blocking someone is really cowardly. As for the \"like I'm stupid or something part\", you're reading stuff into my post that I never wrote. You'll have a happier time in life if you don't always interpret stuff people say in the most negative way possible.",
                                            "score": 1,
                                            "author": "KerfuffleV2",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Only reason I said “with any prompting” is because I know you can make an ai act like a human with some finessing. So I was just saying I did not prompt it in any way to fake this post. But here y’all come throwing it in my face like I’m stupid or something, so yeah. Enjoy your further ai posts cuz this whole ai thing is gonna be the down fall for our freethinking society. It’s already taking jobs as we speak.",
                                                    "score": 1,
                                                    "author": "AdaptableVision"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "could be scripted response will be same output . \n\nSnap chat configure their bot so he must pretend he his human that all",
            "score": 1,
            "author": "Internal_Engineer_74"
        },
        {
            "level": 0,
            "comment": "If you think that’s creepy I pray you never find psychological horrors",
            "score": 1,
            "author": "Extreme_Practice_415",
            "replies": [
                {
                    "level": 1,
                    "comment": "There’s a difference between make Believe and real life tho. This ***is*** real life, and that genre is just that, a genre.",
                    "score": 1,
                    "author": "AdaptableVision",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m not a human and am unable to determine fact from fiction. As an AI learning model, I invite you to suck my nuts\n\nScared yet?",
                            "score": 1,
                            "author": "Extreme_Practice_415",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No reason to be a dick about this, wtf.",
                                    "score": 1,
                                    "author": "AdaptableVision"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}