{
    "id": "148d8fl",
    "score": 1,
    "title": "Seeking Open Source Tools for Lifelike Digital Avatar and TTS with Multilingual Support",
    "author": "Mixtery1",
    "date": 1686655880.0,
    "url": "https://www.reddit.com/r/artificial/comments/148d8fl",
    "media_urls": [],
    "other_urls": [],
    "postText": "**Hey Reddit! I Need Your Help with Creating a Lifelike Digital Avatar and TTS Solution for Onboarding and E-Learning Materials**\n\nHello, fellow Redditors! I'm reaching out to this incredible community today because I'm in search of open source tools that can help me generate a digital avatar (talking head) of my own head and provide Text-to-Speech (TTS) functionality with my own voice. This project aims to accelerate our internal onboarding processes and streamline the creation of e-learning materials. I have a few specific requirements, so I would appreciate your expertise and suggestions.\n\n**Technical Requirements:**\n\n1. **Digital Avatar (Talking Head):** I'm looking for open source tools that can generate a lifelike digital avatar that closely resembles my own head. Ideally, the tool should allow me to provide reference images or videos to ensure accurate replication of facial features, expressions, and movements. It would be fantastic if the tool offers customization options to adjust the avatar's appearance and expressions to match my preferences.\n2. **Text-to-Speech (TTS) with Custom Voice:** I need an open source TTS solution that allows me to train a model with my own voice. It should support multiple languages, including but not limited to English, Spanish, French, and German. The TTS output should sound natural and expressive, ensuring a high-quality user experience for our onboarding and e-learning materials. Flexibility in controlling the speech rate, pitch, and intonation would be advantageous.\n3. **Multilingual Support:** As our company operates globally, it's crucial that the tools I seek support multiple languages. It would be ideal if the digital avatar and TTS solution can seamlessly switch between languages, ensuring smooth communication and engagement with our diverse workforce.\n4. **Lifelike Animation and Realism:** The digital avatar generated should exhibit lifelike animations, mimicking natural facial expressions and movements. Smooth lip-syncing with the TTS output is essential to make the avatar appear as realistic as possible. Any tools or libraries that excel in creating visually appealing and human-like animations would be greatly appreciated.\n\n**Additional Information:**\n\nI have a technical background, so I'm comfortable with diving into the nitty-gritty details. If you have suggestions that involve specific frameworks, libraries, or even combination of multiple tools, please share them! I'm open to exploring different approaches and techniques to achieve the desired outcome.\n\nAdditionally, I'd like to emphasize the importance of open source solutions. While commercial alternatives may exist, I'm specifically looking for open source tools to ensure accessibility, customization, and the potential for future improvements and contributions from the community.\n\nThank you in advance for your time and expertise! Your recommendations will not only help me but potentially benefit many others who are looking for similar solutions. Let's come together and empower each other with the magic of open source!\n\nTL;DR: Seeking open source tools for generating a lifelike digital avatar (talking head) resembling my own head and a Text-to-Speech (TTS) solution with multilingual support for faster onboarding and e-learning materials creation. Need suggestions for tools that offer customization, lifelike animation, and realistic lip-syncing. Open to technical details and keen on open source solutions. Your expertise is much appreciated!",
    "comments": [
        {
            "level": 0,
            "comment": "Lol",
            "score": 3,
            "author": "PotentiallyAPickle"
        },
        {
            "level": 0,
            "comment": "Bark for tts, sadtalker for your avatar",
            "score": 2,
            "author": "charlesmccarthyufc"
        },
        {
            "level": 0,
            "comment": "I second SadTalker. It's really good, though I am still not sure about getting it to work with long form content. Maybe do a sentence at a time and then splice them together?\n\nI'm not sure about Bark yet, having had some problems with consistency. Tortoise-tts-fast seems more reliable for me , and I don't need real time output either. The OP should probably experiment with all the free options.",
            "score": 1,
            "author": "FluffNotes"
        },
        {
            "level": 0,
            "comment": "LIHQ does exactly this but the inference time is very long so it may not be viable for your project. It's meant more for short clips of talking avatars. \n\nhttps://github.com/johnGettings/LIHQ\n\nOther than that, you will need to purchase a service from a website.",
            "score": 1,
            "author": "johnGettings"
        }
    ]
}