{
    "id": "dalw5k",
    "score": 8,
    "title": "About to transfer. Tell me what you love the most about Bradley!",
    "author": "Nomichit",
    "date": 1569704891.0,
    "url": "https://www.reddit.com/r/bradleyuniversity/comments/dalw5k",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "I graduated 2016, but as an alumnus of Bradley the best part to me was the opportunity granted for actual experience. Of course this'll depend on your major but in the Foster College of Business I was given many real job experiences consulting for local businesses, which directly lead to me having the competitive advantage needed to get the career I currently have. Don't forget to put it on your resume :)\n\nThe people are usually great, the professors are (in my experience) fantastic, and you're going to get a ton of practical knowledge in your major. \n\nIf you're transferring from community college, do not take it lightly. I had a 4.00 in community college before transferring. First semester at Bradley: 1.67. I changed majors and climbed back up to 3.34 by the end, but the difficulty jump caught me so off guard; be prepared.\n\nGood luck, and don't forget to enjoy it while you're there. I miss the environment that Bradley provides, and it'll be over before you know it.",
            "score": 6,
            "author": "JBP47",
            "replies": [
                {
                    "level": 1,
                    "comment": "Agreed Bradley is great school.   Be prepared I transferred with 4.0 from a state school and the difficulty level of course work goes up few notches at Bradley, so if you do not take your studies seriously it will knock your socks off.  More the reason to go, as you choose the school for your education.",
                    "score": 1,
                    "author": "nonanon66",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Where did you transfer from and what type of classes were you taking? I'm just curious.",
                            "score": 1,
                            "author": "max1674"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey! I also just transferred here. I love my dorm, much more spacious than the others. The campus is really beautiful and it’s not that hard to make friends. You’ll love it :)",
            "score": 2,
            "author": "OldWorldStyle",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you! Maybe I'll see you around lmao.",
                    "score": 1,
                    "author": "Nomichit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "yeah man maybe! when are you transferring?",
                            "score": 1,
                            "author": "OldWorldStyle",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This is my last semester at ICC, so 2020 of Spring!",
                                    "score": 1,
                                    "author": "Nomichit",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Sick man! What housing are you looking at?",
                                            "score": 1,
                                            "author": "OldWorldStyle"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you are an engineer or business major you will really like the new building. Extra perks if you are an engineer because the new labs are going to be nice but some are smaller than the ones that were in the new buildings.\n\nBest housing is probably college hall for transfers because of space. The gym is write across the street which is really nice too, there is a breakfast bar that opens at 6 or 7 am in Markin too which is nice so you do not have to walk too far to get a good breakfast in the morning, geiserts breakfast is usually pretty damn good though (haven't had it in 2 years). ST James is nice if you can get a few buddies you really like to live with you otherwise there are singles that are taken really fast though.\n\nSomebody mentioned in a comment below about GPA dropping after. 4.0. This is pretty much true, it is a lot harder than community college as I entered with a 4.0 and with my first round of engineering classes it tanked. Once you get past those first couple of weedout classes you should be fine but will still have to put in work especially if you are an engineer.",
            "score": 1,
            "author": "Varnova"
        }
    ]
}