{
    "id": "104371",
    "score": 10,
    "title": "/r/ConnColl, what are you folks looking for from this subreddit?",
    "author": "vweltin",
    "date": 1348018879.0,
    "url": "https://www.reddit.com/r/conncoll/comments/104371",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey /r/conncoll,\nI started this subreddit a year or two ago because I thought it'd be cool to have a subreddit for things pertaining to Connecticut College in general. We've got 24 readers now, which is roughly 1% the current student population at Conn. I feel that more than one out of every one hundred students at our school is a redditor, and while I don't for a second think (or even want) every conn redditor to read this page, it puts this subreddit in an interesting place. It doesn't make sense for this to be a place to advertise for any event you have coming up soon, simply because no one would see it soon enough. At the same time, it's just another subreddit you subscribe to.\n\nThis leads me to ask: what would you folks--the ones who *do* subscribe to this subreddit-- like to see happen with it? Want to see sports results? Memes about Conn? *Anything* conn-related?",
    "comments": [
        {
            "level": 0,
            "comment": "Hmm.... I guess just anything, period, haha. It would be nice to somehow up the amount of subscribers here. I'm an alum, so I would just like to read about what's going on on campus. Like the whole New Lo going bankrupt thing.",
            "score": 4,
            "author": "drgirrlfriend",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yea, I graduated 8 years ago and subscribed just to stay connected somehow. I'd take whatever content that was posted, but photos of campus, renovations, local happenings, and anything new or interesting would be welcome.",
                    "score": 2,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "Yup, alum here too. But for current students, people should just start threads. Advice for freshman, questions about teachers or classes, etc. \n\nAlso, what's this about New Lo?",
                    "score": 1,
                    "author": "arc_en_ciel",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Check out this article in the Voice: http://thecollegevoice.org/2012/09/13/could-conn-students-save-new-london/",
                            "score": 1,
                            "author": "drgirrlfriend"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Well, according to the posts so far it seems like most of the subscribers are alums. But I support the idea of just putting anything Conn related here. ",
            "score": 1,
            "author": "maxben3190"
        },
        {
            "level": 0,
            "comment": "This place needs more mods! It's a cesspool!\n\nOn a more serious note, I had no idea about the current situation in New Lodon. Very interesting.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "As someone looking to apply to ConnColl, I think it'd be cool to see events on campus, opinions about things happening, what it's like living in New London/on campus, clubs/programs around campus, pros/cons of the college, discussion on majors, social events coming up, etc. \n\nI subscribe to the subreddits of the other colleges I'm looking into and mainly they have things along that line. \n\nAgain, as someone looking into these colleges, it's cool to see what's going on on a daily basis and the students' thoughts on the school. \n\nI think this could be really neat if you had more students/alum involved, but again, that's slightly more difficult for ConnColl considering you guys don't have as many students as.. let's say.. NYU, OSU, huge colleges with high enrollment numbers. ",
            "score": 1,
            "author": "aljohi"
        }
    ]
}