{
    "id": "vgxp5",
    "score": 3,
    "title": "Incoming Freshman",
    "author": "maxben3190",
    "date": 1340424697.0,
    "url": "https://www.reddit.com/r/conncoll/comments/vgxp5",
    "media_urls": [],
    "other_urls": [],
    "postText": "Not sure how I feel about this subreddit having only 14 readers.\nBut if anyone still reads it, what do/did you all think of your Connecticut experience? What should I be looking forward to? ",
    "comments": [
        {
            "level": 0,
            "comment": "Join clubs right away. Don't worry too much if you don't quite fit in with the friends you meet right away freshman year, you may have a completely different friend group by the time you graduate. Don't take Conn Coll Confessional seriously. Go to as many events as you can. If you don't like something at Conn, tell your Senator/SGA or better yet, join. Go to the arbo all of the time. Find that blog or twitter account that gives suggestions for recipes for Harris food because that shit gets old fast. Try all of the restaurants in New London and take some time to volunteer and get to know the surrounding community, they all think we are douchebags. The mozz sticks at Cro are delicious. I'm partial to living in Central Campus. Try to get to know one or two professors really well early on and consider taking an independent seminar or maybe even do a thesis with them when you're a senior, it will give you a great recommendation. That's all for now, have fun! I miss it.",
            "score": 3,
            "author": "drgirrlfriend",
            "replies": [
                {
                    "level": 1,
                    "comment": "This. Join things that interest you. Be super friendly and say yes to every opportunity that arises. The arbo is amazing- GO THERE. http://creativeconncoctions.com/  this website. don't spend all of your Cro money during the first week- it's great for drunken nights. \n\nalso, don't be afraid to ask your SA, Housefellow, Floor Gov or whatnot anything that you want to know. Seriously. Any question. We can handle it and if you ask a good enough question, you'll make an interesting story for our friends later(:",
                    "score": 3,
                    "author": "[deleted]"
                }
            ]
        }
    ]
}