{
    "id": "14855lg",
    "score": 16,
    "title": "Anybody ever had any success appealing a grade (especially disabled students)? Do you think I have a chance?",
    "author": "katnissjul",
    "date": 1686626315.0,
    "url": "https://www.reddit.com/r/Emory/comments/14855lg",
    "media_urls": [],
    "other_urls": [],
    "postText": "\nI am a double major in philosophy and film. I was supposed to graduate in May this year but I had a really rough spring semester and had to change my plans. This will be a long post so bear with me.\n\nI stopped going to class and turning in my assignments in the middle of last semester due to a very bad depressive episode. My mental health was awful, I could barely get out of bed for weeks, and I nearly voluntarily hospitalized myself. A few weeks before the end of last semester, I met with all 4 of my professors to discuss the situation (I posted on this subreddit about this too and was encouraged to just communicate with my professors and they would most likely be understanding). 3/4 of them were extremely understanding, and they are allowing me the time to finish their classes over the summer. The 4th wasn’t very understanding. I explained to her the situation and reminded her about my disability accommodations (I have a registered cognitive disability with DAS and have multiple accommodations, including flexible attendance and flexible deadlines). She told me that she would give me the chance to turn in the rest of my work, I told her I would have my work in by April 30th, and I created a tentative timeline and sent it to her (I’m very bad at following timelines and deadlines partly due to my cognitive disability, so I’m not sure why I even tried this lmao). \n\nI was still going through my depressive episode at this time, and I also was affected by the nationwide medication shortages, so I wasn’t properly medicated for my medical issues. There was also another student in this class that I had a very negative experience with in the middle of the semester, which also made it difficult to show up. I tried my best to turn in all of my work to her as soon as I could, but I unfortunately did not have everything turned into her by the April 30th deadline. However, when I continued to send her my work and update her on my progress after that 4/30 deadline, she did not say anything, and I assumed that she would allow me to finish considering she did not communicate otherwise, even though I continued to email her. I finished the class and had all the work sent in to her by 5/11. \n\nI completely understand that it was my fault for falling behind and I take full responsibility. I understand that it is her prerogative to fail me in the class. I don’t want to make it seem like I feel that I deserve special treatment and extra grace over other students. However, I do feel I was treated at least a little bit unfairly by this professor. I finished this entire class over the course of about 2 weeks, and I spent night and day trying to turn in all this work to her. I continued to email her throughout this time period. She did not communicate with me AT ALL throughout this period. I had last heard from her on April 11th, and she did not respond to ANY of my emails until two weeks AFTER I turned in all the work, on May 25th (so a month and a half with no communication whatsoever). That is when she said that she will not be accepting my work and she will be failing me in the class. So she continued to see me turn in assignments on Canvas, and she continued to see my emails where I sent her more of my work, and she simply ignored them all. She let me complete ALL the work for her class and break my back completing these assignments without informing me that she wouldn’t be accepting my work. I had to take time away from working on other classes to finish hers. I had been stressed and crying for days because I stayed up finishing the work for her class. I didn’t skim the readings or turn in half-assed work either — I put in a LOT of effort into these assignments and projects. I think her decision would have been completely fair if she had actually communicated with me and let me know that she was not going to accept my work, but instead she let me complete a semester’s worth of work in two weeks without any communication. \n\nBecause I failed this one class, I can no longer graduate in August, as it was a requirement for my film major. I have to move back to Atlanta in the fall to finish this one single requirement. I was supposed to volunteer for a civilian conservation corps next year, but I will not be able to now because I have to move back to Atlanta to finish this one class. I live 16 hours away from Atlanta, so I cannot live at home while I finish this requirement. I will also have to take out another SEVEN THOUSAND DOLLARS!! in loans to complete a single three credit class (I literally already have $89,000 in student loans). \n\nOnce again, I am not trying to absolve myself from any blame in this situation. I went through a very difficult mental health episode last semester that I barely made it out of, but I still take accountability for falling behind and I understood her reasons for failing me. However, I do think that I deserved to be communicated with. For this reason, I am going to attempt to appeal this grade, but I wanted to get some insight from other Emory students first. Has anybody here (especially disabled students) ever attempted to appeal a grade? How did it go? I’m not optimistic that my appeal will succeed, but I figured it was worth a shot. Is it worth going through the effort of an appeal? Do I have any chance whatsoever?\n\nEDIT: Also, not that it really matters, but the workload for this class was ridiculous. It was a 200-level 3-credit film class and it had the biggest workload of any class I had ever taken at Emory. I knew another student in this class who was thinking about reporting this professor because the workload exceeded what should be acceptable for a 3 credit class. She didn’t just assign readings, she also made us submit our annotations for the readings using a special software. We would screen films in class and submit notes that we took while watching, then she had us re-watch the same exact films in our own time and submit MORE annotations. It was ridiculous. I have taken 300 and 400 level film classes for 4-5 credits that required half the amount of work we had for this class.",
    "comments": [
        {
            "level": 0,
            "comment": "Oh my god, are we the same person….I’m sorry this has been your experience for the past year. It’s a horrible place to be in, and I feel for you. \n\nI’ve always been told that the thing about accommodations is that you need to get them in BEFORE and not use them retroactively….but this places the burden of communication on an already struggling student which sucks. I’d say it’s a long shot, but I suppose you could email OUE and lay out your situation. They might assign you to a case manager. There might be some way for your other professors to write a statement to OUE explaining how you communicated and documented your challenges at the time and how it paints a picture that could support OUE intervention? I have no clue. All I know is, I had two professors file a note of concern about me, I got an OUE Caseworker, I responded to the caseworker with a list of available meeting times (while I was struggling) and she…ghosted me for more than two weeks. Lol, so that’s that. \n\nrealistically: worst comes to worst…what if you just dropped your film major to a minor? You could still graduate, move on with your life, do the CCC, not have to worry about housing and the extra debt incurred by another semester. Since both majors confer BA degrees i don’t think that extra major would be worth the hassle and loss of opportunity. \n\nGood luck.",
            "score": 16,
            "author": "pshhhhhhh1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for the response. I’ve tried to reach out to my case manager in the past but I didn’t feel she was too helpful, but I might try again to see if she can help. I’ll definitely be emailing OUE about the situation like you said. \n\nI know it would probably be a good idea to just change my film major to a film minor, but I have made it so far and I really, really want that film degree. I would hate for one class to be the reason why I don’t get that second degree. I’ve put a lot of work into getting that film degree and I think I’ve committed myself to getting it at this point.",
                    "score": 1,
                    "author": "katnissjul",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Okay. Yes, reach out to OUE, and if you hit a dead end, just keep trying to the person above them. Agree with u/CuriouslyCollegiate \\-- if you really want this film degree, you literally need a D and not an F and I think you have a fighting chance, especially with existing accommodations. \n\nIf you encounter resistance in OUE,  try emailing Dean Joanne Brzinski. She's the head of OUE. I like her, she gets stuff done and may have the power to help you out. Just explain your situation clearly.\n\nOmbuds is another idea. I think they're a conflict resolution person / mediator. It's worth a shot to reach out to them, but I don't think they have the power to intervene in the way a Dean in OUE could.",
                            "score": 2,
                            "author": "pshhhhhhh1"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "same opening as the person above ^ this literally happens to me with at least 1 professor every semester. ABSOLUTELY appeal it. literally they’ll ask you what’s the ideal situation you want out of this. you literally just need a D so you can move on with your life. if it doesn’t happen then you can do what the person above said and make it a minor and just move on. do not under any circumstances take out more loans to finish this… like it’s really not worth it love. i’ve appealed in worse and less conditions so just try. i’m here if you wanna pm and get help along the way.",
            "score": 11,
            "author": "CuriouslyCollegiate",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for your response. Have you had any successes with your appeals? All I really want is to either pass that class with a D (or even just get the F taken off of my transcript). Have you found that they are sympathetic in any way to student’s circumstances? Are they willing to work with you?",
                    "score": 1,
                    "author": "katnissjul",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Appeals are made to the head of that department. I wouldn’t say they are “sympathetic” but for people with DAS accommodations, they try to at least help rectify or improve the situation or it opens them up for a lawsuit. Have you talked to your DAS advisor?? They typically have really good insight on what options you have.",
                            "score": 2,
                            "author": "CuriouslyCollegiate"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Even if you think its not gonna work, still appeal. Tell the OUE basically everything in this post in a more formal way. As someone who was severely burnt out and lost motivations last semester, I understand where you are coming from. I basically had a wake up call and tried my best during the last 3 weeks of the last semester which somewhat saved my gpa but it is still not up to my standard. I dont regret it tho, I genuinely just didn't care enough and was depressed.",
            "score": 4,
            "author": "HoangTr16",
            "replies": [
                {
                    "level": 1,
                    "comment": "I definitely relate. It gets so damn hard to keep up with schoolwork when you’re super depressed and then to catch up later on. I wish there were more options for students who are really struggling as the added pressure to not fail all your classes definitely isn’t conducive to healing and getting back to a healthier mental state. I’m very lucky that a majority of my professors have been very understanding and patient with me, and that this professor was the only one who wasn’t. I can’t imagine how much worse I would feel if I had to deal with a lack of compassion and understanding from multiple of my professors instead of just one. I’ll be emailing OUE soon, thanks for the response.",
                    "score": 1,
                    "author": "katnissjul"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think you should contact OUE first and if you feel they’re not impartial on your case then go to ombuds, they will present to you all the options both formally and informally \n\nhttps://ombuds.emory.edu",
            "score": 2,
            "author": "ApprehensivePlum1420",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’ve actually never heard of ombuds before. I checked out the website — so they just help you find a resolution to academic conflicts like this? Do you just consult them and they’ll help you figure it out? Sorry for my confusion haha",
                    "score": 1,
                    "author": "katnissjul",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I consulted them in a completely different case (not academically related). However, to my knowledge, ombuds is created to handle any issue. It is as independent as it gets here but they're not like an arbitrary body (e.g. they don't have the power to decide anything). What they can provide you is the best knowledge about the rules and procedures of Emory and they can also help you handle the process formally (file complaints,...) or informally (2-side discussion for common resolution), whatever you choose.",
                            "score": 1,
                            "author": "ApprehensivePlum1420"
                        }
                    ]
                }
            ]
        }
    ]
}