{
    "id": "jzvhrr",
    "score": 35,
    "title": "Campus Services expose by The Wheel",
    "author": "e_p_menaker",
    "date": 1606182098.0,
    "url": "https://www.reddit.com/r/Emory/comments/jzvhrr",
    "media_urls": [],
    "other_urls": [
        "https://emorywheel.com/campus-services-employees-allege-widespread-maltreatment-abuse/](https://emorywheel.com/campus-services-employees-allege-widespread-maltreatment-abuse/)"
    ],
    "postText": "During my time as a student who briefly had a Work-Study job with Campus Services, I heard many of these allegations and tried to report them to The Wheel in 2018. At the time, they wouldn't report without any on-the-record sources. I graduated in 2019 I am glad this report is finally seeing the light of day. Long overdue. These problems have been going on for the last decade. [https://emorywheel.com/campus-services-employees-allege-widespread-maltreatment-abuse/](https://emorywheel.com/campus-services-employees-allege-widespread-maltreatment-abuse/)",
    "comments": [
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 7,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "DCT employees are not Emory employees, they are Bon Appetit Management Company employees. They have their own issues though.",
                    "score": 9,
                    "author": "e_p_menaker"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wow. Emory seems more hypocritical the longer I'm here. I hope the article makes its way to some people who can actually do something abt this.",
            "score": 5,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Is this an \"Emory\" thing though? Yes Emory, like other schools of its caliber and higher is hypocritical even if it tries, but it seems this specific entity has its own problems that can develop seperately from the school's overall mission and behavior which is why you need oversight and an honest and independent media source like the Wheel. Many top tier schools don't have something like the Wheel.  Their student run newspapers almost act as a marketing arm for the university UNLESS students are really dissatisfied about something.  \n\n They wouldn't write things looking out for staff and workers and generally don't do much investigative journalism.  I think the difference is that the Wheel is willing to do that and hold the university accountable beyond just student interests.  I have problems with the Wheel but this isn't one of them.  I haven't seen a piece like this from them in a while but I hope they stay true and keep doing it. Either way, no, colleges, even top tiers, are not the rosy wonderlands marketed to people in brochures.  They are full of people and complex interests, not all of them good. The difference is that some other schools try harder to keep up that illusion and I honestly think many students would rather be ignorant to flaws outside of their interests as well.",
                    "score": 3,
                    "author": "oldeaglenewute2022",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm sure I'd have issues with any other high ed school as well. The difference is that Emory is the one I'm exposed too. \n\nCan't wait to get another flowery template email talking about the positive environment they foster at Emory. Hooray for bureaucracy and lack of accountability. I appreciate the Wheel at the very least.",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "One good thing I could say about Emory is that it does try to respond to student concerns more than a lot of places.  The only issue I have is that students seem often concerned about the wrong things or are too apathetic about things they should be paying attention too.  I see a lot of bland(I am for real social justice and not some convenient feel good advocacy, symbolism, and virtue signaling. I'm for stuff like this issue or when they investigated that plant near Oxford) social justice stuff from students in the Wheel for example, but I rarely see stuff critical about things academics or things that suggest SJ solutions in systems BEFORE folks get to campus (like I am seeing that sloppy BIPOC term become common and as a black person...that term doesn't do sh** for me. People are trying to talk about colorism and a general anti-blackness in other \"POC\" communities but I don't see discussions on reparative justice.  You can't hold any institution accountable with small talk and small ideas of \"let us just be more aware and nicer to each other\"). \n\nAt tippy top schools, these are all common in student produced newspapers. Undergrads will evicerate whole academic departments, faculty, etc if they aren't delivering the goods in terms of quality.  At Emory, they only get attention if someone stirs up controversy with certain types of speech or political views. Students at this tier of school seem to want momentum in rankings without actually having to demand excellence(no I don't mean grades) from the school and for themselves.  Until students (and others) can be open and hold the school accountable for EVERYTHING, methinks Emory will be forever 21.  Either way current students and alum play a role and it must go beyond issues of social justice.",
                                    "score": 5,
                                    "author": "oldeaglenewute2022"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "good that bad treatment is being covered by the wheel",
            "score": 1,
            "author": "ThinkingSmash"
        }
    ]
}