{
    "id": "lk62sm",
    "score": 34,
    "title": "What is the future of White Hall? Are they planning on demolishing it?",
    "author": "crusheratl",
    "date": 1613364872.0,
    "url": "https://www.reddit.com/r/Emory/comments/lk62sm",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 10,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "They *have* been floating the idea of a White Hall renovation for years now. Whether they actually go through with it is another story.",
                    "score": 5,
                    "author": "phraps",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Doesn't look like it'll happen based upon some of the ideas of the framework plan.  My guess is that it would kill the amount of teaching space available (that plan seems super housing and research space heavy).  Schools need at least one token ugly building anyway and Emory hardly has any.  That's white Hall's 2ndary role; to be the out of place brutalist building (Atwood got partly covered up by the new fascade so gets to hid its ugly face)",
                            "score": 12,
                            "author": "oldeaglenewute2022",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And besides, if they pretty up White Hall, where will they film \"generic college lecture auditorium\" in the movies? Georgia Tech? Pfft.",
                                    "score": 11,
                                    "author": "phraps",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "MSC is too damned nice lol and we can't give those scenes to Tech (I wonder if Emory makes some money when they film)",
                                            "score": 4,
                                            "author": "oldeaglenewute2022",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "There's at least 1 movie that was filmed at the MSC",
                                                    "score": 3,
                                                    "author": "iapetus3141"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 3,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's not so much that White Hall is ugly, it's that it sticks out. Same with the bio building.",
                                    "score": 3,
                                    "author": "phraps",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[https://www.sasaki.com/projects/emory-university-framework-plan/](https://www.sasaki.com/projects/emory-university-framework-plan/)\n\nThis makes it unclear if they plan something for bio.  Does seem that they are willing to entertain completely gutting Greekrow for housing, redesigning the area around the Woodpec, and adding some new academic buildings across from theology and chem (That would be a good place for a new life sciences building to put it in close proximity to other STEM buildings). Who knows?  If I had to guess, the housing concerns will be addressed first/in the near future and that other stuff will come later (like with research, you'd have to create demand for those buildings which would likely involve developing new areas of research interest followed by recruitment and whatnot). One of the renderings has a \"proposed building\" where bio is (and not the new public health building..good lord Rollins is doing well!) and some don't is so I can't tell.",
                                            "score": 5,
                                            "author": "oldeaglenewute2022"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "They also float around ideas of remodeling Oxford, but I’m convinced that’s a money laundering thing",
                            "score": 4,
                            "author": "Bigtiddiesoftgf"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "lmao I didn't know Emory memes were a thing.",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "That account had some amazing ones last year, but the girl who ran it graduated and she passed it down to someone who’s been lacking.",
                    "score": 9,
                    "author": "brianort13",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Do you know who's the new Swoop Daddy",
                            "score": 4,
                            "author": "iapetus3141"
                        },
                        {
                            "level": 2,
                            "comment": "Emory meme culture really peaked with the Swoopdaddy face reveal",
                            "score": 2,
                            "author": "phraps"
                        },
                        {
                            "level": 2,
                            "comment": "I can’t even tell if the new person is lacking because they barely post anymore. The fucking Wheel posts more often than they do and they actually have to write things before posting lol",
                            "score": 1,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        }
    ]
}