{
    "id": "pjft8h",
    "score": 44,
    "title": "Rants from a loner",
    "author": "ItchyFlamingoo",
    "date": 1630988689.0,
    "url": "https://www.reddit.com/r/Emory/comments/pjft8h",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m a junior at this point and feel like I’ve made no meaningful friends. I’m not really awkward &amp; I love going out. I’m lucky that I have some friends in the city so I get to go out a lot but it doesn’t even feel like I’m in college. I didn’t really try the first semester and then everything went online and now it’s like people just assume if you’ve been here long enough you’re probably doing okay. Idk, is something wrong with me or is the whole idea of college friends that you make amazing memories with just not a thing that’s gonna happen for me anymore\n\nPlease don’t judge",
    "comments": [
        {
            "level": 0,
            "comment": "I'm a junior as well and I really feel that, it's hard as fuck to make friends when everybody's already in their groups. I'm in a similar boat, I met all my current friends back way before quarantine. Message me if you want to see if we have anything in common, just made this account and the chat restrictions are dumb af.",
            "score": 13,
            "author": "SuzuBae"
        },
        {
            "level": 0,
            "comment": "I hate to say it but anyone who started when the pandemic hit or started with online learning should basically view themselves as either a freshman or sophomore socially.  In your case, you are technically an upper classmen but there is still of time to \"feel\" like you are in college and it is very possible that the social aspects that you want will not just come from \"going out\". Depending on what you pursue academically, it could be you and your friends bonding over getting your behinds kicked or sweating in a course.  It could be random adventures ON campus if you and \"friend\" groups are creative enough.  I feel like many at Emory have a very limited vision about what they think is supposed to create \"great memories\" (like if \"going out\" involves a lot of drinking or the same club experiences, or whatever, that may get monotonous and may not lead to the randomness and spontaneity typically associated with \"great memories\"AND you may also just straight up not remember them for obvious reasons ) and that is often the problem and not just you being a loner which you obviously aren't.  The semester just started and if you are on campus, you now have time to think (or not actually, maybe overly planning also leads to monotony ) about things to try that are perhaps things you wouldn't typically think of that ultimately lead to a great time.\n\nAgain usually there is some randomness and even risk involved and it seems many Emory students are only for sort of uhh....controlled risk or planned fun vs. spontaneity.  Like I still remember the most random (that may appear or read as insignificant to an outsider but you'd have to be there) moments with my main friend group like when we took the stupid Lenox shuttle to Buckhead and then decided to walk all the way back to Emory from Buckhead at night.  Or how I had another friend group just sort of randomly decide on a dime that we were going to Africa night at freaking UGA and then it turned into the damnedest and funnest thing.\n\n&amp;#x200B;\n\nOr even super simple crap like being nerdy and coming up with some weird chant or tradition at the thing (near the creek/water falls) with the grafitti in Lullwater. Having the weirdest conversations after deciding to climb on top of the Carlos Museum's Ziggurat with my main friend group.  Going with a bunch of kids I tutored and TAed to KFC (which I hate) as a tradition when they thought they failed an exam.  It doesn't have to always involve a party or going into the city and even if it does for you...try something new.  Like my friends dragged me to Dragon Con one year and it was the weirdest thing that I wouldn't try on my own but it ended up very fun (I also think, a lot of Emory students which are technically a bunch of nerds, are too stuck up or trap themselves into always trying to appear \"too cool\" or \"normal' to be seen doing anything perceived as nerdy beyond studying and getting good grades and I think it results in a lot of missed oppurtunities for super fun experiences). Just come up with something seemingly random and insignificant or go with your or a friends impulse when they suddenly come up with something and things may get more interesting for you and your friends.\n\nIndividual fun that leads to new friends can be fun too.  Like I remember walking to C-mont one day to see friends and then ran into these random people who were drinking on a bench who invited me to the tower for shots and I ended up having a lot of fun and making a couple of new friends from that.  I didn't plan for or expect any of that, but just went for it because I was bored and still had time before my main friend groups' events started.",
            "score": 16,
            "author": "oldeaglenewute2022"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": -2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hey /u/GenderNeutralBot\n\nI want to let you know that you are being very obnoxious and everyone is annoyed by your presence.\n\n^(I am a bot. Downvotes won't remove this comment. If you want more information on gender-neutral language, just know that nobody associates the \"corrected\" language with sexism.)\n\n_^(People who get offended by the pettiest things will only alienate themselves.)_",
                            "score": 2,
                            "author": "AntiObnoxiousBot"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Guessing that a lot of people feel the same way you do so betting that if you try an incy bit you will find takers to do things with. And please do so NOW, because you don't want to look back at this time as being squandered.\n\nWanna go walk the beltline? Get some wings? Six flags? Braves game?  Try things like these with people.",
            "score": 3,
            "author": "crusheratl"
        },
        {
            "level": 0,
            "comment": "Senior here, I feel similarly— I think I only have a few close friends and even they seem distant sometimes. I also realized that the friends I made freshman year don’t really have the same interests as I do so it’s hard to stay in touch and see each other. Knowing that I’m usually an outgoing person makes this even harder, but I think I’ve accepted that it’s ok that college isn’t the experience I romanticized in my mind",
            "score": 2,
            "author": "meeshmop"
        },
        {
            "level": 0,
            "comment": "Look for Oxford friends, join there groups.",
            "score": 0,
            "author": "91210toATL"
        }
    ]
}