{
    "id": "qumqpi",
    "score": 34,
    "title": "The truth about interviews (from an Emory alumni interviewer)",
    "author": "plainbread11",
    "date": 1637000350.0,
    "url": "https://www.reddit.com/r/Emory/comments/qumqpi",
    "media_urls": [],
    "other_urls": [],
    "postText": "Been seeing discussion both on here and in r/ApplyingToCollege about how interviews don’t matter, more for you to ask questions, etc. and how they don’t have much bearing on your admissions chances. I’ve also seen questions about whether getting an interview means you’re likely to get admitted. Let me break this down.\n\n1. Interviews are a random selection of a random selection. What that means is that only a certain selection of candidates are randomly selected to be in the interview portal to even be considered for an interview. Of that selection, you are basically randomly chosen by interviewers like me. Now, I put some degree of thought behind who I choose— mainly because I went to b school and can’t speak much to someone wanting to major in Linguistics— but it’s pretty random. So an interview invite by itself is NO INDICATION that you’ll get into Emory.\n\n2. Interviews absolutely matter…to a degree. As an interviewer and based on the information I’ve received from Emory, the way I understand it is:\n\n- An alright interview won’t help you but won’t hurt you. But at least you can ask questions about Emory.\n\n- A fantastic interview review can and many times will put you over the edge if it’s close. \n\n- A terrible interview can dash your chances at Emory, even if your chances were hopeful before. \n\n3. So what is a terrible/good interview? Well, let’s illustrate with examples from kids I’ve interviewed so far. \n\nCandidate A showed up before the interview time fully prepared. She was bubbly and enthusiastic and friendly, and a very good conversationalist. She had clear academic and career goals and why Emory was a perfect place to explore them. She highlighted the benefits of a liberal arts education even in the context of business. She asked insightful questions about my experience that she’d clearly put thought into. And she sent a nice thank you email afterwards. \n\nCandidate B showed up a few minutes after the interview. She was boring and unfriendly, almost sounding like she didn’t want to be there. No concrete reasons why Emory was a good place apart from “it’s in Atlanta” (not really lol) and the business school is good. She rambled a ton. Didn’t really have any thought out answers or interesting passions to share. Her questions were very generic. And she made one or two xenophobic comments. I wasted no time in recommending a denial of admission in detail. \n\n4. How to prepare for interviews?\n\nWell there are tons of articles first of all on typical college interview questions. Secondly, really read the essays you wrote and reflect on why Emory is a fit and what your personal story is. Lastly, come prepared with questions that aren’t answered online.\n\nWith all this being said, I’m an interviewer this season and if anyone is interested, they can PM me and I’m happy to see if they are in the interview portal/give an interview!",
    "comments": [
        {
            "level": 0,
            "comment": "Atlanta annexed Emory several years ago:\n\nhttps://www.ajc.com/news/local-govt--politics/atlanta-expands-eastward-completing-annexation-emory-and-cdc/nnLePc3xFxV989npP7MfNK/",
            "score": 3,
            "author": "crusheratl",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m aware (I graduated recently), but several of my interviewees have acted like they could walk off campus for a quick stroll into Midtown, and then look baffled when I tell them that it’s more like a 20 minute Uber. \n\nI’m all for saying you want to go to Emory “for Atlanta” but following up with statements like “I can’t wait to explore the city every day” make me question whether you’ve even researched the university.",
                    "score": 4,
                    "author": "plainbread11",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Maybe they aren't referring to the city limits but rather the area.",
                            "score": 2,
                            "author": "crusheratl"
                        },
                        {
                            "level": 2,
                            "comment": "People are being petty and downvoting you when Emory \"being in Atlanta\" is barely relevant to what you said.  You clearly made the point of basically saying that, in the context you are talking about (a meh interview with a somewhat uninterested applicant who likely did little beyond superficial research about Emory) constitutes a fairly empty response that doesn't go much beyond what Emory told interested parties in brochures/admissions related communications and \"propaganda\".  I'm sorry that you got dragged into some silly conversation about that when it was clearly not the point you were making (maybe they think an interview is an AP test or something where the believe the interviewed applicant should get some credit for recognizing that Emory is in Atlanta and allegedly viewing it as a positive aspect. \"It wasn't really meaningful and had no elaboration, but just give them credit because college admissions is hard!\").  I could care less where the applicant thinks Emory is versus the financial districts when they mention it (and people have Google before an interview or even putting in an application to figure that sort of thing out if they really really care), but I'd rather them not just have a response that \"I like Emory because it is in major metropolitan area or city\" and then basically nothing else (perhaps because they barely cared to learn about Emory or at Atlanta).\n\n&amp;#x200B;\n\nI have my things I harp on as well but damn!  Your post was supposed to be informative in terms of how the selection process works (or doesn't) and what a person like you may characterize as a good, solid, versus meh interview and your examples made sense and were contextualized properly IMO.  I guess people are in troll mode though (let us pull out this one irrelevant thing and make you respond to it).",
                            "score": 2,
                            "author": "oldeaglenewute2022",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hit the nail on the head. Its one thing to say you’re interested in Atlanta and then explain why (social scene? Career opportunities in a fast-growing city? Never lived in or near a big major city before?) vs. just saying “omg Emory is so cool because Atlanta is so cool, I can’t wait to walk around the city all the time and explore”. Half the time when I get a response like this and I ask if they’ve ever visited Emory, they say no and then, again, are confused when I say that Emory isn’t even in the middle of the city.",
                                    "score": 3,
                                    "author": "plainbread11"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was interviewed and I think it went pretty well? I asked a lot of questions, had insightful conversations, and she wrote a lot about what i said.\nShe called me eloquent and made comments like \"Sorry, I'd like to write down exactly what you're saying for the admissions staff because you're saying great things.\"\n\nIm just anxious. Do you think, based off of these few details, it was probably one of the good interviews?",
            "score": 1,
            "author": "marflowr",
            "replies": [
                {
                    "level": 1,
                    "comment": "Rule of thumb in my experience about what makes a good interview vs a bad interview: if you walked away feeling like you absolutely nailed it and that your interviewer loved you, chances are you did fine!\n\nIn terms of insightful conversations, what do you mean by that? Were you asked about your personality/motivations/passions and did you speak about things in great detail vs. a 1 word response? If you did the former then great job.\n\nIn terms of post interview questions my best practice is to always ask questions specific to the interviewer vs. about Emory. This makes the conversation personalized, and most people like to talk about themselves! Ex. “What were your favorite classes in the business school”? vs. “What classes are offered in the business school?”. You get the point.",
                    "score": 1,
                    "author": "plainbread11",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes. She asked about why Im choosing Emory, what motivates me about both my passions (music and medicine) and I gave her pretty long answers to all the questions (which is why she called me eloquent)\n\nI asked her what her least favorite and favorite experiences were at Emory. I also asked about why she chooses to interview. How the school accommodates minorities in her experience, etc.\n\nI felt really good about it.",
                            "score": 1,
                            "author": "marflowr",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Great job!",
                                    "score": 1,
                                    "author": "plainbread11"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is very helpful! How do interviewers report the quality of candidates after the interview? Like is the report just notes/summary of what the student said? Do u guys have to rate on how the candidate fits at Emory? etc. Thank you!",
            "score": 1,
            "author": "Mysterious_Lemon8408",
            "replies": [
                {
                    "level": 1,
                    "comment": "We rate candidates on character, intellectual curiosity and motivation. In my opinion this boils down to:\n\n1. Be interesting. To your question, yes, I’m seeing if you’re someone I want to be around at Emory/someone I find both cool and smart.\n\n2. Have an actual reason for going to college/going to Emory. Helps if you have a career goal in mind too, and how Emory can help achieve it.\n\n3. Have some actual intellectual interests (aka something besides Netflix or sleeping).\n\nBased on candidate responses we write a review (including what was said/our thoughts on it) across these three dimensions. I’d say the process is pretty similar across other schools and their interviews.",
                    "score": 1,
                    "author": "plainbread11",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank u so much for your time!! This is extremely helpful!! hope you have a nice day! :))",
                            "score": 1,
                            "author": "Mysterious_Lemon8408"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is it weird to connect with student interviewers on LinkedIn after the interview?",
            "score": 1,
            "author": "Mysterious_Lemon8408",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nope!",
                    "score": 1,
                    "author": "plainbread11"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sorry, your submission has been automatically removed. Your account is less than 24 hours old.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Emory) if you have any questions or concerns.*",
                    "score": 1,
                    "author": "AutoModerator"
                }
            ]
        }
    ]
}