{
    "id": "t32uxh",
    "score": 69,
    "title": "Who here thinks Emory should put the Clifton Road bridge back",
    "author": "jols0543",
    "date": 1646010360.0,
    "url": "https://www.reddit.com/r/Emory/comments/t32uxh",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 27,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "for real! i’ve seen two car accidents happen in this intersection, it’s terrifying",
                    "score": 8,
                    "author": "jols0543"
                },
                {
                    "level": 1,
                    "comment": "The pain of living in woodcliff",
                    "score": 3,
                    "author": "sthedragon"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Better solution would be to narrow the roads, and design it so that cars have to go more slowly. Put in some protected bulbouts in the intersection, narrowing it, making it easier to cross, etc.",
            "score": 11,
            "author": "schumi23",
            "replies": [
                {
                    "level": 1,
                    "comment": "i also considered this idea, and it’s a pretty good one! i personally prefer the overpass idea though because this solution gives pedestrians the freedom to cross at any time without waiting for two cycles of green lights. This is a high traffic intersection and it almost always has a queue of cars waiting. I also think that Atlanta drivers are too aggressive to be slowed down by narrower roads or other design elements anything short of speed bumps. They currently go 45mph down the 25mph road like it’s nothing.",
                    "score": 6,
                    "author": "jols0543",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They go 45 mph down the 25mph road \\*because\\* the road is designed for people to go 45 mph down it. There's nothing uniquely bad about Atlanta drivers, as opposed to drivers from other large cities. All are simply products of their environment.\n\nNarrower roads and other non-speed bump design elements \\*do\\* work to slow down traffic. I'm notably a fan of chicanes. Other elements include sharply angled curb cuts and bulbouts.\n\nIt's absolutely possible to give pedestrians the freedom to cross at any time, by programming the traffic light to prioritize pedestrian crossings; set it to instantly start a yellow&gt;red cycle when somebody begs to cross if it's been 60s since the last crossing. (or something similar).\n\nPedestrian bridges are designed to allow designers to keep cars moving quickly while touting that they are helping pedestrians, without taking any actual steps to make it friendlier to pedestrians.\n\n[https://usa.streetsblog.org/2020/09/07/op-ed-why-most-pedestrian-infrastructure-is-really-for-drivers/](https://www.itdp.org/2019/10/01/pedestrian-bridges-make-cities-less-walkable-why-do-cities-keep-building-them/)\n\n&amp;#x200B;\n\nMaking the road safer is definitely harder to do than simply building a pedestrian bridge. But it's absolutely needed.\n\nI also did not address the accessibility issues of pedestrian bridges. Beyond being longer/far harder to use than simply crossing the street if they use stairs like in your pic many of those who can't use them them (people with a broken leg, using crutches, wheelchairs, etc.) are the ones who need safe crossings the most, since they spend the longest time in those.",
                            "score": 7,
                            "author": "schumi23",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "i’m familiar with the idea of road design affecting traffic speed, I just don’t believe that that could realistically solve this particular problem. the amount of traffic that goes through this intersection is high, and there’s no other road nearby that goes from the one side of campus to the other like this one. I think what’s not clear is that this overpass takes you from outside woodruff residential center to Micheal Street, which has a sidewalk that goes straight to the other already existing bridge that goes from the Bio building to LSM residence hall. this overpass is helpful because there’s no crosswalk that takes you to micheal street or to the bridge, so pedestrians would have to either take a major detour or take the dangerous sidewalk path. Thanks so much for replying with constructive criticism, i’m doing my best to refine my ideas before i propose them officially!",
                                    "score": 2,
                                    "author": "jols0543",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You can have high amounts of traffic go through a road and still make it safer. Memorial Drive to the south in Atlanta was redesigned with many features to make it safer, and it worked. Traffic volume didn't decrease, speeds did. (Travel time increased).\n\nBut good luck. When Emory redesigned the other side of Clifton rd, they prioritized making traffic flow faster rather than safer - with a corresponding increase in crashes from it. (https://emorywheel.com/emory-must-stop-prioritizing-traffic-speed-over-safety/)",
                                            "score": 3,
                                            "author": "schumi23",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I'm thinking only speed tables and maybe that Clifton pedestrian bridge (which they HAVE entertained in the somewhat recent past.  I don't know why those conversations died down) work in the Atlanta area and of course those get limited to residential areas.  People have actually attempted to measure aggressive driving and Atlanta ends up very close to the top and being from GA, I just know that many of the roads in metro Atlanta are already much narrower than most large metros, yet I can tell you that people race down them especially if they are not in residential areas (and even if they are, if there is a two lane road...people are gonna speed no matter how narrow, hilly, and curvy the road is).  You would think the narrower roads and topography in North Georgia would make people drive safer but we know that is not the case (I think the area in and off of expressways/Interstates often has an unusual amount of car accidents).  People basically drive Atlanta roads (even narrow ones with ditches on either side and no guardrails) like they are damned roller coasters or something (part of this might be because the area is relatively low density so people sort of go on a joy ride when there seems to be less traffic. Folks get a little too comfortable because many drives even in relatively high density areas of ATL and Dekalb appear suburban or almost even rural in comparison to similarly situated places in other metro areas.  There are plenty of beautiful drives in N. Ga and Atlanta metro and there is sort of a culture of racing and whatnot in the south).\n\nNext they know it, they are going over a hill or around a curve and some car(or a pedestrian) jumps out of no where coming out of a driveway or something.  Atlanta inner city and inner ring burbs have no grid or serious street plan which adds more danger IMO.  And I think even by other metrics, NJ, NY, and Georgia drivers have been measured as particularly \"not good\" and Georgia would be among those even well before you started getting a lot of transplants from up north.\n\nI'm not saying all these metrics are neccessarily the best or most accurate, but when GA and metro Atlanta constantly come up with \"not good\" rankings, there may be something to it.",
                                                    "score": 3,
                                                    "author": "oldeaglenewute2022"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "thanks for that article! this will help with my argument",
                                                    "score": 2,
                                                    "author": "jols0543",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Knowing metro Atlanta and all the data we have on it...I'm going to side with you on this and honestly if you advocated for it, you would be reviving conversations that were actually taking place only a few years ago as they were nearing another Master plan update.  I think a bridge in that exact area (or maybe closer to where Woodruff is) was mentioned as a possibility.",
                                                            "score": 3,
                                                            "author": "oldeaglenewute2022",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "this is some helpful info! do you remember anything else? do you know if there’s public info on it?",
                                                                    "score": 2,
                                                                    "author": "jols0543",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I used to spy on Emory a lot more (as in I have my ways of doing it now, but it isn't as easy) when I had full access (like could use credentials to access planning documents) and may have to check my cloud or google drive to see if I saved any.  Or maybe I could dig around and get back in touch with you so you may be able to find such discussions.  Give me a couple of days and I might be able to get back to you.",
                                                                            "score": 2,
                                                                            "author": "oldeaglenewute2022",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "that would be super, thanks so much!",
                                                                                    "score": 1,
                                                                                    "author": "jols0543"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Terrible solution. Traffic is so congested around Emory right now.",
                    "score": 1,
                    "author": "mitskiismygf"
                }
            ]
        },
        {
            "level": 0,
            "comment": "fuck it me and my homies don't even wait for a gap we just walk in front of cars and make them stop survival of the fittest",
            "score": 6,
            "author": "jsh_",
            "replies": [
                {
                    "level": 1,
                    "comment": "that’s incredibly based, i’m far too chicken to do that, keep sticking it to the car users",
                    "score": 2,
                    "author": "jols0543",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "pedistrichads vs cartards the battle rages on",
                            "score": 5,
                            "author": "jsh_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "couldn’t have said it better myself",
                                    "score": 1,
                                    "author": "jols0543"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Contact some civil engineers at tech and draft a proposal",
            "score": 3,
            "author": "Uhhhh_History",
            "replies": [
                {
                    "level": 1,
                    "comment": "Or just talk to Fenves. He's also a civil engineer",
                    "score": 2,
                    "author": "iapetus3141"
                },
                {
                    "level": 1,
                    "comment": "that’s actually an awesome idea",
                    "score": 1,
                    "author": "jols0543"
                }
            ]
        },
        {
            "level": 0,
            "comment": "https://imgflip.com/i/66ykok",
            "score": 2,
            "author": "phraps"
        },
        {
            "level": 0,
            "comment": "Is nobody going to comment how this is very clearly photoshopped lol\n\nEdit: thought it would have been a real photo since the OP said having the bridge “back” lol",
            "score": 3,
            "author": "ThePatriotsFan",
            "replies": [
                {
                    "level": 1,
                    "comment": "don’t worry, i made the caption confusing, that’s on me",
                    "score": 3,
                    "author": "jols0543"
                },
                {
                    "level": 1,
                    "comment": "Isn’t that the point, just to show what it would look like",
                    "score": 9,
                    "author": "BackgroundReveal2949",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "yup",
                            "score": 2,
                            "author": "jols0543"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "We won't really need it after the R. Randall Rollins building is constructed",
            "score": 2,
            "author": "iapetus3141",
            "replies": [
                {
                    "level": 1,
                    "comment": "what’s that?",
                    "score": 1,
                    "author": "jols0543",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The building opposite Clifton Tower whose ongoing construction has blocked the sidewalk outside Woody's",
                            "score": 2,
                            "author": "iapetus3141",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "how will that building negate the need for a pedestrian bridge?",
                                    "score": 6,
                                    "author": "jols0543",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The reason you need to cross the street at all now is because the construction on that building cuts off the sidewalk there. Usually there is one.",
                                            "score": 2,
                                            "author": "OrangElm",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "i’m pretty sure the reason i have to cross the street is because i live on the other side of the street",
                                                    "score": 8,
                                                    "author": "jols0543",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "The crossing that is blocked off had a maximum wait of 2 minutes",
                                                            "score": 1,
                                                            "author": "iapetus3141"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "WAIT THERE WAS A BRIDGE AND THEY TOOK IT DOWN WHAT THE FUCK",
            "score": 1,
            "author": "icefang37",
            "replies": [
                {
                    "level": 1,
                    "comment": "damn i forgot i posted this lol. nah there was never a bridge there, i photoshopped it and posted the picture with a misleading caption to try to generate outrage about that extremely dangerous intersection. It was a pretty silly idea and it didn’t work out since this subreddit is dead af. sorry for misleading you!",
                    "score": 1,
                    "author": "jols0543"
                }
            ]
        }
    ]
}