{
    "id": "12yikun",
    "score": 130,
    "title": "The Frozen Chaos",
    "author": "Cocopuff-20008",
    "date": 1682427288.0,
    "url": "https://www.reddit.com/r/pettyrevenge/comments/12yikun",
    "media_urls": [],
    "other_urls": [],
    "postText": "(Hello again English isn't my first language so sorry for any grammar mistakes or spelling)\n\n\nSo I shared the story of the lipgloss incident a couple days ago and since alot of people seemed to like it here's another one! This one is a bit different 😂 instead of revenge on my little brother, he got revenge on me.\n\n\nSo I was about 11 years old and he was 9-10 years old (i can never remember how old he is 🤣 I still tell him I thought he was 14, he's very annoyed with me 😂) and it was mid summer, maybe end of June, start of July near my birthday. So my mom always made these fruit smoothie popsicles and I used to really love the strawberry ones, so for my birthday week she made a ton of em, maybe a dozen or so. Anyways I was a very sneaky child ( maybe im still a little sneaky lol) and I would do anything for those popsicles, and I may have eaten all 12 of them the day they set. My brother was off at a friend's house at the time, he was aware mom made popsicles but they weren't ready when he left. So when he came back he went to take one. Unfortunately for him they were all gone, now I knew when he was gonna be back so I made sure I was at a friend's place when he got back, cause I knew he'd have a fit. \n\nInstead of complaining and whining to my mom, he decided to make his own popsicles, he asked my mom to make him the strawberry smoothie mixture and he put in lemon concentrate inside all of them like he squeezed alot in them, he kept some for himself tho. Anyways I get home and see that they're some more and they all seem set, so I took one and my brother came in and  watched me put it in my mouth, unfortunately for him i quite liked the taste of lemons, enough that I'd eat whole lemons when I could. So I stared him down and ate the whole thing and then I gave him a smile and walked away.\n\n\nLesson that he learned you can never out prank your older sister, lesson i learned my little brother is growing up so it's time to step up my game 😂.",
    "comments": [
        {
            "level": 0,
            "comment": "Sweet and sour tale of sibling rivalry. I love it.",
            "score": 7,
            "author": "FewMonk4535"
        },
        {
            "level": 0,
            "comment": "You kept your cool",
            "score": 17,
            "author": "CoderJoe1",
            "replies": [
                {
                    "level": 1,
                    "comment": "😂",
                    "score": 7,
                    "author": "Cocopuff-20008",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That was smooth!",
                            "score": 1,
                            "author": "Vidya_Vachaspati"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "He thought he was screwing you, but, nope, he was the one with a metaphorically sour taste in his mouth.",
            "score": 5,
            "author": "BlueKnight87125"
        },
        {
            "level": 0,
            "comment": "\"Needs more Lemon flavor\".",
            "score": 1,
            "author": "MikeSchwab63"
        },
        {
            "level": 0,
            "comment": "*though",
            "score": -10,
            "author": "frantzianleader"
        }
    ]
}