{
    "id": "12yr8tz",
    "score": 9391,
    "title": "I unionized with my (26M) dogs against my boyfriend (30M).",
    "author": "Anony-Depressy",
    "date": 1682446382.0,
    "url": "https://www.reddit.com/r/pettyrevenge/comments/12yr8tz",
    "media_urls": [],
    "other_urls": [],
    "postText": "I was told to post this here from AITA. \n\nBackground: My boyfriend (E) and I have been together for four years. Whenever I would come over when we were dating, his apartment was messy but it was blamed on his roommates. I’m very cognizant that I am particular in cleaning, so I thought it just wasn’t clean enough to /my standards’/. I moved in with him ~3 years ago and adopted two dogs together. \n\nI quickly realized we do not have the same view of what “clean” is. We have communicated about it and he has made a lot of progress. But, he consistently does one thing: stuffs his colored striped socks into the couch. I have told him that I have had to chase the dogs around because they find them in the couch. He thought it was funny.\n\nOver the last few weeks, I have bought multiple cloth dog toys resembling his socks and have trained my dogs to play tug of war with them. They will now dive for them whenever he’s laying on the couch and places them on the ground to “pick up later.” I also do not stop them from playing with the socks anymore.\n\nHe came home yesterday and found his favorite pair of his socks decimated all over the living room and was furious that I didn’t stop them. I told him they were the socks he stuffed in the couch yesterday and he should have put them in the hamper. He stormed off to his office and is not talking to me. AITA?\n\nEdit: my dogs do not ingest the socks, they use it as a tug of war object. Using this example, when the pair individually ripped in half, they were no longer interested in it.",
    "comments": [
        {
            "level": 0,
            "comment": "Until it actually inconveniences him, he will not learn.  Good for you on working on training him.",
            "score": 7221,
            "author": "Excellent_Ad1132",
            "replies": [
                {
                    "level": 1,
                    "comment": "Should buy a clicker and use it whenever he puts socks in the hamper, and whisper enough for him to barely hear \"good boy\".",
                    "score": 103,
                    "author": "Momochichi"
                },
                {
                    "level": 1,
                    "comment": "Yeah. He expects OP to pick up after him",
                    "score": 1729,
                    "author": "Cherry_Crystals",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Like what fucking purpose is there to shoving your socks into the couch cushions?",
                            "score": 1779,
                            "author": "Sid-Biscuits",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Gross and lazy.",
                                    "score": 1092,
                                    "author": "setittonormal",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm sorry but I expect lazy people to at least have the decency to throw socks on the floor instead. :p\n\nAlso it takes more effort to stuff into a couch... :(",
                                            "score": 603,
                                            "author": "SomebodyUnown",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Okay, so I confess that I’ve gotten into the habit of undressing and tossing everything into the washer. Once it’s full I run the load and put everything away. My lazy went full circle.",
                                                    "score": 187,
                                                    "author": "OldHumanSoul",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "This is pretty much what I do. Clothes at night go into the washer, Jammie’s in the morning get tossed in. I WFH so sometimes the line is blurred between Jammie’s and clothes but the laundry get done!",
                                                            "score": 57,
                                                            "author": "cbowenkelly"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Same, but I still just can't bring myself to fold the stuff 80% of the time. So, every so often, I end up having a marathon laundry weekend. I'm working on it.",
                                                            "score": 32,
                                                            "author": "riverofchex",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I'm retired, and mostly stay home, and live in a rural area. If I don't feel like folding and putting away laundry, I get dressed out of the dryer. Wrinkled, but I don't care.",
                                                                    "score": 18,
                                                                    "author": "Effective-Gift6223",
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I *hate* folding clothes. Hangers are lifesaving for me. I don't have dryer so i just put wet clothes on hangers (usually watching some show) and dry them and then straight to my open closet.",
                                                                    "score": 13,
                                                                    "author": "LossZealousideal4367"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I’m a nurse and during bad-COVID times, I did this! Still do it if a patient pukes/poops on me. Definitely more hygienic esp if you’re the one doing the laundry.",
                                                            "score": 122,
                                                            "author": "Anony-Depressy",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I hate socks, so they only go on if I need to go out, and the moment I get home and take my shoes off, they come off too. They either get thrown right in the washer as it is 8 or 10 steps from the shoe rack, or left inside the shoes sometimes if I had only worn then for a very short time, like under an hour and if my feet had not gotten sweaty or anything either. After grocery shopping washer, after a quick doctors appointment, probably good to wear again.",
                                                            "score": 13,
                                                            "author": "on-borrowed-time-94",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "We both wear socks in the house (hardwood floors). But we just got inside slippers today for him and he hasn’t left socks in the couch for 5 days…… time will tell.",
                                                                    "score": 17,
                                                                    "author": "Anony-Depressy",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Nice!! Good start, I wish you good luck and hope he continues on this new path and does not fall back into bad habits.",
                                                                            "score": 6,
                                                                            "author": "on-borrowed-time-94",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Oh we already have 4 laundry baskets spread around the house. He laughed when he stopped being mad 😆",
                                                                                    "score": 12,
                                                                                    "author": "Anony-Depressy",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I undressed in front of the washer tossing my clothes in before bed a few days ago and my partner looked at me like I was crazy “I’m saving a trip!”",
                                                            "score": 6,
                                                            "author": "Altruistic-Bobcat955"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "as a lazy person i throw my socks on the floor. i’ve gotten better about bringing them to the basket (i’ll only leave one or two pairs on the floor at a time) but man there’s just something so nice about sliding your feet on the floor till your socks come off lmfao",
                                                    "score": 135,
                                                    "author": "colorkiller",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 78,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "If that works for you that's great.  I can not live that way.  Dirty clothes go in the hamper. PERIOD.  LOL.",
                                                                    "score": 48,
                                                                    "author": "Thepatrone36",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[deleted]",
                                                                            "score": 30,
                                                                            "author": "[deleted]",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Put one of those cheapo plastic hamper in the room and free throw them from the couch maybe?  LOL \n\nI'm not juding I'm just saying I'd go effing nuts seeing a pile of dirty socks laying somewhere other than in a hamper.  \n\nMy former long time GF (RIP miss you girl) was the queen of starting to get undressed at the door and leaving a trail of clothes from the door to the bedroom.  We went back and forth about it until I thought 'what the fuck?  I'll just pick em up.  It's not worth the stress'.  Wish I still had that trail to pick up.",
                                                                                    "score": 45,
                                                                                    "author": "Thepatrone36",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "As a lazy person I just never take my socks off until I get in the shower.",
                                                            "score": 16,
                                                            "author": "aoskunk"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Rookies. As a person with a Masters in Lazy, I just never wear socks. \n\nSaves me from having to (1) find clean socks, (2) bend over to put them on, (3) take them off, (4) pick them up, (5) put them in the hamper, (5) wash them, (6) dry them (7) take them out of the dryer (8) put the clean socks away. \n\nI get at least another hour of sleep a day now.",
                                                            "score": 13,
                                                            "author": "Devil-sAdvocate",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "This! You're not throwing them on the floor, you're utilizinf the floor to remove them and leaving them there.",
                                                            "score": 3,
                                                            "author": "stachemz"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Especially gross, the foot funk is going to be in those cushions forever.",
                                            "score": 166,
                                            "author": "ragdoll1022",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "My bf and I are a lil lazy so we have the main clothing hamper in the living room near the washer and couch instead of being gross and just tossing shit ://",
                                            "score": 8,
                                            "author": "MinutesTilMidnight",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Everyone I live with has this mentality.\n\nI'm done wearing this. Thus, I shall drop it immediately.\n\nMy child doesn't want to put them where they belong, and so prefers to hide them in the furniture.\n\nSomehow, her \"I'm out of socks and need laundry done immediately\" moments are becoming more frequent.\n\nEdit: am words good",
                                    "score": 156,
                                    "author": "TFRek",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Time to teach child how to do laundry",
                                            "score": 119,
                                            "author": "ccannon707",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That's when I did. Once she started complaining about missing items, etc, she started doing her own. That was age nine.",
                                                    "score": 76,
                                                    "author": "heathenliberal"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Laundry strips/pods are great for this. So is the “power wash” setting. My 7 year old uses it exclusively",
                                                    "score": 9,
                                                    "author": "FrequentEgg4166",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I wrote on my washrr dryer with Sharpie marker. Start here. Empty this.",
                                                            "score": 7,
                                                            "author": "motorheart10"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Mine does laundry, so it doesn’t help.",
                                                    "score": 15,
                                                    "author": "upotentialdig7527"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Probably wanted it out of sight to make the room look cleaner instead of putting it in his shoes or the laundry basket like a normal person",
                                    "score": 150,
                                    "author": "Cherry_Crystals"
                                },
                                {
                                    "level": 3,
                                    "comment": "He's stuffing them down the couch so OP doesn't see them right away and make him put them in the wash. He doesn't want to do it, so he sits down, shoves them down the couch to avoid OPs annoyance, and he'll move them later. Expect he doesn't move them later becuase he's lazy and he forgets about them.",
                                    "score": 25,
                                    "author": "Quartz636",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Why are some people so gross… I just don’t understand how people are so comfortable living in filth and stank",
                                            "score": 17,
                                            "author": "Sid-Biscuits",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Neither can I.\n\nHowever after reddit making me suspicious and bitter over the years, I would bet he's never lived in fifth for very long. I guarantee OP is not the first girlfriend that's picked up after him. He's probably learnt that if he leaves it long enough his mum, his roomates, his girlfriend, someone will snap first and clean it up.",
                                                    "score": 18,
                                                    "author": "Quartz636",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I've taken socks off in while I was sleeping on the couch I think, and they accidentally end up in the couch. I don't understand doing it on purpose, though.",
                                    "score": 13,
                                    "author": "KingStronghand",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "This is what I was wondering also why only certain ones",
                                    "score": 12,
                                    "author": "NiceStretch8776",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The emotional labor invested in training a grown-ass-man-baby is ultimately wasted.",
                    "score": 110,
                    "author": "weaponizedpastry",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "OP, Make sure you reward the pups with lavish treats for helping in boyfriend’s training. NTA!",
                    "score": 69,
                    "author": "Brake_Handle655"
                },
                {
                    "level": 1,
                    "comment": "Love this - my husband also leaves his socks on the floor and frequently finds them outside in the muddy back yard courtesy of dog. Do I bother to stop either of them? No. Is any of it my problem? Also no.",
                    "score": 15,
                    "author": "FrequentEgg4166"
                },
                {
                    "level": 1,
                    "comment": "I guess the dogs were a lot easier to train than the man",
                    "score": 14,
                    "author": "Temporary_Bug_1171"
                },
                {
                    "level": 1,
                    "comment": "the smart human training the dogs, who in turn train the moron human",
                    "score": 14,
                    "author": "NatureCarolynGate"
                },
                {
                    "level": 1,
                    "comment": "Exactly. \nSad but true. Hallmark of the selfish partner.",
                    "score": 126,
                    "author": "Dani3113kc",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Should probably remember this.\n\n&gt;We have communicated about it and he has made a lot of progress.\n\nClearly he's not selfish if he's actually willing to change his behavior, right?",
                            "score": 20,
                            "author": "shadeOfAwave",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Cleaning up after yourself in a shared space isn't something that should require communication and 'progress' as an adult, he should just be doing it without OP having to sit him down and like a child, explain why not throwing your shit all over the floor isn't acceptable.",
                                    "score": 34,
                                    "author": "Quartz636",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Edited to clarify: The boyfriend here sucks and deserves his treatment. I'm responding to this statement here:\n\n&gt;Cleaning up after yourself in a shared space isn't something that should require communication and 'progress' as an adult\n\n\nI take issue with this because there are plenty of adults out there actually making effort and progressing. \n\n\n--\n\nNot everyone grew up with healthy habits. Some adults are absolutely progressing on that type of chore because they may not have learned good habits when they were learning to function but they're learning now so they can care for themselves and others.\n\n\nFor example: I was raised by hoarders. Almost nothing got thrown away because it *might* be useful eventually and there was just shit everywhere because my mom rarely left her room. She didn't clean and the most she did to teach us was to yell about what failures we were when she got tired of the mess she never cleaned. On top of that, most of her children have adhd including me and rather than get us care and teach us how to function around it, she claimed it was made up and that we were just incompetent at everything. Yes, I'm bad at not throwing shit on the floor. I don't need to be told that it's not ok. I'm aware. That's precisely *why* I'm actively progressing as an adult. I can't change my past but goddammit I can fucking change my future.\n\n\nYour holier than thou talking points here are all too telling about how many resources you had through your formative years. Some of us didn't get anything and just got thrown into the world to drown. Consider yourself lucky and stop shaming people who got less parenting than you did. That's not how you'd want to be treated, is it?",
                                            "score": 42,
                                            "author": "thatpotatogirl9",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I learned how to fill gas once I was literally on empty and a kind lady showed me. Roommate showed me how to make the bed. Random people showed me how to do laundry. My parents sent me off to live on my own on a DIFFERENT CONTINENT at 17 with like zero life skills. I some how managed to figure it out AND then in a few years I got a cat and trained my cat to be better behaved than this dude. Nah. This is willful ignorance. And I’m not making myself out to be some fancy homemaker. I still watch videos for things I think people just know or learned from their parents.",
                                                    "score": 32,
                                                    "author": "fireandice1987",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I'm not defending him. Just frustrated by them saying it shouldn't be that any adult has to make progress at cleanliness. Not all of us are weaponizing incompetence like this dude.",
                                                            "score": 4,
                                                            "author": "thatpotatogirl9"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "He's 30 years old. He's had roomates. This is not some babe in the woods just leaving home. I don't care who the man is, if I'm having to try and train a 30yo whole ass adult not to shove sweaty, dirty socks down the side of our couch every day, I'm up and out. \n\nAnd then for him to laugh when the dog finds the socks, finding it hilarious when OP is trying to get it back for him, only to get pissy and stomp off like a child when he does it AGAIN only this time she doesn't stop the dog becuase it's not her God damn job??",
                                                    "score": 32,
                                                    "author": "Quartz636",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Oh I'm not defending him. I'm just saying there are situations where an adult \"making progress\" is not a case of laziness.\n\n\n&gt;Cleaning up after yourself in a shared space isn't something that should require communication and 'progress' as an adult\n\n\nI'm responding to the very broadly applicable statement you made here. In an ideal world those things should not require communication but this isn't the ideal world and some of us start off much worse than others. The boyfriend here is being a child. But don't shit on literally everyone who is still learning just because people like this dude exist and waste everyone's time. Not every messy person just wants to be lazy and make others clean up after us. Plenty of us are trying to become the functional adults you're describing as the bare minimum.",
                                                            "score": 4,
                                                            "author": "thatpotatogirl9"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I feel like the people defending him are the ones shoving socks in their couches.",
                                                            "score": 23,
                                                            "author": "yolandaslemons",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Real",
                                                                    "score": 7,
                                                                    "author": "Anony-Depressy"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Consequences drive decisions",
                    "score": 18,
                    "author": "HblueKoolAid",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "They either train you, or you train them",
                    "score": 12,
                    "author": "larryscathouse"
                }
            ]
        },
        {
            "level": 0,
            "comment": "NTA. your boyfriend is a baby. Why the F would you stuff your socks into the couch? Like I'm absolutely a cluttered person and I struggle with housecleaning but I'll be damned if I'm going to shove dirty socks in the couch.",
            "score": 1402,
            "author": "poofandmook",
            "replies": [
                {
                    "level": 1,
                    "comment": "Right? What the fuck, why would you stuff your socks in the couch??? So you can smell feet while you're watching TV? What's the plan for those socks? Put them in the hamper when it's laundry day? I really don't get it lmao",
                    "score": 191,
                    "author": "gnit2",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I knooooow imagine lying down on the couch for a nap only to get a whiff of socks? BLECH!! I suck at putting things where they go so I make it nearly impossible to NOT put dirty clothes where they belong. Got 3-bag laundry sorter and stuck it right between the bedroom and the bathroom. Is it too big for the space? yes. Do I have to squeeze by it sometimes? absolutely. Are there ever dirty clothes on either the bedroom or bathroom floor? NOPE. because I'm a grownup!",
                            "score": 81,
                            "author": "poofandmook",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Tbh I'm guilty of the bedroom floor laundry pile, but that's right next to the hamper (basically spilling out of it). Stuffing socks in the couch is something else.",
                                    "score": 38,
                                    "author": "gnit2",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Going to adopt 'cluttered person' as my personal motto from now on.",
                    "score": 204,
                    "author": "Awkward_Dog"
                },
                {
                    "level": 1,
                    "comment": "OP's boyfriend likes things to look clean but does not like to clean or think they should have to. Why would they when their mommy girlfriend will do it? So they stuff them in the couch, out of sight, out of mind. And if any issues arise from this, then mommy girlfriend will deal with it. Since mommy girlfriend didn't do her duty of saving his socks, as he expects, he now gets to be mad at her.",
                    "score": 18,
                    "author": "coolgherm"
                },
                {
                    "level": 1,
                    "comment": "&gt;Why the F would you stuff your socks into the couch?\n\nI’m guessing the first thing he does when he gets home is relax on the couch, and the socks come off then. And he stuffs them in the couch to hide them from op.",
                    "score": 105,
                    "author": "waitingfordeathhbu",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "that's still ridiculous. When I come home the first thing I do is change clothes and I make sure our laundry hamper is in a convenient place for me to NOT feel the need to drop my dirty clothes wherever.",
                            "score": 97,
                            "author": "poofandmook",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah I definitely wasn’t suggesting it’s not ridiculous",
                                    "score": 33,
                                    "author": "waitingfordeathhbu"
                                },
                                {
                                    "level": 3,
                                    "comment": "I made a joke somewhere a few weeks back that I kind of have like a Mr. Rogers routine. I come home, take off my shoes at the door, put on slippers, take off my jacket and hat, hang them, head to my bedroom, change into shorts/sleep pants, and then go about whatever I'm going to do inside the house. If I'm heading out, it's the opposite, but pretty similar routine.\n\nLike someone else said, and I'm not proud, I'm a cluttered person. My kitchen counter when I'm cooking, my coffee table, and various other stuff takes me a bit to clean off but still. Walking in and putting my shoes furniture or sitting around in uncomfortable or sweaty clothes is just bad for you and your furniture and it's just so easy to just start a routine like that. Unless I'm folding laundry while watching tv, you're not going to see anything but my hat, jacket and shoes near the front door anywhere in my living room. If even I can manage that, dude, I can't imagine who someone couldn't (aside from disabilities, maybe).\n\nEdit 2 days later: its been literally years but I just committed a cardinal sin. I was rushing out the door to shop and realized I had a hole in a sock from a \"playful\" kitten so I grabbed a new pair, sat down, changed and when I got back I found the offending sock with a hole in it sitting in my recliner. I threw it away quick-like but I remembered this comment and needed to either admit my sin or, idk, tuck the sock under my pillow to repent? It's been years, but sometimes people slip.",
                                    "score": 24,
                                    "author": "dudemann"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "We have a saying at my house. \"The living room is not a hamper\".\n\nAnything left there has no protection, and will not be laundered. Leave it long enough (1 week), and it will be thrown in the trash (with a 5 minute warning)\n\nRooms need boundaries too!",
            "score": 661,
            "author": "fromhelley",
            "replies": [
                {
                    "level": 1,
                    "comment": "A week? You have a lot more patience than me. My bf is gross and does what OPs bf does and puts them in the couch cushions. Garbage immediately. Idc if they're the expensive ones. We spent money on hampers and apparently that didn't mean squat.",
                    "score": 196,
                    "author": "scaredy-cat95",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wait this is a thing that more than one person does!!?",
                            "score": 89,
                            "author": "spokenmoistly",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My wife will leave socks, shirts, bras, jackets, etc… just laying wherever they come off. Doesn’t matter if it’s the bathroom counter, kitchen counter, couch…. It’s all fair game for her dirty clothes. Pisses me off to no end",
                                    "score": 50,
                                    "author": "notorious_tcb",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Leaving a trail of dirty clothes is mundane and likely common, it's the stuffing dirty clothes in the couch part that seems specifcally odd enough for someone to do, let alone multiple random someones. \n\nAt least, that's what i thought the person you responded to meant when they asked more people do that same thing.",
                                            "score": 50,
                                            "author": "museloverx96",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That is in fact what I meant. My wife also leaves a trail of discarded garments strewn about.\n\nI’ve never seen her stuff socks in the couch. That’s wild.",
                                                    "score": 13,
                                                    "author": "spokenmoistly",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I moved a hamper for his exclusive use next to the bed, like touching distance when he sits on the edge. Still a pile of clothes right where he takes them off in the space between.",
                            "score": 28,
                            "author": "longhorn718",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I put hampers in multiple rooms and a trash can in every. single. room. in the house. There's still dirty clothes and used napkins everywhere :(",
                                    "score": 4,
                                    "author": "Fire59278"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Whaaaaaa the the FUCK are your partners doing with their socks oh my LORD.\n\n&amp;#x200B;\n\nI have a separate fucking HAMPER for socks cause feet are disgusting, wowowowow.",
                            "score": 28,
                            "author": "QuadSeven",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Just curious, do you also have a separate hamper for underwear?",
                                    "score": 4,
                                    "author": "hicow",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My rule started with Legos and evolved to include EVERYTHING.  if it's left on the floor it's mine. I can too it or donate it, if I'm feeling very generous you can buy it back.",
                    "score": 24,
                    "author": "deshep123",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Told my kids everything I found not put away was obviously something they didn’t care about and would get donated to kids who would care for them. Yea, several trips to goodwill and temper tantrums later and they still leave their crap laying everywhere",
                            "score": 21,
                            "author": "notorious_tcb"
                        },
                        {
                            "level": 2,
                            "comment": "I like the buyback option!!",
                            "score": 7,
                            "author": "fromhelley"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Too bad so sad for him. Lol. NTA BTW.",
            "score": 1074,
            "author": "NPureheart",
            "replies": [
                {
                    "level": 1,
                    "comment": "A commenter in AITA said I should have said “I thought it was funny.” Missed opportunity.",
                    "score": 804,
                    "author": "Anony-Depressy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Argh, this is what I was just thinking.",
                            "score": 35,
                            "author": "notnotpegbundy"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Stuff your dirty underwear in his pillowcase and if he asks why, say there was no room left in the couch",
            "score": 207,
            "author": "curds-and-whey-HEY",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ha!!",
                    "score": 17,
                    "author": "how-about-no-scott"
                },
                {
                    "level": 1,
                    "comment": "This is petty and I love it haha!",
                    "score": 15,
                    "author": "AlaskanBiologist"
                },
                {
                    "level": 1,
                    "comment": "AND your dirty socks, and bra, and yesterday’s t-shirt…..and everything honestly. I would love an update to that!",
                    "score": 3,
                    "author": "AshRT"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 1679,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am a dog trainer and I concur. So, so, so much. \n\nChildren are easy to teach. The older people get, the better they get at being stuck in behaviors and making up reasons why it is a good thing. The only difference is if they are open to \"better\" ways because their own dont work, or because they actually want new input. To try to teach someone that dont want to change or learn is the most frustrating thing in the whole world.",
                    "score": 386,
                    "author": "xthatwasmex",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’ll say that I’ve been training my man for 28 years and it took! I’ll fight to keep him. \n\nSeriously, he’s great. I’ll throw hands.",
                            "score": 30,
                            "author": "BeautifulPainz"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is true",
                    "score": 50,
                    "author": "Enders_Shadow_Bean"
                },
                {
                    "level": 1,
                    "comment": "Woo, I felt this one all the way down. 😭",
                    "score": 37,
                    "author": "annrkea",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just remember, OP. Give him a small treat &amp; use a clicker every time he puts them up. After a few weeks, he won't even need a treat anymore &amp; will be happy just hearing the noise! :D\n\n(Dude better be solid gold other than this one quirk though, darlin'. You really don't wanna spend the next 50yrs of your life having this same argument in different flavors.)",
            "score": 161,
            "author": "WastelandMama",
            "replies": [
                {
                    "level": 1,
                    "comment": "“This same argument in different flavours” is an excellent way to describe the rut relationships sometimes fall into.",
                    "score": 44,
                    "author": "LilJellyfishGal"
                },
                {
                    "level": 1,
                    "comment": "He’s pouting and not speaking to her over a pair of socks he left out. This dude is nowhere near solid gold.",
                    "score": 16,
                    "author": "Teammaj"
                },
                {
                    "level": 1,
                    "comment": "The man is a 30yo adult stuffing his dirty socks in the couch. Only literal solid gold, an incurable disease set to take him in three weeks, and a will in my favor would convince me to put up with that nonsense. Jfc  girl, raise that bar.",
                    "score": 5,
                    "author": "SerChonk",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Stuffing worn socks into a couch is just weird.",
            "score": 28,
            "author": "typhoidmarry"
        },
        {
            "level": 0,
            "comment": "Quick water spray in his face and a firm \"No\" should do the trick. Once he's stopped sulking of course.",
            "score": 30,
            "author": "Wibblejellytime"
        },
        {
            "level": 0,
            "comment": "In what world is stuffing old stinky socks into a couch acceptable?\n\nAnswer: When you live alone.\n\nAs soon as you live with someone else, those behaviors need to change.",
            "score": 185,
            "author": "Ex-zaviera",
            "replies": [
                {
                    "level": 1,
                    "comment": "...even then, have some self respect.",
                    "score": 104,
                    "author": "this____is_bananas"
                },
                {
                    "level": 1,
                    "comment": "&gt;\tAnswer: ~~When you live alone~~\n\nNever.\n\nLike I’ll take my socks off while I’m sitting in the couch after work and leave them there until I get up, but as soon as I leave the couch they come with me.",
                    "score": 71,
                    "author": "Prestigious_Oven4492",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Yeah, I'm a dude who likes dudes and is single. If I went over to someone's house and they have dirty socks stuffed in the couch I would leave. GROSS!",
                    "score": 31,
                    "author": "Bromogeeksual"
                },
                {
                    "level": 1,
                    "comment": "I don't understand why you would stuff them in the couch??? Like, I typically keep them all in a pile next to my washing machine and when the pile has a certain size I just wash them with my other clothes. That’s the lazy way and just so-so more convenient.",
                    "score": 5,
                    "author": "Serylt"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You are an A+ trainer of the highest excellence 👏",
            "score": 140,
            "author": "hugeasterix",
            "replies": [
                {
                    "level": 1,
                    "comment": "There are some great dog trainers out there writing books, selling merch, and starring in their own tv series. Op could build ~~her~~ his own empire based on ~~her~~ his boyfriend training expertise.",
                    "score": 40,
                    "author": "waitingfordeathhbu",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The S/O whisperer",
                            "score": 8,
                            "author": "deshep123"
                        },
                        {
                            "level": 2,
                            "comment": "Umm it’s a gay couple here",
                            "score": 15,
                            "author": "Empoleon_Master",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Jeebus Christmas the fact that it was easier to train canines than a human. NTA",
            "score": 63,
            "author": "AppealEasy2128"
        },
        {
            "level": 0,
            "comment": "What kind of neanderthal stuffs their dirty socks into the couch?",
            "score": 13,
            "author": "darxide23"
        },
        {
            "level": 0,
            "comment": "Well done, but your boyfriend is disgusting.",
            "score": 14,
            "author": "Specialist_Passage83"
        },
        {
            "level": 0,
            "comment": "When you catch your boyfriend stuffing his socks into the couch, bop him on the nose and tell him he's a bad boy.",
            "score": 13,
            "author": "placidazure1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Careful, he may be into that, and doing so would only serve to encourage the bad behaviors",
                    "score": 4,
                    "author": "kyuuketsuki47",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I am sorry but you brought this problem to him already, and he didn't care so, choices.\n\nNTA",
            "score": 48,
            "author": "Windk86",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Have you tried swatting his nose with a newspaper?",
            "score": 10,
            "author": "94boyfat"
        },
        {
            "level": 0,
            "comment": "Sounds like dirty socks are safest in the hamper",
            "score": 70,
            "author": "1inker",
            "replies": [
                {
                    "level": 1,
                    "comment": "See! You learned faster than his boyfriend. \n\nIn her case, AITA = *Am I The Awesome!*",
                    "score": 23,
                    "author": "Tangurena",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "When your boyfriend does this next, rub his nose in his dirty socks &amp; tell him he's a bad boy... Not kind, but it's the only way he'll learn &amp; in the long run he'll be happier for not being a mucky pup.",
            "score": 9,
            "author": "lorentzisback"
        },
        {
            "level": 0,
            "comment": "Time to rehome the boyfriend. Dogs are better company",
            "score": 9,
            "author": "MadTom65"
        },
        {
            "level": 0,
            "comment": "I’m too old and tired to deal with a man like that.  I’d just move out.",
            "score": 9,
            "author": "AcceptableBiscotti16"
        },
        {
            "level": 0,
            "comment": "Have you tried to clicker train him?",
            "score": 10,
            "author": "corporate_treadmill",
            "replies": []
        },
        {
            "level": 0,
            "comment": "As the owner of 3 dogs with a partner who's also annoying to me with his sock habits, I salute you good sir. 🫡",
            "score": 42,
            "author": "No_Albatross5110"
        },
        {
            "level": 0,
            "comment": "Why are you dating an absolute man-child?",
            "score": 18,
            "author": "Magnaraksesa"
        },
        {
            "level": 0,
            "comment": "Who the hell stuffs socks into a couch?\nI mean wtf?",
            "score": 7,
            "author": "Ugg225"
        },
        {
            "level": 0,
            "comment": "That’s so nasty!!! 🤮🤮🤮 I would be out!! He’s ruining your couch!!! When you have people over they’ll enjoy that funky locker room smell when they sit on your couch. “Watch out for the toe jam!!!” You should just throw the whole “man” away. And then get a new couch",
            "score": 6,
            "author": "InternalBobcat4443"
        },
        {
            "level": 0,
            "comment": "Sad to say but the dogs learn faster than him",
            "score": 6,
            "author": "Apprehensive_Item737"
        },
        {
            "level": 0,
            "comment": "My husband has lost many a socks due to the dog and leaving socks on the floor to pick up later. When I find a hole in one I might make the hole a bit bigger then put in it away. He can’t figure out why all his socks have holes.",
            "score": 14,
            "author": "Complex_Rip3130"
        },
        {
            "level": 0,
            "comment": "You are absolutely NTA. Sounds to me like your significant other was lucky to find a partner with patience and a sense of humor.",
            "score": 18,
            "author": "Reasonable_Read8792"
        },
        {
            "level": 0,
            "comment": "My roommate takes his socks off in the livingroom and I have been slowly steeling all his socks. It was an accident at first because I thought it was my son doing it now I just do it to be petty. I got plenty of socks now.",
            "score": 5,
            "author": "Gralb_the_muffin"
        },
        {
            "level": 0,
            "comment": "What is it with men and stuffing their socks in the couch? 100% of the people I've known who have done this have been male. What is the appeal? Why not take them to the hamper? Why stuff them in? I don't understand.",
            "score": 6,
            "author": "tacosarejustokay"
        },
        {
            "level": 0,
            "comment": "Get out your dogs 🐕 are better roommates than your boyfriend.  Natural consequences.",
            "score": 4,
            "author": "Commercial_Koala_29"
        },
        {
            "level": 0,
            "comment": "Uh. Your boyfriend needs to learn how to relationship proper like. Progress is good but damn man. Pick up your socks. It ain’t hard.",
            "score": 19,
            "author": "Known-Skin3639"
        },
        {
            "level": 0,
            "comment": "You told him before that it needed to stop. You communicated the issue. He decided to fuck around and find out.",
            "score": 11,
            "author": "Ambitious_Tie_8859"
        },
        {
            "level": 0,
            "comment": "Are you still with him? I personally couldn't deal with someone like this. I would slowly go insane being the maid for someone who is 4 years older then me.",
            "score": 30,
            "author": "Cherry_Crystals"
        },
        {
            "level": 0,
            "comment": "Lol training the dogs and boyfriend at the same time. Good job!",
            "score": 16,
            "author": "Far-Reach-9328",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Um...dog tax? (hint photo)",
            "score": 5,
            "author": "MoreCowbellPlease",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted - sorry realized you could read my phone number on their dog tags lmao]\n\nMy boys 🥰",
                    "score": 11,
                    "author": "Anony-Depressy",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Bro I go through the same shit. You are not his maid, his caretaker nor are you responsible for his happiness. And if he does not realize that, or no not just that but if he is not selfless enough to do something he knows impacts you, I’m not sure he is really there for anyone else but himself… aggressively said, I know, but um this fix is so simple!! And after two years, I got mine to pick up his socks and it makes a difference!!!",
            "score": 3,
            "author": "Cactus_Address1289"
        },
        {
            "level": 0,
            "comment": "I was just threatening my SO that I wish the dog ate his socks so he'd stop leaving them around. NTA. Let him learn to pick up after himself.",
            "score": 4,
            "author": "heretolurk4"
        },
        {
            "level": 0,
            "comment": "NTA!",
            "score": 5,
            "author": "realcockies"
        },
        {
            "level": 0,
            "comment": "Asshole? No.\nGenius? Hell, yeah!",
            "score": 3,
            "author": "Far-University-8494"
        },
        {
            "level": 0,
            "comment": "This is a No, for your AITA Question.  Your just teaching him a lesson through alternative methods. Well done. \nI wonder that would work for me and my wife's lack of dealing with her laundry?",
            "score": 5,
            "author": "45dadbod76"
        },
        {
            "level": 0,
            "comment": "#FAFO \nAlso, NTA by any means.\n\"This is why you can't have nice things, and it's your fault.\"",
            "score": 4,
            "author": "Original_Dream_7765"
        },
        {
            "level": 0,
            "comment": "Train the dogs to train the boy.  (I’d say man but no grown man puts his socks in the couch). \nHe’ll get there, positive reinforcement and treats!",
            "score": 4,
            "author": "MW240z"
        },
        {
            "level": 0,
            "comment": "I'm not the tidiest person in the world, but I've never even considered stuffing my socks down into the sofa.\n\nGood dogs. Bad manchild.",
            "score": 4,
            "author": "Overlordgaz"
        },
        {
            "level": 0,
            "comment": "Hmm, I have a cat that pees on particularly smelly stuff left on the floor. She peed on my husbands shorts and now he doesn’t seem to be leaving his clothes on the floor anymore. I’ve been on his case about his ‘floor clothes’ for years. I don’t feel so pissed off at my cat anymore",
            "score": 4,
            "author": "WaddlingKereru",
            "replies": []
        },
        {
            "level": 0,
            "comment": "lol diabolical but I approve...  \n\n\nhe is a grown man who surely he can take his socks to the washing machine or tuck them in his shoes if its too much hassle.   \n\n\nNTA",
            "score": 5,
            "author": "Aussiewhiplash"
        },
        {
            "level": 0,
            "comment": "Boyfriend has that childish mentality",
            "score": 4,
            "author": "endgame-colossus"
        },
        {
            "level": 0,
            "comment": "NTA. He is a grown man. Dirty clothes belong in the hamper, bathroom, or washing machine. Stuffing dirty socks into a couch is a disgusting habit.\nJust because you didn't safeguard his socks anymore doesn't make it your fault. You got dogs together, ergo they are his dogs, too. His socks are his responsibility. You didn't purposefully take socks from the hamper for the dogs to play with.\n\nI can only imagine what a disaster this would be if you someday had children together. Leave, OP.",
            "score": 4,
            "author": "pastelcottoncandy88"
        },
        {
            "level": 0,
            "comment": "Manchild might have learned a lesson and is pouting. Let him.",
            "score": 4,
            "author": "Tallguy71",
            "replies": []
        },
        {
            "level": 0,
            "comment": "It's bad enough with all the dryer abductions, lost socks and the already too short lifespan of socks, but you're training dogs to kill them now?!  I mean, you're not even freeing a house elf by doing this.\n\nDid you name your killer dogs, \"Ripper\" and \"Stretcher?\"",
            "score": 12,
            "author": "CoderJoe1"
        },
        {
            "level": 0,
            "comment": "Also gross, who stuffs dirty socks in their couch? That’s beyond lazy and weird. And it’s definitely NOT your job to pick them up. \n\nPlus you have dogs… like what did he expect? \n\nHe played a stupid game and won a stupid prize",
            "score": 10,
            "author": "Pippet_4"
        },
        {
            "level": 0,
            "comment": "Did you ring a bell after he saw the socks? Pavlov? 😂",
            "score": 9,
            "author": "Brave-School5817"
        },
        {
            "level": 0,
            "comment": "If I had a nickel for every commenter in this thread that didn’t realize you were a gay couple I’d have like….a solid amount of pocket change.",
            "score": 8,
            "author": "Empoleon_Master",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s the internalized misogyny and heteronormativity for me ❤️",
                    "score": 6,
                    "author": "Anony-Depressy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My wife and I have a give and take relationship. Sometimes I find trash or something simple in a weird place and for a split second I think to myself ew I'll leave that for her to pick up her own mess. Then my rational side tells me how big of an idiot I am because of how much of my shit she takes care of for me all the time. Of course I'll pick up her mess. She's deserves so much more than that, it's the least I could do as part of this team.\n\nIf this were the other sub I would say you are not the asshole, but I would also recommend evaluating what of your partners flaws you want to cover for instead of asking him to change. Certainly some things are worth asking for change while others it's nice to just help out instead. The degree of which that makes sense for your relationship is something you may already have considered, but I felt like leaving this advice because sometimes things we feel are obvious are not always obvious to everyone. Maybe this will help someone who reads this.",
            "score": 74,
            "author": "iStabs",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is a three year long process. I wouldn’t care *so* much if they were relatively clean socks (I.e., only leaving the house minimally, etc) but very frequently it id post-sport (soccer, volleyball, football, bowling, golf, etc.) or post-8-hour-shift. I should not have to lay on my couch trying to watch TV and smell nasty feet. I had mothered him and while I shouldn’t have to, I did. We now split the chores relatively 50/50 (I cook, he cleans up; I do the laundry, he puts it away). I do take more of the “household” duties because he is more mechanically inclined tho.",
                    "score": 110,
                    "author": "Anony-Depressy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yea I would never judge your relationship. That's such a personal thing that I could never judge someone else's situation accurately with all the nuance and depth involved.\n\nYour way of handling it is funny and I feel like only you would really know if he deserves it or not.\n\nAlso on the topic of splitting the work, my wife and I try to keep an equal number of hours worked. It doesn't matter if you are being paid by someone or not. We aim for equal amount of hours worked so that it stays fair and doesn't davalue the importance of things we don't get paid to do.\n\nYou sound like you have a healthy relationship if you are having fun weaponizing the dogs play time.",
                            "score": 42,
                            "author": "iStabs",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This was a few days ago, but he eventually came around when the new socks arrived. He said he understood now. Only time will tell! He did admit that when he realized why I did it, he started laughing. Silver lining I guess.",
                                    "score": 64,
                                    "author": "Anony-Depressy"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Wonder how long you’ve been married? It took me YEARS to figure this out!",
                    "score": 7,
                    "author": "SM1955",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "We have been together for 11 years. One day it was like an epiphany where we realized we had been dating seriously for 6 months just because we kept trying to hang out everyday because we got along so well as friends. Hanging out like a regular night making fun of friends and sudden realization of oh shit, I think we are in a serious relationship.",
                            "score": 6,
                            "author": "iStabs"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Spoken like a mature, considerate man, with a mature, considerate partner 👏\n\nGod bless and keep you both.  The two of you already know AND PRACTICE something it takes the rest of us decades to figure out 💐",
                    "score": 4,
                    "author": "daylily61"
                },
                {
                    "level": 1,
                    "comment": "What a thoughtful man you are, if you were OPs bf she’d never be writing this.  Somehow I don’t think her partner is of the same ilk as you.",
                    "score": 15,
                    "author": "JonesinforJonesey",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "(btw OP is a dude)",
                            "score": 15,
                            "author": "LuccaAce",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I was going to respond and just point out I have my own issues but I deleted it. I'm sure everyone knows not everyone is perfect and you can't judge me just by the bit you see. Thank you for the compliment though.",
                            "score": 3,
                            "author": "iStabs"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is called hard lesson learned. Now pick up your shit or it’ll more than likely happen again",
            "score": 8,
            "author": "Whyletmetellyou"
        },
        {
            "level": 0,
            "comment": "That was awesome!  Hope the doggies got extra treats. \n\nIf it continues, the next training session is go after them while they’re on his feet.",
            "score": 7,
            "author": "Squibit314"
        },
        {
            "level": 0,
            "comment": "As a huge sock person and someone who has done dumb things like this, he needed this. Got to learn and some of us learn the hard way. RIP his favorite socks, long live the new ones that make their way to a hamper",
            "score": 7,
            "author": "squirrelsonic",
            "replies": [
                {
                    "level": 1,
                    "comment": "They were a pair of socks I bought him years ago. I saw them playing with it and immediately just found the email and ordered a new pair.",
                    "score": 6,
                    "author": "Anony-Depressy",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have ADHD and this is also how I learned to start cleaning up after myself.  Sort of.  The dog will also shred all the mail I don't like.  But it does eventually get cleaned up now instead of creating an interdimensional space on my desk via mass, force of will and longevity.",
            "score": 3,
            "author": "Grmmff"
        },
        {
            "level": 0,
            "comment": "Great googly moogly. Don’t tell me dogs about the union.",
            "score": 3,
            "author": "DallasSherier"
        },
        {
            "level": 0,
            "comment": "Now you need to get an old pair of boxers and stuff them. Then you teach the dogs to play tug of war with those every time they hear the phrase \"not tonight honey\".",
            "score": 3,
            "author": "Adaian5443"
        },
        {
            "level": 0,
            "comment": "I love that two dogs learned how to deal with the socks faster than he did. Amazing.",
            "score": 3,
            "author": "Dahlia_Dee"
        },
        {
            "level": 0,
            "comment": "Lol, I read that as 'I unionized with my 26 million dogs against my boyfriend' ;)",
            "score": 3,
            "author": "DioCoN"
        },
        {
            "level": 0,
            "comment": "&gt; I quickly realized we do not have the same view of what “clean” is\n\nYou talk about this BEFORE you move in.\n\nWhy wouldn't you just hide his socks?",
            "score": 3,
            "author": "megablast"
        },
        {
            "level": 0,
            "comment": "Boop!\n\n*—Shrinking*",
            "score": 3,
            "author": "DariusMDeV"
        },
        {
            "level": 0,
            "comment": "Modern problems require modern solutions.",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Hilarious NTA",
            "score": 3,
            "author": "yaymonsters"
        },
        {
            "level": 0,
            "comment": "Sorry, I don't know how to post a link.\n\nGo take a look at \"The Magic Clothes Basket.\"",
            "score": 3,
            "author": "mr78rpm"
        },
        {
            "level": 0,
            "comment": "How come the compromise is him doing exactly what you want?",
            "score": 3,
            "author": "First-Mechanic1560",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Bruh read this as unIonized and I’m like huh?",
            "score": 3,
            "author": "MastorAaron"
        },
        {
            "level": 0,
            "comment": "NTA  leave your socks out at your own risk",
            "score": 3,
            "author": "just1here"
        },
        {
            "level": 0,
            "comment": "Have you tried spraying the boyfriend with water or swatting him with a rolled up newspaper and saying \"bad boy\"?",
            "score": 3,
            "author": "V3x1ng_karma"
        },
        {
            "level": 0,
            "comment": "I moved in with my boyfriend and my dog’s affinity for socks and underwear means that if nothing else, the socks and underwear are put in an inaccesible place, which sure beats the socks and undies strewn around the hotel room when we travel without the dog. Natural consequences are a great trainer!",
            "score": 3,
            "author": "Nervous-Necessary849",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Why did OP not specify the ages and genders of the dog?",
            "score": 3,
            "author": "Backupusername"
        },
        {
            "level": 0,
            "comment": "NTA. And well played! I’m not a neat freak at all. The one thing I have always hated is dirty socks laying around. Now, I have dogs and worry about things being eaten. My labs have no interest in destroying anything except their toys but my husky LOVES to destroy everything and anything, if given the opportunity. I tell all guests not to leave anything laying around. I have her trained to not chew on our stuff, but anything new/different seems to be fair game. I figure, if you’re warned and don’t take appropriate action to make sure your stuff isn’t destroyed, that’s your own fault. In your situation, he left his stuff laying around, he pays the consequences. Maybe he’ll learn his lesson.",
            "score": 3,
            "author": "mountain_dog_mom"
        },
        {
            "level": 0,
            "comment": "Next level: train the dogs to put the socks in the hamper",
            "score": 3,
            "author": "DontTakeMyAdviceHere"
        },
        {
            "level": 0,
            "comment": "NTA. Amazing. Thank you for sharing. \n\nAlso, I do not like touching my partners dirty socks. I know what feet smell like",
            "score": 3,
            "author": "awkward-velociraptor"
        },
        {
            "level": 0,
            "comment": "Good dog!\n\nNTA",
            "score": 3,
            "author": "Ozludo"
        },
        {
            "level": 0,
            "comment": "What is it they say? Play stupid games, win stupid prizes.",
            "score": 3,
            "author": "Emotional-Sorbet-759"
        },
        {
            "level": 0,
            "comment": "Stuffs his dirty socks in the couch!? Is he mentally I’ll? I’ve literally never heard of someone doing that",
            "score": 3,
            "author": "Derangedcity"
        },
        {
            "level": 0,
            "comment": "It’s is maddening to have to treat a fully functioning adult this way, but it’s like he literally does not get it.",
            "score": 3,
            "author": "SenatorRobPortman"
        },
        {
            "level": 0,
            "comment": "NAH, mild revenge and he may need new socks , but you didn’t “unionize”. You taught your pups a bad habit that may come back to haunt you, lol!",
            "score": 3,
            "author": "Primary_Bass_9178"
        },
        {
            "level": 0,
            "comment": "NTA\nThe crazy thing is that women stay with guys like this and then are all shocked when it gets worse after marriage and kids. \nThe red flag is there. It’s right there!",
            "score": 3,
            "author": "purplecrayonbandit",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I think your training method is brilliant, but when your BF does pick up his socks, be sure to pat him on the head and say, \"Good Boy\".\n\nIf you could share any other training methods with us, it would be greatly appreciated.",
            "score": 3,
            "author": "Maximum-Swan-1009",
            "replies": []
        },
        {
            "level": 0,
            "comment": "You're literally training the dogs to force your nasty BF to not... shove gross, used socks inside the couch...where you all sit... \n\nYou are NTA, but please for the love of all that is holy, stop playing games with this man as if he is some child.  This is all just absurd.  The man should be able to clean u p his own mess.",
            "score": 3,
            "author": "Magus_Corgo"
        },
        {
            "level": 0,
            "comment": "Absolutely NTA. You were genius about solving the issue. He would not have learned until he had consequences for his actions.",
            "score": 9,
            "author": "Kurokotsu"
        },
        {
            "level": 0,
            "comment": "They are his socks so he is responsible for them.  End of story.",
            "score": 9,
            "author": "Blonde2468"
        },
        {
            "level": 0,
            "comment": "What you say when he bitches you out is \"I'm sorry but your mother doesn't live here. Pick up your own shit.\"",
            "score": 8,
            "author": "Academic-Highway-5"
        },
        {
            "level": 0,
            "comment": "You warned him not to do it.  He shouldn't be surprised at the outcome.  Maybe now he'll put them in the laundry hamper.",
            "score": 4,
            "author": "Deathangel1976"
        },
        {
            "level": 0,
            "comment": "Next time say: May as well give them the other one.",
            "score": 6,
            "author": "TheHobbyWaitress"
        },
        {
            "level": 0,
            "comment": "As a very messy partner who's been gradually getting better over the last 10+ years but will probably never effortlessly meet my partner's (reasonable) cleanliness standards, NTA. Part of the deal of not doing things properly is you don't get to be upset when consequences happen as a result.",
            "score": 6,
            "author": "michelleartbear",
            "replies": []
        }
    ]
}