{
    "id": "13060bu",
    "score": 744,
    "title": "Dogs attacking woman in park",
    "author": "Old_Owl4601",
    "date": 1682559206.0,
    "url": "https://www.reddit.com/r/pettyrevenge/comments/13060bu",
    "media_urls": [],
    "other_urls": [],
    "postText": "So, at my local off lead dog park, we have a little bit of a community there. Same people most nights taking their dogs out for a walk, we all know each other and look forward to seeing one another after work. \n\nOne lady, who we see occasionally is a vile thing. She will intentionally walk towards the dogs and scream ’put your dog on a lead!’ And kick and thrash at the dogs. About 6 months ago, my friend was walking both her elderly dogs through the park alone, she was approached by this vile lady, spat at and racially abused. My friend was shocked and extremely upset by this and had to be consoled. \n\nThis afternoon I was walking through the park with my two dogs. I have the week off work and the weather not great, so not a soul in sight, until halfway through the park vile lady walks toward us.  My lovely terrier wanders up to say hello, and vile lady starts screaming, kicking and thrashing her shopping bag at my dog ‘get away from me’ my dog pauses to evaluate and starts rounding the lady barking (she thinks it’s and game). My other terrier, not wanting to miss out on the fun, runs towards them and joins in with the chasing and barking. I turned my back and walked away, listening to the terrified screams.\n\nFor all the Karen’s and Darren’s commenting below, my dogs were beside me literally seconds after I walked alway. They were not at any point in any danger, nor was the woman they were barking at.",
    "comments": [
        {
            "level": 0,
            "comment": "I’m guessing the vile lady does not have a dog, and is therefore a total idiot for walking into a dog park and telling people to put their dog on a leash.",
            "score": 617,
            "author": "MantisGibbon",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yep. This is correct. She intentionally walks through to instigate trouble",
                    "score": 441,
                    "author": "Old_Owl4601",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I would have pelted her with the dog poop I picked up.",
                            "score": 184,
                            "author": "Zoreb1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ah. Another cool use for those long handled ball throwers....easy to disinfect afterwards.",
                                    "score": 145,
                                    "author": "Knitsanity",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You...are not only clever,but evil. 🤣🤣🤣🤣",
                                            "score": 48,
                                            "author": "Motor-Ad5284",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Is an act evil, if it's in the pursuit of punishment of awful people?",
                                                    "score": 14,
                                                    "author": "Ok-Action-1386",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Im assuming you didn't see the sarcasm.",
                                                            "score": 2,
                                                            "author": "Motor-Ad5284"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Chuckits are great",
                                            "score": 6,
                                            "author": "Momo222811",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Did you mean Chuckshits? FIFY, lol",
                                                    "score": 3,
                                                    "author": "halifaxbc",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "![gif](emote|free_emotes_pack|joy)![gif](emote|free_emotes_pack|facepalm)",
                                                            "score": 1,
                                                            "author": "Momo222811"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Some people just search for a reason to be angry.",
                            "score": 21,
                            "author": "Yak-Fucker-5000"
                        },
                        {
                            "level": 2,
                            "comment": "Is it a law for the park that you must have a dog? Some parks do not allow entry if you’re without a dog because of children and people there to steal a dog. You should see if that’s the case and call the police or record next time it happens. Maybe nothing will be done, but maybe a stern talking to will keep her away",
                            "score": 6,
                            "author": "aehanken"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Did they break their new toy?  My dogs chew right through all their toys to get the squeaker out of them.",
            "score": 181,
            "author": "CoderJoe1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lol. I can’t wait to tell my friend tonight.",
                    "score": 97,
                    "author": "Old_Owl4601",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lol please update us with your friend's response.",
                            "score": 12,
                            "author": "Lala93085"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "😅😅",
                    "score": 7,
                    "author": "Accomplished-Ad3219"
                },
                {
                    "level": 1,
                    "comment": "Mine too.  Jack Russells, all of them.",
                    "score": 6,
                    "author": "AJRimmer1971"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why hasn't the lady been reported for harassment and being a public nuisance?",
            "score": 153,
            "author": "SheWhoLovesToDraw",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hateful assholes like this are the ones to poison dogs..",
                    "score": 35,
                    "author": "machisperer"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don't feel bad for the lady, but man I'd be worried about my dogs in this scenario.",
            "score": 180,
            "author": "aloe_vera918",
            "replies": [
                {
                    "level": 1,
                    "comment": "THIS. Not to mention I don't really want the f around find out assault charges it might lead to if someone hurt my dogs....",
                    "score": 78,
                    "author": "veryundude123",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was considering something that happened to a friend recently: he was out for a jog, a dog started running and playing with him, he was trying to play it cool and continue on his way but the dog's play was getting rougher and rougher. It finally got to the point the dog bit him properly, but was still acting like it was a game. He pulled his bleeding leg away from the dog and kinda squared up, thinking he might have to fight this dog. His reaction made the dog realize the fight was on as well. Luckily a neighbor (not the dog's owner, but familiar with the dog) nearby called the dog off and there were no further injuries. \n\nIt can turn very quickly from a game to not a game, and even in an off leash area you're going to be liable if a person gets injured interacting with your dog, no matter how dumb the person is being. And bitey dogs are often dead dogs when the law gets involved.",
                            "score": 116,
                            "author": "aloe_vera918",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah.  I saw this at our local dog park once.  It started as a game and within seconds one dog was slightly bleeding.",
                                    "score": 6,
                                    "author": "PRMan99"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yep. Keep your dogs away from her,  if they bite her, they might catch something vile.",
                    "score": 24,
                    "author": "bran6442"
                },
                {
                    "level": 1,
                    "comment": "Yeah, who leaves their pets when someone is attacking them?",
                    "score": 28,
                    "author": "Nothanks_nottoday"
                },
                {
                    "level": 1,
                    "comment": "No, my dogs are agile. No worries here.",
                    "score": -34,
                    "author": "Old_Owl4601",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "F all the other dogs right?",
                            "score": 14,
                            "author": "colieolieravioli",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Happy Cake Day",
                                    "score": 1,
                                    "author": "Blossom087"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why would you turn your back and walk away from your dogs though? What if she had pepper spray or something else she could have really hurt your dogs with?",
            "score": 63,
            "author": "Chee-shep",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thankfully there are also no rocks or knives or anything else that might be used as an improvised weapon against a dog. Australia is completely devoid of objects.",
                    "score": 22,
                    "author": "aloe_vera918",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Eh, just hurl a handy snek. Or spider. Or anything really, Aussie wildlife wants to kill you.",
                            "score": 6,
                            "author": "satanic-frijoles"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "In Australia. No pepper spray, no guns.",
                    "score": 15,
                    "author": "Old_Owl4601",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "She still has arms and legs, yes? And that shopping bag? She could have hurt the dogs with those. It was stupid to walk away.",
                            "score": 12,
                            "author": "wkendwench"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What blows my mind when i read posts like this.. dangerous vile people posts.. is that nobody protects themselves by PUSHING RECORD!\nRecord that shit. My god ppl",
            "score": 13,
            "author": "Fluid_Amphibian3860"
        },
        {
            "level": 0,
            "comment": "You turned your back on a potentially violent person, whom you know has a dislike for dogs? The only person who would get in trouble in this situation is you, and your dog. Had your dog hurt said lady, *HE* would have been put down. Hope your \"revenge\" felt worth endangering your pet.",
            "score": 34,
            "author": "PerformanceWeary1328"
        },
        {
            "level": 0,
            "comment": "This sounds like a good way to find yourself at the other end of a lawsuit.  It reads like she intentionally goes to the dog park to instigate trouble and it makes me wonder if she's using a playbook similar to the one the Westboro Baptist Church used a couple decades ago (they'd protest funerals in hopes someone would react violently and then they'd sue for damages).",
            "score": 55,
            "author": "imakesawdust",
            "replies": [
                {
                    "level": 1,
                    "comment": "From my point of view. No witnesses means it never happened.",
                    "score": -23,
                    "author": "Old_Owl4601",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So when she finally lands a hit, your dogs leg just naturally snapped like that?",
                            "score": 28,
                            "author": "Beowulf33232"
                        },
                        {
                            "level": 2,
                            "comment": "Sounds like a worldview of someone who might practice law or crime for a living...",
                            "score": 4,
                            "author": "baleee8"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "A few years back I was with my Bernese at the local dog park/beach. Literally hundreds of dogs running around playing and enjoying themselves. \n\nAs we were walking off the beach to leave, my dog was sniffing around some guy sitting just on the edge of the beach. He had an absolute meltdown, yelling at me to leash my dog. I informed him that if he didn't like dogs, he probably shouldn't have camped his ass on the doggy beach.\n\nSome incoherent yodeling followed, the gist of it being \"This isn't a dog beach you idiot\". I just shrugged, and walked off with doggo. Turned around after a little while, and saw moron was packing up his stuff. I guess his two braincells finally shook hands.",
            "score": 7,
            "author": "cHubbyFker"
        },
        {
            "level": 0,
            "comment": "On one hand i don't think the lady should be coddled and should either be ignored, or should have evidence gathered to go to the police with something.\n\nOn another hand... You said she was swinging her bags at your terrier dogs? If they're terriers they're most like no more than 7 or 10lba and very small ... Aka ankle biters.\n\nIf she kicked one of your dogs or slammed her bags against one that could do some serious damage. You turning away and walking off is... Irresponsible",
            "score": 15,
            "author": "Riyeko"
        },
        {
            "level": 0,
            "comment": "I call bullshit.  No one who loves their dogs would turn their back on a woman kicking at their dogs.  I would literally murder someone who attempted to hurt my dog, with no forethought.  I would go to prison for life if someone attempted to hurt my dog, as they would subsequently die a horrible death. This isn’t petty revenge.  It’s animal neglect.",
            "score": 71,
            "author": "Rinzy2000",
            "replies": [
                {
                    "level": 1,
                    "comment": "The woman should be reported for harassment. Just to be clear. However, off leash dogs whether in a park, on a beach, even a fenced in dog park, or any place that allows them need to be well trained/behaved dogs. Dogs who run up and bark at a person are not that. I see the behavior is being explained that they ‘thought she was playing’. I call BS. People have the right to be in public places without being rushed by a dog. No matter how friendly the dog. Or no matter the size of the dog. If your dog rushes toward people and barks they need to be leashed.",
                    "score": 27,
                    "author": "kford620",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The herding/barking started after the lady lashed out at the dog, and in an off lead dog park it's pretty normal to have a dog calmly wander up to say hello to the people in that park. Buuuuut you're not wrong, I'm very sick of small dogs that get away with murder when a big dog would probably have already been put down for the same actions 😔",
                            "score": 1,
                            "author": "sexy-skeksis"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I have a tale from back in the 70s. We have Fiesta Island, a not-quite island that was all dogs run free kind of place. My borzoi was running on the beach and stopped to investigate a bait bucket some anglers were using. Lady tried to kick my dog.\n\nYou know how in literature it is described as a character seeing red? Yeah, that's real. I saw red, literally, and started for that woman with blood on my mind. My friend grabbed me in a bear hug and held me until sanity returned. I swear to dog I would have killed that woman.",
                    "score": 3,
                    "author": "satanic-frijoles",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I feel you.   My dog is my best friend and my favorite “person”.  I love her more than my own life and she’s been there for me through all of the shitty things and all of the good times.  I literally spend my whole workday thinking about what adventures we’re going to go on when I’m not at work.",
                            "score": 3,
                            "author": "Rinzy2000"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Watch out everyone he will literally murder",
                    "score": 7,
                    "author": "tessellation__"
                },
                {
                    "level": 1,
                    "comment": "It's actually an epidemic. The prisons are simply chock full of heinous murderers who've pulled the trigger on someone who tried to kick their dog. Facts.",
                    "score": 3,
                    "author": "Skurfer0",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Have you not seen the Documentary \"John Wick\"?",
                            "score": 17,
                            "author": "autech91",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "John Wick is my spirit animal.",
                                    "score": 5,
                                    "author": "satanic-frijoles",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "So is Keanu Reaves 😍 \nI love that man.",
                                            "score": 2,
                                            "author": "Beck943"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why is she walking into an off-leash dog park if she wants dogs on leashes? Y'all need to tell her to keep her ass at home!",
            "score": 14,
            "author": "Background_Newt3594"
        },
        {
            "level": 0,
            "comment": "Record her having one of her episodes and report her to the city parks department.",
            "score": 5,
            "author": "Wonkily_Grobbled"
        },
        {
            "level": 0,
            "comment": "I would be really careful with something like that. If they bite her (or she even say the bit her), I would be very worried about my dog getting sent to quarantine or something. Don't give the bitch the satisfaction. I would have said something (probably quite sassy, to put her in her place) and definitely not leave my dog with her.",
            "score": 5,
            "author": "Adi_2000"
        },
        {
            "level": 0,
            "comment": "LOL all the people calling out OP for being an irresponsible dog owner.   Maybe if enough people explain it to her she'll get a clue.",
            "score": 12,
            "author": "mmmmpisghetti"
        },
        {
            "level": 0,
            "comment": "Just FYI, this post makes you sound really dumb and irresponsible. Not sure if that's what you intended.",
            "score": 11,
            "author": "fanaticfun",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh my goodness. You got me! It’s what I intended this whole time. Thanks for pointing it out. I guess the 600 likes missed that memo. You sound so intelligent and articulate. Did it take you a while to put your comment together?",
                    "score": -4,
                    "author": "Old_Owl4601",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Mmm seems like the responses to this post aren’t going the way you thought they would lol",
                            "score": 2,
                            "author": "m_autumnal",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Very aware there will always be a Karen or Darren whenever there is an opportunity.",
                                    "score": 0,
                                    "author": "Old_Owl4601",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Karen is a woman weaponising her white privilege against black people. Not somebody that disagrees with you.\n\nAs the owner of two terriers, I think you're a coward. You should have gone after that woman yourself, not let your poor dogs do it for you. They deserve better.",
                                            "score": 0,
                                            "author": "slimyslag",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 0,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Wow, you seem really insecure. Also, 600 likes just means there are 600 other people as dumb as you. It's not a flex..",
                            "score": 1,
                            "author": "fanaticfun",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You literally sound stupid. You post like a child and I was surprised to see you are in your 60s. Don’t you have some grandchildren to play with or something rather than to troll on here? Find a hobby or something.",
                                    "score": 1,
                                    "author": "Old_Owl4601"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you are at an off leash dog park, you can have your dog off leash, providing that it is not aggressive. (My friend can only go when empty for that reason). This “lady” has no right to say boo about it, and shouldn’t be at the dog park without a dog. She should be reported as being an aggressive bitch in the dog park, and banned.",
            "score": 3,
            "author": "Anxious_Faerie911"
        },
        {
            "level": 0,
            "comment": "So you’re an irresponsible dog owner, cool.",
            "score": 12,
            "author": "dogfishcattleranch"
        },
        {
            "level": 0,
            "comment": "I get that this is petty revenge and all, but I would NEVER risk the safety of y dogs and allow them near an aggressive stranger.",
            "score": 5,
            "author": "AdmiralDumpling"
        },
        {
            "level": 0,
            "comment": "Sounds like this lady is doing this on purpose trying to get attacked to try a Sue or something. Cause damn... How much of a miserable person do you have to be to hate dogs.",
            "score": 4,
            "author": "Jaren_Starain"
        },
        {
            "level": 0,
            "comment": "The way I’d go to jail if someone ever kicked/kicked at my dog(s) 😅😅😅",
            "score": 5,
            "author": "Ill_Lettuce_3026"
        },
        {
            "level": 0,
            "comment": "I love dogs, and would never walk into a dog park, just to tell people to leash their dogs. If two random dogs started getting aggressive with me and the owners are no where to be seen, guess what? I’m shooting your dogs. \n\nNow I know this wasn’t the case with you, but just be mindful of the 2nd amendment. All it takes is 1 ass hole with a gun. Personally, I would never walk away from my dog. In 10 years that I’ve had my husky, the thought to walk away while he barks at someone has never crossed my mind. Regardless if it’s some ass holes fault. My pets safety will come first. If I have to file a police report on this person I will, but I’m not going to walk away while my dogs give her an earful. Mind you, my husky has never bitten anyone, he’s a big baby.",
            "score": 2,
            "author": "Effective_Surprise_7",
            "replies": [
                {
                    "level": 1,
                    "comment": "No offence, you can’t compare a husky barking at someone compared to a small dog. A husky is capable of killing someone and even a dog lover like me would be frightened if a husky barked at me.",
                    "score": 0,
                    "author": "Old_Owl4601"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Shoulda just punched her. No witnesses and all that. That should keep her out the dog park for a while!",
            "score": 2,
            "author": "Baby8227"
        },
        {
            "level": 0,
            "comment": "My instinct is that you made up the part where it’s an off leash park and the woman is being attacked by dogs being illegally off leash.",
            "score": 8,
            "author": "GargantuanGreenGoats",
            "replies": [
                {
                    "level": 1,
                    "comment": "Dog nutters for you. 🙄",
                    "score": -2,
                    "author": "Expensive-Analysis-2"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think that if I knew someone was regularly attacking dogs at a dog park I would take my pepper spray along and the second she kicked at one of my dogs she's catch it right in the face.",
            "score": 3,
            "author": "MOPPETT331"
        },
        {
            "level": 0,
            "comment": "So you basically allowed your dogs to approach and harass someone?  Even if she was in the off leash area your inability or unwillingness to call your dogs to toy and get them away from this person is not the behavior of a responsible owner. \n\nAnd if your \"terriers\" are pitbulls you're an incredibly irresponsible person.  That breed particularly must not be allowed into a situation like this as escalation can lead to disaster.  Do you not value your dogs' lives?",
            "score": 14,
            "author": "mmmmpisghetti",
            "replies": [
                {
                    "level": 1,
                    "comment": "She approached them. It sounds to me like this psycho is trying to get bitten so she can sue someone. Does she even have a dog? Does she even have a reason to go into a dog park, let alone an \"off lead\" one, and then scream at people to put their dogs on a lead?\n\nOP, you need to file harassment charges against her, and so does everyone else that she accosts in the park. Especially the one she attacked with the racial slurs.",
                    "score": 2,
                    "author": "Background_Newt3594"
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": -13,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well that's a relief.  If you had larger dogs your foolishness would be dangerous.",
                            "score": 1,
                            "author": "mmmmpisghetti",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "As they say in Australia, \"Suck shit, mate!\" ;)",
                                    "score": -2,
                                    "author": "Gaposhkin",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "As they say everywhere, \"control your dogs, idiot\" 👍",
                                            "score": 8,
                                            "author": "mmmmpisghetti",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You imagined a hypothetical situation and got your knickers in a twist about it. Control your imagination, idiot.",
                                                    "score": -3,
                                                    "author": "Gaposhkin",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "They intentionally allowed their dogs to harass someone. Maybe that woman instigated the situation but OP was also stupid.  She is responsible for her dogs. Very simple concept you seem to be having trouble with for some mysterious reason...",
                                                            "score": 7,
                                                            "author": "mmmmpisghetti",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "You made a big jump from terrier to pitbull, is what I'm saying. It is a stretch. I've never heard anyone conversationally call a pitbull a terrier.",
                                                                    "score": -1,
                                                                    "author": "Gaposhkin",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "True. They’re all “lab mixes” now.",
                                                                            "score": -2,
                                                                            "author": "Background-March4034"
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I hear people referring to pitbulls as terriers in order to not say what the dog actually is.   It's a thing.",
                                                                            "score": 0,
                                                                            "author": "mmmmpisghetti",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Pit bulls *are* terriers",
                                                                                    "score": 1,
                                                                                    "author": "m_autumnal",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "stop being an idiot.",
                                                                    "score": 1,
                                                                    "author": "3h7r2t1i"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'd start recording her every time you see this nasty woman. Make it clear that she's being filmed. That way you have evidence.",
            "score": 2,
            "author": "Cat1832"
        },
        {
            "level": 0,
            "comment": "Sounds like a walking mental health issue",
            "score": 2,
            "author": "kylejwand09"
        },
        {
            "level": 0,
            "comment": "It would be ashame if she was pepper sprayed by some passerby who definitely isn't someone from the community.\n\nTBTH this is a situation where if there is nobody else around someone might want to make it a point to let this woman know in very blunt terms that her shit will not be tolerated again and nobody is going to go to bat for her if she calls the cops.",
            "score": 1,
            "author": "Tots2Hots"
        },
        {
            "level": 0,
            "comment": "I feel like this needs to be recorded and posted for some public viewing and shaming.",
            "score": 1,
            "author": "Revolutionary-Use136",
            "replies": [
                {
                    "level": 1,
                    "comment": "Spoiler alert:\n OP needs shaming for turning his back while someone attacks his dogs.",
                    "score": 0,
                    "author": "Beck943"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is this an area that is fenced off? Because walking dogs off-leash in an unfenced area is totally dumb. That's how YOUR dog gets attacked, too.",
            "score": 0,
            "author": "BridgetteBane"
        },
        {
            "level": 0,
            "comment": "Wow.",
            "score": 1,
            "author": "Impressive-Pepper785"
        },
        {
            "level": 0,
            "comment": "I honestly feel if she's doing that to all dogs, big and small, she's most likely doing it so she can sue and get money. That's the only somewhat logical explanation I have.",
            "score": 1,
            "author": "MinnieCreations"
        },
        {
            "level": 0,
            "comment": "It looks to me like you just added water to her mill =/ I hope she'll be clever enough to not come again or else you might get some troubles",
            "score": 1,
            "author": "Taliesine_",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have no doubt she will think twice about coming back.",
                    "score": 1,
                    "author": "Old_Owl4601"
                }
            ]
        }
    ]
}