{
    "id": "130eufl",
    "score": 812,
    "title": "Spit on me, I'll puke on you",
    "author": "hairyconary",
    "date": 1682586187.0,
    "url": "https://www.reddit.com/r/pettyrevenge/comments/130eufl",
    "media_urls": [],
    "other_urls": [],
    "postText": "Setting and Context matter, because even though this was an epic moment in my young life, as an adult I feel a bit bad about this. \n\nIn grade 5 I was living in a small pacific island. I was one of only two white kids in the village school, and so the fact that I stood out from the crowd visually combined with my small stature and mouthy nature made me an easy and frequent target of bullying. \n\nOne particular day we were heading out on the school bus to see an oyster hatchery. I was sitting in the row in front of a small Chinese girl (the only one in the school, likely as much a target of bullying, and probably less deserving of it than me). She was being encouraged by the girl next to her to do something to me, when all of a sudden I felt a warm goop on my shoulder.\n\nI looked over and saw a huge jiggling warm wet loogey on my shoulder. The Chinese girl had horked on me. I instantly felt like I was going to puke, and after a moment of listening to the two girls behind me laughing, turned around and vomited on both of them. \n\nNo one from that school ever spat on me again. We arrived a few moments later, and both girls were hosed down, and I was able to wash the loogey off my shirt. \n\nI still feel bit bad, because I'm sure that little girl was as bullied or more so than me, and was probably just trying the whole, \"Ill pick on the little guy to make myself look bigger\" think... Ah well, live and learn, Don't Spit on me.",
    "comments": [
        {
            "level": 0,
            "comment": "How did you that? Can you puke on command?",
            "score": 176,
            "author": "Gapoly",
            "replies": [
                {
                    "level": 1,
                    "comment": "I can puke on command. It's one of the fun benefits from having a gastric bypass.",
                    "score": 149,
                    "author": "CroneMage",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Damn! I've had gastric bypass and I can't puke on command! Nice super power!!",
                            "score": 48,
                            "author": "Potikanda",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I can do that, too. I tell friends who ask that it's not a typical nausea involuntary action. It's very much muscular. Even after 15+ years, I'll sometimes eat something that just sits there and hurts, usually cooked too dry chicken or pork. I'll give it 30 minutes to an hour to move on its own. If it doesn't, I make it vacate the premises.",
                                    "score": 60,
                                    "author": "shan68ok01",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "OHHHH I can do it if my food isn't sitting well... for me it's usually pasta that sits like a rock in my stomach... I hate puking though, so I usually try to just sit with it and make it go through....",
                                            "score": 24,
                                            "author": "Potikanda",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I have found that drinking lots of water if food is stuck like a stone in my stomach helps a lot to get it moving and out of my system.",
                                                    "score": 12,
                                                    "author": "ElectronicAmphibian7",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Weird, I've found drinking a lot of water when something is stuck causes dumping, and that SUCKS.  Good that it works for you though!!",
                                                            "score": 5,
                                                            "author": "Potikanda",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I’m not sure what you mean by dumping.",
                                                                    "score": 6,
                                                                    "author": "ElectronicAmphibian7",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "When you have gastric bypass, one of the things that can happen is called dumping. Basically, the food doesn't get digested properly, goes through your system really fast, and comes out the other end explosively. Dumping syndrome can have symptoms like nausea, diarrhea, feeling light-headed, or extremely tired after a meal.",
                                                                            "score": 9,
                                                                            "author": "Potikanda",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Ahhhh I understand now. That makes sense. That sounds quite uncomfortable and most undesirable!!",
                                                                                    "score": 7,
                                                                                    "author": "ElectronicAmphibian7"
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Commenting because I really wanna know what they mean by dumping",
                                                                            "score": 5,
                                                                            "author": "CrashBannedicoot",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Around here, dumping means an ordinary evacuation.",
                                                                                    "score": 2,
                                                                                    "author": "Anxious_Faerie911"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Same , I’ve been able to contract my stomach muscles to puke on command for years since I was maybe 14 \n\nIf it makes my tummy hurt it’s coming back up",
                                            "score": 10,
                                            "author": "NoPapaya7372",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Wow. My neice can fart on command; she's been able to do it since she was really little.",
                                                    "score": 7,
                                                    "author": "Potikanda",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "People on This sub are super wierd",
                                                            "score": 4,
                                                            "author": "WhereIsHarriet"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "My friend used to be able to fart out of her v****a on command, hilarious....",
                                                            "score": 3,
                                                            "author": "Fandango-5691"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "That's awesome",
                            "score": 6,
                            "author": "Gapoly"
                        },
                        {
                            "level": 2,
                            "comment": "![gif](giphy|dOl2LFw0RbTMc)",
                            "score": 7,
                            "author": "Diligent_String1966"
                        },
                        {
                            "level": 2,
                            "comment": "Me too!  I can do it so quietly no one even can tell.   If it makes my stomach hurt..up it comes 😂  drives my husband nuts",
                            "score": 2,
                            "author": "Outside_Holiday_9997"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I can puke on command. I need like 15 or 20 seconds but yeah it's a weird superpower. Can get you out of stuff too. No one ever accuses you of doing it on purpose because they'd look like a lunatic",
                    "score": 24,
                    "author": "Gryffinwhore83",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Me too.  I use it very rarely.  I discovered how back in about fifth grade, and used it a lot until they started talking about exploratory surgery.",
                            "score": 12,
                            "author": "No_Secret8533"
                        },
                        {
                            "level": 2,
                            "comment": "Same. It was my party trick in college.",
                            "score": 4,
                            "author": "snazzypantz",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Walking up to a group of freshmen and saying “hey watch this” then puking is such a fond memory",
                                    "score": 5,
                                    "author": "Significant_Piglet_4"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "When I imagine the smell of decomposing skunk I can do it.",
                    "score": 8,
                    "author": "gothiclg",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I just have to brush my teeth, then I’m practically guaranteed to at least dry heave a bunch.",
                            "score": 6,
                            "author": "raven_of_azarath",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My dad does that, too. I’m accustomed to hearing that man gagging and immediately thinking “well I know who’s brushing their teeth”",
                                    "score": 5,
                                    "author": "gothiclg",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Lol, I inherited it from my dad I think. It wasn’t bad when I was speed brushing my teeth, but since I switched to a timed electric toothbrush in an attempt to have better dental hygiene, I have to deal with it for a good 5-10 minutes twice a day (once I start, it’s hard to stop until I do throw up).\n\nI also can’t swallow big or too many pills, or take pills in more than one go.",
                                            "score": 6,
                                            "author": "raven_of_azarath"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I wish that was my superpower!",
                    "score": 6,
                    "author": "Haunting-Contact-72"
                },
                {
                    "level": 1,
                    "comment": "If you hork a loogey on me I can. Apparently",
                    "score": 4,
                    "author": "hairyconary"
                },
                {
                    "level": 1,
                    "comment": "I've had times where something is so revolting I could puke, but can either choose to help it along or stop it (this is before it goes up my esophagus to my mouth). It sounds like the loogie did that to OP and he chose to let the puke fly.",
                    "score": 1,
                    "author": "Quaytsar"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So…something like this happened to me as a kid. Got spit on by the kid who always had a runny nose, and puked. Not racially motivated but….I still have a spit phobia to this day because of it.",
            "score": 32,
            "author": "Anxiety_Potato"
        },
        {
            "level": 0,
            "comment": "That sounds rather justified. Spit and mucus in particular is fucking disgusting and someone else’s mucus is a thousand times more gross. I was spit on 1 (one) time and that was all as a bullied kid because I punched her right in the face. \n\nI had been pushed by the relentless bullying and I snapped when that wretched bitch hocked a loogie that landed in my hair. She got a bloody nose and didn’t even go to anyone in authority because she was so embarrassed the fat girl with glasses lit her up. She never messed with me again but others sort of half heartedly did. No one ever dared spit on me again though.",
            "score": 27,
            "author": "DaisyHotCakes"
        },
        {
            "level": 0,
            "comment": "Thats a power move!",
            "score": 38,
            "author": "hetfield151"
        },
        {
            "level": 0,
            "comment": "I had a similar experience. Trapped in the back of a 1970s station wagon, facing the back window to begin with. The girl across from me, the child of the woman driving the car, sneezed and produced more snot than I could believe humanly possible. \n\nShe proceeded to stretch it between her fingers, almost playing with it. It was too much for me. You already put me in a position where my stomach was queasy. I threw up all over the rear section of that station wagon. \n\nMy mom felt awful and offered to pay for the cleaning but  the other girl's mother wouldn't accept it. I think she saw what happened.",
            "score": 8,
            "author": "BirthdaySalt2112"
        },
        {
            "level": 0,
            "comment": "I got nauseous just thinking about having a loogie on my shoulder. Ew. Well played.",
            "score": 7,
            "author": "mrdat"
        },
        {
            "level": 0,
            "comment": "I feel like the Chinese girl thought that they would become her friend if she spits on you but she should have not done it since she knows you are the only other bullied kid. The nerve of the girl next to the Chinese girl to make the bullied girl do it instead of herself. OP you didn't do anything wrong",
            "score": 41,
            "author": "Cherry_Crystals"
        },
        {
            "level": 0,
            "comment": "I love when people say \"in an island\" instead of \"on an island\"",
            "score": 4,
            "author": "ri-mackin"
        },
        {
            "level": 0,
            "comment": "Secret Medical Hack:  If you think you might vomit (puke) drink a glass of grape juice, not grape drink.  It will not stop you from vomiting, but it will make it taste better. ![gif](emote|free_emotes_pack|joy)",
            "score": 3,
            "author": "Ha-Funny-Boy"
        },
        {
            "level": 0,
            "comment": "2 girls 1 cup vibe",
            "score": 2,
            "author": "carrodecesta"
        },
        {
            "level": 0,
            "comment": "Dont feel bad. She learned a lesson about how badly peer pressure can go.",
            "score": 2,
            "author": "mandozombie"
        },
        {
            "level": 0,
            "comment": "The girl next to the Chinese girl deserves it for making the bullied kid do it",
            "score": 4,
            "author": "Cherry_Crystals"
        },
        {
            "level": 0,
            "comment": "Should've saved a little bit for the Loogey Girl",
            "score": 6,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "She vomited on her..",
                    "score": 17,
                    "author": "toddverrone",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It sounded like the mean girl got the spew while the Loogey Girl was spared for being pressured into her actions at least that's how it sounded when I read it",
                            "score": -5,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "\"I vomited on both of them\"",
                                    "score": 11,
                                    "author": "anonisanona",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah I see it now, I was reading it while I had downtime at work and for some reason or another I thought there were two mean girls instead of the one. Rereading it I see where the mix up was.",
                                            "score": -1,
                                            "author": "[deleted]"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "No. You may have been expecting that because OP showed empathy if not sympathy, towards the loogey girl.  But, it's pretty clearly stated in the paragraph that is describing the action, in the last sentence of the paragraph, that the op turns around and vomits on \"both\".",
                                    "score": 5,
                                    "author": "MurphysRazor",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yep I see where I misread it now.",
                                            "score": 2,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "\"Long live the K1ING\" 😉👍",
                                                    "score": 1,
                                                    "author": "MurphysRazor"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Your compassion for the Chinese girl is admirable, especially at that young age. Good for little you.",
            "score": 2,
            "author": "reddit-default"
        },
        {
            "level": 0,
            "comment": "Why were you more deserving of getting bullied? For being white? WTF?",
            "score": 0,
            "author": "PaganFarmhouse",
            "replies": [
                {
                    "level": 1,
                    "comment": "Probably for being mouthy",
                    "score": 14,
                    "author": "Starfire2313",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Exactly. More deserving because unlike the Chinese girl… I run my mouth off and didn’t take crap quietly.",
                            "score": 2,
                            "author": "hairyconary"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "If you're the minority in a given area,  you're probably going to be bullied for it.",
                    "score": 3,
                    "author": "MoriKitsune"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Spit in my face, my love, it won't phase me \nSpit in my face, my love, it won't change me \nSpit in my face, my love, I've gone crazy \nSpit in my face, my love, I've gone mad",
            "score": 0,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Best post title ever",
            "score": 1,
            "author": "dave7965"
        },
        {
            "level": 0,
            "comment": "🧢🧢🧢",
            "score": 1,
            "author": "WhereIsHarriet"
        }
    ]
}