{
    "id": "130ix50",
    "score": 95,
    "title": "I'm tired of your $#!+ So here's some of mine",
    "author": "Gabbz737",
    "date": 1682594983.0,
    "url": "https://www.reddit.com/r/pettyrevenge/comments/130ix50",
    "media_urls": [],
    "other_urls": [],
    "postText": "My Father in law is always going on about being a family, working as a team, blah blah blah...but whenever we need his help he can't do it.\n\nToday I'm on crutches. I need help getting my son to school as I usually walk him up the street. You can literally see his school from our yard. My bf before leaving for work asked his father if he could at least help me load my son into the car. Nope. He gave the old \"i can't move\" speech. That's ok, as he always needs help every day my bf is gonna tell him the same thing.\nHowever I'm pissed so I'm taking it farther.  If you read my posts about FIL he deserves every bit of this. \nSo I happen to be blessed with a very foul digestive tract. I was on the mid floor and was presented with an opportunity. I have to shit and either i can go upstairs, or downstairs. The basement is FIL's living room/man cave. I've decided to go down stairs. There's no ventilation at all and the wooden walls soak up the smell. I once had to use it while he was in the shower and the smell lasted a week even with spraying. This time I'm not even flushing.\nFuck him!\nHere's something to remind you of your shitty personality FIL!\n\n\nUPDATE: I know some of you will say I have no follow through or that I'm chicken. I changed my mind because 2 wrongs don't make a right and I don't need a fight. Well my MIL stopped by(she doesn't live with us) and I was about to go down stairs and clean it up...when she asked what I was getting up to do I explained honestly. She then offered to go take care of it as she had to go down and grab something anyway. Well FIL overheard us...and though it was all cleaned up, the man who \"can't move\" suddenly leaped outta bed running down and up the stairs yelled and shouted at me. I didn't answer him because I didn't want to make things worse. \nNow I feel bad not for myself but the stress this is all causing my bf... he's already called to yell at my bf while he's at work.... poor guy's got enough on his plate right now. This is exactly what I was trying to avoid when I changed my mind...so much for that. Now part of me feels like I should've left it as it was if I  as gonna was gonna get the same outcome. But I know I had to be the bigger person...damn...what a shitty situation...\n\n----Don't read past here if you don't like gross-------\n\nOh it was glorious! \nFull on diarrhea! Sprayed the whole bowl! \nI closed that door where it will ferment until he wakes up for the day and goes down stairs!\nHe likes to sleep in btw....lol",
    "comments": [
        {
            "level": 0,
            "comment": "I pity the child that has to live with all this tension in his life.",
            "score": 35,
            "author": "mskmoc2"
        },
        {
            "level": 0,
            "comment": "Sounds like you need to stop doing anything for your FIL. Talk with your husband and tell him you’re sick of his abuse of you both in your own home when your helping him out. Tell him you think it’s time you both need to stop enabling FIL and he needs to tell him neither of you are his servant and will ot help anymore. That they only person at fault is him for treating you both so badly.\n\nSave save all that you can’t to move out If it’s your home then set a date you will allow him to stay there till that should let him find somewhere else, he will, be out by that date regardless.\n\nI kept going back to caring for my disabled parents as I thought I couldn’t live with the guilt. They never cared I was becoming more disabled and caring for them was taking away what I could do for my own family. When they crossed a line and I left to my surprise I didn’t feel guilty at all, they brought this on themselves and  they refused outside carers, their choice not mine.   \nWhat I actually did feel when I walked away is realising I should have walked years before and not doing that only allowed them to cause years more damage to me. Family does not mean being treated like crap and having no choice. He’s an adult and makes his own bed to lie in and face the consequences.",
            "score": 29,
            "author": "Sweet-Interview5620",
            "replies": [
                {
                    "level": 1,
                    "comment": "Problem is we can't kick him out and we can't afford to move. When we moved here i was pregnant with my son, working full time, paying $800 while my bf scrambled to find a job with a livable wage. (He used to do side gigs and lived with his Dad but soon as surprise baby he stepped up) I paid the deposit and FIL pays $400 a month. Once my bf got into a FT job he paid his portion. When i went on maternity leave he has paid my portion. We can't afford daycare and with my son's autism i need to stay home with him . So 3 yrs later bf is paying my share until our son goes to school FT. Then I'll be able to get a job while he's at school.",
                    "score": 5,
                    "author": "Gabbz737",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I know someone that got their child into an early education autism program, and also due to cost of many of the adaptations needed for the child, got the child on disability.",
                            "score": 6,
                            "author": "OhNoNotAgain1532",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I just read other comments you made, in regards to the early education, it included a bus that came and got the child from home and dropped off at the end of the day; since your child can't do the walk on his own, would possibly qualify.",
                                    "score": 4,
                                    "author": "OhNoNotAgain1532",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "He does qualify but we opted for no bus because we are so close and i usually walk him. \nWe didn't anticipate me getting badly injured.",
                                            "score": 3,
                                            "author": "Gabbz737"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I don’t know where you live but in the uk there are lots of help and supplements for children with autism. There are grants, disability to help with the higher costs of having to take care of children who have it. There are also clubs and activities aimed for children on the spectrum and paid for by the government to help them learn to socialise and give the parents a break. As well as I think it’s called family fund which you apply to yearly and they pay for a family holiday accommodation and some towards other cost of it, at least once a year. Citizens advise as well as social services can tell you what’s available and sign you up for these things.",
                            "score": 1,
                            "author": "Sweet-Interview5620",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm in the US. Unfortunately any government help is more complicated than just applying. Anyone here will tell you unless you're physically missing a limb you'll be denied disability 3 times before being accepted. Sometimes even then they still give ya the run around. Then even with disability... anything to help Autistic kids you have to go on these mile long waiting lists. Often by the time your name is called your child has aged out of the program.",
                                    "score": 1,
                                    "author": "Gabbz737",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It’s the same in the uk but your keep appealing the judgement. Yes it’s frustrating and can be upsetting but it gets you help you’re entitled to. I’ve had to do just this for myself (disabled) and then my anxiety controlled ND and ADHD son. Yes it does takes years to be diagnosed if they aren’t already but the other help and grants are nothing like that wait, In the UK anyway. It comes down to if the parent contacts all the right people and pushes they will get it rather then the ones who just say it’s too hard and don’t even try. My son has just been assessed for adhd and Asperger’s but we still applied for and we’re awarded benefits long before he’s been diagnosed. We let them know we were awaiting diagnosis but that every medical professional/psychologist and psychiatrist as well as CAMHS nurses all say he is and have treated him as such right from the start years before. Providing their letters from each visit proved it all to them. So it is possible, took us 6 months from applying to him being awarded disability. Even when they become adults you are sent new forms and dealt with faster as its not your fault age meant you have to go on a different system. They try to ensure the drop in money is temporary until they new people evaluate your child. My youngest is now 17 and got it first time. \n\nThe whole system is messed up but you wont get help you need unless you try.   \nSomething I’ve not done but a friend did was contact social services/cps about what’s available to help kids on the spectrum. They provided her different free activity clubs held weekly to give the parent a rest and help your child interact with others. They also are sent out forms every year to apply for a holiday grant. It basically pays for the accommodation for the whole family for a week or you can go on a shorter stay and let it also pay other holiday expenses. Don’t get me wrong it is not lavish holidays just basic but it helps.",
                                            "score": 1,
                                            "author": "Sweet-Interview5620"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wtf\n\nI had a catthat shot in a flatmates jeans... iz that the same thing?",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Time to send FIL packing. He is a lazy bum.",
            "score": 2,
            "author": "RJack151"
        },
        {
            "level": 0,
            "comment": "I'm guessing you live with your FIL for some reason?",
            "score": 3,
            "author": "CoderJoe1",
            "replies": [
                {
                    "level": 1,
                    "comment": "He lives with us.",
                    "score": 4,
                    "author": "Gabbz737"
                },
                {
                    "level": 1,
                    "comment": "He lives with us",
                    "score": 3,
                    "author": "Gabbz737"
                },
                {
                    "level": 1,
                    "comment": "Why guess when her post history explains that father-in-law lives with them?",
                    "score": 1,
                    "author": "RosaDiazJudy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Can you do any kind of WFH? Or monetize a hobby?",
            "score": 1,
            "author": "Catsscratchpost",
            "replies": [
                {
                    "level": 1,
                    "comment": "I've tried. Unfortunately all my attempts have failed. Start a shop?\nNo room to keep merch and no way to keep it safe from son or FIL\nSell old junk on craigslist/marketplace?\nI literally wasted more time and money in gas trying to meet ppl who didn't show or so shit.\nTried to do web design because I can do some programming and it's what i went to school for. \n1st client was politicians that sleezed their way out of paying. Then I also didn't have the money to host my own site and who wants to hire a webdesigner without their own website. \nTried doing online narration while son is at school...FIL just blasts his music.\n\nI can't even sell weed in this neighborhood because the junkies across the street always got the police and drug dogs coming over and i don't need them sniffing their way to this house.",
                    "score": 2,
                    "author": "Gabbz737",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Also, consider doing something with programming where you get paid half upfront...and tutoring",
                            "score": 2,
                            "author": "Catsscratchpost",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "After the politicians i made a thorough contract that states half up front, other half on completion BEFORE the site goes live. I also wrote in steep penalties of compounding interest for not paying on time. My mom said the penalties are a little outrageous and no one would agree to that contract. However the whole point is if you pay your bill, there won't be penalties to worry about.",
                                    "score": 1,
                                    "author": "Gabbz737"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "What do you like to do for fun and still have time for?",
                            "score": 1,
                            "author": "Catsscratchpost",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Time....i only get 2 hrs to myself a day while my son is at school. Unfortunately that to hours is usually spent on house work or doing shit for FIL.",
                                    "score": 2,
                                    "author": "Gabbz737",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "STOP DOING SHIT FOR FIL! Just stop.",
                                            "score": 1,
                                            "author": "Anxious_Faerie911",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I don't want to help him with anything anymore. Unfortunately if I don't he just harasses me and makes my life more miserable. Or he'll pull some shit to make me look bad in front of my bf. He's manipulative as fuck.",
                                                    "score": 1,
                                                    "author": "Gabbz737"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Two wrongs don’t make a right?? Umm. We’re not in the 1800s any more.",
            "score": 1,
            "author": "ShannaraAK"
        },
        {
            "level": 0,
            "comment": "your kid cant cross the street alone for 1 day?",
            "score": -2,
            "author": "LifeguardSecret6760",
            "replies": [
                {
                    "level": 1,
                    "comment": "He's an autistic 3yr old.",
                    "score": 6,
                    "author": "Gabbz737",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh, i guess not :) i was imagining an older kid when you mentioned school",
                            "score": 4,
                            "author": "LifeguardSecret6760",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, he's in a special program. He's going to school early so that he can be caught up by the time he's of \"normal age\" to start school. \nIt's done so much for him. He was completely non-verbal but now since Christmas he's talking!\nStill working on potty training. He's on the largest size pull ups so i told him if he doesn't learn soon I'll have to put him in depends lol\nHe has made progress. Pooed and peed a few times in the potty. Unfortunately by the time he tells me he has to go, 75% chance he already went. An hour after eating i sit him on the potty and he'll try but won't go. Soon as I get him off, he poops.(facepalm) motherhood right?",
                                    "score": 5,
                                    "author": "Gabbz737"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}