{
    "id": "132zxii",
    "score": 446,
    "title": "Beep Beep Beep",
    "author": "xboxgamer2122",
    "date": 1682785062.0,
    "url": "https://www.reddit.com/r/pettyrevenge/comments/132zxii",
    "media_urls": [],
    "other_urls": [
        "https://www.reddit.com/r/pettyrevenge/comments/130uumm/that\\_effing\\_rodent/](https://www.reddit.com/r/pettyrevenge/comments/130uumm/that_effing_rodent/)"
    ],
    "postText": "I work at a Lowes, and posted a couple days ago about a petty revenge that was done by someone else. [https://www.reddit.com/r/pettyrevenge/comments/130uumm/that\\_effing\\_rodent/](https://www.reddit.com/r/pettyrevenge/comments/130uumm/that_effing_rodent/) \n\nThis time I am the revenger. A side note; the assistant manager and I went to high school together, and would occasionally hang out together.\n\nIt was about five minutes before closing time and I was seated at a desk in the very back of the store, helping a customer order a washing machine. An old guy, (a total asshole) riding in the electric scooter provided at the store entrance, drove up to the desk and yelled out, \"Hey! I need some help!\" I told him I was with a customer and would help him as soon as I was done. \"I can't wait! The store's gonna close!\" Again, I politely said I'd be with him as soon as possible. He then drove his scooter right up behind the chair I was sitting in, and put it in reverse. This began a loud BEEP...BEEP...BEEP noise. The customer and I could not talk because of the volume. I turned around and asked him to please turn it off, but he yelled, \"When you help me I will!\"\n\nMy petty revenge:\n\nI stood up, told the customer to follow me to the service desk at the front of the store, walked behind the scooter (the asshole did not turn around), and hit the emergency shut off switch underneath the back of the scooter with my toe. The beeping stopped immediately, and as we were walking away the asshole realized he could not drive anywhere. He started yelling, but the now-grinning customer and I walked to the front and finished the order. All the outside doors were now locked, since it was after closing, and I had the manager on duty let the customer out. I told him what had happened, and that the asshole was stuck in the back of the store.\n\nI clocked out and left, but I was told two days later that the manager finished all his closing activities, including dimming the lights, before he walked back, because I had informed him there was a customer still in the store. By telling him, I was following store procedures and could not be blamed for anything. After examining the scooter, he told the asshole that the battery had died, and he would have to go up front and get another scooter. for him The asshole made some noises that I had sabotaged the scooter because of the beeping, but the manager apologized to him, suggesting that using the back up warning excessively could run down the battery very quickly, and the scooter probably didn't have a full charge when he started using it, since it was the end of the day.\n\nManager's petty revenge:\n\nEven after all that, the asshole demanded to make his purchase, but was told that the registers had all been reconciled and closed until the next morning.",
    "comments": [
        {
            "level": 0,
            "comment": "Wow. And I used to think my late grandfather was an asshole on those mobility scooters.\n\nHe would ram into peoples' carts without warning. Even scolded a lady whose baby started crying when he rammed into her cart.\n\nTo this day, I do not understand why the employees never stopped or banned him. I'm just glad that I rarely ever had to go shopping with him.\n\nIt. Was. *So. Embarrassing.*",
            "score": 51,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lol my mom finally got to the stage where she really needs to use one. Our shopping trips are now her apologizing profusely, hogging up the aisles because she can’t back up and knocking everything down while I’m laughing my ass off behind her while picking everything up. I should probably stop getting her good and sauced before we go, but where’s the fun in that?!?! 🤣",
                    "score": 42,
                    "author": "AnastasiaDelicious"
                },
                {
                    "level": 1,
                    "comment": "My grandpa was also an asshole on a mobility scooter. I invited him to Grandparents' day at my school (I was a teacher). He drove in on his little jazzy scooter and bellowed, \"where's all the white people at?\"",
                    "score": 12,
                    "author": "violetsprouts"
                },
                {
                    "level": 1,
                    "comment": "I normally would feel the same way you do, but since my dad started having mobility issues, and got himself a scooter, I started to see a WHOLE different side of the story.\n\nI don't know about all scooters, but his in particular is designed so it can't start or stop on a dime.  Maybe this has something to do with preventing injuries for the invalid who could get whiplash from a scooter jerking forwards, I don't know.\n\nThe problem comes when someone walking will decide to jump in front of the scooter, trying to get around him or cross his path.  This happens all. the. time.  He is constantly getting frustrated by the idiots cutting him off, knowing that it's a lot harder to maneuver around in a scooter.\n\nWas your grandfather a jerk?  Maybe, but seeing what I've seen about how rude other people are around scooters, he was probably justified.  At least some of the time.",
                    "score": 0,
                    "author": "Spidermack",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My sympathies to your father. But that doesn't give you the right to project his issues onto my comment.\n\nMy grandfather was a bonafide jerk. Keep your assumptions to yourself, you can't spell assumptions without ass.",
                            "score": 2,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Well, I use a scooter and am courteous. We've been on the other side of the counter for sales and service. My wife and I would never think of arriving at closing time. My wife worked in a smalll town grocery store's deli/bakery when our children were young. There was a couple who had all week to shop during daytime but would arrive 15 minutes before 7 pm closing on Friday. They took their time shopping and their last stop was the deli. My wife wasn't allowed to tear down the meat slicer and clean it, which was time consuming because of sterilizing it, until the store was empty. She wanted to get home to be with us. So she harped at owners long enough about the situation that they announced that Deli meat section would close on Fridays an hour before the rest of the store. The couple stopped shopping at this store and drove to a neighboring town's store on Friday nights. That store implemented a similar deli policy after awhile. The end of the tale is that this couple started shopping again at my wife's store during the afternoons.",
            "score": 118,
            "author": "Im_Posi_that_Im_Neg",
            "replies": [
                {
                    "level": 1,
                    "comment": "yeah breaking down and sterilizing the slicer is a chore. People have no clue. But should listen when a deli worker explains the issue.",
                    "score": 35,
                    "author": "GrumpySnarf"
                },
                {
                    "level": 1,
                    "comment": "The issue wasn't that he arrived near closing time but the fact he was demanding and acting like an AH. You see the sales person with someone else, they aren't going to just leave them to help someone else. I'm sure if he waited patiently he would have gotten the help. What an ass, glad he didn't get any help.",
                    "score": 2,
                    "author": "Live_Power_2843"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The customer is NOT always right.  Well played",
            "score": 21,
            "author": "Fast_Fee517",
            "replies": [
                {
                    "level": 1,
                    "comment": "They’re only right as long as they are within earshot.",
                    "score": 1,
                    "author": "xboxgamer2122"
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"hit the emergency shut off switch underneath the back of the scooter with my toe\" OMG I'm in love.",
            "score": 15,
            "author": "GrumpySnarf"
        },
        {
            "level": 0,
            "comment": "Team work makes the dream work!",
            "score": 44,
            "author": "Capelily"
        },
        {
            "level": 0,
            "comment": "He didn't beeping believe it.   Unfortunately, not all old people are sweet and adorable.",
            "score": 12,
            "author": "CoderJoe1",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is a fact! I’m old and a complete dick. The shoe fits baby!",
                    "score": 5,
                    "author": "Weekly_Talk3907"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hooray that the manager supported you in this!",
            "score": 7,
            "author": "Bkseneca"
        },
        {
            "level": 0,
            "comment": "Play stupid game's &amp; win stupid prize's !",
            "score": 7,
            "author": "Kyfho1859"
        },
        {
            "level": 0,
            "comment": "Well played, Mr. Spock!  Vulcan nerve pinch that scooter.",
            "score": 4,
            "author": "HouseNumb3rs"
        },
        {
            "level": 0,
            "comment": "You and your manager are the heroes this world needs!\n\n Those cranky old farts need to be knocked down a peg or two (or 10). This coming from an old(ish) person.",
            "score": 5,
            "author": "More-Jacket-9034"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": -9,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "1. It's on a store-by-store basis. \n\n2. Not at the Lowe's closest to my house. Again, likely store-by-store. \n\nYour experiences may not be universal.",
                    "score": 1,
                    "author": "fractal_frog"
                }
            ]
        }
    ]
}