{
    "id": "1358n2e",
    "score": 4045,
    "title": "Revenge on Creepy Cousin",
    "author": "SparkleSaurusBeth",
    "date": 1682994120.0,
    "url": "https://www.reddit.com/r/pettyrevenge/comments/1358n2e",
    "media_urls": [],
    "other_urls": [],
    "postText": "My whole extended family went on vacation when I was in middle school and stayed in one big house. When we were about to go swimming and I was changing, my younger cousin kept coming up to the keyhole and peeking in. I was a 12 year old girl and he was a 10 year old boy and I was really upset. I’d yell at him and he’d run away, but then sneak back. \n\nI realized the door opened OUT towards where he was coming from, so after I was all ready, I watched for him to come back and slammed the door into his head right as he was bending down to peek again. \nHe screamed and of course his mom came running and I was like “??? I opened the door because I was done….why would I have thought to see if he was there?” and totally played dumb. It’s not like he could say anything to defend himself because then he’d be in trouble. \n\nI didn’t get in trouble and he left me alone after that. He was always was bigger and stronger and this time I felt like I “won” for the first time.",
    "comments": [
        {
            "level": 0,
            "comment": "So what's it like with him now?",
            "score": 614,
            "author": "Kitty_Katty_Kit",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not a creep, but I also haven’t spoken to him in probably 7 years. We aren’t friends.",
                    "score": 821,
                    "author": "SparkleSaurusBeth",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I just realised that you stopped him from becoming a creep. If you never did that, i am afraid of what he would have become. It is crazy that he kept peeking through the keyhole and didnt stop after you yelled at him",
                            "score": 397,
                            "author": "Cherry_Crystals",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I doubt he stopped being a creep. He just stopped creeping on her.",
                                    "score": 382,
                                    "author": "danooli",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Are we really about to judge someone permanently and unforgivably for the rest of their lives because of something they did when they were 10 and didn’t fully understand the implications of? \n\nDon’t get me wrong he deserved to learn the lesson the hard way here, but holy toledo he was 10.",
                                            "score": 279,
                                            "author": "fermenter85",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt;Are we really about to judge someone permanently and unforgivably for the rest of their lives\n\nExcuse me this is Reddit, judging people is our *job*, we have several huge subreddits dedicated to determining if the poster is an asshole, entitled, and/or funny!\n\n*Judging intensifies*",
                                                    "score": 298,
                                                    "author": "I_Arman",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It's also our job to armchair diagnose like hell.\n\nI'm gonna say this kid is obviously bipolar and depressed. I know everything, I read a psych article once.",
                                                            "score": 118,
                                                            "author": "HarryPottersElbows",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Good job reddit, we caught the Boston Bomber!",
                                                                    "score": 49,
                                                                    "author": "Hanako_lkezawa"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I'm pretty sure he is a narcissist as well",
                                                                    "score": 28,
                                                                    "author": "jakmcbane77",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "And was definitely gas lighting her",
                                                                            "score": 22,
                                                                            "author": "Aynotwoo",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "That's horrible! We should make lighting farts illegal.",
                                                                                    "score": 11,
                                                                                    "author": "Pro_Scrub"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I once saw a copy of Psychology Today at the store and almost picked it up. I feel your diagnosis is right on target.",
                                                                    "score": 11,
                                                                    "author": "chrisinokc"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "You reading a single article on something doesn’t not make you an expert, unless the author has at least 2 published articles in vice.",
                                                                    "score": 3,
                                                                    "author": "incarnate_devil"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Hah! Well, I stayed at a Holiday Inn Express!",
                                                                    "score": 6,
                                                                    "author": "FoolishStone"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "WE HAVE QUOTAS TO MEET!",
                                                            "score": 9,
                                                            "author": "VeeingFly"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "wait, we have an entitled sub too?",
                                                            "score": 5,
                                                            "author": "johnny_evil"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I've found reddit in my short time here to be one hell of a hot bed for the Dunning-Kruger effect.",
                                                            "score": 2,
                                                            "author": "autech91"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "![gif](giphy|8Fxc34soRtprauvNT9|downsized)",
                                                            "score": 1,
                                                            "author": "SnorkinOrkin"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 27,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I agree with your comment here but also let’s not blame the parent because who knows if this had ever happened before and OP didn’t tell the parent what was happening. \n\nKids do bad stuff. They learn over time not to. We can all enjoy a story where a 10 year old got a bonk to the noggin from natural consequences and move on without decrying the complete and permanent character of anyone in the story.",
                                                            "score": 18,
                                                            "author": "fermenter85"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Given that the judgement is of absolutely no relevance whatsoever, I’m cool with that. This is just an anonymous figure in a story, and our opinions won’t have the slightest impact on his life.",
                                                    "score": 4,
                                                    "author": "Optical_inversion",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "it may not cause some specific harm on some specific person, but it kind of does still normalize that harmful attitude. it’s good to call this out imo",
                                                            "score": 5,
                                                            "author": "blastfromtheblue"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Sure, but if you’re about to treat other 10 year olds in real life like this that’s a little concerning.",
                                                            "score": 10,
                                                            "author": "fermenter85"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": -12,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It's just not that simple. There is an overwhelming resistance to acknowledging sexual urges in children. Even writing that sentence feels wrong, but the simple fact is kids need to understand the sexual urges they experience before they have them, and very few are properly taught about that stuff. Most kids begin going through puberty between the ages of 8 to 14. Those same kids typically won't learn any sex education until high school. For kids that \"blossomed\" before then, that means several years of hormones and urges that nobody is teaching them about. You can't expect a child going through puberty to handle it with grace and control when nobody is helping them navigate. Yes. The 10-year-old was being a creep. He might even know it's wrong, but no 10-year-old should be expected to fully understand the ramifications of their actions. They should be disciplined and educated accordingly.",
                                                            "score": 23,
                                                            "author": "LordOfTheGerenuk"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Uh, actually it’s not, and also read what I said.\n\n&gt;he deserved to learn the lesson the hard way here\n\nDo you really believe that kids aren’t *taught* what good behavior is? Because teaching involves failing and being corrected. \n\nTen year olds know right from wrong, but they don’t necessarily understand the *why* yet. The differences in how wrong something is are nuances that we don’t understand until we’re older, with context and time. 10 year olds haven’t had much of either yet. \n\nWriting my comment off as “boys will be boys” fundamentally misunderstands the point of my comment: he likely didn’t know how serious of an issue this was, and hopefully learned it was serious to OP when she gave him some real consequences. \n\nBut let’s not judge somebody for the rest of their life for one mistake they made when they were 10. You didn’t do anything wrong when you were 10? I’m sure you did. What if somebody was holding that over your head as an adult 20 years later. YOU WERE 10.",
                                                            "score": 14,
                                                            "author": "fermenter85",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "but  at ten, would not yet have wet dreams and likely not, for another 2\\~3 [years. So](https://years.So) any 'peeking' would be of the 'I wonder what 'it' looks like' category.",
                                                                    "score": -5,
                                                                    "author": "almost_eighty",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "What?\n\nThe peeking could also just be “I’m 10 and I don’t know what’s going on in that room so I’m going to look. She told me to stop! HAHA! I will be a brat and keep doing it!”",
                                                                            "score": 6,
                                                                            "author": "fermenter85"
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "\\[The underlining 'helped itself in'.\\]",
                                                                            "score": 2,
                                                                            "author": "almost_eighty"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "That’s not even remotely what they said. In fact they said the opposite, that he deserved to learn the hard way at that time. What they said is we shouldn’t assume he’s still a creep as an adult because it makes no sense to judge someone for the rest of their lives because of something they did when they were 10.",
                                                            "score": 6,
                                                            "author": "ThiefCitron"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "What part of \"he deserved to learn the lesson here\" did you have trouble understanding",
                                                            "score": 4,
                                                            "author": "Goose_Is_Awesome"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Good concern, bad take.",
                                                            "score": 5,
                                                            "author": "jerryboomerwang"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "&gt;Are we really about to judge someone permanently and unforgivably for the rest of their lives because of something they did when they were 10 and didn’t fully understand the implications of?\n\nWhat if I'm secretly a cat? Cats are SUPPOSED to permanently judge others.",
                                                    "score": 1,
                                                    "author": "Deiser",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I don’t consent to participate in your kinkplay.",
                                                            "score": 4,
                                                            "author": "fermenter85",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Wat",
                                                                    "score": 2,
                                                                    "author": "Deiser",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I said:\n\nI DON’T CONSENT TO PARTICIPATE IN YOUR KINKPLAY.",
                                                                            "score": 2,
                                                                            "author": "fermenter85",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "What kinkplay? I was joking about being a cat in the “on the internet, no one knows you’re a cat/dog etc”. Get your mind out of the gutter.",
                                                                                    "score": 2,
                                                                                    "author": "Deiser",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Do people not remember being 10? 10 year olds aren’t toddlers, they know better. That kid was definitely being a creep and he knew it. High chance he moves on to continue being a creep.",
                                                    "score": -20,
                                                    "author": "auzrealop",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "No, I don’t think you do remember being 10.",
                                                            "score": 16,
                                                            "author": "fermenter85",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Uhhh… ten year olds definitely know not to be peeping toms, creeps like those ended up being creeps in high school.\n\nYes, I wasn’t a creep when I was 10 and didn’t try to peep on girls. I remember that much at least.\nCurious what you were like when you were 10 considering you are trying to normalize this behavior?",
                                                                    "score": -15,
                                                                    "author": "auzrealop",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "They likely know it’s wrong, but they don’t really know the full circumstances of why or how it’s a different kind of wrong. Either way, it’s not something that should go on their permanent record… they’re TEN.",
                                                                            "score": 7,
                                                                            "author": "fermenter85",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Exactly right. They may know they shouldn't be doing it, but the nuances of *why*, how personally invasive it is, the emotional harm it can do someone, and just plain having the maturity and presence of mind to *stop* themselves when the idea comes into their head, that all takes some growing up.\n\nKids do dumb shit.\n\nKids do dumb shit even when they *know* it's dumb shit, because kids also have poor impulse control.\n\nThis kid may or may not have turned into an adult creep. It's entirely possible he did. No one is denying that.\n\nBut yes, I'm with you, it shouldn't be the default assumption. He was *10*. That kid has had plenty of time to grow and learn. Assuming that some wrong thing a kid des at *10* is something they'll continue to do for the rest of their lives is pants-on-head stupid.",
                                                                                    "score": 7,
                                                                                    "author": "blackphiIibuster",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "My son is about to be 10 in September. He is in the 3rd grade! Yeah I don't think a 3rd grader has any concept of being a creep. Does he know right from wrong? Absolutely, and would certainly be punished in this situation. But I wouldn't damn him With a scarlet letter or anything because of something he did at this age.",
                                                            "score": 4,
                                                            "author": "Aynotwoo"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "The commenter above you could be right. We can't truly say one way or the other whether he learned his lesson for good or not, so I'm not saying he doesn't deserve some measure of grace. \n\nBut considering the inclination to commit such an act was already in him, I wouldn't assume he'd be rid of it altogether after just having his head bonked once. That's not exactly therapeutic.\n\nI would think he'd still be tempted to engage in creepy activities, and would be one to watch out for as he grows older.",
                                                    "score": -2,
                                                    "author": "SgtFully",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "TEN",
                                                            "score": 1,
                                                            "author": "fermenter85",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "You try to reinforce his age as if he may as well have been a toddler.  He was closer to being a hormone-riddled teenager, and may have already been feeling the initial stirrings of puberty if he was compelled to peep on his cousin like that. \n\nHe was certainly old enough to have a sense of right and wrong, let's not gloss over that. You don't have to agree, and I'm certain you won't, but I stand by what I said. There is no way to tell if this incident had done anything to cure him of his desire to spy on naked girls. And no real way to determine if he's still like that now considering OP herself doesn't know. \n\nBut an indicator was clearly there, so... it's fine to say that it's a red flag that shouldn't be ignored and most certainly cannot be ruled out even as he got older. Remember, he didn't confess to his mom about what he was doing, so it's not like anyone actually pulled him aside to tell him why his actions were messed up. He may not have learned a lesson at all.",
                                                                    "score": -1,
                                                                    "author": "SgtFully",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "“closer to being a hormone-riddled teenager”\n\nSure, a ten year old is halfway between a 7 year old and a 13 year old. They can build maybe half of all Lego sets without parental help and they’re also learning recorder in music class. \n\nBut definitely of the age where they can clearly be labeled a creep for the rest of their lives according to you, I guess? Your take is so wildly detached from the reality of what kids are actually like it seems impossible given that you were once one yourself.\n\nI hope you don’t have any children in your life for their sake. And I’m glad that the well adjusted adults in your life didn’t treat child-you like that, because the reality is you probably did all kinds of shit you don’t remember that adult-you would be keeping some kind of FBI case file on.",
                                                                            "score": 4,
                                                                            "author": "fermenter85",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "For the record, a 7 year old is still not a toddler, so that was an unnecessary thing to mention. \n\nBut also, nowhere did I say that this guy deserves to be labeled a creep for the rest of his life. Even the person you initially responded to didn't say that. I don't think that, and I doubt they do either.  You pulled that straight out of your own asshole and it's pretty astonishing that you jump to such extremes with no room for nuance. There's just no need. \n\nWhat I'm saying is that we can't just assume the kid grew out of those inclinations he displayed. He might not have, and that's a valid thing to say is possible, because it is. \n\nSuppose OP had actually gone to the boy's mother later on to tell him what he had been doing? Do you think his mother should've waved it off saying \"oh, I'm sure he'll grow out of it?\" Or do you think it would've been more appropriate for her to talk to him about his actions? \n\nBut we don't know what happened with this kid, so we can't just say for 100% certain he's super well-adjusted and has never done anything to make a woman uncomfortable since. I only said the above commenter \"could be\" right. I was just pointing out that it was absolutely a possibility. That's all. \n\nIt's fine for you to point out the opposite. Maybe he is fine these days. I certainly hope so. \n\nAnd hey. I'm not sure why you felt comfortable implying that I'm not a safe person for children to be around, but please take it easy. I'm not mad at you, I'm not your enemy, and I don't think you're stupid.  \n\nYou just jumped down that other commenter's throat with such an extreme response that I felt it was worth pointing out that they weren't automatically wrong for what they said. No one is saying you're wrong either. But you did turn it into an all-or-nothing type of scenario and it's fair to say that it's not so cut and dry.",
                                                                                    "score": 0,
                                                                                    "author": "SgtFully",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Yes.",
                                                    "score": 0,
                                                    "author": "igankcheetos"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I really hope that isn't the case",
                                            "score": 5,
                                            "author": "Cherry_Crystals",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Me too.",
                                                    "score": 3,
                                                    "author": "danooli"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "It probably is.",
                                                    "score": 3,
                                                    "author": "SLOPPEEHH"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "A Clairvoyant!\n\nxD",
                                    "score": 3,
                                    "author": "hansdampf33"
                                },
                                {
                                    "level": 3,
                                    "comment": "I hope for this conclusion. Allowing creepy behavior to go unchecked can turn really bad over time. Hopefully he second guesses these kinds of instincts and remembers the time he had a door slammed into his face and the helplessness that followed because he knows what he was doing was wrong and the physical pain that came with it.",
                                    "score": 3,
                                    "author": "bryanthebryan"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Just remember that you can simply hang a towel on the doorknob to block the keyhole.",
                            "score": 1,
                            "author": "Sciencegirl117"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Good job teaching him not to grow up to be a cretin.",
            "score": 707,
            "author": "RudeAndSarcastic",
            "replies": [
                {
                    "level": 1,
                    "comment": "If only one lesson was all it took. Unfortunately, he was just as likely to walk away thinking “gotta be more careful - I almost got caught that time” and continued his skeezy ways.",
                    "score": 165,
                    "author": "elementaljay",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Who's to say? Not all peepers grow up to be serial perverts. Some people actually learn from the consequences of their actions. You gotta give the little bastard the benefit of the doubt.",
                            "score": 36,
                            "author": "RudeAndSarcastic",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Agreed. That’s why I said “just as likely.” I give it even odds on whether or not his actions continued.",
                                    "score": 4,
                                    "author": "elementaljay"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Liking this if for nothing else using the term cretin.",
                    "score": 6,
                    "author": "MW240z"
                }
            ]
        },
        {
            "level": 0,
            "comment": "He didn’t grow up to be a creep in the same way, but made choices that led to me choosing to keep my distance figuratively and literally. We haven’t spoken in maybe 7 years and I live 500 miles away. His brother doesn’t have a relationship with him either. We are all in our early to late 30s. \n\nSaying something to his mom wouldn’t have stopped it. He got away with everything as a kid, which is why he turned out the way he did as an adult. Never learned consequences, never got into trouble, and then became an out of control adult.",
            "score": 281,
            "author": "SparkleSaurusBeth",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": -59,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The end of their comment literally says he \"became an out of control adult.\"",
                            "score": 45,
                            "author": "_dead_and_broken",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah but that’s super vague. Like what does “out of control” mean? Robbing liquor stores? Or getting in bar fights? Or beating his partner? Or not being responsible enough to hold a job? Or just saying dumb stuff that makes him sound like a dick and being rude to service workers? Like it could mean almost anything, it doesn’t actually tell how he turned out.",
                                    "score": -5,
                                    "author": "ThiefCitron"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Don't ask questions if you aren't going to read in the first place.",
                            "score": 3,
                            "author": "Mitchblahman"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "He had a whole plan, but you had the key to revenge.",
            "score": 124,
            "author": "CoderJoe1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Usually it is the parents job to discipline their child. OP shouldn't have to do it",
                    "score": 11,
                    "author": "Cherry_Crystals",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "She screamed, his mom didn't show up. He screams, his mom showed up. The issue here is his mom. Being she wasn't teaching him, he needed to learn the lesson the hard way.",
                            "score": 22,
                            "author": "techieguyjames",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "While I see this dynamic often and have experienced it personally a couple times, we have no way of knowing if maybe his mom was out by the pool and came back in to figure out what was taking him so long.",
                                    "score": 1,
                                    "author": "PRMan99"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's too damn bad that kids grow up believing they can't tell their *own family* when other family members are crossing major boundaries.",
            "score": 18,
            "author": "liltooclinical"
        },
        {
            "level": 0,
            "comment": "You did great!!",
            "score": 34,
            "author": "SnooWords4839"
        },
        {
            "level": 0,
            "comment": "Maybe you should have opened the door twice on his head.",
            "score": 5,
            "author": "StnMtn_"
        },
        {
            "level": 0,
            "comment": "When people realize there’s are consequences to their shitty behavior they tend to shape up.",
            "score": 13,
            "author": "Bad_Mad_Man",
            "replies": [
                {
                    "level": 1,
                    "comment": "And yet people are against a simple spanking.",
                    "score": -18,
                    "author": "PRMan99",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I have met far too many adults who don't understand that they are much bigger and heavier than small children, and hitting them can cause real damage.",
                            "score": 12,
                            "author": "johnny_evil"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would have explained to the aunt afterwards and tell her that she needs to be careful because he could be peeping on his sisters or other girls or even her.",
            "score": 53,
            "author": "ArkangelArtemis",
            "replies": [
                {
                    "level": 1,
                    "comment": "Easier said than done for a 12 year old girl, especially if she grew up like a lot of us in an unsupportive “boys will be boys” family culture.",
                    "score": 167,
                    "author": "waitingfordeathhbu",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If he hadn’t put his eye to the keyhole to watch you changing, the knitting needle wouldn’t have poked his eye out.",
                            "score": 24,
                            "author": "wolfie379"
                        },
                        {
                            "level": 2,
                            "comment": "I grew up in that culture as well and it sucks. But be vocal and tell everyone around that person. If the parents refuse to listen. Tell your parents friends, tell your teachers don't stay silent. Completely out them.",
                            "score": 23,
                            "author": "ArkangelArtemis",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah of course. I was referring to the “I would’ve done it this way instead” language; it’s easy to say how we would have reacted perfectly in a high stress moment, when we’re reading about it on the internet.",
                                    "score": 41,
                                    "author": "waitingfordeathhbu",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "True",
                                            "score": 2,
                                            "author": "ArkangelArtemis"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "\"IF\"... it's a big word.\n\n Seems like you want to defend the little boy....",
                            "score": -59,
                            "author": "Any_Significance_729",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Huh!???",
                                    "score": 8,
                                    "author": "Better-Syrup90"
                                },
                                {
                                    "level": 3,
                                    "comment": "What?",
                                    "score": 7,
                                    "author": "Background_Newt3594"
                                },
                                {
                                    "level": 3,
                                    "comment": "You ran the “ IF “ that comes before “ if the parents refuse to listen….”??? How is that at ALL defending the little creep??!!",
                                    "score": 6,
                                    "author": "CTurple"
                                },
                                {
                                    "level": 3,
                                    "comment": "Are you serious?!",
                                    "score": 5,
                                    "author": "CTurple"
                                },
                                {
                                    "level": 3,
                                    "comment": "Reading comprehension must not be your strong suit",
                                    "score": 4,
                                    "author": "Goose_Is_Awesome"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "\"Could\" be?  He IS.  You should've said he's peeping on me, his cousin, he is definitely peeping on his sisters.  You have a sexual pervert on your hands.",
                    "score": 2,
                    "author": "Notmykl"
                }
            ]
        },
        {
            "level": 0,
            "comment": "HAHAHAHA YES! What did the mom even say or him say when she came over to see why he was screaming? Also karma there actually. No one should be peeping on a girl changing especially your cousin!",
            "score": 5,
            "author": "Magiclover_123"
        },
        {
            "level": 0,
            "comment": "Excellent petty revenge!",
            "score": 7,
            "author": "Acegonia"
        },
        {
            "level": 0,
            "comment": "So how much of a creep did he grow up to be?",
            "score": 11,
            "author": "waitingfordeathhbu"
        },
        {
            "level": 0,
            "comment": "🤣 nicely done, OP!",
            "score": 3,
            "author": "vdivvy"
        },
        {
            "level": 0,
            "comment": "Nicely done! A water pistol filled with vinegar would also have worked, but here you have plausible deniability.",
            "score": 7,
            "author": "FoolishStone",
            "replies": [
                {
                    "level": 1,
                    "comment": " But also I had none of that in this random house on vacation haha. And yes, I could absolutely play dumb like I didn’t know what I was doing when opening the door.",
                    "score": 15,
                    "author": "SparkleSaurusBeth"
                }
            ]
        },
        {
            "level": 0,
            "comment": "i would've shoved something through the keyhole into his eye, but that does less damage 💀",
            "score": 4,
            "author": "Shattered_WasTaken",
            "replies": [
                {
                    "level": 1,
                    "comment": "Spray something with a dye in it through the keyhole. Would have been kinda hard to deny what he was doing. Especially with the evidence around the keyhole and his eye",
                    "score": 9,
                    "author": "More-Jacket-9034",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "oooo true",
                            "score": 2,
                            "author": "Shattered_WasTaken"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why peep on your COUSIN of all things? Gross.",
            "score": 3,
            "author": "Goose_Is_Awesome"
        },
        {
            "level": 0,
            "comment": "Good for you. Bet he’s still a creep, though.",
            "score": 3,
            "author": "Poinsettia917"
        },
        {
            "level": 0,
            "comment": "Nice work. Should have done it the first time you caught him, but hopefully he learned a lesson.",
            "score": -1,
            "author": "Background_Newt3594"
        },
        {
            "level": 0,
            "comment": "The way you wrote this paints such a vivid picture in my head and I cannot stop laughing! That’s what he gets for being creepy! Good job, OP!",
            "score": 1,
            "author": "gold3nhour"
        }
    ]
}