{
    "id": "135dm3h",
    "score": 7,
    "title": "Lashing my (22m) ex-gf (24f) with my tongue for telling me not to touch her when my hands are frozen.",
    "author": "D_Phantom_X",
    "date": 1683010261.0,
    "url": "https://www.reddit.com/r/pettyrevenge/comments/135dm3h",
    "media_urls": [],
    "other_urls": [],
    "postText": "Darling…Feel me. \nI have no desire for you…\nHer: Dantès…\nMe: what?\nHer: my existence hurts. \n\nIt was early November or October or fucking December at this point…i don’t even remember at this point…202?…fuck. \nIt was one ex ago. \nD.m…\n\nIt was late in the evening or perhaps midnight. \nI’m not sure which hour but my beautiful wife, the moon had brought forth her glorious light. \n\nI was adultering with another woman, a French girl but I’m shockingly horrible with names sometimes. \nThis ex, I named Mèdusa. \nThe most gloriously brown eyes had been cast in her chicken face…with a suspiciously defined jawline, her father’s other gift. \n\nMy most recent “call to destiny” had been answered in the form of this one…at the time. \nHer cute brown &amp; tiny nose was almost nonexistent…to the point where I would tease her. \nMy tease, that she didn’t have a nose, just two (extra) useless holes in her face…I promise you that I play this off as romantic. \n…anyway, skip to story…d.m…bros are trynna smoke. \n\nWe were laying in bed before/after fucking (I don’t even remember which came first) and she was trying to cuddle me but I was pissed and I…\nWhen I’m pissed, I tend to lash out with my tongue against anyone that I believe has transgressed the limits of my patience or my feelings too…\n\nI think I tried to touch her lower waistbut my hands were really cold because I kinda like to walk out when it’s really cold without a…okay fuck you, but it may have been my fault because…but when she came to cuddle me…I knew my dick was flaccid and I wanted to spend those precious few microseconds getting vengeance and so I said the treacherous words:\n\n…darling…feel me\nI was wearing only my red boxers and laying on my left shoulder preparing to roll away after comple…you get it. \nShe took this as a peace offering…dumb guys…he just wants a handjob, ah? \nShe took her hand down to feel and I waited for her to feel and her face to betray her knowledge to me and then my tongue did it’s treachery encore:\n\n“Feel me, \nI have no desire for you”\n\nNow, the redness and the water building up in her eyes betrayed her pain. \n\nVengeance accomplished. \n\nTo what end, ah?\n…crazy shit. \n\n- a machiavellian\n\n\nTLDR: my gf asked me not to touch her when my hands are ice cold so I let her feel my d. when it was flaccid and told her I had no desire for her…just for spite’s sake. \nI am the asshole…",
    "comments": [
        {
            "level": 0,
            "comment": "This has to be the most fucking retarded thing I've read in years.",
            "score": 28,
            "author": "ziggy_jackson",
            "replies": [
                {
                    "level": 1,
                    "comment": "After reading your comment I was intrigued to read the post - but I couldn't make it past the first line.",
                    "score": 14,
                    "author": "P44rth00rn4x"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 12,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes.\nI thought I did something by writing it down. \nI suspect you also hoped to do something (Dostoyevsky style) with your comment, no?\n\nDid it work?",
                            "score": -1,
                            "author": "D_Phantom_X"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "If it made you take out the time to say something about it, mission accomplished. \nIf you wanna try it out, feel free.",
                    "score": -11,
                    "author": "D_Phantom_X"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Did you fart this onto the keyboard?",
            "score": 13,
            "author": "Illustrious-Total489"
        },
        {
            "level": 0,
            "comment": "Remember when your parents told you that you could be anything you wanted?  You can scratch author and/or storyteller off that list.\n\nHome girl shoulda made fun of your limp dick and walked out laughing.",
            "score": 15,
            "author": "themurhk",
            "replies": [
                {
                    "level": 1,
                    "comment": "If you treat a girl right/wrong enough, she’ll be too terrified/respectful to make fun even when you’re the problem, you’re right…but 4/7, they “break”. \n\nDate a few more, you’ll get it.",
                    "score": 0,
                    "author": "D_Phantom_X",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s so fucked up. Your goal is to terrify your partner?",
                            "score": 3,
                            "author": "PM_UR_SOLES_LADIES",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh dear Lord no. Not too much. \nI’m just stating something that has been observed. \n\nI think you’re projecting and assuming these desires and motives on me but I could be a 5 years old, raccoon.",
                                    "score": 1,
                                    "author": "D_Phantom_X"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Mhm.  Those are mental abuse tactics of a terribly insecure person.  If you have to tear someone down in order to feel powerful or respected, you were never powerful or deserving of respect.  \n\nAnd you reek of PUA indoctrination, which is designed to give weak people a false sense of confidence.  And just like every rouse, it all falls apart eventually.",
                            "score": 3,
                            "author": "themurhk",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes but to be fair, there’s no shortage of people willing to allow themselves to be “broken”. \n\nScammers will always exist because there will be people uninformed enough to fall for the bs and “we” will always exist because there will always be unfortunate souls gullible enough to believe the bs. \n\nIt’s unfortunate but true…imo.",
                                    "score": 1,
                                    "author": "D_Phantom_X",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Very weak attempt to justify your lack of integrity and sociopathic behaviors.\n\nEveryone is responsible for how they utilize their time and energy.  If you choose to direct your energy towards manipulating people instead of improving yourself, that tells people all they need to know about you.",
                                            "score": 2,
                                            "author": "themurhk",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "First of all, I missed the PUA indoctrination thing the first time, I’ll Google it later to find out what it is. \n\nSecond, there is neither justification nor *insert word here* for my being sociopathic in my reply. \nIt’s a simple observation. \n\nIgnorance exists and we know it. \nAs a consequence, some people will seek to take Ad vantage of those people that are ignorant. \nThe same goes for physically/emotionally weak people. They exist as do those that would prey on them if given the opportunity. \n\nI don’t see where I said this is good or bad. \nCould you quote it for me?\n\nThirdly, yes. It tells people that I’m sociopathic and they should avoid me or I’ll use them to my advantage, then dump them. \n\nDo they avoid me after I’ve shown sociopathic traits?\nSome do, some don’t. Some run headfirst into conversations with me, thinking they are special enough to “win”. \n\nExhibit D - you. You’re still here. I’m probably still in your head. I don’t know which version of me hurt you in the past but you prolly deserved it for being naive.",
                                                    "score": 1,
                                                    "author": "D_Phantom_X",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Lol this clown replies to me a full month later and accuses me of still having him in my head.  \n\nBro I forgot you even existed.  But thank you for the laugh.",
                                                            "score": 1,
                                                            "author": "themurhk",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "1. As for why it took so long to remember to respond to you, this may sound strange (to you) but there are other things to do besides dwelling on the barkings of anonymous dogs. \n\n2 « i forgot you even existed » says the guy that responded within hours of my (month delayed) response and took the time to point out his own irrelevance to me. \n \n3. Darling, you still haven’t proved your point yet but I could argue that you’re still proving mine. \nExhibit E - you came back immediately you heard me call, as I suspected you would. \n\nYou’re welcome for the laugh. Even dogs need joy. \nThanks for yours, too…till next month?",
                                                                    "score": 1,
                                                                    "author": "D_Phantom_X"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why would you post this",
            "score": 10,
            "author": "PM_UR_SOLES_LADIES",
            "replies": [
                {
                    "level": 1,
                    "comment": "Bored and anonymous.\nWhy not find the other bitter people?",
                    "score": -1,
                    "author": "D_Phantom_X",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This isn’t even petty revenge. You just wanted to post some weird unattractive sex story",
                            "score": 4,
                            "author": "PM_UR_SOLES_LADIES",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Revenge: the action of hurting/harming someone in return for a perceived hurt/harm…\n\nPerceived harm: rejection: my hands were cold\nReturn ac…if you’re still expecting me to teach you English, you’re dumber than my socks…\n\nbut I’ll oblige because you’re still paying attention. \nNothing to do either, huh?\n\nPetty: something small/insignificant \n\nPetty+revenge = thé action of har…wow you’re still here?\n\nYou get it by now, no?\n\nPick another insult, I’m waiting for the bus.",
                                    "score": -1,
                                    "author": "D_Phantom_X"
                                },
                                {
                                    "level": 3,
                                    "comment": "Also, could you point out where I said we had sex, exactly?\nAlso-also, if you want to refer to the “he just wants a handjob” thing, my response would be:\nI’m not sorry to be the one to inform you that that isn’t sex, darling.",
                                    "score": 0,
                                    "author": "D_Phantom_X"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I stopped halfway through the fourth \"paragraph\" because this is just so fucking stupid.",
            "score": 9,
            "author": "Slackingatmyjob",
            "replies": [
                {
                    "level": 1,
                    "comment": "English ain’t for everyone bro. I hate french too.",
                    "score": 0,
                    "author": "D_Phantom_X"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 8,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for letting me know my life is a fantasy for you…I’m genuinely narcissistic. \nThis was good.",
                    "score": 1,
                    "author": "D_Phantom_X"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This sounds like it was written by chat gpt or some other chatbot",
            "score": 7,
            "author": "Successful_Egg8678",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think in negatives too, so I’ll translate your sentence as:\n“This is on par with a chatgpt. It is of the same quality as a super ai thingy”\n\nMeanwhile in reality, I just scribbled some shit on my notebook/gay diary, was reading stuff on Reddit and thought, why not?\n\nAgain, thanks for the compliment. \nPhrase your barks better and base them on known assumptions less. \nDog.",
                    "score": 0,
                    "author": "D_Phantom_X",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well, maybe you need to learn to write coherently. It was jibberish, and sounded like an eight year old wrote it. If \n\nIf you can't hang with the big dogs, stay off of the porch. Puppy.",
                            "score": 1,
                            "author": "Successful_Egg8678"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I made it through the first paragraph...",
            "score": 6,
            "author": "tiedyedpunk",
            "replies": [
                {
                    "level": 1,
                    "comment": "I already replied to you in another skin suit, check your father’s comment.",
                    "score": 0,
                    "author": "D_Phantom_X"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Info:\n What the fuck did I just read?",
            "score": 5,
            "author": "fuzzyleeches",
            "replies": [
                {
                    "level": 1,
                    "comment": "Amateur Romantic Literature. \nIt’s the language women fall in love with. \nLiterally, literally speaking. \n\nIts like German, bro. It’s not for you. \n\nCan the men stop roasting me so I can start roasting and/or toasting thé bored people of the “sensible” gender?",
                    "score": 1,
                    "author": "D_Phantom_X",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I am a woman. \n\nThis doesn't really pass as anything but confusing. Definitely doesn't come across as romantic literature.",
                            "score": 2,
                            "author": "fuzzyleeches",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You’re one of the broken ones.",
                                    "score": 1,
                                    "author": "D_Phantom_X",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yes. So broken. 😂",
                                            "score": 3,
                                            "author": "fuzzyleeches",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The words are getting less and less. \nCome on, let’s argue. \nTalk your sheesh.",
                                                    "score": 1,
                                                    "author": "D_Phantom_X"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This smells like burned toast",
            "score": 9,
            "author": "50drunk50insane",
            "replies": [
                {
                    "level": 1,
                    "comment": "I…would like insult you back but if I go that low, you beat me to death. It’s your territory bro. \nI’ll take the l.",
                    "score": 0,
                    "author": "D_Phantom_X"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Stahp",
            "score": 2,
            "author": "MrBeer9999"
        }
    ]
}