{
    "id": "13arwa9",
    "score": 843,
    "title": "MacHaircut",
    "author": "Thetimdog",
    "date": 1683471522.0,
    "url": "https://www.reddit.com/r/pettyrevenge/comments/13arwa9",
    "media_urls": [],
    "other_urls": [],
    "postText": "Back in the day (decades ago!) MacDonalds had a hair policy , men weren't allowed to have long hair. No idea if that's still true. I had the (at the time) common shaved underside and long top hair, which would go down past my face. For the first year i always showed up wearing my hat, so no one had a clue. Then we had a Christmas event that for some reason i attended and they saw me for the first time with no hat. Immediately on my next shift the threats of cut your hair or you are fired started, even though LITERALLY FOR A YEAR they couldn't tell i had long hair because it was up in my hat.\n\nI fought them on it for over 6 months, may have been 12. I didn't care that much about the job, but I wasn't going to give them the satisfaction of quitting before I was ready. So we fought, every shift. Got a 10 cent raise that performance review, in large because of it. Honestly I kept that hair longer than I intended, mostly cause fuck you, not giving you the satisfaction.\n\nFinally it was time for me to quit. I shaved my head, showed up with no hat, the manager came out and was like \"all right, awesome, you finally cut your hair\" and i was like \"yup, i quit\". The look on his face made me consider that perfect pettyness for the year of annoyance.\n\nMcDonalds has always been and will always be stupid as shit.",
    "comments": [
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 72,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "There are a couple of Lumbee kids (and their parents) here in NC fighting their charter schools because their hair length is culturally derived.",
                    "score": 43,
                    "author": "SordoCrabs",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Found it. Interesting \nhttps://www.robesonian.com/news/243273/lumbee-council-supports-pushback-on-institutions-calling-for-haircuts/amp",
                            "score": 17,
                            "author": "Knitsanity"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "From the south and never heard of a school with this policy unless a private school. I had hair almost to the middle of my back in hs. Got to go into girlfriends cosmetology class so they could style it and give me facials(keep it rated pg on this)",
                    "score": 21,
                    "author": "gsxreatr02",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "In the late 80s I moved in with my dad in Texas and I had longish hair. Day two the principal and P.E. coach held me down and buzzed my head for refusing to get a haircut.\n\nMy dad just laughed and called me a gay slur for caring about my hair. I didn’t stay long.",
                            "score": 16,
                            "author": "Cheesqueak",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Think i would have repainted their cars for them. That sux man.",
                                    "score": 17,
                                    "author": "gsxreatr02"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yeah, I am from the south and I went to school in the 60s and 70s. No one said anything about hair until I started a private school. The public schools didn't care.",
                            "score": 7,
                            "author": "_my_choice_"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I can see some hirsute young men starting a tache challenge then at the end of the year holding a contest with categories. You can do amazing things with time patience and tache wax . I bet some of the male teachers who thought the rule was dumb would get in on the action too. Lol",
                    "score": 7,
                    "author": "Knitsanity",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There's a thing called Movember. [https://www.gillette.co.uk/blog/facial-hair-styles/movember-rules/](https://www.gillette.co.uk/blog/facial-hair-styles/movember-rules/)",
                            "score": 2,
                            "author": "sueelleker",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yup...but.... It would probably take some young men at the start of their growing potential more than a month to cultivate anything worthy of pissing off the gatekeeping hair police.",
                                    "score": 1,
                                    "author": "Knitsanity",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm in my thirties. Haven't touched my moustache for at least two years except for some minor trimming so the hairs pointing straight down by default don't enter my mouth. Still not anything worthy of pissing off the hair police. Plus my facial hair is blond, so it isn't all that visible in the first place. Some people just don't have the genes to make their facial hair worthy of pissing someone off.\n\nHaving barely visible facial hair has its upsides though. Back during military service the rule was that you have to shave daily unless your facial hair is at least a centimeter long. After a while I got fed up with shaving and just stopped. By the time the platoon commander (or sergeant major?) noticed I stopped shaving, it was already long enough.",
                                            "score": 1,
                                            "author": "curiosityLynx",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Lol..\nI have a friend whose 15 yo son shaved every morning and by the evening had a dark shadow. One vacation he decided to just let it grow and by the time he went back it was long enough to cause distress. Lolol. He looked so old he used to go to creative lengths when younger to go Trick of Treating....to the regret of his parents. Lol",
                                                    "score": 1,
                                                    "author": "Knitsanity"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "hair today, gone tomorrow",
            "score": 236,
            "author": "vodkacokebloke",
            "replies": [
                {
                    "level": 1,
                    "comment": "![gif](emote|free_emotes_pack|thumbs_up)",
                    "score": 48,
                    "author": "Thetimdog"
                },
                {
                    "level": 1,
                    "comment": "I am ashamed at how hard I laughed",
                    "score": 18,
                    "author": "Landrig22",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I am not.  It was worth it.",
                            "score": 16,
                            "author": "deshep123"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Years back I used to work at a  Wendy's. I didn't get a raise because I wore a simple necklace and had multiple piercings in my ears.",
            "score": 25,
            "author": "Tygermouse",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ugh, I'm glad society is finally easing up on that stuff. My family had a meltdown about me getting tattoos (none visible in a short sleeve shirt) because I might not be able to get a job.",
                    "score": 14,
                    "author": "TheHypnotoad87",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Same.  I'm in my 40s gainfully employed. I have 15 piercings (most in my ears)and 12 tattoos and my mom still worries that my job is in jeopardy. I've been at this job for 18 years and there are other employees with more obvious tattoos and piercings than me.",
                            "score": 21,
                            "author": "Tygermouse",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My mom was the same way. I have one tattoo, not visible unless you walk into the bathroom without knocking like she did (upper outer right thigh). She looked at it and asked me \"what if you have a job interview?\"\n\nI looked her in the eye and respectfully responded with \"if I'm interviewing for a position that my tattoo is visible,  I don't think it matters that I have one in the first place.\" \n\nShe didn't like that response but she never mentioned it again. I wonder what she'd think of her granddaughter. She's a veterinarian with no fewer than 15 tattoos.",
                                    "score": 15,
                                    "author": "BirthdaySalt2112",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I’m a public school teacher with knuckle tattoos. Somehow I still get hired and promoted…..\n\nIt must be due to my skills beyond how my hands look.",
                                            "score": 8,
                                            "author": "ohhgrrl",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Lol. I was raised by my maternal grandparents (I called them mom and dad) so I guess I was dealing with a double dose of generation gap lol.",
                                                    "score": 6,
                                                    "author": "BirthdaySalt2112",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": " My parents (Boomers) were OBSESSED with stopping me from body modifications. They really messed that one up.",
                                                            "score": 5,
                                                            "author": "ohhgrrl"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Securely because you're a good teacher and people view your quality as a person, not only your aspect.",
                                                    "score": 2,
                                                    "author": "zeus204013"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I feel that one... folks tried doing the \"how's that going to look when you're 50?\"... my response was \"&lt;dives into extensive family health history and who's seeing which specialists&gt; so at 50 I'm gonna have bigger problems to deal with than how my ink looks.\"",
                                            "score": 6,
                                            "author": "TheHypnotoad87",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "My daughter and her father are going to make interesting seniors. They have about thirty tattoos between them. They are both doctors and have their respective caduceus tattooed on their shoulders. First Do No Harm on the top But take No Shit on the bottom. They are so cool looking.",
                                                    "score": 3,
                                                    "author": "BirthdaySalt2112"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I like my tattoos,  my daughter is thinking of getting one, but she's 14, so I've asked that she wait till 18.",
                                            "score": 5,
                                            "author": "Tygermouse",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I can see that. In my state you have to be 18 to get a tattoo. 14 is a little young but good for her knowing what she wants.",
                                                    "score": 3,
                                                    "author": "BirthdaySalt2112"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I’m in my 50’s with visible tattoos. Work for a large insurance company, and visit clients regularly. I’ve seen execs with ink. \n\nI haven’t seen an employee code of conduct or dress code that mentioned tattoos since the ‘90’s. When I worked in healthcare (an ER) there was something about piercings that was safety-related, but I only have ear-piercings and don’t wear earrings much anyway.",
                                    "score": 8,
                                    "author": "autogeriatric"
                                },
                                {
                                    "level": 3,
                                    "comment": "My daughter is mid-20’s and has piercings and lots of tattoos. I was concerned that they weren’t hidden and that she’ll have trouble getting a job and keeping it. She assured me that she won’t, and hasn’t had any problems until now. She has to go on a business trip (in hot weather) to a country where she has to keep all her tattoos hidden. That means long pants/dresses, and long sleeves. Plus her cleavage has to be covered lest a tattoo peaks out. At least she doesn’t live there.",
                                    "score": 4,
                                    "author": "Anxious_Faerie911",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt; ~~peaks~~ *peeks*\n\nUnless the cleavage is mountainous.",
                                            "score": 3,
                                            "author": "mlpedant",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Something something twin peaks.",
                                                    "score": 4,
                                                    "author": "DubiousAndDoubtful"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "In my country there is a lot of people with tattoos/piercings (less than 35-40yo). If the tattoos are trashy is very negative to most jobs. And depends if you're perceived as nice or ugly...",
                                    "score": 1,
                                    "author": "zeus204013"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I’m close to 60. Most of my generation were raised in a time where our parents constantly told/reminded us that decent society would not tolerate visible tattoos. I mean that this way of thinking was crammed down our throats. That if we did have tattoos, we would be considered degenerates, unworthy and untrustworthy. \n\nIt took me until my daughter was in her 20’s and showed me her cute tattoo on her wrist to realize I was feed a bunch of bullshit.  I started noticing other people’s tattoos and realized I no longer had negative perceptions about them. \n\nWe were conditioned, don’t judge us to harshly. It’s taking some people longer to realize the truth. And as a society, I’m sure they will be some that never will realize it. Unfortunately, they will most likely pass this train of thought on to their children. Good news is that this perception is thinning.",
                            "score": 7,
                            "author": "cshoe29",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm a 41f and was raised with the same bs that tattoos were for “rough people” and were undesirable.\n\nIt wasn’t until my husband forgot to get me a bday present followed a week later he still hadn’t but now he missed the actual Valentine’s Day happening. Well our anniversary was in there too. He was so stressed trying to come up with an idea for a present on the missed birthday the poor asshat missed the rest. Well when pointed out it was Valentine’s Day and he hadn’t acknowledged our anniversary he doubled down with “just buy yourself something if it’s that big of a deal. Quit being so materialistic.”\n\nWell I already had a 3 week trip home to Alaska planned a couple weeks later. I came home with a back piece watercolor tattoo of a pic from our land. It has part of my favorite quote down my spine cutting through the mountain &amp; stream.\n\nDidn’t warn him or say a word.\n\nLet’s be clear he’s always known I’m petty, he says he underestimated how petty I could be.\n\nhttps://preview.redd.it/bbaghbon8jya1.jpeg?width=748&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=39feacec7cae198fb12ed7593175c4d19973915e",
                                    "score": 2,
                                    "author": "burlesque_nurse"
                                },
                                {
                                    "level": 3,
                                    "comment": "I’m 66 and back in my day most of the people that had tattoos were ex military, bikers and ex convicts. So the  perception was kind of negative. I don’t have any and like you I didn’t think much of them. Still not a big fan although I do appreciate the artistry of some of them. I’ve seen some beautiful tattoo artwork. Something I do wonder is if the pendulum will swing the other way with younger and future generations and they won’t be as popular.",
                                    "score": 1,
                                    "author": "II-leto"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "If it really was a problem they would have/should have fired you. Instead they used the piercings as an excuse to underpay you. What a bunch of assholes.",
                    "score": 5,
                    "author": "HR-Puffenstuff",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "True, especially since I was never verbally warned or written up for not following all uniform rules.",
                            "score": 4,
                            "author": "Tygermouse"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "assholes",
                    "score": 2,
                    "author": "GrumpySnarf"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My husband worked for the clown in I think 2010 or 2011. He didn’t have super long hair just shoulder length. He was told to cut his hair. He spent money getting it trimmed to just above his collar because they didn’t want his hair touching his collar. \n\nHe went in on his next shift and was told it wasn’t short enough. He fought back saying that the dress code in the handbook said his hair had to be off his collar and it was. The MOD ( manager on duty ) made some comment about “men with long hair” and sent him home. Hubby came home pissed and took some buzz clippers to his head and shaved it all off. \n\nNext day he went in with a shaved head and they fired him. Can’t remember the exact reason but it had to do with his hair and the extreme he went to. Of course I’m sure him walking in and saying “is it short enough now” didn’t help…",
            "score": 19,
            "author": "whoozywhatzitnow",
            "replies": [
                {
                    "level": 1,
                    "comment": "Now I'm imagining a man showing up for work in something extra low-cut from the women's department like \"The hair's not touching my collar!\"",
                    "score": 8,
                    "author": "psychosis_inducing",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Or topless....",
                            "score": 1,
                            "author": "sueelleker",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Tank Top.",
                                    "score": 1,
                                    "author": "MikeSchwab63"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I worked at eat n park in Pittsburgh around the y2k era. They would send you home for stubble. I am SO GLAD this kind of policy is gone now.\n\nFor context, I'm Norse by heritage. You know the entire viking beard thing? I get that, last time I grew my beard out for about a year it was half way down my chest. It takes me about a week to get a full beard. I get a five o'clock shadow about 4 hours into the day. Ended up having to quit because I got tired of waking up, shaving, getting breakfast, going into work, then being sent home to shave again. Meanwhile halfway through the shift I'm pointing at my face to the manager like \"LOOK. I AM NOT KIDDING, MY FACIAL HAIR GROWS LIKE BAMBOO.\"\n\nAnd the really obnoxious part about it? I was the fucking dishwasher. Nobody was seeing me.",
            "score": 17,
            "author": "DreadedChalupacabra"
        },
        {
            "level": 0,
            "comment": "Canadian military in the 90s. The rule was short hair sides and back but anything under your hat was yours. I had hair down to my chin. Before going to inspection I had some friends help tuck all my hair up into my hat. One time they missed one strand. The Sargent walking by saw the hair sticking out so he went to grab it figuring he would give it a tug and pull my head back. He gave it a little yank, it just got longer, he tugged it again and it got longer still. He grabbed my hat and ripped it off and it was like cutting open one of those shipped mattresses. I'm sure I would have heard a \"poof\" sound if it wasn't drowned out buy the Sargents scream of rage. He screamed at me to get it cut before the next inspection but I just quoted the regs and there was nothing he could do.",
            "score": 11,
            "author": "crujones43",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nice  wasn't ware they had the hide under hat rule actually in regs",
                    "score": 5,
                    "author": "Thetimdog"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Loved this lol",
            "score": 8,
            "author": "aicitellstories"
        },
        {
            "level": 0,
            "comment": "HAHAHA that was awesome! I would've put some hair in a zip lock bag with a pretty bow on it or maybe wrapped it up and gave it to the manager as a goodbye gift. Note included... \"You wanted it cut. Here you go, I no longer have use for it\"",
            "score": 8,
            "author": "8aL0Tb8bzBIGnow"
        },
        {
            "level": 0,
            "comment": "I was growing my hair and as it was just over my collar and annoying me, decided to get it cut at the weekend.  On Thursday afternoon, my boss called me into his office and said “you know, Horaceordoris, it’s the fashion amongst young men of your age to have short hair nowadays”\n\nI grew it and only had the ends trimmed for the remaining 6 years I worked there……",
            "score": 8,
            "author": "HoraceorDoris",
            "replies": [
                {
                    "level": 1,
                    "comment": "\"I don't follow fashion sir\".",
                    "score": 2,
                    "author": "sueelleker"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My husband grew a goatee and mustache at age fourteen. The school (in New Jersey) made him shave the mustache, but not the beard. When he moved to my state at age 16, he grew the mustache back, and it looked nicer. That school was weird. (Yes, I knew him at 16.)",
            "score": 8,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "IT'S FUCKING MCDONALDS.  They need to sit down. Jesus.",
            "score": 7,
            "author": "GrumpySnarf"
        },
        {
            "level": 0,
            "comment": "Should have worked at Burger King, you can “Have it your way” there",
            "score": 5,
            "author": "AcrobaticSource3"
        },
        {
            "level": 0,
            "comment": "It's Mc, not Mac.",
            "score": 1,
            "author": "ZekDrago",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm amazed this comment took this long lol. I knew it as soon as I hit go, but you can't change titles. Shrug.",
                    "score": 2,
                    "author": "Thetimdog",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Actually, to avoid lawsuit, most reddit suggest fake or misspelled names.",
                            "score": 1,
                            "author": "MikeSchwab63"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You shouldnt be working with the public, Go hide somewhere no one can see you",
            "score": -46,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "What?",
                    "score": 10,
                    "author": "Bird_Up23"
                },
                {
                    "level": 1,
                    "comment": "Where the fuck did that come from??",
                    "score": 6,
                    "author": "CTurple"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -18,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "So you agreed to keep your hair cut a certain length and then you broke you agreement, and to get revenge against yourself you got only a ten cent raise?",
            "score": -1,
            "author": "IndyAndyJones7"
        }
    ]
}