{
    "id": "13bh0y1",
    "score": 432,
    "title": "I asked for a call back",
    "author": "Klutzy-Rub6500",
    "date": 1683529706.0,
    "url": "https://www.reddit.com/r/pettyrevenge/comments/13bh0y1",
    "media_urls": [],
    "other_urls": [],
    "postText": "Not sure if this is considered a petty revenge, but I once applied to a job near my house. We had an amazing interview. We were all happy and chuckling. They said, I answered the questions correctly, even the math test they gave me and I thought I got this interview in the bag. \n\nTowards the end of the interview, I asked when will I hear from them and they said the following week. I asked another question if they also call back those who don’t qualify, because to me, if I didn’t, I’d rather know, so I can move on. The manager was like, “Oh yeah. That’s professional courtesy”. The following week came and another week came by and another and I didn’t hear back from them. I, honestly, forgot about it. 3 months later, I got an email from Indeed saying my qualifications match this job posting and it was from that same company, for the same position I applied to. \n\nI applied to it again. \n\nI thought they’d skip me, since I applied before and didn’t make the cut. They called me to schedule me for an interview. I said in the call that I’m in the middle of something and will call them back. It’s been about a week, I haven’t called them back. They called me two more times and got an email, but I never called them back or replied to the email. \n\nLol. I know it’s dumb, but that’s me. \n\nPS I also understand why companies don’t call you when you didn’t get the job. I just wish they went with their word. They could’ve, at least, worded it differently. Maybe something like, “Should you get the job, we’ll let you know immediately”.",
    "comments": [
        {
            "level": 0,
            "comment": "I recently started looking and interviewing for jobs. The job that I have now is the one I started right after college and I frankly didn't have any experience with interviews as I only gave two interviews and got selected on the first one I applied to. \n\nIt's was very unsettling when I wouldn't receive call backs or emails letting me know if I had made it or if I was rejected. In the past 4 months I have given 8 interviews, I was rejected by 5 of them but only one of the company emailed saying I wasn't what they were looking for. The other 4 just ghosted me.\n\nI also had an HR from one of the firms tell me that \"No answer is also an answer. You're a woman, don't you already know that? You don't have to reject a person you don't want to date, if you don't reply your uninterest is noted. You would be annoyed if they kept asking for clarification, wouldn't you?\" This after I emailed once after 3-4 weeks.",
            "score": 109,
            "author": "lisaslyfe",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'd report that comment for blatant misogynistic undertones.  Very unprofessional and just plain gross.",
                    "score": 104,
                    "author": "SheWhoLovesToDraw",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I really wanted to. I was about to attach that email and send it to the people who interviewed me and the co-founders, but turns out they already were cc'd on the email. Now that I think about it I am angry but at that moment I had never felt so ashamed before. It makes angry because I have no reason to feel shame!",
                            "score": 54,
                            "author": "lisaslyfe",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Then post it on GlassDoor instead.  Help other people avoid that trainwreck of a company before they accidentally waste their time.",
                                    "score": 73,
                                    "author": "SheWhoLovesToDraw",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Glassdoor allows companies to pay to remove bad reviews so...\n\nWas advised this by a VP of HR at a large international company who had no reason to lie to me.",
                                            "score": 15,
                                            "author": "SheiB123",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "At least then the have to do something about it instead of just ignoring it.",
                                                    "score": 5,
                                                    "author": "MistressPhoenix"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I did it! I wrote a long review detailing the interview, no notification and the replies I received when I checked with them. I also left them a Google review because I apparently can. For good measure I also went to their website and sent an email on the contact us email with attachment of the HR email. \n\nI did not expect this level of support for something I felt was normal enough everywhere.",
                                            "score": 11,
                                            "author": "lisaslyfe",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That's great!  Even if you don't directly hear anything about your report, it'll still get on someone important's radar and give that company an overdue shake-up for unprofessionalism!",
                                                    "score": 1,
                                                    "author": "SheWhoLovesToDraw"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "This!",
                                            "score": 5,
                                            "author": "thunderpantsIII"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Report to labor board for equal opportunity employer.  You won't get anything but might help with future applicants, wrongly fired employees.",
                                    "score": 8,
                                    "author": "MikeSchwab63",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm Indian so idk if the labor board here would do anything.... Or if the labor board even looks into stuff like this. But I did leave a Google and Glassdoor review. I also emailed the company again and let them know about my experience.",
                                            "score": 3,
                                            "author": "lisaslyfe"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I'm sorry you had that happen. Completely inappropriate thing to say to anyone. It's cold comfort, but you dodged a bullet--I can only imagine how they would have treated you had you been hired.",
                                    "score": 5,
                                    "author": "ATM1L0",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yes definitely! I was looking forward to the role because the pay a lot more than industry standards for my experience level. Looking back that seems like a false promise.",
                                            "score": 2,
                                            "author": "lisaslyfe"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Guess you dodged a bullet there, if that's an email from *HR*. That's gross.",
                    "score": 14,
                    "author": "Iskaeil"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was asked by a company once to have a sorta pre-interview, to see if they could interview me for a job opening. Ok, I went there, tried to ask some questions about the company, but they started grilling me on client contact. I’m quite open, so they know who they would hire. At the end of the meeting they told me they would not go for a real interview, because I was too open, and I should be less opinionated. I said I wasn’t gonna pursue a job at their company, simply for how they hardly answered questions, wanted me to be a dime a dozen, and that having a job with them would not make me happy. Then they started to get mad at me. I laughed all the way to the parking lot.",
            "score": 28,
            "author": "gozba"
        },
        {
            "level": 0,
            "comment": "I dealt with a somewhat similar situation. Interviewed with a large chain store for men's clothing. Went through the entire process and was told the job was mine. But they needed to work out the schedule. Ok... no problem. I just need to know when to give current employer a 2 weeks notice. \n\nWaited 2 weeks, didn't hear anything back, so I called them to politely ask what's going on. I'm told (in a cheerful way) that he's working on it and he'll let me know soon. Alright...cool.  Waited another 2weeks and still silence. Once again, called them to politely ask what up. This time he's gruff and kinda pissy. Same line of bs about working on the schedule. Well, I didn't want to lose the job before I ever started, so I left it alone. Couple months go by and I discovered that they hired someone from their sister company. That's pretty dirty of them! \n\nMy revenge came a couple years later. They were opening a new store, actually closer to where I lived. Of course I applied to work there. The pay was significantly higher. Eventually the store opens. Yet I never heard a peep from them.  Not even a rejection email. I call up their corporate number to find out if they even saw my application. Nope. They say the store would have it on file. Call the store. Nope. Corporate would have it in their system.  By now I'm PO'd and ready for revenge. Called corporate back and gave them an earful. I let them know where I currently work and our customers often asked for advice on where to buy a suit. Told the rep that there was no way in hades I would ever recommend going to their store. In fact, I was going to advise men to stear clear of them and go to their competitors! She was a teeny bit panicked and was pleading with me not to do that. I abruptly ended with \"too late\" and requested that they burn my application. That is...should they ever find it  (highly doubtful).  \n\nYeah I know I dodged a bullet there. But stringing someone along is ridiculous.",
            "score": 22,
            "author": "More-Jacket-9034"
        },
        {
            "level": 0,
            "comment": "I’m struggling to understand what justification there is for not paying the simple courtesy of a call. You took the time to go interview with them,at least they could spend five minutes explaining why you didn’t get it. \nThey should know that there every chance the show will be on the other foot one day",
            "score": 17,
            "author": "Original_Charity_817",
            "replies": [
                {
                    "level": 1,
                    "comment": "As much as I'd like feedback so I can improve my interviewing skills, id honestly just be happy to get a simple \"we went with another candidate\" email.  Just so I know to stop wasting my time on that opportunity and that I can accept another offer if I have one without fear of missing out",
                    "score": 10,
                    "author": "zanebarr"
                },
                {
                    "level": 1,
                    "comment": "Yes. I’m fine with them just letting me know, we found someone who’s more fitting for the position and I’ll be fine.",
                    "score": 1,
                    "author": "Klutzy-Rub6500"
                }
            ]
        },
        {
            "level": 0,
            "comment": "In my last two jobs, I did a fair amount of hiring. Sometimes I got lots of resumes, other times just a few. If I got a resume from someone who simply would not qualify for the position, I usually sent them a letter immediately explaining that there were certain minimum requirements (which was in my job posting too) that they did not have. When possible, I would also mention specific things about their background that could potentially be helpful IF they had the right background. \n\nEventually I got to a short list of candidates. At that point, I sent letters to anyone I didn’t plan to interview. \n\nOnce the interviews were completed, I also wrote to the candidates that weren’t selected. And again I made a point of saying positive things about their resume/background. \n\nI got a certain amount of criticism for my style, but having applied for many jobs over the years, I really hated just silence. Yes, it took some extra work on my part, but these are people looking for a job. They deserve more than silence, especially the ones I actually interviewed.",
            "score": 11,
            "author": "awakeagain2"
        },
        {
            "level": 0,
            "comment": "This is why I will never apply at Sony again. They didn’t call back. Talked to the hiring manager (who has since moved on) and they apologized.  Bridge already burnt, my friend.",
            "score": 47,
            "author": "Iisszzttadda",
            "replies": [
                {
                    "level": 1,
                    "comment": "I've known people who suffered, I mean worked, for Sony. You dodged a bullet there.",
                    "score": 16,
                    "author": "No_Aioli7596"
                },
                {
                    "level": 1,
                    "comment": "Yes, that'll work\n Refuse to work for one of the largest tech companies in the universe, because someone didn't call you back. And apologised?? \nYou poor thing. \nSony's loss I guess..  oh wait, probably not",
                    "score": -49,
                    "author": "Any_Significance_729",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Damn right their loss.\n\nNo, it’s not going to hurt them in the end. The talent pool is wide and deep. It also won’t hurt me. My skills are marketable and transferable.",
                            "score": 19,
                            "author": "Iisszzttadda"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "As a hiring manager, let me apologize on behalf of all decent-minded managers. \n\nBut those guys? Fuck those guys. It might have been a petty response, but they deserved it. \n\n&amp;#x200B;\n\nWhen I'm hiring, every single applicant that makes it to my desk gets a response. A lot of times, it's a boilerplate email. But once an applicant made it past a certain stage, a phone call (or if possible, a face-to-face meeting) is warranted, IMHO. I've had to tell existing coworkers that they weren't selected - you can put money that I brought them into my office and explained not only that they weren't selected, but *why*. \n\nWhile I have this response policy on a personal level, I did find out later that it's also a written policy at the company level, too. Needs better marketing; I'm not sure every manager knows that line is in there.\n\nGah, I hate ghosting managers. Pisses me off.",
            "score": 6,
            "author": "ryanlc",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for being a decent-minded manager.",
                    "score": 4,
                    "author": "Not_A_Bimbo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That's a red flag. The courtesy given to prospective employees indicates how they treat actual employees. I once turned down a job when the CEO showed me how entitled he was and HR tried to make excuses for him.",
            "score": 5,
            "author": "glenmarshall",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’d like to hear all about that!",
                    "score": 2,
                    "author": "wynnofthewood"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wow, in my old job I was sorting through old applications for my boss for something and found an application written on a postcard, that explained he didn't want the job, but had to write applications to keep receiving unemployment benefits. It was the worst application I have ever seen in my life.\n\nBehind it was a copy of the rejection explaining we didn't have the job he applied to. He received a perfect, professional response for... THAT. I still don't know what to think about it.\n\nWhy can some companies do this and others not? Are they... Stupid? Or just cowards?",
            "score": 6,
            "author": "SpinedOnesAreOK",
            "replies": [
                {
                    "level": 1,
                    "comment": "Neither, just lazy and rude",
                    "score": 2,
                    "author": "Catsscratchpost"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I applied for a job,got it and was called the day before I was supposed to start because the person who quit wanted the job back. About a month later they called me back and told me that I could still have the job because the guy quit again.  I said no thanks.",
            "score": 3,
            "author": "JanuarySoCold"
        },
        {
            "level": 0,
            "comment": "I am assuming that, 3 months later, you have found a job.  If you haven't, not sure the value of doing this other than personal satisfaction.",
            "score": -3,
            "author": "Zoreb1",
            "replies": [
                {
                    "level": 1,
                    "comment": "I did. It’s a much better job, tbh.",
                    "score": 21,
                    "author": "Klutzy-Rub6500"
                },
                {
                    "level": 1,
                    "comment": "That’s why it’s a petty revenge thread🙄",
                    "score": 8,
                    "author": "Repulsive_Plate_3012"
                }
            ]
        }
    ]
}