{
    "id": "13bw3gx",
    "score": 73,
    "title": "Accusing me of putting chewed up gum on your locker? Fine then I guess i'll do it!",
    "author": "WarriorDiamond",
    "date": 1683561265.0,
    "url": "https://www.reddit.com/r/pettyrevenge/comments/13bw3gx",
    "media_urls": [],
    "other_urls": [],
    "postText": "Using fake names because if ykyk\n\nIf this doesn't belong here please tell me where this would be posted and i'll delete this post and post it elsewhere\n\nTwo ish weeks ago I was walking around my school's hallways minding my own business when all of a sudden my ex bf walks out of his classroom (we shall call him Chris) and starts walking to his locker. I walk past him not wanting to do anything with him when he calls after me.\n\nChris: I know you put gum all over my locker I'm not that fucking stupid\n\nMe: I haven't talked to you in over a month why would I suddenly want to talk to you now? Leave me alone I didn't put anything on your locker.\n\nFinally, that gets him to shut up and I start to walk back to my class thinking that was the end of it.\n\nHa! Until it wasn't\n\nChris then starts telling the whole of my grade that I put chewed up gum on his locker and that I was some crazy ex gf looking for revenge. The whole rest of that week I was viewed upon as some freak for doing so when I didn't. One of his little female friends (we'll call her Heaven) came up to me and threatened to fight me if I did it again. Now, before you start commenting \"How come you didn't ignore those threats? How come you didn't tell an adult? Why didn't you just keep to yourself until the rumors died down?\"\n\nWell my fellow readers I have been doing that for the entire 1 and a half months since I broke up with my bf and I for one was looking for revenge. And how was I going to do that? By doing the thing he accused me of. Putting chewed up gum on his locker.\n\nI waited until the week after that interaction, waited till the hallway was clear no students/adults in the area were around and I took the gum out of my mouth and put it on the part of the locker where you open it and where you go to put in the combination to open up the locker.\n\nThe day after that when the bell rang to signal that the school day was over I waited by my locker since his was right across from mine and I saw the utter frustration come across his face when he saw it, gum on his locker again!\n\nIt was funny to do tbh and honestly I have no regrets since the school year for me is coming to an end.",
    "comments": [
        {
            "level": 0,
            "comment": "At least you chewed on your plan ahead of time, before you gummed up his day.",
            "score": 18,
            "author": "CoderJoe1"
        },
        {
            "level": 0,
            "comment": "ah, petty revenge - *best served chewed...*",
            "score": 9,
            "author": "Piddy3825"
        },
        {
            "level": 0,
            "comment": "You came to kick ass or chew gum. And you're all outta gum",
            "score": 5,
            "author": "H2O_life"
        }
    ]
}