{
    "id": "13cz25z",
    "score": 1990,
    "title": "A woman can't be a plumber? Find someone else.",
    "author": "uniqnorwegian",
    "date": 1683651108.0,
    "url": "https://www.reddit.com/r/pettyrevenge/comments/13cz25z",
    "media_urls": [],
    "other_urls": [],
    "postText": "This got longer than expected so TLDR at the bottom.\n\nMany moons ago I worked in construction, repairs after water and fire damage specifically.  It was my fathers company and I worked there between studies and other jobs, but I got fairly decent at the job in time, at least good enough to be trusted with managing the on-site duties for smaller jobs. We typically handle everything on the job site, including hiring third party painters, plumbers and electricians, as the jobs we took were insurance jobs.\n\nThe customer was home as I was finishing up putting down new floorboards and molding after a water leak in their kitchen due to cracked plumbing, asking questions about the job and otherwise being pleasant to be around. As I was packing down my gear the plumber we contracted arrives. I was pleasantly surprised to see that \"Helen\" was the one showing up. Having worked with her before we have a quick chat as she is grabbing what she needs from her truck. \"Helen\" was in her early twenties at this time, with a year or two on the job but is constantly praised behind her back by her coworkers for her exceptional work.\n\nI walk back into the house with her and show her the kitchen and she gets ready to do her work. I enter the living room with my broom and vacuum to clean up after myself and inform the tenant that the plumber is here and his kitchen will be fully functional once she is done.\n\n\"She? Women cant be plumbers\" he says as lets out a annoying sounding grunt. I assure him it is a she, and that she knows her stuff. He looks quizzically at me and moves to the kitchen to, I assume, confirm that is was in fact a woman. I loosely follow as I sense a situation brewing and because I am curious.\n\nIn the kitchen he lets out a disappointed \"hello?\" and after she introduces herself he asks where the \"real\" plumber is. She informs him that she is the plumber and that she will be done shortly. He refuses to believe that she is the actual plumber and asks again where the \"real\" plumber is. She gets a confused look at her face and before she has time to respond he utters \"I want a real plumber, not a little girl who cried her way to this job and will screw it up because a cute little girl like you cannot be a plumber\". She is rightfully angered by this, does not know how to respond. I step in to tell him she really is a plumber and is more than capable for a simple job like this. He still refuses to believe this and tells her to call a real plumber and orders her out of the house. She gets up and heads over to her car with tears in her eyes. I asked if she was ok, she said yes but I doubt that was true. She told me to finish up what I was doing while she called her boss. I figured she wanted to be alone a few minutes and obliged.\n\nHer boss, hearing what had happened instructed her to stay there while he came over to talk to this fine specimen of humanity. I was done with my tasks at the house and stayed to talk with her while we waited for her boss.\n\nWhen her boss came, we gave him the full story and watched him go over to the house. Their interaction took place at the front door, next to where we were parked. The owner of the house spat out \"Finally, someone who knows their stuff, right this way\" and turned around to show the location of the kitchen. Her boss just said \"No\", making the owner turn back. \"Just because she is a young woman does not mean she is not a great plumber, she is one of my best. You do not talk to any of my employees like that. We will not finish this job\".\n\nAfter that he walked back over to us and just said \"Let's go\". We all left.\n\nAs our company was project lead, we would have been the ones finding a different plumber to take the job, however my dad does not care for these kinds of disrespectful people. Once I told him about that days events, he contacted the insurance company and informed them that the customer was disrespectful to his employees and subcontractors and would no longer offer services to this customer.\n\nWe still had some carpentry work left at this mans house waiting for the electrician to finish his work which also was canceled as they were subcontracted by us and paid by us.\n\nThis meant that the insurance company had to contract a new company for project lead, which then had to contact their own subcontractors. The magnificent timing of these events meant that no one had open slots in their calendars for this job.\n\nWe have a good relationship with the insurance agents we work with, and was informed that it took a full week before this job was completed, instead of being finished the next day.\n\n&amp;#x200B;\n\n**Bonus**\n\nAbout a year later we are talking to the insurance agent on a different job, and he asks if we remember this customer. He informs us that he had a new water leak in a different section of the house. It was discovered that the plumbing work was done by one of the customers friends. In Norway plumbing (and electrical) needs to be done and documented by a licensed professional, otherwise your insurance will not be paid. As you might have guessed, his friend is not a plumber.\n\nHe had to pay the repairs of the latest damages out of pocket, and the insurance company took a new look at the first leak. It was decided that the initial water leak also did not qualify for insurance, and he had to pay back the full amount of repairs for this as well.\n\nI gave \"Helen\" a call with the fantastic news, and she was ecstatic. \n\n**TLDR;**\n\nBigoted man is refused plumbing services when he does not accept a female plumber, and has to wait another week to have his house repaired after water damages.",
    "comments": [
        {
            "level": 0,
            "comment": "I'm not a professional plumber, so excuse my ignorance but which part of the penis is used when fixing a leak?",
            "score": 443,
            "author": "LogicBalm",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm not a plumber myself, but I have worked with quite a few of them, and none of them have ever used their penis to fix a leak. \n\nJokes aside, I am definitely stealing this and adjusting it to my needs for future use.",
                    "score": 237,
                    "author": "uniqnorwegian",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They do, however, bring out the butt crack.",
                            "score": 73,
                            "author": "DTM-shift",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thankfully that's a unisex feature!",
                                    "score": 33,
                                    "author": "justveryunwell"
                                },
                                {
                                    "level": 3,
                                    "comment": "People always ask me why I got into plumbing, I tell them I have the ass for it.",
                                    "score": 17,
                                    "author": "3Sewersquirrels"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "That’s because you’ve only seen the bowdlerized version of the story about the Little Dutch Boy.",
                            "score": 8,
                            "author": "wolfie379"
                        },
                        {
                            "level": 2,
                            "comment": "Be careful with saying that nowadays though, it might be construed as “transfobic” for implying that you need a penis to be a man.",
                            "score": -24,
                            "author": "Nathan-Jacob",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Be careful, nowadays you might be construed as an asshole, Nathan-Jacob.",
                                    "score": 7,
                                    "author": "NullHypothesisProven"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Watched an interview with a woman who drives the gigantic dump trucks at a quarry. She was asked if she gets any static for being a woman doing this job. \n\nHer response was, \"I gave yet to find a machine that says 'insert penis here to operate'\".",
                    "score": 117,
                    "author": "Elendril333",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I have seen some. Of course operating them would not make a good career, as the payment would go from the penis-holder to the machine-maker, not the other way..",
                            "score": 5,
                            "author": "Petskin"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "💀 oh my, this is great!",
                    "score": 17,
                    "author": "Aiyla_Aysun"
                },
                {
                    "level": 1,
                    "comment": "Too bad it’s plumbing, not carpentry. I really wanna make a ball peen hammer joke.",
                    "score": 15,
                    "author": "Stormfeathery"
                },
                {
                    "level": 1,
                    "comment": "Have you heard of the little Dutch boy who put his finger in the dike to stop his town from flooding? It’s similar to that.",
                    "score": 12,
                    "author": "timesuck897"
                },
                {
                    "level": 1,
                    "comment": "The vasectomy",
                    "score": 8,
                    "author": "Catsscratchpost"
                },
                {
                    "level": 1,
                    "comment": "That’s what they call a stop cock.",
                    "score": 6,
                    "author": "imarealchap"
                },
                {
                    "level": 1,
                    "comment": "Holy shit this is good, I'm stealing this",
                    "score": 3,
                    "author": "Artemis-4rrow"
                },
                {
                    "level": 1,
                    "comment": "The upper-left-central-outer-bottom-right-rear part. 👍🏻",
                    "score": 3,
                    "author": "HamGoblin81"
                },
                {
                    "level": 1,
                    "comment": "the ballcock",
                    "score": 1,
                    "author": "uberdupers"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Used to work in a bank, and the sewer-lines backed up quite regularly. We had the personal number to the preferred plumber at hand, and he'd usually be there within 30 minutes. Since one of the reasons that firm got the job was that they had apprentices, he'd bring them with. The only one that could fit fully (and still work) in the hole was this skinny 16 yo girl, and she fixed more than any of the buff menfolk did just because she could get at it. Tho it was amusing to see someone hanging face down in a hole of sewer while trying to reach a certain pipe.. \n\nWe asked the plumber to hire her permanently and to bring her when we called. \n\nHe obliged and as far as I know she still works there.",
            "score": 134,
            "author": "xthatwasmex",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was going to bring up this point. My uncle is a plumber and he always complained about the hardest part being getting into tight spaces. In fact he \"I quit all that, I'm too old to be crawling under houses anymore.\" And imagine that... we small tiny women are finally not physically limited by our tiny bodies.",
                    "score": 55,
                    "author": "Fun_Toe3400",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Men and women are physically different, regardless to anyones opinions.\n\nHowever i would never call it a limitation, but rather having different advantages than men.\n\nOne large entrepeneur in my local area had several women hired for driving their large dumptrucks, and apparently the women were better for business as they drove a little bit more carefull than the men - thus saving tens of thousands each, year over year, in repairs and maintainance.",
                            "score": 23,
                            "author": "TheHingst",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I can definitely relate: I used to train city bus drivers, and by far and away the BEST were women! They rarely scratched the equipment, hardly ever heard them on the radio unless there was a mechanical issue, and were absolute masters of diffusing confrontational situations with passengers.",
                                    "score": 9,
                                    "author": "RustySax"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Also, this reminded me of a time we were out in the mountains for work and we came across some folks whose vehicle had a hose come loose... they were all trying to get at it to reattach and my smaller fingers saved the day. Super satisfying.",
                    "score": 23,
                    "author": "Fun_Toe3400"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I bet the asshat still thinks he was right.",
            "score": 650,
            "author": "CoderJoe1",
            "replies": [
                {
                    "level": 1,
                    "comment": "I bet he blames all the damage on Helen, and thinks the only reason it wasn't worse was because he had the presence of mind to stop her before she could screw anything else up.",
                    "score": 293,
                    "author": "farting_contest",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "“It’s that little girl’s fault. She cried to get this job stopped just like she cried her way into this job”\n- Customer, probably",
                            "score": 111,
                            "author": "UniqueUsername2123"
                        },
                        {
                            "level": 2,
                            "comment": "Obviously her ovaries escaped and rampaged through the pipes of the house wreaking havoc the entire way through.\n\nWimmen, amirite?",
                            "score": 20,
                            "author": "Stormfeathery"
                        },
                        {
                            "level": 2,
                            "comment": "Pity no one had e presence of mind to start educating the man.\n\nEdit: Guys, I meant the man's parents, not the people in the story.",
                            "score": 59,
                            "author": "Tia_Mariana",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Can't teach a dumbass.",
                                    "score": 30,
                                    "author": "anomalous_cowherd",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "True, friend.",
                                            "score": 9,
                                            "author": "Tia_Mariana"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "\"Stupid is as stupid does\"",
                                    "score": 20,
                                    "author": "Haunting-Contact-72"
                                },
                                {
                                    "level": 3,
                                    "comment": "They did try. Repeatedly. \n\nOr did you think they should have continued to make themselves nuts talking to a bigot?",
                                    "score": 7,
                                    "author": "sybann",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I was talking about the parents",
                                            "score": 9,
                                            "author": "Tia_Mariana",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Parents are usually the responsible party - so they did - they taught him what they believed. Sadly.",
                                                    "score": 9,
                                                    "author": "sybann"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt;Edit: Guys, I meant the man's parents, not the people in the story.\n\nThat's not clear at all from your original comment. How was anybody supposed to deduce that?",
                                    "score": 2,
                                    "author": "bjandrus"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "He was a manly man. He should have been able to do his own plumbing. /s",
                    "score": 40,
                    "author": "JoKing1230",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It seems that he believed so as well. Wrongly.\n\n\"It was this other guy, not me\" must be the oldest excuse..",
                            "score": 2,
                            "author": "Petskin"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Good on the boss for standing up for his employee. The client is lucky he didn’t get his ass kicked . If a woman wants to work in the trades let her. Women are tough people. I’m glad that karma came back to bite that guy in the ass .",
            "score": 92,
            "author": "JPShadows",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah I feel like the whole fact that most difficult trades are male-dominated should make most people even more impressed by the ladies who do them. Doesn’t make much sense otherwise",
                    "score": 42,
                    "author": "sweetiepotpie",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I can only speak for the trades that I've worked around in a specific region, but I feel like the male dominance of these fields has a lot more to do with nepotism and the passing of the torch from fathers/uncles to sons/nephews than it does with a woman's ability to do the work. Anyone of any gender working in a trade deserves a lot more respect than I feel like we get.",
                            "score": 36,
                            "author": "Hrothgar0144",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That’s a really good point!",
                                    "score": 13,
                                    "author": "sweetiepotpie"
                                },
                                {
                                    "level": 3,
                                    "comment": "How many women do you know that actually want to do this type of physical labor for a living? That’s the main reason.",
                                    "score": -13,
                                    "author": "Nathan-Jacob",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "How many men do it because they actually want to?",
                                            "score": 6,
                                            "author": "Optical_inversion"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Your trolling attempts are bad and you should feel bad. Get the *real* troll here. I bet you cried your way into this!",
                                            "score": 1,
                                            "author": "Speciesunkn0wn"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I work part-time at a regional airport in the PNW. You'd be surprised at how many female First Officers and Captains I see every day working for the five major US airlines, and the trend is growing. Interestingly, what's also growing is the number of men working now as flight attendants!",
                            "score": 3,
                            "author": "RustySax"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I heard a woman truck driver talking the other day about what it was like when she started and the shit she got.  She said \"they were scared.  They were scared of women joining the work force because women work harder than men do\".  Damn right.",
                    "score": 5,
                    "author": "keladry12"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My fiancée is a journeyman plumber and he says that one of the best in his apprenticeship classes was this bad-ass girl named M. I love that the PM and Insurance backed her up!!!",
            "score": 64,
            "author": "JadedPhoenix80"
        },
        {
            "level": 0,
            "comment": "As someone whose daughter is a licensed plumber this is an awesome story.",
            "score": 58,
            "author": "fvanandel"
        },
        {
            "level": 0,
            "comment": "Oh I fully understand the frustration! My mother is a licensed electrician. She tried to have her license accepted in Norway when we moved here from Spain. In the office they not only told her that \"women can't be electricians\" they also called all their colleagues out front because they had never seen a woman who studied to become an electrician and gotten a license, like she was a monkey in a circus.",
            "score": 58,
            "author": "Elementiia",
            "replies": [
                {
                    "level": 1,
                    "comment": "My electrician is a woman and is a master electrician.",
                    "score": 10,
                    "author": "Purple_Cheetah1619"
                },
                {
                    "level": 1,
                    "comment": "Lol, what? When did you move here, the 70s?\n\nI've met many female electricians here over the years.",
                    "score": 9,
                    "author": "TheHingst",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sadly no, it was 2009...",
                            "score": 4,
                            "author": "Elementiia"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I love this! I’m a woman and look young for my age… I work in IT. The amount of assholes I’ve came across has been astonishing. So proud of the employer for standing up to this nonsense",
            "score": 42,
            "author": "Sea-Idea-4677",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm sure you have heard \"I want to talk to someone who knows what they are talking about\" a few times.\n\nAfter finishing my education within IT, all of the women I have worked with have heard that phrase (even the accountants for some reason). As someone else mentioned in a different comment here \"I'm not a professional plumber, so excuse my ignorance but which part of the penis is used when fixing a leak?\" and that is now my go to for any asshole that thinks having a penis makes you better at a job.",
                    "score": 48,
                    "author": "uniqnorwegian",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I feel like the kinda folks who would make that comment are the same ones who'd struggle with refresh and \"try turning it off and on.\"",
                            "score": 17,
                            "author": "Fun_Toe3400"
                        },
                        {
                            "level": 2,
                            "comment": "Be careful with saying that nowadays though, it might be construed as “transfobic” for implying that you need a penis to be a man.",
                            "score": -6,
                            "author": "Nathan-Jacob",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The Venn diagram of people who believe women are inherently incapable of working in the skilled trades, and people who wouldn’t complain on hearing such a remark because they’re transphobic, is a circle.",
                                    "score": 6,
                                    "author": "wolfie379"
                                },
                                {
                                    "level": 3,
                                    "comment": "Do you really have nothing better to say? Just scrolling through the comments so you can copy and paste that over and over?",
                                    "score": 1,
                                    "author": "Speciesunkn0wn"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "oh i feel you , electrical engineer here. I have been confused with the secretary of my boss more times that i would like, customers ask me for coffee, they want me to take notes etc, for some reason my boss finds this very amusing and he always makes a big deal about revealing that I am the only engineer to answer their question and they just confused me with a secretary(nothing wrong with secretaries). He laugh about it until he is red in his face",
                    "score": 2,
                    "author": "laura_lmaxi"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Norwegian female carpenter here. Love to educate the manly men about power tools an how not to use them",
            "score": 30,
            "author": "KristineBjo"
        },
        {
            "level": 0,
            "comment": "I love this story--especially about the project manager sticking up for Helen. It's even better that the homeowner's own rotten attitude cost him time and money twice. Hopefully he's learned his lesson.",
            "score": 26,
            "author": "Not_A_Bimbo"
        },
        {
            "level": 0,
            "comment": "With plumbers availability these days, I’d gladly welcome a giraffe in my house if the boss tells me it knows its shit",
            "score": 24,
            "author": "probablynotmine",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yo. Same.",
                    "score": 10,
                    "author": "Fun_Toe3400"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not a plumber but some of my top workers on my latest electrical project have been women.",
            "score": 23,
            "author": "FoodForTheEagle"
        },
        {
            "level": 0,
            "comment": "After a lifetime of these kinda issues, I still can't find a tool that requires a penis to operate",
            "score": 18,
            "author": "Wildgeek81",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hmmm. The lonely Island's mothers day gifts would not really work without one.\n\nHehe, gottem!",
                    "score": 3,
                    "author": "TheHingst"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I love good and sensible men, I love women proficient at their job. Everyone in this story but the customer was excellent. Thank you",
            "score": 14,
            "author": "Accurate_Prompt_2271"
        },
        {
            "level": 0,
            "comment": "Ahhh that was satisfying",
            "score": 17,
            "author": "Ceecee_soup"
        },
        {
            "level": 0,
            "comment": "My buddy works construction and he’s seen this happen to his female coworkers. But when a customer pulls what this guy did, you have the rest of crew ready to do battle. His boss and wife team that are well-respected. Both are a force to be reckoned with and they have no tolerance for this behavior. His daughter is a chip off the old block and will take employee harassment seriously, pull this and you may find yourself with no one to fix or build your shit. She’ll tell the surrounding companies about bad customers, so sometimes everyone is just too busy.\nI love that her boss and your dad had her back! That’s always a good feeling when you have back up.",
            "score": 13,
            "author": "Sailing_Away123",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;She’ll tell the surrounding companies about bad customers\n\nFuck. Yes.",
                    "score": 9,
                    "author": "MplsLawyerAuntie",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah I’ve met his bosses and their daughter. She’s savage and I love it. She handles sexist A holes so well. The bosses don’t take just any job - they care more about their employees than the money. They’re very involved. My friend has been with them for 15 years and doesn’t plan on leaving anytime soon. He’s now a foreman and one thing he loves is if a worker says something like “hey my wife/husband is sick, I need to stay home with the kids”/“I need to leave a little early to pick up kids/take xyz to an appt.” Etc. they get the time off. If they’re interested in taking a class; they work with them to come up with a schedule.",
                            "score": 2,
                            "author": "Sailing_Away123"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have a female friend, Mary, who used to work at Home Depot.  She approached a customer who had some questions.  When he saw her, he said he needed a guy to help him, because surely she couldn't know enough about it.  She said, \"OK\", and went to get a guy.  When the man asked his questions, the guy said, \"Wait here, I need to go ask Mary\".",
            "score": 14,
            "author": "sanna43",
            "replies": [
                {
                    "level": 1,
                    "comment": "My 4'11 Italian spitfire aunt was once the manager of the entire electrical department at Home Depot. It was so funny watching her deal with these guys. She was also a ham radio operator, and once led the first all-female radio communications team on the Arco ships. She was quite a character.",
                    "score": 10,
                    "author": "LadyA052"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I work in an industry too where women get looked down on and it annoys me. \n\n\nLike once I was told to show one of my superiors on how to do an oil change. I thought he was messing with me and so we went out and asked \"You're a higher rank, how have you not done an oil change!?\" She explained that in training she was told by her male classmates that she couldn't do it because she was a woman or they did it behind her back. \n\n\nThat really pissed me off, so I walked her through step by step but informed her \"Once I shown you, I want you to do the next filter.\" Because that's how we learn as people. \n\nShe did the task as per requirement and I was proud of her. Because I know now if she needed to do an oil change by God she can do it. \n\nQuickest way to make me mad was \"can't do this task because I'm a woman.\" In the trade skills and industrial arts. My mom can drive a Semi so can you, my coworker can wire up machinery so can you. Never doubt yourself because some pinecone says so.",
            "score": 13,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "lol this reads as so aggressively supportive i love it ❤️ “u can’t do it bc ur a woman? bullshit, my grandma can do this and so can u, now change that oil and believe in urself dammit!”",
                    "score": 4,
                    "author": "Feisty-Mushroom-7060"
                },
                {
                    "level": 1,
                    "comment": "&gt;Never doubt yourself because some pinecone says so.\n\nI'm printing this for my desk.",
                    "score": 3,
                    "author": "Optimal-Shallot-3118"
                }
            ]
        },
        {
            "level": 0,
            "comment": "the customer is so ridiculous he couldn’t trust a professional plumber just because of her genitalia but he trusted a non-professional that could have easily done more damage. the logic bigots have is such a mystery.",
            "score": 13,
            "author": "Fluffy_Schedule_6859"
        },
        {
            "level": 0,
            "comment": "Beautiful! Honestly, I wish more plumbers and tradespeople I worked with were women. I hate having strangers in my home to begin with, if they were women or nonbinary etc folks, I'd be far less reluctant to call them in.",
            "score": 11,
            "author": "Wordnerdinthecity"
        },
        {
            "level": 0,
            "comment": "I like how this turned out. And it was nice to share your smug satisfaction with Helen.",
            "score": 12,
            "author": "LibraryMouse4321"
        },
        {
            "level": 0,
            "comment": "The reason women can't be plumbers is that they don't have the required hairy buttcracks that can be displayed by a too low and wide set of pants and poorly adjusted belt.   \n\n/s    \n\nAlso, here in Norway we have rules about training to become a plumber. It's not enough to have a rusty old van and a fat ass to become one. Any plumber that shows up alone very probably knows what she's doing.",
            "score": 12,
            "author": "Gadgetman_1"
        },
        {
            "level": 0,
            "comment": "This is beautiful.",
            "score": 8,
            "author": "ThisFatGirlRuns"
        },
        {
            "level": 0,
            "comment": "Outstanding. Bosses take notice.",
            "score": 9,
            "author": "racerdeth"
        },
        {
            "level": 0,
            "comment": "Doggone those silly biases!",
            "score": 8,
            "author": "groovymama98"
        },
        {
            "level": 0,
            "comment": "Go Norway! A very satisfying ending indeed.",
            "score": 9,
            "author": "PGLBK"
        },
        {
            "level": 0,
            "comment": "I'll bet this air-thief used to cringe in Josephine the Plumber days.",
            "score": 7,
            "author": "oldncreaky2"
        },
        {
            "level": 0,
            "comment": "I never knew a penis was a prerequisite to hold a wrench. Is it the penis that does all the work or just holds all the knowledge 🤔",
            "score": 6,
            "author": "PositiveMortgage6910"
        },
        {
            "level": 0,
            "comment": "This is so satisfying. As an older disabled person, I've been disrespected many times in life because of the wheelchair I use. Recently have had several folks over to the house to help me move my office and work room into the garage. Not one person who helped was male.\n\nUs women got the work done, and I'm much happier with more room than I have had for an office before. Everything from electrical to my coffee station has been set up logically and with great care. I can use my wheelchair through the whole office and not have any problems. \n\nThe sole male who tried to help? He put so many things where I can't get to them or work with them, that he was chased out of the garage shortly. He and I have been married since 2005.",
            "score": 7,
            "author": "louiseannbenjamin"
        },
        {
            "level": 0,
            "comment": "What a beautiful ending!",
            "score": 6,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "This was highly amusing.  Thank you.",
            "score": 5,
            "author": "Cold-Bug-4873"
        },
        {
            "level": 0,
            "comment": "I have worked in the tradesfor a number of years, I'd consider myself a bit of a \"traditional masculine man\" - in this situation, if I was the boss, I would actively try to convince the insurance company that the customer had refused the work-order and thus by own decision rejected the insurance payment.\n\n&amp;#x200B;\n\nNo one disrespect my collegues (or as a boss, my employees), period.\n\nTheir gender is completely irrelevant to their level of competency.",
            "score": 7,
            "author": "Bob-son-of-Bob"
        },
        {
            "level": 0,
            "comment": "&gt; She gets up and heads over to her car with tears in her eyes.  \n\nI was really doubting this happened, but then saw that the story takes place in **Norway**, where women are probably treated with more respect. \n\nIn the US, if you are a woman in the trades, you have to develop a thick skin, not for angry clients, but for \\[male\\] coworkers who can be brutal.",
            "score": 15,
            "author": "Ex-zaviera",
            "replies": [
                {
                    "level": 1,
                    "comment": "Tbf, even in the US, that’s, like, a pretty egregious example, it sounds like she’s quite young yet, and hell anyone can go into something like that on a rough day and take it harder than they otherwise would. …All that said, I too paused at that part. ;)",
                    "score": 4,
                    "author": "MplsLawyerAuntie"
                }
            ]
        },
        {
            "level": 0,
            "comment": "OK, so his male friend did his plumbing and fucked it up like it was his job, because it wasn't his job. But better another who-fucking-knows dude than a known competent woman to fix the first dick bucket's shit work. BRILLIANT!",
            "score": 5,
            "author": "sixup604"
        },
        {
            "level": 0,
            "comment": "I used to fix radars on ships, and often times I was the one of the few techs who could squeeze behind the metal casings because it required someone skinny and short.   I never experienced sexism on the boats, but off the boats… I guess I was fair game. \n\nPeople are super weird about gender, as if their whole personality is wrapped up in being associated with a certain group… those people are bores anyway… so no loss cutting them out of my life.",
            "score": 5,
            "author": "IrreverantBard"
        },
        {
            "level": 0,
            "comment": "I’m an electrician, and I’m also a woman. Stories like this (with an ending like this) feed my soul.",
            "score": 3,
            "author": "silvurgrin"
        },
        {
            "level": 0,
            "comment": "Well this was satisfying",
            "score": 2,
            "author": "snekks_inmaboot"
        },
        {
            "level": 0,
            "comment": "As a fan  of old movies, that customer needs a copy of \"Cluny Brown.\"",
            "score": 1,
            "author": "Eugenefemme"
        },
        {
            "level": 0,
            "comment": "That is fantastic.  Good for your boss for standing up to the idiot.",
            "score": 1,
            "author": "Revelation2217"
        }
    ]
}