{
    "id": "13e2125",
    "score": 286,
    "title": "Repaying Rudeness with Rudeness",
    "author": "beautyofdeduction",
    "date": 1683750052.0,
    "url": "https://www.reddit.com/r/pettyrevenge/comments/13e2125",
    "media_urls": [],
    "other_urls": [],
    "postText": "There is this front desk lady at my local library who is always so rude and lazy. She would cut me off mid-sentence when I ask a question. She implied that I stole someone else's on-hold book. She always had a nasty tone. After several unpleasant exchanges, I made a point to always let her check out my books, without ever thanking her. Even better, if her coworker is next to her, I say something nice to the coworker without even acknowledging her. I hope this drives her nuts.\n\nSome say kill rudeness with kindness. But it simply doesn't work on some people, who confuse kindness with weakness, and take advantage of it. I say give them 3 chances, then make them feel absolutely worthless.\n\n&amp;#x200B;\n\nEdit: typo",
    "comments": [
        {
            "level": 0,
            "comment": "I 100% agree!!!! I do like the 3 chances method. I think I will try this in the future.",
            "score": 18,
            "author": "workdistraction4me",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah for those 3 chances I try to be as kind and courteous as possible, and really give them the benefit of the doubt. If they still messed up all 3 then I can't say the petty revenge weighs too heavily on my conscience.",
                    "score": 17,
                    "author": "beautyofdeduction",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "3 strikes and you're out in most games and that kind of rudeness is just playing a power play game. Insecure, unhappy and the only joy she has in her life is trying to make other people feel bad. Pretty pathetic actually",
                            "score": 5,
                            "author": "Auntienursey"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "How do you steal an on-hold? The librarians are supposed to keep them out of circulation - literally, \"hold\" them off the shelves - until the requester comes for it\n\nIf an on-hold book somehow goes out to the wrong person, that's the fault of the librarian.",
            "score": 85,
            "author": "Slackingatmyjob",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;How do you steal an on-hold?\n\nIn my local library all the on-hold books are on a specially marked public shelf and you get your own book.  As far as I know there's no way to prevent someone from taking a book reserved in somebody else's name.",
                    "score": 38,
                    "author": "Esau2020",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "In YOUR library. Not ALL libraries.",
                            "score": -24,
                            "author": "Any_Significance_729",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "In every library I've been in across three continents, anyway.\n\nAnd I'm a librarian.\n\nSo it's quite common.",
                                    "score": 17,
                                    "author": "TA-Sentinels2022"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 40,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Unfortunately your content has been removed as it breaks the Reddit Content Policy. See https://reddit.com/rules for more.",
                            "score": 1,
                            "author": "pettyrevenge-ModTeam"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Assholes hope you will be the bigger person so there are no reprocussions to their actions.",
            "score": 13,
            "author": "Luke1521",
            "replies": [
                {
                    "level": 1,
                    "comment": "This \\^. I'm sure chatgpt would've advised me to \"practice empathy\".",
                    "score": 2,
                    "author": "beautyofdeduction"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Personally I don’t think ignoring her is being rude to her. At least not the same kind of rude she’s being.",
            "score": 8,
            "author": "II-leto"
        },
        {
            "level": 0,
            "comment": "I am polite and personable to everyone, if you can't do the same I can't continue. We owe each other courtesy to the degree it is returned. I can't remember who the quote is from \"courtesy is a social lubricant, it keeps us from having to kill each other\".",
            "score": 9,
            "author": "Character-Date-5999",
            "replies": [
                {
                    "level": 1,
                    "comment": "Like Stephen King wrote in The Stand, \"Humans are social animals, total isolation kills us. If we are together, we kill each other.\"",
                    "score": 5,
                    "author": "beautyofdeduction"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The library is supposed to be a wonderful place.",
            "score": 6,
            "author": "LMPS91",
            "replies": [
                {
                    "level": 1,
                    "comment": "I used to think heaven would look like a library. I don't know what changed though. Some things just feel... less wonderful after covid.",
                    "score": 6,
                    "author": "beautyofdeduction",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I miss the library where I lived prior to Covid: it was quiet, people were polite, workers genuinely happy (even a little low-key excited) to help, the “no phones in use beyond the vestibule” rule effectively enforced.  It was bliss.  \nThen the pandemic happened, it temporarily closed, then I moved to a different town that is more affluent and has one of the highest percentage of college grads per capita in Illinois, so - arguably better educated.  \nThe library might as well be Union Station at afternoon rush.  Nobody talks quietly, children shrieking and running around- not just in the children’s library either - phone yakkers in the stacks, employees loudly discussing their own thing at the desk, and not really a great selection.  \nNow, I pre-order books and pick them up (we have the self-serve reserve shelves as well) and get the heck out.  I don’t know if this library has always been like this or if it’s more post-covid cluelessness I observe elsewhere, but the library is not my happy place any longer.",
                            "score": 2,
                            "author": "WillDupage",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm so sorry to hear your loss. Sometimes big-city folks aren't as considerate as those living in smaller towns.\n\nThe deterioration happened to the very same library that I'd been going to for 20 years. Nowadays there are teenagers socializing loudly in the Quiet study areas. To them, \"quiet\" probably means quieter than their usual demeanor (i.e. shrieking and guffawing). So talking like normal adults absolutely counts as being \"quiet\". Every word is audible even if one sits at the other end of the floor. Since there are hundreds of them, the entire 6-floor library hums with their noise. I wish these teenagers would just lift their heads out of their own asses and look around once in a while.\n\nThe library staffs ignore this entirely.",
                                    "score": 1,
                                    "author": "beautyofdeduction"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Have you considered reporting her to her superiors? If she’s library director, I believe the library board is her boss.",
            "score": 4,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "In the past, I reported a much more severe incident with another staff member to the library manager, who just brushed it off. Then I escalated to the library director, who also brushed it off. I wonder how far I have to go before someone gives a damn. Maybe capturing the interaction and posting it on social is the only way to shame them into action. But I got too tired of it because this library is poorly managed in general. Retaliating against this lady was instant gratification, albeit petty.",
                    "score": 8,
                    "author": "beautyofdeduction",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Add them to the complaint, and keep going up the chain, until they all get their butts kicked.",
                            "score": 5,
                            "author": "AJRimmer1971",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And when it turns out that none of them give a shit?\n\nNowadays more often then not you have to record and post to social media if you want anything done about it.",
                                    "score": 3,
                                    "author": "Crayzeemike"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Honestly, OP, I think ignoring her is too subtle. She doesn't seem like the kind of person who'd notice or care that you aren't speaking to her. You might try saying to the nice librarian, \"It's so nice to deal with someone who's professional AND friendly,\" but again, she may not pick up on this.\n\nPosting a complaint to the library’s social media page might get results. So would contacting the library board president. Either way, make sure you point out that these days it's especially important that libraries are welcoming places so that patrons will return.",
            "score": 3,
            "author": "bambina821",
            "replies": [
                {
                    "level": 1,
                    "comment": "Posting on library SM or some local group may bring more people who had similar experiences.",
                    "score": 3,
                    "author": "IShouldbeNoirPI"
                },
                {
                    "level": 1,
                    "comment": "Good idea. I'll look into this. She does seem to be the type of person to ignore everybody around her. I wouldn't be surprised if her ears literally close off to any sound that's not her own voice.",
                    "score": 2,
                    "author": "beautyofdeduction"
                }
            ]
        },
        {
            "level": 0,
            "comment": "&amp;#x200B;\n\nhttps://preview.redd.it/s3qhdbx9h7za1.png?width=1280&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=ba47eb4ad576b6130ff26cc3220785e918e82f2b",
            "score": 2,
            "author": "HouseNumb3rs"
        },
        {
            "level": 0,
            "comment": "3 strikes and you’re out, this is what I do with my regular customers. I make a point to drastically change my persona with a friendly customer next in line after serving one of my rude ones. \nI hope it shows that you really do get what you give out",
            "score": 2,
            "author": "FaithlessnessGold273",
            "replies": [
                {
                    "level": 1,
                    "comment": "I've also noticed had some cashiers be absolutely wonderful with the person before me, and as soon as I said hello, her face dropped to a stone-cold b\\*tch face. I have no idea why this happens. Or she had a \"friendliness quota\" that had just run out. It felt precarious. Honestly it hurts a little. On my emotionally weak days, I try avoiding customer service folks altogether.",
                    "score": 1,
                    "author": "beautyofdeduction",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh no yeah that’s not on. No when I say rude I mean people with mad DISRESPECT and plain rudeness to me in past times (3 strikes and you’re out)",
                            "score": 1,
                            "author": "FaithlessnessGold273",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Right I see your point. Hey I was thinking, since you know what it's like to be a waitress, could you help shed some light on why I was treated by some waitresses that way? For a while, I literally had anxiety about going to restaurants alone because of that. Thanks!",
                                    "score": 1,
                                    "author": "beautyofdeduction",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Lol! I’m a dude and I work in sainsburys local. Anywho- sorry they treated you like that I wouldn’t appreciate that either. I suppose people in customer service do just pick customers they love and see lots and be very chipper with them but then just reflect there bored (at work) mood on the rest of their customers.",
                                            "score": 2,
                                            "author": "FaithlessnessGold273",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Ah apologies for the gender bias! Thanks.",
                                                    "score": 1,
                                                    "author": "beautyofdeduction",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "No worries my friend",
                                                            "score": 2,
                                                            "author": "FaithlessnessGold273"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}