{
    "id": "13rsnak",
    "score": 4954,
    "title": "i got my bully un accepted from Sixth form",
    "author": "mximmcff",
    "date": 1685047116.0,
    "url": "https://www.reddit.com/r/pettyrevenge/comments/13rsnak",
    "media_urls": [],
    "other_urls": [],
    "postText": "so, i have tourette's. it sucks. i often get bad stuff said to me, especially by this one girl. she has been harassing me for months now but today she followed me home screaming the R-slur at me. i started recording it and emailed it to her mom, dad, our headmaster, our schools SENCO leader and the head of our sixth form. there is a strict policy at my school that means no ableism, homophobia, racism or anything of the sort. and since we only have a month and a half left, her acceptance letter has been revoked, it has been placed on her permanent record and she now cannot apply anywhere else she would want to go since the application date is out for most sixth forms within an hour drive of where we live. jokes on her",
    "comments": [
        {
            "level": 0,
            "comment": "I don't find this petty at all. I think you did the right thing, 1000%.",
            "score": 1967,
            "author": "perpetualprocrasti",
            "replies": [
                {
                    "level": 1,
                    "comment": "This was more like righteous revenge. And she did the bully a favour too. It's astounding how many people make it to adulthood but are still unable to carefully consider consequences before acting",
                    "score": 699,
                    "author": "indeterminate_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Talk shit, get hit (with the consequences).",
                            "score": 206,
                            "author": "CanuckPanda",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "ooooo love that",
                                    "score": 26,
                                    "author": "Ok-Warthog-9991",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Sweet justice! She deserved it! You play stupid games you win stupid prizes.\n\nI wish I could just see her reaction.",
                                            "score": 25,
                                            "author": "Apart_Foundation1702"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Chat shit, get banged (to rights)",
                                    "score": 10,
                                    "author": "FALLASLEEP4EVER",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yup. What people need to understand is that these bullies grow up to be people like the HR director at my last job, who encouraged my direct supervisors to criticize me for tiny mistakes and harass me until I quit.",
                            "score": 35,
                            "author": "knittorney",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "find out where it lives? Take it from there.",
                                    "score": 7,
                                    "author": "Tall-Psychology7593",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Hahaha. I like the cut of your jib, fellow chaotic good, but I think I can win this one as lawful good.",
                                            "score": 6,
                                            "author": "knittorney",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You go my man! Sometimes we all miss the obvious.",
                                                    "score": 7,
                                                    "author": "Tall-Psychology7593"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Nothing petty here - just the consequences of their own actions coming back to bite them in the ass.  Good work standing up for yourself!",
            "score": 340,
            "author": "chunkus_grumpus",
            "replies": [
                {
                    "level": 1,
                    "comment": "As a teacher who used to work in a school where similar shit used to happen all too often and nothing got done about it, I absolutely applaud OP’s actions.",
                    "score": 33,
                    "author": "RufusBowland"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Girl got herself unaccepted",
            "score": 229,
            "author": "Sad-Bicycle-1861",
            "replies": [
                {
                    "level": 1,
                    "comment": "Exactly, she brought the consequences upon herself. I'll bet her parents/family were pissed.",
                    "score": 79,
                    "author": "McDWarner",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Bet her parents were pissed she got in trouble, but plenty of bullies learn it at home...not saying thats 100% the case here, but there is at the least a 50% chance.",
                            "score": 20,
                            "author": "Swiss_Miss_77",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I didn't think about that. That really sucks.",
                                    "score": 6,
                                    "author": "McDWarner",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Every criminal behavior can be traced back to poor parenting but we don't let criminals off the hook because they were brought up the wrong way. I feel bad for bullies who are bullied at home but the rest of society shouldn't have to suffer because somebody bullies their child.\n\nThat said, it's be great if social services would drop in at a bully's home and conduct an extensive interview with everyone as soon as the bully is reported.",
                                            "score": 3,
                                            "author": "azrael269"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Well, her behavior was unacceptable.",
                    "score": 17,
                    "author": "ElectronicKangaroo41"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Check and Mate. 👏🏾",
            "score": 717,
            "author": "drbombay24",
            "replies": [
                {
                    "level": 1,
                    "comment": "Happy cake day! :D",
                    "score": 53,
                    "author": "EnderTheBender64"
                },
                {
                    "level": 1,
                    "comment": "Happy Cake day!🍰🎂",
                    "score": 34,
                    "author": "rainspots"
                },
                {
                    "level": 1,
                    "comment": "Happy cakeeee dayÿyyyy",
                    "score": 8,
                    "author": "EclecticPhotos"
                },
                {
                    "level": 1,
                    "comment": "Happy cake day!!",
                    "score": 4,
                    "author": "Dmnc_Ktn666"
                },
                {
                    "level": 1,
                    "comment": "Happy happy happy cake day!!!",
                    "score": 1,
                    "author": "shmick023"
                },
                {
                    "level": 1,
                    "comment": "Happy cake day!",
                    "score": 2,
                    "author": "Jinxedcross"
                }
            ]
        },
        {
            "level": 0,
            "comment": "She did the crime so has to accept the Karma",
            "score": 609,
            "author": "kiwimuz",
            "replies": [
                {
                    "level": 1,
                    "comment": "speaking of karma, you get an upvote OP",
                    "score": 78,
                    "author": "qwertyjgly",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Karma all around!!!!",
                            "score": 29,
                            "author": "Buddha176"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "More than worth it IMHO",
            "score": 205,
            "author": "sneakyfattwatbadger"
        },
        {
            "level": 0,
            "comment": "&lt;insert permanent record joke here&gt;",
            "score": 37,
            "author": "CoderJoe1",
            "replies": [
                {
                    "level": 1,
                    "comment": "&lt;insert laughing emoji here&gt;",
                    "score": 17,
                    "author": "1boss_hog1"
                },
                {
                    "level": 1,
                    "comment": "Alexa, play Kiss Off by The Violent Femmes",
                    "score": 5,
                    "author": "TripleFFF",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh yeaaah?",
                            "score": 3,
                            "author": "duck-duck--grayduck"
                        },
                        {
                            "level": 2,
                            "comment": "Just saw them in concert last October. Still as amazing as ever!",
                            "score": 3,
                            "author": "purrfunctory",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "good to know they are still touring!",
                                    "score": 3,
                                    "author": "mekareami",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "They said it was the final tour but they also said that five tours ago, so I’m not sure if they’re telling the truth this time. \n\nIt was wild, friend. I remember the way we all wore torn denim and falling apart jeans, a beautiful palette of blacks and grays with dark flannel. Or the leather, fishnets, tiny skirts and the spiked hair. \n\nNot anymore. Most people were business casual. There were.. *khakis* and pressed button down shirts. I had the only blue hair in the room *that wasn’t natural old lady blue* and the only hair that was not a normal, naturally occurring color in nature! \n\nFriend. I am pushing *fifty* and was the only one dressed in my go to concert clothes, minus the Doc Martin’s bc my feet are too twisted to wear them. (Side effect of the paralysis). No one moshed. No one even stood up. Songs were given *polite applause* and not the screams and whistles and yells they used to get. \n\nThe only song that got an ovation was the last one. And no one stood and cheered for an encore. The guys said they’d be back in five and *everyone just stood around waiting* instead of being friendly and rowdy. \n\nI know I’m pushing 50. I know the crowd for VF skews older. But damn, that audience was boring. The show? Amazing. I have no idea how the band could be so energetic and wild when the audience was lukewarm at best. Ugh. \n\nI got a lot of shushes and dirty looks for hooting and clapping really loudly. It made me laugh that the people who used to devotedly follow an *acoustic* **punk** *band* and were fan enough to come see them 42 years after the first album was released…shushed me. For enjoying the concert. ¯\\_(ツ)_/¯",
                                            "score": 3,
                                            "author": "purrfunctory",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Wow, there was quite the mix at sisters of mercy of folks dressed proper goth and ones that dressed for comfort. There was plenty of screaming and stomping. Thanks for the rundown of the experience :)",
                                                    "score": 2,
                                                    "author": "mekareami"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Sounds like the tickets cost too much :( Same happened when I saw Ozzy, moshpit tickets are now *Diamond Class* and the front row was *seated*. Booooo.",
                                                    "score": 2,
                                                    "author": "TripleFFF",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[https://youtu.be/dQw4w9WgXcQ](https://youtu.be/dQw4w9WgXcQ)",
                    "score": 0,
                    "author": "purgruv"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Excellent",
            "score": 30,
            "author": "coffeesandcartwheels"
        },
        {
            "level": 0,
            "comment": "Sorry, American here. What is sixth form?",
            "score": 259,
            "author": "bluecollarNH",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s sort of like the last year of high school, but it’s particularly for university preparation.",
                    "score": 336,
                    "author": "KaleidoscopeKey1355",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh right on. You put her right in her place then, good for you!",
                            "score": 164,
                            "author": "bluecollarNH",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Just so you know, I am not OP.",
                                    "score": 5,
                                    "author": "KaleidoscopeKey1355"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thank you for asking!!",
                    "score": 36,
                    "author": "well_that_sucks_85",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you for thanking them!",
                            "score": 7,
                            "author": "Snapsick"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "In England and Wales (Not sure about Scotland and N. Ireland) you leave school at 16. After that, the general options are get a job, go to \"sixth form\" at your school to do another two years of school work or go to \"college\" to do two years of education in a more specialised subject.In my case, I went to college to study electrical and mechanical engineering for two years. When I went to university (This is what you'd call \"college\") at 18 to study aerospace engineering I was the only kid who'd done the college/engineering route - nearly everyone else had studied maths and physics indepth at sixth form.We quickly all realised that both paths had benefits - they all excelled at engineering mathematics (Which is a HUGE part of engineering) whilst I struggled but I could already use a lathe and milling machine and understood basic electronics and materials science..",
                    "score": 20,
                    "author": "bambonie11"
                },
                {
                    "level": 1,
                    "comment": "Basically grades 11 and 12. It used to be “after the non-academic students left” (so much better) but no longer.",
                    "score": 62,
                    "author": "djdaedalus42",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So, like the OWLs and NEWTS?",
                            "score": 82,
                            "author": "WumpusFails",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Where do you think the inspiration came from?",
                                    "score": 66,
                                    "author": "djdaedalus42"
                                },
                                {
                                    "level": 3,
                                    "comment": "I hate that harry potter is your only reference point, but yes it's the newt level. GSCE is the year before sixth form and used to be called O-level a long time ago, whence OWL. Currently you do A-levels in sixth form.\n\nThe system's different in Scotland (and has changed multiple times since I left school in 2005), our sixth form is only one year and it's not in a separate college from our high school. But it's optional. We do highers in the fifth form and then Advanced Highers in the sixth form which i think are like AP classes? slightly harder than A-levels? it gets confusing if you try to compare. Also our sixth form is literally the sixth year of high school, in England it goes like year 11, then sixth form which is two years and it doesn't make sense to me.",
                                    "score": 52,
                                    "author": "cmzraxsn",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "ah that’s interesting i’m currently based in Wales and I believe most people here go to colleges compared to ‘sixth forms’",
                                            "score": 9,
                                            "author": "zia_zhang",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah, they’re closing and merging a lot of schools here and making 6th form colleges a separate thing.",
                                                    "score": 4,
                                                    "author": "Abjam_Gabriel"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "In England you get the choice of 6th form, a 6th form college or college (that’s the choice where I’m from in England lol) and in college you can do BTECs and now what they call T-levels and you can still go to university from it.",
                                            "score": 4,
                                            "author": "Ok_Astronomer_1011",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Hang on, I'm a teacher in a UK high school with 6th form and I was not aware there was a difference between a 6th form college and college? I thought that was the same thing 😂",
                                                    "score": 1,
                                                    "author": "slimyslag",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "The main college where I live doesn’t do A-Levels (I was doing one when they stopped them in favour of just doing vocational courses and to focus on the university centre that they have) there has always been a 6th form college as well and they just do A-levels, then schools also have a 6th form as well. Where I live is a bit strange",
                                                            "score": 1,
                                                            "author": "Ok_Astronomer_1011",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "a sixth form college is essentially a secondary school that has 7 forms\n\nupper third, lower fourth, upper fourth, lower fifth, upper fifth, lower sixth, upper sixth\n\nhence why the last two years are called sixth form. equivalent in a state school to \"year 7-13\" with the sixth formers being years 12-13\n\na standard college is just for age 16-18 kids to do their A levels, it isn't additionally a 5 year secondary school",
                                                            "score": 0,
                                                            "author": "Alex_Rose",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Yeah, I know that. I work in a high school with a 6th form. I went to a college.\n\nI was confused by there being a third option, but the original commenter has explained.",
                                                                    "score": 1,
                                                                    "author": "slimyslag",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Advanced highers are slightly less comprehensive than A-levels. You only do 3 A-levels (4 in special cases for the academically gifted) Vs 4 or 5 adv highers. Generally you need 3 A-levels or 4 adv highers to be accepted to university. \n\nNot that the adv higher year is easier overall, just that each subject isn't covered to the same level but you do more subjects. \n\nAs you said though, they seem to change the Scottish system bizarrely frequently.",
                                            "score": 4,
                                            "author": "IrishKash",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "2nd to last year of high school also known as year 12",
                    "score": 6,
                    "author": "Upset_Present_3195"
                },
                {
                    "level": 1,
                    "comment": "Roughly where you go at 16 to 18.",
                    "score": 2,
                    "author": "bulgarianlily"
                },
                {
                    "level": 1,
                    "comment": "Leafeon, I think?",
                    "score": 2,
                    "author": "chad_"
                },
                {
                    "level": 1,
                    "comment": "Super Saiyan God Super Saiyan (Super Saiyan Blue).",
                    "score": -11,
                    "author": "BluParkMoon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "With fusion dance",
                            "score": 2,
                            "author": "YukariYakum0"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Uh, Niman, I believe.",
                    "score": 1,
                    "author": "woodtimer"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I love a story with a happy ending!",
            "score": 21,
            "author": "w84itagain"
        },
        {
            "level": 0,
            "comment": "This seems more natural consequences than petty revenge, but good for you for standing up for yourself!",
            "score": 124,
            "author": "GuadDidUs"
        },
        {
            "level": 0,
            "comment": "My daughter has Tourette’s, and they just morphed into complex tics and she’s had tic attacks at school, and it has been so rough lately. It breaks my heart to watch how strong she has to be, but I am also so proud of her for the daily battles she faces so fiercely. As a mom of a kid with Tourette’s, I am so proud of your resolve to advocate for and defend yourself! You handled that business like a boss!\n\nWe’re wearing our teal for Tourette’s awareness month!",
            "score": 117,
            "author": "Xanga_alumni",
            "replies": [
                {
                    "level": 1,
                    "comment": "does she like [Billie Eilish](https://en.wikipedia.org/wiki/Billie_Eilish#Personal_life)?",
                    "score": 4,
                    "author": "agent-99",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "YESSSS, LOVE billie! Went to a concert last year!!!!",
                            "score": 7,
                            "author": "Xanga_alumni",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I have it as well and I'm so glad to hear that you're so supportive of her. It's so hard as a kid and having supportive parents makes all the difference",
                    "score": 3,
                    "author": "AdmiralSplinter"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Justice was served.",
            "score": 20,
            "author": "Bkseneca"
        },
        {
            "level": 0,
            "comment": "Quick reaction to get her on camera; well done!  How did the bully simply not stop once she saw you were recording her?  It just goes to show that people like that are not only mean, they're stupid.",
            "score": 19,
            "author": "Bargle-Nawdle-Zouss",
            "replies": [
                {
                    "level": 1,
                    "comment": "she was with her boyfriend and laughing her head off at it and i didn’t turn back around, clearly they were both just stupid",
                    "score": 21,
                    "author": "mximmcff",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I won't cry if this hurts her BF’s acceptance. Standing by is not innocent.",
                            "score": 12,
                            "author": "bananapanqueques"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "https://i.redd.it/ap44xkiv552b1.png",
            "score": 21,
            "author": "shin_tetsuken",
            "replies": [
                {
                    "level": 1,
                    "comment": "I hate that I got this so quickly",
                    "score": 4,
                    "author": "HereToShareSecrets",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "She's awfully old to be so awful",
            "score": 15,
            "author": "twiggyrox"
        },
        {
            "level": 0,
            "comment": "Well if it isn’t the consequences of her actions coming home to roost. Well done!",
            "score": 15,
            "author": "sharri70"
        },
        {
            "level": 0,
            "comment": "The very definition of \"f around and find out\"..",
            "score": 15,
            "author": "kirbyhope72"
        },
        {
            "level": 0,
            "comment": "I had to read the comments to find out what OP was talking about as I had no idea about whatever education system they were talking about.\n\nGold Star on the outcome.",
            "score": 34,
            "author": "whitecloud197",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's the UK. We have secondary school/ high school (most regions call it secondary) for 11-16 and then sixth form/ college (sixth form is part of a high school, colleges are a separate institution with a wider range of vocational options) for 16-18.",
                    "score": 8,
                    "author": "slimyslag"
                }
            ]
        },
        {
            "level": 0,
            "comment": "As someone who also has tourettes, LOL. Serves her right.",
            "score": 8,
            "author": "DelnBay"
        },
        {
            "level": 0,
            "comment": "![gif](giphy|pCO5tKdP22RC8)",
            "score": 8,
            "author": "TyRocken"
        },
        {
            "level": 0,
            "comment": "I’m not from the UK so I never knew that sixth form was like 16-18 yos. I always thought it was just like.. grade six. So I thought you were talking about a 12 yo kid. How the fuck does someone almost ready for college act this immature and hostile, what is wrong with her. I’m so sorry you’ve been bullied so hard.",
            "score": 7,
            "author": "GargantuanGreenGoats"
        },
        {
            "level": 0,
            "comment": "👏👏👏",
            "score": 7,
            "author": "HiddenJAM1966"
        },
        {
            "level": 0,
            "comment": "My sil has Tourette’s so fuck her she had it coming. Enjoy the win sweetheart! 💕",
            "score": 7,
            "author": "AnastasiaDelicious"
        },
        {
            "level": 0,
            "comment": "Delightful",
            "score": 6,
            "author": "hailboognish99"
        },
        {
            "level": 0,
            "comment": "Good for you and serves her right",
            "score": 6,
            "author": "MrPuzzleMan"
        },
        {
            "level": 0,
            "comment": "Not even petty, just good revenge well deserved 👏\n\nFAFO revenge 😂 good for you OP!",
            "score": 6,
            "author": "CatWombles"
        },
        {
            "level": 0,
            "comment": "An the hilarious part is that this bully will never once reflect upon this an will blame OP for everything.",
            "score": 20,
            "author": "SlamMonkey"
        },
        {
            "level": 0,
            "comment": "She fucked around and found out",
            "score": 5,
            "author": "z770i1"
        },
        {
            "level": 0,
            "comment": "This is something a handful of us wish we did growing up. Hats off",
            "score": 5,
            "author": "East_Midnight2812"
        },
        {
            "level": 0,
            "comment": "actions have concequences. You did the right thing reporting this as that's not only dumb, but cruel.",
            "score": 7,
            "author": "C-DomiNations"
        },
        {
            "level": 0,
            "comment": "W honestly",
            "score": 4,
            "author": "Chance-Ad8608"
        },
        {
            "level": 0,
            "comment": "Got what she deserved. Bravo.",
            "score": 5,
            "author": "OldSpiceSmellsNice"
        },
        {
            "level": 0,
            "comment": "Good job, OP. Your work reads like the justice story many of us never got, really satisfying! Best of luck to you!",
            "score": 5,
            "author": "jetelklee"
        },
        {
            "level": 0,
            "comment": "This isn't petty. She violated your human rights there. Bullying is unacceptable in of itself. Bullying someone with a documented medical issue...",
            "score": 5,
            "author": "Random_Radiance"
        },
        {
            "level": 0,
            "comment": "Fuck bullies. Glad she got hers.",
            "score": 5,
            "author": "randomlurker82"
        },
        {
            "level": 0,
            "comment": " You saved so many others from her. You did a good job!",
            "score": 4,
            "author": "Unapologeticallyfat"
        },
        {
            "level": 0,
            "comment": "That ain't petty, OP. That's appropriately targeted revenge.\n\nCruel people shouldn't get nice things.",
            "score": 4,
            "author": "TenthSpeedWriter"
        },
        {
            "level": 0,
            "comment": "Fuck her.  Put it on social media and let the planet devour her.",
            "score": 4,
            "author": "TheMobyDicks"
        },
        {
            "level": 0,
            "comment": "Not even petty. \n\nIt was just straight up justice.",
            "score": 4,
            "author": "GuardingxCross"
        },
        {
            "level": 0,
            "comment": "Ahhhhh my old friend schadenfreude. She fucked around and found out, beautiful.",
            "score": 11,
            "author": "National_Lab5987",
            "replies": [
                {
                    "level": 1,
                    "comment": "She played stupid games and won stupid prizes. \n\nGood job...",
                    "score": 3,
                    "author": "NefariousnessSweet70"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just because we might be “retarded” doesn’t mean we’re not smart! I’m autistic and I also fully believe in a well deserved slice of good petty revenge. Congratulations, OP.",
            "score": 19,
            "author": "REDpandaBEAR1987",
            "replies": [
                {
                    "level": 1,
                    "comment": "A good friend of mine is very dyslexic, but that didn't stop him from getting a Master's in Biochemistry and having having body coordination of a ballet dancer.\nI also know a couple of people that have discalculia and a few more that are \"on the spectrum\" (though I hate that euphemism). They're some of the smartest people I know and tend to have their shit together.\n\nFrankly, I'm convinced we're all a bit \"retarded\",  just so happens its in mental areas that aren't bring looked at yet.",
                    "score": 6,
                    "author": "ProtonRhys",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I like the spectrum phrasing. The only part I dont like is the idea that some are on and some are not on the spectrum...defeats the whole point. I think ALL of humanity, every part of us is a spectrum. Gender, orientation, everything. There is no binary, there is only a big beautiful spectrum and we are ALL on it together.",
                            "score": 2,
                            "author": "Swiss_Miss_77"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Showed the buddling little \"B\" Bravoooo",
            "score": 3,
            "author": "Peeintheshadows"
        },
        {
            "level": 0,
            "comment": "I love reading stories like this but it's more like instant karma than petty revenge. \n\nEnjoy your bully-free school year, you've earned it!",
            "score": 3,
            "author": "Alexis_J_M"
        },
        {
            "level": 0,
            "comment": "She didn't get anything more than what she deserved. I'm glad she won't be there to harass you next year. (At least I hope that's true!)",
            "score": 3,
            "author": "CheckIntelligent7828"
        },
        {
            "level": 0,
            "comment": "Sweet, sweet revenge",
            "score": 3,
            "author": "Plz_Fart_In_my_Mouth"
        },
        {
            "level": 0,
            "comment": "Serves her right",
            "score": 3,
            "author": "pocorey"
        },
        {
            "level": 0,
            "comment": "FAFO",
            "score": 3,
            "author": "maodiver1"
        },
        {
            "level": 0,
            "comment": "Permanent record XD",
            "score": 3,
            "author": "miggleb"
        },
        {
            "level": 0,
            "comment": "Consequences.",
            "score": 3,
            "author": "GazelleKindly4155"
        },
        {
            "level": 0,
            "comment": "Lmao deserved",
            "score": 3,
            "author": "xXheil_Pokywan420_Xx"
        },
        {
            "level": 0,
            "comment": "wonderful story🥰",
            "score": 3,
            "author": "cherrie_teaa"
        },
        {
            "level": 0,
            "comment": "Good! I love when people play stupid games because they win the best stupid prizes! Well done OP. Your bully had it coming. I’m sorry you had to go through it but I’m glad your bully’s life was rightfully ruined.",
            "score": 3,
            "author": "Fit-Discount3135"
        },
        {
            "level": 0,
            "comment": "Idk what sixth for is, but good for you!",
            "score": 3,
            "author": "KF_Lawless",
            "replies": [
                {
                    "level": 1,
                    "comment": "In the UK the main qualifications are GCSEs (General Certificate in Secondary Education) taken at 16 years old. Most school set ups are Primary school (up to Year 6 at 11 y.o.) then Secondary school (Years 7 - 11, so 12 y.o. to 16 y.o.) This completes the legally required minimum education, so people can go off and get full time jobs from 16. Those who stay in formal education (as opposed to technical/apprenticeship education) can go to Sixth Form College from 16-18 years old, so Year 12 &amp; 13, where they do A Levels, and specialise in 3 or 4 subjects. Nowadays these are often attached to the Secondary school, but not always. Prior to about 1988-ish the Secondary schools did 'O' Levels (or Ordinary Level qualifications) and the years were called First Year (in Secondary school, and going way back it was First Form) to Fifth Year. So the next school up from that was Sixth Form College  (where you took 'A' or Advanced Level qualifications). Above that is University from 18 years old.",
                    "score": 2,
                    "author": "Conscious-Arm-7889",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "OP, awesome on standing up for yourself and putting that bully in their place!",
            "score": 3,
            "author": "PraisingAintEasy"
        },
        {
            "level": 0,
            "comment": "Play bitch games, win bitch prizes.",
            "score": 3,
            "author": "Exploding_Muffin"
        },
        {
            "level": 0,
            "comment": "This was just a good story. \n\nHopefully she's less of a dickhead now",
            "score": 3,
            "author": "jehan_gonzales"
        },
        {
            "level": 0,
            "comment": "I'm not from the US, what is the R word?",
            "score": 3,
            "author": "DorpvanMartijn",
            "replies": [
                {
                    "level": 1,
                    "comment": "Republican",
                    "score": 4,
                    "author": "1ildevil",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hey! You can't say that!",
                            "score": 6,
                            "author": "DorpvanMartijn",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh sorry.  R*publican.",
                                    "score": 8,
                                    "author": "1ildevil"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "retarded is real answer \n\nSince the democratic libjits are trying to be funny .",
                    "score": 1,
                    "author": "Kerivkennedy",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Good for you!! My youngest is a Touretter and even though he's doing very well now, during school controlling his tics was extremely difficult.\n\nI love (hate) when people use Tourette's as a joke. I'll let them finish, nod, and then say, \"I have a son who's a Touretter\" and then look around at the looks on people's faces.",
            "score": 3,
            "author": "Realistic-Weird-4259",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Sweet sweet justice",
            "score": 3,
            "author": "TechnoTerps"
        },
        {
            "level": 0,
            "comment": "As someone who deals with literal gray-haired, grown-ass, degree-holding, temper-tantrum-throwing bullies, cheers.",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I have Asperger's, so can relate.  That R word is the only trigger I have, even if not aimed at me, I will go off on one at the speaker.  I will try to bite my tongue, but that's so difficult.",
            "score": 3,
            "author": "Honest_Invite_7065"
        },
        {
            "level": 0,
            "comment": "FAFO - F--k Around, Find Out.  \nBut you did save her family next year's tuition.",
            "score": 3,
            "author": "MikeSchwab63"
        },
        {
            "level": 0,
            "comment": "I'm afraid to ask but... R-slur?\n\nI have no idea what that might be.",
            "score": 4,
            "author": "Sooner70",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m guessing “R*tard”",
                    "score": 3,
                    "author": "Midnight-Note",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "This isn’t petty revenge.  This is teaching an asshole that  actions have consequences. Hopefully you’re the last person she bullies.",
            "score": 4,
            "author": "jatnj"
        },
        {
            "level": 0,
            "comment": "As a person with tourette syndrome. I appreciate you standing up for yourself. Bullies are shitty people.",
            "score": 4,
            "author": "WideVanilla5177",
            "replies": [
                {
                    "level": 1,
                    "comment": "Why are you weird mfs downvoting. Literally am proud of the OP. I have TS as well and was bullied growing up.",
                    "score": 3,
                    "author": "WideVanilla5177"
                }
            ]
        },
        {
            "level": 0,
            "comment": "nice job :)",
            "score": 2,
            "author": "maroongrad"
        },
        {
            "level": 0,
            "comment": "Mic drop. Well done.",
            "score": 2,
            "author": "Orca1971"
        },
        {
            "level": 0,
            "comment": "This is beautiful.  \n  \nYou are a wonderful lovely person and don't let the hatred get to you. You're still worthy of being respected and shouldn't be treated that way. I'm sorry that had happened, but you absolutely did the right thing.",
            "score": 2,
            "author": "Trystanik"
        },
        {
            "level": 0,
            "comment": "top level revenge!!",
            "score": 2,
            "author": "Alpha-Studios"
        },
        {
            "level": 0,
            "comment": "Incredible work ❤️❤️❤️",
            "score": 2,
            "author": "aghzombies"
        },
        {
            "level": 0,
            "comment": "revenge is a dish so cold.",
            "score": 2,
            "author": "juccals1993"
        },
        {
            "level": 0,
            "comment": "Nice story OP. I do have a question tho as someone from USA: is sixth form the UK equivalent of the 12th grade? Cuz I know that secondary school is our high school so idk",
            "score": 2,
            "author": "waveslikemoses",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Gawdamn, this post gave me hope.",
            "score": 2,
            "author": "Slayer_Of_Tacos"
        },
        {
            "level": 0,
            "comment": "She did this to herself. Maybe she will learn a lesson from it.",
            "score": 2,
            "author": "Background_Newt3594"
        },
        {
            "level": 0,
            "comment": "Good on you!!",
            "score": 2,
            "author": "crazylemon14"
        },
        {
            "level": 0,
            "comment": "Touche",
            "score": 2,
            "author": "Careless_Fun7101"
        },
        {
            "level": 0,
            "comment": "Ow! My petard!",
            "score": 2,
            "author": "DariusMDeV"
        },
        {
            "level": 0,
            "comment": "well done, good for you, let them live with regret.",
            "score": 2,
            "author": "CaptH3inzB3anz"
        },
        {
            "level": 0,
            "comment": "This ain’t petty. It’s pretty.",
            "score": 2,
            "author": "mercenfairy"
        },
        {
            "level": 0,
            "comment": "👏👏👏👏👏👏👏👏👏👏👏👏🫡🫡🫡🫡🫡🫡🫡🫡🫡🫡🫡🫡✊✊✊✊✊✊✊✊✊✊✊",
            "score": 2,
            "author": "Puzzled_Drop3856"
        },
        {
            "level": 0,
            "comment": "Guess now her parents will have to move",
            "score": 2,
            "author": "Ok_Afternoon_110"
        },
        {
            "level": 0,
            "comment": "Damn I have Tourette's too, I only ever experienced bullying by a desperate girl in high school briefly, I was lucky. I hope this helps you move on with a smile.",
            "score": 2,
            "author": "jeffdabuffalo"
        },
        {
            "level": 0,
            "comment": "What is sixth form in America? Is it the same as the UK?",
            "score": 2,
            "author": "Cherry_Crystals",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's different. We have high school which is 4 years and you usually graduate somewhere around age 18. Then comes college or university for your undergraduate degree or technical school.",
                    "score": 2,
                    "author": "duck-duck--grayduck",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh right. Thank you",
                            "score": 2,
                            "author": "Cherry_Crystals"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "She fucked around and found out",
            "score": 2,
            "author": "Worldly_Sherbet_3485"
        },
        {
            "level": 0,
            "comment": "brilliant result - fuck bully's",
            "score": 2,
            "author": "infoway777"
        },
        {
            "level": 0,
            "comment": "I think the phrase, \"chat shit get banged\" does this justice.",
            "score": 2,
            "author": "z4k5ta"
        },
        {
            "level": 0,
            "comment": "As someone who was bullied, and a parent of a special needs child I applaud you. \n\nAll I've ever wished for my tormentors is a little karma.",
            "score": 2,
            "author": "Kerivkennedy"
        },
        {
            "level": 0,
            "comment": "Well done! We all have consequences'  for our actions. Let the bitch hate you forever. That might be a good \"petty revenge topic\". good luck!",
            "score": 2,
            "author": "Tall-Psychology7593"
        },
        {
            "level": 0,
            "comment": "Hopefully, her new R-word is gonna be Remorse",
            "score": 2,
            "author": "SamIAm718"
        },
        {
            "level": 0,
            "comment": "Actions, meet consequences",
            "score": 2,
            "author": "travelynns"
        },
        {
            "level": 0,
            "comment": "Fuck around and find out. Maybe she'll learn a lesson, maybe she won't. But she did this to herself. Good on you for standing up for yourself!",
            "score": 2,
            "author": "crazycatleslie"
        },
        {
            "level": 0,
            "comment": "Yesssssss!!!",
            "score": 2,
            "author": "Silkscr3am"
        },
        {
            "level": 0,
            "comment": "What an amazing thing these little recording devices are....people who would have pissed all over others now may be caught and fucked!  It's a beautiful thing.  That gal is going to kick herself for years!  Way to go!",
            "score": 2,
            "author": "cantgetoutnow"
        },
        {
            "level": 0,
            "comment": "GOOD what a bitch",
            "score": 2,
            "author": "HappyParty9593"
        },
        {
            "level": 0,
            "comment": "That wasn’t revenge; that was JUSTICE SERVED! Good for you OP!",
            "score": 2,
            "author": "Agitated_Zucchini_82"
        },
        {
            "level": 0,
            "comment": "It's nice to see consequences for someone behaving badly for a change.  I sure hope this person learned a thing or two.",
            "score": 2,
            "author": "wwtfn"
        },
        {
            "level": 0,
            "comment": "I don’t know what a sixth is but good for you. It’s not always easy standing up to your bully",
            "score": 2,
            "author": "ImAScientistToo"
        },
        {
            "level": 0,
            "comment": "If the r were appropriate it would be on her. Because who is stupid enough to bully someone in public and get recorded???Good for you. Stick it to her. She deserves her karma. Shes special.",
            "score": 2,
            "author": "SpicyCatchup7580"
        },
        {
            "level": 0,
            "comment": "As a mom of a child with ds. Thank you!! Your actions make it possible for fewer of these assholes yo torment him. Thank you!",
            "score": 2,
            "author": "5horses"
        },
        {
            "level": 0,
            "comment": "You honestly made her a favor. This would be for her the inflection point where she can choose and starts becoming a better person. Good job 🤍",
            "score": 2,
            "author": "One-Quality1551"
        },
        {
            "level": 0,
            "comment": "Seems more like regular revenge than petty revenge.\n\nI mean, she's going to be held back at least a year from school unless she has to move districts!",
            "score": 3,
            "author": "Stormy8888"
        },
        {
            "level": 0,
            "comment": "I call this fuck around and find out. The bully fucked around and you made them find out. Actions have consequences, and bullies will learn the easy way (being told) or the hard way (being punished after the fact). It's not up to you to make it easy for them, it's up to you to make it easier for YOU. Good job dealing with your bully, hopefully they will learn to not be an ass to the world, because the world is always willing to bite back.",
            "score": 2,
            "author": "MrBootch"
        },
        {
            "level": 0,
            "comment": "What's the r-slur??",
            "score": 2,
            "author": "Revolutionary_Town21",
            "replies": []
        },
        {
            "level": 0,
            "comment": "what is  Sixth form ?",
            "score": 1,
            "author": "CaptainBaoBao"
        },
        {
            "level": 0,
            "comment": "Hah! I would not want you as my enemy!",
            "score": 1,
            "author": "Ok-Warthog-9991"
        },
        {
            "level": 0,
            "comment": "Update on my life revolves\n\n: my bully just got worse as now she has motive to try and get even.",
            "score": -24,
            "author": "Mammoth_Jeweler3857"
        },
        {
            "level": 0,
            "comment": "Proud of you OP! But curious where you got her parents' emails?",
            "score": 1,
            "author": "ScaredStudentSadFace",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Might be stupid but what is the r-slur? Does it start with R and end with D? It's the only one I can think of",
            "score": 1,
            "author": "Perfect-Editor-5008",
            "replies": [
                {
                    "level": 1,
                    "comment": "i don’t like saying it myself so i usually just say that, but it’s retard",
                    "score": 2,
                    "author": "mximmcff",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s horrific that she was saying that to you OP! But absolutely DELICIOUS that you were able to record her in the act of bullying and sent copies of your torment to all appropriate parties! Well done 👍🏻 \n\nI sincerely hope she learns a lesson from this and doesn’t become bitter and even more resentful.",
                            "score": 2,
                            "author": "2centsworth4u"
                        },
                        {
                            "level": 2,
                            "comment": "Oh you didn't have to that's why I asked if it started with an r and ended with d cuz that's what I thought it was. I'm really sorry you had to go through that but good for you for standing up for yourself",
                            "score": 1,
                            "author": "Perfect-Editor-5008"
                        }
                    ]
                }
            ]
        }
    ]
}