{
    "id": "13v5rka",
    "score": 1018,
    "title": "Can't exchange shifts to have the weekend off? Have fun working it anyways!",
    "author": "Desyphin",
    "date": 1685392499.0,
    "url": "https://www.reddit.com/r/pettyrevenge/comments/13v5rka",
    "media_urls": [],
    "other_urls": [],
    "postText": "This story took place around a decade ago now, and just thought to share and hope you enjoy my lil petty action.\n\nI was working in fashion retail at the time and was responsible for the opening and closing of the store most of the time.\n\nAn assistant manager role was available and I applied for it, only to have the position filled by an external hire due to them having more managerial experience. I was relatively upset at the news since I had to teach her how to fill in the budget book, etc but didn't let it show.\n\nY'all.. this new assistant manager couldn't math for shit and I had to fix the budget book every time she had to close the shift prior. I'm bad at maths but simple addition, subtraction and multiplication?? I'm sure a kid can do better than that. Also found her peeling off her fake nails and just chucking them on the ground (I approached her on this and she shrugged saying I was going to vacuum anyways?!). Anyways, I digress.\n\nMy birthday is in September and it sucks whenever it came to asking for a day off as it falls on school holidays, aka busy season. I was happy to work on my birthday itself (on a Wednesdy iirc) and wanted to take the weekend off in advance.\n\nI asked my manager if I could have the Saturday I was scheduled on off, and she was like \"No, unfortunately it's going to be busy due to the school holidays and I need you in\". I asked if I could exchange it with the assistant manager who was working with her on Wednesday, and she outright denied it, giving some BS excuse. \n\nWell, by this point I was already frustrated at management, so I did the pettiest thing I could. \n\nI submitted my notice of resignation exactly 2 weeks prior to the Saturday I wanted off (on hindsight should have quit on the spot a day prior for ultimate pettiness). Hope either one of them enjoyed working that weekend! 👍",
    "comments": [
        {
            "level": 0,
            "comment": "It's worth my job to not work on my birthday. I have worked one time on my birthday in the past 25 years. That's only because it was an overnight &amp; the store was closed.\n\nI remember one job where I requested my birthday off 6 weeks ahead of time. The owner told me that I would probably have to work. My birthday is not during any holiday.\n\nMy reply was she could schedule me to work on my birthday... But if she did, my last day would be the day before.\n\nI'm so glad she didn't test me on it.",
            "score": 224,
            "author": "MidLifeEducation",
            "replies": [
                {
                    "level": 1,
                    "comment": "Agree with your first sentence! Only time I was willing to work on my birthday was when having a normal \"weekend\" off was more important than working on a normal workday! \n\nI'll have to steal your reply if I ever end up in a situation like that again (knock on wood)!",
                    "score": 78,
                    "author": "Desyphin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Feel free to steal my reply ![gif](emote|free_emotes_pack|laughing)",
                            "score": 8,
                            "author": "MidLifeEducation"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "“You’re not important to me”\n\n“It’s not you I give a shit about, I’m important to ME”\n\nFunny how a lot of people seem to miss out that if the business does not show basic levels of commitment to recognizing the humanity of its people, they’ve freed their employees to not care about that for their bosses",
                    "score": 54,
                    "author": "MistraloysiusMithrax",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The same bosses are always like \"nO oNE waNtS  tO wORk anYMorE\"",
                            "score": 29,
                            "author": "psychosis_inducing",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Don't even get me started on how ridiculously hard it is to find a decent job these days 😒 let alone them quoting this shit. If no one wants to work anymore, why don't you make it easier for people to get a job at a liveable wage?! Sorry for the rant",
                                    "score": 38,
                                    "author": "Desyphin",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Nobody want to work any more... for pennies! Pay people decent and treat them right, then they will want to work for you. So simple yet bussiness owners amd management just refuse to acknowledge.",
                                            "score": 18,
                                            "author": "nhuntato"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "It isn't even that people don't want to work. Rank and file service workers (retail, fast food, servers) figured out just how valuable they are at the beginning of the pandemic.\n\nIt's that we don't want to work for $7.25/hr while companies are posting record breaking profits.",
                                            "score": 20,
                                            "author": "MidLifeEducation"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That’s so annoying. With that much time, it should have been easy to make sure that day was covered.",
                    "score": 15,
                    "author": "SaucePasta",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Exactly... Especially since it doesn't involve a holiday",
                            "score": 9,
                            "author": "MidLifeEducation"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I had a work friend who used to make birthday cakes for everyone in the office. I once asked why I didn't get one. She told me it was because I was never in the office on my birthday. Nope, and I never will be. Got the cake when I transferred departments instead.",
                    "score": 5,
                    "author": "randomlady7722"
                },
                {
                    "level": 1,
                    "comment": "At my job the schedule for asking vacation time is online. The first thing I do every year is take my birthday off.  Usually the whole week, but I definitely don’t work on my birthday.",
                    "score": 14,
                    "author": "MesaAdelante",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I do the same thing",
                            "score": 2,
                            "author": "MidLifeEducation"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "this is what I would have done.\n\nyou have to be assertive sometimes",
                    "score": 1,
                    "author": "Windk86",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Some employers need to be reminded that a \"request\" for time off is actually the polite way of saying \"Make arrangements. I will not be here.\" \n\nIt's not a request... It's a statement of fact.",
                            "score": 2,
                            "author": "MidLifeEducation"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Should have started looking for another job the moment they denied you the assistant manager role. And then quit the moment you got one.",
            "score": 440,
            "author": "Lay-ZFair",
            "replies": [
                {
                    "level": 1,
                    "comment": "It all happened within months. I was searching but this made me rage quit. I got another job a few weeks later\n\nEdited for clarity",
                    "score": 303,
                    "author": "Desyphin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "GOOD!",
                            "score": 24,
                            "author": "Lay-ZFair"
                        },
                        {
                            "level": 2,
                            "comment": "Good for you",
                            "score": 10,
                            "author": "giveme25atleast"
                        },
                        {
                            "level": 2,
                            "comment": "Rage quitting is the BEST.",
                            "score": 2,
                            "author": "aquainst1"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This reminds me of a story that happened several years ago when I was working in a small hospital. On my ward we had a dedicated night crew that only ever did night shifts. It was their choice, everyone was happy and it was good to have them there. They were mostly older nurses, in their fifties at least, and very experienced. One particular nurse, who had been working there for many years, was from Tonga. Every year she put in for annual leave over the Christmas period because she went home to visit her family in Tonga. \n\nThis one year I’m thinking of, we had a new sister in charge of our ward. She was young and ambitious and trying a bit too hard to make her mark. Christmas was approaching and the nurse put in her application for leave. Sister in charge said she couldn’t have it. Nurse applied again. Sister in charge said no again. This went on for weeks, with no resolution.\n\nEventually, just a couple of days before the nurse’s desired commencement of leave, the sister in charge came up to her to set the record straight. She told the nurse once and for all that her leave will not be approved, so stop asking. \n\nThe nurse’s reply still makes me laugh to this day. She said “you can roster me on, or not roster me, it doesn’t really matter because I won’t be here. I will be in Tonga.” She smiled and walked away with dignity and self respect, leaving the young sister in charge gulping like a goldfish. It was beautiful to watch.\n\nThe nurse took her holiday and kept her job and the sister in charge stayed on for several more years as well. So I guess she found a replacement after all…",
            "score": 39,
            "author": "moogy08"
        },
        {
            "level": 0,
            "comment": "Literally did this when my manager didn’t approve my time off request because I’d asked for every other weekend off that month (me and both of my sisters all have birthdays in august 6 days apart from each other, so I wanted my birthday and one of my sister’s to go home and visit) and my family had a combined celebration for all of us to go on for the last weekend in August. As soon as my awful manager denied it, I handed her my resignation for the day before I asked off.",
            "score": 35,
            "author": "handanhan"
        },
        {
            "level": 0,
            "comment": "Never ask for days off, just let them know you wont be there.",
            "score": 28,
            "author": "DikkeNek_GoldenTich",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is the way!",
                    "score": 8,
                    "author": "ImFineHow_AreYou"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I dont know how related this is but I wanna tell a story you just reminded me of. When I was in college I worked at a grocery store on the weekends. Specifically started on Fri-Sun but by the last semester I worked there it was just Sat/Sun. I got a new job on campus that was in my field of study. At this grocery store, you basically quit but putting in a time off request but not picking an end date. So I put what was to be my last day as December 3rd, a Saturday. Didnt work on Sunday since I was done as far as I knew and went on my merry way.\n\nThe following Thursday, I was waiting to get a haircut coincidentally next door to the store when my phone rang. I didnt recognize the number but had an instant suspicion. Since I was checked in I went ahead and walked next door and sure enough apparently I had been scheduled for that day. Apparently they mistook my '3' for an '8'. Nevermind the fact I had never worked on a Thursday in the 2.5 years Id worked there. Nothing they could do, so I went back to get the haircut.\n\nThe epilogue is that I went back to the store after the haircut to get some basic groceries. As I was checking out, the cashier asked me if I was scheduled for that day. I told them how apparently they thought Id made myself available for this one last day even though I was done. The cashier responded in a not super happy mood, \"Yeah, Im the one covering the shift.\" Like sorry my guy, but not my problem management made a mistake.",
            "score": 46,
            "author": "tenphes31",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for sharing your story! Yeah, I understand where the replacement cashier is coming from but not your fault!",
                    "score": 17,
                    "author": "Desyphin"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Your petty revenge should have started by not doing the budget book, if that was a part of assistant manager duties. If she was considered so much more qualified than you, then she can do the work.",
            "score": 12,
            "author": "Kellyjb72",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, for real.\n\n\nIn a shitty job I had as a teenager, I was told that I would be a shoe in for an assistant manager spot since the previous one was leaving, but I had to work hard to prove I could do it \n\nI busted my ass for two months, and learned all I could, worked long days and extra shifts, did even more than the current position holder had been doing just so that I could be sure I'd get it.\n\nWhen the time came, the supervisor brought over this kid from another department who always sucked up to her and gave him the spot, making him my superior.\n\n*Then*, the supervisor tells me that I need to keep doing all the extras, *plus* I need to train this kid in how to do the job because he doesn't know how this department works.\n\nI told the supervisor that not only would I not be training anybody but that I was also going back to doing my original hours and job description, immediately.\n\nThe whole section fell apart from lack of management, since he was now responsible for ordering stock. After the third outage in the first week of his management, the supervisor basically had to make running that department her main job, even moving her office to that part of the building. There was so much to do that she never did find enough time to properly train him, so for me the rest of that summer was spent pretty much phoning it in, and enjoying the train wreck.\n\nIt got so bad that I started carrying a pink highlighter in addition to my normal pens while pulling orders from the warehouse, to flag all the shit that was being ordered that we were out of. Normally they happened maybe once or twice a *month*, but within a week or two after all this happened, it was 3 or 4 per day.",
                    "score": 11,
                    "author": "hydrospanner",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I had that too where I was not going to get a promotion but was tasked with training the person who was getting it.  It sucks.",
                            "score": 3,
                            "author": "KurtRoedegerGmail",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's happened to me several times over the years in different jobs and I've refused to do it each time, basically saying that I didn't know how the job was done. Basically if they're gonna treat me like I'm dumb I'm fully prepared to play dumb when it comes to training someone who should be the one training *me*.",
                                    "score": 3,
                                    "author": "hydrospanner"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It was part of the closing shift responsibilities... so as much as I'd love to like let her deal with that shit at the time, I closed most days and couldn't let the bad math slide. Should have cared less at the time. Hindsight is 20/20 for sure",
                    "score": 6,
                    "author": "Desyphin"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was working at a manufacturing company. Sometimes we would have mandatory Saturdays. Sometimes it would be every other Saturday for a couple of months. \n\nIt turned out in October of one year we had to work every other Saturday. Well my birthday, on a Saturday was on one of the off weekends. I was very happy until Thursday before the weekend, management decided to make Saturday mandatory. \n\nI asked for it off. No can do. I should have requested a vacation day two weeks ago. I pointed out that two weeks previously, it was not a work day, so how could I ask for it off? Then I told them it was my birthday too so I wasn’t going to work. Too bad, they said.\n\nNormally I rolled over and just did what was asked. Not this time. I said, well I guess I’m going to be sick then. Supervisor said we will put you down as an unapproved absence and would get my pay docked. \n\nBy that time I was steaming mad and told them again, Birthday 🎂, wasn’t supposed to be a workday, and I wasn’t coming in. Dock my pay, unapproved absence, whatever. Maybe quit. \n\nAll of a sudden I got approved and had a very happy birthday.",
            "score": 46,
            "author": "novembirdie",
            "replies": [
                {
                    "level": 1,
                    "comment": "Glad to hear you took a stance on that and it worked out well in the end!!! ❤️ but yeah fuck that sort of shit. I vowed never to pull stunts like this to those who work under me now.",
                    "score": 18,
                    "author": "Desyphin"
                },
                {
                    "level": 1,
                    "comment": "&gt; I asked for it off. No can do. I should have requested a vacation day two weeks ago. \n\nHow about\n\n&gt;Thursday before the weekend, management decided to make Saturday mandatory.   \n&gt;  \n&gt;Sorry no can do. You should have scheduled that two weeks ago.",
                    "score": 20,
                    "author": "asp174",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah there's SO many things that employers do that they act like it's fair but if positions were reversed, it wouldn't fly.\n\nCould you imagine the response if you were in your annual review and after they told you that it was a tough year so there was no budget for raises, you said, \"Oh, that's unfortunate, since that means I have no budget for extra productivity. I'll continue to do the bare minimum, but don't expect any advances in my efficiency, or for me to accept new challenges, stay late, fill in for anyone, or start early or stay late to meet project deadlines. There's just no budget in my personal time to give to a company that can't find it in their budget to invest in me.\"",
                            "score": 16,
                            "author": "hydrospanner"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Good on you for standing up for your self. i hate it when they think that you can work all the time and when you want time off they say no it isn't a request i am telling you that it happening weather your like it or not",
            "score": 6,
            "author": "Bluetitan1886"
        },
        {
            "level": 0,
            "comment": "You sound very young.  You quit your job because they wouldn't give you a birthday weekend?? Im going to guess this is why they didn't give you the promotion, they knew you cause issues when you don't get your way. Working on your birthday is normal.  They didn't approve kt months in advance, you book a trip for 10s of thousands then reverse it the day before. I hope whatever you did on your birthday was worth losing an income and a reference.",
            "score": -49,
            "author": "Poopoofinger",
            "replies": [
                {
                    "level": 1,
                    "comment": "Poopoofinger is your username? You honey sound young. Bffr!! Why is it a hard concept to grasp that she was DONE with that job and manager. If they can’t respect her enough to give her a day she requests off (no matter the reason for said request bc it’s quite literally no one’s business what someone does on their time AWAY from work) she has every right to quit her job and serve up some petty too. These pieces of shit “upper” management losers and corporate are going to learn eventually you can’t treat people like that.",
                    "score": 18,
                    "author": "Altruistic_Rough4152"
                },
                {
                    "level": 1,
                    "comment": "What the fuck",
                    "score": 8,
                    "author": "MistraloysiusMithrax"
                },
                {
                    "level": 1,
                    "comment": "Lol if 22 is considered young, sure! Before you make that assumption, I took up almost every normal weekend shift I could pick up. If you read my post correctly, I was asking to SWAP to work on my birthday but have the Saturday off to celebrate with the only other person I had with me at the time. \n\nBold of you to assume that I used them as reference to begin with and that I didn't have  back-up funds. I got a job like 3 weeks afterwards. And what trip are you referring to??? Are you high by any chance?",
                    "score": 21,
                    "author": "Desyphin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "22 is young. But you handled that just fine, and good on you for seeing your boundaries.\n\nI've got three analysts working for me (IT), and they're slowly learning that I'm encouraging them to set those boundaries. I've yet to decline a day off, even with just a few hours notice. \n\nTwo of them come from some pretty toxic places (call center and retail), so they still get taken off balance when I *don't* give them shit for asking for time off.\n\nThere are good places to work. Find them. The rest of those assholes will either have to grow up and learn, or go out of business.",
                            "score": 11,
                            "author": "ryanlc",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "For real. I do have to thank this experience for making me a better manager now (or at least I hope I am) - life can chuck shit at us out of nowhere, so I can empathise the need to have a day off to sort it out, especially if said employee has a good track record of attendance, requested time-off months in advance, etc. \n\nI am a huge advocate for taking a mental health day when needed. You have one life, and it shouldn't be wholly focused on work unless you really really really enjoy it (that in itself is rare AF). Another thing I advocate for is turning work shit OFF when you're not on shift.",
                                    "score": 8,
                                    "author": "Desyphin"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Found the boomer. This self-imposed shitty work life didn’t fully take with my generation. Consequently, many of us refuse to shape our children into “good little cogs” that live to do what they’re told. The above shown tendency for boomers to attempt to shame others for not falling for the same shit is just sad.",
                    "score": 20,
                    "author": "Imaginary_Subject168"
                },
                {
                    "level": 1,
                    "comment": "Username checks out",
                    "score": 5,
                    "author": "hunkyboy75"
                }
            ]
        }
    ]
}