{
    "id": "13vqwzu",
    "score": 139,
    "title": "neighbour revenge",
    "author": "aussiesausage99",
    "date": 1685454668.0,
    "url": "https://www.reddit.com/r/pettyrevenge/comments/13vqwzu",
    "media_urls": [],
    "other_urls": [],
    "postText": "So ever since myself and my partner moved into our home back in December we have noticed our next door neighbours are interesting characters. I can only describe the house as a half way house. \n\nThey aren’t exactly pleasant people to live next to but all of it can be tolerated with our bedroom being on the opposite side to them. \n\nBUT\n\nThe one thing I cannot stand is instead of lifting the peg on their big metal driveway gate, they scrape it the entire time along the gravel and concrete. \n\nI wish I was exaggerating when I say it is so stupidly loud, and usually happens anywhere between 5-7am and then again at 10-11pm at night. And there is less than 5 metres between this gate and our house. \n\nI have tried talking to them about it and they’re always like yeah no worries we will from now on but IT KEEPS HAPPENING. \n\nSo every now and again when I see their car leave I will sneak between the hedges and shut the gate. \nJust to inconvenience them. \n\nI know for a fact that none of the neighbours have cameras because we know them well. \nThe day I see a camera appear I will stop, but for now if they wanna wake me up every morning I’m gonna keep inconveniencing them.",
    "comments": [
        {
            "level": 0,
            "comment": "Not bad but wouldn’t it be a shame if the peg “broke off” one day?",
            "score": 64,
            "author": "Fast_Fee517",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not in all cases, this would suck in a sex situation",
                    "score": 22,
                    "author": "AcrobaticSource3"
                },
                {
                    "level": 1,
                    "comment": "You know those are removable, right???",
                    "score": 5,
                    "author": "Sofa_Queen"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Please don't let this drive you to become unhinged.",
            "score": 51,
            "author": "CoderJoe1",
            "replies": [
                {
                    "level": 1,
                    "comment": "This act could certainly be a gateway to even worse behavior.",
                    "score": 25,
                    "author": "knight-errant52"
                },
                {
                    "level": 1,
                    "comment": "Just take it down a peg.",
                    "score": 21,
                    "author": "Chaosmusic",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Or it will become a gateway to stress",
                            "score": 12,
                            "author": "CoderJoe1"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Jbweld the peg in the up position",
            "score": 14,
            "author": "forgeblast",
            "replies": [
                {
                    "level": 1,
                    "comment": "Or in the down position",
                    "score": 6,
                    "author": "TheRacoonNinja"
                }
            ]
        },
        {
            "level": 0,
            "comment": "But doesn't that mean you now hear the aggravating noise twice as often, because they keep having to re-open the gate you went and closed?? There's got to be a better solution...",
            "score": 14,
            "author": "SrslyPissedOff"
        },
        {
            "level": 0,
            "comment": "Stick a wheel on the bottom!",
            "score": 12,
            "author": "Prairie_Crab",
            "replies": [
                {
                    "level": 1,
                    "comment": "I came here to say this.\n\nJockey wheel ftw.",
                    "score": 2,
                    "author": "AJRimmer1971"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It would be a shame if some juvenile came along and put a lock and chain on the gate!😜🤪🤣😂😝😆",
            "score": 7,
            "author": "FaithlessnessJust243",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh, the power one can wheel with a bike lock!! It's amazing they just sell then to anyone. Lol 😆 🤣 😂",
                    "score": 1,
                    "author": "Casesia"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Print \"Please lift the peg when you open and close the gate\" on a paper, and tape it to the gate. Replace it every time they forget.",
            "score": 4,
            "author": "Broccolissimo"
        },
        {
            "level": 0,
            "comment": "So you close it, and then they have to open it again. No wonder they just scrape that thing as noisily as possible",
            "score": 2,
            "author": "KonaKathie"
        },
        {
            "level": 0,
            "comment": "Get Darryl Kerrigan to hook his Effy up to it.",
            "score": 2,
            "author": "von_der_Neeth"
        },
        {
            "level": 0,
            "comment": "Lol you are just inconveniencing yourself! That's not a win.\n\nFight fire with fire. Does either one of you enjoy gardening? Install a loud, tinkly bell on your shed door. Decide to garden every day. Keep your dishwasher tablets in your shed. Keep your pet food in your shed. Bad wi-fi signal? Check the shed!\n\n\\*tinkle tinkle\\* is far more annoying than \"did my dipshit neighbour shut the gate...?\"",
            "score": 2,
            "author": "ButterMyParsnip",
            "replies": [
                {
                    "level": 1,
                    "comment": "So. Many. Windchimes.",
                    "score": 2,
                    "author": "IndgoViolet"
                }
            ]
        },
        {
            "level": 0,
            "comment": "When they close it at night, open it for them!",
            "score": 2,
            "author": "AJRimmer1971"
        },
        {
            "level": 0,
            "comment": "Just steal the gate",
            "score": 1,
            "author": "Tart-Resident"
        },
        {
            "level": 0,
            "comment": "We have a gate with a the same design. It is obvious the neighbours can't be bothered to bend down to hold it up while moving the gate especially if they are older. \n\nSo my suggestion is for them to tie a string to the top of the peg that way when they move the gate they pull the string and the peg lifts up, no bending down to hold it or ground grinding.",
            "score": 1,
            "author": "MagickRed"
        },
        {
            "level": 0,
            "comment": "I’d grab a saws all and cut an inch off the bottom so it won’t stay closed.",
            "score": 1,
            "author": "SuchImprovement7473"
        },
        {
            "level": 0,
            "comment": "Put a little castor wheel on it!",
            "score": 1,
            "author": "Triplestrengt666"
        },
        {
            "level": 0,
            "comment": "\"I saw you left and forgot to close your gate so I slipped over and closed it for you. Didn't want to risk someone trespassing on your property, I mean, that's what the gate is for, right?\"  OP if a camera catches them",
            "score": 1,
            "author": "CheckIntelligent7828"
        },
        {
            "level": 0,
            "comment": "Play rain sounds or something turn on a fan that’s petty but I guess it’s the name of the thread lol.",
            "score": 0,
            "author": "InfamousQueen5251"
        }
    ]
}