{
    "id": "13vzz7b",
    "score": 2218,
    "title": "Entitled Students Thought They Were Playing Me. They Were ... Mistaken",
    "author": "WisconsinHistoryGuy",
    "date": 1685475778.0,
    "url": "https://www.reddit.com/r/pettyrevenge/comments/13vzz7b",
    "media_urls": [],
    "other_urls": [],
    "postText": "Reposted from r\\entitledpeople after someplace suggested it would be enjoyed here.\n\nI apologise for any typos - I'm on the phone and my autocorrect is drunk on power.\n\nSo, a few years ago I was teaching a private urban  religious college.  Since I only had my MS, I was thankful for the opportunity to teach and get the experience before I moved on for my PhD.\n\nThe school usually had me teach accelerated night courses which were aimed on non-traditional learners (read: adults going back to school after many years off).  I loved my students and had a blast teaching them.  I had some issues with a few here and there, bit generally my experiences were really positive.\n\nBut there WAS this one couple.  Let's call them Hanna and Larry.\n\nThat semester I had been asked to cover a more traditional course at the last minute.  Rather than being accelerated, it met three times a week, for an hour, all semester.\n\nFurthermore, the last was very small - only about four students.  Which would have been fine; small classes can be great (and a paycheck was a paycheck!), if it hadn't been for Hanna and Larry.\n\nYou see, this couple had attendance issues to put it mildly.   They would show up to a class or two and then just vanish for a week or more with no word.  Just when I suspected they were gone for good, they'd show up, usually with sole excuse or another (medical issues, car problems, work, etc).\n\nAt first I tried to be sympathetic - I always have the attitude that life happens, and when it rains it pours sometimes.  But at a certain point, I began to grow a bit suspicious they were selling me a story (okay, I was immediately suspicious, but I'm usually inclined to let things slide to a certain point.  Same as MY profs did for me).\n\nThis was all the worse because of the small nature of the class.  Every time I did prep for a session, assuming all four would be present, they'd skip and throw my plans off.  But when I just accepted they would be gone, and prepare activities for two students, they'd show up.\n\nAll of this would be frustrating but acceptable if it weren't for two things.  1) whenever they showed up, these two would have an attitude about them and just expect everyone to conform to their presence and bend to their will and 2) they - of course - weren't doing any of the work.\n\nAnd these two factors came to a head as Hanna (who was the louder and more confident of the two of them) would all but demand extensions, the ability to hand in late work, etc.  I'd give them, only for both her and Larry to blow the work off again. \n\nI like to be pretty accommodating to my students, within reason, but it quickly became obvious thst Hanna thought she was playing me and could grt whatever she wanted.  And THAT couldn't stand.  I have some level of pride and hate being seen as pushover.\n\nNow, I could have crushed them immediately and just said \"no more late work.\"  But I was sure Hanna would just throw a fit and go to administration.  I knew the admin would back me up, but it was a hassle I really didn't want (I was working on a second MS at this point and working two other jobs.  I was frothing-at-the-mouth busy at that point and hadn't even planned on teaching thst semester.  I only agreed because they needed me).\n\nAnd besides, I'm a pretty easy-going guy, but I do have my limits.  I was pissed at this point, but I also have a wicked (to me) sense of humor.  Hanna wants to think she has me wrapped around her finger?  Okay, let her think that.  I was gonna hand her enough rope to hang herself with.\n\nSo, for the past few weeks, whenever she asked for an extension, I'd smile, and say \"sure.\" And then chuckle when nothing came in.  Every time, I wrote her and Larry emails, reminding them of the new date (getting things in writing is key, kids!).\n\nAnd then we arrived at the final - I hadn't seen the twosome in a few sessions and was actually surprised to see them stumble in to take the test.  They failed (of course), but whatcha gonna do.  Hanna comes up to me in front of the class and asks for another extension.\n\nI put my best \"teacher voice\" on and said I was disappointed.  But fine.  Life happens.  However I was posting grades the next weekend, so the absolute last minute I would accept any late was Friday at 11:59 pm.  The second it hit midnight, my books were closed.  I asked if they both understood, and they summoned up a bit of solomness when they assured me that they did.\n\nGood.  I confirmed it in an email, and then sat back to grade the finals over the week (I mean, there were only four.  It wasn't THAT much work!).  I knew there was a risk they'd follow through and I'd end up with a semester's worth of work to grade - but I was feeling pretty confident that that wasn't going to happen at this point.\n\nFriday night rolls around - I didn't work my other jobs that day, and my own school work was done.  So I decided to buy a few beers and kick pack to play some video games and relax!\n\nI look down at a certain point and realize that it's midnight.  I open my email, remind everyone thst the books are now closed (If I give an extension, it's open to the whole class - I'm not playing favorites.  Not that anyone else needed it).  I cracked open another beer, let out my best super-villain laugh and went back to my game.\n\nSunday comes around and I'm posting the final grades for the semester.  I usually hate failing students, but I admit i had a smile on my face as i assigned Hanna and Larry their well-deserved Fs.  \n\nTEN MINUTES after I hit 'save' for the grades I hear the familiar ba-ding of my email going off, followed by another.  Now, who could this be?!  It is, of course, Hanna and Larry.\n\nLarry's email can best be summed up as \"Oh my god, didn't you get my email with the work!?  I sent it on Friday!\"\n\nHanna's said the exact same thing.\n\nNow, it's OBVIOUS they're thinking they can get another day or two to get the work this way.  After all, hadn't I been so pliant and naive all semester? Oh, the fools, the fools, they've played right into my hands and this is the moment I've been waiting weeks for!\n\nI double check to make sure I HADN'T missed emails from them, just to be safe (I hadnt), and then I type my response.\n\n\"No I didn't, and I did just double check after your last message.  That's okay, emails get lost sometime.\"\n\nAt this point I like to image Larry smiling while reading this.  He'd won again!  God this Professor is an idiot!  \n\nI continued \"So, what I'm going to need you to do is go back into the email you sent me with the work.  Just take a screenshot which has the timestamp of the email and forward that to me along with the work.  That'll prove you sent it on time.\"\n\nI then responded to Hanna's email saying the same thing.\n\nWhat was their response?  Did their eyes widen as they realised they'd been held accountable for their actions?  Did panic set in?  Were their tears?  Howls of Regret?  The gnashing of teeth and rending of hair?  \n\nSadly, I'll never know.  I never heard from them again.  They didn't even bother making another try.\n\nAnd me?  Well, I decided to buy some more beer that night to celebrate once again.\n\nOccasionally I'll tell my current students the tale - a humorous reminded that 1) yes, I'm accommodating 2) yes, I'm pretty laid back.  But 3) I'm not an idiot, and don't try to play me.\n\nIt usually gets a good laugh (and if some of those laughs sound a wee bit nervous?  All the better).",
    "comments": [
        {
            "level": 0,
            "comment": "I never realized how many grandparents died until I started teaching college part time! Some people need accommodation and I’m happy to do that but your crappy time management isn’t my fault… do you think a boss would let you constantly miss deadlines?!",
            "score": 563,
            "author": "r4catstoomant",
            "replies": [
                {
                    "level": 1,
                    "comment": "1 guy tried that when he worked at a Krogers, forgetting that he got that job because his parents were friends with the manager.  So when the manager called the parents to give her condolences, the truth came out. He got fired, and from what I heard, I got a lot of shit at home. Apparently, they were superstitious, and their son saying that cursed the grandmother, and if she died soon, it would be his fault. I would feel bad for him if I didn't absolutely hate his guts.",
                    "score": 266,
                    "author": "petty_witch",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Deadass this is why I never used this lie, though. I don’t think of myself as superstitious, but the idea of putting that out in the universe made me uncomfortable. Then my aunt actually died two weeks before finals. That was awkward as well because I figured everyone would assume I was lying. So much so that my parents called my university to inform them.",
                            "score": 114,
                            "author": "thiswillsoonendbadly",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My mom died during the finals. She was sick tho so I saw it coming and I had the obituary to prove it was real. I’d still have preferred to go to the finals tho.",
                                    "score": 9,
                                    "author": "GreenspaceCatDragon",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "When my Grandma was in the hospital for the last time, dying, she kept asking for me. We knew it was the end so of course I missed work to see her. I got a final warning for attendance, and part of a final warning was writing an action plan to prevent it from happening further. I told my manager that my action plan would say that I missed work because my dying grandma wanted me in the hospital with her, that she was now dead so it would not happen again, but that if another dying family member asked for me that I would be there. They waived the final warning. \n\nWhen it came time to pay for grievance time, which applied to grandparents, they said the obituary didn't count because it didn't have my name. I wrote the obituary, it had my name, but it had \"Andy\" instead of \"Andrew\" so they wouldn't accept it.",
                                            "score": 10,
                                            "author": "IndyAndyJones7"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "One time I parked in a handicapped space because no where else was near.\n\ntwo weeks later I developed crippling autoimmune arthritis.",
                                    "score": 15,
                                    "author": "kaenneth",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "damn...",
                                            "score": 5,
                                            "author": "SufficientRemote3349"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Same. I’m not superstitious but I do believe in horrible coincidence.",
                                    "score": 24,
                                    "author": "firedmyass",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "So you are a little stitious?",
                                            "score": 29,
                                            "author": "Obi-one",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "They're substitious.",
                                                    "score": 3,
                                                    "author": "InigoMontoya1985",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "They're below stitious?",
                                                            "score": 1,
                                                            "author": "IndyAndyJones7",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Exactly.",
                                                                    "score": 0,
                                                                    "author": "InigoMontoya1985"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "slightly?",
                                                    "score": 7,
                                                    "author": "firedmyass"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I am.\n\nAnd I understood that reference. I was going to make it myself but you did it first. And therefore better.",
                                                    "score": 2,
                                                    "author": "IndyAndyJones7"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "And that’s why you kill off the relatives that are ALREADY dead.",
                            "score": 21,
                            "author": "Tallisina"
                        },
                        {
                            "level": 2,
                            "comment": "&gt; he got that job because his parents were friends with the manager.\n\n&gt; he worked at a Krogers\n\nwhew buddy",
                            "score": 13,
                            "author": "Annual-Intern5669",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Given his personality, I'm not surprised he couldn't find a job. According to him, he was working in IT after college, but once they had layoffs, he was one of the first ones fired. Cause he was 'over qualified'. Then he would go on rant on how he was too good for this job and how he wasn't supposed to be working here. Then, he would go on and on about how much better he was than everyone there cause he had a future. He was freaking annoying.",
                                    "score": 9,
                                    "author": "petty_witch",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "He's the same guy who says that he was kicked out of Navy Seal training for kicking his DI's ass",
                                            "score": 2,
                                            "author": "KJParker888"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I have this friend with honestly the worst luck possible. \n\nHer first semester of college, her dad dies one week before finals. She goes to her advisor, he gets all teachers to allow her an extension or projects instead of finals.\n\nSix months later, her second semester of college, her grandpa dies one or two weeks before finals. She goes to her advisor. This time he asks her for a death certificate, and then gets all the teachers to give her an extension or projects instead of finals... again.\n\nSix months later, her third semester of college, her grandma dies one or two weeks before finals. She goes to her advisor. He asks for the death certificate and for the date and place of the funeral. After she produced the death certificate, he gets her extensions again, but afterwards he actually went to the funeral to see it for himself.\n\nLuckily that was the end of it, no more deaths in the family since. But either way, that was a horrible situation for my friends, and her advisor was 100% justified in doubting her. She jokes that on her fourth semester, her advisor checked in with her every single day for the two weeks before finals because he was half convinced that either her, her brother or her mom would die.",
                    "score": 92,
                    "author": "LemurOfTheWorld",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That is indeed awful timing. \n\nFortunately, I was well out of school when the following happened: I had one grandfather pass away about 3 weeks after my wedding. Grandma on other side died around 3 weeks after that, and grandma on the first side died about 10 days after that. All told, 3 grandparents passed in 32 days. When I got the call at work from my folks for the third one, I walked into my boss's office and said, \"I know you are going to say you've heard this one before...\" \n\nThe were all in their 90s and had failing health for some time, so it wasn't a shock or a surprise. Then less than 3 weeks later, my husband's uncle died, too, and then a family cousin on my side the next day. Ended up being 5 family members between November 1 and December 31. It was bonkers.",
                            "score": 34,
                            "author": "QueenMAb82",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Seems like someone with blood feud levels of anger against your family got hold of a Death Note.",
                                    "score": 6,
                                    "author": "curiosityLynx"
                                },
                                {
                                    "level": 3,
                                    "comment": "Back in 2004 I ended up at six funerals in six weeks. It was insane. Four of them were expectable (elderly/in poor health and/or cancer), one was a suicide, and one was a complete shock (died while getting kidney dialysis for the first time). It was NOT a good summer. ☹️",
                                    "score": 6,
                                    "author": "NotSorry2019"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "omg, that is awful and wierdly hilarious all at the same time",
                            "score": 8,
                            "author": "roxinmyhead"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I always tell my students \"If you lose a grandparent, please talk to me!  If you lose six this semester ... I'm gonna have questions!\" :D",
                    "score": 42,
                    "author": "WisconsinHistoryGuy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "“Yes, I KNOW that this is the sixth grandmother to die this semester! It’s not my fault that grandpa keeps getting remarried!”",
                            "score": 13,
                            "author": "Von_Moistus",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "One of my great-grandfathers outlived like 4 or 5 wives. I only ever met the last one who outlived him.",
                                    "score": 6,
                                    "author": "IndyAndyJones7"
                                },
                                {
                                    "level": 3,
                                    "comment": "Bwahahahahahah!!!!!  Oh thsts good! :)",
                                    "score": 6,
                                    "author": "WisconsinHistoryGuy"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I remember one kid who lost 6 or 7 grandparents in a space of 18 months.  Either bad luck, or he liked 3 day weekends.",
                            "score": 14,
                            "author": "Catlenfell"
                        },
                        {
                            "level": 2,
                            "comment": "It's possible though. If you count step grandparents",
                            "score": 5,
                            "author": "IndyAndyJones7",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah.  My mother's parents were divorced and remarried, so I grew up with 6 grandparents.\n\nThen, when her father died, his 2nd wife remarried, so there was a 7th.",
                                    "score": 1,
                                    "author": "This-Ad-2281"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "For an alternate situation... My mother died 4 hours before I took a midterm.  \n\nI got a 4/100 on it.  Not a typo.  A four.  I think I spelled my name right, but that's about it.  The rest of the exams I took that week didn't go much better.\n\nIt took me years to get my academic career back on track after that week.",
                    "score": 13,
                    "author": "Sooner70"
                },
                {
                    "level": 1,
                    "comment": "Actually my grandfather did die 2/3rds through my last semester.  But I had a B in the class and was sobbing hysterically when I called the professor (pre-email)",
                    "score": 13,
                    "author": "LiveandLoveLlamas"
                },
                {
                    "level": 1,
                    "comment": "In my defense, I was drunk when I used that excuse in 1990.  It was my step grandma and we were still using electric typewriters!  Papers took  a long time to finish.",
                    "score": 10,
                    "author": "restingbitchface2021",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Losing all three in such a short time must have been so hard for you! ;) No wonder you needed a drink!",
                            "score": 3,
                            "author": "C_beside_the_seaside"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My freshman year my grandmother died two weeks before I moved into the dorms and then my grandfather died exactly 28 days after her death. So, 2 weeks in and I'm already requesting extensions. I'd heard the dead grandparents bit before so I took the obituary with me, thinking it might help. TA didn't care, I was welcome to my delay.\n\n6 weeks later I get strep that isn't discovered until it moves into both ear canals. Again, she doesn't want the drs note, stuff happens and freshman are flaky. I ask for a week, she gives me two. \n\nThen I blew my knee out jogging (it partially dislocated and I jogged on it out of the socket until it gave way entirely). That meant Drs appointments, specialty visits, missed classes. Again, she just shrugged and gave me an extension. I was apologetic all the way through, we had several good conversations, I always turned my stuff in by the extension date, and I never asked for a second extension on anything. \n\nThe last time I apologized she told me at least I hadn't killed my grandparents more than once. She apparently never truly believed me, but also didn't really care. Now that I'm a real adult, the idea of shepherding baby college students through their first year sounds exhausting. After several years it's no wonder she didn't care!",
                    "score": 3,
                    "author": "CheckIntelligent7828"
                },
                {
                    "level": 1,
                    "comment": "I just started a new job recruiting truck drivers and they often talk about safety. There will be a long monologue over safety and then they wil stop and ask what the most dangerous thing is on an unexpected person. We then tell them it’s to be the grand parent of a truck driver",
                    "score": 2,
                    "author": "Crwheaties"
                },
                {
                    "level": 1,
                    "comment": "I have a friend who teaches at a college not far away, who accepts the death of one grandparent per student per semester. For any more, they have to bring a copy of the obituary.",
                    "score": 2,
                    "author": "pocapractica"
                },
                {
                    "level": 1,
                    "comment": "lol someone once said, \"remember, whenever you start a new job, you still have all four grandparents\"",
                    "score": 2,
                    "author": "increbelle"
                },
                {
                    "level": 1,
                    "comment": "Both of my grandmother's died on the same day separately whilst I was at university. I.e. it definitely does happen",
                    "score": 4,
                    "author": "___Phreak___"
                },
                {
                    "level": 1,
                    "comment": "&gt; do you think a boss would let you constantly miss deadlines?!\n\nOnly for a few months",
                    "score": 2,
                    "author": "TeaKingMac"
                },
                {
                    "level": 1,
                    "comment": "“I didn’t realize how many grandparents died until I started working with people who are 18+ and have grandparents that are at retirement age” ….. you work with young adults, of course older people dying is going to be a common reason for accommodations",
                    "score": 2,
                    "author": "idkANYTHINGhbu"
                },
                {
                    "level": 1,
                    "comment": "We all die at some point.",
                    "score": 1,
                    "author": "Rich4477"
                },
                {
                    "level": 1,
                    "comment": "Hey we're all allowed two grandmother's funerals a year! It's in the rule book!",
                    "score": 1,
                    "author": "Embarrassed-Dot-1794"
                },
                {
                    "level": 1,
                    "comment": "![gif](emote|free_emotes_pack|joy) true. From one professor to another though, I have a grad school friend who legitimately lost 3 grandparents in one semester her first semester in undergrad. I'm sure she had no problem showing proof, but sometimes truth is stranger than the fiction students make up instead of admitting they have zero time management skill!",
                    "score": 1,
                    "author": "BookNeat7896"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I remember one time a student pulled the \"my paper is done but my laptop died right before I could send it, I have to take it to a data recovery service, look it won't turn on\"\n\nI pulled a bootable linux USB from my desk and called up her files right in front of her - no surprise at all, the paper was no where close to done at all",
            "score": 133,
            "author": "bjorneylol",
            "replies": [
                {
                    "level": 1,
                    "comment": "See, I'm a fan of the wink and a smile.  I pulled those excuses on my profs as a student - they knew, and they accepted it.  \n\nThe problem is when people don't realize we know, and try to take advantage 9f their supposed cleverness.  Ans that's when the Hammer needs to come down",
                    "score": 79,
                    "author": "WisconsinHistoryGuy"
                },
                {
                    "level": 1,
                    "comment": "See, in a large class you submit the file but alter the XML so it shows up as gibberish when opened. \"Oh no, must've gotten messed up on the university's mailserver! Sure, I'll re-send it to you right now.\" And you got yourself a couple extra days to finish up.",
                    "score": 3,
                    "author": "Just_Aioli_1233"
                },
                {
                    "level": 1,
                    "comment": "Ah, the classic linux in a pen drive. 9 out of 10 computer savvy people have one.",
                    "score": 2,
                    "author": "orig_cerberus1746"
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;Just take a screenshot which has the timestamp of the email and forward  that to me along with the work.  That'll prove you sent it on time.\"\n\nIs doctoring a few digits on a screenshot not a trivial matter?",
            "score": 122,
            "author": "KarlSethMoran",
            "replies": [
                {
                    "level": 1,
                    "comment": "These are the same people that managed to get FS and never turned in work though.",
                    "score": 76,
                    "author": "5weetTooth"
                },
                {
                    "level": 1,
                    "comment": "Depends on the age of those students, but mostly they also had to send the work with the screenshot.",
                    "score": 45,
                    "author": "Any-Opportunity6128"
                },
                {
                    "level": 1,
                    "comment": "Ah, but they also had to forward the work as well...",
                    "score": 10,
                    "author": "Maximum-Dealer-6208",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Why the screenshot then? \"Resend the email within an hour or fail\" would suffice.",
                            "score": -7,
                            "author": "KarlSethMoran",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "But that wouldn’t prove that it had been submitted on time, like they were claiming, and would end up giving them an extension past when OP said the absolute deadline was. The screenshot is to prove their claim that it was submitted on time",
                                    "score": 1,
                                    "author": "wolfguidingcrow",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "But we already established that doctoring the screenshot is a trivial matter and thus it proves nothing.",
                                            "score": 2,
                                            "author": "KarlSethMoran",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Whether or not the screenshots are legit doesn’t matter, it’s an extra step for them to take in order to pass, ie more effort which OP was confident they wouldn’t put in in the first place since they had proven to not put in any effort the rest of the year. Also, it’s not necessarily something that just anyone can do off the cuff. It’s not difficult to figure out how to do it, but for someone who’s not already familiar with photo manipulation it might never even cross their mind",
                                                    "score": 1,
                                                    "author": "wolfguidingcrow"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Then the professor would have to grade any work they had managed to slap together, which is a risk I wouldn't be willing to take given the hoops to changing grades once they are submitted at least at the schools where I've worked.",
                                    "score": 1,
                                    "author": "BookNeat7896"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That only works if they could accompany the doctored screenshot with the missing assignments.",
                    "score": 4,
                    "author": "Maleficent-Dirt3921",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Which goes to show that the trick was \"send me the assignments, stat\", not \"send me a dated screenshot\".",
                            "score": 1,
                            "author": "KarlSethMoran"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I always get students who show me how they can mess with this stuff. It was about ten years ago that someone showed me how you can change the “last edited” date on any Microsoft Office file by just changing the day and time on your computer, but I haven’t bothered to find out how this works with Office 365. 🤔",
                    "score": 1,
                    "author": "SincerelyCynical"
                },
                {
                    "level": 1,
                    "comment": "You can literally forward yourself an email and adjust the details and forward it again and screenshot it. I literally do this with my AEP power outage emails when I want to skip meetings. I live in an old neighborhood with old power lines. If there’s wind and rain there’s bound to be a small outage.",
                    "score": 1,
                    "author": "ThxItsadisorder"
                },
                {
                    "level": 1,
                    "comment": "Yeah, doctoring screenshots in college was how I got so good at editing images.\n\n&gt;!No, I won't do it for you.!&lt;",
                    "score": 1,
                    "author": "Just_Aioli_1233"
                }
            ]
        },
        {
            "level": 0,
            "comment": "ya know, I’ve only just finished my first year at a community college, but when I needed an extension due to my lack of time management, I just owned up to my own shortcomings and emphasized my commitment to finishing the assignment/semester.",
            "score": 9,
            "author": "GoldenPorridge"
        },
        {
            "level": 0,
            "comment": "I've a feeling you'd have had a better class if you'd just dropped them... with an F... for lack of participation!",
            "score": 22,
            "author": "HMS_Slartibartfast"
        },
        {
            "level": 0,
            "comment": "Beer me that failing grade, please.",
            "score": 28,
            "author": "CoderJoe1"
        },
        {
            "level": 0,
            "comment": "This is the most beautiful thing I've read on Reddit. \n\nI remember watching people like this around me in HS and college and it terrified me because, forever and ever, I have had a lot of issues in life and have needed extensions. I've always been scared that someone else is going to burn the accommodating teachers and ruin it for people who actually need it. I complied with every extension I was ever given- *because it only takes one asshole to ruin it for everyone.*",
            "score": 4,
            "author": "Human-Pair2009"
        },
        {
            "level": 0,
            "comment": "I love justice, and they did it to themselves, which I love even more 🥹",
            "score": 19,
            "author": "clawcodes"
        },
        {
            "level": 0,
            "comment": "There's this student that keep on and on about his missing class, mostly the reasons was he's sick, had to stay in his dorm and unable to go anywhere. One day I got tired, and demand to see his Your Timeline on google. Well, look who's sick and unable to go anywhere! His activity clearly shows that he went on tour those days. I still remember him trying to make excuses in front of my desk, but then silently accepting his defear.",
            "score": 3,
            "author": "theblissofchildhood",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oooh, brilliant!!!!!",
                    "score": 1,
                    "author": "WisconsinHistoryGuy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Great story. I wonder if they had the work at that point though. Hopefully they had done it all, but just couldn’t take the screenshot of the “email they had sent Friday”. Did they think you would say, “damn, guess I lost it, you both get A’s since I never got those emails.”",
            "score": 11,
            "author": "LookAwayPlease510"
        },
        {
            "level": 0,
            "comment": "You typed all that on your phone ?!",
            "score": 6,
            "author": "noofa01",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am a wordy sonuvabitch! :D",
                    "score": 27,
                    "author": "WisconsinHistoryGuy"
                },
                {
                    "level": 1,
                    "comment": "This encouraged me to try a typing test on the phone keyboard for fun. After a quick 1 minute test I scored 55wpm with 96% accuracy.",
                    "score": 1,
                    "author": "Dalbaeth",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Is that two finger typing or using a keyboard app like SwiftKey?",
                            "score": 1,
                            "author": "faux-netic",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Two thumbs, standard iPhone 12 mini keyboard.",
                                    "score": 1,
                                    "author": "Dalbaeth"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That's all very interesting but what video game were you playing?",
            "score": 2,
            "author": "peabuddie"
        },
        {
            "level": 0,
            "comment": "I'd have just manufactured the screenshot for you...",
            "score": 1,
            "author": "___Phreak___",
            "replies": [
                {
                    "level": 1,
                    "comment": "You can’t manufacture a semester’s worth of work though lol",
                    "score": 3,
                    "author": "MinutesTilMidnight"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Man I wanna be you",
            "score": 1,
            "author": "LabEcstatic1219"
        },
        {
            "level": 0,
            "comment": "Whenever I read stories like this, I always just think - what is the fucking point of bothering to be on the course? If you truly are that lazy, why would you purposefully enrol and then purposefully not do the work? I just don't get some people.",
            "score": 1,
            "author": "VeronicaMarsIsGreat"
        },
        {
            "level": 0,
            "comment": "Cool story, but I think you might have been a little too smug considering how easily they could have uno reversed the screenshot bit.",
            "score": -6,
            "author": "dsp_pepsi",
            "replies": [
                {
                    "level": 1,
                    "comment": "Even if they made a screenshot, that wouldn’t help them complete a semester’s worth of work.",
                    "score": 4,
                    "author": "MinutesTilMidnight"
                },
                {
                    "level": 1,
                    "comment": "How?",
                    "score": 2,
                    "author": "fortalameda1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I want Hanna to dominate me 😁",
            "score": 0,
            "author": "CryptographerOk5726"
        }
    ]
}