{
    "id": "13wan9q",
    "score": 542,
    "title": "Burger King Manager Story",
    "author": "jeffhasabadusername",
    "date": 1685502674.0,
    "url": "https://www.reddit.com/r/pettyrevenge/comments/13wan9q",
    "media_urls": [],
    "other_urls": [],
    "postText": "Many moons ago, I worked at Burger King as an hourly manager while in college. I liked the job; I could do three or four shifts / week when I was in school and it was really easy to be full time when school was out as I would cover vacations for both my store and other, nearby stores. \n\nAt one point, the store manager (SM) changed and the new guy was a piece of work. He had been a manager with Burger King for about 20 years. After he had been at the store for a week, I saw why he never got promoted. He did no work, nobody liked him, he complained about everyone, he would give staff a hard time, and, most amazingly, he had this way of disrupting the service line that made everyone tell him they had it under control and he should go back to his office.\n\nI used to volunteer to close on holidays and stuff. I mean I was a college student and wanted the hours. Also, this was the 80's, so closing time on days like NYE and Xmas Eve was 8pm or earlier when  it was really slow.\n\nClosing NYE included a bit more work as we had to do a full inventory and significant paperwork. The first time I did this, I worked with the old SM and she was great; we both worked hard and we were done in 90 minutes flat. She also showed me how to do the paperwork. I had done the next two NYE's closes by myself including the paperwork.\n\nThe year after that, when SM  had been at the store for like 4 months, SM  decided he was going to close NYE with me. I was pissed as I was wanted to be at a friends NYE party by 11:30pm and I knew he would make it take forever. That shouldn't have been an issue but this guy was a grade A shmuck.  I am pretty sure he worked this shift on purpose because he knew I would do all the work and he could just sit on his butt and take all the credit.\n\nI did speak with him a little bit during the shift, telling him about the party he wanted to go to. He shared that he told his wife he would be home by midnight so they could welcome the new year together.\n\nSince there were two of us, he didn't schedule an extra staff member. As I expected, he sat on his tuchus all shift so inventory didn't start until we closed. We finished that up about 11pm and start on the paperwork. He insists he has to do it. When I ask to leave, he tells me I have to stay so I can watch him do the paperwork. I asked why but he was just being an ass so I stayed.\n\nHe was the slowest person with the paperwork I had ever seen. It's now 11:30 and he is barely halfway through. I want to get to my friends party before midnight so I ask if I can finish the paperwork at home, sharing that I will bring it to my shift tomorrow night. Since the paperwork isn't collected right away, the delay shouldn't be an issue. He agrees, and I grab all the paperwork and punch out and head home\n\nI do the paperwork and, as promised, bring it into my next shift. Later that week, I'm working when the DM is there. I had a great relationship with him; he loved that I would help cover at other stores, even last minute when I could. I ask him how to report the time I worked at home on the on the year-end paperwork? He gives me the strangest look and just says something like \"huh?\". So I tell him the  story of our close that night. He was pissed. \n\nTwo days later, I come in for my shift and am told that we will be getting a new store manager next week, the old one was fired. I did a little dance which was fine since the assistant manager who told me the news was smiling.\n\nI talked to the DM later about what happened. He said that the SM was on probation for all of the problems that were happening at the  store, including many that happened prior to him transferring to this store. My story was just the last straw. It was then that I realized I got  my revenge, even though I hadn't realized I was doing so until it was too late.",
    "comments": [
        {
            "level": 0,
            "comment": "I closed at \"The King\" back in '82-83. We had an asshole manager who treated everyone like shit. We were out drinking beers in the parking lot at 4AM after the close. He looked really surprised to see the full crew of closers when he came out to his car carrying two grocery sacks. He was stealing meat and cheese, had two full hams, blocks of cheese and a bunch of pies. \nIn the short, he was never seen again after that close. Fairly certain a salty crew turned his ass in.",
            "score": 199,
            "author": "MGC00992",
            "replies": [
                {
                    "level": 1,
                    "comment": "Bk had full hams?",
                    "score": 18,
                    "author": "Aries_Bunny",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "For the steamed hams!",
                            "score": 11,
                            "author": "Outrageous_Act585",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "https://youtu.be/4jXEuIHY9ic\n\nI can only assume you meant this",
                                    "score": 4,
                                    "author": "koolaidgrl",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Of course!!",
                                            "score": 3,
                                            "author": "Outrageous_Act585"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yes. For the ham and chese sandwich. We sliced the meat every morning.",
                            "score": 24,
                            "author": "MGC00992"
                        },
                        {
                            "level": 2,
                            "comment": "This stood out to me as well.  I am pretty sure they don't and never have.",
                            "score": -4,
                            "author": "avonsanna",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What do you think they make the HAMburgers from?",
                                    "score": 10,
                                    "author": "chipplyman",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ooof",
                                            "score": 3,
                                            "author": "avonsanna"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Beef",
                                            "score": 2,
                                            "author": "SugarSweetStarrUK"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I used to get the ham and cheese bagel from BK on the regular in the 80s.",
                                    "score": 2,
                                    "author": "fabshelly"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I worked at BK in the 2000s. One SM got caught drinking on the job. One SM was So far he needed 2 (yes, *two*) DT belts put together. And then it was still a squeeze. One was a diabetic who didn't take care of himself. He passed out more than once. DM forgot to enter our payroll once. Checks were so late 2 of us had to start our shift late in order to make it to the bank so we'd have gas money to get home.",
            "score": 17,
            "author": "Beauknits"
        },
        {
            "level": 0,
            "comment": "Nice!! I work at McD, can relate",
            "score": 12,
            "author": "Bmilvis"
        },
        {
            "level": 0,
            "comment": "What was the problematic part of your story that got SM fired? That you took company paperwork home? That you accrued hours beyond closing, at home? That closing took so long?\n\nI guess SM assumed he could Have it His Way (TM) but he was wrong",
            "score": 26,
            "author": "AcrobaticSource3",
            "replies": [
                {
                    "level": 1,
                    "comment": "Honestly, I think it was me taking the work home thus working without getting paid but it's been a while. I seem to remember something about the manager telling the DM that he did all the work when the paperwork was collected but that memory is pretty hazy and might be false.",
                    "score": 47,
                    "author": "jeffhasabadusername",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That would have been my guess based on what you said about the guy. He sounds like the type who tries to pretend that they're the only thing holding the place together and if not for them the entire rest of the store would fall apart because of the incompetence of others. Not ever realizing that the boss is going to be able to tell that problems always seem to follow that particular person whenever they're working, no matter the store. \n\nNo real petty revenge, but I long ago worked at a McDs and one time they brought in a couple of managers from a nearby store for some reason or another. They were acting like complete asses towards everyone, so I made a point of giving them a hard time on behalf of my coworkers. I didn't really need the job unlike some of them, so even if something had happened it wouldn't have been a huge deal. Think they tried to do something, but all that happened was one of the assistant store managers asked me about it, I told them how they were being jackasses towards everyone, and that was essentially the end of it. Guessing I was just sort of confirming something they already knew or suspected. Ah, the fast food world. How I don't miss it.",
                            "score": 23,
                            "author": "FreddyForshadowing"
                        }
                    ]
                }
            ]
        }
    ]
}