{
    "id": "13wbaog",
    "score": 39,
    "title": "Roomie assumed my brother &amp; I were his personal butlers, while we were just being courteous.",
    "author": "RealityCheck18",
    "date": 1685504567.0,
    "url": "https://www.reddit.com/r/pettyrevenge/comments/13wbaog",
    "media_urls": [],
    "other_urls": [],
    "postText": "I got a new Job at a City new to me. My brother too had a work transfer to the same city. So, we both ended up renting a 1 Bedroom apartment, kind of close to both our offices. Food options nearby wasn't that good unfortunately.\r  \n\r  \nWe would co-ordinate cooking &amp; chores between us, through text messages. Things were going smooth without any major hurdles. One day, my cousin (let's call him K) called the both of us and informed us that his other cousin (from his mom's side) was also moving to our city and he was also going to work at the same office as my brother. Our cousin wanted to know if we are comfortable sharing apartment with him.\r  \n\r  \nWe moved to a 2 Bedroom unit in the same apartment. So, my brother &amp; I got a new roommate, who was our cousin's cousin (let's call him V). My brother &amp; I shared a room and V got his own room. He moved in and within 2 weeks had to travel out of country for some work related meetings and then 3 weeks later he was back and was just settling down. He was still going through Jetlag and my brother and I were happy to give him some slack and we both shared the chores.\r  \n\r  \nWe were planning to give him a couple of weeks to settle down and in the meantime we were hoping he'd start volunteering for chores . V knew nothing about cooking, so we thought of giving im shopping &amp; prep work duties, with occasional cleaning.\r  \n\r  \nAround this time, my mom met our cousin K by chance and while speaking he mentioned to my mom that V had casually told him that my brother &amp; I are his \"personal butlers\" and he's having an amazing time, living like a KING. My mom was furious, called me and informed about V's comments. My brother &amp; I felt like Idiots and it was time for payback.\r  \n\r  \nThe apartment we lived was literally a minute's walk from a Railway terminal and there was a train to the City center almost every 15 mins, which would connect to other trains or buses. Since moving to the new city, my brother &amp; I never explored the city, and we decided now was the time. V usually woke up after 11AM on weekends, but my brother &amp; I usually woke up earlier. Instead of cooking we both would leave, take the train and tour the city, and around 11AM, we'd text him the menu and ask him to shop &amp; cut veggies, wash the dishes from the prev day, clean the home etc. There were times when we'd ask him to do prep but my brother &amp; I would have lunch outside, and come home after 3 PM and he'd sill be waiting not knowing what to do. Remember? Earlier I mentioned food options weren't good nearby. He'd be starving, literally.\r  \n\r  \nOn weekdays, I'd text him the instructions on what veggies to cut, what prep work to be done, and other instructions. He was taken aback by the sudden changes and not being treated royally. Since, he doesn't know cooking, my brother &amp; I would make him believe we're cooking something complex and making him do all the other chores.\r  \n\r  \nHad V been a stranger it would have been easier to establish rules, but being related it was weird to set rules on day 1 and hence my brother &amp; I decided to slowly transition the chores, but he gave us no choice.\r  \n\r  \nYears later, I met him on the day of his wedding reception. He introduced me to his wife mentioning how we were related and about the few months we shared apartment. While handing over the gift I casually mentioned - \"Hope you learnt to cook now, as you cannot get personal butlers anymore.\" The expression on his face showed he understood.",
    "comments": [
        {
            "level": 0,
            "comment": "If you were just roommates, why were you planning meals and meal preparation together? I understand if you and your brother were in a routine of doing that, but it’s weird to expect that from someone you are just roommates with",
            "score": 2,
            "author": "krock111"
        },
        {
            "level": 0,
            "comment": "Play stupid games win stupid prizes !!  Served him right 🤣",
            "score": 1,
            "author": "HomeOk4720"
        }
    ]
}