{
    "id": "13xjrox",
    "score": 1465,
    "title": "[update] Petty revenge on my jerk of a neighbor",
    "author": "TheRyeWall",
    "date": 1685631523.0,
    "url": "https://www.reddit.com/r/pettyrevenge/comments/13xjrox",
    "media_urls": [],
    "other_urls": [
        "https://old.reddit.com/r/pettyrevenge/comments/13dp3t6/petty_revenge_on_my_jerk_of_a_neighbor/),"
    ],
    "postText": "A few weeks ago I posted about an altercation with my neighbor(https://old.reddit.com/r/pettyrevenge/comments/13dp3t6/petty_revenge_on_my_jerk_of_a_neighbor/), I thought I'd give an update.\n\nThe few days after the altercation, when I would come home and pull into the driveway the jerk would walk out front and watch me pull into my garage. After the third time I decided to let him taste his own medicine. I walk down to the curb and collect the mail, and as I am walking up I see Jerk staring at me, so I just stop and stare right back. After about 5 seconds of staring him down with a bemused look on my face he throws his hands up in the air like he is confused.. He yells over to me that 'I don't have a problem', and I respond with well you keep watching me go in and out of my house like you have something you want to say, and he says 'well yeah, you tore me a new asshole the other day', which might be true.\n\nSo I explain to him that the reason I am not willing to talk/work with him is because of how he treated us when we had to shovel snow, and that the only reason we had to shovel was because we were told he is the reason the snow removal service cancelled, due to the way he parks his truck. He says this is the first he is hearing of this, and that no one told him that his truck being parked there was an issue. At this point I get a little apologetic for my rude outburst a few days earlier, because if he doesn't know then I don't believe I can blame him.. He agrees to give me his phone number/email so that I can contact him regarding issues with the private drive, and says he is willing to move his car for snow removal. He does derail and go on a few tangents regarding the elderly neighbor, apparently they have been at each others throats since Jerk moved in, and he refuses to talk to the elderly neighbor. I explain that I'm not going to get in the middle of their squabbles, but from my perspective the elder neighbor is helpful, he helped shovel snow, and Jerk did not. In the end I told him I would take my yard waste a little further down like he initially asked.\n\nThe next day I contact the other neighbors, and explained that Jerk's stance is that he had no knowledge his truck was causing problems for the snow removal. The next day the elderly neighbor puts a photocopy of a receipt he sent to Jerk over a year ago in my mailbox, the receipt has a message for Jerk that says the snow removal service is complaining about his truck and they are threatening to cancel service. Which implies Jerk lied to me that he had no knowledge his truck was an issue. \n\nA week goes by and I get a rude text message from jerk. It accuses me of putting additional yard waste in the area I agreed not to, and he says I am doing it just to piss him off. I respond with 'Check your facts, I didn't put anything there'. He then does apologize for being rude and says it must be one of the other neighbors.\n\n\nThat brings me to today. The way I see it I should try to work with him and get along, but at the same time I am not going to let him take advantage of my or the other neighbors kindness. I believe in the iron rule, as long as he chooses to act like a Jerk he is going deal with a jerk.",
    "comments": [
        {
            "level": 0,
            "comment": "I don't foresee him singing kumbaya with you or your neighbors anytime in the future.  Keep him at arm's length.",
            "score": 577,
            "author": "CoderJoe1",
            "replies": [
                {
                    "level": 1,
                    "comment": "100%",
                    "score": 184,
                    "author": "TheRyeWall"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Talk to the landlord- get his name from property tax office. Let him know the issues &amp; request he get involved \nObviously the landlord comment got his attention so I doubt this will be the first he has heard of it",
            "score": 67,
            "author": "Awesomekidsmom",
            "replies": [
                {
                    "level": 1,
                    "comment": "Many of these records are available free online through the county assessors office.",
                    "score": 10,
                    "author": "Youwhooo60"
                }
            ]
        },
        {
            "level": 0,
            "comment": "He definitely seems like the problem. He doesn't know how to communicate or be neighborly",
            "score": 330,
            "author": "MyblktwttrAW",
            "replies": [
                {
                    "level": 1,
                    "comment": "What's the saying? If you smell shit everywhere you go, check your own shoes?",
                    "score": 163,
                    "author": "HarryPottersElbows",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh my gah, have I lived under a rock to not have heard this one? \n\nLove it!",
                            "score": 44,
                            "author": "KatieSu1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My go to is similar:\n\nIf you meet an asshole in the morning, you met an asshole. If you meet assholes all day, you’re the asshole.",
                                    "score": 48,
                                    "author": "Zanbuki",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I always thought that until my life was full of assholes. Then I realised I was lying down with dogs and getting up with fleas.",
                                            "score": 28,
                                            "author": "lucipurrable",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "This 💯!!! You are a very wise one to not only know this saying and the meaning of it, but the fact you also follow it as well!!! Makes a world of a difference in life and I wish more people sewed it on one of their couch pillows 😆 😆 😆!!! My momma always told me this exact same thing growing up as I tried to make new friends  but seemed to fail to notice they were a questionable one periodically! I've never heard anybody else say it, oddly enough, outside of my family who all live in the south. \n\nThis is in my opinion the best, most important, and wisest advice everyone should know and I continuously remind my 3 teenagers of it as they are creeping closer to adulthood and making new friends through junior high and high school...they HAVE TO ALWAYS check for fleas and even ticks nowadays LOL as they think about turning a stranger into a new friend! And I also add in...you are the company you keep! 🤔🤔🤔 Thanks for sharing this great piece of small advice to the Reddit world that makes a BIG difference in our lives!",
                                                    "score": 2,
                                                    "author": "AndYouThoughtWhat"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Addendum: Unless you work in retail or a customer facing job. Then it’s probably *not* you.",
                                            "score": 18,
                                            "author": "purrfunctory",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Can confirm. Recently left a 7 year stint in customer service.\n\nThough it might be that I also became an asshole because of my experiences in that role. My new coworkers haven't complained yet, however it might take some time to confirm one way or the other.",
                                                    "score": 9,
                                                    "author": "UrbanWerebear"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "the one I've learned was\n\n\"if someone call you a horse, ignore him, if every one is calling you a horse, go buy a sadle\"",
                                    "score": 13,
                                    "author": "Yosara_Hirvi"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I love this and totally an stealing it.\n\nUp until now, I've been relying on a joke of some length to make the same point. (Short version, a woman calls her husband to warn him about some idiot driving the wrong way on the interstate, and he says, \"it's not just one person -- it's everybody!!\")",
                            "score": 7,
                            "author": "OutrageousYak5868"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Hijacking top comment to add - Did anyone else notice on the original post how freaked out the jerk got when OP mentioned talking to the owner?\n\nMaybe the owner has warned the jerk before that if there's any more complaints he'll be evicted?",
                    "score": 7,
                    "author": "PSA-Warrior"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Contact the city and find out who the owners are and start contacting them directly.  This guy is an issue and only the owner has leverage on him.",
            "score": 95,
            "author": "dellaevaine"
        },
        {
            "level": 0,
            "comment": "He’s obviously concerned about you contacting the landlord. I would dump the snow removal back into his lap and ask him to find a solution to the problem he caused. Explain that under the circumstances it’s the *least* he can do, and that will go a long way toward improving neighborhood relations. If he can’t find a solution, you’ll circle back to contacting the landlord for help. Make sure he knows you’re willing to work with him to help build the community, but he needs to meet you halfway.",
            "score": 84,
            "author": "SirGkar"
        },
        {
            "level": 0,
            "comment": "Courtesy is only for those that are courteous.  You owe nothing that isn't reciprocated.  I feel the default is to be courteous and respectful of anyone initially. It is then their responsibility to return the same.  Should they choose not to, I have no further obligation.",
            "score": 25,
            "author": "Character-Date-5999"
        },
        {
            "level": 0,
            "comment": "&gt;He says this is the first he is hearing of this, and that no one told him that his truck being parked there was an issue.\n\nHe heard alright, he just chose not to listen at the time.",
            "score": 27,
            "author": "Kodiak01"
        },
        {
            "level": 0,
            "comment": "Contact the Landlord, get his ass booted. Period.",
            "score": 76,
            "author": "Mead_Man_Detroit"
        },
        {
            "level": 0,
            "comment": "Jerk neighbor is a bully and he finally realizes he is not in the school yard anymore. Stand up to this jerk every single time. **Every. Single. Time.**",
            "score": 23,
            "author": "userfakesuper"
        },
        {
            "level": 0,
            "comment": "FWIW, elderly neighbor has the copy of the receipt, that doesn't mean Jerk Neighbor saw it.\nI suck at paperwork. Legit. I know this. If that had been in my box, it would be buried in a pile. Elderly Neighbor may not realize a phone call or text message is more manageable for folks who mostly get junk mail that way, and get all important communication electronically.\n\nThey may both be telling the truth.\n\nOr Jerk Neighbor is a direct communicator and Elderly Neighbor is an indirect, and when EN politely talked around the issue, it was assumed JN would pick up the hinted at point, and JN didn't and thought EN was just.... Talking about the plow guy.\n\n If your EXPERIENCE is that JN is good with direct communication, and addresses shit when asked,.them from YOUR standpoint, no more problem! No requirement to be Switzerland, but no requirement to hold EN's grudge, either.",
            "score": 20,
            "author": "HalcyonDreams36",
            "replies": [
                {
                    "level": 1,
                    "comment": "I remember a specific example about this that someone posted a while ago. I hadn’t thought of it quite like that and while I haven’t been in that exact situation, it really made sense to me about communication types. Details might be wrong, situation itself was what stuck for me. I don’t care. \n\nSomeone said that their mom was complaining about how she knew it was going to be a long day at work and she wasn’t looking forward to doing doing the kitchen when she got home. The poster thought “yeah, chores suck” and just agreed.\n\nMom came home and the kitchen wasn’t done, so she got pissed because she was actually hinting that *someone else* should have done it and got mad at the child (who was in high school iirc, not small child). \n\nPoster said that they weren’t asked to do anything, and they didn’t pick up the hint because doesn’t everybody hate doing their chores and complains about them?\n\nBut yeah, I tend to say what I mean, I don’t make a whole lot of untold subtext read between the lines or you’re going to miss it type crap (that I think is bs). \n\nHusband DOES, however. So he puts all these words into my mouth that I never said or even thought of, and I don’t pick up on all his hidden crap either. He is *by far* the more direct person, but he offsets that with weird subtext that I miss often enough to annoy him. \n\nI don’t think that’s what’s happening with OP’s jerk, I think he’s just a jerk that lies to his neighbours, but the communication thing is still a possibility. That kind of shit does happen all the time.",
                    "score": 14,
                    "author": "_Kendii_"
                },
                {
                    "level": 1,
                    "comment": "It could be why they are at odds.  Jerk may think that elderly neighbour is making it up.",
                    "score": 9,
                    "author": "AJRimmer1971"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would do whatever was in my power to make this guy's life as miserable as possible until he moved.",
            "score": 10,
            "author": "Lonzo58",
            "replies": [
                {
                    "level": 1,
                    "comment": "And get the other neighbors involved too....",
                    "score": 4,
                    "author": "Good_Independence500"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Truth...actual truth...has no meaning for him. His truth is whatever benfits him in the moment. Stay away.",
            "score": 8,
            "author": "ego41"
        },
        {
            "level": 0,
            "comment": "Where’s the revenge?",
            "score": 8,
            "author": "ppr1227"
        },
        {
            "level": 0,
            "comment": "Stories like this are so strange but so common. I'm so confused when someone spends waaay more energy to be a jerk than it would take to just be decent. Not great. Not a Saint or superhero. Just decent.",
            "score": 6,
            "author": "lawlesswallace75",
            "replies": [
                {
                    "level": 1,
                    "comment": "Doesn’t even need to meet a low bar of decent.  It takes *zero* effort to be neutral. \n\nYou have to actively go out of your way to be an asshole.",
                    "score": 2,
                    "author": "_Kendii_"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would find the public record of who the homeowner is, and give them the evidence you have about the parking situation, at least.",
            "score": 7,
            "author": "General_Road_7952"
        },
        {
            "level": 0,
            "comment": "Maybe a group chat with all neighbors so he can't tell you one thing and then do another to the other neighbors.",
            "score": 5,
            "author": "zangster"
        },
        {
            "level": 0,
            "comment": "Reflect his attitude back at him.",
            "score": 16,
            "author": "fractal_frog",
            "replies": [
                {
                    "level": 1,
                    "comment": "Be the change...",
                    "score": 0,
                    "author": "SrslyPissedOff",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Really?  With that username?",
                            "score": 2,
                            "author": "jaybirdie26"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "He’s now a proven liar. He gets no latitude from here on out.",
            "score": 5,
            "author": "Schly"
        },
        {
            "level": 0,
            "comment": "Honestly I would have a little bbq or something of that sort and invite him over. He probably feels alienated at this point and having a small bit of camaraderie could a long way here. People are more willing to help out and be neighborly if they feel included. At least that would work for me lol",
            "score": 5,
            "author": "GreenbeardOfNarnia"
        },
        {
            "level": 0,
            "comment": "I'm sure glad I live where the nearest house to mine is at least 100 meters away.",
            "score": 4,
            "author": "revloc_ttam"
        },
        {
            "level": 0,
            "comment": "There is a lot to unpack here, but I would like to offer two observations.\n\nMy first observation is, like it or not, this is someone whom you have to live with in close proximity. It's better for your family's safety and your own peace-of-mind to try to find a common ground. I realize this is not often easily done, but do what you can to be the bigger person here. I have had my own personal experience with an aggressive neighbor and it's far a better life to try to get along than the road of constant battles you seem to be headed down. I'm not saying you need to cave to every crazy demand, only to look to establish a common ground and work toward a more beneficial relationship from there. You would be surprised to see how easily you can convert a scenario like this to a beneficial one. (Unfortunately it's also true that some people are simply impossible to work with, which leads me to my second observation:\n\nThis person at first seems to be reluctant yet possibly a little open to some level of mutual cooperation. This leads me to believe that he is either putting on a tough act, but uncomfortable with that role or is subject to pressure from other members of his household, he might simply be 'in the middle' of his own family battle. Either way, try to take advantage of this and try to engage in some form of mutual one-on-one entertainment where he can feel 'listened to'. (Playing cards, throwing darts, etc.) I really feel like this is still salvageable.\n\nEither way, document, document, document. Get your property surveyed, remove any questions of boundaries, but try to be subtle about it. Pointing a camera in plain view right at his property is only going to aggravate the situation. Depending on where you live, and as a last resort, you may be forced to get some form of protective order and the more documentation you have the stronger your argument will be.",
            "score": 4,
            "author": "nhyatt"
        },
        {
            "level": 0,
            "comment": "Directly post all city communication to his door so he directly has to see it. He cannot deny he did not see it. Then also text to the group that you all received notice of it. Then he cannot lie to anyone.",
            "score": 4,
            "author": "SpicyCatchup7580"
        },
        {
            "level": 0,
            "comment": "Honestly, with only your perspective, who knows who the jerk is here. Could easily be you.\n\nIf I have a 4x4 ( I do) and I live on a private drive that gets snowy (I do), and someone with a low clearance, front wheel drive moves in and demands I shovel snow, I would say \"no\". I don't need to. You do. It's not a community need. It's a personal need.\n\nOn top of all of this once this fella found out that he needed to park somewhere else so you all could get the snow removed, he was super willing.\n\nYou sound like the kind of asshole that lives suburban, relocates rural, and wants to be bossy with people that have lived there longer than you. \n\nAlso classist bullshit with the \"you're a renter\" bullshit. If he is a renter and you're an owner, then clearing the drive is on owners. That means you, and landlord, not you and tenant.",
            "score": 3,
            "author": "jonaselder",
            "replies": [
                {
                    "level": 1,
                    "comment": "This",
                    "score": 2,
                    "author": "JackyVeronica"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Flaming bags of dog shit on his doorstep until his attitude improves!",
            "score": 3,
            "author": "Every_Arachnid_9579"
        },
        {
            "level": 0,
            "comment": "I think you are handling him correctly. Seems you are the only one that has put him in his place. I suggest that you find out the owner’s name and contact info just in case. You might be able to obtain this information via property tax records.",
            "score": 2,
            "author": "Dry_Ask5493"
        },
        {
            "level": 0,
            "comment": "The only option at this point is to contact his landlord. There's got to be a resource available to find out who it is.",
            "score": 2,
            "author": "IndependentShelter92",
            "replies": [
                {
                    "level": 1,
                    "comment": "If in the United States, land ownership is usually public record. Shouldn't be hard to find.",
                    "score": 2,
                    "author": "RedBlow22",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's what I thought, you just have to find out where to go in your area to find out, or Doan internet search.",
                            "score": 1,
                            "author": "IndependentShelter92"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don’t wanna defend jerk, but I don’t even look at my mail it just gets tossed every day",
            "score": 2,
            "author": "kaka8miranda"
        },
        {
            "level": 0,
            "comment": "I love how by the end of this post, \"Jerk\" read as just his name.\n\nWe had a neighbor for years whose name I don't even remember, as we all just referred to him as Doofer.  \n\nThere were many nameworthy stories to bolster our choice of name.  One is that he had a penchant for not thinking about how to go about home repairs or alterations.  He decided to dig in his yard one day, for example.  Thirty minutes later, our power went out, and a truck appeared in his yard a bit later.  He never checked where any of the mains were before digging, and he knocked right into a water pipe.  The power was turned off by the utility company to ensure no one accidentally fried, I guess.\n\nI poured a glass of wine and rubbernecked through our curtains, Mrs. Kravitz style, while he tried to explain to the water people what he did.\n\nDoofer was as Doofer did.\n\nLikewise, I see that Jerk is as Jerk does.",
            "score": 2,
            "author": "derpne13"
        },
        {
            "level": 0,
            "comment": "Jerk of w neighbor made a different post about OP\n\nLol",
            "score": 2,
            "author": "jerry111165"
        },
        {
            "level": 0,
            "comment": "I'm really wondering what the shape of the drive is and what the company used to shovel snow. Not that it actually matters, I'm just interested.  Here most places use small bobcats that can get in and out easily...but we don't get a lot of snow here.  Yes I realize this isn't really pertinent, I'm just trying to get a mental picture.",
            "score": 2,
            "author": "ARTiger20"
        },
        {
            "level": 0,
            "comment": "He’s a narcissist who is trying to gaslight you. Pretend he doesn’t exist.",
            "score": 1,
            "author": "highjinksabound",
            "replies": [
                {
                    "level": 1,
                    "comment": "That isn’t gaslighting. Stop trivializing it. It’s a very serious form of abuse",
                    "score": 3,
                    "author": "Electrical_Parfait64",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Doing these things, then lying about them, consistently, is gaslighting",
                            "score": 2,
                            "author": "highjinksabound"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "My newer next door neighbor has the corner lot.  They said that way you only have to deal with one immediately adjacent neighbor on the side.    We are all very happy to be neighbors.  They just have more snowy sidewalk to clear.  Ours is so small of a sidewalk, they make it so it’s usually snow blown before we walk out the door!",
            "score": 1,
            "author": "YaxK9"
        },
        {
            "level": 0,
            "comment": "Deal with the owner of the house.  The jerk is not going to give you peace",
            "score": 1,
            "author": "Effective-Penalty"
        },
        {
            "level": 0,
            "comment": "&gt; The way I see it I should try to work with him\n\nWhy?  He lied to you about not knowing the snow issue just to get one over on you.  He has shown over and over that he's not interested in cooperation.  Talk to the owner.",
            "score": 1,
            "author": "kevin_k"
        },
        {
            "level": 0,
            "comment": "You have to live there with your neighbors whether they’re decent or not. I would continue to hold him accountable for his jackassery. Taking the high road and being civil to all concerned will pay dividends.",
            "score": 1,
            "author": "broncospin"
        },
        {
            "level": 0,
            "comment": "He’s manipulating you by your willingness to let him do so.\n\nYou have proof he knew he was jeopardizing the snow removal and that he didn’t change. \n\nDon’t enable his games.  Go show him the proof and tell him either he quits lying and bullshit, or you will stop interacting with him too. \n\nHow he treats others really is none of your business. Either you stay out of their relationships fully, or you are part of the mess.",
            "score": 1,
            "author": "stromm"
        },
        {
            "level": 0,
            "comment": "I support fighting with your neighbour, but surely you're better off resolving the situation in a way that means you don't have to shovel snow off your driveway yourself so maybe dealing with his shit a little is better for everyone. 🤷🏻",
            "score": 1,
            "author": "taspleb"
        },
        {
            "level": 0,
            "comment": "Text him a picture of the receipt where he was informed about snow removal a year prior. It sounds like he causes issues for all the neighbors; maybe y'all need to do the same collectively.",
            "score": 1,
            "author": "drapehsnormak"
        },
        {
            "level": 0,
            "comment": "Actually, you might want to get into contact with the owner of the house.\n\nHe is deliberately keeping you away from contacting them, in any way shape or form.\n\nHe chose to relent, as soon as you mentioned contacting the owner. I suggest you make haste with the threat you posed before you loose the momentum.",
            "score": 1,
            "author": "Serenity_by_Willow"
        }
    ]
}