{
    "id": "13yum75",
    "score": 173,
    "title": "I mixed some cookie dough into my rude co-workers hair.",
    "author": "VVReptile",
    "date": 1685751579.0,
    "url": "https://www.reddit.com/r/pettyrevenge/comments/13yum75",
    "media_urls": [],
    "other_urls": [],
    "postText": "So, this happened a few years ago when I was working at a Dairy Queen. It was the 2nd job I've ever had and I wasn't very experienced with much of anything, but making Blizzards was surprisingly easy and actually kinda fun! Issue was my co-worker, let's call him Pillsbury. Pillsbury was a year or two younger than me, but because he worked there ONE more month than me he had this attitude of being superior despite having the personality of mosquito larvae. He'd always dawdle on tasks, take ages to reply to anything, and usually flirted with girls in the back while playing on his phone. Well, one day I noticed him subtly flicking bits of our cookie dough bits into another poor girls hair and because her hair was long and a bit wavy (she worked register so not really any reto tie it up) she didn't notice a thing. Well I've had enough of this stereotypical douchebag so I started doing the same to his own dumb broccoli hair (y'know, the average white guy douchebag cut that's been making the rounds lately). He also didn't notice anything until I accidentally flicked one right into his mouth after he unexpectedly turned around. He choked a bit before getting all pissy with me where I just shrugged and said \"Your fault for not noticing.\" at which point he seemed to catch on and pulled a wad of maybe 20 bits of dough from his hair. Fortunately, he's not smart, and ended up just dragging at all through his hair and making a HUGE mess. My wonderful manager came to me later that day and said, while it was hilarious and deserved (he watched everything almost on the camers), he'd have to write me up. The girl apparently wasn't too mad about it because she wanted an excuse to get a pixie cut anyway, but nontheless his actions bothered me so there we go.\n\nEdit:  Kinda hope Rslash finds this, lol\n\nExtra edit: Please feel free to point out typos, I have a habit of typing too fast and I'm not great at spelling to begin with  😅",
    "comments": [
        {
            "level": 0,
            "comment": "Pilsbury got written up too, yes?",
            "score": 13,
            "author": "gromit1991",
            "replies": [
                {
                    "level": 1,
                    "comment": "I can't say for certain, but knowing that particular manager I feel he was absolutely written up too. He's the only guy I've ever worked with that I still wanna give a call and invite out for a bar night or something, if that's any consolation.",
                    "score": 8,
                    "author": "VVReptile"
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt; doddle on tasks\n\ndawdle",
            "score": 30,
            "author": "Middle_Advisor_5979",
            "replies": [
                {
                    "level": 1,
                    "comment": "Took ya long enuff\n\n&amp;#x200B;\n\n /s",
                    "score": 16,
                    "author": "CoderJoe1"
                },
                {
                    "level": 1,
                    "comment": "I'm always the first to admit I'm not a smart man, thanks for that",
                    "score": 17,
                    "author": "VVReptile",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Everybody makes spelling mistakes.  Even me.  But I also like to know when I make a mistake so that I can fix it.",
                            "score": 16,
                            "author": "Middle_Advisor_5979"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why did she have to get a haircut? Did she not wash the cookie dough out?",
            "score": 8,
            "author": "Unique-Ad-9316",
            "replies": [
                {
                    "level": 1,
                    "comment": "She didn't HAVE to get one, she just wanted the excuse. I'm pretty sure she was a tomboy and whatnot be we didn't know each other well at all, this is just something I overheard.",
                    "score": 7,
                    "author": "VVReptile"
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt; ...he had this attitude of being superior despite having the personality of mosquito larvae. \n\nBeauty.  Straight into my quotes file.",
            "score": 6,
            "author": "vogelke"
        },
        {
            "level": 0,
            "comment": "Great job helping karma along!",
            "score": 2,
            "author": "Alert_Ad_6162"
        }
    ]
}