{
    "id": "142tvri",
    "score": 701,
    "title": "Happy Merry Christmas, you garbage being",
    "author": "PeanutButter_32",
    "date": 1686086998.0,
    "url": "https://www.reddit.com/r/pettyrevenge/comments/142tvri",
    "media_urls": [],
    "other_urls": [],
    "postText": "This is probably the one and only habit I took up and kept to this day just to be petty.\n\nSince we are here to enjoy some nice cup of good old petty tea and not for family drama, I won't go into the whole story about what a fine specimen of human garbage my stepfather(SF) is. But to give some summary for context: My mom and me coexisted in the same living space, but that was pretty much it when it came to the responsibilities of a \"caretaker\". When SF moved in in my early teen years things went to him actively bullying me out of their life quickly and she enabled him, so at 15 I packed my things and left.\n\nWe went no contact for some years, but in my 20's things developed in a direction where mom and me built up a somewhat friendly relationship. Not a mother-daughter one though - I had come to terms with her never taking on the role of a caretaker and always putting SF first. More like an aunt I see on family gatherings. \n\nAnd ohhh, the family gatherings. SF was as strong and despicable as ever: Not actively attacking me in front of the family, but making comments here and there under his breath that he knew I could hear, making toasts on how he was my mom's saviour out of her misery when everyone else left her (e.g. me) and so on. I am happy to say that with time, therapy and working on myself I am now able to not let it get to me anymore - the best revenge is a life well lived after all, and he's absolutely not worth the energy and negative emotions which only affect my well-being.\n\nI couldn't resist this one repeated act of pettyness though:   \nFor Christmas, of course my present is to them both as a couple and not only to my mom, as it would raise flag from the family. \"They\" always get some nice pralines, sometimes I bake a gorgeous cake (I love getting creative with cake decorating), one time I bought a really good red dessert wine (way to sweet for my taste, but my mom liked it very much). He's diabetic.",
    "comments": [
        {
            "level": 0,
            "comment": "If he complains be sure to remind him that diabetics can eat anything as long as they do proper portion control.",
            "score": 206,
            "author": "druscarlet",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's a good one, I'll remember that! Thanks!",
                    "score": 115,
                    "author": "PeanutButter_32"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Honestly being a pastry chef as a hobby and make all those delicious cakes and sweets is a good way to stick it to a diabetic. And taking pics of the sweets and sending to you mom priceless.",
            "score": 116,
            "author": "kain068",
            "replies": [
                {
                    "level": 1,
                    "comment": "Kill 'em with kindness.",
                    "score": 69,
                    "author": "PeanutButter_32",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Absolutely also a bowl of skittles and m&amp;ms mixed together is also fun",
                            "score": 32,
                            "author": "kain068",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Add some Reece’s pieces in if you want to really make a statement.",
                                    "score": 18,
                                    "author": "TwistedAb",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That is diabolical and a damn ingenious idea",
                                            "score": 11,
                                            "author": "kain068",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Especially since I like 2 out of those 3...actually M&amp;M's has like 20 flavors now, right? Blech.",
                                                    "score": 3,
                                                    "author": "centstwo"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Injected in the veins...",
                                    "score": 3,
                                    "author": "AJRimmer1971"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "…or carbs. Which is the same thing right? Right?",
                            "score": 8,
                            "author": "merlocke3",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Carbs become sugar below the neck, lol",
                                    "score": 3,
                                    "author": "centstwo"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hahahaha! You are next-level petty, and I love it!",
            "score": 21,
            "author": "BunnySlayer64",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks! :D I'm usually not to other people, but that's what half a lifetime of bullying does I guess",
                    "score": 24,
                    "author": "PeanutButter_32"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sounds like he's a sweet enough man already.  Send him some [balls](https://youtu.be/bPpcfH_HHH8?t=149).",
            "score": 50,
            "author": "CoderJoe1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sweet as sugar &lt;3",
                    "score": 29,
                    "author": "PeanutButter_32"
                },
                {
                    "level": 1,
                    "comment": "I think the chocolate molds of her asshole would work better here",
                    "score": 22,
                    "author": "Oatmeal_Savage19",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You,I like you SO much.🤣",
                            "score": 15,
                            "author": "Large_Alternative_78"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You could send him some sugar free [dicks (mint)](https://johnystoys.com/product/mints-sugar-free-penis-shape/)",
                    "score": 3,
                    "author": "RecordingStock2167"
                }
            ]
        },
        {
            "level": 0,
            "comment": "OMG You should do a photo Christmas card of yourself toasting them with the same wine and a praline in hand- sharing the holidays.  Hahaha\n\nGood on you for all that work you did too!  I hope you get to choose his nursing home and all.",
            "score": 16,
            "author": "JonesinforJonesey",
            "replies": [
                {
                    "level": 1,
                    "comment": "nursing home, no. \n\n isolated truck stop on a backwoods state road, yes.",
                    "score": 10,
                    "author": "Fearonika",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Just backwoods.  In bear country.",
                            "score": 6,
                            "author": "AJRimmer1971"
                        },
                        {
                            "level": 2,
                            "comment": "Make sure he is tied up spread-eagled, naked and lubed.",
                            "score": 4,
                            "author": "GreyAzazel",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Good god! Lmao! That took a turn! Don’t get me wrong, I’m here for it!! Just too funny I guess",
                                    "score": 2,
                                    "author": "CTurple",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That was where I thought it was headed 🤣. I was tempted to add \"put a PVC pipe covering barbed wire up there then remove the pipe leaving the wire\" but I thought that might be too much.",
                                            "score": 3,
                                            "author": "GreyAzazel",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "AHHHHHH HAHAHAHA!!! I love this!",
                                                    "score": 2,
                                                    "author": "CTurple"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I like it. It’s giving “eff you, lose a foot”.",
            "score": 12,
            "author": "Dusty_mother",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ahhh yes, let us not forget \"the sugarfoot\".   Lol",
                    "score": 4,
                    "author": "BugTussler"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Find out what his favorite sweets are if you get the chance though I think you’re doing a fantastic job on your own. Well done!-especially for recovering from that mess.",
            "score": 10,
            "author": "TauntaBeanie"
        },
        {
            "level": 0,
            "comment": "Pet tea.",
            "score": 9,
            "author": "missannthrope1"
        },
        {
            "level": 0,
            "comment": "You may just have to start getting your mother southern sweet tea... by the gallon!",
            "score": 8,
            "author": "HMS_Slartibartfast"
        },
        {
            "level": 0,
            "comment": "He makes toasts on how he was your \n mothers saviour? Who makes toasts like that??",
            "score": 6,
            "author": "MrFancyBusDriver"
        },
        {
            "level": 0,
            "comment": "Deliciously petty.",
            "score": 4,
            "author": "Ok-Many4262"
        },
        {
            "level": 0,
            "comment": "Revenge is a best served as just desserts",
            "score": 5,
            "author": "SkysEevee"
        },
        {
            "level": 0,
            "comment": "Just remember, OP, he aint worth [The Salt of My Tears](https://www.youtube.com/watch?v=1zaYJa8BxGs)\n\nI'm happy that SF has no control over you; that you've been able to heal and move on.\n\nI don't know if it would make it easier for you to think of him as your mother's lover rather than your step father.\n\nStep-father seems to denote some type of relationship between the two of you and I'm thinking there isn't one.",
            "score": 5,
            "author": "ronhowie375",
            "replies": [
                {
                    "level": 1,
                    "comment": "My mom's side piece.",
                    "score": 1,
                    "author": "TheHobbyWaitress"
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt; He's diabetic.\n\nJesus, this is *beautiful*.",
            "score": 5,
            "author": "vogelke"
        },
        {
            "level": 0,
            "comment": "Next time make it a pecan pie.",
            "score": 3,
            "author": "MissFuzzyPants"
        },
        {
            "level": 0,
            "comment": "I raise a glass to you! 🍷",
            "score": 3,
            "author": "travelingtutor"
        },
        {
            "level": 0,
            "comment": "Give him some Kendal Mint Cake.",
            "score": 3,
            "author": "rde42"
        },
        {
            "level": 0,
            "comment": "Since he can't eat what you bake, maybe a nice bag of the Haribo sugar-free gummy bears? Read the Amazon reviews :)",
            "score": 2,
            "author": "Nyarlathotep-60",
            "replies": [
                {
                    "level": 1,
                    "comment": "this deserves to be much, much higher.\n\nhttps://www.amazon.com/review/R2JGNJ5ZPJT4YC",
                    "score": 2,
                    "author": "9Snick4"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Living well is the best revenge. This one time, in real life, a conservative radio talk show person who at one point said something like, \"Imprison all illegal drug users.\" and a bunch of other stupid stuff, suffered from hearing loss. I was thinking, \"Yay, The Lord is punishing them for the things they said!\" (Karma, the Lord, whatever, funnier to say the Lord with conservatives, right?)\n\n\nAnyway, get this, turns out they were \"Doctor Shopping\" to get prescription drugs, which violated the state's law. The kicker is that the drugs were making them deaf!",
            "score": 1,
            "author": "centstwo"
        },
        {
            "level": 0,
            "comment": "Another petty thing you could do if you wanted. At the next family gathering make a toast to independence and getting out of an abusive relationship you can style it in the form of breaking up with a boyfriend but just pointedly direct everything towards the SF. Everyone will understand what your talking about without actively insulting SF and if he does get offended you can just say its about the ex rather than him why is he being so defensive.",
            "score": 1,
            "author": "Azsura12"
        },
        {
            "level": 0,
            "comment": "NTA - and very creative 👍",
            "score": 1,
            "author": "Flash_Harry42"
        },
        {
            "level": 0,
            "comment": "Oh what kind of dessert wine? Also love the petty its perfect",
            "score": 1,
            "author": "Wild_Replacement8213"
        },
        {
            "level": 0,
            "comment": "I read this somewhere years ago,  don't know if it's the same story or a new one.",
            "score": -1,
            "author": "lovetocook966"
        }
    ]
}