{
    "id": "143hv85",
    "score": 1509,
    "title": "20+ year old vengeful pettiness comes to fruition.",
    "author": "Master-Protection-29",
    "date": 1686155347.0,
    "url": "https://www.reddit.com/r/pettyrevenge/comments/143hv85",
    "media_urls": [],
    "other_urls": [],
    "postText": "A few months ago I got a call from my very distressed and angry godson, his piece of shit mother(momster) and soon to be ex wife(stbx) have conspired to hide stbx's cheating and attempted theft of estate and heirlooms. \n\nQuick back story: I introduced Godsons parents without knowing at the time momster was a gold digging narcissistic monster. Parents had an extremely ugly and long divorce. When godson turned 18 and divorce was still on going father removed himself from his family's multi generational estate/trust to transfer all of it, including house to godson. As a xmas/Hanukkah present godson served both parents with eviction notice, fathers envelop also had a rental agreement. Within a few months parents divorce was finalized and both father and godson were no contract with Momster. Due to her deplorable treatment of godson I'm was already no contract with Momster.\n\nAfter godson vented about learning momster and stbx had been attempting to access the safety deposit boxes at banks, and safes within home with the intention of stealing contents. The final straw was stbx's flavor of the week along with the vile pair of women were  trying to cut into a safe when godson got home with their child she forgotten pick up. STBX and co-conspirators were so involved with the safe break in that the child was forgotten and godson was called by school to pickup child.\n\nGodson had a hinkling of stbx's infidelity beforehand and had security cameras footage in home and the doors cameras were backuped to estate lawyers, godson was in the process of drawing up divorce papers due to infidelity and was waiting for the more proof because godson wanted full custody of their child. Now his child is still a minor but of the age to choose which parent they want to live with, and wants to stay with godson and in the home. Stbx gets absolutely no monetary compensation due to infidelity as the very detailed prenuptial detailed. Stbx is pissed to say the least, and is trying all the dirty games momster tried all those years ago plus new games. Godson is heartbroken because he truly loves stbx, and his parents' divorce really affected him. He never wanted a repeat of his parents' divorce and didn't want his child to experience what he did. \n\nDurning one of our last call godson is venting about the newest manipulation of stbx and momster, and his and childs heartbreak, yes they are both in joint and individual therapy. I remembered something about  his parents divorce,  a little clause I mentioned to father to add to divorce decree. I never read their papers and am not sure if my little petty  addition was actually added. I mentioned to Godson to ask lawyers to research momsters' divorce papers for a 'conspiracy against estate' or something like that.\n\nI received a text from Godson. \"Is this your vengeful petty addition?\" Followed with an image full of legalese and momsters signature at end of paragraph.  The legalese basically stating any involvement to aquire trust/estate assets will nullify any and all previously incurred monetary compensation received by plantiff And all monetary compensation will be refunded to trust/estate with interest at market value. *snicker snicker, I really am a vindictive and protective godmom* \n\nI texted back, \"Bwhahaha..... yup, happy your father was pissed enough to add my pettiness.\"\n\nYes, momster got alimony, and yes, she agreed to the stipulation. So, yes, momsters' involvement in the attempted theft has caused her to lose alimony ,and now MUST repay all alimony with interest. \n\nI was petty vengeful even then, cooler minds(father and lawyers )prevailed and didn't allow me to car compactor all her belongings into a big cube, so I wanted to get her where she would feel it most. And I'm shocked godsons big teddy bear of a father really followed through with my addition to the divorce decree. \n\nMomster is now crying about her son stealing from her, stbx isn't fighting the divorce or child custody. And Godson and grand-godson are planning a summer world tour on momsters' dime. Finally, a new and updated 'vengeful petty clause' is being added to the new divorce papers. \n\nDon't hurt my godsons, or I'll come after you. Stbx email is being bombed with spam mail, thank from me. Whenever I see an email sign-up for free information, I use hers. It's a little pettiness and absolutely entertaining for me.\n\nEdited to make Stbx and momster easier to follow.",
    "comments": [
        {
            "level": 0,
            "comment": "This totally rocks! Go you for protecting all family members (father of godson, godson, grand godson!) . \n\nHonestly, I think should be a standard clause😈",
            "score": 381,
            "author": "Plastic-Ad-5171",
            "replies": [
                {
                    "level": 1,
                    "comment": "Kept translating stbx as shitBox and not soonToBeX … seems to fit though",
                    "score": 172,
                    "author": "mdmhvonpa",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm glad to see it wasn't just me.",
                            "score": 44,
                            "author": "RogFulton",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I heard that first from a friend who was divorcing in 1996.",
                                    "score": 8,
                                    "author": "VoyagerVII"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "first couple times i was like damn it microsoft i cant keep up with your console names.",
                            "score": 11,
                            "author": "Apollyom"
                        },
                        {
                            "level": 2,
                            "comment": "I keep reading it as Starbucks lol",
                            "score": 10,
                            "author": "FaeryLynne"
                        },
                        {
                            "level": 2,
                            "comment": "Soon to be ex never even entered my mind\n💩box all the way 🤣",
                            "score": 6,
                            "author": "Fox-Possum-3429"
                        },
                        {
                            "level": 2,
                            "comment": "Good to know I wasn't the only one!",
                            "score": 4,
                            "author": "PwntIndustries"
                        },
                        {
                            "level": 2,
                            "comment": "I work for a cable company and kept reading it as set-top box!!  Shitbox is better though.",
                            "score": 4,
                            "author": "Sol6908",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Heh ... some setTop boxes are shit ... worked at Moto for 10yr in the DNIS div ...",
                                    "score": 1,
                                    "author": "mdmhvonpa"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Was going to ask what stbx meant. Thanks!",
                            "score": 3,
                            "author": "mikeyblueeyes20"
                        },
                        {
                            "level": 2,
                            "comment": "I have always done the same! I thought it was just me!",
                            "score": 2,
                            "author": "RiskyWriter"
                        },
                        {
                            "level": 2,
                            "comment": "I did not know that acronym, so I was reading it as, \"straight up bitch\". 🤣",
                            "score": 2,
                            "author": "Negative-Parfait-804"
                        },
                        {
                            "level": 2,
                            "comment": "I read it as shitBox too. 🤣",
                            "score": 2,
                            "author": "DivideByZero117"
                        },
                        {
                            "level": 2,
                            "comment": "I was thinking it was stupid bitch.",
                            "score": 1,
                            "author": "23KoiTiny"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Is it grand godson or god-grandson?",
                    "score": 31,
                    "author": "DaniCapsFan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I actually have no idea and chose one.",
                            "score": 46,
                            "author": "Master-Protection-29",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think God-grandson would be your child's godson.",
                                    "score": 4,
                                    "author": "VoyagerVII"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It's God son's child. Or, child of God son.",
                            "score": 8,
                            "author": "n-oyed-i-am"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have to be honest, this post took a while for me to get my head around! Well done, on protecting both your godson and his dad (and child). Although I am so sorry that they both ended up attracting such vile women",
            "score": 197,
            "author": "Lady_Kajiit",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, momster, stbx, godson's parents? I'm not sure who's who or how they all relate to each other. But I still really enjoyed the story.",
                    "score": 60,
                    "author": "TinTinTinuviel97005",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I had the same issue.  Here's my breakdown.  Momster and Big ol teddy bear Dad were married and had a beautiful baby boy named Godson.  Godson married a crazy bitch named stbx.  They had a baby boy named grand godson/god grandson/godson's kiddo.  =)",
                            "score": 54,
                            "author": "BBQWife3",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "NOW it makes sense!!! People should include family trees when talking in code names and long stories...",
                                    "score": 28,
                                    "author": "DisastersAreMyThing"
                                },
                                {
                                    "level": 3,
                                    "comment": "Ahhhh! Duh me. (Face palm)    I had thought monster and stbx were together.   Re read and it makes more sense.",
                                    "score": 12,
                                    "author": "PsychologicalBit5422",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I did too!!",
                                            "score": 6,
                                            "author": "WhoKnows1973"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I did edi to hopefully make it easier to follow.",
                    "score": 14,
                    "author": "Master-Protection-29"
                }
            ]
        },
        {
            "level": 0,
            "comment": "OP, you are a freaking god!  Can you tell me the numbers for the lottery?\n\nMomster has been shown the true meaning of “play stupid games, win stupid prizes.”",
            "score": 53,
            "author": "lapsteelguitar"
        },
        {
            "level": 0,
            "comment": "Hahaha wow that is the best FAFO tax I've read about in a while! Well done! :D\n\nAnd I'm glad that your godson added that extra petty flavor to his divorce :D",
            "score": 42,
            "author": "Not-Mom15"
        },
        {
            "level": 0,
            "comment": "I would so love to have an award to give you for your awesomeness. I love your level of pettiness and hope godson/great godson continue to take your advice 💝",
            "score": 26,
            "author": "itstheirishinme",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for the offer of a reward. We're all close, and we all joke about my mild petty moves. I only get really vengeful when people mess with those I love.",
                    "score": 38,
                    "author": "Master-Protection-29"
                },
                {
                    "level": 1,
                    "comment": "I'll pay your fee. OP deserves it. 😉",
                    "score": 3,
                    "author": "VoyagerVII"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Can someone explain this better and assign some random names please Jesus christ",
            "score": 19,
            "author": "GMitch420",
            "replies": [
                {
                    "level": 1,
                    "comment": "Johnny = Godson \n\nJoe = Godson’s Dad\n\nKaren = Godson’s Mom\n\nKelly = Godson’s soon to be ex \n\nJr = Godson and Kelly’s kid \n_____\n\nJoe and Karen got divorced and Karen is a gold digger and crappy person. During the divorce, everything was put into a trust for Johnny. Once finalized Joe and Johnny went LC/NC with Karen after Johnny gave her an eviction notice (since he owned the house). Joe was also given an eviction notice but a rental agreement came with it (aka not kicked out).\n\nJohnny was in the process of getting things ready to divorce Kelly because of her infidelity. Gathering evidence, etc. In Johnny and Kelly’s prenup, there is an infidelity clause so she would get nothing in the divorce because of it. Jr is old enough to choose and wants to live with Johnny. \n\nKelly is like Karen and gold digger. Both working together to steal from security boxes at bank and safes at home… because 💰\n\nOne day Johnny had to go pick up Jr from school because Kelly forgot to. They came home to find Karen helping Kelly try to break into the safes with the help of Kelly’s current AP. \n\nJohnny was telling OP about all of the drama. OP remembers telling Joe to add a “conspiracy against estate” petty clause, but wasn’t sure if Joe’s lawyers actually added it. Johnny checked and sure enough, a clause was added that if Karen tried anything she would lose alimony and have to pay back plus interest. \n\nSo because Karen tried helping Kelly to steal, she now has to pay Johnny (aka the estate) what was given to her + interest. Because of this Kelly is not fighting the divorce and not fucking around because she doesn’t want to find out…. More than what she already has… aka getting nothing due to prenup. \n\nJohnny and Jr are using the money returned from Karen to travel for the summer. \n\n\nEdit: add what I missed and clarify sentences.",
                    "score": 44,
                    "author": "madamdaddy69",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you, this was much easier to read",
                            "score": 14,
                            "author": "myothracctisaferrari",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Took a couple rounds of rereading",
                                    "score": 5,
                                    "author": "madamdaddy69"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "And Johnny is adding the same clause to his divorce too!",
                            "score": 9,
                            "author": "MidiReader"
                        },
                        {
                            "level": 2,
                            "comment": "Now I understand",
                            "score": 4,
                            "author": "Gapoly"
                        },
                        {
                            "level": 2,
                            "comment": "This is a complete novela! Chef kiss and OOP you a majestic person, you protect your lives one! The best to use to be petty and a MamaBearGod!!!",
                            "score": 5,
                            "author": "Winter-Night-5529"
                        },
                        {
                            "level": 2,
                            "comment": "Thank you!!",
                            "score": 1,
                            "author": "borgchupacabras"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I suppose all things considered, it's about the best outcome that could be reasonably expected.",
            "score": 16,
            "author": "FreddyForshadowing"
        },
        {
            "level": 0,
            "comment": "This is the quintessential definition of Fuck Around and Find Out.",
            "score": 16,
            "author": "butterfly-garden"
        },
        {
            "level": 0,
            "comment": "That is epic",
            "score": 11,
            "author": "Pleasant-Excuse-2530"
        },
        {
            "level": 0,
            "comment": "The fact that you don't want to use \"the\" makes it hard to understand for non native english speakers and I stopped reading at the third paragraph",
            "score": 8,
            "author": "Gapoly",
            "replies": [
                {
                    "level": 1,
                    "comment": "Another kind person has translated the post into readable English.\n\n\nhttps://www.reddit.com/r/pettyrevenge/comments/143hv85/20_year_old_vengeful_pettiness_comes_to_fruition/jnb49zh?utm_source=share&amp;utm_medium=android_app&amp;utm_name=androidcss&amp;utm_term=1&amp;utm_content=share_button",
                    "score": 6,
                    "author": "borgchupacabras",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks, I actually understand now",
                            "score": 3,
                            "author": "Gapoly"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Bravo 👏 good show man 🎩",
            "score": 7,
            "author": "Space_Turtle2868"
        },
        {
            "level": 0,
            "comment": "Liked the story, still haven't figured out what stbx is.",
            "score": 7,
            "author": "Lay-ZFair",
            "replies": [
                {
                    "level": 1,
                    "comment": "Soon To Be Ex\n\nTook me a while too.",
                    "score": 4,
                    "author": "spaztwitch"
                },
                {
                    "level": 1,
                    "comment": "STBX is the Godson's soon-to-be ex wife.",
                    "score": 3,
                    "author": "HistoricalFashion"
                },
                {
                    "level": 1,
                    "comment": "**s**oon-**t**o-**b**e-e**x** is what I assumed",
                    "score": 3,
                    "author": "Shadowfallrising"
                }
            ]
        },
        {
            "level": 0,
            "comment": "When petty revenge might as well be nuclear revenge for how much it will cost due to the dollar amount. Oh well, that momster gets for being gold digging trifling POS to her ex, her son and grandson for like decades.",
            "score": 16,
            "author": "maywellflower"
        },
        {
            "level": 0,
            "comment": "OP you are my hero! 🥇",
            "score": 5,
            "author": "KeyBox6804"
        },
        {
            "level": 0,
            "comment": "Omg I love it!!! Lmao way to go",
            "score": 4,
            "author": "Ill_Chemist_1576",
            "replies": [
                {
                    "level": 1,
                    "comment": "Happy Cake day!\nThis was epic!",
                    "score": 2,
                    "author": "NocturnalFirelily"
                },
                {
                    "level": 1,
                    "comment": "Happy cake day!",
                    "score": 1,
                    "author": "Winter-Night-5529"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Someone played the long game and won. Awesome!",
            "score": 6,
            "author": "RevolutionaryDiet686"
        },
        {
            "level": 0,
            "comment": "Wow.  Godson's father gave Momster enough rope to hang herself - and she did.",
            "score": 2,
            "author": "GrumpyCatStevens",
            "replies": [
                {
                    "level": 1,
                    "comment": "And I'm thrilled to have been the little devil on his shoulder.",
                    "score": 3,
                    "author": "Master-Protection-29"
                },
                {
                    "level": 1,
                    "comment": "And I'm thrilled to have been the little devil on his shoulder.",
                    "score": 2,
                    "author": "Master-Protection-29",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So thrilled you posted this comment twice, apparently. :)",
                            "score": 2,
                            "author": "GrumpyCatStevens"
                        },
                        {
                            "level": 2,
                            "comment": "Nonono, you're the angel. Nothing in that petty clause is evil. No-Thing.",
                            "score": 2,
                            "author": "Yiuel13"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This post gave me a brain tumor",
            "score": 10,
            "author": "FunstarJ"
        },
        {
            "level": 0,
            "comment": "You're a champion! Love it when a plan comes together!",
            "score": 3,
            "author": "satanic-frijoles"
        },
        {
            "level": 0,
            "comment": "I acknowledge the master of petty😹😹😹",
            "score": 3,
            "author": "ImaginationAlive9447"
        },
        {
            "level": 0,
            "comment": "This was one of the best petty revenge stories I’ve heard/ read in a while!!! 👑 godmom gets a crown!",
            "score": 3,
            "author": "Crazy_Kat_Lady6"
        },
        {
            "level": 0,
            "comment": "You do not know how to write a cohesive story. I was straight up lost thru all of this.",
            "score": 3,
            "author": "No_Paleontologist_25"
        },
        {
            "level": 0,
            "comment": "Love this......have the monster a chance to behave accordingly but karma and her own greed caused her ultimate downfall",
            "score": 2,
            "author": "ValkyrieKarma"
        },
        {
            "level": 0,
            "comment": "Wow, you are a true vigilante of this story! You go girl!!",
            "score": 2,
            "author": "Lubochka"
        },
        {
            "level": 0,
            "comment": "Vito Corleone would be so proud\n\n![gif](giphy|pVXxGjkxNcJ9t0UKYS|downsized)",
            "score": 2,
            "author": "Jack_Benney"
        },
        {
            "level": 0,
            "comment": "Nicely done!!  Way to protect the family and really stick it to the gold diggers!  My hat is off to you.",
            "score": 2,
            "author": "KeddyB23"
        },
        {
            "level": 0,
            "comment": "Best god parent ever",
            "score": 2,
            "author": "BredCutter"
        },
        {
            "level": 0,
            "comment": "This ain't petty, this is nuclear petty. I love it.\n\nYou're a godsend OP. You own your godmother title like a boss.",
            "score": 2,
            "author": "Yiuel13"
        },
        {
            "level": 0,
            "comment": "My baby goddaughter’s dad is a POS; if the time comes I might have to take a page out of your book lol.",
            "score": 2,
            "author": "k3lco"
        },
        {
            "level": 0,
            "comment": "I’m not sure this is petty. It’s freaking epic!",
            "score": 2,
            "author": "sharri70"
        },
        {
            "level": 0,
            "comment": " This is SO super petty, like almost  nuclear revenge.  Wow. Good on ya. Well done!",
            "score": 2,
            "author": "wynnofthewood"
        },
        {
            "level": 0,
            "comment": "Petty people love this spam hack... [http://mailbait.info/run.html](http://mailbait.info/run.html)",
            "score": 2,
            "author": "GullibleNews"
        },
        {
            "level": 0,
            "comment": "What the hell does stbx mean??",
            "score": 2,
            "author": "keepitcivilized",
            "replies": [
                {
                    "level": 1,
                    "comment": "Soon To Be Ex",
                    "score": 3,
                    "author": "Huntedbearlv",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "AKA Shitbox",
                            "score": 1,
                            "author": "ThisAdvertising8976"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I love OP! Petty evil genius live n breathe for the pettiness! Should start a class on pettiness ill sign up 😈",
            "score": 2,
            "author": "Personal_Jacket_8425",
            "replies": [
                {
                    "level": 1,
                    "comment": "I do offer free pettiness.  All you have to do is dm me. But be warned,  this genie can't be easily bottled after given freedom.",
                    "score": 2,
                    "author": "Master-Protection-29"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Some advice to OP: if a story a bit complicated and involves a lot of people, just use names. Each name can be explained in the beginning using bullet points and it'll be a lot easier to read",
            "score": 2,
            "author": "an0n33d"
        },
        {
            "level": 0,
            "comment": "How did you get her email bombed with spam mail, just asking 🙃",
            "score": 1,
            "author": "6417725",
            "replies": [
                {
                    "level": 1,
                    "comment": "You know when you hop onto a website and get the pop-up \"give us your email for discount/free drawing/more information......\" or 'join our mailing list' those.",
                    "score": 6,
                    "author": "Master-Protection-29",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "In high school typing class, before computers, my friend and I would type up those advertising reply cards in magazines. I filled out a bunch using my ex-bf name and address. He kept wondering why military recruiters kept showing up at his door and sending him info! In the 80’s the recruiters were ruthless, much like some religious people who went door to door. Very satisfying petty revenge.",
                            "score": 2,
                            "author": "Commercial-Push-9066"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Well that's karma for the momster for being greedy...",
            "score": 1,
            "author": "reads_to_much"
        },
        {
            "level": 0,
            "comment": "I love it.",
            "score": 1,
            "author": "lattelady37"
        },
        {
            "level": 0,
            "comment": "I would like to say I had a justice boner reading this but you'll probably need a microscope 😂\nWhen someone told you to use your words, they probably never thought you would use it this way. Pretty sure they are proud!",
            "score": 1,
            "author": "tinamadinspired"
        },
        {
            "level": 0,
            "comment": "You are truly a gem",
            "score": 1,
            "author": "ToreenLyn"
        },
        {
            "level": 0,
            "comment": "I absolutely love this! You rock!",
            "score": 1,
            "author": "Fair-Manufacturer446"
        },
        {
            "level": 0,
            "comment": "This is AWESOME!!!!",
            "score": 1,
            "author": "lizziegal79"
        },
        {
            "level": 0,
            "comment": "Well username checks out",
            "score": 1,
            "author": "vamanosalbano"
        },
        {
            "level": 0,
            "comment": "Best petty revange😂 I love IT❤️❤️",
            "score": 1,
            "author": "BeautifulSense1831"
        },
        {
            "level": 0,
            "comment": "God, I love this! Godson and great-godson are definitely lucky to have you in their corner.",
            "score": 1,
            "author": "KindaFaulty"
        },
        {
            "level": 0,
            "comment": "Just WOW. I love this.",
            "score": 1,
            "author": "punkpanther16"
        },
        {
            "level": 0,
            "comment": "This should be !pro imo.",
            "score": 1,
            "author": "WatchingTellyNow"
        },
        {
            "level": 0,
            "comment": "This beyond petty.   Beautifully executed",
            "score": 1,
            "author": "Hemphlev"
        },
        {
            "level": 0,
            "comment": "This is truly incredible. Fantastic work.",
            "score": 1,
            "author": "h0n3yst"
        },
        {
            "level": 0,
            "comment": "The real fairy godmother",
            "score": 1,
            "author": "forsecrectyreasoning"
        },
        {
            "level": 0,
            "comment": "Bahahahahaha! I love it",
            "score": 1,
            "author": "Wild_Replacement8213"
        },
        {
            "level": 0,
            "comment": "You win The Petty Award 🥇",
            "score": 1,
            "author": "AlabamaWinterRose"
        }
    ]
}