{
    "id": "1448whj",
    "score": 820,
    "title": "How I scored 2 years of sweet sweet high speed cable for free in the 90's",
    "author": "kiterdave0",
    "date": 1686229832.0,
    "url": "https://www.reddit.com/r/pettyrevenge/comments/1448whj",
    "media_urls": [],
    "other_urls": [],
    "postText": "Several years ago after a renovation we were awaiting cable internet connection. The local monopoly supplier (phone, cable internet, cable TV) were tardy with their appointments. You know the drill \"... a tech will arrive between 8am and 4pm - please be home...\" so I stay home from work, wait all day and come 4pm - no show.   \nSo I call up, wait on hold for 30 odd minutes. I am swiftly told the contractor will be there tomorrow and guess what ? \"... a tech will arrive between 8am and 4pm - please be home...\" So I stay home home again.   \nNo surprise same deal for 2nd appointment. So I call up and they book install for the following week. 3rd time luck of course he is a no show again.   \nSo I call up yet again to rebook. At the last minute I said \"... I have now taken 3 days off work - you should reimburse me for that and now there is a 4th day...\" so they transfer me off to some other department for another long hold time. \n\nEventually I get some lady explain all the deets and she say fair enough a claim is due. She says, may Iask you rate?\n\nme: \"sure - my rate is $680.\"\n\nher: \"OMG thats a lot of money for a day.\"\n\nme: \"Oh no I am SO sorry you misunderstood. Thats my hourly rate.\"\n\nher: silence. eventually ... \"ok I think I need to transfer you to a more senior representative.\"\n\nme: waiting on hold... guns loaded.\n\nthem: \"Hello mr so and so... My name is 'something un memorable' I amd hte Director of Customer Service. I undersatnd you are making a claim. Let me see.... may I ask what job you have that has such a high rate?\"\n\nme: \"Why yes of course. I am a Queens Council barrister specialising in coporate litigation...  \n\"\n\nher: silence. \"I am so sorry fo your trouble.... may I place you on hold for a moment?\"\n\nme: \"Of course\"\n\n5 mins later\n\nher: \"Again we are so sorry. I have just got off the phone and out contractor will be there within 30 minutes.\"\n\nme: \"Ok thats great... so what about my claim. let me see that is 3 days, 10 hours per day, $680/hr - lets just round it off shall we $20k it is.\n\nher: silence.... and then more silence. eventually. \"May I place you on hold?\"\n\nOn we went and at the end of the call I had free cable internet (top speed) full package cable TV and my measly $29/month phone bill. \n\nI scored 2 years of sweet free cable just for some shoot from the hip BS to the complaints department. Was easy in the 90's and not sure If I could pull it off now!",
    "comments": [
        {
            "level": 0,
            "comment": "I wish I could say I was clever enough to earn mine.  In the 80's my best friend and I got a new apartment together and ordered cable.  Everything was normal for a few months until we decided to order a sports event on pay per view for $10.  When our bill came they somehow took $10 off our normal bill.  So we tried it again and got another $10 off.  After that we routinely watched enough pay per view to zero out our bill.  We did this for a couple years until we moved and somehow got away with it.",
            "score": 334,
            "author": "CoderJoe1",
            "replies": [
                {
                    "level": 1,
                    "comment": "How could a company not know they're using subtraction instead of addition on peoples bills for an extended period🤣 That's awesome though",
                    "score": 137,
                    "author": "Minihackz",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Maybe an angry IT person put some code in on their way out!",
                            "score": 90,
                            "author": "Virginia_Dentata",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes. 80s cobol programmer here. This.",
                                    "score": 4,
                                    "author": "Accomplished_Set4862"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Its not like people would phone up to complain",
                            "score": 58,
                            "author": "Useless_bum81",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Companies should have employees that oversee what they are charging customers. This isn't something that should need to be reported by customers for them to find out about it",
                                    "score": 21,
                                    "author": "Minihackz"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It's like the time this phone company couldn't tell the difference between $0.002 and ¢0.002, you think they would know the difference! https://youtu.be/zN9LZ3ojnxY",
                            "score": 24,
                            "author": "Hit4Help",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "One grocery store I used to go to a lot had ridiculously overpriced ($3.99 each) fruit and yogurt bowls. On the last day of sale before becoming outdated, their fresh cut fruit and salad (where these bowls were) would be marked down. They used to use “amount off” rather than “percent off” stickers, so bowls on their “sell by” date would have “$2 off” stickers. Every couple months, the bowls would be on a BOGO offer. The free fruit and yogurt bowls were delicious.",
                                    "score": 19,
                                    "author": "wolfie379"
                                },
                                {
                                    "level": 3,
                                    "comment": "Oh that is amazing!! What was the outcome in that recording?",
                                    "score": 3,
                                    "author": "inthesky"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hail to the Queen of BS.\n\nYou deserved it.",
            "score": 61,
            "author": "TheHobbyWaitress"
        },
        {
            "level": 0,
            "comment": "Nice one! Striking a blow for all of us.\n\nI've often joked that those people seem to have some kind of video feed for your place, because it's like they know when the most inconvenient time to show up is. One time after waiting all day, I finally had to take a shit. So naturally that's when the tech shows up. Then they call me from where they parked and I tell them I'm there right now, but they \"have to call and get permission\" to simply walk back to the place and do the job they were scheduled to do.",
            "score": 41,
            "author": "FreddyForshadowing"
        },
        {
            "level": 0,
            "comment": "In the 90s there must've been disjointed billing systems because I, too, enjoyed free services for over a year. In my case it was free long distance calls on my landline (this was 1995-96, so landlines were still widely used). When I say free, I mean totally and entirely devoid of charges for all long distance calls. I was calling all of my friends and family, from California to Italy and beyond, for $0.00 for a 14 months. I have no idea how they missed it, but never got a charge.",
            "score": 31,
            "author": "bruh_wut69",
            "replies": [
                {
                    "level": 1,
                    "comment": "I had free cable for a few years I called got it disconnected.  They never turned it off.",
                    "score": 17,
                    "author": "darkoptical",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "ya I had free cable in university for the same reason.",
                            "score": 6,
                            "author": "Waffles-McGee"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I had a phone line installed specifically for dial up access to work. After a year or so, it started dropping the connection and I would have to call in again. It was very annoying and added to my work when something had to be redone. I was talking to a phone tech at work and they mentioned that call waiting would do that. So I checked my phone bill and yes there was a charge for call waiting on my work line. \n\nI called the phone company and complained. They tried to tell me I ordered it when they rolled the service out. I sarcastically replied that sure I ordered call waiting on a line that I only used to call out on for dial up access so my work could get interrupted regularly by random telemarketing calls. I asked them for proof that it was requested rather than just added, they couldn’t provide it so the refund paid the phone bill for over a year. \n\nAnd yeah that was a long time ago, think 1200 BAUD.",
            "score": 31,
            "author": "pmousebrown",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hey, I remember 300 BAUD.",
                    "score": 4,
                    "author": "fcukumicrosoft",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah I do too, I just wasn’t on call then. First computer I worked with was an IBM 360 model 50.",
                            "score": 4,
                            "author": "pmousebrown",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Same here -- and typing the punch cards with an IBM 29.",
                                    "score": 1,
                                    "author": "George_Parr",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I thought 1999 was hilarious in that people couldn’t understand why all those programs were written without the full four digit year. They never had to worry about punch cards or using more data storage than was absolutely necessary. I remember changing those big disk drives where the disks were heavy and awkward and cost more than I made in a year to replace. And now my phone has more processing power than multiples of the IBM 360 that took up a building a block long (with the necessary peripherals).",
                                            "score": 3,
                                            "author": "pmousebrown"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Hey, I remember Maude.",
                            "score": 3,
                            "author": "diverdux"
                        },
                        {
                            "level": 2,
                            "comment": "Teletype Model 33 ASR at 150 baud over unconditioned lines back in the late 70s. And we thought we were really livin’… 😁",
                            "score": 1,
                            "author": "OldBob10"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "My local cable company would often go down and I would let them know the problems, eventually they would contact me to provide them evidence toward the problem. I kept my reciepts and started invoicing them, providding all the required information such as who called me, actions performed, rate etc etc.\n\nThey didn't pay, so neither did I. When they cut off the internet/cable etc I called their accounts payable department and asked them why they hadn't paid the bill, and explained that I had simply followed their lead regarding non-payment and would be proceeding to file a suite in small claims.\n\nAfter some conversation and review they wiped out my balance owing and provided the next year of service without charge. \n\nI did keep helping them when they called, and didn't bill any longer as it was an amicable solution to help everyone and fixed problems much faster. But I was happy with the outcome.",
            "score": 27,
            "author": "C-DomiNations"
        },
        {
            "level": 0,
            "comment": "In the 80's I was in a reserve unit with Don, one of the nicest people you'd meet. I remember him sharing a funny story like this. BIG COMPANY was not being nice and very unhelpful while he was trying to get something resolved. He wouldn't be available for a couple weeks and the company was adamant that it be taken care of when he wasn't available. This went on for about a week until someone asked him his occupation.\n\n\"Criminal Investigator for the IRS\".  Yes, that was his full time occupation.\n\nSome one high up in the company got in touch with him to resolve the issue quickly after that.",
            "score": 49,
            "author": "HMS_Slartibartfast"
        },
        {
            "level": 0,
            "comment": "Back in the early 90's I lived in an apartment with a roommate and a rotating cadre of friends couch surfing. We had a TV hooked up but no cable. We played a lot of dominos, dice games, and drinking games. One night, during a storm, the power went out. We continued on by candle light. When the power came back on my roommate just decided to try the TV... we had cable. We did not know how, but it worked. \n\nSeveral months later, while I was at work, a cable guy knocked on the door asking if we were having trouble with the picture. A couple of the couch surfers were there and tried to fend him off but he leaned in to see the TV. He said it looked bad and he'd be right back. He left for a few minutes and came back saying, \"See, it looks better!\" The same thing happened a few months later.\n\nWe not only had free cable for about four years (until my wife and I bought a house and moved) but they came to fix, it twice, without asking.",
            "score": 17,
            "author": "SLOcheesyDave"
        },
        {
            "level": 0,
            "comment": "Our ISP would fuck up their customer database regularly. As in, they’d suddenly drop our service and when we called, got told ‘you aren’t a customer and have never been a customer’. This also resulted in us having service, but no billing for extended periods. We basically enjoyed at least a year of free high speed cable that way.",
            "score": 5,
            "author": "FinishingDutch",
            "replies": [
                {
                    "level": 1,
                    "comment": "Did Little Bobby Tables join your ISP?\n\nhttps://xkcd.com/327/",
                    "score": 1,
                    "author": "WayneH_nz"
                }
            ]
        },
        {
            "level": 0,
            "comment": "More interested on how you \"worked\" for the Crown, but got paid in dollars.",
            "score": 9,
            "author": "missannthrope1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Came here for this. Something felt off and I realised it is because of the $ signs and QC references. \n\nWas thinking Australia or perhaps Canada?",
                    "score": 16,
                    "author": "stupid_carrot",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Bingo! Lots of former British colonies use dollars and also the Westminster legal system.",
                            "score": 19,
                            "author": "barfridge0"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "New Zealand, we have both QC's (Now Kings Council, KC) and Dollars",
                    "score": 10,
                    "author": "WayneH_nz"
                },
                {
                    "level": 1,
                    "comment": "Post history. Auslegal and sunshine coast, they're Aussies.",
                    "score": 7,
                    "author": "WayneH_nz"
                },
                {
                    "level": 1,
                    "comment": "It’s almost like the UK was a global colony and many countries are still members of the commonwealth, and dollar is a common currency name in English speaking countries. /s\n\nSeriously though, there’s so many commonwealth countries that use dollars. Off the top of my head, Australia, Aotearoa, Canada, Fiji, and Jamaica all use dollars, plus there’s the several Pasefika nations that use NZD.",
                    "score": 5,
                    "author": "dejausser"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My parents got free cable in the 90s when they cancelled the cable after installing a satellite dish.\n\nA few months after the cancellation, I noticed the cable tv was never disconnected. \n\nThey were paying for satellite but had the cable going for 15 years without having to pay for it.",
            "score": 8,
            "author": "ArenSteele"
        },
        {
            "level": 0,
            "comment": "I got 12 years of free VOIP (not including calls) from my ISP after they screwed up an install, I asked 8 times on the call that they will do 'x' and then didn't do 'x' and then lost the tape. I would have still had voip - but a mate started at a new ISP - so I moved to his company. \n\nI also haven't paid any credit cards fees with a certain Credit card company since 1999 - due to a colossal mistake they made.",
            "score": 7,
            "author": "SomeoneInQld",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;due to a colossal mistake they made\n\nDetails?!? Or at least an idea of what was so colossally awful?!?",
                    "score": 4,
                    "author": "CanAhJustSay",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "first one : 1997: Stranded us (Australians) in Europe without a credit card, due to an internal error on their end - and refused to speak to us (other than pay your bill - which we did within 24 hours)\n\nSecond : they refused to acknowledge a payment - that we had our local bank manager pay on our behalf (as it turned out some of their internal staff stole the money) \n\nAn other Australian bank our 'spare' credit card - we rang them - they came to our rescue and I am still thankful to this bank to this day and still bank with them. \n\nWe waited 10 months returned to Australia\n\nthird : Refused to admin anything was wrong and wouldn't talk to us. \n\n&amp;#x200B;\n\nEarly 1999: \n\nBy this stage I am pretty pissed and pretty determined, and was living in a 5 star hotel in downtown Sydney. So anytime I saw a hotel guest using that credit card - said let me tell you a story. I told it about once a day on average. Then rang the CEO and said what I was doing (I think they had also had from some of their customers)\n\n&amp;#x200B;\n\nFinally had a 2 hour face to face with the CEO and he said give him 24 hours and gave us his personal mobile. Then we had another face to face meeting and he said that we were the worst customer service case they had happened (so far) to that company, I said I never want to pay a fee ever again, and several other reimbursements - some internal staff were fired (for the theft).  \n\nThey asked me to come and do a talk to their customer service staff about what happens when things go horribly wrong. I said maybe in ten years when I calm down - I never did. \n\nIts now 24 years late - and this has made me slightly 'angry' even thinking about it again.",
                            "score": 16,
                            "author": "SomeoneInQld",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I know you're in AUS, but in my headcanon I see all of this happening in a Chase branch.",
                                    "score": 10,
                                    "author": "PixTwinklestar",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Wells Fargo is more likely to screw you than Chase.",
                                            "score": 7,
                                            "author": "ronhowie375",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt;Wells Fargo is more likely to screw you than Chase.\n\n*Bank of America has entered the chat*",
                                                    "score": 5,
                                                    "author": "diverdux",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "All 3 of those suck big time!",
                                                            "score": 2,
                                                            "author": "Lay-ZFair"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Chase had a customer service person steal our number and charge up over 50k when we called in to do a transfer. They were able to catch them based on computer history and they are now in jail. I let that card go dormant now… don’t trust them at all.",
                                            "score": 2,
                                            "author": "UnOrDaHix"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Never been inside a Chase bank.",
                                            "score": 1,
                                            "author": "SomeoneInQld"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "So sorry I brought back bad memories for you but - wow. That is horrendous. I wonder what more damage their staff did that they only uncovered after you.",
                                    "score": 2,
                                    "author": "CanAhJustSay",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's all good - it was more of a frustration anger (with the CC company), than an upset anger.",
                                            "score": 2,
                                            "author": "SomeoneInQld"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "My dad had Comcast, ended up over-paying by like $60 before he cancelled. They turned off his cable at the box but neglected to turn off his internet...\n\nFor several years. He used it freely, justifying they could turn it off when they repaid him.",
            "score": 4,
            "author": "NocentBystander"
        },
        {
            "level": 0,
            "comment": "Few years back and I got a letter from a phone provider to say they were teaming up with a cable provider and that in future they would be offering combo packages. They were trialling the service and had randomly selected 500 customers who were customers of both companies asking if they were interested in a 1 year trial . Can't recall the costs  but for about $5 extra month over the cost of the cable package I would get my mobile phone package , saving me about $30 a month so I signed up for the 1 year trial. It took them about 8 or 9 years to finally realise they'd forgotten about the 500 customers on the 1 year trial ; they duly gave us about 9 months further notice. In all those years both the cost of the cable tv package and the mobile phone package had risen but for reasons unknown both prices from the original trial offer were never increased",
            "score": 4,
            "author": "Pilot-99"
        },
        {
            "level": 0,
            "comment": "When I was mid 20's I had moved out of my house  to have major renovations done. I had called my electricity provider to have my power disconnected.\nTurns out they did not disconnect, so all the tradies were able to use my power. \n6 months has later I had multiple calls from the power provider wishing to speak about my bill. \nRang back expecting a large amount I owed them. In fact it was the opposite and were letting me know they had gone back through their records and owed me $160.",
            "score": 1,
            "author": "Sheenibopa"
        },
        {
            "level": 0,
            "comment": "2 years of high speed cable for free! That’s a lot of porn",
            "score": 0,
            "author": "AcrobaticSource3"
        },
        {
            "level": 0,
            "comment": "We moved into my great aunt/uncles house in 91, we inherited it, my mom had turned in their cable box while everything was going thru probate, we thought we would wait on getting cable back, I had a old Curtis Mathis console tv, the main dial was broke so we ran everything thru our vcr, the house did not have a antenna either, so I thought I thought I would be slick and plug into the cable wire and use that as a antenna, the cable was still on. Had free cable till they came thru with fiber optic",
            "score": 1,
            "author": "Many_Rope6105"
        },
        {
            "level": 0,
            "comment": "Good story. Not sure how you got 8am to 4pm is 10 hours though.",
            "score": 1,
            "author": "wkendwench",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not OP but assume it would be the time he couldn’t be at work, so he’s charging them what he lost, not charging for the time he spent there",
                    "score": 1,
                    "author": "S99B88"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Because someone who makes $600 per hour would most definitely take time off themselves not once, but multiple times to wait for the cable guy. Cute story.",
            "score": -15,
            "author": "jewelophile",
            "replies": [
                {
                    "level": 1,
                    "comment": "You missed the point—they made up that story for the cable company and the company fell for it",
                    "score": 13,
                    "author": "Naomeri",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I didn't miss the point. The story is so utterly unbelievable that no one would ever fall for it.",
                            "score": -8,
                            "author": "jewelophile"
                        }
                    ]
                }
            ]
        }
    ]
}