{
    "id": "146bq5j",
    "score": 1349,
    "title": "The rebellion of the eggs",
    "author": "CB01Chief",
    "date": 1686432684.0,
    "url": "https://www.reddit.com/r/pettyrevenge/comments/146bq5j",
    "media_urls": [],
    "other_urls": [],
    "postText": "So my wife of 5 years is a wonderful and lovely lady. She is so smart, beautiful, patient and stubborn.\n\nEvery time she goes out grocery shopping she comes home as the amazing wife she is and puts the groceries away. HOWEVER. You know that spot on the fridge door on the top shelf that's just big enough to put a carton of eggs? Well lo and behold that where we put our eggs and the top of the carton sits a bit more than flush with the rail. Well when my wife puts things away she will often put other things on top of the carton, at which point the item is no longer protected by the rail.\n\nQueue the pettiest of revenges. After opening the fridge door all week and having a whole container of blueberries spill out onto the floor, picking them up, washing them off and putting them back in the empty crisper. Everyday the package found its way back onto the eggs. So one night after the whole family fell asleep. I went to the fridge and wrote a letter to my wife... from \"the eggs\". With that note I stuck 5 toothpicks into the carton nailing the letter to the carton. Then I impaled a blueberry onto each toothpick.\n\nThe letter read something to the effect of...\n\n\"Dear MRS of the house, procuror of food and stocker of the sacred temple of freshness. I the leader of the ovum empire have reason to believe that you wish to antagonize us with your constant acts of war. We are delicate beings and will no longer tolerate any other civilizations to be built upon our shoulders. You will find attached to this letter 5 tokens of warning. We will not ask twice. Next time there will be war.\n\nSigned the choosen one\n\nTo this day, she hasn't placed anything else on the eggs. However she routinely jokes about it.",
    "comments": [
        {
            "level": 0,
            "comment": "It’s too bad she didn’t create a response from the Confederation of Fruits, threatening an annexation of the shelf by a battalion of bananas and a company of cantaloupe.",
            "score": 309,
            "author": "vybrosit_tyda",
            "replies": [
                {
                    "level": 1,
                    "comment": "I had hoped she would. Typically the meats remain as a neutral state for it is the super power of the fridge. But they would back the egg oppression. There would be war in the fridge between the foods.",
                    "score": 193,
                    "author": "CB01Chief",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you two don't mind making a bit of a mess, I'd love for you to rip up a lettuce and smear some ketchup around. Just another casualty.",
                            "score": 48,
                            "author": "totallynotarobut"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You can't win without Aubergine artillery support.",
                    "score": 26,
                    "author": "davesy69",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Which side would the eggplant choose?  Egg or plant?",
                            "score": 50,
                            "author": "AJRimmer1971",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Conscientious objector. Goes around with a sign saying \"give peas a chance\"",
                                    "score": 5,
                                    "author": "C_beside_the_seaside",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Visualise whirled peas!",
                                            "score": 3,
                                            "author": "AJRimmer1971"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Glad she didn't ova-react.",
            "score": 355,
            "author": "CoderJoe1",
            "replies": [
                {
                    "level": 1,
                    "comment": "If she did their relationship would probably end up becoming a shell of what it once was.",
                    "score": 86,
                    "author": "baronessindecisive",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Can''t make an amelette without crackin a few eggs...",
                            "score": 26,
                            "author": "DJMemphis84",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's no yolk you know!",
                                    "score": 16,
                                    "author": "still-dazed-confused",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "This is an egg-celent pun thread!",
                                            "score": 14,
                                            "author": "Calligraphee",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That note came from the Oval office.",
                                                    "score": 16,
                                                    "author": "davesy69"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "A true chef-d'œuf!",
                                                    "score": 2,
                                                    "author": "SingerBrief8227"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "We have this great relationship where sometimes she takes things a bit harder than is warranted. But I get to make this sort of face that says \"really?\" She then stops and we laugh and make joke for the next 30mins and then she gets serious all the sudden and makes a witty one liner which makes me die and I have to leave the room.",
                    "score": 195,
                    "author": "CB01Chief"
                },
                {
                    "level": 1,
                    "comment": "OP would have to scramble to come up with an apology.",
                    "score": 4,
                    "author": "butterfly-garden"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I could see my husband doing this. Love that sense of humor. 😊",
            "score": 51,
            "author": "MorgainofAvalon",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well, let us know when you have bought blueberries and placed them on top of the eggs.\n\nChapter 2; the war of Blueberry Hill\n\n(not to be confused with Hamburger Hill, which was a terrible fight during the Vietnam War, at Dong Ap Bia, BUT WILL ALSO soon be \"Chapter 3 - The War of the meat\")",
                    "score": 6,
                    "author": "EvulOne99"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Glad I'm not the only one with a fridge that resembles a teens closet...",
            "score": 30,
            "author": "Little-Conference-67",
            "replies": [
                {
                    "level": 1,
                    "comment": "Teens closet at least makes sense. Our fridge has no excuse.",
                    "score": 32,
                    "author": "CB01Chief",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I have given up trying to keep things organized there, as her system is to just jam things where it may fit. And you need to remove four things (in average) for every thing you actually need.",
                            "score": 6,
                            "author": "EvulOne99",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My fridge is damn near empty all the time. How do people have so much in the fridge on a regular basis? I know it is just me and two kids so not a lot of mouths to feed and maybe these places with super full fridges are feeding a very large family.",
                                    "score": 2,
                                    "author": "StupidFugly",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "We're just two. No kids. I cannot answer your question. It's never enough food... But loads of jars and stuff, with unspeakable contents. Or unknown, at best... because... labels exists on another plane of existence, never in our fridge.",
                                            "score": 4,
                                            "author": "EvulOne99"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Haha, no it doesn't 🤣 😂",
                            "score": 2,
                            "author": "Little-Conference-67",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "THE PILES ARE SORTED BY SMELL/HOW MANY WEARS IT HAS LEFT!",
                                    "score": 9,
                                    "author": "DJMemphis84",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "If it doesn’t stick to the wall and can be folded without breaking it’s still clean enough to wear",
                                            "score": 5,
                                            "author": "Expensive-Aioli-995"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "The moldiest items at the back.",
                                            "score": 3,
                                            "author": "EvulOne99"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "LOL, wish I could use that as a model to highlight some \"interesting\" habits my more gooder half has. Unfortunately, anything perceived as criticism brings out some level of the monster!",
            "score": 17,
            "author": "EMCSW"
        },
        {
            "level": 0,
            "comment": "This reminds me of the labels on our refrigerator drawers: \"Vegetable Hospice\" and \"Meet the Meat\".",
            "score": 17,
            "author": "MyFavoriteInsomnia"
        },
        {
            "level": 0,
            "comment": "That's for eggs?!?!?! \n\nI grew up with a type 1 diabetic in the immediate family and then went on to marry a type 1 diabetic. That has been the insulin storage spot for as long as I can remember 😂. \n\nEven when I was single I kept that spot open in case my parents came to visit!",
            "score": 16,
            "author": "Motor_Expression_487",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not sure if it was built for eggs specifically, but that's what we use it for. It's very convenient. I grew up in a house where eggs were top shelf on the left... they usually ended up cracked in the carton or forgotten about and pushed to the back. It's nice that our eggs have their own spot. Poor things deserve better.",
                    "score": 14,
                    "author": "CB01Chief",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh dear god... Brother?... Every fridge i've had, eggs are top left... Damn you mother!",
                            "score": 7,
                            "author": "DJMemphis84",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "In the middle, often at the left but not necessarily so, and often more than one packs. \n\nAnd of course, a few eggs missing here and there, in two or even three packs, because... you do NOT simply use the first received pack until it is empty, as that would be boring. Or the most logical way. \n\nI am just happy we're getting them for free from her parents. But that is the ONLY thing about our fridge that makes me happy. Well, it works.\n\nShit, I may have jinxed it now.",
                                    "score": 3,
                                    "author": "EvulOne99",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I need to name our pan \"Mordor\", so that I can joke about eggs simply not falling into Mordor.\n\nShe will get that one, being a fellow(ship) nerd of all things fantasy.",
                                            "score": 5,
                                            "author": "EvulOne99"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Actually, the eggs don't really like changes in temperature (nor they really need refridgerating) so no, from that perspective it is not for the eggs. Often the fridges come with a tiny egg holder thing designed to fit that space, so from that perspective it is for the eggs.\n\nWe store diabetes medicine there as well, and fast food ketchup bags (the local Burger King always gives at least a dozen bags even if you specifically ask none).",
                    "score": 1,
                    "author": "Petskin"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Okay, Vlad the Blueberry Impaler.",
            "score": 5,
            "author": "totallynotarobut"
        },
        {
            "level": 0,
            "comment": "You really feel like this couple’s relationship might be like walking on eggshells. That cracks me up.",
            "score": 5,
            "author": "nursemomgardener"
        },
        {
            "level": 0,
            "comment": "This post is so wholesomely petty",
            "score": 3,
            "author": "AlabamaWinterRose"
        },
        {
            "level": 0,
            "comment": "I've heard eggs shouldn't be put in the door. Too much jostling. \n\nExpect a revolt.",
            "score": 3,
            "author": "missannthrope1"
        },
        {
            "level": 0,
            "comment": "That's hilarious!",
            "score": 2,
            "author": "no_nonsense_206"
        },
        {
            "level": 0,
            "comment": "This is hilarious😆",
            "score": 2,
            "author": "CreedTheDawg"
        },
        {
            "level": 0,
            "comment": "This is hilarious. You are awesome. \n\n\nThat spot deserves taller goodies anyways. Tall real estate in a fridge is in high demand in my house.",
            "score": 2,
            "author": "EmEmPeriwinkle",
            "replies": [
                {
                    "level": 1,
                    "comment": "I just went through my fridge and cleaned out all the expired salad dressings and sauces. \n\nNot like, \"Oh hey, this expired last month.\"\n\nMore like, \"Wow, this sauce predates my children.\" and then yelling, \"HEY HUN, DID YOU KNOW THIS EXPIRED IN 2015!?!\" across the house and realizing you really should clean out the fridge *all the way* more often.",
                    "score": 10,
                    "author": "last_rights",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lol I do a Sunday evening sweep of the fridge for expired things. But the dressings and whatnot is more like once every two months. We just love sauces.",
                            "score": 1,
                            "author": "EmEmPeriwinkle"
                        },
                        {
                            "level": 2,
                            "comment": "Both my college kids were home when fridge died &amp; replacement purchased. Hilarity ensued as we worked together to prep for the arriving replacement.",
                            "score": 1,
                            "author": "just1here"
                        },
                        {
                            "level": 2,
                            "comment": "&gt; More like, \"Wow, this sauce predates my children.\" and then yelling, \"HEY HUN, DID YOU KNOW THIS EXPIRED IN 2015!?!\" across the house and realizing you really should clean out the fridge *all the way* more often. \n\nThat's my house all the time. ![gif](emote|free_emotes_pack|smile) It's like a science project going on in my fridge. My husband stuffs what he can in the back, and it's lost... Then the cycle repeats.",
                            "score": 1,
                            "author": "GenXMomma2009"
                        },
                        {
                            "level": 2,
                            "comment": "Oh maybe this is the answer to my issue. I look in my fridge and it is so empty compared to absolutely everyone elses fridge and I can not work out how people have so much in their fridge. I have nothing that is even close to expiring in my fridge. Left overs get tossed out after 3 days if they are not already eaten. I keep such a close eye on use by and best before dates.",
                            "score": 1,
                            "author": "StupidFugly"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This made me think of \"The Trees\" by Rush for a brief second.  Not sure how to rewrite the lyrics from maples and oaks to eggs and blueberries, though.",
            "score": 2,
            "author": "GrumpyCatStevens"
        },
        {
            "level": 0,
            "comment": "Cue. It’s cue!",
            "score": 2,
            "author": "Interestofconflict",
            "replies": [
                {
                    "level": 1,
                    "comment": "Just be glad it's not \"kyew\"... a totally different discussion to be had.",
                    "score": 2,
                    "author": "CB01Chief"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You truly eggcelled in this.",
            "score": 2,
            "author": "Sad_Sell_57"
        },
        {
            "level": 0,
            "comment": "&gt; Queue the pettiest of revenges.\n\nQueue it up after which others?",
            "score": 2,
            "author": "MobileCollection4812"
        },
        {
            "level": 0,
            "comment": "I love this story so much! The \"ovum empire\" had me laughing out loud. \n\nI too would have loved a response in kind but at least she acknowledged your concern.",
            "score": 2,
            "author": "StuBidasol"
        },
        {
            "level": 0,
            "comment": "You're like the Vlad Tepes of eggs.",
            "score": 2,
            "author": "lectricpharaoh"
        },
        {
            "level": 0,
            "comment": "You shouldn’t store your eggs on the door, the temperature fluctuations will cause them to soil faster.",
            "score": 3,
            "author": "CarolineTurpentine",
            "replies": [
                {
                    "level": 1,
                    "comment": "A carton of eggs doesn't last a week in our family. They are considered the merry go round food in our house. We have a foam carton we like that we keep in the door. It holds 18, we buy by the dozen and cycle through them in a FIFO method.",
                    "score": 8,
                    "author": "CB01Chief",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "While I’m the same it still affects the freshness which is important for cooking eggs certain ways. If all you’re doing is quick breakfasts it likely doesn’t matter.",
                            "score": 4,
                            "author": "CarolineTurpentine",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yup nothing fancy here. Broken over easy, under cooked over hard, the I tried a sunny side up and now it's whatever. Yea it's casual cooking at best",
                                    "score": 7,
                                    "author": "CB01Chief",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt; the I tried a sunny side up and now it's whatever.\n\nMy version of this is I tried making an omelet and it's now scrambled eggs.\n\nWhen I do eggs, I usually do either scrambled or over-easy.  I can also make a near perfect hard-cooked egg, but I don't like eating those.",
                                            "score": 1,
                                            "author": "GrumpyCatStevens",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "My partner will eat the yolk, never more, out of hardboiled... I refuse to make em being an ex cook",
                                                    "score": 2,
                                                    "author": "DJMemphis84"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I agree totally.\n\nThe door is the worst place for any dairy, milk especially.  Our milk area is in the way way back.",
                    "score": 1,
                    "author": "derpne13"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Recreate it and take a picture please",
            "score": 1,
            "author": "sqqueen2"
        },
        {
            "level": 0,
            "comment": "I bet being married to you is a lot of fun. Great letter, thanks for sharing! 😂💕",
            "score": 1,
            "author": "AnastasiaDelicious"
        },
        {
            "level": 0,
            "comment": "This is wonderful! I have done similar notes in the past. \n\nI don’t understand why this is considered petty. \nIt gets your point across in a good natured way. \n\nWhy is that kind of (lovely) note considered petty??",
            "score": 1,
            "author": "FacelessArtifact",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's petty because instead of taking the blueberries off the eggs and putting them somewhere more acceptable and then tell her where I put them and why, I was child like and threatened to start a food fight.",
                    "score": 2,
                    "author": "CB01Chief",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "🤷🏽‍♀️ I guess I’m more petty than I thought. I thought your way was cute, a gentle, fun, reminder. \nI don’t think I’m as socially assimilated as I thought.",
                            "score": 1,
                            "author": "FacelessArtifact"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Crazy kids with their healthy relationships. I'm 113 years old and I don't even know if my wife speaks the same language as me, and we've been married for 108 years!!! Like a normal couple!!! /s",
            "score": 1,
            "author": "MarginalGreatness"
        },
        {
            "level": 0,
            "comment": "OP, can I just say, you did a great job with that letter. Makes me laugh, it's so funny.",
            "score": 1,
            "author": "IisAMaterialGworl"
        },
        {
            "level": 0,
            "comment": "You handled it in a fun and playful way! Some people might start a fight with their SO, blame get thrown, even more than those poor blue berries! Good job!",
            "score": 1,
            "author": "SquidlyMan150"
        }
    ]
}