{
    "id": "1487tmn",
    "score": 1950,
    "title": "Petty revenge on a shrieking surly idiot feeding seagulls",
    "author": "ScowlyBrowSpinster",
    "date": 1686635585.0,
    "url": "https://www.reddit.com/r/pettyrevenge/comments/1487tmn",
    "media_urls": [],
    "other_urls": [],
    "postText": "I was babysitting and took my young charges to the beach. They were 3 years old and having a great time collecting sticks and rocks and feathers, playing chase, digging and having kid fun.\n\nThere were very few people nearby, just a couple of young gals, maybe early 20s snoozing and tanning, on a sunny day, sparkly ocean, an all around nice time. They were 100% unbothered by the two lil kids with me doing their thing.\n\nA woman and maybe her daughter of an age similar to the tanning gals came and plopped down on their blanket maybe 15 feet away from the tanning gals, probably 30 feet from us. Older woman pulls out a bag of something, bread? crackers? and starts chucking them out into the sand between her and the two gals. Immediately a flurry of dirty, squawking, fighting gulls descend for the snacks, swooping over the two gals, waking them up. They are startled and annoyed by the low circling, landing, cracker snatching birds  that are blowing sand on them with their flapping wings, just inches away.\n\nI hear one of the gals ask the woman to please not feed the birds because they are disturbing them. The woman starts shrieking that she can do what she wants, blah blah. Never mind that she could have done her Snow White convenes with nature scene somewhere else on the wide open beach if she'd considerately sat some distance from other people, but she didn't. \n\nI was thinking how annoying she was as she went on &amp; on at the two gals, but suddenly my young charges did what many three year olds love to do at the beach...they got up and ran straight at the birds who all started flapping and flying in all directions to escape, giving the bird lady a taste of the nastiness the gals had just experienced. If they landed nearby again, the kids turned and ran that way. Seagulls everywhere! Bird mayhem!\n\nThe bird lady was enraged and started yelling at the kids to leave the birds alone. I yelled at her that they are just little kids and THEY CAN DO WHAT THEY WANT. The kids had stopped when she started yelling but I told them to run and chase birds if they wanted, so they did.\n\nYounger woman looked like she wanted to dig a hole and climb in. Obnoxious woman packed up her crackers and blanket and they left.\n\nThe sun continued to shine, the water sparkled and we kept on enjoying our lovely day.",
    "comments": [
        {
            "level": 0,
            "comment": "It’s terrible for the birds too. My husband and I visit the beach every Saturday during the summer. These seagull feeders are the reason we have a large umbrella. (We grew tired of being pooped upon.) There is a silver lining. If someone starts to share their snacks we prepare to be entertained. People who start sharing their snacks don’t realize they’re about to feel like they’re in an Alfred Hitchcock movie.",
            "score": 637,
            "author": "Expensive-Delay-9790",
            "replies": [
                {
                    "level": 1,
                    "comment": "It was just like that. Where I live it's against the law to feed the damn dirty birds.\n\nGleeful children foiling the awful person on the beach was so satisfying.",
                    "score": 348,
                    "author": "ScowlyBrowSpinster",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There are signs at the local beaches saying not to feed the seagulls. Unfortunately, the seagulls can't read and like to swoop down on people and steal people's food.\nThis is why they're known as sea-rats.",
                            "score": 149,
                            "author": "CheckComprehensive22",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh yes, I've watched seagulls go into people's bags, pull out packaged foods, rip em open and fight over the doritos or whatever. \n\nOnce at the zoo, a gull swooped down and stole a whole slice of pizza off my friend's plate as we walked to a table. She didn't even get a bite!",
                                    "score": 118,
                                    "author": "ScowlyBrowSpinster",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I finished a shift pretty late at about 23:50 and I hadn't eaten since noon. Everything would be closed at midnight so I sprinted to a nearby pastry shop. They only had 1 thing left and if was pretty old and dry but I got it anyway. I walk out and take one bite and a fucking seagull swoops behind me and knocks it right out of my hand into a muddy puddle... the asshole didn't even pick it up afterwards. Fuck seagulls!",
                                            "score": 95,
                                            "author": "rake66",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "What a bastard bird!",
                                                    "score": 22,
                                                    "author": "ScowlyBrowSpinster",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Feel the same way about squirrels. Little F-ers chewed a big hole in my hip pack to get at a package of trail mix. Was only resting for 10 mins in my tent. Ruined an expensive bag...",
                                                            "score": 5,
                                                            "author": "JaBevi5055",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Don't get me started on raccoons. They are gangsters.",
                                                                    "score": 7,
                                                                    "author": "ScowlyBrowSpinster",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "You mean trash pandas?",
                                                                            "score": 6,
                                                                            "author": "FoolishStone",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Yes, those pesky bandits with tiny hands and sharp grippers and chompers!",
                                                                                    "score": 7,
                                                                                    "author": "ScowlyBrowSpinster"
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "You owe me a laptop keyboard because I JUST snorted my chai all over it at your comment!!!",
                                                                                    "score": 4,
                                                                                    "author": "aquainst1"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "And chipmunks. They love to burrow into or under foundations, Fuck those little bastards, no matter how \"cute\" they are.",
                                                                    "score": 2,
                                                                    "author": "Haunting-Contact-72"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Bast-bird 🙂",
                                                            "score": 2,
                                                            "author": "Square_Activity8318",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Use a pun, go to the punitentiary, pal!",
                                                                    "score": 6,
                                                                    "author": "ScowlyBrowSpinster"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Flying rats!",
                                                            "score": 0,
                                                            "author": "moboater1"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I was enjoying a holiday in filey, in the town. Was eating my chips  and enjoying the nice weather. Look over the road and a seagull was chasing a young bloke down the adjacent hill, after the poor fella’s chips. Bastard",
                                                    "score": 4,
                                                    "author": "onion959"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "They're the fucking worst. I went and got a wrap on my lunch break once and one landed on my shoulder and took a bite out of it before I even made it back to the office. The ones here just aren't scared of anything, they're huge and vicious.",
                                                    "score": 3,
                                                    "author": "HeadlinePickle"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I was at SeaWorld, and I saw a dad leave his kid at the table with a hamburger, while Dad went to fetch drinks. As soon as dad was gone, the seagull swooped in and stole the hamburger patty out of the kids sandwich and made him cry.![gif](emote|free_emotes_pack|smile)",
                                            "score": 22,
                                            "author": "satanic-frijoles",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I had that happen to me at Sea World when I was a kid... damn bird swooped right in and stole my hamburger patty and half of the bun right out of my hands. I don't remember if it pooped on my mom's plate on the way out or if it was a different bird, but that was a pretty crappy lunch experience.",
                                                    "score": 13,
                                                    "author": "LeisurelyImplosion",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Theft AND poop! WHAT A WORLD!",
                                                            "score": 11,
                                                            "author": "ScowlyBrowSpinster",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Seagull?\n\nSeaWorld?\n\nCoincidence? I think not.",
                                                                    "score": 2,
                                                                    "author": "aquainst1",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I think you've cracked it!",
                                                                            "score": 2,
                                                                            "author": "ScowlyBrowSpinster"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Where I was, was a patio enclosed by heavy wire or screen, but the seagull snuck in through a gap and escaped the same way.\n\nThey are smart!",
                                                            "score": 6,
                                                            "author": "satanic-frijoles",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Bastards!",
                                                                    "score": 4,
                                                                    "author": "ScowlyBrowSpinster"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Remember the Hawaiian Punch pavilion, and the hydrofoil??\n\nThat was a great place.",
                                                            "score": 2,
                                                            "author": "aquainst1",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "You'd think an excited little kid would remember stuff like that, but the only thing I actually still recall is the way that bird stole my lunch.",
                                                                    "score": 2,
                                                                    "author": "LeisurelyImplosion"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Vicious!",
                                                    "score": 3,
                                                    "author": "ScowlyBrowSpinster"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "My father hated seagulls with an absolute passion. He had observed gulls ripping flesh off wounded men (sailors) in the water from ships that had sunk during battles. It has taken me decades to not hate them as much as I did.",
                                            "score": 39,
                                            "author": "MLiOne",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Feckin gulls making a bad situation worse!",
                                                    "score": 8,
                                                    "author": "ScowlyBrowSpinster",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "They certainly did. Went for the living as much as the dead.",
                                                            "score": 2,
                                                            "author": "MLiOne"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Witnessed this as a teenager. I grew up on Lake Erie and was swimming with friends at a local beach when we noticed seagulls standing and pecking on a log floating off shore. It wasn't a log. Guy had drowned a week before and floated to the surface.",
                                                    "score": 5,
                                                    "author": "moboater1",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I am so oddly worried about randomly coming across a dead body, probably from watching too many crime shows. That floater would have made me stay out of the water for more than the day.",
                                                            "score": 5,
                                                            "author": "ScowlyBrowSpinster",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "You watched BONES a lot, huh?!\n\nWe're watching a lot of the reruns on BONES marathons.",
                                                                    "score": 1,
                                                                    "author": "aquainst1",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I've actually never watched Bones, but I have watched aaaallllll the Forensic Files and many other true crime shows, and didn't Law and Order (Sam Waterston, Chris Noth, Jerry Orbach version) used to start off witha  random newspaper delivery person or a jogger tripping over a dead body at the beginning of the show most of the time? \n\nAnyway, I watched all those back in the day too, and somehow ended up with the feeling that sooner or later it'd be my turn. I used to walk my brother's dog along this desolate awful waterway in Long Beach and thought it was a natural spot for a serial killer to dump bodies and when I told my brother and S-i-L, they said Dexter had filmed down there several times!",
                                                                            "score": 3,
                                                                            "author": "ScowlyBrowSpinster",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Ah. I LOVED Sam Waterston and Jerry Orbach!!\n\nWas this before the LB Waterfront area/Marina was built, where the old Pike used to be, or around Naples?\n\nOr the Marine Stadium?\n\nI grew up in Long Beach by Cal Worthington Ford.",
                                                                                    "score": 2,
                                                                                    "author": "aquainst1",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Traumatic thing to witness. Feel for you.",
                                                            "score": 2,
                                                            "author": "MLiOne"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "They’re doing what nature intended. 🤷‍♀️",
                                                    "score": -6,
                                                    "author": "SnooBananas6474",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I'ma go out to my local beach with a big stick club them and eat them, sounds good?",
                                                            "score": 9,
                                                            "author": "niro1739",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "They would probably taste like what they eat...garbage.",
                                                                    "score": 10,
                                                                    "author": "Witty_Ruin_7339",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "So do cows taste like grass? There's only one way to know and at least I've got my weekend plans sorted now",
                                                                            "score": 10,
                                                                            "author": "niro1739",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Well, maybe. I know beef from grass fed cattle tastes better and costs more.",
                                                                                    "score": 0,
                                                                                    "author": "Witty_Ruin_7339"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "So you’d happily sacrifice your own flesh to the gulls then, snoobanana?",
                                                            "score": 2,
                                                            "author": "stanleysgirl77",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Nope. I said nothing other than it’s what seagulls do 🤷‍♀️",
                                                                    "score": 1,
                                                                    "author": "SnooBananas6474"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "hahah. i watched a seagull at the monterey bay aquarium (well, it was outside) fly up and open a takeout container and start rummaging through it, while the person WAS HOLDING THE BOX.",
                                            "score": 2,
                                            "author": "dirk_funk",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Shameless AND fearless with their bitey beaks!",
                                                    "score": 2,
                                                    "author": "ScowlyBrowSpinster"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Reminds me of how bears can rip into someone's car for food. \n\nGulls and bears are SMART when it comes to food.",
                                            "score": 2,
                                            "author": "aquainst1",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Omnivore scavengers are savage.",
                                                    "score": 3,
                                                    "author": "ScowlyBrowSpinster",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Are you also referring to coworkers who steal your lunch out of your work refridg??\n\nI mean, nature's animals DO mimic the higher animals.",
                                                            "score": 2,
                                                            "author": "aquainst1"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "My brother left an entire roast beef sandwich unattended at the beach for maybe 30 seconds and a seagull swooped down and snatched it. The image of that gull flying away with an entire sandwich hanging out of his beak is still something that my family laughs about, 25 years later. My brother still despises seagulls to this day. Lol",
                                    "score": 16,
                                    "author": "sportsfan3177",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Stupid gull: We have the MEATS!",
                                            "score": 10,
                                            "author": "ScowlyBrowSpinster",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "**\"WHERE'S THE BEEF?????\"**\n\n(Anybody remember Clara Peller in the Wendy's commercials?)",
                                                    "score": 5,
                                                    "author": "aquainst1",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Of course, but this was a roast beef sammich.",
                                                            "score": 4,
                                                            "author": "ScowlyBrowSpinster",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Vs. the cellulose replacement that was called 'hamburgers'. \n\n&lt;sigh&gt;\n\nI remember Mike's Munchie's turkey sandwich in Marina Pacifica, where you could roll up to the restaurant via water, &amp; tie up.",
                                                                    "score": 2,
                                                                    "author": "aquainst1",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Well, that's fancy, you boat person!",
                                                                            "score": 2,
                                                                            "author": "ScowlyBrowSpinster",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Naw, I never tied up at their dock, I just noticed it was there. \n\nIt would've been cool to get a canoe, paddle on over, then stop for lunch!",
                                                                                    "score": 1,
                                                                                    "author": "aquainst1"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "🤣🤣",
                                                    "score": 2,
                                                    "author": "sportsfan3177"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "No no no. No sea gull served in restaurants!  Thats nothing but garbage on a bun",
                                                    "score": 2,
                                                    "author": "3lm1Ster"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "In the U.K., because they are also found around refuse tips they are called “Shite Hawks”.  Quite appropriate if you ask me.",
                                    "score": 5,
                                    "author": "Squirrox-2000"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "same here - against the law to feed any wildlife on the beach. \n\nMakes the seagulls get crafty and mean. They walk right up and steal food out of your open cooler.",
                            "score": 5,
                            "author": "geminiloveca"
                        },
                        {
                            "level": 2,
                            "comment": "lmao i thought this story was about me except i was one of the tanning girls and when these bitches were rude af and refused to stop feeding the disgusting seagulls i took their bread and chips and threw it on their chairs and blankets while seagulls flew all over them ☺️",
                            "score": 6,
                            "author": "leahlikesweed",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "\\*\\*\\*Supa Star!\\*\\*\\*",
                                    "score": 2,
                                    "author": "ScowlyBrowSpinster"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yeah the bread and crackers make them bloated and not hungry for nutritious food so they become unhealthy. And any birds near a lake or ocean can easily get their own food and don’t need help",
                            "score": 2,
                            "author": "Successful_Moment_91"
                        },
                        {
                            "level": 2,
                            "comment": "They were channeling Henry Jones Sr. (Sean Connery) from **Indiana Jones and the Last Crusade** :-D",
                            "score": 2,
                            "author": "FoolishStone"
                        },
                        {
                            "level": 2,
                            "comment": "Well, they’re not damn, dirty birds. They’re birds living where they should, and we stupidly do things like that lady did.",
                            "score": 0,
                            "author": "curiousmind111"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That's terrible! I can't believe how careless some people can be, not just towards the birds but also the other people on the beach trying to enjoy their Saturday. Having to use an umbrella to avoid being pooped on is a really extra step and they should be more considerate of everyone. I'm glad you shared your experience, hopefully it encourages people to be more responsible and not feed the birds when they visit the beach.",
                    "score": 8,
                    "author": "mcgee2433"
                },
                {
                    "level": 1,
                    "comment": "Not to mention, seagulls can get pretty aggressive. In my town (Venezia) they are notorious for attacking the unwary who eat food in the streets. I got attacked twice.",
                    "score": 4,
                    "author": "Eilmorel"
                },
                {
                    "level": 1,
                    "comment": "I was in Atlantic City in my early 20s. A seagull snatched most of a 6 inch sub out of my friend’s hand. I don’t fuck with sky rats",
                    "score": 2,
                    "author": "UnihornWhale"
                },
                {
                    "level": 1,
                    "comment": "I remember this one video where they documented themselves adding laxatives to the food that they then let the seagulls eat, and the end result was pure chaos with the seagulls pooping everywhere as they flew. Practically every passer-by was smeared in bird-poop...",
                    "score": 1,
                    "author": "AlexDavid1605"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Me and my friend were eating at a marina side cafe once when some asshole started throwing french fries at the seagulls and caused a big mob scene.\n\nI asked them to stop, the staff ask them to stop, and they didn't stop.\n\nThey were screaming seagulls everywhere and then they started trying to steal our food too.\n\nSo I grabbed my plate of fries, held it up over my head, walked over to their car which was parked in front of the tables, and dumped the entire pile of fries in the open sunroof window.\n\nThe car was full of seagulls within 30 seconds.",
            "score": 37,
            "author": "oldfrancis",
            "replies": [
                {
                    "level": 1,
                    "comment": "Was this pre-cameras-in-phones?  PLEASE tell me somebody got footage!",
                    "score": 5,
                    "author": "Minflick",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Early 80s.",
                            "score": 5,
                            "author": "oldfrancis",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "When all the best, undocumented stuff happened!",
                                    "score": 3,
                                    "author": "ScowlyBrowSpinster"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "🤣",
                    "score": 5,
                    "author": "CrazyBoysenberry1352"
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"I can do what I want! Even if you are inconvenienced, I can, because I am me!\"\n\n.... 5 minutes later...\n\n\"You cannot do what you want! I am inconvenienced, and I want you to stop! Listen to me!\"\n\n..\n\n... right. Also, everyone who feeds seagulls should be lathered with fish oil, rolled in breadcrumbs and fed to the said seagulls.",
            "score": 225,
            "author": "Petskin",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is the perfect consequence for these types.",
                    "score": 56,
                    "author": "ScowlyBrowSpinster"
                },
                {
                    "level": 1,
                    "comment": "I wonder if she targets girls on the beach. She had 365 degrees to throw the crackers and she throws them towards the only other people on the beach?",
                    "score": 2,
                    "author": "Sciencegirl117",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Possibly. There was no logical reason for her choice.",
                            "score": 1,
                            "author": "ScowlyBrowSpinster"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lol..seagulls are involved in one of my most shameful acts.\n\nSimilar to this story, a family sits behind myself, my sister and our kids at the beach.   Maybe 3 feet behind us?\n\nThe kid (4 or 5 yr old) immediately starts throwing crackers even though signs are up and down the beach telling them not to feed the seagulls.\n\nSeveral groups of folks asked them to stop because it's super annoying and you can't even pull out your own snack to eat because they get bold when there is a bunch of them.\n\nI asked the kid to stop twice and then asked his mother to stop three times and honestly..I have a mean face..she had to have seen I was mad.\n\nThe kid threw another fucking cracker right behind me..I was shaking I was so mad.   I told the kids to either cover their heads or go put their feet in the water... turned around and screamed if they want fucking birds..I'll give them birds.. and dumped a party size bag of doritos ALL over their beach blanket .. the birds went WILD!  The kid was screaming hysterically..the mom was yelling (dad didn't say a damn thing 😂) and the birds were having the meal of their life.   As soon as the birds calmed down, she called me a bitch and the packed up while the kid screamed the whole time.    My nephew (a smart mouthed teenager) said \"well...everyone asked you not to feed the birds.  We just did it better.\"\n\nThen I saw an old teacher 😂😂😂😂  she recognized my sister and I... I was soooo embarrassed.  Like mortified.   A year later..I'm no longer ashamed lol.",
            "score": 16,
            "author": "Outside_Holiday_9997",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am reading these anecdotes of \"I'LL GIVE YOU FEEDING THE BIRDS!\" and am dying laughing. Glad you are out of your shame phase cause this is what these kinds of people deserve, LOTS of birds, UP CLOSE &amp; PERSONAL, man!",
                    "score": 2,
                    "author": "ScowlyBrowSpinster",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lol..pretty sure that child will never feed another bird.    It would have been better if a little old lady hadn't caught me.   I'm 40 and feared she'd call my grandma for at least a month lol",
                            "score": 2,
                            "author": "Outside_Holiday_9997",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hopefully she was so scandalized she couldn't recall your name.",
                                    "score": 2,
                                    "author": "ScowlyBrowSpinster"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Seagulls are the bane of any beachgoers existence. Can’t have any food without being stalked - seagull lands 20 feet away, you look away and then back and he’s 15 feet….then 10…..then 5……..\n\nYou have to take a ferry to where I used to live &amp; the seagulls learned how to glide at a speed that is just a tiny bit faster than the ferry is going &amp; I’ve seen them slowly glide up behind someone having a snack and BAM seagull grabs the snack from over their shoulder &amp; makes a quick getaway \n\nAnyone who purposely feeds them is a true a*shole",
            "score": 16,
            "author": "lunamoth25",
            "replies": [
                {
                    "level": 1,
                    "comment": "When I was a little kid my parents took us to Martha's Vineyard? Nantucket? Anyway, some place you needed a ferry to get to. Gulls would coast alongside the upper deck and some genius thought it would be fun to hold up a chip or something for the gull to snatch. As a 6yo I thought this was the coolest, so I wanted to try it. I remember I was eating Fritos, so I went to the rail and held one up. A gull came swooping down, snatched the chip, but also bit my thumb and drew blood. Cue the crying. My father, who watched the whole thing, immediately took my mother's mostly smoked cigarette and held it up until the same gull that bit me came by. The bird grabbed the lit cigarette, ate it, and then did a power dive into the water. It popped up to the surface and just sat there looking indignant. I know now as an adult that that was a shitty thing to do, but 6yo me thought it was justice.",
                    "score": 14,
                    "author": "dmitrineilovich",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s the ferry I’m talking about - the MV one. I’ve seen that exact scenario SO MANY TIMES.  \n\nThe worst is when people give their little kids, like 3yrs old, a chip and hold them up to feed the gulls. That’s an injury almost guaranteed to happen \n\nGotta say, your dad’s reaction, while yes it was a shitty thing to do in my mind I’m still thinking “serves them right those assholes”",
                            "score": 10,
                            "author": "lunamoth25"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "We used to live across the road from s Macdonalds and KFC. It was amazing how the birds appeared every day at noon, waiting for all those motorists dropping their leftovers out of the window. Lazy tossers! But the seagulls had impeckable timing!",
            "score": 44,
            "author": "MegC18",
            "replies": [
                {
                    "level": 1,
                    "comment": "I enjoyed your word play \"impeckable\" :) :)",
                    "score": 8,
                    "author": "Zestyclose-Ad-4515"
                },
                {
                    "level": 1,
                    "comment": "For a real feeling of being in The Birds: attend Giants' baseball games where they line the top of the stadium starting after the 7th inning stretch song. They wait and look creepy till the game is over then they come tearing down to eat all the spilled popcorn and peanuts and left over hot dogs bits and nachoes left in the bottom of paper trays as people exit the stadium. THEY KNOW!",
                    "score": 16,
                    "author": "ScowlyBrowSpinster"
                },
                {
                    "level": 1,
                    "comment": "Is there anything more depressing than the people who eat drive thru fast food? They can't even muster the energy to get off their lazy asses and walk 20 feet.",
                    "score": -29,
                    "author": "AboyNamedBort",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Don’t tell me you’ve *never* eaten food from a restaurant’s drive thru window",
                            "score": 11,
                            "author": "stanleysgirl77"
                        },
                        {
                            "level": 2,
                            "comment": "I can think of about a billion things more depressing. Having to share a planet with people who walk around spewing judgment about strangers with zero reason other than pure assholery is one.",
                            "score": 11,
                            "author": "duck-duck--grayduck"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "A few years ago there was a dude being a total a hole maybe 15 or 20 ft in front of us on the beach. Loud, mean, smoking, just a jerk. He went down to swim and my buddy went up and poured out half a box of Cheez-Its over his stuff. He came back to a total mess, packed up and left.",
            "score": 13,
            "author": "tuenthe463"
        },
        {
            "level": 0,
            "comment": "Idle thought: if raccoons are trash pandas, would that make gulls trash canaries?",
            "score": 37,
            "author": "BabaMouse",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sky rats",
                    "score": 14,
                    "author": "w4mb4mth4nkum4m"
                },
                {
                    "level": 1,
                    "comment": "Garbage Gulls",
                    "score": 28,
                    "author": "NoMorKulAde",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Shit hawks where I'm from",
                            "score": 25,
                            "author": "Behindtheeightball",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Sea pigeons",
                                    "score": 12,
                                    "author": "1976warrior"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I just had flashbacks to when my friend and I were laying on the beach at Newport, minding our own business after enjoying a beach-stand lunch, and some feral seagulls decided they wanted the remainder of our French fries…which were on the sand between my friend and I, who were spaced literally maybe 2-3 feet apart. I nearly jumped out of my skin when I heard this enraged raptor-type cry literally in my ear and accidentally/fight or flight mode punched an in-flight seagull straight across my friend, French fries still clenched in its beak. It seemed very used to taking a human punch and was ready for fight me for more fries. It’s friends were equally unimpressed with our screaming and flailing. Those suckers were the size of ducks. \n\nWe got up and threw the rest away. Lol",
            "score": 12,
            "author": "AccentFiend",
            "replies": [
                {
                    "level": 1,
                    "comment": "This made me laugh pretty hard.",
                    "score": 2,
                    "author": "ScowlyBrowSpinster",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It was so surreal lol my friend and I grew up on the shoreline. Like walk to the ocean type of close. Seagulls don’t usually bother us. These things were like seagulls on steroids and rage 😂😂 it’s a toss up between these and wild turkeys for me as to which I’m going to GTFO faster when I see 🏃🏼‍♀️💨",
                            "score": 3,
                            "author": "AccentFiend",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Newport was my beach too, only it was a 2+ hour OCTD bus ride to/from Placentia/Yorba Linda. Lard, we were so willing to do it to be able to get out of the house &amp; to the beach before we could drive.",
                                    "score": 2,
                                    "author": "ScowlyBrowSpinster",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I live in southern CT so it’s definitely a hike, we would end up driving and forgetting about the toll EVERY time 😅",
                                            "score": 1,
                                            "author": "AccentFiend",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Whoops, haha wrong Newport, I am talking about So Cal. Couldn't be further away!",
                                                    "score": 2,
                                                    "author": "ScowlyBrowSpinster",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Could have been the one in Wales 😉",
                                                            "score": 2,
                                                            "author": "AccentFiend",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Probably every state and country on an ocean or sea has a Newport.",
                                                                    "score": 2,
                                                                    "author": "ScowlyBrowSpinster",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Surprisingly, no! Google says there are 56 places globally that are called Newport, and 21 of them are cities. I’m just used to cities and beaches near me (in New England) being repeats of names in the UK..because OG England lol so I thought of the uk first",
                                                                            "score": 2,
                                                                            "author": "AccentFiend"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "My OH used to waiter at a waterfront restaurant that has an outside patio, &amp; the seagulls would steal entire steaks off their trays! The waitstaff had to take a broom or something to fend off the seagulls when carrying out the food. OH even asked to the managers to let him sit on the roof &amp; snipe the gulls with cayenne pepper spiked paintballs. The managers never allowed it though, lol.\n\nI used to go to that waterfront often when I was a kid, &amp; over the years sometimes the patios had to be closed off entirely because the gulls were too used to snatching food right from customers' plates while they were eating. Ngl, it was a little eerie to see a flock of of 50+ gulls all sitting on the patio tables &amp; staring into the restaurant.\n\n\nFunny story:\nA few years ago I went to the beach, &amp; there were some (I guess) 18-19 year old boys hanging out &amp; horsing around nearby, just being teenagers with freedom. When they were wrapping the day up, they had a couple of huge bags of Cheetos leftover. One guy laid out on the sand &amp; had his friends dump the Cheetos out all over him. \n\nIt went exactly as can be expected.\n\nChaotic flapping of wings, flailing of arms, alarmed hollering &amp; yelping, &amp; feathers flying ensued. After a few minutes of a Hitchcock-esque moment the guy who played snack platter gave up &amp; rinsed off in the water, his friends were filming &amp; about rolling on the sand with laughter.\n\nI got to witness something that would befit a Jackass skit. 🤣 I was laughing so hard my guts hurt &amp; my eyes were streaming. I tried to get my own pics, but my old phone camera was a piece of junk. I still laugh when I remember those guys &amp; their \"brilliant\" plan. 😆",
            "score": 7,
            "author": "LimeFizz42",
            "replies": [
                {
                    "level": 1,
                    "comment": "That term SO cracked me up!\n\n\"Snack platter\".\n\nOr, should I say \"that TERN so cracked me up\"?",
                    "score": 2,
                    "author": "aquainst1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yah you shoulda said tern, Next time!",
                            "score": 2,
                            "author": "ScowlyBrowSpinster"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Live &amp; learn!",
                    "score": 1,
                    "author": "ScowlyBrowSpinster"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you think seagulls are cheaky bastards, then you've never met mallards (ducks) that are used to humans. Several years ago when my youngest son was about 5 years old a mallard flew pass him and snatched a cinamonroll he was going to take a bite of out of his hand at the beach.\n\nAnd don't get me started about cobra chickens (canadian geese).",
            "score": 7,
            "author": "joppedi_72"
        },
        {
            "level": 0,
            "comment": "I've known people that would have smacked bird lady's snacks out of her hands and all over her blanket so the gulls would have fucked it all up.\n\nI've also known people that would have smacked her upside the head with a shovel.",
            "score": 6,
            "author": "Arokthis",
            "replies": [
                {
                    "level": 1,
                    "comment": "Apt responses!",
                    "score": 1,
                    "author": "ScowlyBrowSpinster"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Haha! There are few greater pleasures in life than watching a moron enter a beach marked with a giant \"DON'T FEED THE SEAGULLS\" sign, and start feeding the goddamn seagulls. The ones they have in my usual vacation destination are huge, and completely fearless. At one point there was an official advisory to not take miniature dogs to the beach, on account of eye-pecking, drowning attempts and general harrassment.",
            "score": 7,
            "author": "curmudgeonpl",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yikes! Gangsters for real!",
                    "score": 2,
                    "author": "ScowlyBrowSpinster"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My mum is afraid of birds, especially if they are flying around her head.\n\nShe had a bad time as a kid when her younger brother pranked her at a beach. Her granddad had buried her in the sand, basically her just laying on her back with sand piled over her body but her head free. Her granddad rested on a towel beside her afterward and they both ended up falling asleep for a little bit. During their snooze her little brother crunched up a bag of crisps, (chips), and tipped them around her head. You can imagine the hellscape she woke up to when the skyrats descended. \n\nOn a happier note, mum trained me since I was steady enough to toddle to chase birds away from her, and that was my job on any outing/holiday. I was chasing away pigeons, gulls, ducks, anything that wasn’t in a cage/enclosure and within 15-20 feet of her. I have plenty of very fun memories, haha!",
            "score": 7,
            "author": "Zoehpaloozah",
            "replies": [
                {
                    "level": 1,
                    "comment": "How awful for your mom, I would be freaking out to this day, too. Little kids chasing birds is a universal thing and this was a win-win for you two.",
                    "score": 1,
                    "author": "ScowlyBrowSpinster"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Years ago, we had a ice cream / food stand near the beach. \n\nThe seagulls were relentless. People would be walking away with their lunch, and they’d swoop down and steal the entire sandwich. Of course, we would make them a new one and it was getting expensive!\n\nWe tried everything. Even if they made it back to their blanket with food intact, the seagulls would harass our customers the minute they tried to eat. It was a real problem. \n\nIn the end, we converted the parking lot into an outdoor seating area. We were able to hang sailcloth covers, which helped. It didn’t solve the problem completely, but it allowed us to remain open!",
            "score": 5,
            "author": "GoalieMom53",
            "replies": [
                {
                    "level": 1,
                    "comment": "The zoo finally made an indoor eating place and put nets over the outdoor areas. Not sure if this is still true, haven't been to the zoo in yonks.",
                    "score": 1,
                    "author": "ScowlyBrowSpinster",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "We don’t really have that problem at our zoo. \n\nBut, when my kid was little, we went to the zoo for his first birthday. He thought it was great fun to break off pieces of his lunch for the birds. It was all fun and games until the peacocks came!",
                            "score": 3,
                            "author": "GoalieMom53",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They can be aggressive!",
                                    "score": 3,
                                    "author": "ScowlyBrowSpinster",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "They’re so pretty. Who knew?!",
                                            "score": 4,
                                            "author": "GoalieMom53",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Just for fun look up the scary dinosaur bird cassowary. Not very pretty but the most lethal of birds and I bet they go in descending order of ability to kill a human starting with this one. Yikes!",
                                                    "score": 4,
                                                    "author": "ScowlyBrowSpinster",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Oh my gosh! I just did. They look like turkeys with a hat!",
                                                            "score": 2,
                                                            "author": "GoalieMom53",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "They are in Australia so I don't actively fear them.",
                                                                    "score": 1,
                                                                    "author": "ScowlyBrowSpinster"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "And LOUD, with enormous poops.  There's a neighborhood outside Los Angeles California where feral peacocks have lived for decades, or nearly 100 years ago, depending on your source.  Very loud, very messy.",
                                            "score": 3,
                                            "author": "Minflick",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Arcadia, yes? From what I gather, the city's founder brought some back from India. I also saw them in LA Cañada. Someone told me they get aggressive when they see their reflections in a hubcap or a car's painted surface and peck at it, can cause quite a bit of damage. \n\nThen there were the green parrots that got loose in the Pasadena area after a pet store fire during the 90s. Not as messy, but it was interesting to see and hear them.",
                                                    "score": 3,
                                                    "author": "Square_Activity8318",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "No, much closer in than Arcata.  Ranch Palos Verdes.\n\nParrots, on the other hand, have naturalized up and down the state.  There’s a big flock in Cupertino  that’s been there since at least the early 80’s, maybe earlier.  Also loud, but nothing like as dirty as the peacocks, which are HUGE compared to a parrot!",
                                                            "score": 3,
                                                            "author": "Minflick",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Not Arcata, Arcadia. The L.A. County Arboretum had tons of them, and they were everywhere in the city. They've even made the peafowl the city's official bird.",
                                                                    "score": 4,
                                                                    "author": "Square_Activity8318",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Arcata must be someplace else then.",
                                                                            "score": 3,
                                                                            "author": "Minflick",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Correct. It's way up north, close to Eureka.",
                                                                                    "score": 3,
                                                                                    "author": "Square_Activity8318",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I was in WeHo last weekend and a couple of parrots flew by, so squawky!",
                                                            "score": 1,
                                                            "author": "ScowlyBrowSpinster"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I would love to see them from a distance!",
                                                    "score": 2,
                                                    "author": "ScowlyBrowSpinster"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I have to ask, is the phrase \"in yonks\" intentional or autocorrect?\n\nSounds like it could be slang I'm unaware of.",
                            "score": 1,
                            "author": "ChaiHai",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Slang.",
                                    "score": 1,
                                    "author": "ScowlyBrowSpinster",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thank you! :D",
                                            "score": 1,
                                            "author": "ChaiHai"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt; The sun continued to shine...\n\n\nThe sun will always shine, the birds will always sing..",
            "score": 4,
            "author": "mordecai98"
        },
        {
            "level": 0,
            "comment": "My home town is on a coastline, so seagulls are a problem, even inland. Most outdoor restaurants have settled on a workable solution: they string a network of clear monofilament fishing line above the dining area, running at random angles and fairly close together. The gulls don’t see the lines as they swoop down for a snack and they collide with them. It doesn’t seriously hurt the gulls, but they don’t like it and quickly learn to stay away. Pity you can’t do that at the beach.",
            "score": 5,
            "author": "urbear",
            "replies": [
                {
                    "level": 1,
                    "comment": "If you had a restaurant, you could probably get cheap netting when the batting cages change out/replace their netting.",
                    "score": 2,
                    "author": "aquainst1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Maybe, but the point of the monofilament line is that it’s very thin and transparent. It’s almost invisible unless you look carefully, which a gull won’t be doing as it swoops down hoping for a French fry.",
                            "score": 3,
                            "author": "urbear",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "True, true.",
                                    "score": 2,
                                    "author": "aquainst1"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don’t know if you’re in the U.K. but it’s illegal to feed seagulls and most councils give £5000 fines for feeding them and I’ve had to have a go at so many city people in my seaside hometown for doing it because they would feed their cones to the seagulls outside our ice cream parlours when they were done so the seagulls would shit on our stuff, empty the bins onto the floor outside our shop and attack/shit on all the customers. Member of the council caught one city tourist and fined her.",
            "score": 10,
            "author": "Mushroomc0wz",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have enjoyed watching many a tourist being righteously shit on and persistently harassed after throwing food to the gulls, but the idea of one of them actually being fined a significant amount is filling me with a warm glow.\n\nIf I have to run the gull gauntlet every time I try to eat outdoors on the prom, at least I will now be able to picture the cause of this mayhem sobbing over a fixed penalty notice.",
                    "score": 11,
                    "author": "lilybottle"
                },
                {
                    "level": 1,
                    "comment": "Where have you heard that?",
                    "score": 3,
                    "author": "ot1smile",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I worked for the council + I’m a law student and it’s literally written all over the bins that it’s a £5000 fine in most places",
                            "score": 5,
                            "author": "Mushroomc0wz",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not where I live sadly (Ceredigion). They’re a pain in the arse.",
                                    "score": 3,
                                    "author": "ot1smile",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "In llandudno/Conwy thankfully it is, they should spread it across wales nationally",
                                            "score": 6,
                                            "author": "Mushroomc0wz"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I heard it from a friend who was in the same grocery store. He told me the story of how his friend tricked the surly idiot into feeding him a sandwich he didn't want. It was pretty creative and funny! He said it was the best revenge he ever witnessed!",
                            "score": 1,
                            "author": "mcgee2433"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "*The sun continued to shine, the water sparkled and we kept on enjoying our lovely day.*\n\nTHE END",
            "score": 3,
            "author": "ronhowie375"
        },
        {
            "level": 0,
            "comment": "I deal with the sand dolts differently. I start making a hole and all the sand ends up on them. I just say \"sorry, sorry, sorry, sorry\" and somehow the sand still ends up all over them. I'm not sure why that happens. They are at the beach after all.",
            "score": 3,
            "author": "_Oman"
        },
        {
            "level": 0,
            "comment": "I honestly would have loved you. A good chunk of why I hate the beach is the birds. You brought free bird control to the beach for me.",
            "score": 6,
            "author": "gothiclg"
        },
        {
            "level": 0,
            "comment": "That was a lovely ending.",
            "score": 5,
            "author": "Hankman66"
        },
        {
            "level": 0,
            "comment": "My young charge, haha",
            "score": 2,
            "author": "theons_missing_D"
        },
        {
            "level": 0,
            "comment": "Instant karma!",
            "score": 2,
            "author": "Alexis_J_M",
            "replies": [
                {
                    "level": 1,
                    "comment": "Gonna get ya!",
                    "score": 1,
                    "author": "ScowlyBrowSpinster"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Saw a seagull snatch an entire funnel cake once on a boardwalk.",
            "score": 2,
            "author": "weaselpoopcoffee1",
            "replies": [
                {
                    "level": 1,
                    "comment": "I believe you and at this point I expect to hear of a small child lifted and flown away soon.",
                    "score": 1,
                    "author": "ScowlyBrowSpinster"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I can't even imagine trying to feed seagulls, they are terrifying birds.\n\n On other hand I still remember one time when I was a kid. We were on some lake on boat, swimming past an island. It was a perfect place where we were - really shallow water where we got out of boat and walked. I was splashing around. And then we learned why such perfect place was deserted - island was nestling ground for gulls. They saw us and attacked. I think, we got out without blood, but on our way back we made sure to pass this island on good distance.",
            "score": 2,
            "author": "Milhent"
        },
        {
            "level": 0,
            "comment": "Flying rats! As an ex lobsterman who was shit on many times and can't get the shrieking out of my head, I definitely approve!",
            "score": 5,
            "author": "Commercialfishermann",
            "replies": [
                {
                    "level": 1,
                    "comment": "Mmmmmm lobster, thank you for your service!",
                    "score": 4,
                    "author": "ScowlyBrowSpinster"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Used to eat at a bayside restaurant in Sausalito called Zacks. The seagull were pretty vicious. My friend showed me a trick: he broke the end off a french fry, used a toothpick to hollow  it out, then filled the hole with black pepper, shoved the end back on reversed like a plug and threw it up to the gulls. once a gull starts to swallow it cannot NOT swallow.",
            "score": 6,
            "author": "Silknight",
            "replies": [
                {
                    "level": 1,
                    "comment": "This sounds like a tedious but clever petty revenge on obnoxious birds.",
                    "score": 2,
                    "author": "ScowlyBrowSpinster"
                }
            ]
        },
        {
            "level": 0,
            "comment": "SEAGULLS=RATS WITH WINGS",
            "score": 3,
            "author": "SunflowerSpeaks"
        },
        {
            "level": 0,
            "comment": "Just like pigeons they are flying rats.",
            "score": 3,
            "author": "Warm-Ad-2123"
        },
        {
            "level": 0,
            "comment": "Why, just why? That's how you get the fuck knocked out of you...",
            "score": 3,
            "author": "Negro-damas",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was so glad the darling children made it so fisticuffs did not have to solve the problem.",
                    "score": 7,
                    "author": "ScowlyBrowSpinster",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That was indeed the best part, but being from the hood, I've seen people get dealt with rather harshly for less\nMuch less.",
                            "score": 2,
                            "author": "Negro-damas",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yah the most galling thing was that there was so much SPACE. She coulda gone somewhere off by herself and fed the asshole birds and no one would have cared. Just for that part she deserved a few sharp slaps, whatever the neighborhood!\n\n The kids hadn't chased birds until this tempting, motley flock was gathered right in front of them and once they dispersed, the kids went back to whatever else they were playing and didn't chase them any more, so it was totally no harm, no fowl.",
                                    "score": 3,
                                    "author": "ScowlyBrowSpinster",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ah, I see what you did there! 😆",
                                            "score": 2,
                                            "author": "Negro-damas",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "![gif](emote|free_emotes_pack|sunglasses)",
                                                    "score": 1,
                                                    "author": "ScowlyBrowSpinster"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I live near one of the Great Lakes and love the seagulls. Hardy, beautiful birds that somehow manage to live among us filthy humans.",
            "score": 1,
            "author": "tennison_takes_time",
            "replies": [
                {
                    "level": 1,
                    "comment": "I like to watch them fly, too...waaaaaaaay over there.",
                    "score": 3,
                    "author": "ScowlyBrowSpinster",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "BTW, thank you SO much for reading so many comments and responding to them with a cheery quip!",
                            "score": 2,
                            "author": "aquainst1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Cheers, Darling!",
                                    "score": 1,
                                    "author": "ScowlyBrowSpinster"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Charges?",
            "score": 1,
            "author": "onion959",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's from old books with governesses like Jane Eyre.",
                    "score": 2,
                    "author": "ScowlyBrowSpinster",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What does it mean? Children?",
                            "score": 1,
                            "author": "onion959",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Someone you're looking after. You're charged with their care, so they are your charges. Bit archaic, but not unheard of in the UK.",
                                    "score": 6,
                                    "author": "HeadlinePickle",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I was thinking, archaic or anachronistic?",
                                            "score": 1,
                                            "author": "ScowlyBrowSpinster"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Yes, as in they are in one's charge, one is in charge of them. \n\nThree year old children in this case.",
                                    "score": 2,
                                    "author": "ScowlyBrowSpinster"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Awesome.. the kids were the MVP 😎",
            "score": 1,
            "author": "Fit_Marionberry_3008"
        },
        {
            "level": 0,
            "comment": "I disagree .  Th kids canNOT \"can do what they want\".  YOU are the one who was obnoxious. The birds are not be bothered to satisfy you and your little \"darlings\".",
            "score": -13,
            "author": "TexasYankee212",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh, but they can and they did.\n\nGood day!",
                    "score": 7,
                    "author": "ScowlyBrowSpinster",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So wonder you a spinster - no one would tolerate you and your sense of entitlement.",
                            "score": -13,
                            "author": "TexasYankee212",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ow ow ow! Such a burn!",
                                    "score": 3,
                                    "author": "ScowlyBrowSpinster"
                                },
                                {
                                    "level": 3,
                                    "comment": "Rude",
                                    "score": 2,
                                    "author": "CrazyBoysenberry1352"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yeah this kinda sounds like you both suck. Obviously don’t feed seagulls or sit annoyingly close to other people, but also don’t let the kids terrorize the poor birds and make it worse?\n\nI feel bad for the girls and the seagulls who were all just minding their business.",
            "score": -17,
            "author": "likeanaughtyavocado",
            "replies": [
                {
                    "level": 1,
                    "comment": "Whatever, the kids did nothing wrong, they didn’t actually *hurt* the gulls at all &amp; it’s a huge stretch to suggest they were “terrorised”",
                    "score": 7,
                    "author": "stanleysgirl77"
                },
                {
                    "level": 1,
                    "comment": "You know gulls fly, right? They can leave anytime.",
                    "score": 6,
                    "author": "AhFFSImTooOldForThis"
                },
                {
                    "level": 1,
                    "comment": "Totally agree with you. It's a certain type of person that applauds and encourages their children when they harass animals and birds- oddly enough, often they are the same type of person that has little regard for people trying to enjoy the beach.",
                    "score": -6,
                    "author": "tennison_takes_time"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You took your charges to the beach? Do you also take your paystubs to the beach?",
            "score": -2,
            "author": "Unihuman0420",
            "replies": [
                {
                    "level": 1,
                    "comment": "I only take the charges that get me mileage points.",
                    "score": 2,
                    "author": "ScowlyBrowSpinster"
                }
            ]
        }
    ]
}