{
    "id": "pfs7j0",
    "score": 26429,
    "title": "Mom won’t believe nsfw site was popup ad, son “shows” her it can happen to anyone.",
    "author": "lion_OBrian",
    "date": 1630496821.0,
    "url": "https://www.reddit.com/r/pettyrevenge/comments/pfs7j0",
    "media_urls": [],
    "other_urls": [],
    "postText": "Originally by u/Mister_AA\n\nWhen I was a kid my mom caught me looking at a porn site and I claimed it was a popup but she clearly didn't believe me. A few days later when she wasn't looking I pulled the same site up on her work laptop and hid it behind her browser window and pretended to catch her in the act when she closed her browser and the porn site showed up on her screen. She was flabbergasted and claimed it was a popup and I was all \"yeah right because that apparently doesn't happen\" and she apologized for not believing me before.\n\nI was fucking diabolical",
    "comments": [
        {
            "level": 0,
            "comment": "I thought my parents had caught me watching porn once, and then they told me what porn they had \"caught\" me with and I started laughing. It was clearly my younger brothers looking up things I would never watch. (Halo porn? Really?) I was able to easily convince them that no, I was not watching video game porn thank you very much. Of course, I was watching porn, but I knew how to hide it.",
            "score": 3474,
            "author": "FiendishCurry",
            "replies": [
                {
                    "level": 1,
                    "comment": "Similar situation happened to me when I was about 11 and my brother was 8 or so. They assumed it was me and confronted me about the search history (directly in the search bar) and I was nervous until I saw that the searches were all misspelled like “big buts” and my mom cried realizing my 8 year old brother had seen some wild shit",
                    "score": 1221,
                    "author": "OdensGirth",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Mom just flipped the mattress to find a couple playboys... ah the good ole days....",
                            "score": 315,
                            "author": "TrollOnFire",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I would stash Victoria's Secret catalogs and my mom would find them and throw them away. It was the only way I knew my mom was going through my stuff when I was at school, tbh. Jokes on her, I'm still into women 💁🏼‍♀️",
                                    "score": 271,
                                    "author": "petrichorgarden",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I had a picture of Alessandra Ambrosio in underwear as my computer background... Claimed I was using it for \"inspiration\". I wasn't entirely untruthful...",
                                            "score": 105,
                                            "author": "AK123089",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I had this [Weird Science movie poster](https://movieposters.ha.com/itm/movie-posters/science-fiction/weird-science-universal-1985-flat-folded-fine-very-fine-international-one-sheet-27-x-41-ss-science-fiction/a/161931-51507.s) on the back of my door for years, all mom ever saw was the housecoat hanging in front of it.",
                                                    "score": 44,
                                                    "author": "TrollOnFire",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt;housecoat\n\nWut?",
                                                            "score": 10,
                                                            "author": "zue3",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[Housecoat](https://thecozyshop.com/products/boys-denim-shark-robe?variant=40103459782845&amp;currency=CAD&amp;utm_medium=product_sync&amp;utm_source=google&amp;utm_content=sag_organic&amp;utm_campaign=sag_organic&amp;gclid=CjwKCAjwybyJBhBwEiwAvz4G78qJCrD4TSZ5tfZ0nNvssZ5SPLPvHpr-ljFmQXli-Mr5Dfzd7ceOPRoCxAUQAvD_BwE)\n\nAka bathrobe",
                                                                    "score": 11,
                                                                    "author": "TrollOnFire",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "When I was 14 I accidentally set our communal PC's wallpaper as Liv Tyler topless. Seeing as I was the only \"tech savvy\" one in the family it stayed that way until I next used the PC. No one ever brought it up thankfully.",
                                                    "score": 18,
                                                    "author": "grolut18"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Now, I wish I could guarantee the first type of porn my kids would see would be a Playboy. Compared to what kids can find today that is just tame.",
                                    "score": 53,
                                    "author": "BabySharkFinSoup",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "b i g     b u t s",
                            "score": 11,
                            "author": "bearbarebere"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Reminds me of the time someone googled \"Batman porn\" on my aunts tablet. My Aunt kept interrogating all my cousins trying to figure out who did it. We knew who did but we also know he did it so it would be seen and chaos would ensue.",
                    "score": 82,
                    "author": "DyleanCuisine",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "*joker laugh*",
                            "score": 34,
                            "author": "khemion",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; Hahaha, Batman! I've planted a Batman porn search on Commissioner Gordon's computer!\n\n&gt; You're one sick bastard, Joker.",
                                    "score": 16,
                                    "author": "Thunderstarer"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Oh man I used to put 5 or 6 nude pics on a 3 1/4 floppy, then take it apart and hide the plastic housing and the tape interior in diff spots. If either were found, no way mom could get it together again to look at it. Ridiculous.",
                    "score": 162,
                    "author": "ddesla2",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 45,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They didn't throw it to the trash?",
                                    "score": 22,
                                    "author": "eyalhs"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I think you mean 3.5 floppy.",
                            "score": 26,
                            "author": "AtariDump",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think both of y'all are too obsessed with size - a 1/4\" isn't gonna matter...\n\n\n^^^/s",
                                    "score": 36,
                                    "author": "this_isnt_happening",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Neither size matters if it’s floppy",
                                            "score": 31,
                                            "author": "nicdok",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Or 5 ¼?",
                                    "score": 4,
                                    "author": "DopeBoogie"
                                },
                                {
                                    "level": 3,
                                    "comment": "Cmon size doesn't matter, don't shame.",
                                    "score": 8,
                                    "author": "penisland_citizen"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "3 1/4\"? Must be like a hotdog down a hallway in the 3 1/2\" drive.",
                            "score": 6,
                            "author": "LordGopu"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Not all of us were so lucky, I had a burner and logged into my email to check on the tracking of a package I ordered, I forgot to log out of said email on my dads phone and he got a notification saying that there was a new device that logged in.... yep...",
                    "score": 214,
                    "author": "Ryan-821",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I would have said it wasn't me and we better change the password real quick. Someone must have hacked my Email!\n\nOr did it say your WLAN as source?",
                            "score": 36,
                            "author": "Dornenkraehe",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There was enough info to not have that work. And they would have done more than change the password, I would have been found out",
                                    "score": 5,
                                    "author": "Ryan-821"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Ugghhh this was the worst. Your siblings would type in the dumbest shit and not clear the cache. So then because you are the oldest you are responsible for all the weird booba.",
                    "score": 26,
                    "author": "MuthafuckinLemonLime"
                },
                {
                    "level": 1,
                    "comment": "I got \"caught\" by downloading a music video on limewire way back in the day. At the time when you'd start the download for a song and have to listen to it the next morning just to see if it's the song or that annoying Nixon speech.",
                    "score": 89,
                    "author": "ijustwanafap",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You needed to download lime wire pro from lime wire free. Lol, I thought to myself no way this will work. Yup, sure did. I loved seeing those blue holyshitthisisinsanefast downloads.",
                            "score": 55,
                            "author": "ddesla2",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "How did I never know about this trick??",
                                    "score": 12,
                                    "author": "Dansiman"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You mean the bill clinton speech?",
                            "score": 26,
                            "author": "CookedStew",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Haha, yeah, no adult would ever search halo porn, haha.\n\nI obviously search Cortana porn",
                    "score": 36,
                    "author": "JoelMahon",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Sounds like the time my mom found \"my\" porn-ridden internet history, when it was really my dad's. Or the other time, when it ended up being my younger sister's.",
                    "score": 7,
                    "author": "cATSup24"
                },
                {
                    "level": 1,
                    "comment": "Sooo...you gonna share a link to this Halo porn or...?",
                    "score": 12,
                    "author": "ImNotThatCSharp",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Master Queef!",
                            "score": 20,
                            "author": "infinitbullets"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Same, only problem i had no brother",
                    "score": 5,
                    "author": "onlyomaha"
                },
                {
                    "level": 1,
                    "comment": "A man of culture\n\nvideo game porn is so a year ago",
                    "score": 22,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Except overwatch. That remains suspiciously well made",
                            "score": 15,
                            "author": "lolman9999",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Yea flintstones and jetsons hentai is back babyyy",
                            "score": 22,
                            "author": "csl110"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 835,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "This reminds me of when I passed a note to a 'cool kid' in 3rd grade with a porn site. He got caught and told his mom it was me. However! I always wrote in curly script but at that point most of the other kids couldn't read it yet, so my notes were always in box letters. When I got called into the vice principals office he showed me the note and asked me if I had passed why i would do something like that. I said it couldn't have been me bc that wasn't my hand writing. He then made me write tons of individual letters to compare my hand writing but I kept the curly script going the whole time. I got away with it even though he definitely knew I was lying",
                    "score": 1100,
                    "author": "Mozeeon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "When I was in fifth grade, a kid named Patrick was selling Photoshopped naked pictures of Brittany Spears. I traded pretty much all of my Pokemon cards to him with the promise of a picture...The following day, he delivers. But I can't look because we're at school, so it gets folded and put in my pocket. \n\nAt recess, Patrick is playing and he has one of his pictures fall out. Teacher sees it, he gets taken to the principal. As we're sitting in class, he is led back to class crying and I watch as he points me and my friend Dustin out to our principal. But amazingly, she says nothing to us and takes him back to her office. \n\nI ask Mrs. Wesche if I can use the restroom and immediately hoof it downstairs. I flush the picture down the toilet without ever getting a good look at fake naked Brittany Spears.",
                            "score": 294,
                            "author": "expletiveinyourmilk",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Wild",
                                    "score": 36,
                                    "author": "joffreyjomers"
                                },
                                {
                                    "level": 3,
                                    "comment": "Porn is temporary\n\nPokemon is forever\n\nYour lust resulted in your ruin.",
                                    "score": 40,
                                    "author": "ShadyFigureWithClock",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Tell me about it! \n\nI was \"over\" my Pokemon phase at this point. I was never a huge fan. I just like collecting cards and playing the game, but after 3rd grade my passion ended. \n\nAnother awful story is that Christmas 1999, my dad bought me a holographic Charizard that was being sold in an antique/pawn shop in our town. I can't tell you what edition it was, but I can tell you that he bought it for $150.\n\nFor the life of me, I cannot tell you where that card is today. Thrown away by careless 9 year old me. Or traded for fake nudes.",
                                            "score": 17,
                                            "author": "expletiveinyourmilk",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "When I was in elementary school my classmates told me [Playboy.com](https://Playboy.com) is a great website for free games to play.",
                            "score": 339,
                            "author": "Soysaucetime",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "When I was in elementary school we didn't have the internet, and we had to sneak dad's actual Playboys. Yall have it easy.",
                                    "score": 287,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "There was always a stash in the woods by the creek. The 90s were weird.",
                                            "score": 169,
                                            "author": "Mortara",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Was gonna say, for those of us without dads, there was always the stash in the woods.\n\nWhy? And who? And why? No one knows. But it seems to have been pretty universal. The stash of porno in the woods.\n\nAlso, why??",
                                                    "score": 140,
                                                    "author": "eastbayweird",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Forest porn we called it, probably has a much more sick meaning today...",
                                                            "score": 63,
                                                            "author": "No-Statement-3019",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Nah, I bet it's more wholesome.  Probably refers to, like, beautiful photos of lush forrests.    \n\n\nSo... 70's porn.",
                                                                    "score": 48,
                                                                    "author": "VivaSpiderJerusalem",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Lush bushes you mean right.",
                                                                            "score": 19,
                                                                            "author": "jgpitre",
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "My uncle used to put his old playboys in a tree in our woods. I wonder if they are still there, or being used. Everyone knew where they were. Oh the memories.",
                                                                            "score": 6,
                                                                            "author": "Environmental-Emu242"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt;!you're raiding a homeless guy's porn stash.!&lt;",
                                                            "score": 24,
                                                            "author": "butrejp"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I’m a girl and when I was like 9 I found a bunch of playboys in a log in the woods. Don’t know who put them there, didn’t know why at the time, but now as an adult I’m glad that someone was looking out for the teenage boys out there",
                                                            "score": 70,
                                                            "author": "ToneDeafPlantChef"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Every one knows it is the fruit of the porn tree",
                                                            "score": 41,
                                                            "author": "NoAdmittanceX"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "90's you say? I distinctly remember it in the 80's...",
                                                    "score": 12,
                                                    "author": "real_p3king",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I found some as a kid in the 70's...",
                                                            "score": 8,
                                                            "author": "Charyou_Tree_19",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Sixties scrounger here. I'll never forget the wonderful surprise I found in the middle of a pile of old magazines and newspapers I was collecting for our Boy Scout recycling drive. I treasured that one precious copy at least a couple of years. Among other educational benefits, it taught me all about tan lines. Hadn't known they were even a thing!",
                                                                    "score": 18,
                                                                    "author": "Al_Bondigass"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "So does that mean we’re a multi-generational line of woodland based deviants?",
                                                                    "score": 16,
                                                                    "author": "Mortara",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I remember giving the guy at 7-11 a $20 to buy a Playboy when I was like 13. That issue happened to have Carmen Electra in it. Definitely got my money’s worth.",
                                            "score": 10,
                                            "author": "Maxtickle"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Back in elementary school we didn't have magazines so we had to fuck our actual dads. Yall have it easy.",
                                            "score": 64,
                                            "author": "DMugre",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Back in elementary school lots of us didn't have dad's so my neighbours dad stepped up and fucked some of us for free.\n\nWe did have it easy.",
                                                    "score": 35,
                                                    "author": "iusuallypostwhileipo",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Back in elementary school a bunch of us kids didn't have neighbors, so we had to fuck each other. Y'all have it easy.",
                                                            "score": 18,
                                                            "author": "Dansiman",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Back in elementary school in the caveman days we didn’t have neighbors so we had to fuck ourselves. Y’all have it easy.",
                                                                    "score": 12,
                                                                    "author": "Good_Ad6723",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Back in the late heavy bombardment era (3.8 billion years ago) we didn’t exist so we couldn’t fuck our selfs y’all have it easy",
                                                                            "score": 13,
                                                                            "author": "Ghost_lad4730",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I convinced a woman I worked with xhamster was a website about hamsters (she was mad on hamsters)",
                                    "score": 34,
                                    "author": "andyc8383",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "lol this reminds me of the time I was at my neighbors house in 3rd grade and he had to do a report about an animal of his choice, and he chose the Fox.  His first instinct was to google \"Foxes\" and he said \"Oh, [Foxes.com](https://Foxes.com) that sounds like a good place for Fox facts.\"\n\n&amp;#x200B;\n\nIt was not a good place for fox facts.  We still enjoyed the website though, it was pretty cool.",
                                    "score": 22,
                                    "author": "Flxpadelphia"
                                },
                                {
                                    "level": 3,
                                    "comment": "I was walking home with a friend after school when he told me how disgusting our classmate was. The classmate had, when asked what he was doing after school, responded \"I'm going to go on redtube\". When asked what it was \"It's like youtube, but more extreme\". My friend then told me how he thought it was like extreme sports and had showed this new site to his parents without checking it out first. That is why the classmate was disgusting. Then I went home and learnt a thing or two about myself..",
                                    "score": 16,
                                    "author": "studsper"
                                },
                                {
                                    "level": 3,
                                    "comment": "My friend told me the same thing. So I looked it up on his family computer at his house and he got whooped for it lmao",
                                    "score": 16,
                                    "author": "Kalinsub"
                                },
                                {
                                    "level": 3,
                                    "comment": "Lmao when I was in 6th grade some 8th grader told me that if i liked traditional japanese art, I'd love hentai 😭😭😭",
                                    "score": 14,
                                    "author": "g_ayy",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "In high school, it was all about WhiteHouse.com",
                                    "score": 22,
                                    "author": "Stubbedtoe18",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Personally I always linked people to goatse.cx.",
                                            "score": 6,
                                            "author": "johntdowney"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Aah yes, the pornsite bait trick.",
                                    "score": 3,
                                    "author": "BeardPhile"
                                },
                                {
                                    "level": 3,
                                    "comment": "Whitehouse.com was the site to trick people with in my days. It appears to be clean now, but used to be a porn site.",
                                    "score": 5,
                                    "author": "I_will_be_wealthy"
                                },
                                {
                                    "level": 3,
                                    "comment": "\"Can you go to whitehouse.com for me? I have a report on it and want to check something quick\" was the one I got hit with.",
                                    "score": 3,
                                    "author": "AllStoriesAreTrue"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You were pretty smart in elementary school. I once slapped a kid across the face in probably 7th grade during second period. I wasn’t sent to the principals office until like 6th period but by then I forgot what I did, I only remember that I did something bad. I got questioned probably 15 times to confess what I did and all I could say was “I definitely did something bad to him, I just can’t remember anymore.” Eventually the principal told me and I said “yup, that was it.”",
                            "score": 21,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "Maybe the part where he made you write tons of letters was the punishment all along?",
                            "score": 5,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 285,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh yeah babe, I'm hiding a secret. I'm into... um...  have you seen Bob The Builder?  Think that but with...  Boobs!",
                            "score": 151,
                            "author": "occasionalrayne",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Rule 34",
                                    "score": 61,
                                    "author": "Cusslerfan",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Don't just say it, show it...   [NSFW](https://rule34.xxx/index.php?page=post&amp;s=list&amp;tags=bob_the_builder)",
                                            "score": 9,
                                            "author": "cyboii"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Sauce?... For *scientific* purposes",
                                            "score": 13,
                                            "author": "unkn0wn9900",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "If I thought my SO was looking up Bob the Builder porn I would probably be concerned.",
                            "score": 66,
                            "author": "cheesefromagequeso",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, what kind of selfish SO doesn't share that shit with their partner the minute the find it? I'd definitely be concerned too!",
                                    "score": 35,
                                    "author": "AbsentK"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Porns fine.\n\nBob the builder porn, well that would raise some questions.",
                            "score": 37,
                            "author": "benmck90",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Can we f\\*x it? Yes we can!",
                                    "score": 29,
                                    "author": "Monsi_ggnore",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I was with a partner that watched some really weird shit, would avoid coming to bed to watch stuff and would sometimes watch it (on silent) in the same room as me. Was just weird and shady af. \n\nSometimes porn can strain relationships.",
                            "score": 64,
                            "author": "soaringsquidshit",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": " Normally so, but some folks do have addiction or similar issues with it.",
                            "score": 5,
                            "author": "mandym347"
                        },
                        {
                            "level": 2,
                            "comment": "Seriously. I thought questionable meant legally questionable... Not Bob the Builder related.",
                            "score": 3,
                            "author": "HighMont"
                        },
                        {
                            "level": 2,
                            "comment": "Gotta love the reddit analysts that can judge someone’s relationship based on a third party story.",
                            "score": 10,
                            "author": "mattfow232",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "If your in a marriage and you both decide porn isnt acceptable in the relationship, then its perfectly reasonable to be upset.",
                            "score": 19,
                            "author": "Recycleyourtrash",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "That’s what I was thinking.\n\nYou’re an adult in trouble with your wife for watching porn? \n\nWhat is she your mom?",
                            "score": 48,
                            "author": "cookiesforwookies69",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Some people (esp religious) are super anti porn and consider it cheating\n\nI am not one of them but they exist",
                                    "score": 37,
                                    "author": "GothWitchOfBrooklyn"
                                },
                                {
                                    "level": 3,
                                    "comment": "It does say \"really questionable porn\", so the issue was likely with the specific variety than porn in general",
                                    "score": 15,
                                    "author": "SpaceAgePotatoCakes"
                                },
                                {
                                    "level": 3,
                                    "comment": "Youd be surprised. Some men cant handle recreational consumption of porn and literally get so addicted they cant perform in bed. If my guy was anything like this, I would just leave his ass. Lol. Porn is fine. Porn addiction is creepy.",
                                    "score": 5,
                                    "author": "christinebrennan1990",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 34,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "When I was just in 6th grade, back when computers and consumer internet and AOL all first became popular, my uncle - who was living with me and my mom at the time - decided he wanted more computer time to himself because I spent a few hours a week playing Sim City and Roller Coaster Tycoon. \n\nSo while I’m sitting in the computer seat, using the computer, Uncle says “hey can I see the mouse really quick?” And I consented. He pulled up Google, and single-clicked the search bar to reveal just TONS of porn searches in the search history. Tons. Like 3 dozen or more. And then he said “oooh you’re in trouble. I’m telling.”\n\nIt wasn’t me. I got off to late night Girls Gone Wild commercials on Comedy Central. This POS planted a ton of porn searches in the browser so my mom would punish me, allowing Uncle more computer time. \n\nI’ll never forget that.",
            "score": 647,
            "author": "DragonFive",
            "replies": [
                {
                    "level": 1,
                    "comment": "bruh it’s genius but also an asshole move",
                    "score": 259,
                    "author": "NuttyDuckyYT",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "And at what point have you since called him out on this scumbaggery?",
                    "score": 88,
                    "author": "Goofyal57",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I mean… almost 20 years have passed since then. I would hope any person in my situation would have dropped the grudge by now. :)",
                            "score": 43,
                            "author": "DragonFive",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Man, no offense but you gotta learn how to hold a grudge. \n\nFor the rest of that uncle's life he should be fearing donuts and pastries filled with mustard, socks turned inside out so you always have to take an extra second to put them on properly, notes on the bed saying \"Don't smell the pillow.\" when nothing was actually done to it, ketchup bottle and hair behind the car tire so it looks and feels like you backed over a rat, etc.",
                                    "score": 144,
                                    "author": "KAODEATH",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I’m definitely borrowing these strategies!",
                                            "score": 33,
                                            "author": "DragonFive",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Couldn't be happier to hear the lessons passed down from my grandpapi, spread! April Fool's day is a time of fasting and fear for my family, especially when there's a box of fourty timbits innocently sitting on the counter.",
                                                    "score": 13,
                                                    "author": "KAODEATH"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt;donuts and pastries filled with mustard,\n\nFor a minute I didn't know what was wrong with this lol\n\nI was like \"oh, Americans eat mustard\"",
                                            "score": 4,
                                            "author": "Novalcia",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Nahh, I'm petty. I'd hold it against him in jest for the rest of our lives",
                                    "score": 7,
                                    "author": "Goofyal57"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "What a POS",
                    "score": 111,
                    "author": "DeadSpark75",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Piece of shit",
                            "score": 19,
                            "author": "kaleb42",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Person of size?",
                            "score": 14,
                            "author": "shuhorned",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 10,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Damn that’s cold.",
                    "score": 11,
                    "author": "Ixosis"
                },
                {
                    "level": 1,
                    "comment": "Hahahahah how old was your uncle?",
                    "score": 9,
                    "author": "Curiousbeing639",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think he was like 56 or so at the time. And I do recall the reason he wanted to be on the computer all the time was to find a new partner.",
                            "score": 14,
                            "author": "DragonFive"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "If you were thinking, you would’ve taken some questionable pics of yourself and planted them on your uncle after he got into a serious relationship",
                    "score": 26,
                    "author": "boss_nooch",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Seems a little excessive. I was grounded for a few weeks. Not sent to federal prison.",
                            "score": 19,
                            "author": "DragonFive",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You should have burned his house down, salted his crop fields, and murdered his first born child.",
                                    "score": 33,
                                    "author": "SickleWings"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I did something similar when I was in like grade 7.\n\nI knew mom had accidentally opened some kind of celeb porn pop up and it was a small scene but my mind registered it as an opportunity. \n\nWe had dial-up and mom wouldn't let me have the password, so I checked the save password box before she logged me in once and then hit up all the celebrity nude sites I could find while they were gone out. Unfortunately dial-up as it is ties up the phone and they couldn't get through for like two hours and came home early and caught me using the net; however they didn't catch me on the porn and even though they checked the history, the nature of the sites lined up with moms accident so I got off the hook for all the boobies a 28.8/kb connection could give me.",
            "score": 160,
            "author": "jb_82",
            "replies": [
                {
                    "level": 1,
                    "comment": "Was even worse on the 14.4 I had when I was younger.",
                    "score": 28,
                    "author": "iwannagohome49",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "9600 baud. Do I hear 9600 baud? Anyone here surf the web for porn on 9600 baud?",
                            "score": 14,
                            "author": "AtariDump",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I was on 2400 to start.  Glacially slow.",
                                    "score": 11,
                                    "author": "blueisbest",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I know what 2400 baud boobs look like:\n\n(.) (.)",
                                            "score": 15,
                                            "author": "AtariDump",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Sigh\n\n/unzips",
                                                    "score": 11,
                                                    "author": "blueisbest"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I remember 2400. My parents say they experienced 300.",
                                            "score": 6,
                                            "author": "Murgatroyd314"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was at my uncle's time share cabin once, there was a computer in the rec room, and I think I looked up Lindsay Lohan naked or something because it was the early 2000s.\n\nMy uncle came down and went to type something into Google, and it autofilled \"Lindsay Lohan Naked\" \n\nHe's all like, \"Woah who's looking this stuff up?\" \n\nI just played dumb and said it wasn't me, my brother said the same thing. \n\nHis son, my cousin, who was 6 at the time, was not suspected of doing anything like that, but months later, when he was in kindergarten, the school caught him teaching other kids to look up porn. At 6 years old. \n\nEven though I was actually guilty, my name was cleared. they went into the history on that time-share computer, their home computer, and their iPad and found TONS of porn searches that were not mine.",
            "score": 106,
            "author": "mbod",
            "replies": [
                {
                    "level": 1,
                    "comment": "At six??? That kid is fucking insane. You should probably teach him about incognito soon.",
                    "score": 39,
                    "author": "JuniorAd389",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He's 20 now lol, but he had some talkings back in the day, and restrictions with computers and stuff",
                            "score": 25,
                            "author": "mbod"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thought it was the title of a Dhar Mann video for a second",
            "score": 311,
            "author": "HecticCheese007",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hey Dhar Mann fans, I'm super excited about this video of a painfully made-up story portrayed by the same handful of shitty actors I put in all my videos.",
                    "score": 103,
                    "author": "MeEvilBob",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I HOPE YOU ENJOYED THAT MEASSAAGE",
                            "score": 36,
                            "author": "kowaterboy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "So you see...",
                                    "score": 15,
                                    "author": "chasemenows"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "What happens will shock you",
                    "score": 30,
                    "author": "Otherwise-Carrot-479",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So you see",
                            "score": 23,
                            "author": "bigdisappointment_",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This isn’t really related but this reminds me of when I was around 12 years old, my mom would always get mad at me for staying up late playing games (like 3-4am) so I would change the time on her phone and the wall clock just in case she’d catch me if she woke up to use the toilet or something she would always check if I was still awake",
            "score": 740,
            "author": "tarolovergirl",
            "replies": [
                {
                    "level": 1,
                    "comment": "hah that reminds me when my mom was strict on me when she wanted me to play the piano. back in the day when we recorded cassette tapes, I made a pre-recording of me playing piano and then replayed it on the speakers when I want to take a break and play video games so she can hear it from upstairs. She caught me but we laugh about it to this day",
                    "score": 391,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "In today's world that's equivalent to recording a video of yourself at your desk and using that as your zoom profile picture.",
                            "score": 159,
                            "author": "DarthEdinburgh"
                        },
                        {
                            "level": 2,
                            "comment": "Must be nice. I would stay up late playing piano fighting my demons (tried to kill myself at one point) and my dad would get pissed at me for not doing homework or staying up late playing piano so he took the power cord from my keyboard and wouldn’t give it back until I got my grades up. I stole it back anyways",
                            "score": 51,
                            "author": "I_NEED_APP_IDEAS",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "you're obviously more into piano than me. Im not. get yourself a set. If you live near me, i'd give you what I used when I was a kid. rather have it being used than collecting dust",
                                    "score": 22,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I don’t practice anymore. School, work, hobbies, relationships, and a kid have taken up my emotional resources and time to be able to practice. But I appreciate the offer though.",
                                            "score": 13,
                                            "author": "I_NEED_APP_IDEAS"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I wish I had a keyboard I could jam on by myself. I spent many hours at my piano working out my problems. It’s gotten a lot harder to do that these days because my kids are young and don’t want to share the piano. Lol.",
                                    "score": 19,
                                    "author": "Kalaydascope16",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Then buy yourself a keyboard dude! That doesn’t seem like a waste of money to me. Surely there are some decent cheaper ones. Life is too short",
                                            "score": 20,
                                            "author": "StavromularBeta"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That’s dedication",
                    "score": 89,
                    "author": "Picklez141"
                },
                {
                    "level": 1,
                    "comment": "Something similar happened to a friend. Back in the day there was no Spotify just shady share programs like limewire. Friend was downloading what he thought was music. Opens it as his mom was there and it wound up being porn.",
                    "score": 36,
                    "author": "Vandella59",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "At one point  with Limewire, regardless of what I typed, the search would always include one file that said \"wet and wild\" . There was an obscure song I was trying to find online from an AMV, so I remember the search results \"Brian abbey Wet and wild!\"....\"Team industry Wet and Wild!\"....Eventually found the song, don't remember how. lol",
                            "score": 21,
                            "author": "Velius13"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I \"caught\" my elementary schooler several times as she had to borrow my phone to take pictures of the cats and while being at it changing her allowed time on the parenting app.\n\nI have yet to bring it up to her.",
                    "score": 23,
                    "author": "DefinitelyNotACad",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I tried that when I was ten or so after my sister told me it was foolproof. Turns out it's only foolproof when your sister doesn't rat you out",
                    "score": 20,
                    "author": "legendofthegreendude",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I got in trouble for staying up late reading.. I had a bed lamp that still used the incandescent bulbs, so even when I was quick and heard her coming, my mom would feel the warm light and scold me lol.",
                    "score": 9,
                    "author": "domdanial",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Dude, my mom was the same way, but with the tv. The warmth would tell her that I HAD been using it.",
                            "score": 4,
                            "author": "ihateletterG"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I caught my 14 year old son (2002 or so) and he just turned off tower when I came in the room..\" It froze up\" ..later my husband and I discovered he did a search on \"boobies\" ..not \"Tits\"...Boobies!  We still tease him about it...",
            "score": 45,
            "author": "thisisDougsPhone67",
            "replies": [
                {
                    "level": 1,
                    "comment": "Those were the good ol' days when searching \"boobies\" gave you something to work with!",
                    "score": 28,
                    "author": "KAODEATH",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 35,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Based on your poor grammar, I'm not surprised.",
                    "score": 7,
                    "author": "Fangs_McWolf",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Some of us choose to only use grammar when we fucking want to. Dipshit.",
                            "score": 3,
                            "author": "Azukus",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;Some of us choose to only use grammar when we fucking want to.  \n&gt;  \n&gt;\\- Dipshit.\n\nI fixed your signature for you, Mr. Dipshit.",
                                    "score": 7,
                                    "author": "Fangs_McWolf",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I installed a keylogger on my dads PC to steal his credit card info so I could get a WoW subscription. I think you're good.",
            "score": 38,
            "author": "zublits",
            "replies": [
                {
                    "level": 1,
                    "comment": "I installed a key logger on the family computer because my mom suspected my sister of going places other than what she was telling her. \n\n\nFound a whole lot of dad cheating on mom instead.",
                    "score": 42,
                    "author": "ServiceB4Self",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "One does not know how to properly respond to that",
                            "score": 8,
                            "author": "JuniorAd389",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Tell me about it...",
                                    "score": 11,
                                    "author": "ServiceB4Self",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You were lucky you didn't get her fired",
            "score": 84,
            "author": "Momps",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sounds like it was probably a while ago, when work laptops generally were not monitored by IT.",
                    "score": 46,
                    "author": "evenstevens280",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Dude this is fucked but when I was in 6th grade I got my first phone I think it was 2008 anyway my world history teacher was showing us rap around the world as a way to get us excited about the class. So when I went home I searched \"Japanese rape\" because I forgot if it needed an e cuz I was stupid. Anyway that's how I found porn at like 10 kind of fucked. Also just want to say I'm 98% sure it wasn't actually rape just those jav vids were the Japanese girls  make some crazy noises.",
            "score": 17,
            "author": "CedrikR"
        },
        {
            "level": 0,
            "comment": "As a kid I did once get a popup like that, still not sure how it happened lol",
            "score": 51,
            "author": "natman8",
            "replies": [
                {
                    "level": 1,
                    "comment": "when I was a kid we used to pirate all of our games and software by googling shit like \"warez\", \"serials\" or the name of the software on kazaa with keygens and stuff. We got so much bad stuff on that computer lol, the one I remember the most was some toolbar that added a porn banner on every single webpage you visited. We thankfully were able to get rid of it before the parents got back home, but that pc was all shades of fucked up lol.",
                    "score": 49,
                    "author": "Jellyka",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Kazaa what a fucking meme that was, never know if that music you downloaded was the actual music or Russian covers.  Or a movie that was actually a guy getting railed by a horse",
                            "score": 11,
                            "author": "IrishBear",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I actually discovered a few bands from misnamed and extra stuff that came up in my searches",
                                    "score": 7,
                                    "author": "z500"
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt;  Or a movie that was actually a guy getting railed by a horse\n\nalways had to check the file extension, cause movies would be different. had to make sure you weren't downloading song.mp3.exe and get a virus",
                                    "score": 7,
                                    "author": "t3hd0n"
                                },
                                {
                                    "level": 3,
                                    "comment": "I remember when I gave the computer aids via lime wire. As well as cascading porn pop ups, it once started blaring a weather report for a completely different city at 1am.",
                                    "score": 3,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Me too, i was trying to watch Avatar on a streaming site and the popup appeared on my aunt’s computer, it was so embarrassing.",
                    "score": 14,
                    "author": "lion_OBrian"
                }
            ]
        },
        {
            "level": 0,
            "comment": "“I wasn’t looking for it, internet blessed me with this ad, so I must jerk, mom”",
            "score": 12,
            "author": "sarcasm4u"
        },
        {
            "level": 0,
            "comment": "Parents and their obsession with the porn their children are watching will never cease to amaze me",
            "score": 60,
            "author": "Bertje87",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Y-you little shit! \n\nThis story made me laugh super hard. Did you fess your to your mom years later? I hope you let her in on the secret.",
            "score": 8,
            "author": "dadudemon"
        },
        {
            "level": 0,
            "comment": "She probably has malware now. Way to go!",
            "score": 19,
            "author": "Phil_Tact"
        },
        {
            "level": 0,
            "comment": "You evil genius! Haha",
            "score": 52,
            "author": "Prestigious_Jello_18"
        },
        {
            "level": 0,
            "comment": "Back in the kazaa days my mom found some nudes which I claimed must have been piggybacked in a music album folder, so a few times thereafter when she was downloading music, I downloaded sone porn and stuck it in the folder before she could see. She was totally convinced.",
            "score": 8,
            "author": "thissayssomething"
        },
        {
            "level": 0,
            "comment": "I'm a mother.. my kids won't get away with anything on the internet like I did.",
            "score": 118,
            "author": "xithbaby",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am a dad and work in IT. Don't be too harsh on them. Porn is not the issue. What happens in group chats worries me more (understand bullying and other nasty behaviours )\n\nEach kid is different too. Mine have very different uses of the net and I watch for different potential problems. They won't trick me as easily as OP though.",
                    "score": 214,
                    "author": "merlinou",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm a dad and used to work in IT, briefly.\n\nGrowing up, my good friend had a computer in his room (very rare at the time) but his dad was an engineer and set up a relatively sophisticated (again, at the time) LAN where he monitored my friend's computer and blocked access to the internet. My friend works in IT today.\n\nAbout half of everything we learned about networks and security, we learned circumventing that dad's systems. It was a cat and mouse game for a solid 3 years - he blacklisted the MAC address of the computer during certain hours, we learned how to spoof it; he instead whitelisted the MAC address of his computers, we learned how to hack into the rudimentary admin panel of the router; he installed various filtering services, we learned how to use proxies; he tried to lock down the OS user account, we started using bootable Linux CDs. As kids, all we had was time and the desire to see boobies. The dad stood no chance.\n\nI'm not sure I can replicate that kind of learning for my kids (they're still way too young anyway), but looking back I wonder if my friend's dad was actually playing us the whole time. You couldn't convince a couple of kids that learning all that stuff would be fun, but by making it a challenge he used our contrarian teenagerness to trick us into learning a career basically.",
                            "score": 178,
                            "author": "oneMadRssn",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The secret to being old and wise is making everyone think you did shit like this out of profound foresight.",
                                    "score": 81,
                                    "author": "KINKY_MINDFUCKERY"
                                },
                                {
                                    "level": 3,
                                    "comment": "My father got me to set up the new wifi when we upgraded to a fibre connection. Got like 10 bucks for it and could manage my MAC adresses to get higher priority in the network.",
                                    "score": 27,
                                    "author": "mrBEAN6"
                                },
                                {
                                    "level": 3,
                                    "comment": "I love this story.",
                                    "score": 3,
                                    "author": "Bridgewater750"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "That is really my issue as well. My daughter falling prey to some sicko in an online chat room. I already have rules against her talking in games like Among us and Roblox, she is not allowed to use in game chat, period.\n\nMy parents allowed me unlimited access to chat rooms when they were in infancy stages on IRC and crap. So much of my life may have been different had they just told me to go back outside and play. I won't let that get my daughter either. There were sickos back in the early 90s as well. Ugh. The show to catch a predator also rings in my ears.",
                            "score": 47,
                            "author": "xithbaby",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "As a fellow parent, I can understand your hesitation towards chat. I'm the same way with my daughter and Roblox, but Among Us is different.\n\nAmong Us is a chat based game. If voice isn't an option, then it has to be text. It's absolutely critical to the enjoyment and premise of the game. If your daughter is playing it regularly, then she's having to use chat in some capacity.",
                                    "score": 58,
                                    "author": "Thatsignguy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Well, among us now has an option where you can give info by clicking through some menus, instead of typing in chat",
                                            "score": 12,
                                            "author": "-__-x",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "As someone who plays, it's garbage and borderline unusable if you want to actually have a fun time",
                                                    "score": 15,
                                                    "author": "WitchNextDoor",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "She doesn't complain and still enjoys it so I don't know. She's 7, so I feel banning chat is perfectly okay right now",
                                            "score": 13,
                                            "author": "xithbaby"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Oh, she will start using in game chats anyways. Don't ban using some things, teach them how to use them. Especially if they're gonna encounter a lot of it in the future (and internet chats aren't going to die out, really).\n\nBy the games I judge that your daughter is quite young (~10), and I can tell you that 1) the probability of encountering a weirdo on these games is veeeery low; 2) among us is basically based around game chat and you can't get away with not using it. I'm pretty sure that she uses the chat anyways, just hides it or something.",
                                    "score": 97,
                                    "author": "Niewinnny",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I agree with this. I don't have kids and I honestly don't know how I would handle internet access, but it would be a priority. Simply because I would be unable to stop it one way or another.\n\nSo far my philosophy is tell them why not to, instead of just not.",
                                            "score": 27,
                                            "author": "Blasterbot"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Dont restrict her acess to the internet, its there to be used for whatever you are curious about. She can use the internet to learn something you can never teach her. However you can guide her and tell her about what do's and dont's. Controlling her acess is just you being overprotective and it will eventually bite you in the ass later. Of course controlling the internet is okay for her current age, but when she is getting older around 14 years old, its not good to be so overprotective. Just saying",
                                    "score": 41,
                                    "author": "Forvirret-kal"
                                },
                                {
                                    "level": 3,
                                    "comment": "Dude, I’m 27, and I come across little kids talking on their mic all the time on games like Apex legends and to be honest I just laugh at their perception of the world and I never really say anything mean or anything besides game-talk to them\n\n Point being, regardless of banning chat for now which is probably smart, or I don’t really know it depends on her age, but teach her to just never tell strangers certain information and things like that for when she’s older.",
                                    "score": 8,
                                    "author": "Aegi",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Among Us is a game focused around the chat. Youre telling her to not play the game.\n\nIf my parents were like this while I was growing up in the 90s, I'd have absolutely loathed them. And communication online wasn't half as important then.\n\nRules like these don't stop children from participating in online chat. They just teach children to do it secretly, and then if something happens they won't tell you.",
                                    "score": 33,
                                    "author": "madmilton49",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Well said, better to teach kids what to watch out for and have a relationship where they can talk to you about any of their concerns.",
                                            "score": 21,
                                            "author": "MattMakesPhotos"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Sorry to break it to you but she's going to be using chat anyway because that's how kids work and a lot of games require it to actually have a good time this isn't the 90's anymore. And now that she's doing that, you've taught her that if anything inappropriate or scary happens to her over this feature you are the last person she should come to tell about because going to you = instant trouble when she can simply keep it a secret. Not saying anything bad will happen but you are setting up some very precarious learning blocks.",
                                    "score": 16,
                                    "author": "PinkAxolotl85"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Another IT Dad here. When my kids were little, I ran everything through a proxy to monitor what they were doing online. Once they were in their teenage years, I shut that down. In some ways, ignorance is bliss, and you have to trust that you raised level headed kids at some point. Teens need a little privacy now and again.",
                    "score": 23,
                    "author": "ZombieFeynman11211"
                },
                {
                    "level": 1,
                    "comment": "until the internet become even more complicated",
                    "score": 21,
                    "author": "Culteredpman25",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "nooo",
                            "score": 12,
                            "author": "xithbaby"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lol, that's not revenge, that's just covering your ass. Well played!",
            "score": 4,
            "author": "heynonnynonnomous"
        },
        {
            "level": 0,
            "comment": "&gt;When I was a kid my mom caught me looking at a porn site and I claimed it was a popup \n\nBut was it really a popup? 😉",
            "score": 3,
            "author": "Fangs_McWolf"
        },
        {
            "level": 0,
            "comment": "I'm confused. You were getting revenge against your mother for being lied to by you? How is this revenge?",
            "score": 15,
            "author": "IndyAndyJones7",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I mean, there's no way you would've known better because you were just a kid, but that could have easily gone very badly. People get fired for visiting porn sites on their work computer.",
            "score": 9,
            "author": "[deleted]"
        }
    ]
}