{
    "id": "13wm7ye",
    "score": 1275,
    "title": "Rubbish collection in Switzerland",
    "author": "KYC03D",
    "date": 1685539416.0,
    "url": "https://www.reddit.com/r/interestingasfuck/comments/13wm7ye",
    "media_urls": [
        "https://v.redd.it/47e6fkhg463b1"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\n**This is a heavily moderated subreddit. Please note these rules + sidebar or get banned:**\n\n\n* If this post declares something as a fact, then proof is required\n* The title must be fully descriptive\n* No text is allowed on images/gifs/videos\n* Common/recent reposts are not allowed (posts from another subreddit do not count as a 'repost'. Provide link if reporting)\n\n*See [this post](https://redd.it/ij26vk) for a more detailed rule list*\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/interestingasfuck) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "That rubbish juice tho. 🤢",
            "score": 237,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Got that drip drip 😩👑",
                    "score": 41,
                    "author": "PartyFarStar"
                },
                {
                    "level": 1,
                    "comment": "Just judging by the smell I think it was rainwater runoff. Not appetising but better than garbage juice",
                    "score": 28,
                    "author": "KYC03D",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I like to mix my drinks with 1:1 of each, for a more complex flavor.",
                            "score": 5,
                            "author": "SmokeAbeer",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ah yes gutter punch",
                                    "score": 2,
                                    "author": "OkPerspective623"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Bag piss",
                    "score": 10,
                    "author": "Zero_Waist"
                },
                {
                    "level": 1,
                    "comment": "😋",
                    "score": 3,
                    "author": "Koala5000"
                },
                {
                    "level": 1,
                    "comment": "Delicious drizzle",
                    "score": 2,
                    "author": "Mingey_FringeBiscuit"
                },
                {
                    "level": 1,
                    "comment": "Don't stand downwind of it on a breezy day.",
                    "score": 2,
                    "author": "ThermidorCA"
                },
                {
                    "level": 1,
                    "comment": "Slup til it's flat",
                    "score": 2,
                    "author": "niensven11"
                },
                {
                    "level": 1,
                    "comment": "They just let it spew everywhere. I would never visit this shithole.",
                    "score": -12,
                    "author": "Habbi_HaBibby",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Switzerland is literally one of the most beautiful places on earth. Still 10/10, even with garbage juice.",
                            "score": 15,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I hate places that clean and organised.\n\nGive me Bangkok &amp; NYC over Zurich and Singapore any day",
                                    "score": 7,
                                    "author": "th_teacher"
                                },
                                {
                                    "level": 3,
                                    "comment": "That's a no from me dawg.",
                                    "score": -1,
                                    "author": "Habbi_HaBibby"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It’s not a complete rubbish collection without leaking all those juicy juices.",
                    "score": 1,
                    "author": "xxNightingale"
                }
            ]
        },
        {
            "level": 0,
            "comment": "We got these everywhere in the Netherlands. Generally around flats and buildings with 30ish + people living there. Apartments above/around a mall type area tend to have these.\n\nBetter than having a mountain of garbage bags on the street, right?",
            "score": 32,
            "author": "high240"
        },
        {
            "level": 0,
            "comment": "I can’t work out if that’s an awesome or really shit idea",
            "score": 120,
            "author": "Billybillford",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's awesome but really expensive to build when the alternative is just a bin.",
                    "score": 75,
                    "author": "StaysAwakeAllWeek",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I mean the capacity of an underground bin is much bigger than a normal bin. And expensive is not really a point in Switzerland.",
                            "score": 50,
                            "author": "unwantedaccount56",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Which is why this is a great system, if the cost of hiring janitors is so high that spending hundreds of thousands on digging a giant hole and lining it with concrete becomes worth it.\n\nThat's why these are common in Switzerland but not in Serbia",
                                    "score": 33,
                                    "author": "StaysAwakeAllWeek",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That is certainly a reason, but I think I have seen it in other european countries as well, like Italy, where the wages are lower.\n\nThis system reduces smells and prevents access to the trash by rodents or birds. Also it is only a one time investment for a lot of use (at least in the cities).",
                                            "score": 36,
                                            "author": "unwantedaccount56",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The truth is that it is done to reduce garbage truck passages in each street, making it more environmentally friendly and economical.",
                                                    "score": 28,
                                                    "author": "Bernard-Babiche"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "But if something falls into, there's no way to get it back..,",
                                                    "score": -2,
                                                    "author": "slightlydispensable2",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "If you are standing on a bridge and drop your phone into a river, you are also not getting it back",
                                                            "score": 23,
                                                            "author": "unwantedaccount56",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Just drain the river.",
                                                                    "score": 9,
                                                                    "author": "UserName8531",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "This isn't India",
                                                                            "score": 16,
                                                                            "author": "jacksontwilight"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I went to empty my car ashtray into it, it slipped into there. I dont have a car ashtray for a long time now.",
                                                            "score": 3,
                                                            "author": "Kichmad"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Just think how many bodies you can put in there!",
                                    "score": 4,
                                    "author": "DanYHKim"
                                },
                                {
                                    "level": 3,
                                    "comment": "It is, but labor cost to empty vs. building this + less labor cost.",
                                    "score": 3,
                                    "author": "Dohnakun"
                                },
                                {
                                    "level": 3,
                                    "comment": "We have the same systeme in some parts of Paris as well it’s efficient against rats",
                                    "score": 3,
                                    "author": "impassity"
                                },
                                {
                                    "level": 3,
                                    "comment": "Over here in The Netherlands they use the same solution. Just one woman collecting/emptying. Five minutes per thingy.",
                                    "score": 2,
                                    "author": "MouseinTree",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Wow, just one woman to cover the whole of the Netherlands! You guys are so efficient!",
                                            "score": 3,
                                            "author": "Own-Chemistry6132"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "It's for bottles. It's not for normal garbage.",
                                    "score": -5,
                                    "author": "GoFetchMyDong",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Are you talking about the blue Züri-Säcke? That's for normal garbage, not bottles.",
                                            "score": 4,
                                            "author": "hazel_hazily"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The person who empties the bin is expensive too. The extra capacity means that you need fewer bin empties because these workers and the truck can probably do the work of many bin emptiers.",
                            "score": 6,
                            "author": "ikefalcon"
                        },
                        {
                            "level": 2,
                            "comment": "Keeping in mind that these are usually communal bins for possibley hundreds of people. I think my small town has two of them where you have separate bins likes these for recycling and garbage that are used by 3-4 apartment blocks plus a bunch of neighbouring single family houses. \n\nThe construction is much clearer than just a few large garage cans and has much more capacity (also is generally more accessible). When space is at a premium is can make sense to have these very clean, very large-capacity communal bins. And it's faster and cheaper than having all those people spread of single-family houses and having the truck stop at every house.\n\nCertainly expensive, but each commune can decide if it's worth spending their tax money on or not.",
                            "score": 4,
                            "author": "DVMyZone"
                        },
                        {
                            "level": 2,
                            "comment": "It's needed in densely populated neighbourhoods with narrow streets. We never had bins, we put our garbage on the street 2 times a week before these underground containers were build. It was really messy before.",
                            "score": 4,
                            "author": "moksplot"
                        },
                        {
                            "level": 2,
                            "comment": "Just build it while you build the train station, costs way less.",
                            "score": 2,
                            "author": "Dohnakun",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You need to commit to the crane trucks and the training for the operators, and for the maintenance of the bins. It only makes sense to install a large number of them at once. You can't just wait for a train station to be built unless the area already has them installed nearby",
                                    "score": 1,
                                    "author": "StaysAwakeAllWeek",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I haven't seen any of those bins at any swiss train station yet. Is this this a new project? The usual rectangular bins are still emptied by workers in orange suits.",
                                            "score": 1,
                                            "author": "Dohnakun"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Small bin you have to empty often, which cost a lot, big bin you can empty less often, costs less. We do this in Sweden too where we build new apartment complexes.",
                            "score": 2,
                            "author": "nicholasruunu",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Sweden, another country where even a janitor costs thousands of euros a month. \n\nIn less wealthy countries it's far more often worth paying people to empty the bins rather than spending tens of thousands extra on digging and lining a huge hole, installing a sump pump at the bottom and the giant steel bin, then spending hundreds of thousands on the crane trucks needed to empty them",
                                    "score": 5,
                                    "author": "StaysAwakeAllWeek",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "We have janitors, but we have garbage trucks and garbage men that takes care of multiple areas which bring the cost down.",
                                            "score": 2,
                                            "author": "nicholasruunu"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The expensive part here are those two guys that has to turn up on regular basis.",
                            "score": 2,
                            "author": "MercatorLondon"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It would never work here. The machines wouldn't be maintained and it would get dropped on someone's head.",
                    "score": 2,
                    "author": "turriferous"
                },
                {
                    "level": 1,
                    "comment": "Agreed, all I could think about was, what if it's windy? Do you just wait until the weather's ok to keep that thing from swinging around in high winds?",
                    "score": 4,
                    "author": "Mud_Duck_IX",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "After watching this a few times in all weather conditions I can say it doesn't swing nearly as much as it would seem. I believe they have the option of locking in the arm before lifting it out.",
                            "score": 3,
                            "author": "KYC03D"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's better than any American idea at least, simply because it's a European idean",
                    "score": 3,
                    "author": "Rellmein"
                },
                {
                    "level": 1,
                    "comment": "Shit. There are way more effective ways to do this. Where i live they just suck it up from large underground bins.",
                    "score": -1,
                    "author": "emmytau"
                },
                {
                    "level": 1,
                    "comment": "Cool concept; dangerous execution.  So many problems with this process.",
                    "score": 1,
                    "author": "pxladk"
                }
            ]
        },
        {
            "level": 0,
            "comment": "First time I've seen a rubbish bin with automatic guardrails",
            "score": 62,
            "author": "KYC03D",
            "replies": [
                {
                    "level": 1,
                    "comment": "All the centralized recycling spots at the train stations also work this same way. The square area you stand on while putting things down the metal chute comes right out of the ground and the whole thing gets lifted up and emptied from the bottom.",
                    "score": 17,
                    "author": "rpsls"
                },
                {
                    "level": 1,
                    "comment": "It's for bottles. Mostly wine bottles. Rubbish, dont go in these. They are bottles and aluminum recycling",
                    "score": -5,
                    "author": "GoFetchMyDong",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This one definitely has rubbish in it - you can see the pay-per-use blue bags that are required for trash disposal in the video. :)",
                            "score": 4,
                            "author": "Supertrample"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ok I live in Zwitserland. These underground bins are for général waste, paper and glass (each another one). They are located every x blocks and are there to sort your trash. Still there are above ground bins for metal or coffee pads. They are emptied 2 times a week (live in city of Geneva). They are to reduce the smell and visibility. I’m Switzerland the cost is not important , as long as it pleases the eye and is effective. \nAnd notice the railing that pops up when the hole is uncovered to prevent one to fall in it :) !",
            "score": 17,
            "author": "damienke456",
            "replies": [
                {
                    "level": 1,
                    "comment": "Plus Germany, Italy, Netherlands and then some.",
                    "score": 4,
                    "author": "Oscar5466"
                },
                {
                    "level": 1,
                    "comment": "Zürich here, we've got these for general waste, glass and aluminum, cardboard and biological waste are regular overhead bins.",
                    "score": 2,
                    "author": "KYC03D"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Use the same system in Norway, and overall they are more effective. Less chance of being blocked when half-full (because lazy neighbor doesn't bother throwing things properly inside), and the trash company doesn't have to manually shuffle several containers to their truck. \n\nIt's faster to empty, and more efficient at storing the trash efficiently. They even come with various key solutions. Handy for large residential areas.",
            "score": 12,
            "author": "GarmaCyro"
        },
        {
            "level": 0,
            "comment": "Those bins are designed to keep rodents and smells away. In warm areas like Italy and Spain this is pretty common.",
            "score": 15,
            "author": "Av14tor",
            "replies": [
                {
                    "level": 1,
                    "comment": "Like the smells of trash juice sitting compressed for who knows how long",
                    "score": -6,
                    "author": "IllAcanthopterygii19"
                }
            ]
        },
        {
            "level": 0,
            "comment": "We have these in Finland, they are Molok brand and have a reusable trash bag inside instead of that kind of container.",
            "score": 4,
            "author": "Magnetic_Virus",
            "replies": [
                {
                    "level": 1,
                    "comment": "Molok does offer hard container option in their product range, but I guess everyone in Finland mostly chooses to select them with the flexible bags instead of hard bottom open containers. I would assume the flexible bag option is way cheaper, than such large hard container.",
                    "score": 2,
                    "author": "variaati0"
                }
            ]
        },
        {
            "level": 0,
            "comment": "“I understand ma’am, but the guys are on the next street over so they should be picking up your trash by the end of next week.”",
            "score": 18,
            "author": "ResponsibleMilk7620",
            "replies": [
                {
                    "level": 1,
                    "comment": "We've got more than one set of these \"guys\"",
                    "score": 8,
                    "author": "KYC03D"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Amazing the volume and aesthetics of keeping it underground. Would end those overflowing bins everywhere.",
            "score": 3,
            "author": "VariableVeritas"
        },
        {
            "level": 0,
            "comment": "These are very cool, reduce smells and remove ugly bins at ground level. They are pretty common throughout Europe.",
            "score": 3,
            "author": "AFDIT"
        },
        {
            "level": 0,
            "comment": "A lot of butt hurts Americans in the comments",
            "score": 10,
            "author": "Grazziellone"
        },
        {
            "level": 0,
            "comment": "I want to see this when there is a strong wind, and when the receptacle is nearly full.",
            "score": 8,
            "author": "HockeyCookie",
            "replies": [
                {
                    "level": 1,
                    "comment": "When it’s full it actually swings less.\nIn the versions that I know of, the boom doesn’t just have a hook but positively latches onto the bin, it’s not coming off.\nAll these comments about perceived safety issues, this one is in Switzerland of all places, where safety and efficiency go Way above investment cost.\nJust because it’s not common in the US of A it must be no good??",
                    "score": 3,
                    "author": "Oscar5466",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Just worried about the center of balance being too far above the truck. The other systems I've seen had a larger truck, and half the bin size.",
                            "score": 1,
                            "author": "HockeyCookie"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Unless I’m missing something that makes it different, they have these in Florence Italy too",
            "score": 2,
            "author": "mooslar"
        },
        {
            "level": 0,
            "comment": "Same in French Alps!",
            "score": 2,
            "author": "Upset-Woodpecker-662"
        },
        {
            "level": 0,
            "comment": "We have this is sweden as well.",
            "score": 2,
            "author": "Cryoticx"
        },
        {
            "level": 0,
            "comment": "That is slick.",
            "score": 2,
            "author": "Mister024"
        },
        {
            "level": 0,
            "comment": "This must be what that kid fell into in that one video where the kids were fuckin’ around with a trash can and the one ‘disappeared’. Ugh, imagine falling 5-8 feet into who knows what. Blech 🤢",
            "score": 2,
            "author": "cajerunner"
        },
        {
            "level": 0,
            "comment": "That would cause a maggot plague if this was in Australia",
            "score": 2,
            "author": "CryptographerFun2262"
        },
        {
            "level": 0,
            "comment": "I can’t imagine there’s nearly as many, if *any*, incidents of people dying or ending up thrown into garbage trucks during this process. I can’t tell you how often I see on the news that some homeless guy died or got injured from being thrown out of a dumpster during trash pickup. Living in the US feels so gross and primitive whenever I see stuff like this in other countries. Y’all complain about it being expensive but you’re paying for cleaner, safer environments. I’ll take that over this Florida BS any day.",
            "score": 8,
            "author": "frog_baseball1111",
            "replies": [
                {
                    "level": 1,
                    "comment": "They've got a false floor plastered with warnings and emergency numbers",
                    "score": 2,
                    "author": "KYC03D"
                },
                {
                    "level": 1,
                    "comment": "I've seen a video where a dumb kid jumped into one of these style trash bins and I can't imagine it was very fun. Here in America I'm sure people would do it still",
                    "score": 3,
                    "author": "chickenaylay"
                }
            ]
        },
        {
            "level": 0,
            "comment": "these are around europe. Apartment residents take their trash to these. jumped in one as a kid, that was dumb idea.",
            "score": 3,
            "author": "ogville",
            "replies": [
                {
                    "level": 1,
                    "comment": "How did you get out? The ones here have signs inside not to step in and emergency numbers.",
                    "score": 2,
                    "author": "KYC03D",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "i was a paper one almost full so my friebd was able to pull me out eventually",
                            "score": 1,
                            "author": "ogville"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I came here thinking this is bad idea and after reading these comments I see why Americans would be butt hurt! So much more cleaner in Europe compared to United States",
            "score": 4,
            "author": "famefastlane"
        },
        {
            "level": 0,
            "comment": "The most efficient way to spend taxpayers money.",
            "score": 2,
            "author": "nhalas",
            "replies": [
                {
                    "level": 1,
                    "comment": "Agree.  It’s so inefficient and clogs the services corridor too.  Plus the lifting operation is fraught with risk.",
                    "score": 1,
                    "author": "CreepySquirrel6"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why the Swiss gotta be such tryhards\n\n(I'm honestly very impressed, to the point of jealousy)",
            "score": 2,
            "author": "Dry_Can1353",
            "replies": [
                {
                    "level": 1,
                    "comment": "Several advantages to this system. The trucks come less often to pick up the trash so less km driven and subsequently less trucks needed, it's off the street so no fox will come and shred the bags, the weight of all the bags in the cylinder compress it down, saving space, and you can throw out your trash whenever you want so you can't miss garbage day.",
                    "score": 11,
                    "author": "Weekly-Language6763",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Also, this system of trash disposal requires each household to purchase a roll of bags for the disposal (pay-per-bag) rather than 'paying for a personal trash can that is emptied from the property' on a monthly basis per-household. The majority of this trash is incinerated, too.",
                            "score": 2,
                            "author": "Supertrample",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This type of dumpster and the pay-per-bag thing are orthogonal. Many places without pay-per-bag use them including Geneva",
                                    "score": 1,
                                    "author": "CloudsAndSnow",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Other places have a wireless access card, pay per dump system.",
                                            "score": 1,
                                            "author": "Oscar5466"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Look unnecessarily dangrous compared to the old fork dumpsters. That boom swinging in the wind and imagine the mess if it failed.",
            "score": -1,
            "author": "mandozombie",
            "replies": [
                {
                    "level": 1,
                    "comment": "Unlikely with swiss engineering",
                    "score": 6,
                    "author": "KYC03D",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You seem biased. Any equipment can fail sometimes due to opperator error. There is way too much that CAN go wrong here. An overloaded bin might even tip the truck.",
                            "score": -8,
                            "author": "mandozombie",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "How is the bin supposed to be overloaded if it only has a certain capacity",
                                    "score": 3,
                                    "author": "National-Bison-3236",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You can controll the exact type of garbage someone outs in there? Or do you think all trash has the same density?",
                                            "score": 1,
                                            "author": "mandozombie",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You don‘t seem to know much about these cranes\n\nthey are mostly designed to lift an greater weight than the max weight of these trash bins, apart from that the truck couldn‘t tip because if the trash bin was too heavy the crane simply wouldn‘t lift it\n\nApart from that, as you should be able to see, it also has crane supports",
                                                    "score": 2,
                                                    "author": "National-Bison-3236",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "What i see is it swinging around dangerously while someone works under it under what i assume are normal weight and wind conditions. Defend the practice all you like its not better than fork dumpsters in any way but astetics.",
                                                            "score": 1,
                                                            "author": "mandozombie",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "astetics and volume of the bin",
                                                                    "score": 2,
                                                                    "author": "National-Bison-3236",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "We've used this in my city for... Like one and a half decades... And the casualties have been... Lemme check, oh, here, found some: \n\nA crazy lady threw a cat in one. The cat died from, presumably a heat stroke. (It gets really hot here)\n\nA kid jumped into one and safety got out because the top can come off too. \n\nAre you happy now?",
                                    "score": 2,
                                    "author": "ranfur8",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Neither of those adress the issue of a swinging dripping   garbage juice tube that is not actually better than what was used before.",
                                            "score": 1,
                                            "author": "mandozombie",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It's fast, it's easy, it's automated, requires less work, less workers, and contrary to what you think, wind affects it very little. It weighs a lot, you will need very fast wind to affect it. I've seen them operating in windy weather and it affects it basically 0. It's not falling off the hook either, there have been no recorded hook failures (yet). The ones we use, the hook locks in place so it can't come off. It prevents homeless people from ravaging through the trash, it prevents animals from getting into the trash. It requires less cleaning, because trash can actually fit in there and people don't let the bags outside when it's full, because it never gets full. The system is automatic, it sends an alert to the garbage collection facility notifying them that the container is nearly full and requires collection. There's a drain at the bottom so when it gets too dirty, they just spray it down with a pressure washer incorporated into the truck.\n\nThe collection usually happens at night to not disturb traffic, however, it literally takes 1 - 2 minutes to empty it. I think most of us are willing to wait a couple of minutes. Or if it's a two way street just go around it.\n\nThere are essentially no Downsides to this approach, apart from the initial investment.\n\nIn most European cities we don't have garbage bins outside of each apartment building / house. We have one per every 3/4 streets or a couple of them if it's a highly populated area. \n\nJust because it's not popular in America doesn't mean it's bad.\n\nPlus, you know what can also fail? A normal garbage truck. \nPeople can set fire to normal bins. People can move normal bins.",
                                                    "score": 1,
                                                    "author": "ranfur8"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That seems unnecessarily complex and dangerous. You’ve turned a garbage truck driver into a crane operator with no rigger, no signal-person &amp; no taglines, conducting what is essentially a blind pick. Then haven’t barricaded the swing radius of the crane and have workers just kind of casually wandering around too close to a suspended load.",
            "score": 1,
            "author": "No_Act6221",
            "replies": [
                {
                    "level": 1,
                    "comment": "Apparently it works quite well despite your apparent objections, why else would this be totally normal in so many western cities. It’s efficient, no specific days for residents to put out the trash, paid access can easily be added and the streets remain uncluttered at all times.",
                    "score": 6,
                    "author": "Oscar5466",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My objections are based on the safety of the workers and the public, as well as common safety regulations and industry standards throughout the world. And the vast majority of those regulations are written in blood. But as long as it’s convenient and efficient, oh well.",
                            "score": 1,
                            "author": "No_Act6221",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh so European countries pay no heed to safety LOL",
                                    "score": 3,
                                    "author": "Oscar5466",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt; Throughout the world\n\nAka the USA",
                                    "score": 2,
                                    "author": "ranfur8",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The idea is great but the implementation and execution are janky as fuck. \n\nI'm sure there's a way to streamline the experience of the truck operators and the garbage contraption itself, other than precariously suspending it from a crane and showing it into the well.",
            "score": 1,
            "author": "chromozopesafie",
            "replies": [
                {
                    "level": 1,
                    "comment": "All the operator did was scan in the bin, the rest happens automatically.",
                    "score": 3,
                    "author": "KYC03D"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thats why living there is so expensive?",
            "score": 1,
            "author": "luckyboyjuni",
            "replies": [
                {
                    "level": 1,
                    "comment": "Our taxes don't actually go into this, our trash bags are pay per use, only the official ones are permitted.",
                    "score": 3,
                    "author": "KYC03D",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Except in Geneva for some reason",
                            "score": 2,
                            "author": "CloudsAndSnow"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Mmmmm tasty healthy bin juice",
            "score": 1,
            "author": "Kittykatkvnt"
        },
        {
            "level": 0,
            "comment": "Those garbage juices are not to be messed with.",
            "score": 1,
            "author": "SternLecture"
        },
        {
            "level": 0,
            "comment": "This seems like a bad system.",
            "score": -2,
            "author": "nirvahnah"
        },
        {
            "level": 0,
            "comment": "it takes 20 minutes longer than normal trash pick up",
            "score": 0,
            "author": "puppydoll-",
            "replies": [
                {
                    "level": 1,
                    "comment": "Was looking for this. In the same time the old style pickup garbage trucks with 2-3 guys would’ve finished one block. I’m not even being sarcastic or making a joke.",
                    "score": 1,
                    "author": "Xenomorphhive",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "lmao i got downvoted for saying it 💀",
                            "score": 1,
                            "author": "puppydoll-"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "... in Switzerland, that hole can also work as an entrance to yar bomb shelter, I bet!",
            "score": 0,
            "author": "LinguoBuxo"
        },
        {
            "level": 0,
            "comment": "Well that seems like an incredible waste of time and money.",
            "score": 0,
            "author": "Craigg75"
        },
        {
            "level": 0,
            "comment": "This seems so overly complex, slow and expensive.",
            "score": -2,
            "author": "Daphne_Brown",
            "replies": [
                {
                    "level": 1,
                    "comment": "How so?",
                    "score": 4,
                    "author": "Urza_King_Artificer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Slow compared to the speed with which they collect trash from the 48 homes on my street. Overlooking complex because it requires installation of subsurface bins. Expensive because it is certainly more expensive than bins.",
                            "score": -2,
                            "author": "Daphne_Brown",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thats fantastic, what kinda bins are talking? Like big ones or are you talking about the individual trashcans at each house? Cause if theres 48 individual bins even if it takes 30secs each still thats 24mins just on ur street, this was just over a minute. And then like others are saying on here is that because of how big they are, they arent picking up the trash every week, which is the real money, time, and environmental footprint benefits.",
                                    "score": 2,
                                    "author": "Urza_King_Artificer",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Less than 30 seconds for sure. The truck barely pauses. They’re so damn light and small and cheap.",
                                            "score": 1,
                                            "author": "Daphne_Brown"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It looks very dangerous I don't think insurance companies would like it",
            "score": -2,
            "author": "FatbackAndPintoBeans"
        },
        {
            "level": 0,
            "comment": "So, nothing else happening there in 2-3 meters depth? No cables, no sewage?",
            "score": -6,
            "author": "everynameisalreadyta",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'd suppose these are planned in with the rest of underground infrastructure.",
                    "score": 8,
                    "author": "KYC03D",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sure it is planned, but where do they put all the other stuff? Even deeper?",
                            "score": -8,
                            "author": "everynameisalreadyta",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "2 meters to the left?",
                                    "score": 11,
                                    "author": "Flat-Activity9713",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That is where the subway goes!",
                                            "score": -1,
                                            "author": "everynameisalreadyta",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Pretty sure the Subway would be tunnelled a good few hundred meters deeper knowing how the swiss like to do things.",
                                                    "score": 4,
                                                    "author": "KYC03D"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "The other left",
                                                    "score": 2,
                                                    "author": "Flat-Activity9713"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "To be fair the bomb shelters are even deeper than the trash silo",
                                    "score": 1,
                                    "author": "KYC03D"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Everything in Switzerland is underground (almost no above-ground local power or data lines in any reasonable-sized town), so the space is all carefully planned.",
                    "score": 5,
                    "author": "rpsls"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I can’t think of a less efficient way to do this frankly.  Huge expense to install this system and slow as hell to collect.  \n\nMust have been designed and mandated by the government.",
            "score": -7,
            "author": "bcanddc",
            "replies": [
                {
                    "level": 1,
                    "comment": "It‘s actually quite efficient. They only collect once a month or so. As a resident you get to dispose of your waste whenever you like. They don‘t smell either and no rodents go through the waste.\n\nAs for cost, they are cheaper than a weekly bin man service. This is Switzerland, so the most expensive part of anything is labour. Fewer trips for the bin men means fewer hours to pay.",
                    "score": 5,
                    "author": "Progression28"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So that's where they hide their missile silos",
            "score": 1,
            "author": "bodhidharma132001"
        },
        {
            "level": 0,
            "comment": "Wasn’t there a teenager a few years ago who climbed into one of these and couldn’t get out so they had to cut him out or something?",
            "score": 1,
            "author": "Ksh1218",
            "replies": [
                {
                    "level": 1,
                    "comment": "Get a key, open a hatch and make the teen look silly on the local evening news. \nThat’s what actually happened.",
                    "score": 3,
                    "author": "Oscar5466"
                }
            ]
        },
        {
            "level": 0,
            "comment": "They have the money to let this take as long as it does xD",
            "score": 1,
            "author": "Happlord"
        },
        {
            "level": 0,
            "comment": "Itll take all week to do one neighborhood lol.",
            "score": 1,
            "author": "Ambitious_Towel_5911",
            "replies": [
                {
                    "level": 1,
                    "comment": "No problem, when such container can go potentially months without emptying. Those are *huge*. The whole point being, you could never afford so much surface volume to have such huge containers, well bury it and you can have cubic meters of volume.",
                    "score": 2,
                    "author": "variaati0",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Some versions even have built-in compactors",
                            "score": 2,
                            "author": "Oscar5466"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Seems neat at first but it's rather impractical and unsafe with all the dangling.",
            "score": 1,
            "author": "alphvader"
        },
        {
            "level": 0,
            "comment": "We use the same system except for the fact that our trucks are equipped with an automatic arm for the extraction and is not that high [image](https://www.pisatoday.it/~media/horizontal-hi/53039657921667/cassonetti-differenziata-pisa-2.jpg)",
            "score": 1,
            "author": "nemis16"
        },
        {
            "level": 0,
            "comment": "Newer Commercial builds here in my part of Canada (Alberta) have these as well.",
            "score": 1,
            "author": "Otherwise_Birthday_8"
        },
        {
            "level": 0,
            "comment": "What a load of rubbish!",
            "score": 1,
            "author": "xneyznek",
            "replies": [
                {
                    "level": 1,
                    "comment": "Also, everyone complaining how long it takes, not accounting for how less frequently the bin needs to be emptied. Not only does it take less time overall than it seems, but it can also cut down on fuel consumption as the truck has to make fewer rounds. Sure, maybe a dumpster would be faster, but they take up more space, are ugly, and aren’t ideal for pedestrian use.",
                    "score": 2,
                    "author": "xneyznek",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Twice a week is not infrequent",
                            "score": 1,
                            "author": "Bellasarivs",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ours is collected once a month.",
                                    "score": 2,
                                    "author": "KYC03D"
                                },
                                {
                                    "level": 3,
                                    "comment": "Compare to if it were a standard bin, which would fill multiple times daily under the same demand.",
                                    "score": 1,
                                    "author": "xneyznek"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have seen some of em in Norway",
            "score": 1,
            "author": "PowerOhene"
        },
        {
            "level": 0,
            "comment": "Oh yeah, they're putting these up all over the place in Athens. Pretty neat, they take up much less sidewalk space than an above-surface bin, and they're completely inaccessible to rats/strays. The increased capacity is probably good for the city, too. The ones in Athens have solar panels on top, so the electrical mechanism doesn't use the city's electricity.",
            "score": 1,
            "author": "sarumanthestupid"
        },
        {
            "level": 0,
            "comment": "It’s probably designed to put the garbage back if you don’t pay on time,Swiss technology",
            "score": 1,
            "author": "Greedy-Specific7723",
            "replies": [
                {
                    "level": 1,
                    "comment": "The bags themselves are the charge...",
                    "score": 1,
                    "author": "KYC03D"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This gives a whole new perspective of that kid climbing inside one of those and falling in gifs",
            "score": 1,
            "author": "Dempsyfromearth2"
        },
        {
            "level": 0,
            "comment": "When I see these bins all I can think about is that video where the kid hides in one and his friends close the lid then open it and he’s gone because it opened up underneath him to dump him in the holding tank, ugh.",
            "score": 1,
            "author": "Exotic_Treacle7438"
        },
        {
            "level": 0,
            "comment": "That's a nuclear reactor, I don't have any proof but I don't have any doubts either",
            "score": 1,
            "author": "CapitanGGhost"
        },
        {
            "level": 0,
            "comment": "4 hours later …",
            "score": 1,
            "author": "Financial_Low_8265"
        },
        {
            "level": 0,
            "comment": "Some societies are just superior to the rest…",
            "score": 1,
            "author": "Waxyknowsbest"
        },
        {
            "level": 0,
            "comment": "All I could see was the guy standing directly underneath it. In the USA OSHA would freak out and fine the company heavily for that.",
            "score": 1,
            "author": "NothingbutLuck0"
        },
        {
            "level": 0,
            "comment": "that's wrubbish",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I like the safety fence that comes up to keep people from falling into the hole.",
            "score": 1,
            "author": "DanYHKim"
        },
        {
            "level": 0,
            "comment": "Only if NYC could get their ish together and probs invest in this …..\n\nBut billionaires are like no let the plebs drown in trash w a sprinkles of rats and roaches",
            "score": 1,
            "author": "Slappy-dont-care"
        },
        {
            "level": 0,
            "comment": "We had this at our last place in Canada. Three bins though: Garbage, recycling, and compost 🗑️♻️🍗",
            "score": 1,
            "author": "LadyBulldog7",
            "replies": [
                {
                    "level": 1,
                    "comment": "These two are garbage. Compost, cardboard, paper, glass and aluminum are just around the corner!",
                    "score": 2,
                    "author": "KYC03D"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The system where you only collect a residence trash every 3 months.",
            "score": 1,
            "author": "Head-like-a-carp"
        },
        {
            "level": 0,
            "comment": "This just seems wayyyyyyy too elaborate and expensive to a) build and b) maintain",
            "score": 1,
            "author": "Stymie999",
            "replies": [
                {
                    "level": 1,
                    "comment": "Then why has a large part of the western urban world this system or something very similar?",
                    "score": 1,
                    "author": "Oscar5466"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Taiwan garbage collection is the most impressive. Must admit. None of this required, people just walk their bags to the truck and put it in. There’s not even public trash cans.",
            "score": 1,
            "author": "toothbrush81",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ooh I'm familiar witht he system, reminds me of many months spent living above the shi lin ye shi. All fun until the bags pile up in taifeng season.",
                    "score": 1,
                    "author": "KYC03D"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wonder how long it sits in there",
            "score": 1,
            "author": "Basic-Aspect",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ours are done once a week, more rural ones up to once a month.",
                    "score": 1,
                    "author": "KYC03D"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Are those spent fuel rods?",
            "score": 1,
            "author": "aurrousarc"
        },
        {
            "level": 0,
            "comment": "So you have to work one day every two months waiting for that thing to fill up",
            "score": 1,
            "author": "beerock99"
        },
        {
            "level": 0,
            "comment": "That is satisfying to see",
            "score": 1,
            "author": "LongliveTCGs"
        },
        {
            "level": 0,
            "comment": "I can't help but feel there should be a faster and easier way to do that",
            "score": 1,
            "author": "Klubbin4Seals"
        },
        {
            "level": 0,
            "comment": "Seems like an awful lot of machinery for a blue tarp and 3 paper plates.",
            "score": 1,
            "author": "BradleyCrewman"
        },
        {
            "level": 0,
            "comment": "How does this compare to an enclosed compactor dumpster where the whole dumpster is hauled away?",
            "score": 1,
            "author": "LordOdin99"
        },
        {
            "level": 0,
            "comment": "Lego people got zero overhead powerlines",
            "score": 1,
            "author": "spectredirector"
        },
        {
            "level": 0,
            "comment": "IIRC this also prevents the dangers of \"trash bombs\" which is why lots of city's don't have public trash cans. Since the actual storage of trash is underground, an explosive would not be as effective as a above ground trash can. And I've been to cites without public trash cans and it's terrible, you have to hold all your trash forever until you can finally find that unicorn or find a restaurant.",
            "score": 1,
            "author": "Koda_not_Kota"
        },
        {
            "level": 0,
            "comment": "We have those in Canada too",
            "score": 1,
            "author": "IllustratorTime4879"
        },
        {
            "level": 0,
            "comment": "OMFG ITS SAUCY EWWWWWW!!!!!!\n\nTHE SMELL OF THAT FERMENTED GARBAGE SAUCE NOOOOOOO!!!!!!\n\nThis system spreads the sauce all over the sidewalk I hate it.",
            "score": 1,
            "author": "Ehgadsman",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's just rainwater runoff, no funky smells",
                    "score": 1,
                    "author": "KYC03D"
                }
            ]
        },
        {
            "level": 0,
            "comment": "DAMMIT SWITZERLAND!!!",
            "score": 1,
            "author": "I_be_lurkin_tho"
        },
        {
            "level": 0,
            "comment": "What’s good is a very deep and large collecting container.  What doesn’t seem good is how cumbersome it looks to pull out, have it swing back and forth and get onto the truck, then swing back and forth back into the hole.  \n\n.",
            "score": 1,
            "author": "GoodWillHunting_"
        },
        {
            "level": 0,
            "comment": "It looks incredibly clean there",
            "score": 1,
            "author": "Kind_Vanilla7593"
        },
        {
            "level": 0,
            "comment": "its damm smart that the barrier gets pulled out along with the bin during the process to stop people from accidentally falling in. designer did good.",
            "score": 1,
            "author": "GodofsomeWorld"
        }
    ]
}