{
    "id": "13y1prn",
    "score": 373,
    "title": "Tomb of Nefertari, Queen Of Ancient Egypt &amp; Wife Of of Ramesses the Great [Year 1255 BC]",
    "author": "TegraMuskin",
    "date": 1685676084.0,
    "url": "https://www.reddit.com/r/interestingasfuck/comments/13y1prn",
    "media_urls": [
        "https://i.imgur.com/SZlei0X.gifv"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\n**This is a heavily moderated subreddit. Please note these rules + sidebar or get banned:**\n\n\n* If this post declares something as a fact, then proof is required\n* The title must be fully descriptive\n* No text is allowed on images/gifs/videos\n* Common/recent reposts are not allowed (posts from another subreddit do not count as a 'repost'. Provide link if reporting)\n\n*See [this post](https://redd.it/ij26vk) for a more detailed rule list*\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/interestingasfuck) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Is Nefertari different than Nefertiti?",
            "score": 8,
            "author": "RedSonGamble",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah. Nefertari was married to Ramesses and was considered first of his principal wives. He was said to have loved her above all others and had statues of her placed alongside the colossal statues of him at the temple of Abu Simbel. Near the main temple complex is a smaller temple dedicated to her and the goddess Hathor.\n\nNefertiti was wife to Akhenaten who completely flipped the Egyptian pantheon on it's head and, iirc, is the first example of monotheism in history. Instead of the Gods like Isis, Horus, or Ra everything was replaced by Aten. This essentially made him a heretic in the eyes of priests and when he died and King Tutankhamun replaced him they turned the screws to have him abolish Atenism and replace it with the old pantheon.\n\nIf memory recalls. I did a paper when I was in Grade 12 on Akhenaten because we were studying world religions and I took something out of the ordinary.",
                    "score": 6,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "Yes",
                    "score": 4,
                    "author": "TegraMuskin"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Source: https://youtube.com/shorts/ul40TZz9jcA?feature=share",
            "score": 4,
            "author": "TegraMuskin",
            "replies": [
                {
                    "level": 1,
                    "comment": "thanks, bud.",
                    "score": 1,
                    "author": "Kbas"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Nefertari D Lili 😳",
            "score": 3,
            "author": "raz_8153"
        },
        {
            "level": 0,
            "comment": "I hear if If you pause it in the right place you can see C-3PO and R2D2 on the wall",
            "score": 2,
            "author": "tom_cool"
        },
        {
            "level": 0,
            "comment": "This was created roughly 5 centuries before Rome developed into a city.",
            "score": 2,
            "author": "trgreg"
        },
        {
            "level": 0,
            "comment": "I thought that was Peter Criss in the first few seconds.",
            "score": 2,
            "author": "Individual_Scale_639"
        },
        {
            "level": 0,
            "comment": "I don't care what they tell you in school, Nefertiti was black and bald. Her husband Ramses Smith went furiously slapping whomever dared to usher her name",
            "score": 0,
            "author": "raziel_LK"
        },
        {
            "level": 0,
            "comment": "She lived during the collapse of the late Bronze Age, the invasion of the Sea People.",
            "score": 1,
            "author": "Insteadly",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ah the bronze age collapse Egypt was the only civilization to surive the sea people but would never attain its former glory.",
                    "score": 1,
                    "author": "Mtech25"
                }
            ]
        },
        {
            "level": 0,
            "comment": "VIP Room vibes…",
            "score": 1,
            "author": "Takeonlyone"
        },
        {
            "level": 0,
            "comment": "put back the artifacts and seal that shit up",
            "score": 1,
            "author": "SnareXa"
        },
        {
            "level": 0,
            "comment": "Cool wallpaper",
            "score": 0,
            "author": "Shoryukitten_"
        }
    ]
}