{
    "id": "13zmhui",
    "score": 10607,
    "title": "These glasses that subtitles live conversation for deaf people ",
    "author": "uchman365",
    "date": 1685819795.0,
    "url": "https://www.reddit.com/r/interestingasfuck/comments/13zmhui",
    "media_urls": [
        "https://v.redd.it/fxgi1dgrru3b1"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\n**This is a heavily moderated subreddit. Please note these rules + sidebar or get banned:**\n\n\n* If this post declares something as a fact, then proof is required\n* The title must be fully descriptive\n* No text is allowed on images/gifs/videos\n* Common/recent reposts are not allowed (posts from another subreddit do not count as a 'repost'. Provide link if reporting)\n\n*See [this post](https://redd.it/ij26vk) for a more detailed rule list*\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/interestingasfuck) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Im not deaf and i could definitely use these",
            "score": 921,
            "author": "doubled2319888",
            "replies": [
                {
                    "level": 1,
                    "comment": "You can already do it on your phone.",
                    "score": 132,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How can I do this?! I'm hard of hearing and dreading the thought of thousands for hearing aids",
                            "score": 53,
                            "author": "rrundrcovr",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "https://xrai.glass",
                                    "score": 81,
                                    "author": "beobabski",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "THANK YOU! just downloaded it!",
                                            "score": 30,
                                            "author": "rrundrcovr",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 18,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I LOVE technology! But I shudder to think how much they'll charge. That's being said, I have a friend who could REALLY use this and money isn't an issue for her, she'll love this!",
                                                            "score": 3,
                                                            "author": "rrundrcovr",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "There will be a free forever version using onboard transcription. The premium (cloud based) plans start from $20/month",
                                                                    "score": 2,
                                                                    "author": "danscarfe"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "It said about $485 US",
                                                                    "score": 2,
                                                                    "author": "wvmitchell51",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Live Transcribe accessibility feature if you're using Android.  There is a neat setting where it will vibrate the phone when someone says your name.",
                                    "score": 16,
                                    "author": "Exeunter",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That's something I can use! Thanks! Looking it up right now!",
                                            "score": 6,
                                            "author": "rrundrcovr"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "that was my first thought, it would look more natural for them to stare at an app on their phone like everyone else, than to wear glasses at night like those, do they auto dim for night and day??",
                            "score": 30,
                            "author": "jumpofffromhere",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Sadly it is a limitation of the current design of smart glasses. They use a bird bath (fancy name for mirrored lens) that bounces light into your eyes. No shade, no contrast to see it! They are lighter inside out than the reverse",
                                    "score": 11,
                                    "author": "danscarfe"
                                },
                                {
                                    "level": 3,
                                    "comment": "I read that when someone is deaf their other senses heighten, meaning these people can likely see in the dark like a cat.",
                                    "score": -20,
                                    "author": "TomCruiseddit",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "This is not the truth at all. It's a myth that your other senses get better you just get more used to using them. \n\nIt's no different than me saying if I cut off your dominant arm your other arm will get better. It will have to adjust, but you aren't going to become super human.\n\nDeaf people aren't going to have an adaptation in thier eye that let's in low light better or clearer",
                                            "score": 26,
                                            "author": "avdolian",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Actually, when I lost the full use of one of my arms (due to a stroke) I'm able to do pretty much everything that most people can do with both arms, but I just use one, it's just I adapted and I refused to use a lot of the contraptions that they provided me with, mainly because I didn't see the point of them, are things that I can't do? maybe but don't tell me that",
                                                    "score": 1,
                                                    "author": "iago303",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "i think its parts of the brain that dealt with one thing that is ni longer used, is now uptaken by other parts of the body.",
                                            "score": 3,
                                            "author": "SigueSigueSputnix",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That’s exactly what it is.",
                                                    "score": 1,
                                                    "author": "KhanKarab"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Auditory processing disorder if highly comorbid with lots of non-neurotypical things like ADHD; I know a ton of people will benefit from these.",
                    "score": 26,
                    "author": "H_G_Bells",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I have autism and this would be extremely useful, in crowded or loud environments like restaurants, I basically cannot hear people who want to get my attention but I hear the 300 other noises including people 7 tables away perfectly 🙄",
                            "score": 4,
                            "author": "signedchar",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "This is one reason that it would be great if sign language was more widely used and taught. Imagine being able to immediately switch to non-verbal communication without relying on technology! \n\nUnfortunately I have adhd and therefore absolutely suck at memorising/learning languages so I’ll just continue to wish I knew Auslan without ever doing anything about it lmao",
                            "score": 1,
                            "author": "yungmoody"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Increased access helps everyone! These definitely would have been useful during the masking time!!",
                    "score": 11,
                    "author": "Banban84"
                },
                {
                    "level": 1,
                    "comment": "live transcribe app",
                    "score": 4,
                    "author": "King-Cobra-668"
                },
                {
                    "level": 1,
                    "comment": "Goddamn me too. My hearing is perfectly fine but I can’t even follow tv shows without subtitles",
                    "score": 3,
                    "author": "metalshoes"
                },
                {
                    "level": 1,
                    "comment": "Be great for seamless translation on the go",
                    "score": 2,
                    "author": "Mks235"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is cool! There's probably an even bigger market for using something like this for real-time language translation...",
            "score": 329,
            "author": "JohannReddit",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hearing the google glasses team cry via text",
                    "score": 111,
                    "author": "Significant_Stuff_92"
                },
                {
                    "level": 1,
                    "comment": "The XRAI app supports translation too!  100+ languages/dialects",
                    "score": 13,
                    "author": "domainkiller",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Exactly this. I live in Bulgaria and that would be a wonderful language learning tool.\n\nI use Google translate conversations a lot and it's good, but this would be awesome.",
                    "score": 6,
                    "author": "9102839109287356",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "this is the way",
                    "score": 10,
                    "author": "SigueSigueSputnix"
                },
                {
                    "level": 1,
                    "comment": "&gt; There's probably an even bigger market for using something like this for real-time language translation.\n\nThe glasses vendor's app does that already, yes. https://xrai.glass/app",
                    "score": 2,
                    "author": "Gusfoo"
                },
                {
                    "level": 1,
                    "comment": "Would be cool if it was an earpiece that interpreted and read back to the person.",
                    "score": 2,
                    "author": "fcbRNkat"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm curious how these would handle being in a situation where you are surrounded by a bunch of people carrying on individual conversations, like at a bar.",
            "score": 97,
            "author": "DUNG_INSPECTOR",
            "replies": [
                {
                    "level": 1,
                    "comment": "The person wearing them would probably see a lot of \"Check out this dickhead wearing sunglasses inside\"",
                    "score": 88,
                    "author": "slick1260"
                },
                {
                    "level": 1,
                    "comment": "I haven't used them but I work an AI. If there are sensors on each side of the head there should be some methods for filtering out different signal sources (people talking) and using an optimization function to try to single out the one that seems more important (loudest or most in-front of you). It wouldn't be as good as our natural ability to selectively focus on people talking but a well designed app should be able to filter out the person if you're nearby and both looking at each other.",
                    "score": 19,
                    "author": "Creative_Site_8791",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Probably using eye tracker to filter out what you don't want to \"hear\"",
                            "score": 1,
                            "author": "Cursed-Echo-5984"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "If it's anything like YouTube annotations it'll say \"foreign, \\[applause\\] and randomly\"incoherent mumbling\"",
                    "score": 19,
                    "author": "x_mutt_x"
                },
                {
                    "level": 1,
                    "comment": "You could pretty easily switch from omni directional microphone to a highly directional one (preferably integrated in the glasses). A small switch would do. Or even better, a sort of slider or adaptive software controller.",
                    "score": 8,
                    "author": "PN_Guin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The app lets you enable “noise cancellation” for exactly this scenario.",
                            "score": 6,
                            "author": "domainkiller",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Indeed! And select mic (glasses, phone, Bluetooth)",
                                    "score": 8,
                                    "author": "danscarfe",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "👋 Hi Dan! Love scrolling through reddit and randomly running into XRAI videos! \n\nFor anyone following along, Dan is the man who started it all, and can answer any questions.",
                                            "score": 2,
                                            "author": "domainkiller",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Hey thanks for all the help and support! This is our latest piece in case you missed it: https://m.youtube.com/watch?v=0r2YVbJRfAo",
                                                    "score": 2,
                                                    "author": "danscarfe"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What?  I didn’t say THAT.",
            "score": 366,
            "author": "Known-Economy-6425",
            "replies": [
                {
                    "level": 1,
                    "comment": "I didn’t day ‘I want to fuck you’, I said ‘I want to vacuum’",
                    "score": 168,
                    "author": "ConstantlySlippery",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You dead it, I heard you.",
                            "score": 23,
                            "author": "Known-Economy-6425"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I know this is joking, but auto-captioning is becoming more and more accurate. The talk to text people have on their phone isn't anywhere close to how accurate auto-captioning is in other platforms. It's really exciting from an accessibility standpoint!",
                    "score": 40,
                    "author": "Covert_Pudding",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I feel like the built in one's on the phone are intentionally bad so we don't question just how effective our phones actually are at listening to us.",
                            "score": 30,
                            "author": "blueghost47",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I hate that this makes so much sense, thanks!  😂🥲",
                                    "score": 15,
                                    "author": "Covert_Pudding",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I agree, human.",
                                            "score": 2,
                                            "author": "AbrocomaRoyal"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "We support 4 separate transcription engines so hopefully one that works well for everyone!",
                            "score": 5,
                            "author": "danscarfe"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is a looong time coming, we've had the technology for decades! But what an awesome help for the hearing challenged!",
            "score": 40,
            "author": "jesse-taylor",
            "replies": []
        },
        {
            "level": 0,
            "comment": "The Glasses are nReal Air, an already existing products. Can be connected to phones, laptops.. anything with USB C that allows video over usb c. I have a pair, fantastic for movies on trains/bus/flight.",
            "score": 94,
            "author": "CirianKnight",
            "replies": [
                {
                    "level": 1,
                    "comment": "For anyone else struggling to find a product with that name, the company changed their name to XReal.",
                    "score": 10,
                    "author": "Ath47"
                },
                {
                    "level": 1,
                    "comment": "I have a pair too, I wonder if it's an app you can get to work with it.",
                    "score": 3,
                    "author": "GhostCheese",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "This really looks like the babel fish, but without having a fish in the ear. Looking forward to getting a couple of these when my own hearing is slowly giving up, or renting a couple when going vacation.",
            "score": 15,
            "author": "BaneRiders"
        },
        {
            "level": 0,
            "comment": "Up next, small UK tech firm bought by Apple.",
            "score": 15,
            "author": "ketimmer"
        },
        {
            "level": 0,
            "comment": "That’s really incredible. I wonder what the lag is between the speech and the translation?",
            "score": 39,
            "author": "jsgolfman",
            "replies": [
                {
                    "level": 1,
                    "comment": "Between 1/2 second and 1 second",
                    "score": 10,
                    "author": "danscarfe",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s not too bad",
                            "score": 3,
                            "author": "jsgolfman",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Include this with hand sign(ASL) to speech on the glasses and then the user can communicate with most population who don't know ASL.\n\nThere have been projects for ASL to text conversation that use specialised gloves to do it. But here need to go one step further and convert text to audio from the glasses. Maybe machine learning coupled with video recognition of hand signs can be used to achieve this since you can't carry gloves everywhere.",
                                    "score": 1,
                                    "author": "pale-blue-dotter",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Life changing. Hope they aren’t too expensive.",
            "score": 145,
            "author": "Minx-Boo",
            "replies": [
                {
                    "level": 1,
                    "comment": "In the beginning, it's says it cost 485 USD, which is pretty agreeable if you ask me.",
                    "score": 156,
                    "author": "GinnAdvent",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s not bad. Hearing aids cost way more than that I think",
                            "score": 48,
                            "author": "CrunkestTuna",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My hearing aids are about $2000 each. I'm not sure of the exact price because my insurance actually covers them.",
                                    "score": 25,
                                    "author": "AuntiKrist",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I can believe that, they are very expensive for sure.",
                                            "score": 6,
                                            "author": "GinnAdvent",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I was just talking to my grandma and she said hers were $6k but she got them at Costco for $1500. She was thrilled to be able to hear the birds, I think she spent the whole week sitting on the porch listening.",
                                                    "score": 10,
                                                    "author": "swinging_ship",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yes, when it comes to medications and medical aids, Costco is the way to go because it's generally cheaper than anywhere else.\n\nI am glad your grandma is able to enjoy hearing properly again, we do take many basic things for granted until it's not there anymore.",
                                                            "score": 2,
                                                            "author": "GinnAdvent"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "That's less then most normal glasses for people with eyesight problems.",
                            "score": 7,
                            "author": "Coast_General",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "oh my internet acquaintance, I've got no affiliation but allow me to tell you of Zenni Optical I get my titanium framed impacted rated blue light blocking lense glasses for less than 150 USD  \nThere is another online seller that also seems reputable, but I haven't done business with them. Oh! and Zenni does discounts for certain groups (don't recall which one's other than EMS)",
                                    "score": 2,
                                    "author": "dscrive",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Walmart also is not owned by that near-monopoly, so they have good prices too.",
                                            "score": 2,
                                            "author": "HooptyDooDooMeister"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Really?\n\nI thought lens and frame are usually under 300 bucks, even if you don't have any insurance coverage.",
                                    "score": 2,
                                    "author": "GinnAdvent",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It depends on how bad your eyesight is and if you want scratch resistent and anti fog glasses also designer brands vs cheap ones. The lenses themselve can cost up to 800$ I think. Idk about the us but for some reason glasses themselves are seen as a luxury product (eventhough we have free healthcare) where I live so they can be pretty expensive.\n\nBut cheap glasses for farsighted people or reading glasses can be less then 50$",
                                            "score": 5,
                                            "author": "Coast_General",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I didn’t see that for some reason… thanks!",
                            "score": 2,
                            "author": "Minx-Boo"
                        },
                        {
                            "level": 2,
                            "comment": "They're $380. We also now support the Rokid Max",
                            "score": 2,
                            "author": "danscarfe"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "$485 sounds as expected. Wonder if insurance companies may cover costs like other aids",
                    "score": 12,
                    "author": "SevroAuShitTalker",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If they also have corrective lenses should be able to squeeze them in under optical insurance",
                            "score": 1,
                            "author": "dscrive"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Said under $500",
                    "score": 2,
                    "author": "jamesdaripper"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I interact with the Deaf and HH community a lot in my work and I’ve learned that there is a substantial faction that would likely resist anything like this. To them, there is nothing to cure or fix. They have their own language, they have their own culture. I think many would appreciate this in the professional setting, but I wouldn’t be surprised to see some comments from Deaf people saying they’re not interested in this.",
            "score": 31,
            "author": "illbebythebatphone",
            "replies": [
                {
                    "level": 1,
                    "comment": "People that lose their hearing over their lifetime might be the market for this.\n\nAlso live translation of foreign language for everyone.\n\nI think it has legs!",
                    "score": 27,
                    "author": "UsualCounterculture",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah for sure! Not saying this isn’t super useful, just that people shouldn’t be surprised if it’s not widely adopted by the Deaf HH community",
                            "score": 8,
                            "author": "illbebythebatphone",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah absolutely, similar to the cochlear implant situation. I'm sure people in this tech space are familiar with the deaf community and cultural views on their differences.",
                                    "score": 6,
                                    "author": "UsualCounterculture"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That's definitely true, but from that perspective this is a *big* step up from a chochlear implant. It's an accessibility device that doesn't really try to change the person, it's easy to use or put away as you see fit, and (*critically*) it doesn't have the problem of being much more successful if parents make the decision for their kid at a very young age.",
                    "score": 8,
                    "author": "Salanmander"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I hope they are better than YouTube captions.",
            "score": 9,
            "author": "TheChallengedDM",
            "replies": [
                {
                    "level": 1,
                    "comment": "Try it and see. It's a free download and doesn't require glasses to work",
                    "score": 2,
                    "author": "danscarfe"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not deaf but I could definitely use this if I ever travel to the UK. Although I doubt it would understand anyone in Scotland.",
            "score": 7,
            "author": "Zebracorn42",
            "replies": [
                {
                    "level": 1,
                    "comment": "It would show up like that gibberish on /r/ScottishPeopleTwitter",
                    "score": 2,
                    "author": "Samurai_Meisters"
                },
                {
                    "level": 1,
                    "comment": "Give it a wee try and see",
                    "score": 2,
                    "author": "danscarfe"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Transcribe Glass is coming out with a device that does this by attaching to any glasses for only $56!",
            "score": 7,
            "author": "CoastalCrave64",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Honestly, the most impressive thing to me in this video is that they maintain their regional accents even though they're hard of hearing/deaf. I imagine the people in this video aren't completely deaf, but it's still really interesting to see that accents still develop even when you can barely hear the people around you.",
            "score": 11,
            "author": "slick1260",
            "replies": [
                {
                    "level": 1,
                    "comment": "I had a teacher, mid forties, who went deaf at age seven in India. He spoke English with a British/Indian accent from his memories of learning as a child. \n\nI can't think of any Deaf people I've known that were born deaf and spoke much, we mostly use ASL. So I couldn't say for sure how much the accent of the audiologist affects the accent of a deaf person learning to speak with no prior experience hearing",
                    "score": 2,
                    "author": "One_for_each_of_you"
                },
                {
                    "level": 1,
                    "comment": "I am deaf from birth and my wife tells me I have just a touch of the Southern accent, which I presume is influenced by my speech therapists’s own accents.",
                    "score": 2,
                    "author": "pamakane",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh wow, that's really interesting. Crazy to see/learn just how much our speech patterns mimic those around us even if it's just from watching and repeating the mouth movements.",
                            "score": 2,
                            "author": "slick1260"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ahhh, thought those looked like Nreal Air's. Pretty sure XRAI is just the app.\n\nSource: I have a pair of Nreal Air's",
            "score": 3,
            "author": "mawkdugless",
            "replies": [
                {
                    "level": 1,
                    "comment": "We are the app. Download and try! Be sure to check out AR subtitles as you have Xreal",
                    "score": 3,
                    "author": "danscarfe"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Weebs: Finally my time has come.",
            "score": 3,
            "author": "Error404Cod"
        },
        {
            "level": 0,
            "comment": "I wonder how they handle crowded rooms? Or multiple speakers like a group?",
            "score": 3,
            "author": "Ok-Entertainment1123"
        },
        {
            "level": 0,
            "comment": "Now they'll think you're blind AND deaf",
            "score": 3,
            "author": "pariah89"
        },
        {
            "level": 0,
            "comment": "i have theses glasses, it's a USB-C screen, with software you can do whatever you want with it, XReal Air glasses, not originaly made for deaf people but nice way to use thoses",
            "score": 6,
            "author": "EagleFire4",
            "replies": [
                {
                    "level": 1,
                    "comment": "We actually support full AR mode not just screencast so you can pin subtitles in 3D space, move forwards and backwards etc",
                    "score": 5,
                    "author": "danscarfe"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My hearing is declined but I'm not deaf. I would however pay 500 bucks for some of these that are clear worksite ANSI glasses that could do spanish and then maybe even move up to translating. Would be awesome",
            "score": 5,
            "author": "BossWu52",
            "replies": [
                {
                    "level": 1,
                    "comment": "We support translation from 75+ languages and  140+ dialects",
                    "score": 4,
                    "author": "danscarfe",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "So now we just need a companion pair that converts sign language to text.",
            "score": 2,
            "author": "Shawaii",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I was stupid and figured that the display would be sign language.",
            "score": 2,
            "author": "AusCan531"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "They can indeed. Check out our partner Lensology",
                    "score": 2,
                    "author": "danscarfe"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is just reminding me of the Seinfeld scene with the deaf woman... just waiting for an oops with the misread of six lol... Still tho this is actually awesome and hope it becomes accessible to all!",
            "score": 2,
            "author": "CraftierAverage"
        },
        {
            "level": 0,
            "comment": "Someday people will have microchips in their brain that translates any language into their own.",
            "score": 2,
            "author": "ionertia"
        },
        {
            "level": 0,
            "comment": "What will Big Deaf think of these, they thought Cochlear ear implants were an attack on deaf culture",
            "score": 2,
            "author": "goseephoto",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nyeah, not gonna go over well",
                    "score": 2,
                    "author": "Squadooch"
                }
            ]
        },
        {
            "level": 0,
            "comment": "i wonder if it could utilize the same tech and do instant translations for foreign language",
            "score": 2,
            "author": "futurespacecadet"
        },
        {
            "level": 0,
            "comment": "With these, the weebs can go to Japan",
            "score": 2,
            "author": "Niisama6928"
        },
        {
            "level": 0,
            "comment": "Is it a glasses that provide subtitles? I'D COP THAT",
            "score": 2,
            "author": "MoneyTruth9364"
        },
        {
            "level": 0,
            "comment": "oh this is sick",
            "score": 2,
            "author": "DoctorBattlefield"
        },
        {
            "level": 0,
            "comment": "I am pretty sure that these would only be of use to people who became deaf later in life. My son who has been deaf from birth just lip reads and can do so at quite a distance, although he was annoyed on holiday in turkey as he couldn't lip read the people in the road side cafes from the bus, until I pointed out they were speaking in Turkish",
            "score": 2,
            "author": "Pafkay",
            "replies": [
                {
                    "level": 1,
                    "comment": "Jeez, I feel like moving to a new country and needing to relearn how to lipread would be especially difficult.",
                    "score": 2,
                    "author": "ironhide_ivan",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "All fun and games until it starts picking up conversations and no one is around 😐👻",
            "score": 2,
            "author": "Dot-Inc"
        },
        {
            "level": 0,
            "comment": "When I visit mi Ireland friends these would come very useful.",
            "score": 3,
            "author": "soldier_18"
        },
        {
            "level": 0,
            "comment": "Pretty cool dude",
            "score": 2,
            "author": "Training_Frosting_53"
        },
        {
            "level": 0,
            "comment": "I am deaf and i hate this idea",
            "score": 0,
            "author": "voooidt",
            "replies": [
                {
                    "level": 1,
                    "comment": "Why is that?",
                    "score": 5,
                    "author": "uchman365",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Its because the deaf uses vision to see and hear, this sunglasses may be obstructing the view and probably causing the eye strain, also imagine using this in the busy restaurant,itll become annoying, even if someone spoke to me with this glasses,i wouldnt know which direction its from.",
                            "score": 4,
                            "author": "voooidt",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "These are off the shelf AR glasses. They might need a tint to contrast the AR layer, but it probably doesn't have to be very dark to do that. I know some AR glasses are untinted, or at least very transparent.\n\nSeems like AR could provide a direction indicator and potentially a range vector to a speaker if there's stereo audio pickup.\n\nAnd if it had range, a feature could be to limit translation to a specific range, or select specific speakers by vector to include or remove.",
                                    "score": 1,
                                    "author": "AspieWithAGrudge"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "YEAH SCIENCE",
            "score": 1,
            "author": "CrunkestTuna"
        },
        {
            "level": 0,
            "comment": "Man this should already exist in a way more sophisticated version for at least 10 years, but the sad reality is, the market is too small so big tech doesnt care.",
            "score": 1,
            "author": "WeAreNotAlone1947"
        },
        {
            "level": 0,
            "comment": "Cool af",
            "score": 1,
            "author": "Vinnie1103"
        },
        {
            "level": 0,
            "comment": "As interesting as these glasses are and they definitely are interesting\n\ni think its more interesting that the heavily deaf still have british accents",
            "score": 1,
            "author": "Xostean"
        },
        {
            "level": 0,
            "comment": "As someone with congenital anosmia this stuff is alll fascinating. \n\nHopefully I get my smell aides one day",
            "score": 1,
            "author": "sixtus_clegane119"
        },
        {
            "level": 0,
            "comment": "Finally weabos will be able to go to Japan and there will be subtitles",
            "score": 1,
            "author": "Avversariocasuale"
        },
        {
            "level": 0,
            "comment": "Why wasn’t this out 20 years ago?",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Can it translate indian tech support?",
            "score": 1,
            "author": "Boostlagg"
        },
        {
            "level": 0,
            "comment": "Nah. \n\nIt's not the Deaf's job to keep accommodating hearing people who refuse to learn sign language.",
            "score": -10,
            "author": "wuvvtwuewuvv",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Subtitles when the wearer speaks: “Id bal blegh dbla! Du bldaa belee”\n\nSorry. Not sorry.",
            "score": -1,
            "author": "Free_Stick_"
        },
        {
            "level": 0,
            "comment": "This is a great invention. I appreciate how, sometimes,  even after scrolling through the really creepy and dark side of the internet, one can see some beautiful stuff like this. Amazing!!!",
            "score": 1,
            "author": "really-sad-therapist"
        },
        {
            "level": 0,
            "comment": "Crazy",
            "score": 1,
            "author": "Tasty_Difference6529"
        },
        {
            "level": 0,
            "comment": "Awesome invention!",
            "score": 1,
            "author": "NumerousTaste"
        },
        {
            "level": 0,
            "comment": "These are so cool!!! What a fantastic idea. And I would think they could be used for real time translations as well.",
            "score": 1,
            "author": "ThunderChild247",
            "replies": [
                {
                    "level": 1,
                    "comment": "They do! 75+ languages",
                    "score": 1,
                    "author": "danscarfe"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I wouldn't expect \"Why can't we subtitle the world?\" to be said in any other accent.",
            "score": 1,
            "author": "durtygrillz"
        },
        {
            "level": 0,
            "comment": "brilliant",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Holy crap....if they couple that with a translation app, that would be an absolute game changer!",
            "score": 1,
            "author": "SenseiR0b",
            "replies": [
                {
                    "level": 1,
                    "comment": "75+ languages already!",
                    "score": 2,
                    "author": "danscarfe"
                }
            ]
        },
        {
            "level": 0,
            "comment": "But they can’t do that for all videos on YouTube/TikTok/etc. smh",
            "score": 1,
            "author": "youmotherfudger"
        },
        {
            "level": 0,
            "comment": "These stories are awesome and show how technology can change peoples lives for the better.   With the story of the paraplegic being able to walk the other day its a wonderful time.",
            "score": 1,
            "author": "sabarock17"
        },
        {
            "level": 0,
            "comment": "This is slick but don't lose the ability to lip-read. That skill alone is very powerful to have",
            "score": 1,
            "author": "alumana005"
        },
        {
            "level": 0,
            "comment": "that's awesome",
            "score": 1,
            "author": "jesseg010"
        },
        {
            "level": 0,
            "comment": "I absolutely love this",
            "score": 1,
            "author": "devgayflor"
        },
        {
            "level": 0,
            "comment": "I need a pair of those\n\nCan I get them in oakleyz style",
            "score": 1,
            "author": "triple3ogies"
        },
        {
            "level": 0,
            "comment": "invest. in. this.",
            "score": 1,
            "author": "jhoeksma1",
            "replies": [
                {
                    "level": 1,
                    "comment": "DM me 🙂",
                    "score": 1,
                    "author": "danscarfe"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I read about these in Physics of the Future by Michio Kaku in 2009. It's crazy to see how accurate that book has become.",
            "score": 1,
            "author": "ar_zee"
        },
        {
            "level": 0,
            "comment": "Ok so how is this working in social settings or parties where multiple voices can be heard at once ?",
            "score": 1,
            "author": "extremum_spiritum"
        },
        {
            "level": 0,
            "comment": "Deaf people have been told this was too expensive for years. We can finally include the hearing impaired!",
            "score": 1,
            "author": "renovatioUP"
        },
        {
            "level": 0,
            "comment": "They have an app for Android and iOS as well. I tried to use it, but to do so, you have to log in with one of your social media accounts. No other signup options are possible, and testing is available without doing so.\n\nI have emailed their support about this issue.",
            "score": 1,
            "author": "DevCatOTA",
            "replies": []
        },
        {
            "level": 0,
            "comment": "\"She said sweep together, you idiots!\"",
            "score": 1,
            "author": "WeathervaneJesus1"
        },
        {
            "level": 0,
            "comment": "#F U T U R E",
            "score": 1,
            "author": "Cosmicking04"
        },
        {
            "level": 0,
            "comment": "Great invention 👍🏻",
            "score": 1,
            "author": "Timble79"
        },
        {
            "level": 0,
            "comment": "Now combine this with actually good real time AI auto translated printout so you can understand anyone on the planet.",
            "score": 1,
            "author": "Timberwolf_88"
        },
        {
            "level": 0,
            "comment": "Yeah the last thing I'm going to do with these is use a sharp knife.",
            "score": 1,
            "author": "oversoul00"
        },
        {
            "level": 0,
            "comment": "This. This is the shit we should be doing with tech.",
            "score": 1,
            "author": "MtalGhst"
        },
        {
            "level": 0,
            "comment": "These glasses are $379 on Amazon. Reviews are either amazing or garbage, I guess it depends on your phone.",
            "score": 1,
            "author": "Oranginafina"
        },
        {
            "level": 0,
            "comment": "That is really interesting",
            "score": 1,
            "author": "sentientlob0029"
        },
        {
            "level": 0,
            "comment": "Look at AI finally not destroying something good",
            "score": 1,
            "author": "CorellianDawn"
        },
        {
            "level": 0,
            "comment": "This doesn't even need to be for just deaf people. I'm hard of hearing in my right ear, I hate asking others to repeat themselves. I always have subtitles on TV so I can make sure I heard it right.",
            "score": 1,
            "author": "NoMercyJon"
        },
        {
            "level": 0,
            "comment": "How would this work in a hospital with a lot of white noise? I could use one of em as I can be hard of hearing when there's a lot og white noise",
            "score": 1,
            "author": "beltalowda_oye"
        },
        {
            "level": 0,
            "comment": "Google Glass missed a great opportunity.",
            "score": 1,
            "author": "littleMAS"
        },
        {
            "level": 0,
            "comment": "Anyone know if there are effects on one’s eyesight from reading words on the glasses? I’m already having eye strain and headaches from using my phone too much. Wondering if having to focus on words only an inch from your eyes would cause any vision changes?",
            "score": 1,
            "author": "friendofelephants",
            "replies": [
                {
                    "level": 1,
                    "comment": "The words appear at whatever depth you set, from 0.5m to 12m. You can also pin next to the person talking and they will stay locked at the same focal point",
                    "score": 1,
                    "author": "danscarfe",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh wow, I had no idea. I thought the focal point would be less than an inch from your face. So, if your television is 2.5 meters away, you could set the focal point to be 2.5 m and it would appear that the subtitles are on the screen so your eyes wouldn't have to keep refocusing?\n\nThis is like my lifelong dream of being able to read a book without using my hands (I'm very lazy).",
                            "score": 1,
                            "author": "friendofelephants",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is so cool! I can just imagine how wonderful this is for deaf people to have!",
            "score": 1,
            "author": "myownzen"
        },
        {
            "level": 0,
            "comment": "These glasses are just a generalist heads up display glasses (of which I own a pair)  \n\nthey must have a voice to text app designed to use them. \n\nGood application.",
            "score": 1,
            "author": "GhostCheese",
            "replies": [
                {
                    "level": 1,
                    "comment": "They're actually full 3DOF with head tracking so you can pin/move the subtitles around in 3D space",
                    "score": 1,
                    "author": "danscarfe"
                }
            ]
        },
        {
            "level": 0,
            "comment": "John Fetterman needs a pair of these asap.",
            "score": 1,
            "author": "Gloworm02",
            "replies": [
                {
                    "level": 1,
                    "comment": "We've been trying to send him a pair!",
                    "score": 2,
                    "author": "danscarfe"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Shut up and take my money: does it do translate as well. I cannot tell you how sick I am of not being understood in Spanish when I am fluent in English in a third world country! \nMy gosh this would be a game changer for many people, not just deaf people (but congratulations to them too for such an awesome discovery for them)",
            "score": 1,
            "author": "Apocalyptiana",
            "replies": [
                {
                    "level": 1,
                    "comment": "Perhaps don’t call them a 3rd world country when you first use it with them… ;)",
                    "score": 1,
                    "author": "DCINTERNATIONAL"
                }
            ]
        },
        {
            "level": 0,
            "comment": "In case anyone wants to see a more up to date video, check out this story the BBC did last week: https://m.youtube.com/watch?v=0r2YVbJRfAo",
            "score": 1,
            "author": "danscarfe"
        },
        {
            "level": 0,
            "comment": "Oh my god, that’s so fucking cool",
            "score": 1,
            "author": "nick1812216"
        },
        {
            "level": 0,
            "comment": "As a 69 year old former hard rock drummer, I'm interested",
            "score": 1,
            "author": "MpVpRb",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This is awesome!",
            "score": 1,
            "author": "Eloy89"
        },
        {
            "level": 0,
            "comment": "This. Is. Incredible.",
            "score": 1,
            "author": "AbrocomaRoyal"
        },
        {
            "level": 0,
            "comment": "Wow! Just wow!",
            "score": 1,
            "author": "OBDreams"
        },
        {
            "level": 0,
            "comment": "Why would she not want to look at you? lol",
            "score": 1,
            "author": "MastersonMcFee"
        },
        {
            "level": 0,
            "comment": "So I can just wrar these in Japan and not have to learn to speak Japanese? Lol",
            "score": 1,
            "author": "Sixdrugsnrocknroll"
        },
        {
            "level": 0,
            "comment": "this is pretty cool honestly.",
            "score": 1,
            "author": "SuperToxin"
        },
        {
            "level": 0,
            "comment": "I had a friend some 30 years ago who was hard of hearing, and despite my bungled attempts to learn ASL we still had communication difficulties.  Something like this would've been a game changer.  I am kind of blown away by the reality of these glasses now existing.",
            "score": 1,
            "author": "Twisted_Bristles"
        },
        {
            "level": 0,
            "comment": "That's dope. I wonder if health insurance will cover it.",
            "score": 1,
            "author": "PoeticalPoltergeist"
        },
        {
            "level": 0,
            "comment": "Just amazing",
            "score": 1,
            "author": "UpgrayeDD405"
        },
        {
            "level": 0,
            "comment": "INB4 these start to become casual attire for anime neckbeards when travelling to Japan.. The power of god and anime is amongst us.",
            "score": 1,
            "author": "fallendiscrete"
        },
        {
            "level": 0,
            "comment": "Remember when they told us not to stand too close to the TV it'll ruin our eyes? Now our phones are always in our faces and there's glasses we can attach to our faces with screens projecting words. I can't wait to see what people come up with next. Only thing left is beaming thought into our minds",
            "score": 1,
            "author": "Lopsided_Rooster_753"
        },
        {
            "level": 0,
            "comment": "/u/savevideo",
            "score": 1,
            "author": "Goingbacktobasic",
            "replies": [
                {
                    "level": 1,
                    "comment": "###[View link](https://rapidsave.com/info?url=/r/interestingasfuck/comments/13zmhui/these_glasses_that_subtitles_live_conversation/)\n\n\n --- \n [**Info**](https://np.reddit.com/user/SaveVideo/comments/jv323v/info/)&amp;#32;|&amp;#32; [**Feedback**](https://np.reddit.com/message/compose/?to=Kryptonh&amp;subject=Feedback for savevideo)&amp;#32;|&amp;#32;[**Donate**](https://ko-fi.com/getvideo) &amp;#32;|&amp;#32; [**DMCA**](https://np.reddit.com/message/compose/?to=Kryptonh&amp;subject=Content removal request for savevideo&amp;message=https://np.reddit.com//r/interestingasfuck/comments/13zmhui/these_glasses_that_subtitles_live_conversation/) &amp;#32;|&amp;#32; \n [^(reddit video downloader)](https://rapidsave.com) &amp;#32;|&amp;#32; [^(twitter video downloader)](https://twitsave.com)",
                    "score": 1,
                    "author": "SaveVideo"
                }
            ]
        }
    ]
}