{
    "id": "1404mf4",
    "score": 73883,
    "title": "Never Forget what happened in China 34 years ago: Remembering the fearless Demonstrators at the 1989 Tiananmen Square Protests",
    "author": "lshic",
    "date": 1685862691.0,
    "url": "https://www.reddit.com/r/interestingasfuck/comments/1404mf4",
    "media_urls": [
        "https://i.redd.it/jo8rpnxbby3b1.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\n**This is a heavily moderated subreddit. Please note these rules + sidebar or get banned:**\n\n\n* If this post declares something as a fact, then proof is required\n* The title must be fully descriptive\n* No text is allowed on images/gifs/videos\n* Common/recent reposts are not allowed (posts from another subreddit do not count as a 'repost'. Provide link if reporting)\n\n*See [this post](https://redd.it/ij26vk) for a more detailed rule list*\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/interestingasfuck) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Hongkonger here, I remember in 2019 my school's principal invited a Hong Kong journalist who was at Tiananmen Square in 1989 for a talk back when the Hong Kong protests were still going on.\n\nHe showed us photos of people shot and half ran over bodies and spoke about how he was just short enough to dodge the shots from the military as the soldiers aimed at the general height where people's heads were, so the shots went over his head instead. He told us how he hid in a public bathroom and only popped out from the roof of it to take video footage. He was later smuggled out of Beijing onto the last flight leaving the city by other Chinese protesters in the back of a van, he mentioned how people were protecting the foreign journalists so that the world could see what was happening.\n\n[I wrote about how the military units in Beijing mutinied and refused to deploy, as well as the workers forming human shields in this other comment if you're interested.](https://www.reddit.com/r/interestingasfuck/comments/1404mf4/never_forget_what_happened_in_china_34_years_ago/jmupxsf)\n\nI'll never forget 13 year old me looking at the collection of photos he took, how deep it was imprinted into my mind. We were taught about the Tiananmen Square Massacre by some of our teachers since primary school, but the brutal nature of it was never visualised until that day.\n\nAfter 2019 many Hong Kong teachers resigned, and I remember studying about modern Chinese history last year, only to see a few short sentences mentioning the massacre as the \"June Forth Incident\" or \"June Forth Movement\". You could feel the self-censorship in the atmosphere of the general public. The teacher who taught me about Tiananmen in primary school had already moved to another country.\n\nOur school was called out by a CCP official and former HK chief executive later on for a separate incident when we protested on school grounds and the principal resigned for us to take responsibility and emigrated. He claimed it was his own decision and that he was planning to do so anyways, but I think deep down we all know he did it to protect us. Principal Cheng, I'm sorry we failed you.\n\nMay the dead rest in peace, I hope that China will be free one day.\n\n[The song Flower of Freedom commemorates the 1989 Tiananmen Massacre, it's sung in Cantonese and is one of the most famous songs about the crackdown. Give it a go.](https://youtu.be/NPcD_2x2oW0)",
            "score": 3698,
            "author": "saltedballsack",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you, Saltedballsack",
                    "score": 2183,
                    "author": "Maximans",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What a rollercoaster Reddit is…",
                            "score": 463,
                            "author": "cuiront",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "was*, definitely going to miss this place.",
                                    "score": 32,
                                    "author": "retro_grave",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Where are you going though ? 4chan?",
                                            "score": 9,
                                            "author": "Tomick",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You made me laugh during a cry. Humour does not necessarily detract from these atrocities, but helps to bear them.",
                            "score": 193,
                            "author": "DeltaNovum",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Much love man",
                                    "score": 11,
                                    "author": "Alternative-Stop7426"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "/r/rimjob_steve",
                            "score": 92,
                            "author": "ThetaDee",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's r/rimjob_steve",
                                    "score": 39,
                                    "author": "Own-Mountain3540",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Lmfao such a goofy name for such a somber story.",
                            "score": 11,
                            "author": "immaZebrah"
                        },
                        {
                            "level": 2,
                            "comment": "Why was his comment removed?!?!",
                            "score": 10,
                            "author": "vei_n",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Removed :( What did it say?",
                            "score": 8,
                            "author": "coldhandses",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[here](https://www.reddit.com/r/rimjob_steve/comments/140ego6/remembering_the_tiananmen_square_massacre/?utm_source=share&amp;utm_medium=android_app&amp;utm_name=androidcss&amp;utm_term=1&amp;utm_content=share_button)",
                                    "score": 9,
                                    "author": "usarukin",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "u/Saltedballsack\n\n\n\nEdit: he made a post if you wanna check what he said",
                            "score": 3,
                            "author": "Rulebreaking"
                        },
                        {
                            "level": 2,
                            "comment": "Anddddd it was removed\n\n/u/saltedballsack",
                            "score": 3,
                            "author": "Alltwek",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I think Principal Cheng would be happy to know the lessons you learned have not stopped you from speaking up against the CCP's bullshit",
                    "score": 150,
                    "author": "eltoritoloco",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I hope so, even though I do admit I still regret it. In hindsight if we were more considerate of the school's position maybe he would still be here, but it's the past, nothing we can do about it now but stay strong and remember everything.\n\nEdit: My comment got removed with no reason nor notification, click here to read the original comment.\n\nhttps://www.reddit.com/user/saltedballsack/comments/140klms/mom_im_famous_jokes_aside_thank_you_all_for/jmwtie0",
                            "score": 54,
                            "author": "saltedballsack",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Heroes smile knowing they set in motion the events that one day will change the world. Not because of the perceived failings. Smile because he's fought in through you.",
                                    "score": 27,
                                    "author": "Peakomegaflare",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thanks for the wholesome comment, it does make me feel better. Principal Cheng is doing well despite his numerous health conditions, and I truly wish he's proud of what he's done. I do hope the change you described will happen in China one day.\n\nOne day.",
                                            "score": 24,
                                            "author": "saltedballsack"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Just so you know an admin or mod rmoved your first comment, you can see its rmoved if you log out.\n\nOthers: you can see the comment in their user history.",
                                    "score": 7,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The lessons and stories learned under Principal Cheng just reached thousands upon thousands of people. I think you made him proud.",
                    "score": 43,
                    "author": "Hereseangoes",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I do hope so. He's in a better country now, and I hope that he realises how much he has taught his students. He is still highly respected in the school and many bid him farewell on his last day.\n\nI still have contact with his son who also studied in my school, he's doing well even with his health problems. The least I can do for him now is to write about his efforts and lessons and share it with everyone else.\n\nThanks for the comment, truly, it does make me feel better. :)",
                            "score": 32,
                            "author": "saltedballsack"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Fuck the CCP. Thank you for sharing and my condolences at your losses of freedom. May China one day be free of authoritarianism, censorship and government violence against its people.",
                    "score": 17,
                    "author": "Helpful-Owl-1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks for reading. Glory to the people!",
                            "score": 11,
                            "author": "saltedballsack"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Fuck the CCP, I too hope for your wonderful country of China, with an illustrious history which the CCP too destroyed back in the 50's-60's, be free again once more.",
                    "score": 169,
                    "author": "oggie389",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I've already moved to Australia, I'm planning to join the reserves in the military for training after I graduate university. If China lays their hands on Taiwan or even Australia in an unfortunate war, I wish to help defend them from the CCP. I sometimes imagine how a democratic China would look in an alternate universe, and it saddens me how it's gone in reality.\n\nAt least 8 Hongkongers were arrested today for commemorating the Tiananmen Square Massacre under various charges, from disturbing the peace to sedition under the National Security Law. It's hard to voice out publicly in Hong Kong nowadays without risking arrest.\n\nGlory to Hong Kong! Glory to the Chinese people! Even if I don't get to see a free China in my lifetime, I do believe it will happen in the future. Afterall, the CCP is just like a dynasty in the history of China － and all dynasties will eventually fall.\n\nEdit: My comment got removed with no reason nor notification, click here to read the original comment.\n\nhttps://www.reddit.com/user/saltedballsack/comments/140klms/mom_im_famous_jokes_aside_thank_you_all_for/jmwtie0",
                            "score": 162,
                            "author": "saltedballsack",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "A democratic China might as well look like South Korea or Japan. You would be a major culture exporter if not for dumbass regulations on media. Anime and Kpop KDrama are world renowned, chinese media could be too if it wasn't suppressed so much. So much culture and potential all wasted.",
                                    "score": 6,
                                    "author": "bgi123",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I thought so too. Imagine how influential and powerful China could've been while being liked by other countries, but instead they chose to be a dickhead to every neighbour and their own people.",
                                            "score": 3,
                                            "author": "saltedballsack"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It is my life mission to shit on Xi",
                            "score": 33,
                            "author": "Realistic-Item4599",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My wife is from Hong Kong, we still have family there. I hope things get better.\n\nAdd oil.",
                    "score": 10,
                    "author": "vkapadia",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "&gt; I hope that China will be free one day.\n\nIndeed.",
                    "score": 37,
                    "author": "Anomalous-Entity"
                },
                {
                    "level": 1,
                    "comment": "I was in Hong Kong shortly after the protest. Hong Kong protested too. I watched the Hong Kong protest from the 2nd floor of a Pizza Hut. Marchers for several hours. I heard there were over 300,000 people on Hennesey Road in Central. I'd believe it. They were mostly showing solidarity after what China had done but protesters were also upset because the lease was due to revert in less than a decade to China.\n\nI got quite a few pictures. As long as I'm alive I won't forget.",
                    "score": 33,
                    "author": "SpringsGamer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "We learned about the protests in Hong Kong too from our veteran teachers. My school was one of the first ones to hold a strike after June 4, along with many other schools in Hong Kong. I'm glad Hong Kong was able to hold out for a while as the last bastion where some form of freedom of expression resembled.\n\nIs it fine if you share the pictures with me in DMs? I'd like to keep it archived too and I'd greatly appreciate seeing them with my own eyes. I wasn't born in 1989 and the photos and videos I've seen were mostly from the news.",
                            "score": 14,
                            "author": "saltedballsack"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Wow! Talk about core memory. Thanks for sharing",
                    "score": 7,
                    "author": "Starky_Love",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And thanks for reading, I hope this stays in your memory as well.",
                            "score": 6,
                            "author": "saltedballsack",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Mark this my first time crying at a Reddit post",
                    "score": 13,
                    "author": "GreenCardinal010",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Have a hug🫂",
                            "score": 8,
                            "author": "saltedballsack"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Amen.\n\n\nNot hate, but a message of hope for the better, impressive.",
                    "score": 3,
                    "author": "PantaReiNapalmm"
                },
                {
                    "level": 1,
                    "comment": "Can someone explain the difference between China and Hong Kong? Is Hong Kong it’s own thing?",
                    "score": 3,
                    "author": "OrganicLFMilk",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The People's Republic of China is a country. Hong Kong Special Administrative Region is a city that's currently under Chinese rule after it was handed over from the British in 1997, and before that Hong Kong was a British crown colony.\n\nChina promised that Hong Kong could keep its status quo for 50 years in the handover, assuring that no major political changes would be made before 2047. However, again and again China has encroached onto Hong Kong's promised autonomy, such as the attempt to implement [Article 23 in 2003](https://en.m.wikipedia.org/wiki/Hong_Kong_Basic_Law_Article_23), the [electoral reforms pushed by the central government in 2014](https://en.m.wikipedia.org/wiki/2014_Hong_Kong_protests) and the recent [attempt to pass the Extradition Bill and the forceful implementation of the Hong Kong National Security Law by the central government](https://en.m.wikipedia.org/wiki/2019%E2%80%932020_Hong_Kong_protests).",
                            "score": 11,
                            "author": "saltedballsack",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "so if no military operation or major political changes happen before 2047, hong kong has to  allow itself to be assimilated into china?  Thats wild if so.",
                                    "score": 4,
                                    "author": "spam99",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Legally, yes. The terms were so bad that even Thatcher herself regretted not seeking a better deal with China. I like to imagine an alternate universe where Hong Kong had a better deal signed and didn't have to deal with this shitstorm.",
                                            "score": 7,
                                            "author": "saltedballsack"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I always love how they keeps twisting the past to the point it becomes the opposite of what it originally is.\nMost protests ends up being called terrorist actions, civilians were gunned down then be call traitors, terrorists...",
                    "score": 3,
                    "author": "cowmij",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Indeed. In Chinese history textbooks the Tiananmen Square protests were labelled as a criminal insurrection against the glorious party's rule causing instability. Many Chinese words were banned on Chinese web browsers like 十有八九 since \"八九\" means \"89\", and one line of the national anthem was also banned as it said \"Arise! Those who refuse to be slaves!\" and was used as a protest slogan during the recent covid lockdown protests in China named A4 Revolution.",
                            "score": 7,
                            "author": "saltedballsack"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "They weren't fearless, they were terrified, but they went anyway because it matters.",
            "score": 6773,
            "author": "MrECoyne",
            "replies": [
                {
                    "level": 1,
                    "comment": "They were courageous",
                    "score": 2415,
                    "author": "Slugger_monkey",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I can only ever hope to be partly as courageous as these people were. I do believe (at least a part of) the courage came from somewhere. We as human beings are supposed to be part of a whole. A community which we can believe in and depend upon. I believe this is something we can extract great courage from. But we've been learning that many of the things that should be the responsibility of a whole is now the responsibility of the individual. Things like 'carbon footprint', not meddling when others are abused, our mental health and well being, our socioeconomic state etc. Putting more value into the former is what makes these courageous acts possible. In our current climate we lack action because as individuals most of us are well off enough, not to be bothered enough. I dream of becoming a small part of a whole. That's what I'd fight for.",
                            "score": 49,
                            "author": "DeltaNovum",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 364,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "We all knew what they meant, when you bring your own laundry to air out using this you diminish the focus on what they did.",
                                    "score": 119,
                                    "author": "Daniel_TK_Young",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "That escalated quickly",
                                    "score": 56,
                                    "author": "Han_Over",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "and ended ... this way. [Posing in the aftermath](https://www.reddit.com/r/HistoryPorn/comments/13horp9/soldier_posing_with_machine_gun_tiananmen_square/)",
                                            "score": 69,
                                            "author": "LinguoBuxo"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "As I think it was written in \"Coraline\", bravery is being afraid, but doing it anyway. They were so brave and no amount of propaganda should erase them from our memory ever.",
                    "score": 425,
                    "author": "clouddevourer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Exactly like Bran’s conversation with Ned in A Game of Thrones\n\n&gt; Bran: “Can a man still be brave if he’s afraid?”\n\n&gt;Eddard: “That is the only time a man can be brave.”",
                            "score": 281,
                            "author": "comrade_batman",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "A similar theme/quote:  \n\n\n\"Courage is being scared to death, but saddling up anyway.\" \\~John Wayne",
                                    "score": 8,
                                    "author": "BonsaiDiver",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "This post won't last five hours... It will be taken down. Reddit took $300 million from Tencent. Do the math",
                            "score": 109,
                            "author": "VW_wanker",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "2 hours and counting!",
                                    "score": 63,
                                    "author": "blackteashirt",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Ah yes, 300 million dollars out of 6 billion dollars valuation gives you absolute control of a company and you can remove inconsequential posts just because you don't like it.",
                                    "score": 38,
                                    "author": "papasmurf255",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Six hours now and there's literally a tiennamen square post on /r/all at least once a month. You're a fucking idiot.",
                                    "score": 32,
                                    "author": "hairlessgoatanus",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "It’s more than 6 hours and it was the top post in all for me.",
                                    "score": 6,
                                    "author": "wagsman"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Guy on the bike when asked why he was going to Tiananmen:\n\n\"it's my duty!\"\n\nHeroes, all of them.",
                    "score": 156,
                    "author": "ShareYourIdeaWithMe",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "“Why don’t you ask the kids at Tiananmen Square, was fashion the reason why they were there?”",
                    "score": 65,
                    "author": "calxlea",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "SOAD is a big reason why I even knew Tianaanmen even existed. And I'll never forget because of them. Which is exactly what they're going for.",
                            "score": 31,
                            "author": "LegendOfDeku"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "We should also remember an event even worse than Tiananmen: the entire God damn cultural revolution.",
                    "score": 101,
                    "author": "ormagoisha",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "the hundred flowers campaign in the 50s gets me on how manipulative and deceitful it was. people waited years before answering requests for criticism under the new free speech rules, then replied and they were all punished for criticising the government. so this is just before the great famine which was before the cultural revolution. after 1984, they apparently used \"Cultural Revolution-style\" tactics, including \"reversing black and white, exaggerating personal offenses, taking quotes out of context, issuing slander and lies ... inundating the newspapers with critical articles making me out to be an enemy, and casual disregard for my personal freedoms.\" sounds familiar honestly.\n\ne. oh apologies, i meant after 1989, as in Tiananmen.",
                            "score": 96,
                            "author": "Cynscretic",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They ended up eating their own children after idiotic policies created an agricultural disaster.",
                                    "score": 18,
                                    "author": "theitgrunt",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "they did. it was just after they removed all the academics and experts from any position of influence for criticising ideas that would lead to such policies.",
                                            "score": 23,
                                            "author": "Cynscretic",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Interesting, because that sounds a lot like what occurs today. Many experts are fed up with the misinformation and either leave or are forced out",
                                                    "score": 17,
                                                    "author": "bearbarebere",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You mean where China purged anyone not of the Ethic Han? And murdered 50,000,000+ people? What horrific unjustified evil.",
                            "score": 3,
                            "author": "STOP_CHINA"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "terrified enemies are some of the worst because they’ll stop at nothing to win",
                    "score": 8,
                    "author": "877-Cash-Meow"
                },
                {
                    "level": 1,
                    "comment": "Courage is not lack of fear. Courage is confronting fear.",
                    "score": 9,
                    "author": "LaPlimbare"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The outcome - the lack of change, the lack of transparency, the lack of justice, the lack of actually caring about anything - has always been so disappointing, in every way.",
            "score": 3398,
            "author": "jiaxingseng",
            "replies": [
                {
                    "level": 1,
                    "comment": "This. Some unaware shitheads will say “well what are you doing about it?”\n\nTalking about it is an act of protest. Never forget.",
                    "score": 1334,
                    "author": "ThisOnePlaysTooMuch",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They call it slacktivisim to discourage it.",
                            "score": 479,
                            "author": "RowdyWrongdoer",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Mike Shinoda’s take holds up:\n\n“Healing the blind, I promise to let the sun in\n\nSick of the dark ways we march to the drumming\n\nJump when they tell us that they wanna see jumping\n\nFuck that, I wanna see some fists pumping\n\nRisk something, take back what's yours\n\nSay something that you know they might attack you for\n\n'Cause I'm sick of being treated like I had before\n\nLike it's stupid standing for what I'm standing for\n\nLike this war's really just a different brand of war\n\nLike it doesn't cater to rich and abandon poor”\n\nSure it’s a bit simple for what’s at stake for a lot of people, but the general message should be what drives us to something better for everyone.",
                                    "score": 378,
                                    "author": "ThisOnePlaysTooMuch",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The first military draft ever implemented in the United States was performed by the Confederacy.\n\nIt exempted slaveholders. Thus birthed a popular phrase - \"rich man's war, poor man's fight.\"\n\nRegardless, the war went on for many, many more years.",
                                            "score": 193,
                                            "author": "Khiva",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "*went on for four years\n\n\nDon't give the confederacy too much credit. Four years, over 150 years ago. Those dumbfucks still wave the (wrong) flag too.",
                                                    "score": 82,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "If you don't have the courage to act, at least have the courage to know.",
                                    "score": 36,
                                    "author": "Khiva",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Conversations cause actions. Then we you get out in the streets and protest they tell you to get back to work and accuse you of crime. They will say or do anything they can to keep you for standing up against them and changing what they do not want changed.",
                                            "score": 25,
                                            "author": "RowdyWrongdoer",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is how I've always felt about the Snowden leak regarding the mass domestic spying from the US.  There was like 2 weeks with tension in the air where I'm sure the US gov was worried about some kind of mass revolt but then.. \n\nNothing happened. And I'm sure the people in the top 3 letter agencies couldn't believe it. \"Holy shit, they really just aren't going to do anything and we can keep doing this? Why did we even bother keeping it a secret all this time?\"",
                    "score": 163,
                    "author": "ahumanbyanyothername",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 38,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Bread and circus. As long as people are generally fed and entertained the chance for revolt is low",
                                    "score": 10,
                                    "author": "belovedfoe",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "China has no future.\n\nIt will always be a dystopian authoritarian state that oppresses their citizens and use them like cattle.",
                    "score": 141,
                    "author": "MCMiyukiDozo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "People in the west don't seem to understand that a lot of Chinese people *like* the current government. China use to be extremely poor, the standard of living for a lot of people actually increased, and frankly most people care about themselves. Until the people get to the point that they don't want it that way anymore that is how it will stay.",
                            "score": 115,
                            "author": "MalHeartsNutmeg",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Weren't there protests just a couple of months ago?\n\nAbout banking crisis and people in Shanghai protesting against the governments zero covid policy being too draconian?",
                                    "score": 42,
                                    "author": "MCMiyukiDozo",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "When the countries population is pushing 1.5b you need an awful lot of protestors.",
                                            "score": 48,
                                            "author": "MalHeartsNutmeg"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I'm not sure protesting covid restrictions is saying much about the people's opinion government. Nearly every country had protests and the government got re-elected in.\n\nNot to mention, China might be the only one that actually gave up restrictions right after the protests.",
                                            "score": 31,
                                            "author": "ghoonrhed",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt;Nearly every country had protests \n\nI feel like you're downplaying how bad the lockdowns were in China.\n\ndid anyone come take your pets away in garbage bags in the name of stopping the spread?",
                                                    "score": 4,
                                                    "author": "george-cartwright",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "That's because people on Reddit don't know what China is like at all. They think it's like a bigger North Korea or something. But again, most of Reddit are young people who haven't had a lot of opportunities to explore the world other than reading headlines.\n\nWhich is quite sad since we do have free access to information online, unlike the Chinese, and there are a ton of content on life in China made by foreigners and even a quick watch of some YouTuber travel Vloggers's videos would shock many Redditors, something random like [this](https://www.youtube.com/watch?v=m9WXigNu394) or [this](https://www.youtube.com/watch?v=C-cbhSG_1kU).\n\nIt is precisely because of that ignorance people believe in weird myths like \"Winnie the Pooh is banned in China\". There is a Winnie the Pooh ride at [Shanghai Disney](https://www.shanghaidisneyresort.com/en/attractions/adventures-winnie-pooh/) for god's sake. All it takes is 2 seconds of Google search to debunk that, yet misinformation like that just live on and on because it's something people *want* to be true.\n\nAnd of course, people will downvote comments like mine without 2nd thought because they don't *like* it. \n\nWhen Carl Sagan warned that we will no longer being able to [distinguish between what feels good and what's true](https://www.goodreads.com/quotes/632474-i-have-a-foreboding-of-an-america-in-my-children-s), he meant exactly this.",
                                    "score": 48,
                                    "author": "cookingboy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That's exactly what I'm thinking every time I read things people say here on Reddit about China. Yes, China is an authoritarian country with heavy censorship everywhere. But it's not like you would be thrown into a prison for expressing some ideas in a casual conversation (provided that you're not important enough, i.e media influencer). If you've been to China at least once you'd know that people there are not \"suffering everyday under the brutal dictatorship\" or some shit, especially in big cities like Shanghai or Shenzhen, where the standard of living is actually quite high. My point is: if someone asked me to rate countries by the amount of freedom people there have, 10 being the complete anarchy and 0 like the worst, then I'd rate US 8, NK 0-1 and China somewhere between 5-6. Is it less free than the US? Yes, of course, no one is doubting that. But do you really think Chinese people are that dumb and don't know about it? They have the internet, and unlike as some people on reddit think, it's not completely blocked. The firewall can be easily avoided by installing some VPNs and most of the young people know how to do it. They can travel outside, see what other countries are like, unlike in north Korea. So you really think that they do not know that their country is not as free as the US or EU? The know for sure. But most of the people are consciously sacrificing part of their \"freedom\" for a more stable and prosperous environment. You cannot even imagine how China was 50 years ago, literally a backwater nation where having something to eat was considered a luxury. Most of the people do not care as long as they can live their middle class lives and see their country become richer nowadays. \nI'm not pro CCP or trying to spread propaganda. I'm just tired of all the ignorance I've seen these years. And sorry for the wall of text. \nTL;DR people should stop thinking about China using stereotypes, try to do some basic research first.",
                                            "score": 24,
                                            "author": "Exybr",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Suppressed truth is like an underground river; there is no knowing where and when will it break to the surface. \n\nMay the memory of victims be one day the undoing of their murderers.",
            "score": 1039,
            "author": "hat_eater",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 35,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "i wish you and others on this thread would study up on china. it isnt your 2-week cycle news story, its a country with basically infinite complexity\n\nif you studied it, via reading books or journal articles from experts (NOT news articles), you’d know that china has been intentionally been doing what you’re saying for decades\n\nthe large majority of comments on this thread show very little understanding",
                            "score": 45,
                            "author": "srpokemon",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The biggest thing to me is how if you bring up this event everyone thinks of the one picture that china kinda let's slide. \n\nThey can crush a single man in front of a tank. You trying to stop them means nothing. \n\nYou don't as often see and a lot of people don't know about the pictures of 10-20,000 people standing together. That caused them to send in the military. They're afraid of a populist uprising because they can't kill everyone. The messaging they project is we can kill you if you step out of line, while hiding 'we can't kill everyone together'",
                                    "score": 30,
                                    "author": "n122333",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That's quite a good point. Had never thought about in that way. \n\nAlthough for me as a kid. The first time I ever saw that, knowing nothing of what happened or why he was in front of the tanks holding a bag like he was on his way home or something. \n\nTo me, it showed the power of the individual in peaceful protest to the might of China (or the powers behind that tank). I didn't know it was China. \n\nThis one man stopped if, even momentarily, a gross display of might and steel. That, to me, was quite something. I guess I had it quite wrong then. I'm sure too many do still. Not even in China today.",
                                            "score": 5,
                                            "author": "Academic-Bathroom770"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "When u/ahumanbyanyothername mysteriously disappears we know what happened here Pooh",
                            "score": 9,
                            "author": "PM_ME_UR_HIP_DIMPLES"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I teach in an international business university with Chinese students and they are unaware that this event ever happened, which is not surprising at all.",
            "score": 1544,
            "author": "oldharleyrider1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Similar experience, I once had a Chinese flatmate who was highly educated, she was completely convinced that none of this ever happened and that it’s nothing but anti-China propaganda.",
                    "score": 738,
                    "author": "mycactusismyfriend",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The first time I had a conversation with a Western-educated Chinese person about this it blew my mind. \n\nShe had completed high school in Australia, had an undergraduate degree and a masters degree from a top-tier university and was working in a multinational corporation. When I mentioned the Massacre on the anniversary, she said that it was all fake news - her Mum told her just a few students died from a hunger strike.\n\nI showed her photos and eye-witness accounts - just fake news.\n\nUnbelievable. \n\nI think the fact that she (along with many other Chinese) use Chinese apps almost exclusively makes it possible to live in a parallel world.",
                            "score": 637,
                            "author": "thetan_free",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Is it possible that she only says that to protect herself? Like if she accepts that it happened and you were an undercover spy and told the Chinese government about her so she gets in trouble? I'm taking out of my ass here but maybe they know it happened but are too afraid of what happened to them or their family if they ever acknowledged it.",
                                    "score": 260,
                                    "author": "UnexLPSA",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That’s plausible indeed.. I think it matters if the Chinese person still has connections to China or if they’re permanently moved to another country. Also talking out of my ass btw",
                                            "score": 131,
                                            "author": "kebb0",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "There is the secret police stations that China has set up in foreign countries. \n\nhttps://www.bbc.com/news/world-us-canada-65305415",
                                                    "score": 131,
                                                    "author": "Space-Dribbler",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "You can actually look up where the secret chinese police stations are on google maps. They took one down in New York recently.",
                                                            "score": 52,
                                                            "author": "PerishingSpinnyChair",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "That doesn't sound very secret",
                                                                    "score": 9,
                                                                    "author": "awesomesauce1030",
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "The ones that are currently known. Not all",
                                                                    "score": 25,
                                                                    "author": "TottHooligan",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Those are the super secret chinese police stations.",
                                                                            "score": 3,
                                                                            "author": "PerishingSpinnyChair"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "There's actually a fair chance that if they have Chinese Apps on their Chinese Phone, the microphone is listening in whether they let it or not. \n\nAlso talking out of my ass",
                                                    "score": 47,
                                                    "author": "Dust2Boss",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "American apps on american phones do that aswell lmao",
                                                            "score": 32,
                                                            "author": "MatiasSemH",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "For sure they do, but I have slightly more faith that the American Government won't hunt me down for a private conversation I'm having criticizing the US.\n\nSlightly being the keyword",
                                                                    "score": 47,
                                                                    "author": "Dust2Boss",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Yet.",
                                                                            "score": 3,
                                                                            "author": "Hugo28Boss"
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Edward Snowden doesn't seem so confident",
                                                                            "score": 3,
                                                                            "author": "curryslapper"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "That's fucking wild. Our PM at the time broke down and cried at the massacre and literally opened the doors for the first wave of Chinese immigrants/asylum seekers.\n\nMaybe her mum should educate herself and speak with the victims that now live here because of that.",
                                    "score": 6,
                                    "author": "ghoonrhed",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "To be fair it's probably similar to eg. US education/indoctrination, like how much are they teaching about the CIA interfering with foreign democracies, abducting US citizens, intentionally dropping bacteria over an entire city, torturing political prisoners etc., if you asked the average US person they probably wouldn't know a lot about this or would think it's just a conspiracy theory. Same for the conditions of for-profit prisons. Or how they broke up the 99% protests.\n\nThat's before even going into what happened in the middle east and Libya, the constant mass shootings, what they did to Japan and Vietnam, etc., which the average citizen might know about but not necessarily view in a negative light, or believes is or was justified in some way (because that's what they were raised to believe), or simply handwaves or has become blind to (in the case of mass shootings and generally high homicide rate).\n\nIn our education systems we are usually raised with nationalist ideals, ie. We ignore the crimes of our own nation or view them in a less negative light than the same actions of foreign countries.",
                            "score": 123,
                            "author": "Flimsy_Tooth_4443",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;intentionally dropping bacteria over an entire city\n\nNot American, but never heard of this, could u tell me wdym (asking in good faith btw)",
                                    "score": 10,
                                    "author": "romandlgz",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "They (presumably) mean this: \n[Operation Sea Spray](https://en.m.wikipedia.org/wiki/Operation_Sea-Spray#:~:text=Operation%20Sea%2DSpray%20was%20a,be%20to%20a%20bioweapon%20attack.)\n\n\nA bacteria that was believed to be harmless was released over San Francisco to study how a harmful one like anthrax would spread. \n\nA small number of people became sick and one died, though there is not true consensus that the illness and the experiment were actually related:\n\n&gt;\tThe Army pointed out that no other hospitals reported similar outbreaks and all 11 victims had urinary-tract infections following medical procedures, suggesting that the source of their infections lay inside the hospital.",
                                            "score": 20,
                                            "author": "AsAGayJewishDemocrat"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This will be extremely unpopular here, but I've known over a dozen of Chinese people in my adult life and every single one of them knew about this.",
                    "score": 174,
                    "author": "surviving_r-europe",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I nevery talked about it with anybody in mainland China but can confirm that everybody in Hong Kong knows what happened. Weird part is that even back in 2012 you could immeately tell that people felt very uneasy, even scared and tried to change topic asap so I didn't bother mention it in mainland. But I'm sure most of them know too.",
                            "score": 48,
                            "author": "Equivalent_Cap_3522",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Of course they do. Reddit’s insistence that no one in China knows is insane. The June 4th movement was months long and involved almost *all* university students around China. There were local protests before things culminated in Beijing. The train to Beijing, according to my mother *who was there*, were free and absolutely packed. It was the thing to do. \n\nJust because they don’t want to talk about it (for insanely obvious and depressing reasons) does not mean they all forgot.",
                            "score": 28,
                            "author": "NotPast3"
                        },
                        {
                            "level": 2,
                            "comment": "This is my experience too. My Chinese friend tells me that most if not all his friends are aware of it. They just don’t talk about it for obvious reasons.",
                            "score": 97,
                            "author": "antimornings",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Chinese international students literally are not going to talk about this shit with people in a foreign country unless you're good friends with them, and maybe not even then.\n\n\"Yo do you know about this event that is censored by the government and can get you and your family into deep shit if you get caught talking about it?\"\n\nLike what the fuck do you expect their answer to be?",
                                    "score": 22,
                                    "author": "Dashabur1",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Age plays a big role.  Most people who were alive at the time know \"something bad happened\" but not a whole lot of people know, or really want to know, the details.",
                                    "score": 6,
                                    "author": "Khiva"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The international students here in the UK knew about it but were terrified to even give anonymous interviews about anything related to China.",
                            "score": 25,
                            "author": "ZaMr0"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "To be fair do any students anywhere become aware of the horrid atrocities committed by the state they live under through the education system?\n\nMy public school quite literally never taught us of CIA backed coups or rightwing death squads America foreign policy deemed necessary, nor the actual truths of slavery or Jim Crow. It was all whitewashed, as if MLK Junior was assassinated by some random person and suddenly systemic racism ended as a result. \n\nOf course we learned about the holocaust, but any American atrocities are typically learned about outside the education system.",
                    "score": 98,
                    "author": "PossumSewage",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;\tTo be fair do any students anywhere become aware of the horrid atrocities committed by the state they live under through the education system?\n\n\nHaving talked to Germans: yes, they do.",
                            "score": 80,
                            "author": "HLGatoell",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Which also depends, the whole Herero and Namaqua genocide was a non-topic in Germany when I went to school in the 80s and 90s.",
                                    "score": 7,
                                    "author": "cyberdork"
                                },
                                {
                                    "level": 3,
                                    "comment": "Colonialism is conveniently left out though. Slaves never mentioned either. But at least they teach about some of the WW2 warcrimes unlike japan",
                                    "score": 17,
                                    "author": "Gruenerapfel",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "My US public school taught me all of those things. We’re actually pretty good at criticizing ourselves when all is said and done.",
                            "score": 42,
                            "author": "PmUrHomoskedasticity",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "OP’s post history",
            "score": 612,
            "author": "broomshed",
            "replies": [
                {
                    "level": 1,
                    "comment": "Really sad they're using this for karma.",
                    "score": 63,
                    "author": "lemonylol",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Lol “cum swallowing at the end”",
                    "score": 191,
                    "author": "happygrammies",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Holy shit the desperate karma farming is real",
                    "score": 329,
                    "author": "Ok_Pianist_6590",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They sell these accounts\n\nReddit is such a dishonest place",
                            "score": 93,
                            "author": "Theguywithayellowarm",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Fucking hate this platform.",
                    "score": 126,
                    "author": "TuxidoFrog",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Everything is a link farm these days",
                    "score": 36,
                    "author": "UsaToVietnam"
                },
                {
                    "level": 1,
                    "comment": "Dogshit website honestly",
                    "score": 34,
                    "author": "WoodyTSE"
                },
                {
                    "level": 1,
                    "comment": "Shi-\nI just looked it and 💀",
                    "score": 35,
                    "author": "-Doxter-"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Don't forget that Beijing had to bring in soldiers from other provinces because a not-insignificant number of local ones refused or were questionable.",
            "score": 138,
            "author": "Uxion",
            "replies": [
                {
                    "level": 1,
                    "comment": "Just like during the Paris Commune. Bringing soldiers from other parts and portraying the protesters as evil to exterminate them is a common tactic it seems",
                    "score": 15,
                    "author": "plutoismyboi",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "# Extremely Gory\n\n\n\n[http://www.cnd.org/June4th/massacre.html](http://www.cnd.org/June4th/massacre.html)\n\n\n\n\n\n[https://www.youtube.com/watch?v=hA4iKSeijZI](https://www.youtube.com/watch?v=hA4iKSeijZI)\n\n\n\n[https://lens.blogs.nytimes.com/2009/06/03/behind-the-scenes-tank-man-of-tiananmen/](https://lens.blogs.nytimes.com/2009/06/03/behind-the-scenes-tank-man-of-tiananmen/)\n\n\n\n[https://imgur.com/a/DdjxU](https://imgur.com/a/DdjxU)\n\n\n[From here](https://www.reddit.com/r/HongKong/comments/gw2y6b/the_real_picture_of_tiananmen_square_massacre/fssh28z?utm_source=share&amp;amp;utm_medium=web2x&amp;amp;context=3)",
            "score": 235,
            "author": "UltraMagnus0001",
            "replies": [
                {
                    "level": 1,
                    "comment": "Might be just me but your imgur album is empty in two browsers fyi.",
                    "score": 45,
                    "author": "GdanskinOnTheCeiling",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Imgur album is deleted",
                    "score": 29,
                    "author": "Sawgon",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Extremely gory. Watch at your own risk.  https://www.aboluowang.com/2008/0529/89034_3.html",
                    "score": 23,
                    "author": "Snakefist1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 3,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Such tragedies are still happening in countries around the world. This past week there has been unrest in Senegal for unjustly jailing opposition leader for years.\n\nOn 9th May, 30 people were killed in Pakistan by police and military forces for protesting against the abduction of ex-PM Imran Khan.",
            "score": 41,
            "author": "slade_wilson_"
        },
        {
            "level": 0,
            "comment": "we're fucked hk's not gonna be hk anymore and i'm going to have to watch my home be destroyed and its gonna be a whole repeat of this again",
            "score": 286,
            "author": "psych0-stargirl",
            "replies": [
                {
                    "level": 1,
                    "comment": "As a person living in hk... yeah it wont be good :(",
                    "score": 121,
                    "author": "amoghthebad",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How’s it going over there? Are people still protesting and stuff?",
                            "score": 46,
                            "author": "Impossible-Mood-3338",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Life outside politics is somewhat normal. As long as you ignore all the political and social issues. \n\n&amp;#x200B;\n\nWe no longer have representation in the legislature (election \"reforms\" largely reduced the constituencies through direct election and banned \"opposition\" from running in elections). Any protests, even those about social issues are banned and labeled as anti-government (even labor day parades and pride parades got banned, so June 4th obviously got banned). Medias and trade unions are either pro-government and pro-business or got forced to disband. Also huge sum of government budget just went to a vague category called \"national security\". Transparency that we used to be proud of went to the drain, and the relatively lack of corruption probably with it next.\n\n&amp;#x200B;\n\nThere's also a migration wave going on and a lot of professionals (eps the youth and recent university graduates) and middle class families moving away from Hong Kong (The poor can't really afford to move anywhere lol). Estimated ten to twenty thousand people already left in the past 2-3 years.",
                                    "score": 36,
                                    "author": "Un_limited_Power",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Hongkonger here. It's actually really bad, but not in a graphical way.\n\nBasically ALL kinds of protesting have been shutted down in the name of \"covid control\", including the annual June Forth Memorial which has been for decades. No protesting applications were permitted since then.\n\nThe Teacher Association was abolished, and members were arrested. Education materials have been revised and curriculum have been reformed by the education bureau: Liberal studies, a subject about social issues and political knowledge, has been demoted from compulsory to elective, while national education has been introduced as compulsory. \n\nNow most universities have gates and walls built to prevent outsiders from entering, turning a place for knowledge to a literal cage house. They also introduced national security in the university curriculum. Applying jobs related to the government now requires you to make a vow and pass a national security test.\n\nThe police force is expanding and gnawing huge resources from the government. They have set up a national security hotline for people to report any \"security threat\". Television now broadcast governmen-funded national security propagandas everyday. Some \"malicious\" online forums and websites were taken down. And there are still more to go.\n\nSo you see, Hong Kong is not struggling actively like before. Instead it's already defeated, and now it's in an oppressive state to wipe out any remaining oppositions. I hope you can have a better understanding of Hong Kong after this.",
                                    "score": 30,
                                    "author": "EvilEyeSigma",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Quiet insidious oppression gets less eyeballs, but that's how democracy dies. Sorry to hear :(",
                                            "score": 7,
                                            "author": "-ANGRYjigglypuff",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "The protests stopped mostly as people didn't want to get COVID. Currently things are stable but it's only a matter of time before mainland tries to pass another law.",
                                    "score": 32,
                                    "author": "amoghthebad",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Hard to imagine anything worse than the new National Security Law, but I'm sure the Party will come up with something.",
                                            "score": 3,
                                            "author": "yc_hk"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "OP banned from /r/sino",
            "score": 24,
            "author": "Kip_Chipperly",
            "replies": [
                {
                    "level": 1,
                    "comment": "Is anyone even surprised",
                    "score": 4,
                    "author": "Abs0lute_disaster"
                }
            ]
        },
        {
            "level": 0,
            "comment": "*Tencent hated that.*",
            "score": 190,
            "author": "ThisOnePlaysTooMuch",
            "replies": [
                {
                    "level": 1,
                    "comment": "social credit: DEDUCTED",
                    "score": 36,
                    "author": "Folded_melon",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "When protests against business corporates are done in some democratic nations and government is unable to move them then a saying is called that china will bring tanks to the road on protest site but will not loose a single business plan.",
            "score": 7,
            "author": "Tussenvoss"
        },
        {
            "level": 0,
            "comment": "\"Why don't you ask the kids at Tiananmen square..\" a powerful intro from Hypnotize by System of a Down. It's my low-key favorite song from them.",
            "score": 47,
            "author": "inhumanediversion",
            "replies": [
                {
                    "level": 1,
                    "comment": "That whole album is legendary",
                    "score": 8,
                    "author": "beelzeflub"
                }
            ]
        },
        {
            "level": 0,
            "comment": "They were afraid... Thats the whole point to stand your ground even in fear. Thats the literal definition of bravery and courage",
            "score": 5,
            "author": "Famasitos"
        },
        {
            "level": 0,
            "comment": "100 tanks along the square\n\nOne man stands and stops them there \n\nSomeday soon the tide will turn and we’ll be free",
            "score": 5,
            "author": "DonRicardo1958",
            "replies": []
        },
        {
            "level": 0,
            "comment": "My father was actually there as a foreign worker. He remembered the hotel he was staying at being locked down. He was able to take some photos of the incident but unfortunately was confiscated by the police.\n\nIt was probably a haunting experience for him. I notice he avoids talking about what happened to the protesters.",
            "score": 24,
            "author": "jakin89"
        },
        {
            "level": 0,
            "comment": "Post these in chinese subreddits instead.",
            "score": 120,
            "author": "Ave_DominusNox",
            "replies": [
                {
                    "level": 1,
                    "comment": "You'd get banned in minutes.\n\nIt's honestly crazy reddit allows subs like that to exist. It's like having a neo nazi sub be allowed on the platform.",
                    "score": 173,
                    "author": "MCMiyukiDozo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "/r/sino had memorial to the tank drivers last year.",
                            "score": 69,
                            "author": "a_can_of_solo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I thought this never happened according to them?",
                                    "score": 33,
                                    "author": "ahumanbyanyothername",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[IDK, idk...](https://www.reddit.com/r/Sino/comments/v54d58/memorial/)",
                                            "score": 30,
                                            "author": "a_can_of_solo",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Holy shit. These people are on another level of delusion. It's kind of incredible how far a human being can go into the land of imagination and still act like it's reality. I'm sure a good chunk of \"people\" in that sub are just CCP bots but still...there's gotta be *some* real people and, just, wow.",
                                                    "score": 31,
                                                    "author": "WoahayeTakeITEasy",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Wow, after reading the comment of that post I can't believe that people can become that brainwashed",
                                                    "score": 7,
                                                    "author": "Abs0lute_disaster",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "People can believe anything.",
                                                            "score": 3,
                                                            "author": "a_can_of_solo"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "even /r/leagueoflegends hard moderate any anti CCP comments",
                            "score": 39,
                            "author": "sangpls",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That game has a massive Chinese player base",
                                    "score": 20,
                                    "author": "DethInHFIL",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "because riot is a chinese company",
                                            "score": 22,
                                            "author": "Blizzard_admin"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I fail to understand why that means criticism of a government killing citizens needs moderated. Outside of, \"This doesn't relate to the video game.\" But the large Chinese player base is a great reason not to limit their words against the CCP.",
                                            "score": 3,
                                            "author": "Synectics"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "LoL is big in china. Can’t have such unpleasantness. And it’s also a pc game sub which means they can remove any and all non game related topics.",
                                    "score": 7,
                                    "author": "FardoBaggins",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "China's probably rushing to buy stocks from Reddit to get rid of this image.",
            "score": 106,
            "author": "LowAd8109",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Why don't you ask the guys at tiananmen square?   \nWas fashion the reason why they were there?",
            "score": 28,
            "author": "CriminalMacabre",
            "replies": [
                {
                    "level": 1,
                    "comment": "They disguise it, hypnotize it  \nTelevision made you buy it",
                    "score": 8,
                    "author": "Nabaatii",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm just sitting in my car and waiting for my girl",
                            "score": 4,
                            "author": "Forever_Ambergris",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "She is scared that I will take her away from there,\n\nDreams that her country left with no one there...",
                                    "score": 3,
                                    "author": "checkmyfancypants"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The craziest thing is the amount of people who actually support communism now. You could show them this and it would sway them in the least.",
            "score": 4,
            "author": "grumpy_ninja",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[Here](https://imgur.com/a/gpMZQ6h) is a dispatch sent by Alan Donald, UK Ambassador to PRC at the time. Quote pie unquote.",
            "score": 41,
            "author": "DrunkenTypist",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you. I wish this was more widely disseminated. My husband had been packed to go on an International YMCA Goodwill tour, with the goal of opening a YMCA in Beijing within a year. He was so upset as he unpacked, at all the wasted lives crushed into oblivion. The news footage at the time was as riveting as the Jan 6 coverage here.",
                    "score": 17,
                    "author": "WeeWooBooBooBusEMT",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 3,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Holy the bots have been really at it the past day.",
            "score": 14,
            "author": "LamysHusband3"
        },
        {
            "level": 0,
            "comment": "This post gonna be a [Removed by Reddit] in a few hours time.",
            "score": 186,
            "author": "ShadowDragon26",
            "replies": [
                {
                    "level": 1,
                    "comment": "What? I see a post like this twice a week, minimum.",
                    "score": 143,
                    "author": "DimesOHoolihan",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Oh please these anti-China/CCP posts are *always* upovted and some of the top posts on Reddit. And yet people like you go on about censorship. Most people think tank-man got run over and then act like they know everything about China.",
                    "score": 21,
                    "author": "mana-addict4652"
                },
                {
                    "level": 1,
                    "comment": "Honest question here: Are you intentionally lying or do you genuinely believe that Reddit removes anti-China posts?",
                    "score": 5,
                    "author": "PimpinPriest",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "&gt; posted 4 hours ago\n\nAaaaaany minute now, right?",
                    "score": 12,
                    "author": "Mentalpatient87",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "8 hours checking in. I’m sure it’s gonna be gone any second now",
                            "score": 8,
                            "author": "test-besticles",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Can't have the truth about humans rights abuses damaging the share price",
                    "score": 73,
                    "author": "PrimaxAUS",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "With them removing NSFW content from the API, this type of content will actually be censored from anyone not using the official reddit app in a few days.",
                            "score": 7,
                            "author": "jballs",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Wait, what are they going to do now? The only reason I am still on reddit is my third party app",
                                    "score": 4,
                                    "author": "DaanOnlineGaming",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "More info here https://www.reddit.com/r/redditisfun/comments/13wxepd/rif_dev_here_reddits_api_changes_will_likely_kill",
                                            "score": 3,
                                            "author": "jballs"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is one of the most upvoted posts on r/pics and its usually posted here too, don't cry oppresion lol",
                    "score": 59,
                    "author": "RESEV5",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "ahh the old ccp: \"this is fake and i'll do it again.\"",
            "score": 18,
            "author": "StifleStrife"
        },
        {
            "level": 0,
            "comment": "I was there three weeks ago and thought so much of the brave students of 1989.  I couldn't help but wonder what had happened to the student standing in front of the tank. Our guide spoke positively of \"New China.\" I was told if you tried to look online you wouldn't be able to find what had happened, history wiped clean.",
            "score": 3,
            "author": "socaltxgirl"
        },
        {
            "level": 0,
            "comment": "This post is impactful because I've really only ever seen that one image (you all know what I'm talking about) related to this protest. The balls on these people...",
            "score": 3,
            "author": "Funktastic34"
        }
    ]
}