{
    "id": "140g54o",
    "score": 2873,
    "title": "Calvin Coolidge with a headdress after being officially adopted by the Lakota Nation in 1927. He was adopted in gratitude for signing the Indian Citizenship Act into law that year - giving full U.S. citizenship to all natives on American soil. He was given the name Wanblí Tokáhe, or \"Leading Eagle.\"",
    "author": "SaintedDemon69",
    "date": 1685891921.0,
    "url": "https://www.reddit.com/r/interestingasfuck/comments/140g54o",
    "media_urls": [
        "https://i.redd.it/7euoqln0q04b1.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\n**This is a heavily moderated subreddit. Please note these rules + sidebar or get banned:**\n\n\n* If this post declares something as a fact, then proof is required\n* The title must be fully descriptive\n* No text is allowed on images/gifs/videos\n* Common/recent reposts are not allowed (posts from another subreddit do not count as a 'repost'. Provide link if reporting)\n\n*See [this post](https://redd.it/ij26vk) for a more detailed rule list*\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/interestingasfuck) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "A little correction: the Indian Citizenship Act was signed into law in 1924, not 1927.",
            "score": 223,
            "author": "SaintedDemon69",
            "replies": [
                {
                    "level": 1,
                    "comment": "Where did you learn this? I would like to learn more about interesting facts of American and world history",
                    "score": 8,
                    "author": "dingbathomesteader",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You’ve been subscribed to american cat facts.",
                            "score": 11,
                            "author": "Swimming_agenda"
                        },
                        {
                            "level": 2,
                            "comment": "Here are some fantastic channels if you want to learn more interesting facts about history in video format.\n\n[Ancient Americas](https://www.youtube.com/@AncientAmericas)\n\n[World of Antiquity](https://www.youtube.com/@WorldofAntiquity/featured)\n\n[The Prehistory Guys](https://www.youtube.com/@ThePrehistoryGuys)\n\n[Trey the Explainer](https://www.youtube.com/@TREYtheExplainer/videos)",
                            "score": 2,
                            "author": "DaoGuardian"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I did a report on Calvin Coolidge years ago and recall him being considered an unpopular President.  I'm not sure if there was a particular reason for that, but I never remembered he did this.",
            "score": 155,
            "author": "HueyDeweyandBusey",
            "replies": [
                {
                    "level": 1,
                    "comment": "He wasn't an activist President at all and so some people blame him for being too lax on the economy and not preventing what led up to the stock market crash. He was by all accounts a good man though, who never wanted to be President but did so out of duty as he was VP when Harding died.",
                    "score": 185,
                    "author": "tblackjacks",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not being an activist sounds like a compliment. Boy do I miss politicians who could just shut up and do their job.",
                            "score": 7,
                            "author": "Bit-Random",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah why change things? We've all had such an easy go of it historically",
                                    "score": 2,
                                    "author": "GeorgeSantosBurner",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Politicians have been generally awful at “fixing” things. Slow gradual changes usually end up having better long term effects and far less resistance.",
                                            "score": 1,
                                            "author": "Bit-Random"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I hope you're being sarcastic.",
                                            "score": 1,
                                            "author": "EchoFives0"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I never had much appreciation for coolidge. But I have to admit that at this point, a guy nicknamed \"Silent Cal\" would be preferable to a lot of the stuff I see coming from, well, his side of the aisle currently.\n\nThere's an interesting old story about him at a party in DC. Apparently, some Society maven came up to him and said something along the lines of \"My friend over there bet me that I couldn't get you to say more than two words. What do you think about that?\" he responded,\" You lose. \"",
                    "score": 63,
                    "author": "Negative_Gravitas",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh, to have such a dry, wry wit",
                            "score": 21,
                            "author": "2x4x93"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My favorite president by far",
                    "score": 1,
                    "author": "OmicronCoder"
                }
            ]
        },
        {
            "level": 0,
            "comment": "any name that isnt \"white devil\" was a huge win really.",
            "score": 42,
            "author": "defiantcross",
            "replies": [
                {
                    "level": 1,
                    "comment": "equinsu ocha",
                    "score": 12,
                    "author": "AFineDayForScience",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You speak Wachootoo?",
                            "score": 4,
                            "author": "melikeybouncy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Shikaka!!",
                                    "score": 5,
                                    "author": "HybridPhoenixKing"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Splanation please",
                            "score": 3,
                            "author": "2x4x93",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ace ventura 2",
                                    "score": 2,
                                    "author": "admode1982"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "THIS, fucking this",
                    "score": 1,
                    "author": "Disastrous_Meet_7952"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don't know much about Calvin Coolidge. \"m sure he did some things as president that were shameful. But he is the attributed author of my favorite quote:\n\n\"Nothing in the world can take the place of persistence. Talent will not; nothing is more common than unsuccessful people with talent. Genius will not; unrewarded genius is almost a proverb. Education will not; the world is full of educated derelicts. Persistence and determination alone are omnipotent.\"",
            "score": 104,
            "author": "LeskoLesko",
            "replies": [
                {
                    "level": 1,
                    "comment": "Years ago, my friend had a game about quotes. You were given a quote and had to guess who said it. This quote was attributed to Coolidge in that game:\n\n\"See that bird over there? I've been watching it for over 20 minutes. It hasn't moved. I think it's dead.\"",
                    "score": 43,
                    "author": "Lady_Scruffington"
                },
                {
                    "level": 1,
                    "comment": "Now I’m down a Coolidge quote rabbit-hole. That man was a treasure.",
                    "score": 6,
                    "author": "apple_atchin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "In the 1920 election he wasn't named as running mate by Harding; he was chosen by the convention.  In 1924, when asked why he wasn't naming a running mate, Coolidge replied that he's leave it to the convention on the basis that in 1920 \"...*it'd picked a durned good man*\".",
                            "score": 9,
                            "author": "UnattachedNihilist"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "They tell you who the crooks who shot Lincoln and Kennedy are, but nothing notable (like this) about Coolbridge?",
            "score": 47,
            "author": "TaxsDodgersFallstar"
        },
        {
            "level": 0,
            "comment": "Great piece of history I had not heard before. Thanks!",
            "score": 9,
            "author": "lmt99"
        },
        {
            "level": 0,
            "comment": "Exceedingly common Calvin Coolidge W",
            "score": 7,
            "author": "AbleArcher97"
        },
        {
            "level": 0,
            "comment": "Wow, that's surprisingly wholesome. I didn't even know they hadn't had citizenship before.",
            "score": 48,
            "author": "chaoticidealism",
            "replies": [
                {
                    "level": 1,
                    "comment": "Up until that time US policy was to pretend they didnt exist while forcing them to live in places they didnt call home",
                    "score": 64,
                    "author": "burnthamt",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s still a problem today, I drove to Phoenix last year and went through an Apache reservation. It was.. horrifically sad. Many lived in literal shacks that were falling over, made with rotting wood or corrugated steel. The land they lived on was completely dry and barren. Just outside of the reservation there was an old copper(?) mining town, it doesn’t leave much to the imagination when you realize the connection between the two. I couldn’t stop thinking about it the whole trip",
                            "score": 15,
                            "author": "xkelsx1"
                        },
                        {
                            "level": 2,
                            "comment": "One of my favorite stories of native peoples is the Choctaw despite living in poverty and hardship raised $170 to send to Ireland in the 1840s when they heard about the potato famine. Ireland has a monument to them now for the act of kindness 😪 https://en.m.wikipedia.org/wiki/Kindred_Spirits_(sculpture)",
                            "score": 75,
                            "author": "Beginning_Draft9092",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That is a beautiful sculpture, thanks for sharing.",
                                    "score": 21,
                                    "author": "Bidcar",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It was a beautiful act of kindness. Someone's it gives me faith in humanity, when people just hear about tragedy and what they are able to, out of nothing but pure compassion. Like how the Masai people gave 14 cows to the US after 9/11 https://www.911memorial.org/connect/blog/maasai-village-responds-911-compassion these are the things that give the glimmer of hope to me, about humanity while we are bombarded with so many people spreading hate.",
                                            "score": 20,
                                            "author": "Beginning_Draft9092",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The depressing part is realizing we can be good to another as your example shows, we just actively choose not to.",
                                                    "score": 5,
                                                    "author": "Amon7777"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "$170 was about $5000 in today bucks.",
                                    "score": 6,
                                    "author": "empty-vassal"
                                },
                                {
                                    "level": 3,
                                    "comment": "And we sent back a couple of million during covid.. we never forget.",
                                    "score": 13,
                                    "author": "Bullmcabe",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Here here! I remember that! Love to my relatives over there, I still have cousins in Donegal.",
                                            "score": 5,
                                            "author": "Beginning_Draft9092",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Hear hear.",
                                                    "score": 1,
                                                    "author": "temujin64"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I made a donation to a go fund me for the Choctaw people during that time. The sheer amount of comments saying “Ireland.” “From Ireland.” Or something similar was incredible and humbling.",
                                            "score": 3,
                                            "author": "CheshireUnicorn",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Pretty sure it was for the Navajo and Hopi not Choctaw.",
                                                    "score": 2,
                                                    "author": "temujin64"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "It's almost like Ireland has a kindred spirit with oppressed peoples the world over... huh wonder why....",
                                                    "score": 1,
                                                    "author": "Beginning_Draft9092"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "There is a road in Galway Ireland named \"The Golden Road\" it is the kost expebsive area in Galway. This was where the corn was delivered by the American natives to the starving Irish.",
                                    "score": 1,
                                    "author": "successiseffort"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Now that you are US Citizens let me introduce you to the IRS!",
                            "score": 6,
                            "author": "BriefCheetah4136",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": -1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Great Britain, one of the only nations on the planet that can make the Dubious claim to fame to have devastated more native peoples than the US",
                                            "score": 0,
                                            "author": "PXranger"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It was a little complicated, but previously the country held that the various tribes were sovereign entities, and lots of native americans actually opposed the law",
                    "score": 3,
                    "author": "mstrgrieves",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I can understand that. They should have been. They should have been the nations on our borders. We should have been a smaller country, taking land they weren't using, trading with them, exchanging ideas. I wish it had been that way. We lost so much during the Native American genocides. The accidental spread of disease was bad enough--but we had to follow it with deliberate massacres. And by some accounts, deliberate spread of disease too. If only we'd done it right, we might have become a patchwork of Native and immigrant, perhaps in a confederation, perhaps as friendly allies. So many tribes and nations could have survived, and once we got vaccination underway the disease problem would have been solved too. \n\nIf only...",
                            "score": 1,
                            "author": "chaoticidealism",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Perhaps, but it's difficult to imagine any sort of peaceful coexistence with, for example, plains indians whose entire lifestyle was based on raiding their neighbors.",
                                    "score": 1,
                                    "author": "mstrgrieves",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "We could've managed it. Didn't the Vikings grow into coexistence with their neighbors? And they were all about the raiding too.",
                                            "score": 1,
                                            "author": "chaoticidealism",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yes, over centuries, after they invaded/conquered huge amounts of territory, killed/enslaved/raped countless people, and having their indigenous religion and much of their culture violently uprooted.",
                                                    "score": 1,
                                                    "author": "mstrgrieves",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Well? Doesn't mean it always takes forever. Those Plains indians who liked raiding each other so much weren't robots who couldn't think for themselves. They were grown humans. Humans can change and learn. They can be reasoned with and talked to.\n\nLemme say it this way: I'm German-American, a first generation immigrant, naturalized now, with half my family here and half there. We're three generations out from trying to commit genocide. My grandma was in the female equivalent of the Hitler Youth. But we Germans learned better. I'm pretty sure that a bunch of raiders could have, too. They never will now, because they got massacred. But they could have. People can change and cultures can change and killing people wholesale is just not a solution to anything.",
                                                            "score": 1,
                                                            "author": "chaoticidealism",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Basically everywhere in the world you have large areas of steppeland and horses (i.e, not America until somewhere around the 15th or 16th century when europeans brought them over), nomadic steppe warriors have developed a lifestyle predicated on nomadic animal husbandry and conflict  their settled neighbors. This has been true basically throughout recorded history. These nomadic steppe warriors remained a threat to their neighbors until technological progress (mainly, mass utilization of gunpowder weapons) allowed them to be defeated. Very few voluntarily changed their lifestyle to live in harmony with their settled neighbors until after they were crushed - it was only victorious steppe armies (e.g the mongols)  who were prone to assimilate into the culture of the people they ruled over.  \n\nSo no, I don't think it's the same thing as being a member of hitler youth. Steppe nomadic life is so fundamentally different from settled life in terms of basic assumptions that it's not surprising that there are basically zero examples of unconquered steppe nomads living in peace with their neighbors.",
                                                                    "score": 1,
                                                                    "author": "mstrgrieves"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "He would be rolling in his grave if he saw western politics today. Just red and blue clowns dancing in their circuses",
            "score": 6,
            "author": "Bumplugs"
        },
        {
            "level": 0,
            "comment": "He's low key becoming my favorite president",
            "score": 57,
            "author": "shemasik",
            "replies": [
                {
                    "level": 1,
                    "comment": "He's been one of my favorites ever since my dad told me the \"You lose\" story when I was a kid.",
                    "score": 37,
                    "author": "FlaSaltine239",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "silly european here. what's the \"you lose\" story?",
                            "score": 25,
                            "author": "lassehvillum",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hello normal European, happy to explain.  \n  \nCoolidge was nicknamed \"Silent Cal\" because he spoke so little in public. During a large dinner at the White House there was a woman who said she made a bet she could get him to say more than 2 words to her by the end of the dinner.  \n  \nYou can guess his response, then he ignored her all night lol.  \n  \nEdit: grammur",
                                    "score": 106,
                                    "author": "FlaSaltine239",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I can't remember who said it (I wanna say Mae West?), but when told that Coolidge had died, they said \"How can you tell?\"",
                                            "score": 11,
                                            "author": "dogchowtoastedcheese",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It's attributed to Dorothy Parker.",
                                                    "score": 3,
                                                    "author": "UnattachedNihilist",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I should have guessed.  She's the best.  My favorite line of hers (I hope I'm not mistaken here too) is when reviewing a play, she said of the lead actress:  \"She ran the gamut of emotions, from A to B.\"",
                                                            "score": 1,
                                                            "author": "dogchowtoastedcheese"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "that's really funny. sounds like he was a cool guy",
                                            "score": 20,
                                            "author": "lassehvillum"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt;You can guess his response, then he ignored her all night lol.\n\nI could have sworn that he just straight up leaves the party.",
                                            "score": 7,
                                            "author": "TheOneBearded"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Gramaar",
                                            "score": 2,
                                            "author": "2x4x93",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Autocorrect fought me like hell on that one.",
                                                    "score": 2,
                                                    "author": "FlaSaltine239"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "He's definitely top five for me, maybe even top three.",
                    "score": 14,
                    "author": "sc0tth",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Definitely top 45",
                            "score": 22,
                            "author": "TaxsDodgersFallstar",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Better than Wilson",
                                    "score": 2,
                                    "author": "2x4x93"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That'll always be Grant for me.",
                    "score": 1,
                    "author": "Habbi_HaBibby"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Consistently showing himself to be one of America’s greatest Presidents!",
            "score": 10,
            "author": "PresidentRoman"
        },
        {
            "level": 0,
            "comment": "[https://www.upress.umn.edu/press/press-clips/what-calvin-coolidge-didn2019t-understand-about-native-americans](https://www.upress.umn.edu/press/press-clips/what-calvin-coolidge-didn2019t-understand-about-native-americans)\n\nhttps://www.whitehousehistory.org/calvin-coolidge-and-native-americans",
            "score": 10,
            "author": "SaintedDemon69",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for dropping an .edu link!",
                    "score": 5,
                    "author": "TaxsDodgersFallstar"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I wanna smoke the shit that made Calvin Coolidge",
            "score": 6,
            "author": "Idaikamiguru"
        },
        {
            "level": 0,
            "comment": "I say we change the presidential records to show Coolidge being referred to now as President Leading Eagle.",
            "score": 5,
            "author": "Lylac_Krazy"
        },
        {
            "level": 0,
            "comment": "I saw the show “Reservation Dogs”. It’s about Native kids living on a reservation near Tulsa Ok. It’s a lot to do with their love of the land, wild spirits and hunting. I really loved it. These people love and care for the land and Nature of the United States as it is their spirit ancestor. It was so refreshing to see someone look at land other than a means of Yield/gain (farming, real estate). We all talk about climate control and environmental, these peeps have practiced it for generations.",
            "score": 2,
            "author": "Ok_Monk219"
        },
        {
            "level": 0,
            "comment": "It's admittedly a great look, but for reasons still unclear to me, \"1927 Calvin Coolidge\" was by far my worst-received Halloween costume.",
            "score": 2,
            "author": "no_longer_LW_2020",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's probably because of the people crying about cultural appropriation.\n\nI need a 1927 Calvin Coolidge costume. It'd go very well with my 1963 JFK costume.",
                    "score": 1,
                    "author": "SaintedDemon69",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Haha see, you get it (with both of your comments)",
                            "score": 2,
                            "author": "no_longer_LW_2020",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I combined the two into one. It's more convenient.",
                                    "score": 1,
                                    "author": "SaintedDemon69"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;giving full U.S. citizenship to all natives on American soil. \n\nBut...wait, they were there first,  right? Or I'm missing something?",
            "score": 6,
            "author": "Due-Dot6450",
            "replies": [
                {
                    "level": 1,
                    "comment": "They were, but they were denied citizenship under the US government. A bit like how before the Civil War, African-Americans were also denied citizenship.",
                    "score": 15,
                    "author": "SaintedDemon69",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, I get that it's just seem so...like super surreal. You are on your own land then after couple of hundred years your occupiers giving you citizenship and you're happy about it. But i guess there was no much choice then...",
                            "score": 11,
                            "author": "Due-Dot6450",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They saw it at the time as the tribes being independent nations,  who just happened to be willing to sell their land and move further west. \n\nWe know now that's a bunch of BS but at the time,  it makes a certain amount of sense that they wouldn't be citizens.",
                                    "score": 5,
                                    "author": "scothc"
                                },
                                {
                                    "level": 3,
                                    "comment": "As a Brit, I've always viewed the relationship American society had (and to some extent still has) with Native Americans as really weird. Especially Thanksgiving; the natives helped the colonists and a day of thanks was given to celebrate their actions. A few generations later, they were massacred.",
                                    "score": 2,
                                    "author": "SaintedDemon69",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's useful to remember that a lot of the killing was done by Brits.  This is not to understate the culpability of the subsequently formed US, but the first century and a half of the colonization of Amerindian lands was conducted by subjects of the Crown.  \n\nI find that Brits often tend to forget this, as well as the British role in the institutionalization of slavery, when scolding Americans about our shared colonial past.",
                                            "score": 7,
                                            "author": "the_lullaby",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I don't dispute the horrific things done by the British, but we don't celebrate a holiday which was intended to show thanks to the benevolent natives, whilst simultaneously being responsible for their displacement and massacre.\n\nThat's what I mean by a weird relationship.",
                                                    "score": 5,
                                                    "author": "SaintedDemon69",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "That makes sense, but I don't know that my colleagues from India would think it much different than the dual scripting of historical British discourse about their country: romanticism and systematic starvation.\n\nedit: I'm not trying to pick a fight here.  Just pointing out that the relationship is certainly not unique.  I concur that the relationship here in the US is weird.  I come from the West, and Indians (the term 'native' is inappropriate) are viewed with a mixture of deep admiration for their abilities but also disdain.",
                                                            "score": 7,
                                                            "author": "the_lullaby"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Do the British celebrate St Patrick's Day?",
                                                            "score": 3,
                                                            "author": "scothc",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Nope.",
                                                                    "score": 1,
                                                                    "author": "SaintedDemon69"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Thanksgiving had nothing to do with honoring Native Americans in fact some of the earliest accounts of Thanksgiving feasts in America were celebrations for successfully driving off and killing Native Americans.   The story of the first Thanksgiving that everybody knows is just a romanticized amalgamation of what actually happened.",
                                                            "score": 1,
                                                            "author": "Pcakes844"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Previously, though it was a little complicated, the united states considered the various tribes to be sovereign entities.",
                    "score": 2,
                    "author": "mstrgrieves"
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"natives on american soil\" sounds  ...  So fuct up",
            "score": 4,
            "author": "myrevenge_IS_urkarma"
        },
        {
            "level": 0,
            "comment": "Giving us full citizenship?  That's almost funny.",
            "score": 4,
            "author": "pueblodude",
            "replies": [
                {
                    "level": 1,
                    "comment": "The fact you got downvoted for that comment is blowing my mind. Like hey, we slaughtered your people for years and pushed you out of your native land and we'll allow you to become citizens of your own country. Why aren't you more appreciative? /s",
                    "score": 1,
                    "author": "Mistersinister1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Man I always wanted such a headdress, they look so damn cool",
            "score": 3,
            "author": "Artemis-4rrow"
        },
        {
            "level": 0,
            "comment": "26 yr old American here, never even heard of him until now",
            "score": -3,
            "author": "SnooPeanuts8681",
            "replies": [
                {
                    "level": 1,
                    "comment": "Didn't pay attention in history class huh?",
                    "score": 37,
                    "author": "YuenglingsDingaling",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They literally didn’t mention him in history. I grew up in Alabama if that makes a difference",
                            "score": 11,
                            "author": "SnooPeanuts8681",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That explains a bit, you should at least watch the Animaniacs presidents song to make sure you know about all the past presidents",
                                    "score": 9,
                                    "author": "box-of-sourballs",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It really doesn’t explain anything. I also grew up in Alabama and had to do a 1 page report on every president in the 6th grade. I only remember this because my mom kept the binder that I had to compile it in. Most likely explanation is he was covered during a US history class, then wasn’t discussed much again once world history classes were introduced. Add on the fact that historical knowledge of the presidents isn’t used in most people’s lives on a consistent basis, and you get forgotten knowledge.",
                                            "score": 3,
                                            "author": "cbg0004",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That’s amazing, but i think we can agree he’s one of the presidents that’s not mentioned a lot",
                                                    "score": 2,
                                                    "author": "SnooPeanuts8681",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Oh that’s for sure. Definitely more of a side note than a main focus in history lessons.",
                                                            "score": 0,
                                                            "author": "cbg0004"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I find the people who say they weren't taught something typically weren't paying attention in class. \n\nI know that's a generalization,  but the fact is you likely learned the list of US presidents at least once in your educational career.",
                                    "score": 3,
                                    "author": "scothc"
                                },
                                {
                                    "level": 3,
                                    "comment": "I have a hard time buying that. Every public school in America goes over the 45 presidents. More than once in fact.",
                                    "score": -7,
                                    "author": "YuenglingsDingaling",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "If by \"go over more than once in fact\" you mean teach kids a mnemonic device song that they sing at least twice, sure.",
                                            "score": 4,
                                            "author": "thissexypoptart",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Man y'all went to some shit schools? I remember 4th grade having a \"Walk of the Presidents\" in which we all chose one president and dressed up as them and gave a short speak to our parents. I was Truman. I also still have copies of two essays I wrote in highschool my freshman and junior years on different presidents",
                                                    "score": 1,
                                                    "author": "YuenglingsDingaling"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "That’s actually quite false lmao, public schools pick and choose what to teach ESPECIALLY regarding history.",
                                            "score": 4,
                                            "author": "Dar4125",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I know that. They'll pick and choose how to portray each president. But I have a very hard time believing he wasn't even mentioned.",
                                                    "score": 1,
                                                    "author": "YuenglingsDingaling"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Well… sucks to suck",
                                            "score": 1,
                                            "author": "SnooPeanuts8681"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Oh man, how did you visit every public school to confirm that?",
                                            "score": 0,
                                            "author": "KingsElite",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Robin Williams popped out of a lamp and gave me this cool carpet.",
                                                    "score": 2,
                                                    "author": "YuenglingsDingaling",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Nice. That makes sense",
                                                            "score": 0,
                                                            "author": "KingsElite"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Went to public school in Phoenix. We went over probably 15 different presidents.",
                                            "score": 1,
                                            "author": "tsrui480"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Funny, there weren’t that many when I was in school. Only 42 by the time I graduated.",
                                            "score": 0,
                                            "author": "blatherskyte69"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Dude that’s embarrassing.",
                    "score": 3,
                    "author": "sectorfour"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Looks like a total Chad.",
            "score": 0,
            "author": "Realtor_3605"
        },
        {
            "level": 0,
            "comment": "The only U.S. President born on the Fourth of July. 'Merica as fuck!",
            "score": 1,
            "author": "SgtSharki"
        },
        {
            "level": 0,
            "comment": "lol -granting citizenship to people on their own land. Great effort, there \"Leading Eagle\".",
            "score": -8,
            "author": "beatbox2sleep",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yikes, getting downvoted for speaking the truth. Some real hard Americans in here.",
                    "score": -2,
                    "author": "Mistersinister1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They’re not getting a downvote from me, but I’d guess it’s because: why are we berating people for doing something that needed to be done given the circumstances? \n\nWas he supposed to not do it and just pay lip service to the principle of ‘I shouldn’t have to grant what already exists’? Like…yes, you SHOULDN’T, but here we are, and in the legal system that prevailed after conquest, are we just supposed to never put it on paper?\n\nWas LBJ not supposed to throw his weight into passing the Civil Rights Act because people shouldn’t have to be ‘given’ rights that they really had the whole time? What tangible benefit does our being on the moral high horse do for that other person over there who’s been getting wronged for awhile now?\n\nIn the society he had in front of him, what he did needed to be done. That doesn’t have to make him your hero, but it hardly warrants slagging him about being the one to finally do it.",
                            "score": 1,
                            "author": "call-me-the-seeker"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "He should have been named Walking Eagle..so full of shit he can't fly. Also,I'm native Canadian and not just anyone can wear headdresses, they're for tribal leaders only.",
            "score": -10,
            "author": "Kind_Vanilla7593",
            "replies": [
                {
                    "level": 1,
                    "comment": "The way it was explained to me is. It's not something you get just because you're a tribal leader it's more like you become a tribal leader because people respected you enough to make the headdress and give it to you.",
                    "score": 5,
                    "author": "Pcakes844"
                }
            ]
        },
        {
            "level": 0,
            "comment": "How nice of him to allow those people to become citizens in their own country.",
            "score": -8,
            "author": "Mistersinister1",
            "replies": [
                {
                    "level": 1,
                    "comment": "r/woosh",
                    "score": 4,
                    "author": "LoliPopular",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Because sarcasm is always so easy spot in text",
                            "score": -1,
                            "author": "Mistersinister1"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Return the national forests and national parks to indigenous people! The bureau of land management doesn’t do anything important. They were designed to kick natives off their own land and repossess it as property of the US government. The BLM doesn’t understand the complex ecosystems in these places and effectively erased ancestral knowledge leading to ecological catastrophes. Indigenous people are the traditional land stewards of North America and should have all federal land returned to them for self determination.",
            "score": -9,
            "author": "luigisphilbin",
            "replies": [
                {
                    "level": 1,
                    "comment": "The blm doesn't manage national forests or national parks.",
                    "score": 3,
                    "author": "admode1982",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes I know, they manage all other federal lands, which should also be returned to indigenous people.",
                            "score": 1,
                            "author": "luigisphilbin",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Doesn’t nobody “own” land? (they didn’t spend their personal labor to create it).\n\nThey have a “use claim” to the areas they use. It’s never been first-come-first-serve, as even the natives had *rule-by-conquest*.\n\nNo?\n\nWhich means they should have retained use claims of areas they used (in a perfect world). And if that’s Yosemite, so be it!\n\nAnd if I want to move up there too and use some land, I should be able to. Should it not be the people’s land?",
                                    "score": 1,
                                    "author": "Whatwouldntwaldodo",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Nothing you have said resembles a coherent thought, let alone an argument.",
                                            "score": 0,
                                            "author": "luigisphilbin"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Have you been to a national park?",
                    "score": 2,
                    "author": "sectorfour",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes I conduct environmental research at channel island national park in a partnership with the indigenous Chumash people. The land belongs to them and many are working to figure out how to interpret that in a modern context. The islands were seized from them through colonization first by the Spanish and then extended by the Americans. \n\nAnother example, Yosemite was stolen from Sierra Miwoks in 1850 during the Mariposa war which was by most interpretations a genocide.\n\nSo genocide really is the true legacy of national parks in the USA. Indigenous people should be allowed to determine the future of it. If they want to maintain national parks and forests as tourist attractions then the proceeds should go to their tribes. If they want to alter the land in other ways, they should be allowed to do so. Land is a measure of generational wealth and indigenous people suffered incalculable losses and are still the most impoverished group in the nation.",
                            "score": -5,
                            "author": "luigisphilbin",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "How big of a boner did you get when I set you up with that question?",
                                    "score": 4,
                                    "author": "sectorfour",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Get back to sector 7G you slack-jawed troglodyte.",
                                            "score": -4,
                                            "author": "luigisphilbin",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "D’oh",
                                                    "score": 3,
                                                    "author": "sectorfour"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Our public lands belong to all Americans, and they are by far one of the best ideas the U.S has ever had.",
                    "score": 1,
                    "author": "johnhtman",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No they are a direct seizure of land from indigenous people who were then told they weren’t citizens of the USA and had no right to the land that was just stolen to them. They were never intended to belong to the “public” but only to white people. This is the actual history of the bureau of land management and national forests and national parks. They weren’t ever meant to “preserve nature”. They were always intended to seize land from natives.",
                            "score": 1,
                            "author": "luigisphilbin"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Floyd Lawson: I thought Calvin Coolidge said that.",
            "score": 1,
            "author": "skuba85"
        },
        {
            "level": 0,
            "comment": "Coolidge's acceptance speech, in full:  \"Thanks.\"",
            "score": 1,
            "author": "darkon"
        },
        {
            "level": 0,
            "comment": "cool👍",
            "score": 1,
            "author": "Fares232222"
        },
        {
            "level": 0,
            "comment": "Dances with Congress",
            "score": 1,
            "author": "TinFoilRobotProphet"
        },
        {
            "level": 0,
            "comment": "\"Hey, I know we raped, pilaged, murdered and stole this country from y'all but.... know what? What's left of you can all be citizens on the land we took from you. Isn't that great?\"",
            "score": 1,
            "author": "MyBunnyIsCuter"
        },
        {
            "level": 0,
            "comment": "Imagine that how Elizabeth Warren think that get her Native American gene.",
            "score": -7,
            "author": "kad202"
        },
        {
            "level": 0,
            "comment": "Wouldn’t the reinstatement of the Proclamation Act have been better?",
            "score": 0,
            "author": "i_like_pigmy_goats"
        }
    ]
}