{
    "id": "1416qf8",
    "score": 650,
    "title": "The true scale of a nuclear fusion bomb, over Manhattan",
    "author": "Keplergamer",
    "date": 1685951895.0,
    "url": "https://www.reddit.com/r/interestingasfuck/comments/1416qf8",
    "media_urls": [
        "https://v.redd.it/ejaft8kko54b1"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\n**This is a heavily moderated subreddit. Please note these rules + sidebar or get banned:**\n\n\n* If this post declares something as a fact, then proof is required\n* The title must be fully descriptive\n* No text is allowed on images/gifs/videos\n* Common/recent reposts are not allowed (posts from another subreddit do not count as a 'repost'. Provide link if reporting)\n\n*See [this post](https://redd.it/ij26vk) for a more detailed rule list*\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/interestingasfuck) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "The red glowing death-ball is unlike any other explosion you might have seen. That’s because this is not fire but plasma. Its hotter than the sun and it instantly vaporizes anything in its radius. Buildings, people, cars, trees, poof -just gone within a fraction of a second. \n\nUpon triggering the bomb this plasma ball will grow to like 2 miles in diameter instantly. This obviously creates an insane overpressure which then heats up and pushes the surrounding air outwards. This is the shockwave. And its what would do the most damage as it basically is wind strong enough to tear apart buildings like they were sandcastles. Except this shockwave would carry debris along with it, sort of large-scale sandblasting the surrounding areas. It’s really bad. \n\nThen of course the radiation. And I’m not even talking about gamma radiation yet, I mean the thermal radiation produced by the detonation and subsequent plasma ball is enough to set you on fire dozens of miles away. So messed up. \n\nThe most disturbing thing to me though has got to be the black rain that follows. Like after the dust has settled and in this scenario millions have already died, all the evaporated water that used to be people, plants and so on, will rise high up into the atmosphere along with the vaporized remains of structures and so on. Thats the mushroom cloud we all know. But up there it’s really quite cold so all that junk cools down and condenses and and forms a black sludge that will soon be raining down. Of course its also highly radioactive because it literally soaked up much of the radiation. \n\nMan nukes are just the worst. Really. We have to get rid of them urgently.",
            "score": 127,
            "author": "Sword-Maiden",
            "replies": [
                {
                    "level": 1,
                    "comment": "My family and I visited the Hiroshima Peace Park and the Atomic Bomb Museum last week. It was an horrific experience. The suffering and devastation are indescribable, but the artifacts of burned school uniforms worn by children caught in the blast are impossible to forget.  Estimates vary, but approximately 200,000 people are believed to have died in that bombing. The \"Little Boy\" bomb used in that attack had a yield of 15,000 tons (15 kilotons) of TNT. A single, modern thermonuclear weapon can yield 1,200,000 tons (1.2 megatons), or 80 times the destruction of the Hiroshima bomb. To put those numbers into perspective, one 100-kiloton nuclear weapon dropped on New York City could lead to roughly 600,000 fatalities, according to NukeMap. (https://nuclearsecrecy.com/nukemap/). ",
                    "score": 20,
                    "author": "manofmystry",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was born in Oak Ridge, TN, one of the three “secret” sites of the Manhattan Project. Both of my grandfathers worked in the facilities there. Both of them died of cancer, and each of their widows got money from a government settlement.\n\nMy paternal grandfather did maintenance and repairs at the uranium-enrichment plants, K-25 and Y-12. My maternal grandfather was a biologist in the Health division. He studied the effects of radiation on mammals. My mom remembers him bringing home rabbits and hamsters and white mice sometimes (not the ones that had been injected with plutonium or uranium, thankfully.) \n\nNot sure how I feel knowing my family was part of all that. I mean, they didn’t invent the bomb, or make the decision to use it, but it still feels…uncomfortable, knowing that my family earned their living working toward the production of weapons of mass destruction.",
                            "score": 5,
                            "author": "mohugz",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "In terrible times, it takes great men to do horrific things to minimize suffering. I’ve studied the Japanese war front extensively and can say with confidence; the world would be far worse off if Japan had been invaded traditionally instead.\n\nTo give a reference point, America joined the war on December 4th, 1941. It has been about 82 years and 4 wars since then… our armed forces are still issuing the Purple Hearts made for the invasion of Japan. \n\nA study done for Stimson's staff by William Shockley estimated that invading Japan would cost 1.7–4 million American casualties, including 400,000–800,000 fatalities, and five to ten million Japanese fatalities.\n\nIt was a terrible thing that had to be done to save millions of lives. It doesn’t make it right, nor moral or good. Just the best option to avoid the soviets joining the war in Japan.",
                                    "score": 12,
                                    "author": "Marlosy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yes, the historical context certainly indicates that the bombs were the best option for saving lives on the whole. But, god, it’s hard to think of that when you see images of the aftermath.",
                                            "score": 8,
                                            "author": "mohugz",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It’s a horror we must strive to never allow again",
                                                    "score": 6,
                                                    "author": "Marlosy"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I agree. I was not making a moral judgement about the dropping of the bomb. The decision may have been expedient under the circumstances at the time. I think an invasion of Japan would have resulted in many more casualties than were caused by the bomb. Soviet expansion into the Asian theater would have furthered their imperial ambitions, and shifted the post-war balance of powers.  However, the decision to drop atomic bombs on Japan was incredibly complex, and I believe, tinged with the pervasive racism of the times. We did kill hundreds-of-thousands of civilian men, women, and children. It's hard to justify those actions, under any humane values-framework. Seeing the results, first-hand, and hearing the testimony of survivors really brought home the horror for me. More people need to have that experience. It ceases to be an abstract, historical event.",
                                            "score": 2,
                                            "author": "manofmystry",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I know, but sharing knowledge that f the end of the worst war in human history is how we best can avoid repeating it.",
                                                    "score": 1,
                                                    "author": "Marlosy",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Even in little places like this",
                                                            "score": 1,
                                                            "author": "Marlosy"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "The dropping of the bomb was absolutely not necessary to end the war. The war was basically over, Stalin was all set to invade Japan and the Japanese were all but crippled. The bomb was a flexing of muscles by the USA. It was an unveiling of the power they'd managed to harness before anyone else, and a warning for others (the Soviets), that America was not to be fucked with. Japanese generals weren't even phased by the dropping of these two bombs. I can't believe this myth still persists.",
                                            "score": 1,
                                            "author": "bibipolarolla",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I’ve explained my reasoning, and perhaps you believe a Soviet occupied Japan would be a solid ally against Russia and China… but I’d propose this:\n\nThe bombs weren’t the only thing that ended the war.\n\nThe fear of soviet occupation was not the only thing that ended the war. \n\nThe inevitable defeat and end of the empire was not the only thing that ended the war. \n\nIt was all of this in combination that made nearly unconditional surrender to the Americans, before the soviet invasion split their nation into spheres of influence seem like the best option. The risks were weighed, the casualties considered and the decision was made. It can’t be undone.\n\nInstead of being forced into the same position as Germany, Japan was rebuilt into an economic powerhouse of the modern day, made a valuable ally and trade partner. Can you say the USSR would have done the same? Did they do the same to the areas they conquered?",
                                                    "score": 1,
                                                    "author": "Marlosy",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Ok? My point was that the bombs were not necessary to end the war. It wasn't something that had to be done to prevent a ground war, or a Soviet occupation, or... Anything. It wasn't necessary, that's the point. Lol",
                                                            "score": 0,
                                                            "author": "bibipolarolla",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "And my point is that you are wrong, misinformed and spreading misinformation. Please see the facts as posted above. No further remarks necessary.",
                                                                    "score": 1,
                                                                    "author": "Marlosy",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Yes, I'm spreading misinformation. Coming from the guy regurgitating propaganda that's been debunked for literal decades. Could you possibly sound any more self-important while you're at it?\n\nhttps://www.warhistoryonline.com/featured/fleet-admiral-leahy.html?andro=1&amp;chrome=1\n\nhttps://www.latimes.com/opinion/story/2020-08-05/hiroshima-anniversary-japan-atomic-bombs\n\nhttps://books.google.ca/books?id=Y5c_3P3ZjWUC&amp;pg=PA412&amp;lpg=PA412&amp;dq=%22the+Japanese+were+ready+to+surrender+and+it+wasn%E2%80%99t+necessary+to+hit+them+with+that+awful+thing%22+Eisenhower&amp;source=bl&amp;ots=BejxMvem5N&amp;sig=ACfU3U0O6DSNvPUmfI9cgeb_oxwl1LVtTQ&amp;hl=en&amp;sa=X&amp;redir_esc=y#v=onepage&amp;q=%22the%20Japanese%20were%20ready%20to%20surrender%20and%20it%20wasn%E2%80%99t%20necessary%20to%20hit%20them%20with%20that%20awful%20thing%22%20Eisenhower&amp;f=false",
                                                                            "score": 0,
                                                                            "author": "bibipolarolla"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I visited the town years ago. Super odd place",
                                    "score": 3,
                                    "author": "ajax9302",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yes, it is. Literally built around the war effort. All the houses were built from four plans. You could get an A,B,C or D house. It’s really sad to go back there now…so much of the town is just slowly crumbling.",
                                            "score": 1,
                                            "author": "mohugz"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Fascinating, but I think your numbers are off in that reference, or they’re only meaning Manhattan. New York City has over 18 Million people (not counting for tourists which is around 200,000 a week), or the undocumented. I suspect the actual figure is double that.",
                            "score": 4,
                            "author": "SnooOnions973",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That 2 mile diameter plasma ball is grossly oversized in this cartoon.",
                                    "score": 1,
                                    "author": "ImmediateOne8733"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Look up how strong tsar Bomba was in the......60s? \n\nLook at how far other technology has increased since then.  Unbelievable...exponential amounts. \n\nI imagine the good Ole USA is sitting on planetary annihilation devices at this point.",
                            "score": 2,
                            "author": "Fair_Produce_8340",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No, they went on to reduce nuclear armament after the Cold War. After that, they’ve focused more and more on precision targeting. The world has no need for weapons that can, under no circumstances, be used. Even what we have now is kept very securely and only a few have gotten lost, been misplaced or fallen off of trucks",
                                    "score": 5,
                                    "author": "Marlosy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Including the ones made to be fired via heavy mortar system",
                                            "score": 2,
                                            "author": "Marlosy"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "That's one of my favorite things. Just.. lost nuclear warheads.\n\n\"It just fell off, boss\"",
                                            "score": 2,
                                            "author": "AngelOfDeath771",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Is this a real thing?  I thought it was a joke lol.",
                                                    "score": 2,
                                                    "author": "Fair_Produce_8340"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The issue is you *can't* get rid of them. Cats out of the bag, and they're the one and pretty much only way to guarantee your independence, in a fucked up way.\n\nUkraine went through denuclearization. Now they're getting invaded, and because Russia is nuclear, none of the other big boys, who are also nuclear, can commit ground troops, just equipment.\n\nThat was, IMHO, the big nail in the coffin for denuclearization. On top of that, MAD, in its own even more fucked up way, has ended modern warfare as we knew it before and during WW2. It's the penultimate \"fuck around and find out\", the biggest stick, and no one wants to get hit by it.\n\nWe've had less war in the last three quarters century than basically every throughout recorded history.\n\nThe nuclear bomb is just a horrendously complex thing, with insane long term effects on the geopolitical situation. But you can't put it back into the can it came out from.",
                    "score": 7,
                    "author": "MrNature73",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sadly MAD is indeed good. \n\nWW1 and WW2 were getting super intense with developments aimed at human suffering during war. \n\nNuclear has pushed towards us towards \"nobody wins in war\"",
                            "score": 2,
                            "author": "Fair_Produce_8340"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Do we have an explanation for what the causes the bolts of lightning rising from the ground up??",
                    "score": 3,
                    "author": "Life_is_a_lie7",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Those are known as \"ground shock waves\" or \"ground surface waves.\" These waves are a result of the insane release of energy during a nuclear explosion.\r  \n\rSo when a nuke detonates at or near the ground level the explosion generates an enormous amount of energy, causing the ground to heave upwards rapidly and then rebound downwards. This rapid movement of the ground creates shock waves that propagate through the air.\r  \n\r\n\nThey are composed of dust, debris, and gases that are propelled upwards by the force of the explosion which, again, is absolutely insane, I cannot stress that enough.   I feel like I have a pretty good imagination and grasp of energy and stuff but the more I explore the events that unfold within fractions of a second of such a blast, the more I come to understand how limited we are in really grasping such scales. \n\nHad to throw in that last part, cause as much as I hate nukes, they sure are fascinating from a physical perspective.",
                            "score": 3,
                            "author": "Sword-Maiden",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I couldn’t agree more, this is probably why Oppenheimer was struck with such unimaginable fear and uncertainty after the first one was detonated. It’s scary that we have such limited capabilities as humans, and we aren’t even an interplanetary species… yet we hold powers of godlike beings capable of vaporizing vast areas of cities and buildings in fractions of a second. Work that took 150 years to build gone in a nanosecond. Priorities aren’t lined up for the good of humanity it seems….",
                                    "score": 1,
                                    "author": "Life_is_a_lie7",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "So imagine how many other civilizations on other planets in the universe did decide to use these weapons on a mass scale and either extinguished themselves or sent themselves back to the stone age.",
                                            "score": 2,
                                            "author": "Dr_StrangeloveGA"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I tend to agree with your sentiment, but consider this; though nukes are really freaking insane energy wise, they are like a dry fart in the wind compared to whats going on inside our own planet. Tsunamis and the earthquakes that produce them are far far far beyond of what we can accomplish with even the largest of nukes. \n\nYes this technology gave us power that could rightly be called godlike. But only from the perspective of our limited physiology. Someday we will find a way to chain-split protons and/or neutrons the way we split atoms and, well, I dread the day. (It’s the strongest force in the universe)",
                                            "score": 1,
                                            "author": "Sword-Maiden"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[There Will Come Soft Rains](https://www.btboces.org/Downloads/7_There%20Will%20Come%20Soft%20Rains%20by%20Ray%20Bradbury.pdf)",
                    "score": 3,
                    "author": "44Skull44",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "jesus fucking christ",
                            "score": 3,
                            "author": "Sword-Maiden"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Unfortunately, as of this day and age, peace comes to those who hold the bigger stick. As long as we are alive, i dought we ever fully get rid of nukes. \n\nUkraine is the perfect example of giving p the big sticks for the common good. Then now is paying for that price Unfortunately.",
                    "score": 2,
                    "author": "Turbulent-Comedian30",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh yea 100 percent its fucked up. I am a gun owner. I like guns they are cool tools and so forth..but..i also become a gun owner for this same reason. \n\nI hate it has come this far. Imagin what the human race could achieve as a whole if we all worked together as humans, no religion, government rule, or anything. All the money spent on security or military could be pumped into food shortages housing schools we could thrive.\n\nBut ever since Cain and Able humans are designed to fight one another from fists to rocks to guns and militarys.",
                                    "score": 1,
                                    "author": "Turbulent-Comedian30",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 1,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I see in the future humans fucking up BIG big enough where sadly enough people die to evoke a change. But not till then will we see a change in our ways.\n\nRemember safety is written in the blood of others.",
                                                    "score": 1,
                                                    "author": "Turbulent-Comedian30",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 1,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I think we are too far from this kind of change..you're asking for generations of people young and old to chance from years of upbringing and schools of teaching one thing. \n\nMan or women with big enough stick evoke change and peace. The time for touching hearts and minds through peace and love are long gone. \n\nJust look at the protests people have they normally start peaceful until it rubs someone's beliefs the wrong way..said people get pissed the the first rock get thrown and boom they tear each other apart.\n\nViolence is just in our nature and it takes bigger acts of violence to stop the original violence. Yes it sucks but thats unfortunately how most humans are wired. \n\nThat i believe will NEVER change.",
                                                                    "score": 2,
                                                                    "author": "Turbulent-Comedian30",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[deleted]",
                                                                            "score": 1,
                                                                            "author": "[deleted]",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Im just here to do my time brother and move on to be honest. I see humanity for what it is. And its too corrupt to try and start now",
                                                                                    "score": 1,
                                                                                    "author": "Turbulent-Comedian30"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Also before it gets detonated a very bright light lasting a few seconds will permanently blind anyone exposed to it.",
                    "score": 1,
                    "author": "Alpha-CENTAURl"
                },
                {
                    "level": 1,
                    "comment": "Isn't fire plasma too ?",
                    "score": 1,
                    "author": "Shakaponche",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A flame is a stream of atoms/particles of what is being oxidised. Electrons of the atoms are energised from the atoms/molecules absorbing some of the energy of oxidation and they are promoted to higher orbits around the nucleus.\n\nElectrons orbit atoms in shells (think of a shell as equivalent to a planets orbit around the sun). There are very set energy levels (distances) between each shell, thus when the electron falls from a higher shell to a lower shell, each electron will give off a very specific amount of energy, usually as visible light at a certain frequency, the wavelength/frequency determines the colour. .\n\nThis is why different elements will oxidise and give off different colours - eg sodium produces an orange flame, lithium red and barium green etc.\n\nMind bendingly to me, the reverse is true, and atoms absorb light at those very same wavelengths and energy levels. This you can study the light given off by a star, and by seeing which frequencies of light are not there (quite literally dark lines on the rainbow if you run it through a prism), you can work out which elements are present in the star.\n\nPlasma is a ball of gas, where all the atoms have had all the electrons stripped away, the nucleii and electrons are all swirling around independently of each other in a very energetic soup.",
                            "score": 2,
                            "author": "Worldly_Let6134"
                        },
                        {
                            "level": 2,
                            "comment": "ehhh not really but a little bit. Look its complicated. Fire (really hot fire) does contain some plasma. But fire is more of a chemical release of energy due to oxidation (every fire needs oxygen but only one plasma needs oxygen). It releases stored ions and electrons en masse. It may produce plasma this way but itself is not a plasma.",
                            "score": 1,
                            "author": "Sword-Maiden"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Start with the fucking USA that started it all",
                    "score": 1,
                    "author": "Different-Moose8457"
                },
                {
                    "level": 1,
                    "comment": "You are a good writer.",
                    "score": 1,
                    "author": "robotpepper"
                },
                {
                    "level": 1,
                    "comment": "The shock wave created reverberates repeatedly because a vacuum-like effect sucks air back in towards the source of the explosion. It’s like a see-saw shock wave.\n\nWatch the video of a gun being fired slow motion under water to see what I’m talking about.",
                    "score": 1,
                    "author": "typeson3"
                },
                {
                    "level": 1,
                    "comment": "&gt;We have to get rid of them urgently.\n\nthere's a really fast way to get rid of them quickly and it involves all that u said",
                    "score": 0,
                    "author": "Raizel999"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Customary plug for [Nukemap](https://nuclearsecrecy.com/nukemap/), a nuclear explosion visualisation tool by Alex Wellerstein, whose blog Nuclear Secrecy is a treasure trove of knowledge about the history of nuclear weapons.",
            "score": 9,
            "author": "hat_eater",
            "replies": [
                {
                    "level": 1,
                    "comment": "Highschool social studies, i think it was called global studies or something. We had to use nukemap and powerpoint to make a presentation on where we would nuke if we had only three nukes and write why for a project, really funny project and most people just nuked their own houses lol",
                    "score": 3,
                    "author": "AbsorbentShark3",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I used to attend lectures about 200 yards from the coordinates that were to be hit with a 1 MT warhead if the shit hit the fan, and students joked a lot about it. Years later Nukemap confirmed my hunch that it didn't matter one bit, all the city and much of the suburbs would've been toast.",
                            "score": 1,
                            "author": "hat_eater"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[Source](https://youtu.be/SgspnpDDfJU)",
            "score": 4,
            "author": "Keplergamer",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you!!",
                    "score": 1,
                    "author": "SnooOnions973"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why do we expend so much glorious brainpower and money on such existential threats to nature? This really misses the big picture.",
            "score": 3,
            "author": "TheBigCicero",
            "replies": [
                {
                    "level": 1,
                    "comment": "War makes a lot of money, said every capitalist ever",
                    "score": 2,
                    "author": "SnooOnions973"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Me after eating Taco Bell and White Castle in the same day.",
            "score": 7,
            "author": "Dontbehorrib1e",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm convinced White Castle sprinkles norovirus on all their burgers.",
                    "score": 2,
                    "author": "TorpedoDuck"
                }
            ]
        },
        {
            "level": 0,
            "comment": "OPs mom when she jumps into the pool",
            "score": 11,
            "author": "HorseEjaculation"
        },
        {
            "level": 0,
            "comment": "All of this just to kill John and Sarah Connor.",
            "score": 2,
            "author": "Gullible-Net26"
        },
        {
            "level": 0,
            "comment": "So what yield are we talking here? Looks like we're in the Megaton range. 10?",
            "score": 2,
            "author": "xcnvct1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, that's the very first hydrogen bomb ever tested, the Ivy Mike shot that was a little over 10MT.",
                    "score": 2,
                    "author": "AtomicPlayboyX"
                }
            ]
        },
        {
            "level": 0,
            "comment": "How have these things not exploded or detonated by themselves? Thankful af",
            "score": 3,
            "author": "ETHlCX",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thermonuclear bombs have 2 or 3 stages depending on the design, fission bombs only have the first stage\n\nThe first stage is simple, you have a hollow sphere of what's typically highly enriched uranium, ~90-95% U235, or plutonium. This sphere is big enough that it's unable to hold criticality, and if it were to reach critically, it would heat up and expand/melt enough to no longer reach it, around this hollow core you have explosives that gets funneled to compress the hollow sphere to the point it reaches criticality and done fast enough that it causes it to release a ton of energy before it has time to stop criticality\n\nThe second stage is a bit more complicated, this stage has a uranium cyclinder filled with Lithium-Deuteride, which is the fusion fuel, with the center being a plutonium core, the first stage generators a ton of neutrons and xrays which causes the Lithium to turn into Tritium (radioactive hydrogen,  Normal hydrogen/Protium consist of 1 proton 1 electron, Deuterium is protium with an added neutron and Tritium is deuterium with another added neutron)\n\nAfter the Lithium turns into tritium, the deuterium and tritium fuse to make helium and release energy as a result, and uses the second fission reaction from the plutonium cylinder to spark the fusion\n\n(This part I'm not too sure about) The third stage, which only some have essentially triggers another fission bomb after the fusion reaction\n\n[Here's a diagram if that helps](https://en.m.wikipedia.org/wiki/Thermonuclear_weapon)\n\nSo thermonuclear bombs can only go off if the explosives detonate, and the explosives are specifically engineered to not detonate easily",
                    "score": 4,
                    "author": "TheDeadMurder"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I can tank that",
            "score": 2,
            "author": "user948972345875"
        },
        {
            "level": 0,
            "comment": "NYAAAAAAAAAAAAAAAAAAAAAAAAAAAAaaaaaaaaAaaAAAAAAAAAA",
            "score": 1,
            "author": "AbsorbentShark3",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nants ingonyama bagithi Baba!!",
                    "score": 1,
                    "author": "kuyace"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That is terrifying! I've heard descriptions of this happening where it was said if you are on such and such street this many blocks from the epicenter you should be fine. But I always thought it would really be like your model. So scary!",
            "score": 1,
            "author": "FreshFondant"
        },
        {
            "level": 0,
            "comment": "Russia does not have a ballistic delivery system that can send a payload that heavy anywhere further than Europe. Maybe Hawaii depending on where it is launched from. And that would be exhausting their space delivery systems and they would have to be manned. \nThe largest payloads would be about .5-.8 megaton at the most,(typically much smaller).\nAssuming their arsenal even detonates as it’s largely 50-60 years old or older. \n\nThe tzar bomb was 50-58 megatons and weighed too much to fit in a rocket. \nPropaganda and fear mongering is the only real threat Russia can muster. \nDon’t forget installed strategic missile defense systems that are… strategically, everywhere.",
            "score": 1,
            "author": "Fit_Cream2027"
        },
        {
            "level": 0,
            "comment": "I want bananas for scale",
            "score": 1,
            "author": "High-on_PotNuse"
        },
        {
            "level": 0,
            "comment": "But can it beat Goku",
            "score": 1,
            "author": "EdibleTheIncredible"
        },
        {
            "level": 0,
            "comment": "Rendering brought to you by North Korea",
            "score": 1,
            "author": "Necessary-Use-3121"
        },
        {
            "level": 0,
            "comment": "I hope it’s not the same weekend I have tickets on Broadway",
            "score": 1,
            "author": "Matchett32"
        },
        {
            "level": 0,
            "comment": "North Korea proven that nuke can allow you to do everything you want without fearing any intervention. Nuke are there to stay untill something stronger will be invented.",
            "score": 1,
            "author": "Early_Permit_2072"
        },
        {
            "level": 0,
            "comment": "I don't want to set the worldddd on fireee",
            "score": 1,
            "author": "Public-Lie-6164"
        },
        {
            "level": 0,
            "comment": "We need Bigger - Einstein",
            "score": 1,
            "author": "asscheeseterps710"
        },
        {
            "level": 0,
            "comment": "“YOUR TOO LATE SPIDER-MAN”",
            "score": 1,
            "author": "Blueblue1001"
        },
        {
            "level": 0,
            "comment": "Nants ingonyama bagithi Baba",
            "score": 1,
            "author": "kuyace"
        },
        {
            "level": 0,
            "comment": "I wouldn't really care if i got hit by one of these",
            "score": 1,
            "author": "Joshuah1991"
        },
        {
            "level": 0,
            "comment": "A fusion bomb is a description of the bomb’s technology, not of its yield.",
            "score": 1,
            "author": "fossil746"
        },
        {
            "level": 0,
            "comment": "Thank god none of the buildings were harmed",
            "score": 1,
            "author": "styroducky"
        },
        {
            "level": 0,
            "comment": "Phhht. I’ll be safe in my cozy lead lined fridge. Do your worst, punny bomb.",
            "score": 1,
            "author": "Windlassed"
        },
        {
            "level": 0,
            "comment": "13:47, November 27, 2024",
            "score": 1,
            "author": "OverlandAustria"
        },
        {
            "level": 0,
            "comment": "thank you for the nightmares.",
            "score": 1,
            "author": "honeybee-blues"
        },
        {
            "level": 0,
            "comment": "Wow amazing, now I need to see a scale of how big Manhattan is.",
            "score": 1,
            "author": "bumted"
        },
        {
            "level": 0,
            "comment": "MORE NUKES MORE NUKES MORE NUKE MORE NUKES!",
            "score": 1,
            "author": "Frenziedsumo"
        },
        {
            "level": 0,
            "comment": "Looks fine, let's do it!",
            "score": 1,
            "author": "Beatljuz"
        },
        {
            "level": 0,
            "comment": "AHHHHHHHHHHHHHHHHHH SUNENZAHHHHHHH",
            "score": 1,
            "author": "Eig8t86"
        },
        {
            "level": 0,
            "comment": "This would fix the insane inflation of housing cost actually.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Yeah, like they all are the same, sure",
            "score": -6,
            "author": "ChuRepan"
        },
        {
            "level": 0,
            "comment": "Holy shit; who detonated it? How many casualties are there? I have friends out in Long Island was it effected?",
            "score": -4,
            "author": "alargersmallhelping",
            "replies": [
                {
                    "level": 1,
                    "comment": "Im so sorry for your loss...",
                    "score": 1,
                    "author": "myusernamehere1"
                }
            ]
        }
    ]
}