{
    "id": "141nixl",
    "score": 104,
    "title": "You're looking at more than 45,000 galaxies",
    "author": "JwstFeedOfficial",
    "date": 1685989574.0,
    "url": "https://www.reddit.com/r/interestingasfuck/comments/141nixl",
    "media_urls": [
        "https://i.redd.it/e4td9u3ls84b1.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\n**This is a heavily moderated subreddit. Please note these rules + sidebar or get banned:**\n\n\n* If this post declares something as a fact, then proof is required\n* The title must be fully descriptive\n* No text is allowed on images/gifs/videos\n* Common/recent reposts are not allowed (posts from another subreddit do not count as a 'repost'. Provide link if reporting)\n\n*See [this post](https://redd.it/ij26vk) for a more detailed rule list*\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/interestingasfuck) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "I'm going to be honest...i only looked at like 10 before i decided to move on. I'm not looking at 45,000",
            "score": 9,
            "author": "bruteski226"
        },
        {
            "level": 0,
            "comment": "Too far to care.",
            "score": 1,
            "author": "dphillips83"
        },
        {
            "level": 0,
            "comment": "To get an idea of the scale of that image, ie; the amount of space that the image shows, imagine holding a grain of sand at arm’s length - that’s the area that image represents.\n\nAnd it contains 45,000 galaxies. Imagine how many grains of sand you could fit into the view from just your garden alone, and each of those grains holding 45,000 galaxies. Then repeat that all over the world, in every direction. \n\nStill believe in God?",
            "score": 1,
            "author": "VisibleOtter",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes. Yes I do",
                    "score": 1,
                    "author": "Demoncreed27",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Which one?",
                            "score": 3,
                            "author": "Gloomy_Suggestion_89",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "God",
                                    "score": -1,
                                    "author": "Demoncreed27",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Which. One?\n\nYahweh, Jehovah, Theos, Kyrios, Patēr, Abba, Elohim, Godhead, Shaddai, Adonai,  Tzevaoth, Elyon, Ha, Ro’i, Allah, Khuda, Tangri, Huwa, and Bahá are all names that have been or are used to name the one god of Abraham.",
                                            "score": 1,
                                            "author": "Uncle_Redleg"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I believe in God more than I believe your bullshit analogy",
                    "score": 1,
                    "author": "slowrabbit1955",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How is it a bullshit analogy? It’s factually proven. We know those billions of galaxies are out there, because you can literally see them. Or do facts scare you?",
                            "score": 3,
                            "author": "VisibleOtter"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I don't get the repeat all over the world part. Shouldn't I cover about half of the galaxies doing this exercise with a grain of rice from my backyard?",
                    "score": 1,
                    "author": "Gloomy_Suggestion_89",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not even close to half, in fact, unless you do it continually while the Earth rotates so you’ll get a much better return. You can only view as far as your horizon, remember.\n\nAlso the view from the southern hemisphere is entirely different from the northern, as any European stargazer will tell you when you first visit Australia!",
                            "score": 1,
                            "author": "VisibleOtter",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes, I entirely agree, we can see as far as our horizon... which is just about 50% of the night sky! Someone on the exact opposite side of the globe will see the other half. Combine both of these observers' visible night sky and you got about 100% of it (assuming that both observers are in a very flat area). It seems very simple to me, I fail to see why you'd think we can't see close to 50% of the sky.",
                                    "score": 1,
                                    "author": "Gloomy_Suggestion_89"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This image was taken by James Webb Space Telescope as part of the JWST Advanced Deep Extragalactic Survey (JADES).\r  \n\r  \nLight from distant galaxies is stretched to longer wavelengths and “redder” colors over time due to the expansion of the universe - a phenomenon called redshift. Astronomers measure a galaxy’s redshift to learn how far away it is, as well as when it existed in the early universe. Before Webb, there were only a few dozen galaxies observed above a redshift of 8, corresponding to when the universe was younger than 650 million years old. Now Webb’s JADES program has uncovered nearly a thousand of these extremely distant galaxies!\n\n[Full size image](https://jwstfeed.com/PostView/FeedPost?ci=1685986506_JADES2)",
            "score": 1,
            "author": "JwstFeedOfficial"
        },
        {
            "level": 0,
            "comment": "I think I see my dad",
            "score": 1,
            "author": "SnooChickens5608",
            "replies": [
                {
                    "level": 1,
                    "comment": "He wanted some out of this world cigarettes.",
                    "score": 2,
                    "author": "Oldpuzzlehead"
                }
            ]
        },
        {
            "level": 0,
            "comment": "im so bricked rn",
            "score": 1,
            "author": "Wrong-Concept-6740"
        },
        {
            "level": 0,
            "comment": "That's where the cylons are gonna come from",
            "score": 1,
            "author": "dexterthekilla"
        },
        {
            "level": 0,
            "comment": "Space is BIG.",
            "score": 1,
            "author": "Uno_mister_red"
        },
        {
            "level": 0,
            "comment": "Fire",
            "score": 1,
            "author": "Vegetable-Voice-1198"
        },
        {
            "level": 0,
            "comment": "in a galaxy far far away",
            "score": 1,
            "author": "Mkeuro"
        },
        {
            "level": 0,
            "comment": "Sure I am",
            "score": 1,
            "author": "Redtit48"
        },
        {
            "level": 0,
            "comment": "I see 13,497.",
            "score": 1,
            "author": "Youth-in-AsiaS-247"
        },
        {
            "level": 0,
            "comment": "45,000 plus the one I'm holding.",
            "score": 1,
            "author": "Aware-Arm-3685"
        },
        {
            "level": 0,
            "comment": "Bugger, I left the gas on, now I got to fly home, that's going to take a million years, better take some books",
            "score": 1,
            "author": "Sirknowidea"
        },
        {
            "level": 0,
            "comment": "Need a banana for scale",
            "score": 1,
            "author": "Sirknowidea"
        },
        {
            "level": 0,
            "comment": "To paraphrase someone else “stars are tiny and who cares? I am enormous.”",
            "score": 1,
            "author": "westwardhi"
        }
    ]
}