{
    "id": "141vblu",
    "score": 131,
    "title": "A military whistleblower, David Grusch, the co-lead for UAP analysis, representative to the Pentagon UAP Task Force and former member of the National Geospatial Intelligence Agency speaks about what he claims are Non-Human Intelligence Vehicles and Bodies being kept secret by the US Government.",
    "author": "DragonfruitOdd1989",
    "date": 1686006271.0,
    "url": "https://www.reddit.com/r/interestingasfuck/comments/141vblu",
    "media_urls": [
        "https://v.redd.it/bcc8ui7x4a4b1"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\n**This is a heavily moderated subreddit. Please note these rules + sidebar or get banned:**\n\n\n* If this post declares something as a fact, then proof is required\n* The title must be fully descriptive\n* No text is allowed on images/gifs/videos\n* Common/recent reposts are not allowed (posts from another subreddit do not count as a 'repost'. Provide link if reporting)\n\n*See [this post](https://redd.it/ij26vk) for a more detailed rule list*\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/interestingasfuck) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "NOoooo worries. NASA had already set up a panel that studies UFO sightings. One of their latest headlines: \"NASA panel studying UFO sightings says stigma and poor data pose challenges\"\n\n... So I'd say we'll get some interesting data from them within a millennium or five... or 8... maybe.",
            "score": 15,
            "author": "LinguoBuxo"
        },
        {
            "level": 0,
            "comment": "And he has zero evidence to back his claims. Nothing. Other than “trust me bro”.",
            "score": 69,
            "author": "blade944",
            "replies": [
                {
                    "level": 1,
                    "comment": "No no no. He has all the evidences. He just won't give them to us for... hum... security reasons?",
                    "score": 6,
                    "author": "Nicofettig"
                },
                {
                    "level": 1,
                    "comment": "Where is this video even from?  This seems like the fakest fake news I've seen in a while.  Someone is pushing this HARD.",
                    "score": 26,
                    "author": "jctwok",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Despite going through background checks and fact vetting, NYT, politico, the hill, and the Washington Post did not want to print this story.\n\nThough, one of the most highly respected investigative journalists in Australia stated the verification in this story was air tight\n\nFor example, this is all alleged in an inspector general complaint - that has been verified.  The IG deemed the information to be CREDIBLE and URGENT \n\nIt's also been verified that the oversight committee in Congress has been interviewing people under oath about this for months now, with dozens of whistleblowers coming forward, this is just the highest ranking one.  \n\nThe whistleblower was also vetted.  He has the highest clearance in order to prepare the presidents daily brief, which has been confirmed\n\nHe used this access while on the UAP task force to verify that secret programs do exist, and are circumventing oversight.",
                            "score": 13,
                            "author": "kensingtonGore",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Worth noting that the authors say WashPo didn’t deny printing, they just decided to go with TheDebrief because WashPo was taking too long for them",
                                    "score": 3,
                                    "author": "dirty1809"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It's called \"the tic tac\" if you feel like googling it",
                            "score": 2,
                            "author": "FilthyRedditScum69"
                        },
                        {
                            "level": 2,
                            "comment": "Just someone trying to cash in on the latest reports about UFOs.",
                            "score": 5,
                            "author": "blade944",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The highest ranking intelligence officer ever, who wrote daily executive briefs and had the highest security clearance possible - one of only dozens in the world.  \n\nHe has revealed proof to Congress through their new whistleblower protection law\n\nThese comments and interviews were APPROVED for release by the government",
                                    "score": 4,
                                    "author": "kensingtonGore"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "its being pushed to destract from the colapsing economy",
                            "score": 1,
                            "author": "shaydayultra"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Flew all the way to Earth just to crash?",
                    "score": 2,
                    "author": "urfavoritehobbit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "We were some violent and unpredictable monkeys",
                            "score": 2,
                            "author": "FerTheBear0",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I read this to the tune of Curious George.",
                                    "score": 2,
                                    "author": "KorgX3"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "In the extended interview he will talk about aggressive actions taken against the UAP by American aircraft, and that there are 'methods' to disrupt their vehicles, but it hasn't revealed what he was referring to exactly.",
                            "score": 1,
                            "author": "kensingtonGore"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Would be nice to see a clear photo of the crafts or him somewhere chillin with an alien sipping Mai Tais🍹👽",
                    "score": 5,
                    "author": "Hi_Kash",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Because if pictures and video arnt shown it isn’t real hey ?\nGo back to tiktok man, the universe is bigger than what you can see through a lens. Lol!",
                            "score": -1,
                            "author": "Specialkneeds7",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No one has said the universe isn’t big, you clown. It’s just uneventful to hear that this guy hasn’t seen any actual photos of the craft itself and has only heard whispers from others within the intelligence agency. Basically he heard rumors of crafts. It would be amazing to have that stuff declassified and to actually see the crafts and/or beings. If you rather listen to rumors and whispers all day than by all means have fun, but it’s discouraging to hear the reporter having to say to this whistleblower “If you’re right, if you’re telling us the truth”… screw having to wonder if he’s lying or not, give us something more. Aliens in bikinis sipping cocktails.",
                                    "score": 3,
                                    "author": "Hi_Kash",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Take a step back dude, 10 years ago you couldn’t even get on the lowest tier of news reporting with these kind of reports. Reporters, news outlets whatever would of laughed him out of the room, let alone let him testify to congress and drop accusations like his making here.\n\nIt’s called progress you clown, you’re exactly the kind of person who 20 years ago would of said \"well if it’s real why isn’t the government telling us about it, they work for us\"..\nYou keep moving the goal post, it’s no wonder you still have your head up your ass",
                                            "score": 6,
                                            "author": "Specialkneeds7",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah well wake up grandpa, it’s the 21st century &amp; if I can get photos of the president’s son smoking crack, compromising text messages and laying with hookers then it’s quite difficult to get excited over whispers. Again, if you’re super excited not having these things declassified or seeing some actual photos then congrats to you old chap.. you can blow your mind over those whispers and wonder if he’s lying or actually telling the truth but here in 2023 we appreciate concrete facts. Not saying he’s lying but my excitement isn’t through the roof for crafts that the whistleblower hasn’t even seen. I would like if he actually saw it or something 😂 but you wouldn’t understand that, too busy in yesteryear",
                                                    "score": 0,
                                                    "author": "Hi_Kash",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Pfft, nice come back dude. Attacking my age of which you’re not even sure of 😂😂\n\nGo google professional aircraft photography muppet, and tell me how you expect a random person to catch perfectly an object travelling 3 times as fast on a phone camera. \n\nConcrete facts hey ? You don’t even understand how much of the technology you current are using right in your hand isn’t based on “concrete” facts on nature. You’re so stupid you don’t even understand how stupid you are and yet you want \"concrete facts\". Amazing",
                                                            "score": 1,
                                                            "author": "Specialkneeds7",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "It’s a great comeback because you keep mentioning decades ago &amp; TikTok not knowing that I’ve never even downloaded that app 😂😂 so he couldn’t obtain a photo yet bob lazar could capture multiple on a camcorder in the 90s?!?  Yeah old chap, concrete facts… is that saying before your time? Should I say something like “ no malarkey or worth more than doodly-squat.” You get those terms?! Honestly not pumped for a whistleblower that brings rumors and whispers &amp; states he never even seen a craft. You are excited for it though in the 1830s.. wait til you see colorized motion pictures, old chum.",
                                                                    "score": 2,
                                                                    "author": "Hi_Kash",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Oh so you think bobs footage of glowing balls of light is \"clear pictures” ? \n\nI don’t have tiktok either pleb, and I’m not old enough to know what they fuck you just said but you’re clearly old enough to of heard it’s so maybe you should go lay down before you give yourself a heart attack, old man.\n\nYou don’t even know what you’re asking for bro, clear your argument up and make it concise before you try pull apart someone else’s. \n\nIf you think the scientific consensus is built on concrete facts, you’ve just shown you’re so stupid you don’t even understand how stupid you are. But go ahead and keep attacking my age 🤣🤣",
                                                                            "score": 1,
                                                                            "author": "Specialkneeds7",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Old man? Are you stealing my comebacks lmao?\n\nYes, I think Bob Lazar’s “balls of lights video” is more than what this whistleblower is telling us right now and Bob’s explanation on how the crafts he worked on flew and landed is more than this whistleblower’s testimony. His video may not be crystal clear but it’s not just a bunch of rumors and he ACTUALLY saw the craft, described it. Lmao you’re trying to insult me for choosing Bob’s testimony over a wad of nothing. Yeah, I choose the “not so clear video”. It’s definitely something… again you’re defending a rumor and no eye witness to any crafts. I think wanting more isn’t so crazy, you should want more for yourself, pal. \nNot pulling apart any arguments because that would mean I care about your opinion and I don’t. I just rather have more substance than you do and that’s fine. Be happy with your plate of nothing. \n\nAnd cheers for not downloading Tiktok atleast we can agree on that one thing.",
                                                                                    "score": 1,
                                                                                    "author": "Hi_Kash",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "And you’re making that comment from the toilet of your 9-5job, sick credentials..",
                    "score": -1,
                    "author": "Specialkneeds7",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m smart enough not to have to work anymore and my credentials are irrelevant.",
                            "score": -3,
                            "author": "blade944",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "So these days you just sit around and torch other people with irrelevant credentials? So happy to have your contribution to the human race bro, well done",
                                    "score": 0,
                                    "author": "Specialkneeds7",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Beats being a moron that takes everything anyone says at face value.",
                                            "score": 2,
                                            "author": "blade944",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "How would you even know how to go passed face value if you don’t have the credentials ?\n\nWay to undermine yourself there bud. LOL!",
                                                    "score": 1,
                                                    "author": "Specialkneeds7",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I don’t need the credentials. I’m not making claims. This nobody is making claims without evidence. Just like hundreds before him over the last 60 years or so. All he has done is said the true and provided nothing to back that claim. His credentials are irrelevant to all that because that’s a logical fallacy called appealing to authority. I don’t believe fuck all with proof. Only morons do.",
                                                            "score": 2,
                                                            "author": "blade944",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Yeah bro, you’re right. Multiple ships and aircraft in the worlds most advanced military backed by an 800billion dollar budget and black programs producing the upmost advanced weapons and radar systems in the world tracking and catching objects on camera yet still not being able to identify them… no proof at all ! 🤣🤣🤣",
                                                                    "score": 2,
                                                                    "author": "Specialkneeds7",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "You seem to be confusing evidence for proof. Smooth brains are prone to do that. Are there some unexplained videos? Sure. Is that proof of extra terrestrial visitors? Not at all. Unexplained is just that, unexplained. Everything else is conjecture and wishful thinking.",
                                                                            "score": 6,
                                                                            "author": "blade944",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Uh hu, you and all your irrelevant credentials..\n\nUnidentified by the most advanced military in the world with the most advanced equipment ever developed. Keep your head in the dirt bro, or on tiktok where you no doubt made all your money so you don’t have to contribute fuck all to the human race. Have fun dancing in Costco",
                                                                                    "score": 2,
                                                                                    "author": "Specialkneeds7",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "👌🤡",
                                                                            "score": 0,
                                                                            "author": "beaniemonk",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Nice vocabulary beanie, I bet it’s as big as your IQ.",
                                                                                    "score": 2,
                                                                                    "author": "Specialkneeds7",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The IG complaint is the major declassified evidence",
                    "score": -3,
                    "author": "DragonfruitOdd1989",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So he has nothing. He’s the latest in a long line of folks that claim knowledge but never ever present any. All for quick fame and a chance to sell a book. I’ll wait till actual evidence is presented before I believe a word this guy says.",
                            "score": 17,
                            "author": "blade944",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Exactly. This might be new for some people to hear claims like this, but it's been a cottage industry of appearances and books since at least Art Bell -Era Coast to Coast radio. (1990s)",
                                    "score": 6,
                                    "author": "SmokeInMyI",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "RIP Art!",
                                            "score": 3,
                                            "author": "DroidKnight"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "It goes back to the early 60s. Always big claims but never any evidence.",
                                            "score": 2,
                                            "author": "blade944",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I guess you can go back to 40s Roswell claims, if not earlier. I meant to say the 90s was when I personally 1st started hearing about it",
                                                    "score": 2,
                                                    "author": "SmokeInMyI"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "You can’t have someone testify to Congress and not have evidence “leaked” to the public.",
                                    "score": 2,
                                    "author": "Historical-Path-3345",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "He didn’t testify to all of congress of course. The Q&amp;A from the original publishers of the story had a long section about clearance levels and how they handled him testifying in front of Congresspeople who weren’t cleared for certain info. Either way, the Intelligence Community determined it credible enough to investigate and his story is apparently corroborated by other sources.",
                                            "score": 1,
                                            "author": "dirty1809"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I mean we would all want to see a picture of someone slapping the back of a flying saucer but a legitimate documentation of an official investigation happening regarding of a secret reverse engineering program existing without Congressional oversight is good enough.",
                                    "score": -4,
                                    "author": "DragonfruitOdd1989"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "“News Nation”",
            "score": 5,
            "author": "incognito2233"
        },
        {
            "level": 0,
            "comment": "Tomorrow at 5! A military whistle-blower proves that turtles come from space by throwing cheese against a  wall. Tune in tomorrow!",
            "score": 3,
            "author": "metasploit4"
        },
        {
            "level": 0,
            "comment": "Alternative explanation: ex-government employee realises he can make some easy bucks on the TV circuit with some sensationalist claims. Perhaps he'll follow up by writing a book.",
            "score": 14,
            "author": "KnightOfWords",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nice try, government",
                    "score": 2,
                    "author": "Lukewulf"
                },
                {
                    "level": 1,
                    "comment": "There are two IG complaints he filed.  \n\nThe first was done with the DoD Inspector General two years ago when he alleged that congress was not being informed about programs which they asked about specifically, circumventing law.  He was part of the AATIP UAP task force then, and had clearance to see the programs, their funding and how they were nested in government, and provided evidence to the IG\n\nHe experienced retaliation for his complaint, which was supposed to be confidential.  Last summer he filed another complaint, this time with the Intelligence Community Inspector General - who deemed his complaint credible, and urgent.  The complaint was forwarded to Avril Haines and congress/senate oversight, where they are currently investigating the allegations and the evidence.  \n\nBoth complaints were filed by his lawyer, who was also an Inspector General in 2011 previously.  \n\nHere is an extensive breakdown of the vetting process used.  [Part 1](https://thedebrief.org/fact-check-q-a-with-debrief-co-founder-and-investigator-tim-mcmillan-part-1/), [Part 2](https://thedebrief.org/fact-check-q-a-with-debrief-co-founder-and-investigator-tim-mcmillan-part-2/) and Part 3 is due out today.",
                    "score": 2,
                    "author": "kensingtonGore"
                },
                {
                    "level": 1,
                    "comment": "He started this process of reporting through various official avenues in 2021 and only left the government in April. He was still a government employee when he testified to Congress",
                    "score": 2,
                    "author": "dirty1809"
                }
            ]
        },
        {
            "level": 0,
            "comment": "“Who am I to doubt these people…?” …Madame you’re a journalist!!!! Pretend you know what your job entails!",
            "score": 3,
            "author": "TacoMeat563"
        },
        {
            "level": 0,
            "comment": "Everytime somebody claims anything like this i ask myself why there is 0 evidence. Why doesnt he have a picture, aa video or a piece of the \"spaceship\".. Maybe a piece of metal to proof its origin or... or at least anything...\n\nThis story will die down pretty soon if no evidence is shown. Like every time somebody claims something incredible without any kind of proof. In a few weeks it will be only topic in some ufo-forums and mystery websites like always.",
            "score": 3,
            "author": "Timmy_germany",
            "replies": [
                {
                    "level": 1,
                    "comment": "I agree that the move is to be skeptical, or even hyper critical, on this guy. But my understanding is that he went through proper whistle blower channels, which means a federal agency had to approve things, which means he would have been precluded from divulging classified information to a public new outlet. It doesn’t necessarily mean that his congressional testimony to congress behind closed doors didn’t include some evidence.",
                    "score": 1,
                    "author": "oliver_hart28",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Its coming out now that he actually provided 'hundreds' of pages of evidence of the existence of these programs to the DoD IG, the ICIG, Avril Haines, and after they were forwarded the complaints, the oversight committee has been investigating this evidence.",
                            "score": 2,
                            "author": "kensingtonGore"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "How advanced can these different alien species be if they keep crashing here on Earth?",
            "score": 9,
            "author": "markedddd",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ah, What ? \n\nYou probably crash your car, and that’s infinite more complex that a monkey using a stick as a tool, they break those too.\nThen you’ve got fighter pilots flying multi million dollar weapons platforms, and they crash.\n\nComplex and advanced doesn’t mean perfect, there is zero correlation and you need to think before you speak",
                    "score": -10,
                    "author": "Specialkneeds7",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Space is big. It’s harder to hit something, unless you’re aiming for it.",
                            "score": 8,
                            "author": "ArbitrationMage",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ah .. righto bud.\n\nClearly don’t know much about space. Ever heard of a thing called gravity ? 😂",
                                    "score": -3,
                                    "author": "Specialkneeds7",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ever heard of speed? It's really not as easy as you make out.",
                                            "score": 3,
                                            "author": "willie_caine",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Lol, you mean velocity, right ?\n\nGood attempt though, try again",
                                                    "score": -2,
                                                    "author": "Specialkneeds7",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Speed alone makes it difficult, add in a vector and it's even more difficult.",
                                                            "score": 2,
                                                            "author": "willie_caine",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "What the fuck are you talking about dude, because it’s not physics ..",
                                                                    "score": 1,
                                                                    "author": "Specialkneeds7"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "UFOs exist... in USA only 🤣🤣🤣🤣",
            "score": 8,
            "author": "MonzieMe",
            "replies": [
                {
                    "level": 1,
                    "comment": "My thoughts exactly.. Why would they only crash in USA?",
                    "score": 3,
                    "author": "__ILIKECATS__",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Aliens only abduct Americans too 🤣🤣🤣",
                            "score": 3,
                            "author": "MonzieMe"
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And all countries that ever had  spaceship contact through landing or crashing are collectively being silent about it?\n\nThe skeptical in me finds that hard to believe. But i'm curious about how this will develop. Im not completely dismissing it, but I need further proof to be convinced.",
                                    "score": 2,
                                    "author": "__ILIKECATS__"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "If those are the only ones you've been paying attention to, sure",
                    "score": 1,
                    "author": "FerTheBear0",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sorry I must have missed all the other countries that keep talking about alien visits, abductions and UFOs showing up 🤣🤣🤣 and by the way WHAT 🤣🤣🤣🤣🤣hahahahha Omg 🤣🤣🤣🤣",
                            "score": 1,
                            "author": "MonzieMe"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "There are many countries around the world which already have UAP/UFO/OVNI reports published and publicly available.  Look for the french report on Ovni, the Brazillian hearing on the topic, Mexico's military videos, Iran's general talking about his close encounter in a fighter jet, and Australia's Joint Intelligence Operations 60's report on ufos.  All publicly available",
                    "score": 0,
                    "author": "kensingtonGore",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "🤣🤣🤣🤣🤣",
                            "score": 1,
                            "author": "MonzieMe"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What an absolute load of bollocks. The fact that an actual news outlet makes a whole piece on this complete drivel is mind-blowing. I'd love to see these pictures be some kind of deep fake type thing, and the dude is just a massive troll.",
            "score": 5,
            "author": "DanRowbotham"
        },
        {
            "level": 0,
            "comment": "Is this a SNL skit?  Please tell me people aren’t this stupid.",
            "score": 3,
            "author": "Shelby-Stylo"
        },
        {
            "level": 0,
            "comment": "Sounds bullshit, so they can to travel light years with some super crazy futuristic technology but then crash on little old earth, bullshit",
            "score": 4,
            "author": "huh_say_what_now_",
            "replies": [
                {
                    "level": 1,
                    "comment": "Your mind is a little restricted in terms of imagination. Seems like your whole thinking turns only around our planet.\n\nI try to explain it to you.\n\nIf we're not alone, and we're definitely aren't, since space is endless (which we as humans can't perceive), then there will be species, which could be millions or billions and even older, not just out of the glibbering goo like us. \n\nThese old species maybe, have found a way to travel through space. Maybe through resources our system doesn't contain or whatever.\n\nAs said, the space is endless. Means that even space traveling billion years old species, will not only not know our planet, but our whole solar system or maybe even the whole milkyway star cluster. \n\nObviously when traveling space, they must have technology which can scan through far areas of the space and also map it at the same time, because they want to know, where they come from. \n\nLet's say, they're foraging, they just choose a point on the space ship screen and start cruising that way and they fly and fly and fly, who knows, hundreds of years since they can get a million years old or whatever, you get the point. \n\nSpace is rough, solar winds, asteroids and what not are brutal things and let's say at some point, their ship got a damaged and needed maintenance.\n\nWhat would be the first step? Looking through your map data for a planet to land on and they found what they where looking for, even multiple choices.\n\nSome would be too far away to reach with the damaged ship, some are too dangerous or uninhabitable, but there are 2 or 3 planets which are fine. Within reach and habitable and they chose the planet with the calmest atmosphere, it's earth.\n\nBut aside from that, that dude surely talks bullshit, out of various reasons.",
                    "score": -4,
                    "author": "Beatljuz"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The [Full interview](https://twitter.com/hollywoodufos/status/1665716989275541504?s=20) with him will be released later this week. The [Australian Journalist](https://twitter.com/tinyklaus/status/1665820236061319170?s=20) has stated he's aware of nearly 2 dozen whistleblowers that want to come forward regarding the existence of a secret reverse engineering program of vehicles and bodies of Non-Human Origin.",
            "score": -1,
            "author": "DragonfruitOdd1989"
        },
        {
            "level": 0,
            "comment": "As an American, whether or not the government actually has UFOs (UAPs) in their possession, I still find it reasonably likely that the US government is hiding something from the public possibly for the greater public safety or concern. I would hope that it isn't a sinister reason because for what reason do they need to be nefarious about it.",
            "score": 1,
            "author": "GreyPourageInABowl"
        },
        {
            "level": 0,
            "comment": "What you’ve said makes sense only if Earth has been visited so many times that a very unlikely event, like crashing a spaceship, is bound to happen more than one time.  Please take some time and think before replying.",
            "score": -2,
            "author": "markedddd"
        },
        {
            "level": 0,
            "comment": "What you're kidding me, the American government actually lying to it's citizens, holy heck would never ever thought that.",
            "score": 1,
            "author": "Huntanz"
        },
        {
            "level": 0,
            "comment": "Ok well before I finish the video how do you find WRECKAGE of FULLY INTACT vehicles well then it’s not WRECKAGE then is it in order for it to be wreckage it has to be wrecked that’s how you get wreckage if it’s FULLY INTACT IT IS NOT WRECKED…they are among us :::insert x-files music here:::",
            "score": 1,
            "author": "twizz228"
        },
        {
            "level": 0,
            "comment": "It seems to me like all of these UAP stories are really just conditioning to get humans comfortable\nWith the idea of aliens visiting earth. \n\nIf the government came out and told us aliens are real,  have been visiting us (for likely the entirety of recorded human history) and gave us definitive proof it would have a devastating effect on society, mostly because of the religious aspect.",
            "score": 1,
            "author": "richiecotite"
        },
        {
            "level": 0,
            "comment": "Bullshit. This type of news is pathetic. Hope everyone is catching on to this type of click bait crap.",
            "score": 1,
            "author": "StrayStep"
        },
        {
            "level": 0,
            "comment": "This is a real softball interview and a weak story backed by nothing. We all know aliens exist. Lu Elizando, Corbell and Lazar already showed evidence. Grusch is just seeking attention or a book deal. when the reporter said he was the first one to reveal this to the world he didn’t even mention the Disclosure project with Greer. Crap like this just adds noise to a topic rife with disinformation.",
            "score": -1,
            "author": "Wardenclyffe1917"
        }
    ]
}