{
    "id": "142f33x",
    "score": 45664,
    "title": "after astrological calculations and a 3-year wait for the right moment, photographer Leonardo Sens took this photo",
    "author": "DELAIZ",
    "date": 1686055857.0,
    "url": "https://www.reddit.com/r/interestingasfuck/comments/142f33x",
    "media_urls": [
        "https://i.redd.it/wc1zc56p9e4b1.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\n**This is a heavily moderated subreddit. Please note these rules + sidebar or get banned:**\n\n\n* If this post declares something as a fact, then proof is required\n* The title must be fully descriptive\n* No text is allowed on images/gifs/videos\n* Common/recent reposts are not allowed (posts from another subreddit do not count as a 'repost'. Provide link if reporting)\n\n*See [this post](https://redd.it/ij26vk) for a more detailed rule list*\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/interestingasfuck) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "&gt; astrological calculations\n\nIt says here you were born with the sun in Rio, the moon in Jesus, and sugar loaf rising.",
            "score": 2137,
            "author": "michaelnoir",
            "replies": [
                {
                    "level": 1,
                    "comment": "If sugar loaf is rising then Jesus is in retrograde.",
                    "score": 243,
                    "author": "OhNoManBearPig",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And Satan is sippin’ Gatorade.",
                            "score": 85,
                            "author": "its_like___BWOMP",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You tried....and that's what matters",
                                    "score": 18,
                                    "author": "binaryduplicity",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'll say anything that rhymes. Inherent meaning in my chimes.\n\n*Gets naked and bows",
                                            "score": 12,
                                            "author": "S1L1C0NSCR0LLS",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That's funny not sure why exactly though",
                                                    "score": 5,
                                                    "author": "binaryduplicity"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "they said Gatorade, not Haterade",
                                            "score": 3,
                                            "author": "Faruzia"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "are you saying Jesus is moonwalking?\n\nHe clearly is moonholding.",
                            "score": 5,
                            "author": "gazongagizmo",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The title cracked me up lmao",
                    "score": 29,
                    "author": "FieelChannel"
                },
                {
                    "level": 1,
                    "comment": "Astropathic translocational calculations",
                    "score": 10,
                    "author": "Bi-elzebub"
                },
                {
                    "level": 1,
                    "comment": "&gt;sugar loaf\n\nIs this how pão de açúcar is officially translated?",
                    "score": 4,
                    "author": "fat_caracal",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes",
                            "score": 2,
                            "author": "BigBootyRiver"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "\\* astronomical",
            "score": 1278,
            "author": "WazWaz",
            "replies": [
                {
                    "level": 1,
                    "comment": "Or maybe he really did do astrological calculations.  That would explain why he waited 3 years for the right moment instead of just moving his camera to a better location.",
                    "score": 824,
                    "author": "tomveiltomveil",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He needed the Jupiter to be in the the first house and Venus in the sign of Sagittarius ...",
                            "score": 171,
                            "author": "LinguoBuxo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Actually, he needed the moon to be in the seventh house and Jupiter to be in alignment with Mars.",
                                    "score": 66,
                                    "author": "VioletteFMR",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Then peace will guide the planets\n\nAnd love will steer the Stars",
                                            "score": 37,
                                            "author": "Stilcho1",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "THIS IS THE DAWNING OF THE AGE OF AQUARIUS",
                                                    "score": 32,
                                                    "author": "thenate108",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Let the sun shine innnn",
                                                            "score": 7,
                                                            "author": "SoyMurcielago",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "My life, my life, my life, my life, in the sunshine",
                                                                    "score": 3,
                                                                    "author": "cownd"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I thought you two were serious, and about to wholeheartedly agree. \n\nIs this what it is to be a hippe?",
                                                            "score": 2,
                                                            "author": "MASTERMINDBOMB",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "*hippo",
                                                                    "score": 3,
                                                                    "author": "Top_Ocelot2859"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "From 5th Dimension to Mary J. Blige, yes",
                                                                    "score": 3,
                                                                    "author": "fightthepower73",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I was thinking of the hymn, \"He's Got the Whole Moon in His Hands.\"",
                                                                            "score": 2,
                                                                            "author": "fightthepower73"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Dial it back, hippie.  Leave astrology to the real scientists. 😉",
                                                    "score": 10,
                                                    "author": "VioletteFMR",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "That has to be the right take, specially considering the impact that the Sagittarius Ursa major alignment would have diverting photons from the camera",
                            "score": 18,
                            "author": "enzovrlrd"
                        },
                        {
                            "level": 2,
                            "comment": "Full moon, at night, with great weather conditions, hovering somewhere around that statue can at most only happen once a month, which is 37 chances in 3 years.\n\nThe sky there is completely clear approximately 25 percent of the time. So 9 chances out of 37. Include in the fact that out of those 9 times, the moon was nowhere close to the statue and that seems about right for even the guy who could move his camera.",
                            "score": 15,
                            "author": "StoopidestManOnEarth",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My ignorance amuses me",
                    "score": 9,
                    "author": "inagartendavita"
                },
                {
                    "level": 1,
                    "comment": "I know, right? It's huge!",
                    "score": 5,
                    "author": "peeja"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Imagine if it were cloudy that night.",
            "score": 511,
            "author": "Wienerwrld",
            "replies": [
                {
                    "level": 1,
                    "comment": "I remember hearing a story about an early astronomer (sadly I can't remember his name) who travelled abroad to view and study a total solar eclipse.\n\nBut on the day, it was cloudy and he couldn't see it. So he did the calculations and determined that another one would happen in a few years.. so he decided to just stay and wait for the next one... When the next one came around, it was cloudy again and he couldn't see it. Did the calculations again and it turned out it would be a long time before another would occur in that location.\n\nSo he gave up, packed his things and went home to find his wife had remarried because everyone just assumed he died on the trip.\n\nOof size large.",
                    "score": 144,
                    "author": "subject_deleted",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[Guillaume Le Gentil](https://en.wikipedia.org/wiki/Guillaume_Le_Gentil?wprov=sfla1). He was on his way to India to take measurements of the transit of Venus to compare with other astronomers' measurements from across the globe so they could calculate the distance to the Sun.\n\n&gt;The ship was blown off-course by unfavorable winds and spent five weeks at sea. By the time it finally got close to Pondicherry, the captain learned that the British had occupied the city, so the frigate was obliged to return to Isle de France. When 6 June came the sky was clear, but the ship was still at sea, and he could not take astronomical observations with the vessel rolling about. Having already completed the trip from Paris, he stayed for the next transit of Venus, which would come in another eight years (they occur in pairs 8 years apart, but each such pair is separated from the next by 121 or 105 years).\n\n&gt;After spending some time mapping the eastern coast of Madagascar, he decided to record the 1769 transit from Manila in the Philippines. Encountering hostility from the Spanish authorities there, he headed back to Pondicherry, which had been restored to France by peace treaty in 1763, where he arrived in March 1768. He built a small observatory to view the transit. On the day of the event, 4 June 1769, the sky became overcast, and Le Gentil saw nothing.\n\n&gt;The return trip was first delayed by dysentery, and further when his ship was caught in a storm and dropped him off at Île Bourbon (Réunion), where he had to wait until a Spanish ship took him home. He finally arrived in Paris in October 1771, having been away for eleven years, only to find that he had been declared legally dead and been replaced in the Royal Academy of Sciences. His wife had remarried, and all his relatives had \"enthusiastically plundered his estate\". Due to shipwrecks and wartime attacks on ships, none of the letters he had sent to the Academy or to his relatives had reached their destinations. Lengthy litigation and the intervention of the king were ultimately required before he recovered his seat in the academy and remarried.",
                            "score": 83,
                            "author": "TheyCallMeStone",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This dude clearly didn't like his wife/family",
                                    "score": 23,
                                    "author": "Sweedish_Fid"
                                },
                                {
                                    "level": 3,
                                    "comment": "That's what it was. Thanks!",
                                    "score": 4,
                                    "author": "subject_deleted"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Solar transit of Venus. Very rare but they often pair up when they do happen. We had a couple already this century but the next one isn't until past 2110. Mathematically we have about 10 of them every millennia and 10 Mercury transits every century",
                            "score": 8,
                            "author": "brent1123",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Total eclipse of the heart?",
                            "score": 4,
                            "author": "RPandorf",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I thought about traveling to see a total solar eclipse several times, but every time I gave up because it was too expensive and there was a good chance to be cloudy.",
                            "score": 2,
                            "author": "plexomaniac"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "would've been disappointingasfuck",
                    "score": 106,
                    "author": "tpc0121",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "All that planning, for nothing.",
                            "score": 18,
                            "author": "Wienerwrld",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Presumably the photographer would have calculated a list of viable dates and locations. Also, it's possible that it took 3 years because the first few tries were on cloudy nights.",
                                    "score": 31,
                                    "author": "setibeings"
                                },
                                {
                                    "level": 3,
                                    "comment": "All that planning, yet he didn't have a very good camera to take advantage of it.",
                                    "score": 9,
                                    "author": "Comment105",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Its probably not entirely due to the camera, but the conditions. Presumably this would be taken in the evening, so low light. He would have had to increase his ISO (effectively the gain on the sensor)incredibly high to catch details of the statue, this introduces a lot of noise in the sensor. Also since he is most likely at a distance to get the perspective he is going for, there is a lot of atmosphere to distort the image, made worse by heat haze coming from the ground. \nI would imagine it would be a challenge to get a crisp picture.",
                                            "score": 5,
                                            "author": "izxion",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I wonder if instead of raising the iso, he instead lowered the shutter sped to .5 seconds or 1second on a bipod if the picture would have been better. Idk how much the moon would move in a second but I imagine it would be sharper than raising ISO",
                                                    "score": 1,
                                                    "author": "PrinceMvtt",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Good question. I would guess it would depend on how zoomed in he was (more apparent motion in the lens). I would also venture that he probably was at a pretty low shutter speed already (although I'm just guessing and have no idea) and much longer may blow out the highlights. \n\nI should also add that a lot of the distortion (especially around the moon) is just shitty compression of the pic. Original probably looks a lot better.",
                                                            "score": 4,
                                                            "author": "izxion",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Pacific Northwest life right there. \n\n“Oh there is a cool thing in the sky tonight? Alright let me grab my….. oh. Cloudy.”\n\nOr the late summer variation: “oh it’s actually clear tonight!! Wait…. Smoke.”",
                    "score": 15,
                    "author": "MisterComrade",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "He probably would've gone back the next evening, taken a small step to the left, and tried the photo again.",
                    "score": 4,
                    "author": "ryosen"
                },
                {
                    "level": 1,
                    "comment": "/r/photoshopbattles  could help",
                    "score": 3,
                    "author": "GullibleDetective"
                },
                {
                    "level": 1,
                    "comment": "I missed that ‘Green Comet’ because of fuckin clouds. I guess I’ll catch it next time..",
                    "score": 3,
                    "author": "IenjoyStuffandThings"
                },
                {
                    "level": 1,
                    "comment": "Imagine if the earth had gotten hit by a gamma ray burst from a nearby supernova wiping out all life on earth before the photographer had taken his photo",
                    "score": 6,
                    "author": "joshjosh111",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I dream about this nightly",
                            "score": 1,
                            "author": "inspectoroverthemine"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "There's a higher resolution version right? This is super cool, but not 3 years and god-tier trig cool",
            "score": 545,
            "author": "Xielvanic",
            "replies": [
                {
                    "level": 1,
                    "comment": "The shot was taken from 11 kilometers away. Atmosphere is the toughest lens. Impossible to control.",
                    "score": 294,
                    "author": "jdezentje",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well there's noise, sure (and still you can manage to mitigate it), but the pictures we see here is still very low resolution.",
                            "score": 56,
                            "author": "goug",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That likely has a lot more to do with it being compressed multiple times as it's re-shared again and again, rather than the photographer waiting 3 years to intentionally take a low res photo.",
                                    "score": 46,
                                    "author": "subject_deleted",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "For sure\n\nhere's a slightly better one\n\nhttps://portugal.postsen.com/content/uploads/2023/06/06/71bb809ea3.jpg",
                                            "score": 9,
                                            "author": "goug",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You were not lying about *slightly*",
                                                    "score": 9,
                                                    "author": "the_queens_speech"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I was hoping for Payton Manning",
                                                    "score": 3,
                                                    "author": "_My_Niece_Torple_"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I imagine he was too late to take a closer picture?",
                            "score": 5,
                            "author": "michel210883",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Maybe in 3 more years!",
                                    "score": 3,
                                    "author": "inspectoroverthemine"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt;Atmosphere is the toughest lens. Impossible to control.\n\nAtmosphere is a filter, not a lens. Generally.",
                            "score": 82,
                            "author": "obliquelyobtuse",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "it refracts and distorts, so sure you can say it's a lens",
                                    "score": 72,
                                    "author": "muitosabao",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I did qualify filter not lens with \"**generally**\". **I should have said \"usually more a filter than a lens\"** for this instance. The posted image is terrestrial photography \"at 11km\", where atmosphere  (and distortion) will be a substantial filter. Also, \"golden hour\" in photography is atmospheric spectral filtering for more pleasing illumination.\n\nAtmospheric lensing (refraction) is certainly significant in astrophotography and other technical fields. And for mirage effect in conventional photography.",
                                            "score": -6,
                                            "author": "obliquelyobtuse",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Let it go, man.",
                                                    "score": 6,
                                                    "author": "epibeee",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Why is what they said being downvoted and why are you saying this? I, for one, appreciate their thoughts and perspective. I don't really read it as pointless banter.",
                                                            "score": 10,
                                                            "author": "TheTankCleaner",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Redditors love to pile on whoever the group has decided has \"won\" or lost an argument, it doesn’t matter what they say after that point",
                                                                    "score": 6,
                                                                    "author": "mrASSMAN"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Same here. This is the exact type of \"argument\" I like seeing on reddit. We shouldn't be confusing this with the 99% of other arguments we see around here.",
                                                                    "score": 4,
                                                                    "author": "hotterthanahandjob"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I love that you and the other account that make sense get hammered with down votes \n\nHow dare you know things!!",
                                                    "score": 4,
                                                    "author": "binaryduplicity"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Actually ☝️🤓",
                                    "score": 16,
                                    "author": "burningscorcher"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "If only he had spent some of those 3 years on walking closer to the statue. Ah well, maybe next time?",
                            "score": 4,
                            "author": "TruthYouWontLike",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Just in case you're serious...the moon wouldn't look as impressive.\n\nWhen dealing with photography of foreground and background objects you can make the background look larger and more impressive by stepping away and increasing the zoom to a point where your subject (statue in this case) is still the same relative size as before, but the background will be magnified (literally however strong the zoom is).\n\nTry it next time you're photographing a person in front of something like a skyline--step further away than normal from that person, but use at least 3x *optical* zoom if your phone supports it to make the background pop a bit.",
                                    "score": 11,
                                    "author": "vi3tmix",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Which has absolutely nothing to do with the very small (600x750) resolution.",
                            "score": 7,
                            "author": "Pete_Iredale",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "it does and it shows you have no idea what you're talking about. \n\nImagine taking a picture of a moon on your phone - it will be a dot on a screen. But if you *cut* the center  you can see more of it, even with the loss of quality. This is what your phone does when you ask it to 'digital zoom' - it's not a zoom in any way, it just cuts everything outside the frame.\n\nSo, what happened here: you take a picture from *really* far away. For that you need a special lens like 400mm or even 2000mm - this alone makes the image quality worse because from that distance any micro-movement will result in noise and blurring, plus it typically doesn't allow a lot of light in compared to regular lenses. And even so, it's so far far away and it's so small that on a full image (say 4000x6000) it only takes a small part of the whole pic. Now, would you care to guess how much space *the moon itself* without all the background is taking? I'm guessing around 600x750 of that picture, so this is what was cut. This is what is called a 100% cut which is done by cutting a portion of the full image to get a better look at a smaller, yet worse, part.",
                                    "score": 1,
                                    "author": "Latter_Handle8025",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "3 years planning, and you show up with a 50mm and crop the picture lol.",
                                            "score": 11,
                                            "author": "miranto"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I dabble in photography, and you really don't have any right telling someone they don't know what they're talking about here.  If you're taking a picture of the moon that you're preparing 3 years for, then you're probably going to have at least an 800mm, and you're probably going to have a 40+ megapixel camera. That combo, when cropped so that the moon is this size in the frame, would result in at least 2400 x 1200 image (rough estimate based on how big my photos of the moon are cropped similarly from a 600mm, 24 mp combo).\n\nI can almost guarantee you, either this isn't the highest resolution that exists of this crop, or the photographer didn't really plan this photo out as meticulously as the title implies. Probably the former rather than the latter.",
                                            "score": 4,
                                            "author": "justaboxinacage"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "As if you don't see super HD pics of the moon and/or ISS every other day on reddit taken by some 15 year old in their yard lmao",
                                            "score": 3,
                                            "author": "BehindGodsBack",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Super HD pictures of the moon are usually composites of many, many photos.\n\nStill, this photo maybe could have been taken in better quality.",
                                                    "score": 5,
                                                    "author": "umop_aplsdn"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Also jumping in this thread. Anyone know of a higher res photo? I want this for my phone background, it's cool looking.",
                    "score": 3,
                    "author": "simmerbrently"
                },
                {
                    "level": 1,
                    "comment": "He should have gotten closer",
                    "score": 8,
                    "author": "xShockmaster",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Can't get the moon this big if you get closer",
                            "score": 16,
                            "author": "bert0ld0",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "So, what happened here: you take a picture from really far away. For that you need a special lens like 400mm or even 2000mm - this alone makes the image quality worse because from that distance any micro-movement will result in noise and blurring, plus it typically doesn't allow a lot of light in compared to regular lenses. And even so, it's so far far away and it's so small that on a full image (say 4000x6000) it only takes a small part of the whole pic. Now, would you care to guess how much space the moon itself without all the background is taking? I'm guessing around 600x750 of that picture, so this is what was cut. This is what is called a 100% cut which is done by cutting a portion of the full image to get a better look at a smaller, yet worse, part.",
                    "score": 7,
                    "author": "Latter_Handle8025"
                }
            ]
        },
        {
            "level": 0,
            "comment": "He’s got the who.. le… moon! In his hands, he’s got the whole moon in his hands, whole moon in his hands, he’s got the whole moon in this hands.",
            "score": 93,
            "author": "losbullitt",
            "replies": [
                {
                    "level": 1,
                    "comment": "Calm down Garland Greene",
                    "score": 2,
                    "author": "AcidTWister",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Im so excited! Im so excited! \n\n\n… im so scared!",
                            "score": 6,
                            "author": "losbullitt",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "*Does the new shooter feel lucky? Well, does he?*  \n***Yes, yes he does.***",
                            "score": 2,
                            "author": "OccludedFug"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The easiest way to make the moon look big is to adjust your lens, so much so that the minor fluctuations in its actual size in the sky are almost irrelevant. Someone else posted he took this with a telephoto lens, which gives it that enlargement. Though idk why he seems to cropped it further",
                    "score": -1,
                    "author": "Iusethistopost"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Jesus wants a hug!",
            "score": 11,
            "author": "Shakalx3",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Jesus Christ, PUT THAT DOWN!",
            "score": 11,
            "author": "Senepicmar",
            "replies": []
        },
        {
            "level": 0,
            "comment": "And what are „astrological/astronomical calculations“? And why did he have to wait for 3 years? Couldn’t he just move around with the camera until it fits?",
            "score": 152,
            "author": "s0rtynet",
            "replies": [
                {
                    "level": 1,
                    "comment": "\"Couldn't he just move around with it camera until it fits?\"\n\nKind of, but not really. First, the moon is only full about once a month. Over three years you'll have 37 days where the shot is even possible.\n\nSecond, the moon moves faster than you think. That image can only exist for a moment.\n\nThird, it's not as simple as moving around with it camera, because in order to get a shot with the statue facing the camera you have only a limited area you can be in for the shot to work, and while you can often move a bit here or a bit there, what you really need is a very good idea in advance of precisely where the moon and statue will line up, and then you have to find something on that line that has a clear view of the statue and sky, including the room to fine-tune your location, *and* you have to do that fine-tuning before the moon moves away (see second point).\n\nFinally, Rio sees rain about 30% of its days annually, and surely it sees clouds more often. That shot is impossible if it's cloudy (not to mention other air pollution or atmospheric conditions that could ruin it). \n\nAdd all these things up (and many more I haven't thought of) and it's easy to see this taking a long time to execute, even if it was perfectly planned on day one",
                    "score": 164,
                    "author": "nye1387",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Kudos on a knowledgable, well presented, answer to that question. Timelapse photog here who frequently shoots at over 1000mm to get shots like OP’s (though not as spectacular…yet :-) I know the struggles.",
                            "score": 25,
                            "author": "chasg"
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 6,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Maybe it was the best camera the guy had access to!",
                                    "score": 4,
                                    "author": "FattNeil"
                                },
                                {
                                    "level": 3,
                                    "comment": "I assume it was a good photo when taken, but that it's been uploaded and compressed and downloaded and uploaded and compressed a hundred times",
                                    "score": 2,
                                    "author": "nye1387"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Finding the alignment is not that hard as you posted here, also you can find the alignment 365 days of the year not only on full moon day. You can have a sky app just to show where the moon will be approximately. \n\nMoon will be moving fast, you will have about 40-50 secs when you are stationary but you will have 2-3 mins to take this photo when you try from different elevation. Like stand on a building and try again after coming down from it. \n\nBut sometimes they get lucky and found this sweet spot by accident and tried it in next few attempts in either case you don't need 3 years of calculation.",
                            "score": 2,
                            "author": "EthanHuntimf007",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Could have just photoshopped it ffs",
                    "score": 29,
                    "author": "alternixfrei",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There it is, the comment I was looking for.",
                            "score": 14,
                            "author": "Cl0ck_F4ce"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Same thought. And why is he using a generic android phone to take the shot?",
                    "score": 16,
                    "author": "RaidenShogun31",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Do you know how far away he is from the statue when taking this picture?",
                            "score": 5,
                            "author": "gibson_guy77",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "It’s probably a very high end camera, the thing is, to get the moon so big while keeping the statue small, you need to take the image from many miles away. Try taking a picture of something even just a mile away on your phone. (Hint: It’ll be like 2 pixels)",
                            "score": 2,
                            "author": "Tommyblockhead20"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’d do all that planning and waiting just to leave the lens cap on",
            "score": 43,
            "author": "SpewingHalfTruths",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hilarious image of a rangefinder with an 800mm on it",
                    "score": 2,
                    "author": "otherwiser"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Jesus be like, forget atlas. Now I will hold the moon and that too with open arms.",
            "score": 9,
            "author": "TheSimpleHumans",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Father forgive me for these gains I am about to receive",
            "score": 6,
            "author": "Chrisxivturcios"
        },
        {
            "level": 0,
            "comment": "Not astrological. Astronomical. Astronomy is the science. Astrology is the bullshit in which only ass brained individual could believe since 19th century.",
            "score": 41,
            "author": "YARandomGuy777",
            "replies": [
                {
                    "level": 1,
                    "comment": "Maybe he did consult his horoscope to take the shot in a favorable day.",
                    "score": 3,
                    "author": "miranto"
                },
                {
                    "level": 1,
                    "comment": "My horoscope said you would say that",
                    "score": 3,
                    "author": "SlimeDragon",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Then some kid happened to walk by at the same time and snapped it with his iPhone and was promptly murdered by the photographer.",
            "score": 3,
            "author": "YourALooserTo"
        },
        {
            "level": 0,
            "comment": "🎶He’s got the whole moon in his hands🎶",
            "score": 3,
            "author": "greggilliam2nd"
        },
        {
            "level": 0,
            "comment": "This explains why he's so shredded on all those crosses.",
            "score": 4,
            "author": "Spatularo"
        },
        {
            "level": 0,
            "comment": "SPIRIT BOMB!",
            "score": 9,
            "author": "Omeirawana",
            "replies": [
                {
                    "level": 1,
                    "comment": "Shotgun!!!",
                    "score": 2,
                    "author": "blanketswithsmallpox"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Seems like he was hindered by cloud the first night. For anyone interested, more of the story is here. People saying he just drove by this by chance are a bit clueless tbh - https://g1.globo.com/rj/rio-de-janeiro/noticia/2023/06/06/fotografo-registra-cristo-redentor-segurando-a-lua-e-viraliza-na-internet.ghtml",
            "score": 26,
            "author": "Naeplan",
            "replies": []
        },
        {
            "level": 0,
            "comment": "atlas be like",
            "score": 14,
            "author": "Arzene98",
            "replies": [
                {
                    "level": 1,
                    "comment": "Just shrug already!   \n\nAtlas held Earth, not the moon. This is just some Hey Zeus wannabe.  \n\nFeels like I should be able to work in another /s or two there, but I'm falling short.  \n\n/shrug",
                    "score": 4,
                    "author": "LakeStLouis",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I always found it weird to have a statue of some hippie shrugging",
            "score": 3,
            "author": "perpetualmotionmachi"
        },
        {
            "level": 0,
            "comment": "jeez man, help him carry it smh",
            "score": 3,
            "author": "Jaaj_Dood"
        },
        {
            "level": 0,
            "comment": "Astrological? No sir.",
            "score": 3,
            "author": "Infinite-Condition41"
        },
        {
            "level": 0,
            "comment": "&gt; astronomical calculations\n\nftfy",
            "score": 3,
            "author": "luisvcsilva"
        },
        {
            "level": 0,
            "comment": "Those astrological calculations must have been astronomical!",
            "score": 3,
            "author": "agangofoldwomen"
        },
        {
            "level": 0,
            "comment": "‘He’s got the whole moon, in his hands.\nHe’s got the whole wide moon, in his hands.’",
            "score": 8,
            "author": "SureIntroduction5547",
            "replies": []
        },
        {
            "level": 0,
            "comment": "People are talking about not needing calculations and just roaming around looking for a good angle. I don't think it's that simple.\nYou need plenty of factors to happen at the same time\n1. It has to be a day where the moon is quite big (kinda rare)\n2. The moon has to be besides it (not in front nor to the sides so let's say 25% chance)\n3. It can't be a cloudy or rainy day\n4. Has to be a full moon\n5. You need to be at the exact location at the right time\n\n\nAlso you can't just look at the moon everyday to see if it's gonna be good,by that time it would be too late, you need to be ready weeks in advance",
            "score": 12,
            "author": "hisenak",
            "replies": [
                {
                    "level": 1,
                    "comment": "Fun fact: the moon does in fact move back and forth in the sky relative to Earth. The orbit is not perfectly circular nor perfectly regular/fixed (not sure the term), so the eccentricity of the orbit moves around.\n\nSo some times the moon really is going to be bigger in the sky, just a little bit.",
                    "score": 9,
                    "author": "QuiteCleanly99",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Or is it just happy to see us?",
                            "score": 9,
                            "author": "hisenak"
                        },
                        {
                            "level": 2,
                            "comment": "[Here's a good picture from wiki showing the difference!](https://en.wikipedia.org/wiki/Orbit_of_the_Moon#/media/File:Lunar_perigee_apogee.png)",
                            "score": 3,
                            "author": "Pete_Iredale",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "A lot bit! I didn't know the difference in scale was as much as 12%",
                                    "score": 2,
                                    "author": "QuiteCleanly99"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "There are apps that will tell you exactly where the moon will be at any given moment. Or you can query it for a specific location and it’ll tell you when that’ll occur. It’s really simple.",
                    "score": 1,
                    "author": "MayIServeYouWell",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes, but you still need to do the work to find a suitable vantage point, which can be extremely specific depending on what kind of alignment you’re going for. It’s not an especially difficult process, but it does require a certain amount of understanding.",
                            "score": 2,
                            "author": "KristnSchaalisahorse",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Could have atleast saved up for a good lense in that time",
            "score": 4,
            "author": "wojadzer1989"
        },
        {
            "level": 0,
            "comment": "reminds me of that naruto ninja war scene ngl",
            "score": 2,
            "author": "Raizel999"
        },
        {
            "level": 0,
            "comment": "And now, it's mine.",
            "score": 2,
            "author": "mrrobot01001000"
        },
        {
            "level": 0,
            "comment": "🧱",
            "score": 2,
            "author": "Creative_Ad963"
        },
        {
            "level": 0,
            "comment": "It would be so much easier to just photo shop it and lie",
            "score": 2,
            "author": "Lucidification"
        },
        {
            "level": 0,
            "comment": "🎶 He’s got the whole moon, in his hands. 🎶",
            "score": 2,
            "author": "AlternativeQuality2"
        },
        {
            "level": 0,
            "comment": "Imagine if it was cloudy",
            "score": 2,
            "author": "secretlyasquirrel2"
        },
        {
            "level": 0,
            "comment": "\"Citizens of Rio, lend me your energy!\" - Jesus",
            "score": 2,
            "author": "omnie_fm"
        },
        {
            "level": 0,
            "comment": "Astronomical* note astrology, but the photo look very great !",
            "score": 2,
            "author": "SlurpSchmurtS"
        },
        {
            "level": 0,
            "comment": "Charging his attack to flatten Rio.",
            "score": 2,
            "author": "Trips-Over-Tail"
        },
        {
            "level": 0,
            "comment": "Not sure what astrology has to do with this.",
            "score": 2,
            "author": "slade797",
            "replies": []
        },
        {
            "level": 0,
            "comment": "If that was me, I’d do all the leg work, patiently wait for the right day, drive out to the location, and then it’d be cloudy.",
            "score": 2,
            "author": "cheesyoperator"
        },
        {
            "level": 0,
            "comment": "Jesus with a spirit bomb.",
            "score": 2,
            "author": "Kite31"
        },
        {
            "level": 0,
            "comment": "I’d say he’s stealing the moon but he kinda already owns it",
            "score": 2,
            "author": "lonestarcom"
        },
        {
            "level": 0,
            "comment": "He's got the whole world in his hands",
            "score": 2,
            "author": "buggabugga2"
        },
        {
            "level": 0,
            "comment": "Guy studies photography, ~~astrology~~ astronomy, a little about weather, does a massive effort to calculate best window of time to take this awesome picture.\n\nChecks linkedin, all sorts of religious pages hijacked the picture to use as some sort of religious motivacional discourse and no credit to the poor bastard Leonardo Sens. (leosens @ Instagram, by the way).",
            "score": 2,
            "author": "RPandorf"
        },
        {
            "level": 0,
            "comment": "Worth the wait",
            "score": 2,
            "author": "BusinessBread"
        },
        {
            "level": 0,
            "comment": "Jesus is Mooning us!",
            "score": 2,
            "author": "ZogNowak"
        },
        {
            "level": 0,
            "comment": "-nomical",
            "score": 2,
            "author": "da_Aresinger"
        },
        {
            "level": 0,
            "comment": "That’s the first interesting forced perspective picture in thirty years.",
            "score": 2,
            "author": "TheHistorian2",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Jesus shrugged.",
            "score": 2,
            "author": "Whoooosh_1492"
        },
        {
            "level": 0,
            "comment": "Just imagine all the other people that took a similar picture, just because they were there, at the right time 🤷",
            "score": 2,
            "author": "Primary-Balance-4235",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Christians are so weird.",
            "score": 2,
            "author": "HerbEversmells88"
        },
        {
            "level": 0,
            "comment": "That’s a big hat",
            "score": 2,
            "author": "Javander"
        },
        {
            "level": 0,
            "comment": "Looks like Jesus is charging up his finishing move",
            "score": 2,
            "author": "oliveboimario"
        },
        {
            "level": 0,
            "comment": "[Close enough 😂](https://i.imgur.com/evfwR9d.jpg)",
            "score": 2,
            "author": "mohanen"
        },
        {
            "level": 0,
            "comment": "Can’t you just move your camera to get the right angle or am I stupid?",
            "score": 2,
            "author": "HeftyRecommendation5",
            "replies": []
        },
        {
            "level": 0,
            "comment": "r/suddenlyatlas",
            "score": 2,
            "author": "i_dive_4_the_halibut"
        },
        {
            "level": 0,
            "comment": "I got the whole moon in my hands",
            "score": 2,
            "author": "pegLegNinja1"
        },
        {
            "level": 0,
            "comment": "Big flex. This is epic!",
            "score": 2,
            "author": "Superb-Intention3425"
        },
        {
            "level": 0,
            "comment": "So Jesus knows the Spirit Bomb… I learned something today.",
            "score": 2,
            "author": "Juubi217"
        },
        {
            "level": 0,
            "comment": "Jesus is about to drop the spirit bomb",
            "score": 2,
            "author": "Lil_Cumster"
        },
        {
            "level": 0,
            "comment": "Actual photo of me after a cram for 24 hours for exams😂",
            "score": 2,
            "author": "By-the-power-of-REEE"
        },
        {
            "level": 0,
            "comment": "Bro about to throw the meanest spirit bomb",
            "score": 2,
            "author": "BlackJackSamurai"
        },
        {
            "level": 0,
            "comment": "*astronomical",
            "score": 2,
            "author": "MagicSPA"
        },
        {
            "level": 0,
            "comment": "?? is he in a wheelchair? Couldn't he change position untill the full moon lined up? What would need to be calculated accepted the next full moon in the general direction of the statues back?",
            "score": 2,
            "author": "JoshsPizzaria",
            "replies": []
        },
        {
            "level": 0,
            "comment": "So Jesus is Goku?",
            "score": 3,
            "author": "ecs2"
        },
        {
            "level": 0,
            "comment": "He's got the whole moon...",
            "score": 5,
            "author": "WolfgangSho",
            "replies": [
                {
                    "level": 1,
                    "comment": "In his hands.",
                    "score": 3,
                    "author": "ernster96"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Or he just drove around until he got the perfect location.",
            "score": 2,
            "author": "kempff",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Looks like a lamp post, just saying",
            "score": 2,
            "author": "Alarming-Escape-8716"
        },
        {
            "level": 0,
            "comment": " Everyone in the comments HATES this photographer, LETS GET HIM",
            "score": 2,
            "author": "ReplyNotficationsOff"
        },
        {
            "level": 0,
            "comment": "That’s awesome! And a hell of a good job of planning. And waiting.",
            "score": 2,
            "author": "nomo_corono"
        },
        {
            "level": 0,
            "comment": "Damn, and all he had to take the picture was a potato..",
            "score": 2,
            "author": "leavethisearth"
        },
        {
            "level": 0,
            "comment": "Did he use digital zoom because its badly executed",
            "score": 2,
            "author": "Nitesen"
        },
        {
            "level": 0,
            "comment": "There's a trick to remember which is which:\n\nThe word \"astronomy\" originates from the Greek word \"astronomia,\" which is derived from \"astron\" meaning \"star\" and \"nomos\" meaning \"law\" or \"order.\"   \nTherefore, astronomy essentially means \"the laws or order of the stars.\"\n\nWhereas \"astrology\" is focused around the word \"log\", which is derived from the back passage of a male bovine.   \nTherefore, astrology essentially means \"bullshit\".",
            "score": 2,
            "author": "FireBendingNinja"
        },
        {
            "level": 0,
            "comment": "It's a little off, to the right",
            "score": 2,
            "author": "The_Nerd_Sweeper"
        },
        {
            "level": 0,
            "comment": "He’s got the whoooole world in his hands. He’s got the whoooole world in his hands.",
            "score": 3,
            "author": "Ok_Impact_4345"
        },
        {
            "level": 0,
            "comment": "nowadays 3 secs using AI",
            "score": 3,
            "author": "Due-Maintenance53822",
            "replies": []
        },
        {
            "level": 0,
            "comment": "1. Astrology has nothing to do with this. Astronomy is what you’re looking for\n\n2. A 3 year wait? Give me a break. A full moon occurs every 27.x days (just shy of 28). You might end up with a cloudy sky on occasion, but this should not take more than 2-3 lunar cycles to get a clear night with a full moon\n\n3. You do not have to have *perfect planetary alignment* to get a shot like this. Move left, right, up, or down a bit and you can align the moon (or any other celestial body) with anything in the foreground.\n\nPost is not IAF",
            "score": 1,
            "author": "BradOrPonceDeLeone",
            "replies": []
        },
        {
            "level": 0,
            "comment": "*Astronomical. Astrology has no calculations",
            "score": 1,
            "author": "Striking-Version1233",
            "replies": []
        },
        {
            "level": 0,
            "comment": "He could have just photoshopped it. He knows that right?",
            "score": 0,
            "author": "Gloworm02",
            "replies": [
                {
                    "level": 1,
                    "comment": "Everything can be faked, but sometimes it sparks joy to do it in a genuine (or oldskool) way. And sonetimes the preparations are just as fun as the result.",
                    "score": 4,
                    "author": "M_Sadr",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why all the calculation?  You can just move the camera where it needs to be…\n\nSounds like BS made up to get upvotes.",
            "score": 1,
            "author": "pineapple-predator"
        },
        {
            "level": 0,
            "comment": "That's no moon.",
            "score": 1,
            "author": "rtosser"
        },
        {
            "level": 0,
            "comment": "the weight's on his shoulders",
            "score": 1,
            "author": "ItsPwn"
        },
        {
            "level": 0,
            "comment": "What a majestic sight",
            "score": 1,
            "author": "BarajasLloyd592"
        },
        {
            "level": 0,
            "comment": "Christ The Moon Atlas",
            "score": 1,
            "author": "spazzyattack"
        },
        {
            "level": 0,
            "comment": "refuckinspect",
            "score": 1,
            "author": "WanderingBraincell"
        },
        {
            "level": 0,
            "comment": "I thought the meteor creator on the left was supposed to be bottom right?",
            "score": 1,
            "author": "Erow69",
            "replies": [
                {
                    "level": 1,
                    "comment": "Brazil is in the southern hemisphere, so they see the moon as \"upside-down\" compared to the northern hemisphere.",
                    "score": 2,
                    "author": "Bill_buttlicker69",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ok I looked it up and your right but still in the pic it's in the wrong place. Where I see bottom slight right , they would see top slight right. It's a mirror image",
                            "score": 2,
                            "author": "Erow69",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Pretty amazing shot.",
            "score": 1,
            "author": "SweetBadRock"
        },
        {
            "level": 0,
            "comment": "Sisyphus, done with his task.",
            "score": 1,
            "author": "jaan_dursum"
        },
        {
            "level": 0,
            "comment": "With his old digital camera.",
            "score": 1,
            "author": "Synthiss"
        },
        {
            "level": 0,
            "comment": "took the photo with a refurbished iphone 6s smh",
            "score": 1,
            "author": "stonethugznharmony"
        },
        {
            "level": 0,
            "comment": "Astrological.. lel. Too bad that rock is blocking *Mars*.",
            "score": 1,
            "author": "DeNir8"
        },
        {
            "level": 0,
            "comment": "Imagine waiting three years for a 480p image",
            "score": 1,
            "author": "astro3naut"
        },
        {
            "level": 0,
            "comment": "Dude could've just taken three steps to the left and lowered his camera 8 inches, and he would've caught the same image 3 years ago.",
            "score": 1,
            "author": "thatstickerguy",
            "replies": []
        }
    ]
}