{
    "id": "1437srg",
    "score": 25254,
    "title": "Are you for or against this sub participating in the June 12 shutdown to protest API changes?",
    "author": "_Iiah_",
    "date": 1686127898.0,
    "url": "https://www.reddit.com/r/interestingasfuck/comments/1437srg",
    "media_urls": [
        "https://i.redd.it/qet5n29x7k4b1.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\n**This is a heavily moderated subreddit. Please note these rules + sidebar or get banned:**\n\n\n* If this post declares something as a fact, then proof is required\n* The title must be fully descriptive\n* No text is allowed on images/gifs/videos\n* Common/recent reposts are not allowed (posts from another subreddit do not count as a 'repost'. Provide link if reporting)\n\n*See [this post](https://redd.it/ij26vk) for a more detailed rule list*\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/interestingasfuck) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "They'll have to pry old.reddit from my cold dead hands",
            "score": 3303,
            "author": "GodsOffsider",
            "replies": [
                {
                    "level": 1,
                    "comment": "When Old.Reddit is taken away, that will be my last day on reddit. \n\n... not out of protest ...\n\n...  I just hate how MySpaced current gen reddit is",
                    "score": 1034,
                    "author": "The_Fiji_Water",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "100%. 1/3 of their user base still uses old reddit, they'd be fools to think we're being lazy and not that we sincerely loathe the Facebook Feed approach. I want to look at 10-20 articles at once b/c most of them are either uninteresting or I've already read them. It's an absurd amount of scrolling to get through 100 posts on new reddit, it's like 3 wheel flicks down on old.",
                            "score": 369,
                            "author": "Smooth-Dig2250",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Old Reddit wasn't appealing as an advertising vehicle so they copied the other social medias and made every post take up your whole damn screen (so that every ad, can take up your whole damn screen, you can't miss it). This is why we can't have nice things, unchecked greed.",
                                    "score": 218,
                                    "author": "KitchenLoavers",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "how did reddit make money before?",
                                            "score": 14,
                                            "author": "Weary-Kaleidoscope16",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Tbh I dunno, but they kept the site running and we got ads, the shift to new Reddit layout that mimics most other social media platforms gets more bang for your buck on advertisements but I think they had the less lucrative 'banner ads' and stuff like that before they reworked the front page and before promoted posts were a thing.\n\nI think it went something like this: they kept the lights on but never really made heaps of cash with business model A which is what attracted their userbase in the first place. They're gradually shifting to a new business model, where posts take up your whole screen because a whole-screen ad (ie promoted post) makes the platform a lot more money than banner ads ever could. Thing is, user generated content is the reason to visit Reddit, so the more ads they water that down with the less likely users are to come consume content, or to generate more content for them. So rather than foster this great thing they created which they made a little money on, they're choosing to move towards this less-great thing so that they can show more profits to the investors or whatever. \n\nSame reason everything is going to shit in the world, unfettered greed. People who have way more than they could ever need or even use in a lifetime, and only want more.",
                                                    "score": 40,
                                                    "author": "KitchenLoavers"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "These types of problems are always complex. [Reddit has never been profitable ](https://www.forex.com/en-us/news-and-analysis/reddit-ipo/) so this isn't a traditional money grab from the standpoint of a grotesquely profitable company just wanting more money.   \n\nNot sure what their options are.   No business can run forever and just keep losing money.   I don't like the API grab either and their native app is shit.   \n\ntough problem to solve especially as this latest attempt at revenue generation is pissing all of their users off.",
                                                    "score": 6,
                                                    "author": "r_barchetta",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt; Reddit has never been profitable\n\n&gt; In 2022, Reddit reported $430 million in revenue.\n\nseems like a management problem to me",
                                                            "score": 3,
                                                            "author": "qpqpdbdbqpqp"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "From this link five months ago it looks like it's significantly less than a third, unfortunately:\n\nhttps://www.reddit.com/r/TheoryOfReddit/comments/zvbm6q/what_percentage_of_users_use_old_reddit_vs_the/?utm_source=reddit&amp;utm_medium=usertext&amp;utm_name=videos&amp;utm_content=t1_jn0vou5",
                                    "score": 25,
                                    "author": "woze",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I think a lot of users might not realize it's an option. Plenty have joined since it was implemented as the default.  \n\nAlso, I've been automatically switched to the new version a few times and it took me a moment to realize I could go back to the old, the first time it happened.",
                                            "score": 14,
                                            "author": "RakeScene"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "That report is based on the URLs. When you set old in RES, or your settings, it shows as old without the URL which is what the tracking data is based off.",
                                            "score": 9,
                                            "author": "Pantz_Party"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "As a mod, I sadly second this. It's far, far less than 1/3.\n\n*BUT*: I'd say that people who still use old.reddit represent a huge part of users that post quality content. My fear is that the blackouts or user migrations in July won't kill reddit. But change it a lot. Reddit might become a sad, sad place consisting of bots and low-effort posts, of guerilla marketing and self-promoting.",
                                            "score": 30,
                                            "author": "Geruchsbrot",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "It would be a minor \"loss\" for them if legacy users leave. Those who use old reddit are also probably those who use adblock and also are the first ones to protest any changes. So with us gone it would be a more monetize-able userbase. \n \nNew users don't know anything about reddit' history and take new reddit as what made reddit good when in reality it is the opposite of good. \n \nIf we leave it won't make a dent in their numbers. Those numbers are heavily padded by bots and spammers anyways.",
                                            "score": 64,
                                            "author": "poopellar",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You know, if I leave, I don't care any bit about what happens to reddit after it. That includes they continuing having a successful business.\n\nI don't really think this protest will have an impact, because as you said, aware people don't have any leverage. But it doesn't really matter. If reddit wants to continue their enshitification, it's just a matter of leaving and starting threads somewhere else. It doesn't matter how many people want the image-based locked-down experience.",
                                                    "score": 28,
                                                    "author": "marcosdumay",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "LOL you just tell me where we are going next. :P",
                                                            "score": 13,
                                                            "author": "Sufficient_Coast_852"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Just gonna drop Corey Doctorow's \"Enshittification\" article here, because it's a masterpiece:  https://www.wired.com/story/tiktok-platforms-cory-doctorow/",
                                                            "score": 8,
                                                            "author": "Nope_notme",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Right.  We really have no leverage. \n\nThe shitification of Reddit has been in motion for years.  It's just like every other niche sub that rapidly gets big.",
                                                    "score": 35,
                                                    "author": "The_Fiji_Water"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "It won’t make a dent in their numbers *immediately*, but I’d be surprised if the redditors who make good posts don’t overlap a significant amount with those who would leave.",
                                                    "score": 10,
                                                    "author": "PepperAnn1inaMillion"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "The disabled users have trouble with new reddit and the official app. We will find out but the disabled may be our champions in keeping functional user interface.",
                                                    "score": 7,
                                                    "author": "boxer_dogs_dance"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "If they kill old reddit and we ditch the platform, everyone should overwrite their old comments so Reddit can’t benefit from decades of our free content. \n\nI want googled search results to come back barren and empty. If they want to play hardball, so can we.",
                            "score": 19,
                            "author": "SilverishSilverfish",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If they kill old.reddit nothing will change\n\n... it's the sad reality.",
                                    "score": 4,
                                    "author": "The_Fiji_Water"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I cannot stand that new reddit scroll feed bullshit. It's all designed to give advertisers more space and visibility when you can force people to actually watch the promoted content when it's already open.",
                            "score": 6,
                            "author": "DroidTrf"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "And even then I’d have glued it to my cold dead hands",
                    "score": 3,
                    "author": "Oblivionpelt"
                }
            ]
        },
        {
            "level": 0,
            "comment": "For",
            "score": 3959,
            "author": "honolulu072",
            "replies": [
                {
                    "level": 1,
                    "comment": "As 95% of my reddit browsing is on infinity, I am 105% for",
                    "score": 154,
                    "author": "djbiti1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Infinity is truly the GOAT",
                            "score": 20,
                            "author": "Schmensch-",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Infinity is giga",
                                    "score": 3,
                                    "author": "Chota_Itachi"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "If infinity goes, then my account guys with it.",
                            "score": 7,
                            "author": "Kryostar"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "For",
                    "score": 570,
                    "author": "Snoo-24880",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "*For*",
                            "score": 402,
                            "author": "SmackMyGiraffes",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "ℱℴ𝓇",
                                    "score": 309,
                                    "author": "EvillyHedgeImplies",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Fer",
                                            "score": 185,
                                            "author": "Oshag_Henesy",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Fó",
                                                    "score": 147,
                                                    "author": "lgcosta7",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "F4",
                                                            "score": 114,
                                                            "author": "Ginomania",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Thor",
                                                                    "score": 70,
                                                                    "author": "AyAyy-Ron",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Fore!",
                                                                            "score": 65,
                                                                            "author": "maqij",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Phore. \n\nSent from rif",
                                                                                    "score": 59,
                                                                                    "author": "the_honeyman",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "4",
                                                            "score": 32,
                                                            "author": "nalonso",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "IIII",
                                                                    "score": 13,
                                                                    "author": "TootyMcTooterSon",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "For",
                    "score": 22,
                    "author": "Bayareaquestioner"
                },
                {
                    "level": 1,
                    "comment": "For Karl!",
                    "score": 53,
                    "author": "PurplePartyParasaur",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 19,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "ROCK AND STOOOOONEE",
                            "score": 3,
                            "author": "EpicSausage69"
                        },
                        {
                            "level": 2,
                            "comment": "Rock and Stone!",
                            "score": 3,
                            "author": "Ipodk9"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I don't understand how people could be anything but for this.",
                    "score": 28,
                    "author": "Jonescjosh",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "4",
                    "score": 24,
                    "author": "Ancient-Practice-431"
                },
                {
                    "level": 1,
                    "comment": "f o r",
                    "score": 30,
                    "author": "ScruffyTheJanitor__",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "So Reddit won’t allow bots to moderate but WILL allow bots to spam?",
            "score": 899,
            "author": "sobi-one",
            "replies": [
                {
                    "level": 1,
                    "comment": "Spamming is presumably less API - intensive, so pretty much, yeah.",
                    "score": 317,
                    "author": "Venomousfrog_554",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Spammers will just change their methods and not use the API. Plenty of libraries exist to make http calls that look like they're coming from a regular browser as though a human were doing it.",
                            "score": 120,
                            "author": "Jonno_FTW",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Spammers don't have to respect any API restrictions. They are already breaking ToS - might as well go all the way.",
                            "score": 94,
                            "author": "ACCount82"
                        },
                        {
                            "level": 2,
                            "comment": "Accurate? Spam bots don’t send API requests they just send messages like you or me.",
                            "score": 31,
                            "author": "K1FF3N",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "How do you mean? Through selenium or other like headless browser modes? Or are you saying they're physically a person posting/commenting like you and me but just in some tiny sweat shop in india with like 50 browsers+phones spamming away?",
                                    "score": 4,
                                    "author": "WinterCool",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Scraping and headless browser. \n\nAt a conference about six months ago, I saw a new AI tool that can translate their seemingly random divs into meaningful blocks. It renders the page and passes it and the source to an ai that basically un-grinds the sausage. \n\nIt makes it much easier to write bots that don’t get confused by obfuscation / naming changes.",
                                            "score": 12,
                                            "author": "Roofofcar"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Shut It Down.",
            "score": 301,
            "author": "Least_Adhesiveness_5",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Shut it down!",
            "score": 444,
            "author": "KCFiredUp",
            "replies": [
                {
                    "level": 1,
                    "comment": "https://imgur.com/1txM5Uc.gif",
                    "score": 25,
                    "author": "-UselessUterus-",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "https://media.tenor.com/ZyvcShFvyKIAAAAC/shut-it-down-dark-city.gif",
                    "score": 4,
                    "author": "Zefrem23",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "For",
            "score": 129,
            "author": "3PointMolly"
        },
        {
            "level": 0,
            "comment": "Yes.  I was reading about the accessibility issues on another sub.  I won't like it but I definitely support the shut down.",
            "score": 463,
            "author": "SefinaBallerina",
            "replies": [
                {
                    "level": 1,
                    "comment": "appreciate the solidarity!",
                    "score": 54,
                    "author": "clumsy_poet"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm for the protest",
            "score": 1410,
            "author": "phory",
            "replies": [
                {
                    "level": 1,
                    "comment": "Given the fact that they are trying to not only take choice away but take actual *access* to the site away from blind Redditors, I think it's mandantory to join in!",
                    "score": 111,
                    "author": "uDontInterestMe",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Yeah, same!",
                    "score": 89,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ditto ...",
                            "score": 19,
                            "author": "Mackie_Macheath"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "As am I",
                    "score": 18,
                    "author": "IceYetiWins"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Well, you know what they say. The more, the merrier.",
            "score": 100,
            "author": "Nearsighted_Madman",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Do it.",
            "score": 24,
            "author": "Agreeable-Buffalo-54"
        },
        {
            "level": 0,
            "comment": "Absolutely. The current generation of technology is fucked and needs to collapse on itself.",
            "score": 24,
            "author": "dosed_mortem"
        },
        {
            "level": 0,
            "comment": "For!",
            "score": 65,
            "author": "_blackknightjax_"
        },
        {
            "level": 0,
            "comment": "Is that a fucking plumbis from Rick and morty blurred out",
            "score": 357,
            "author": "beanhorkers",
            "replies": [
                {
                    "level": 1,
                    "comment": "First, they take the dinglebop and they smooth it out with a bunch of schleem",
                    "score": 147,
                    "author": "Stiv_McLiv",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The schleem is then repurposed for later batches.",
                            "score": 67,
                            "author": "Zip668",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Huh.. I always wondered how a Plumbis was made..",
                                    "score": 39,
                                    "author": "knowigot_that808",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Sorry i wanted actual porn on the anti porn spam post",
                    "score": 10,
                    "author": "Jestingwheat856"
                },
                {
                    "level": 1,
                    "comment": "They won me over to their cause with their strategically inserted plumbis",
                    "score": 62,
                    "author": "Hotpod13"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I favor protest, for as long as it takes to fix the API.",
            "score": 55,
            "author": "haladura",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I'm for shutting it all down indefinitely, until they relent.",
            "score": 137,
            "author": "anfotero",
            "replies": [
                {
                    "level": 1,
                    "comment": "Exactly. Not really a fan of this \"oh it'll be gone for 3 days that'll show em\"\n\nWe need to shut down UNTIL they change their minds. 3 days is gonna do nothing. Reddit could not care less if subs shut down for a few days.",
                    "score": 34,
                    "author": "DorrajD",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "All for it",
            "score": 79,
            "author": "Meoooooooooooooooow"
        },
        {
            "level": 0,
            "comment": "For",
            "score": 301,
            "author": "Kirikou97212",
            "replies": [
                {
                    "level": 1,
                    "comment": "Shut these mother fuckers down permanently till reddit gives in\n\nNone of this two day bull shit,  that's a slap on the wrist, all subs dip till demands are met and they might listen",
                    "score": 106,
                    "author": "DarkandDanker",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m not personally invested in the reddit change, I really don’t care. \n\nHowever, I completely agree with your take. Either shut down permanently until your desired change is made or it’s just a temporary hissy fit that reddit will ignore.",
                            "score": 18,
                            "author": "gt4674b",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Fuck. Yeah.",
                            "score": 3,
                            "author": "kreeshanman"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Do it!",
            "score": 14,
            "author": "razorbladethorax"
        },
        {
            "level": 0,
            "comment": "Aye!",
            "score": 14,
            "author": "dyedfire"
        },
        {
            "level": 0,
            "comment": "I am for it",
            "score": 14,
            "author": "funnylol96"
        },
        {
            "level": 0,
            "comment": "Can i ask how these 3rd party apps help visually impaired humans? I'm really curious but i have never used such apps so i'm not aware.",
            "score": 87,
            "author": "voidminecraft",
            "replies": [
                {
                    "level": 1,
                    "comment": "Here’s one example. Just scroll down and there are issues about main platforms listed :)\n\n[How Reddit will be removing its visually impaired users](https://www.reddit.com/r/AmITheDevil/comments/140ijf5/mods_of_rblind_reveal_that_removing_3rd_party/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=ioscss&amp;utm_content=1&amp;utm_term=1)",
                    "score": 126,
                    "author": "_Iiah_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you very much!",
                            "score": 23,
                            "author": "voidminecraft",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Would like to add a piece of info. r/blind are saying that if the change pass they'll simply close their sub. I mean what's the point of sub for blind people if they can't access it.",
                                    "score": 8,
                                    "author": "FlawlessRuby",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Wow, reddit is being such a cheapskate.",
                                            "score": 4,
                                            "author": "voidminecraft",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Reddit CEO: No need to improve our official app if it's the only app!",
                                                    "score": 6,
                                                    "author": "FlawlessRuby"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Oop - im new to links, you’re gonna want to click the post that my link shows inside of it. Whoops… I am not techy",
                                    "score": 21,
                                    "author": "_Iiah_",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "This is a very important facet of this issue that isn't getting enough attention.  Reddit is essentially nuking accessibility.",
                            "score": 3,
                            "author": "UnacceptableOrgasm"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "For",
            "score": 49,
            "author": "SizeDoesMatter5"
        },
        {
            "level": 0,
            "comment": "So if Reddit loses its platform that people love… where’s everyone gonna go??",
            "score": 9,
            "author": "harris023",
            "replies": [
                {
                    "level": 1,
                    "comment": "Outside?",
                    "score": 16,
                    "author": "Panic_Azimuth"
                },
                {
                    "level": 1,
                    "comment": "Reddit's mum's house",
                    "score": 3,
                    "author": "Genids"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You have my axe",
            "score": 8,
            "author": "DaSecretSlovene"
        },
        {
            "level": 0,
            "comment": "For",
            "score": 139,
            "author": "CapstanLlama"
        },
        {
            "level": 0,
            "comment": "For it.",
            "score": 45,
            "author": "sugarified"
        },
        {
            "level": 0,
            "comment": "Even though it does not affect me i don't like corporations doing stuff like this so I'm for it",
            "score": 249,
            "author": "AliHakan33",
            "replies": [
                {
                    "level": 1,
                    "comment": "It'll make your browsing experience shittier. It affects everyone.",
                    "score": 90,
                    "author": "IGISB"
                },
                {
                    "level": 1,
                    "comment": "That's the problem, it *does* affect you: without access to the API, managing and modding tools will be much less accessible and helpful.\n\nEven if you pay for it as they want, they are still cutting access to NSFW content through the API, therefore allowing spam NSFW bots to contaminate each and every subreddit possible.",
                    "score": 66,
                    "author": "_Artanos",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I’m using the official app, and don’t use Reddit much, still for it for exactly this reason",
                    "score": 3,
                    "author": "drunkdrivinginspace"
                }
            ]
        },
        {
            "level": 0,
            "comment": "100% for it. I won't be using reddit then anyway",
            "score": 9,
            "author": "reallycool_opotomus"
        },
        {
            "level": 0,
            "comment": "I wasn't even aware I had an option, I've just been using the plain old reddit app the whole time. But no biggie, do what you gotta do. A small break for me from social media is probably not the worst thing.",
            "score": 10,
            "author": "Twinkles21"
        },
        {
            "level": 0,
            "comment": "For",
            "score": 25,
            "author": "Gloomy-Employment-72"
        },
        {
            "level": 0,
            "comment": "For",
            "score": 25,
            "author": "Quiby123"
        },
        {
            "level": 0,
            "comment": "I’m for it. Love to participate in some good drama that make rich people lose money.",
            "score": 23,
            "author": "BiggestPenisOnReddit",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Absolutely For. Reddit should be for it as well since the loss of RIF is the loss of me. Not that I matter that much but I'll be sad.",
            "score": 7,
            "author": "loulamachine"
        },
        {
            "level": 0,
            "comment": "Absolutely! The people using these apps are not only reading, but are engaging as community members by posting, commenting, and voting.",
            "score": 99,
            "author": "potterpockets"
        },
        {
            "level": 0,
            "comment": "I am fine with the blackout, as I exclusively use a 3rd party app\n\nBut I refuse to go to Twitter like they tell me in the last paragraph",
            "score": 99,
            "author": "Theleming",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah. No twitter. Fuck that.",
                    "score": 18,
                    "author": "Boo_hoo_Randy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Bro I'm i the only one that had no clue about these and has just been using the normal app all this time?",
            "score": 510,
            "author": "Aponsk",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is a quote from Apollo, one of the third party apps. Yes, a lot of people use 3rd party apps. \n\n&gt;Apollo made 7 billion requests last month, which would put it at about 1.7 million dollars per month, or 20 million US dollars per year.",
                    "score": 27,
                    "author": "chicagodude84",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "The official Reddit app is relatively new in terms of the site’s history. Before that, you could only use Reddit from a browser or a third party app. \n\nSo anyone who’s been using the site for a long time is more accustomed to the (objectively superior) third party apps than the official one. And the moderation/bot issues will be noticeable very quickly if it goes into effect.",
                    "score": 245,
                    "author": "Mr-Thisthatten-III",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The official app *was* a third party app that Reddit bough out to make their own. It was actually good before they fucked with it.",
                            "score": 113,
                            "author": "doctapeppa",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If you’re referring to alien blue, I’m pretty sure they bought them out and let it just slowly become unusable. Maybe they hired the devs to create a new app, but once alien blue was bought it was absolutely not touched.",
                                    "score": 45,
                                    "author": "Back_To_The_Oilfield",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The current reddit app started as a fork of Alien Blue essentially, still made by the same guy/team, just re-added to the App Store as a new entry under a new name",
                                            "score": 18,
                                            "author": "Charlielx",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "GOD HOW I MISS ALIEN BLUE\n\nI am taking all of the Dark Souls subreddits I have under my wing offline though in protest, so there's some long-awaited payback I suppose.",
                                                    "score": 15,
                                                    "author": "e_0",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "As an IOS user I agree Alien Blue was the best option. I miss it terribly. \n\nThe other main apps UIs just don’t quite do it for me. I’ve settled on a smaller one called Comet which lets me do some organizing stuff I like, but it’s far from perfect.\n\nGood on ya getting some retribution",
                                                            "score": 4,
                                                            "author": "TobagoJones"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yea I just used the official app this entire time but I still support the protest",
                    "score": 18,
                    "author": "Millworkson2008",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You should try one of the third party apps, they even have legacy Reddit features. On boost for example I can sort posts by rising.",
                            "score": 6,
                            "author": "irieball",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Wait wait wait, are you saying the default Reddit app can’t sort by rising?!?!!",
                                    "score": 3,
                                    "author": "Jonoczall",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Not anymore...it only sorts by popular and latest. There's no best, there's no hot, there's no rising. Also the ads are full on posts that take up the same amount of screen as regular posts, it's also janky and laggy at times.",
                                            "score": 3,
                                            "author": "irieball",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "So you can't go into an interesting sub and sort by best of all time on the official Reddit app.\n\nWhat a heap of shit! Well done to those who've been using the official Reddit app all this time, don't know how you managed.",
                                                    "score": 3,
                                                    "author": "afroguy10",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I didn't even know there was a third party app for it",
                    "score": 118,
                    "author": "EmployeeRadiant",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lots of them and way better than the official one.  I've been using Baconreader for the last 6 years.",
                            "score": 48,
                            "author": "Cpt_Wolf",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Third party apps have been around a lot longer than the official app.\nIn fact, reddit bought one of the third party apps ages ago and repurposed it as their official app.",
                            "score": 7,
                            "author": "Kn0wmad1c"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah but the bots will still effect you. I use the stock app as well.",
                    "score": 32,
                    "author": "ScruffyTheJanitor__",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Also, apparently the bots won’t work either.",
                    "score": 3,
                    "author": "archlea"
                },
                {
                    "level": 1,
                    "comment": "I was using Joey on Android and loved it. The official app felt clunky by comparison. When I moved to IOS, I didn't find a decent 3rd party so have stuck with the Official app. I find it's navigation to be inconsistent.. but the most annoying thing.. is the ads and suggested subreddits, that I have not found any way to turn off.",
                    "score": 10,
                    "author": "n3farious",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "For",
            "score": 19,
            "author": "Ganeshadream"
        },
        {
            "level": 0,
            "comment": "For",
            "score": 25,
            "author": "Panonica"
        },
        {
            "level": 0,
            "comment": "100% for. If we're not willing to fight for reddit, who will?",
            "score": 26,
            "author": "ActualMis",
            "replies": []
        },
        {
            "level": 0,
            "comment": "For",
            "score": 56,
            "author": "vondpickle"
        },
        {
            "level": 0,
            "comment": "For, I won’t be logging into Reddit that day.",
            "score": 4,
            "author": "LordSlickRick"
        },
        {
            "level": 0,
            "comment": "Yes.",
            "score": 4,
            "author": "TacomaDomeDon"
        },
        {
            "level": 0,
            "comment": "Do it!",
            "score": 6,
            "author": "2FightTheFloursThatB"
        },
        {
            "level": 0,
            "comment": "For! In favor of. Please do this.",
            "score": 5,
            "author": "YESmynameisYes"
        },
        {
            "level": 0,
            "comment": "NO QUESTION! Shut it down!",
            "score": 4,
            "author": "This_Bitch_Overhere"
        },
        {
            "level": 0,
            "comment": "People use 3rd perty apps for reddit?? \n\nI genuinely had no clue.. but like why???? Someone explain?",
            "score": 5,
            "author": "Cosmonaut1947"
        },
        {
            "level": 0,
            "comment": "For. It is the only thing we can do to have a chance at changing it.",
            "score": 38,
            "author": "Professional_Emu_164"
        },
        {
            "level": 0,
            "comment": "For",
            "score": 47,
            "author": "jfb3"
        },
        {
            "level": 0,
            "comment": "For. \n\nBurn it all down",
            "score": 3,
            "author": "frownface84"
        },
        {
            "level": 0,
            "comment": "I’m for it. I can go without reddit for weeks and my life would probably be way more productive.",
            "score": 6,
            "author": "spiderinside"
        },
        {
            "level": 0,
            "comment": "I’m for it, although I know a lot of people say it’s just a minority of people that use these applications, I think that since that’s are used to moderate the larger subs that we will ALL be impacted if these policies become the new norm.",
            "score": 4,
            "author": "W01771M"
        },
        {
            "level": 0,
            "comment": "I'm definitely for it.  If 3rd party apps go away though, I might finally break my addiction.  Tough call.",
            "score": 4,
            "author": "Godot_12"
        },
        {
            "level": 0,
            "comment": "I'm very much for the blackout.",
            "score": 3,
            "author": "Ringleader705"
        },
        {
            "level": 0,
            "comment": "Yes",
            "score": 3,
            "author": "Impressive-End-2510"
        },
        {
            "level": 0,
            "comment": "Yes, please go dark in protest.",
            "score": 4,
            "author": "Okie_Chimpo"
        },
        {
            "level": 0,
            "comment": "FOR. These are my reasons why:\n\nI use a 3rd party app to visit Reddit\n\nI enjoy the SPAM relief that the bots give to most subs\n\nI don't normally visit NSFW subs, but I want the right to have access to anything because Im a grown adult.",
            "score": 3,
            "author": "NotVerySmarts"
        },
        {
            "level": 0,
            "comment": "Hmm count me in!",
            "score": 3,
            "author": "deasnataly"
        },
        {
            "level": 0,
            "comment": "Do it.",
            "score": 5,
            "author": "CTAMN"
        },
        {
            "level": 0,
            "comment": "Shut em all down.",
            "score": 4,
            "author": "Surfal666"
        },
        {
            "level": 0,
            "comment": "I'm hoping that every sub on the site joins in, personally.",
            "score": 3,
            "author": "Srapture"
        },
        {
            "level": 0,
            "comment": "For.",
            "score": 10,
            "author": "Accomplished_Trip_"
        },
        {
            "level": 0,
            "comment": "For",
            "score": 11,
            "author": "BlueFroggLtd"
        },
        {
            "level": 0,
            "comment": "For",
            "score": 9,
            "author": "MadaraAlucard12"
        },
        {
            "level": 0,
            "comment": "For",
            "score": 39,
            "author": "Akitten84"
        },
        {
            "level": 0,
            "comment": "For",
            "score": 25,
            "author": "Critical_Switch"
        },
        {
            "level": 0,
            "comment": "For, fo sure",
            "score": 23,
            "author": "Ms-Anthrop"
        },
        {
            "level": 0,
            "comment": "For",
            "score": 10,
            "author": "Knee_Elbow"
        },
        {
            "level": 0,
            "comment": "I'm for!",
            "score": 28,
            "author": "drunkorkid56"
        },
        {
            "level": 0,
            "comment": "The more participants, the better",
            "score": 31,
            "author": "Steampson_Jake"
        },
        {
            "level": 0,
            "comment": "Definitely for.",
            "score": 21,
            "author": "AnandaUK"
        },
        {
            "level": 0,
            "comment": "For",
            "score": 19,
            "author": "CitrusChoir"
        },
        {
            "level": 0,
            "comment": "I will be participating.",
            "score": 7,
            "author": "TrifleMeNot"
        },
        {
            "level": 0,
            "comment": "It doesn't affect me since I never knew about the 3rd party apps at all, but this is fucked up. Join the fray of blackout subs and if need be, go indefinitely... this bullshit is so obtuse. What the actual fuck, reddit...",
            "score": 8,
            "author": "Dire_rulz",
            "replies": []
        },
        {
            "level": 0,
            "comment": "If any of those apps alow you to sort feed by top of n time can anyone tell me the name?",
            "score": 3,
            "author": "IQuinnI",
            "replies": [
                {
                    "level": 1,
                    "comment": "I thought all of them did this but I use baconreader so you can try that.",
                    "score": 3,
                    "author": "flPieman",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Unrelated but I'm sad that baconreader get so little attention. It's my fav reddit app. Clean and simple.",
                            "score": 3,
                            "author": "RhetoricalOrator"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'll be done.  I will not use the reddit app and look at the dystopian ads they run on there.  \n\nHonestly,  it'll probably be good for me.",
            "score": 3,
            "author": "Violetlibrary"
        },
        {
            "level": 0,
            "comment": "I'm for it. If Reddit implements these changes. Then I simply will just stop coming to Reddit. I'm not going to use their official app. It sucks.",
            "score": 3,
            "author": "NegativeGravitas"
        },
        {
            "level": 0,
            "comment": "I am for it.. but it unfortunately wont help. RIP reddit. it was nice while it lasted.",
            "score": 3,
            "author": "BrBybee"
        },
        {
            "level": 0,
            "comment": "I just want to say, thank you for actually asking the opinion of the community. So many subs I’m in are doing this without consulting the community at all",
            "score": 3,
            "author": "Dpontiff6671"
        },
        {
            "level": 0,
            "comment": "Please let's join the protest. I use old.reddit at all times and like it. More importantly, I have visually-impaired friends who use third-party screen reader and transcriptionist services which let them be equal members of the Reddit community. This change will lock them out.",
            "score": 3,
            "author": "5CatsNoWaiting"
        },
        {
            "level": 0,
            "comment": "black it out",
            "score": 3,
            "author": "Bronco_Corgi"
        },
        {
            "level": 0,
            "comment": "Dooo it!",
            "score": 3,
            "author": "frankalope"
        },
        {
            "level": 0,
            "comment": "I’ve already started getting follows from pornbots and I hate it. Reddit was my sanctuary aware from that mess",
            "score": 3,
            "author": "colliebby"
        },
        {
            "level": 0,
            "comment": "I'm leaving.",
            "score": 3,
            "author": "PositivityKnight"
        },
        {
            "level": 0,
            "comment": "Shut it down",
            "score": 3,
            "author": "ndlv"
        },
        {
            "level": 0,
            "comment": "Yes, in fact, I plan on not using reddit in solidarity.",
            "score": 3,
            "author": "Prof-Finklestink"
        },
        {
            "level": 0,
            "comment": "For.\n\nIf they scare away some of the best redditors, they will think it's \"hardly any\" but the quality will go to shit, then will continue to decline.",
            "score": 3,
            "author": "Mechasteel"
        },
        {
            "level": 0,
            "comment": "I somehow never knew third party apps existed until all this started. :(",
            "score": 3,
            "author": "ghost-church",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Serious question: Why is Reddit making these changes?",
            "score": 3,
            "author": "thefistiecuffs",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Honestly, Fuck mod bots.  I'm sick of posts being auto deleted because people didn't use the right punctuation, or have the wrong flair.",
            "score": 3,
            "author": "Im_hated_4_asking"
        },
        {
            "level": 0,
            "comment": "Don't give a shit either way, but all these dweebs getting their shit stained boxers in a bunch over it is hilarious to me.",
            "score": 3,
            "author": "fat_drunk_and_sassy"
        },
        {
            "level": 0,
            "comment": "Yes. Go dark.",
            "score": 3,
            "author": "NightGolfer"
        },
        {
            "level": 0,
            "comment": "For.\nStrike.",
            "score": 13,
            "author": "just_3me"
        },
        {
            "level": 0,
            "comment": "I've never used 3rd party apps but I absolutely hate the bots, those need to be yeeted.",
            "score": 12,
            "author": "ScreechingPizzaCat"
        },
        {
            "level": 0,
            "comment": "For",
            "score": 14,
            "author": "dooferoaks"
        }
    ]
}