{
    "id": "143wiug",
    "score": 32515,
    "title": "Timelapse of wildfire smoke consuming the New York City skyline earlier today.",
    "author": "Temporary_Meal_2706",
    "date": 1686190788.0,
    "url": "https://www.reddit.com/r/interestingasfuck/comments/143wiug",
    "media_urls": [
        "https://v.redd.it/1s07b7hvep4b1"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\n**This is a heavily moderated subreddit. Please note these rules + sidebar or get banned:**\n\n\n* If this post declares something as a fact, then proof is required\n* The title must be fully descriptive\n* No text is allowed on images/gifs/videos\n* Common/recent reposts are not allowed (posts from another subreddit do not count as a 'repost'. Provide link if reporting)\n\n*See [this post](https://redd.it/ij26vk) for a more detailed rule list*\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/interestingasfuck) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2240,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I would have too. Holy Crap that looks awful!",
                    "score": 523,
                    "author": "AliceHall58",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Even here in south Pa woods it is heavy yellow light orange and smells bad . I am going to a friends house as she has a hepa filtered AC and air purifier. We have one window ac with leaky closure and regular filter. My friend is very kind to host me for the next few days . But this is only the beginning. We all know that right? It will clear and we will go back to regular habits without any change. I bought acres in Maine but even as I did I figured when it gets bad with drought those woods will burn. It is here, it is everywhere, no just on the near coast or the pacific coast. It is everywhere, I speak of climate change damage. I hoped it would wake people but that stupid morning joe coanchor Meeka was laughing as she spoke of the airport closing and saw pictures of NY ers wearing masks and going about their day. We are fiddling as the planet ignites and floods.",
                            "score": 142,
                            "author": "Shilo788",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The thing about climate change that makes me want to cry and also move to Maine is that there's money to be made burning this planet down.  And humans can't resist money.",
                                    "score": 57,
                                    "author": "gidonfire",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "That's a very good idea. I have asthma that's so bad atm that I have to boulder with a mask on so I don't get a chest infection from the chalk. It's a recent issue. I can't imagine how I'd cope if the air quality became that bad. Protect your lungs as much as you can!",
                                    "score": 16,
                                    "author": "Zanki",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "South Central PA actually has the worst air quality in the US right now. The AQI is like 450 in York. Good thing rain is coming in after tomorrow.",
                                    "score": 8,
                                    "author": "Socketfusion"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I’m Australian, back during the 2019-2020 bushfires I woke up at 9am and opened the blinds. The sun was gone.",
                    "score": 166,
                    "author": "Emble12",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah I remember this. Us having to download an app called Fires Near Me so we could get notified when we needed to evacuate to the beach? My heart really goes out to everyone involved in this.",
                            "score": 22,
                            "author": "nihilistsimulator"
                        },
                        {
                            "level": 2,
                            "comment": "The 2009 Sydney dust storm was wild. Looked like Mars landed on us.",
                            "score": 52,
                            "author": "SnooRobots582"
                        },
                        {
                            "level": 2,
                            "comment": "I looked out this morning and the sun was gone\n\nTurned on some music to start my day\n\nI lost myself in a familiar song\n\nI closed my eyes and I slipped away",
                            "score": 6,
                            "author": "briskt",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Rightfully so, this looks so scary like something out of movie blade runner.",
                    "score": 107,
                    "author": "herewe_go_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Or summertime in California.",
                            "score": 32,
                            "author": "sexualtyrranasaurus",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "* throws surfboard down on sunny, sandy beach and storms away...",
                                    "score": 8,
                                    "author": "Haughty_n_Disdainful",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "\"Pick up your trash. You're polluting the place!\"",
                                            "score": 8,
                                            "author": "sexualtyrranasaurus",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Sad,  but I was going to say the same, nothing unusual in good 'ole Cali.",
                                    "score": 3,
                                    "author": "superpete1414"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Oh man your on point about it looking like blade runner when it goes deep orange",
                            "score": 9,
                            "author": "duttyfoot"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's weird, with the wind and everything, I didn't even had smog or anything in my area and I am in the south part of Québec",
                    "score": 27,
                    "author": "hairybushy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Jesus, your goddamn profile pic 💀",
                            "score": 21,
                            "author": "uknownoothin",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I hate it when I fall asleep and wake up on Mars",
                    "score": 19,
                    "author": "MoffKalast"
                },
                {
                    "level": 1,
                    "comment": "Same thing happened to me. I asked my husband what time it was and when he said 2 I freaked out bc it did not look right",
                    "score": 14,
                    "author": "KyrieEleison_88"
                },
                {
                    "level": 1,
                    "comment": "Apocalypse",
                    "score": 8,
                    "author": "cats-pyjamas"
                }
            ]
        },
        {
            "level": 0,
            "comment": "There are over 700 fires burning in Canada and we're looking at the worst fire season ever.",
            "score": 2537,
            "author": "canuckcowgirl",
            "replies": [
                {
                    "level": 1,
                    "comment": "Worst fire season ever *so far*!",
                    "score": 1794,
                    "author": "Biscuits-n-blunts",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "\"Mmm, raging inferno\" - Homer Simpson",
                            "score": 67,
                            "author": "handlebartender",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Bring it on Mother Nature",
                            "score": 125,
                            "author": "bumblebee_sins",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Man’s hubris.",
                                    "score": 96,
                                    "author": "FardoBaggins",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Let me rephrase that: Mother nature, *please* just put us out of our misery.",
                                            "score": 16,
                                            "author": "TensorForce"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "If only there was some way we could have seen this coming!",
                    "score": 627,
                    "author": "freebird023",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Truly a surprise, what could’ve caused this unforeseen behavior?",
                            "score": 207,
                            "author": "froggythefish",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I’m not sure but it’s getting very warm, globally. I should turn up the AC",
                                    "score": 188,
                                    "author": "mawesome4ever",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "And don’t forget to leave the door open to cool the outside. It’s only an act of love",
                                            "score": 85,
                                            "author": "Juliette787",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Isn't it better to use your vehicle with the windows downand AC on to cool outside?",
                                                    "score": 20,
                                                    "author": "WRFGC",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Don't let them fool you into thinking your personal AC unit is a big factor in this. As temperatures rise AC is going to be increasingly important for living, and there are so so many things we could cut before getting rid of AC.",
                                            "score": 70,
                                            "author": "DukeOfBees",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Certainly for those regions that were barely habitable before AC came along and allowed those regions to flourish.\n\nWatched a docco on this some years back. It was probably on Netflix, before they decided to embrace shittification.",
                                                    "score": 10,
                                                    "author": "handlebartender"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Said the AC salesman",
                                                    "score": 22,
                                                    "author": "vxx",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "He is right. The worst offenders are yatch and private jets",
                                                            "score": 12,
                                                            "author": "Sad-Entertainment336",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I was thinking about this yesterday, go into any large office building in the US from spring to fall and the AC is set to MAXIMUM FRIGID at all times, and then notice that 80% of the desks have a portable heater running because it's too cold.\n\nHumanity deserves what it gets for being so fucking collectively stupid.",
                                            "score": 24,
                                            "author": "Bitlovin",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "*Boy this AC is incredible! I better turn on the heater too*",
                                            "score": 7,
                                            "author": "mfxoxes"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Pride Month",
                                    "score": 7,
                                    "author": "Funky_Smurf",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Makes sense. Sky was red, then orange, next it’ll be yellow followed by green, blue, and purple",
                                            "score": 9,
                                            "author": "froggythefish"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Not only that, but if only there was some way of doing something about it now! (looks at global elites whose asset portfolios resemble that of whole-ass countries, and not necessarily small ones)",
                            "score": 84,
                            "author": "GeebusNZ",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You mean like raking the forests?",
                                    "score": 48,
                                    "author": "ColorSchemings",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "People in cali should have cleaned up the leaves",
                                            "score": 13,
                                            "author": "cick-nobb",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Unfortunately he had a point buried in his ignorance. The issue with California fires is that they've always happened and now humans want them to not happen. So dry debris piles up and you don't get the NECESSARY burns to get rid of it because far too many people have built their homes where they don't belong. Furthermore, there aren't adequate regulations to have NO brush within 30 feet of your home which experts agree is enough to prevent houses from catching fire during wild fires.\n\nBasically, California needs to let burns happen constantly and without stopping them but they can't because they didn't regulate this properly from the start. Hubris of man and all that.\n\nBut yeah, rakes weren't the answer.",
                                                    "score": 41,
                                                    "author": "SlowRollingBoil",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Pour oil on it. Fire hates liquids.",
                                    "score": 13,
                                    "author": "sotoh333",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Fight fire with fire! What could go wrong?",
                                            "score": 3,
                                            "author": "jurassic2010",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "So fun fact. In Thomas Jefferson’s 1785 Notes on the State of Virginia, he writes about global warming has a whole chapter on it and the weather changes in Virginia, talking about rivers not freezing as throughorly as old people remember, less snow, more dry seasons, and a whole slew of other issues that were forcing changes in how things were done.\n\n&gt;A change in our climate…is taking place very sensibly. Both heats and colds are become much more moderate within the memory of the middle-aged. Snows are less frequent and less deep….The elderly inform me the earth used to be covered with snow about three months in every year. The rivers, which then seldom failed to freeze over in the course of the winter, scarcely ever do so now.”\n\nHis belief was that deforrestation was the culprit. \n\nShit it’s not something new people are sticking our heads in the ground about.\n\nedit: added quote.",
                            "score": 56,
                            "author": "MisterMetal",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That is likely when the planet was exiting what is called the little Ice Age. \n\nhttps://en.wikipedia.org/wiki/Little_Ice_Age\n\nIt coincided with a period of reduced solar activity called the Maunder minimum, but there is no proven causation.\n\nhttps://en.wikipedia.org/wiki/Maunder_Minimum\n\nOf course, today it is used to deny the science behind CO2 caused global warming, by claiming that it is all due to the sun, even though there is no evidence that sun is showing any sign of changed activity that correlates to the increasing temperature.",
                                    "score": 78,
                                    "author": "ibhunipo",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I laughed way harder than I should have at this",
                            "score": 36,
                            "author": "AdolfHitlersUpperLip"
                        },
                        {
                            "level": 2,
                            "comment": "Funny thing is that over here In Scandinavia we have negative degrees during the night in some places haha\n\nThe world really is falling apart and gee I wonder why",
                            "score": 14,
                            "author": "That_big_boii",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah night is fresh for sure. But during the day it's 25 where I am. Definitely not cold. But yeah the wind is cold.",
                                    "score": 7,
                                    "author": "AdvancedPhoenix",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Had snow in Kiruna in the begining of June haha",
                                            "score": 5,
                                            "author": "That_big_boii",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "We're not even in fire season yet. Already an area the size of Belgium has burned.",
                    "score": 13,
                    "author": "lsop",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Reminds me of the 2019-2020 bushfire season in Australia. It turned New Zealands Ski slopes brown. They're 2000 km away !",
                    "score": 9,
                    "author": "l1ghtning"
                },
                {
                    "level": 1,
                    "comment": "Australia is about to out do you guys when our season starts.",
                    "score": 5,
                    "author": "SnooRobots582"
                },
                {
                    "level": 1,
                    "comment": "There were some in Michigan as well.\n\nAnd I gotta buy some N95 masks to play it safe.",
                    "score": 20,
                    "author": "486Junkie",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Welcome to 2023 and for the foreseeable future.\n\nPeople should watch this awesome documentary from the future (or is it from now) called :\n\nDon't look up",
                    "score": 17,
                    "author": "Immediate-Savings563"
                },
                {
                    "level": 1,
                    "comment": "Good thing conservative provincial governments are slashing wild fire fighting budgets!",
                    "score": 11,
                    "author": "monsantobreath",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The trick is to eliminate funding for the fire reporting and monitoring systems. \n\n\"First year ever! Zero reported wildfires in Canada. The conservative movement is working!\"",
                            "score": 5,
                            "author": "sp847242"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is how it was in NorCal around covid time. No one was on the road and it looked like this. Felt like an apocalypse movie.",
            "score": 1378,
            "author": "besameput0",
            "replies": [
                {
                    "level": 1,
                    "comment": "The time is now 2049.",
                    "score": 27,
                    "author": "148637415963",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Colorado was hell in 2020 as well.  The fucking onset of winter couldn’t even kill the Cameron Peak fire that consumed the entire face of the Front Range north of Denver (also known as a “minor incident” compared to annual million acre conflagrations in California).  Welcome to our climate despair, New York!",
                    "score": 381,
                    "author": "PastAbbreviations702",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Dude, I live in California, and lived through that. Had ash Fallin on me and everything. Flew to Colorado for work... And there was ash falling on me there too. It was 2020, and it just felt like the whole world was burning.",
                            "score": 177,
                            "author": "Hopeful_Hamster21",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I drove out to Colorado from the southeast that summer. I felt the same sentiment. That the world was ending. Driving away from colossal forest fires, through a pandemic was unnerving.",
                                    "score": 31,
                                    "author": "cooterbreath",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Salem Oregon was in a smaller area inundated with orange skies and falling ash for a few days back in 2020 as well",
                                    "score": 12,
                                    "author": "yaboiiiuhhhh",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Portland checking in with the Blade Runner 2049 Hellscape.",
                                            "score": 7,
                                            "author": "crazyhorse90210"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I was like \"huh I must be in collapse sub again\" \nNo xD \n\nEveryone seems to understand the hell we are building now",
                            "score": 16,
                            "author": "Parano78",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I’m in Sacramento, and it was so creepy.",
                    "score": 10,
                    "author": "Internal_Use8954"
                },
                {
                    "level": 1,
                    "comment": "I call it Mordor Season in SoOregon",
                    "score": 28,
                    "author": "Juicebox-shakur",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "LA was terrible, those poor people that  couldn't get away. We drove from  central valley to Oceanside. Oceanside was gross but not as bad as LA area.",
                    "score": 19,
                    "author": "JanteMaam"
                }
            ]
        },
        {
            "level": 0,
            "comment": "New York 2049",
            "score": 460,
            "author": "tchotchkeee",
            "replies": [
                {
                    "level": 1,
                    "comment": "This guy Blade Runners (with some bees)",
                    "score": 88,
                    "author": "Dom5p35"
                },
                {
                    "level": 1,
                    "comment": "Actually 2023.",
                    "score": 38,
                    "author": "iwannashitonu",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Bloody hell. Is every forest in Canada on fire?",
            "score": 419,
            "author": "neveronitever",
            "replies": [
                {
                    "level": 1,
                    "comment": "Actually, oddly enough, most of BC is fine as of yet. Typically, we get the worst of the fire season. There is one major one in the far northeast but the majority of the fires causing this smoke are from AB, ON, QC &amp; NS. I don't doubt this will change soon with the hot and dry weather we're having though. 2021 was brutal and I'm still bracing for something similar. Seeing these photos brings back bad memories.",
                    "score": 85,
                    "author": "b44t",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It wasn't as orange but edmonton was uninhabitable for like 5 or 6 days in may due to the smoke. So gross.",
                            "score": 14,
                            "author": "Kallisti13",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Edmonton is barely habitable in the best of times.",
                                    "score": 15,
                                    "author": "acEightyThrees",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Hey now, we get a good 2-3 months where it's okay.",
                                            "score": 12,
                                            "author": "dutchboy92",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "BC fire season is more in July/August. Give it a month or so. It was 30C in the interior of BC in May this year. I predict the worse fire season again this year.",
                            "score": 11,
                            "author": "WEoverME"
                        },
                        {
                            "level": 2,
                            "comment": "It's still spring. !?!? Going to be a long summer.",
                            "score": 3,
                            "author": "yark2"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's our annual flaming moose run.",
                    "score": 253,
                    "author": "TheCuteAlien",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "As is tradition",
                            "score": 60,
                            "author": "cheesingMyB",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What a wonderful day for Canada, and therefore, the world.",
                                    "score": 26,
                                    "author": "FERRITofDOOM",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Expect for Scott because he’s a dick.",
                                            "score": 5,
                                            "author": "jmrene"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Canadian here…\n\n…*sorry*",
                                            "score": 4,
                                            "author": "Into-the-stream"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yes.",
                    "score": 50,
                    "author": "apoletta"
                },
                {
                    "level": 1,
                    "comment": "Yes. Please send help.\n\nBut seriously, this is the worst fire season in recorded history. https://firesmoke.ca/forecasts/current/",
                    "score": 18,
                    "author": "LotharVonPittinsberg",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "There is a forest fire in every single Canadian province right now.",
                    "score": 6,
                    "author": "Ursa_Mid",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I know you're being silly but thinking about this, I'd honestly be surprised if there was enough oxygen on the planet to fuel a fire of all of Canada's forests burning. I'd love for someone with more knowledge to chime in though.",
                    "score": 11,
                    "author": "SimpleDan11",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Very back of the envelope math: Canada has 360 million hectares of forest. According [this](https://ourworldindata.org/grapher/above-ground-biomass-in-forest-per-hectare) Canadian forests average 90 tonnes of biomass per hectare. According to [this](https://physics.stackexchange.com/questions/681929/how-much-oxygen-does-it-take-to-burn-a-log-of-wood) 192 grams of oxygen are need to burn 168 grams of wood.\n\n360 million hectares * 90 tonnes/hectare * (192 / 162) = 37 billion tonnes of oxygen.\n\nThere’s about 1 million billion tonnes of oxygen in the worlds air, enough to burn all of Canada’s forests 27,000 times over.",
                            "score": 18,
                            "author": "skyeliam",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Wow. Well done. \n\nIt'd definitely still suck though.",
                                    "score": 4,
                                    "author": "SimpleDan11"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm all the way down here in Southern Virginia and we received a poor air quality warning, all the after-school and outdoor activities were canceled, it's hazy as s***,  and it smells perpetually like a campfire. So bizarre considering this is coming from Canada!",
            "score": 242,
            "author": "CaliGirlNYAttitude",
            "replies": [
                {
                    "level": 1,
                    "comment": "I live in New York, and the craziest thing to me is that nothing actually important was cancelled. The mayor didn’t declare anything but tell people to wear masks but everyone still had to go into school and work, just the playground at school was closed. Nice work mayor.",
                    "score": 149,
                    "author": "definitlynotchichi",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That mayor is an incompetent sack of shit. Just business as usual, gotta make money even when it’s literally toxic to go outside! New York had the worst air quality in the entire world yesterday and yet he doesn’t even care to save his own people. I’m in Philly and I’m struggling to breath inside my apartment, my heart is pounding and I’m lightheaded, I can’t sleep, I’m congested and it smells like a charcoal grill",
                            "score": 109,
                            "author": "Mihradata_Of_Daha"
                        },
                        {
                            "level": 2,
                            "comment": "The capitalism will continue until morale improves!",
                            "score": 42,
                            "author": "RockPaperLaserPewPew"
                        },
                        {
                            "level": 2,
                            "comment": "Caring for people's health at the expense of corporate profits!? In this economy!?",
                            "score": 10,
                            "author": "sumdeehumdee"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I live in south central PA and it’s been pretty bad. My sinuses are gunky, the haze blocks out most of the sky and the sun was super red and the sunset was hidden behind the thick haze. I went to sleep smelling that same campfire smell.  The AQ number just went from 168 yesterday to *349 TODAY*\n\nI’m going on a planned trip to Erie, and their air was better than ours yesterday, and is now about the same as what we saw yesterday. Kinda hoping it goes around it? My dad is in Connecticut and was the one who told me about it yesterday. Bonkers",
                    "score": 25,
                    "author": "KatrinaIceheart",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm in the southern tier of NY and our AQI hit at least 444 yesterday but someone told me that it hit 460 during one of the hours I didn't refresh the website to check it. I feel very lucky that our area does not routinely have natural disasters of any major kind (snowfall being the only thing that might fall into that category very very loosely, I guess, but anyone here is used to it and knows how to deal with it so that it has no real risk to us the vast majority of the time).",
                            "score": 9,
                            "author": "NibblesMcGiblet",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Meanwhile I'm in Montreal, much closer to the fires and it's a bit hazy with oddly coloured sunlight at most..",
                    "score": 14,
                    "author": "llilaq",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yea here in Toronot its hardly even noticeable. Just a light haze.",
                            "score": 6,
                            "author": "PolitelyHostile",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Air quality is still bad. I've lived in Seoul during yellow dust season and in times when the air quality is hazy, masks were mandatory and closing windows is recommended.\n\nI'm following suit. Just because it doesn't look bad, doesn't mean it can't be dangerous. AQI right now in TO is between 100-160 depending on where you live. So yeah, air is unhealthy right now.",
                                    "score": 3,
                                    "author": "tiredofthis3"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I'm up in Abitibi about 2 hours away from the fires and the sky is a beautiful blue since the wind shifted. It doesn't even smell anymore.",
                            "score": 3,
                            "author": "Play3r_Thr333"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's to do with the strange polar vortex. There is a strong current coming down right around the border between Quebec and Ontario, which is also where the big forest fires are right now. This means that Montreal (which is directly south of the eye of the fire storm) got 1 kind of Smokey day and the government had a smog advisory out for about a week, but parts of America further away look like this.",
                    "score": 10,
                    "author": "LotharVonPittinsberg",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why don’t they just turn fan on?",
            "score": 429,
            "author": "RedSonGamble",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well duh, it's not a hurricane.\n\n/s",
                    "score": 102,
                    "author": "-ICantThinkOfOne-",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If it was a hurricane you'd just use a marker to divert it.",
                            "score": 23,
                            "author": "GtrPlaynFool",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I’m pretty sure you can just nuke it from what I’ve heard",
                                    "score": 9,
                                    "author": "kukaki"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Maybe it's just what they need to blow all that smoke; a Cat 5!",
                            "score": 25,
                            "author": "Cigar_Smokin_Ape",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "But can we nuke it like a hurricane?",
                            "score": 5,
                            "author": "siqiniq",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah, right!? Are they stupid or something?",
                    "score": 4,
                    "author": "Shamanic_ass"
                },
                {
                    "level": 1,
                    "comment": "No no. We should be taking the forest floor\n\nEdit: oops! Taking or raking, either way a ridiculous solution.",
                    "score": 11,
                    "author": "cmlambert89",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Take it where",
                            "score": 11,
                            "author": "RedSonGamble",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Let’s just take the forest fire, and **push** it somewhere else!",
                                    "score": 21,
                                    "author": "TexasBoyz-713",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "We’re going to take it out of the environment and put it in another environment.",
                                            "score": 5,
                                            "author": "windyorbits"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "*raking , but it's better to vacuum.",
                                    "score": 3,
                                    "author": "boogiewithasuitcase",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m Australian, so I know that smoky, red sky very well. It sucks, it’s like hell on earth. It’s so early in your Summer too, guys. Life (and quality of life) feels very fragile at times like this because unfortunately it’s only going to get worse.",
            "score": 64,
            "author": "Eloisem333",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yep, enjoy the cleanest summer air now while you can, because next summer we’ll look back and wish it was only this bad.",
                    "score": 11,
                    "author": "analcreampie69420"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Damn, they didnt just put the Mexico filter on, they overlapped the India filter with it!",
            "score": 803,
            "author": "WhydYouGotToDoThis",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nah they just went straight Martian filter.",
                    "score": 348,
                    "author": "A_Notion_to_Motion",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "*Venus filter",
                            "score": 91,
                            "author": "Atharaphelun"
                        },
                        {
                            "level": 2,
                            "comment": "Nah, they just put on the Blade Runner 2049 filter.",
                            "score": 56,
                            "author": "Hopeful_Hamster21"
                        },
                        {
                            "level": 2,
                            "comment": "Straight up UAC facility vibes",
                            "score": 4,
                            "author": "Floofy_Fen"
                        },
                        {
                            "level": 2,
                            "comment": "Arrakis, Dune.",
                            "score": 7,
                            "author": "chickenstalker"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Early 1980's every city filter.",
                    "score": 11,
                    "author": "TakeTheThirdStep",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "A good reminder the world is shared by all of us, country borders don't really exist, climate change can't be solved by a single country, we all on the same space boat!",
            "score": 124,
            "author": "NightlyKnightMight",
            "replies": [
                {
                    "level": 1,
                    "comment": "real",
                    "score": 17,
                    "author": "nuttageyo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"The blood moon is rising\"",
            "score": 305,
            "author": "Drex678",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nonbasic lands are mountains",
                    "score": 18,
                    "author": "TimoxR2"
                },
                {
                    "level": 1,
                    "comment": "You must be careful, Link.",
                    "score": 75,
                    "author": "henryhumper"
                },
                {
                    "level": 1,
                    "comment": "\"Tonight is going to be a terrible night.\"",
                    "score": 4,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Diablo 4 official release is so immersive.",
            "score": 139,
            "author": "cali1013",
            "replies": [
                {
                    "level": 1,
                    "comment": "Blizzard’s marketing campaign is so cool. NYC is now a Helltide event",
                    "score": 17,
                    "author": "notthebeachboy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The fog is coming",
            "score": 25,
            "author": "Distinct_tundra"
        },
        {
            "level": 0,
            "comment": "This reminds me of a story from the Great Depression: Congress was debating aid to the Midwest because of the \"Dust Bowl\" drought . Many Eastern congressmen didn't believe the drought was having the impact on the lives of farmers it was, nor did they believe in the dust storms that blanketed the region. Then, the wind shifted and dust from the Plains fell in Washington, DC. Congress reconsidered.\n\nI wonder if this obscuring smoke covering DC would have the same effect for climate legislation.",
            "score": 25,
            "author": "StyreneAddict1965",
            "replies": [
                {
                    "level": 1,
                    "comment": "People only believe in God when their being chased by the devil",
                    "score": 12,
                    "author": "LiGHtNInGmuTt147",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "From all of Canada, we're sorry!",
            "score": 477,
            "author": "DankoGene",
            "replies": [
                {
                    "level": 1,
                    "comment": "Classic. You’re country is burning and you apologize for the smoke. You are a Canadian gem",
                    "score": 338,
                    "author": "Radiant-Psychology80",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Choose one. Is s/he a country or a Canadian gem?",
                            "score": 22,
                            "author": "Roxy-",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Insert South Park we are sorry meme",
                    "score": 50,
                    "author": "fou998074",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Insert South Park \"Blame Canada\" song",
                            "score": 29,
                            "author": "NinjaMagic004"
                        },
                        {
                            "level": 2,
                            "comment": "*Laying naked on a bear skin rug* \"we're 'sorry'\"",
                            "score": 12,
                            "author": "deleclipse"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "From your southern protector of great wrath, you’re welcome you courteous fuckers!",
                    "score": 28,
                    "author": "redonkeydonk"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey New York, mind if I smoke? - Canada",
            "score": 103,
            "author": "Locofinger",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Welcome to Australia",
            "score": 14,
            "author": "Onearmdrummer",
            "replies": []
        },
        {
            "level": 0,
            "comment": "In British Columbia, we just call this summertime",
            "score": 129,
            "author": "D2ThaHizzle",
            "replies": [
                {
                    "level": 1,
                    "comment": "Smells like summer",
                    "score": 17,
                    "author": "Affectionate-Show516",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Bay Area czu checking in- please get a box fan and an air filter and tie it to the back and run the fan to purify your air in your home.   Please stay in doors as much as you can, and wear a mask when leaving the house.  My thoughts are with you, New York. Check on your neighbors and anyone with immune compromised systems because the air quality will immediately bring asthma and breathing issues.  \n\nMuch love ❤️",
            "score": 68,
            "author": "Canonconstructor"
        },
        {
            "level": 0,
            "comment": "The Blood Moon is rising...",
            "score": 10,
            "author": "TTazR"
        },
        {
            "level": 0,
            "comment": "Blame canada!",
            "score": 126,
            "author": "Pretend_Ad6466",
            "replies": [
                {
                    "level": 1,
                    "comment": "🎵Shut your fucking face uncle fucker🎶",
                    "score": 130,
                    "author": "Mediumofmediocrity",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "🤣🤣🤣…exactly what i was going for. Thanks for that",
                            "score": 21,
                            "author": "Pretend_Ad6466",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I bet it was all Scott, he's a dick.",
                                    "score": 7,
                                    "author": "MR___SLAVE",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "I quickly edited to add the musical notes just in case your comment wasn’t intended as a South Park reference so folks would know mine was a reference.  Whew!",
                                    "score": 16,
                                    "author": "Mediumofmediocrity"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "With their beady little eyes and flapping heads so full of lies 🎵",
                    "score": 7,
                    "author": "ethnicmutt"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Bro its day 7 did yall not prepare for horde night?!?",
            "score": 23,
            "author": "Electrical_Pay_7323",
            "replies": [
                {
                    "level": 1,
                    "comment": "nah they bunkering tonight",
                    "score": 3,
                    "author": "S1Ndrome_"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Fuckers rake your leaves",
            "score": 33,
            "author": "SniffTheFinger",
            "replies": []
        },
        {
            "level": 0,
            "comment": "How is that all Canada is burning and you only get to see New York in Reddit?",
            "score": 51,
            "author": "Tauherns",
            "replies": [
                {
                    "level": 1,
                    "comment": "I get your point.... but NY actually has it worse in terms of air quality than even the areas directly adjacent to the fires.  Ontario for example is bad, but still not NY levels of bad.  I presume it has to do with the prevailing wind/weather collecting and accumulating all that smoke from multiple fires over NY.",
                    "score": 52,
                    "author": "eidetic",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm in Ontario. We were 13+ on a scale of 1-10 for air quality yesterday. It's pretty bad here don't worry... although today is a bit better.",
                            "score": 24,
                            "author": "highlyredundantagain",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Montreal is closer to those fires, but a lot if smoke went around it. Now it's raining here.",
                    "score": 6,
                    "author": "notluciferforreal"
                },
                {
                    "level": 1,
                    "comment": "I live about 45 minutes outside of Toronto and it was a bit hazy yesterday but not bad, looks wise, today. Ottawa has it real bad.\n\nSmelt really bad on Tuesday.",
                    "score": 5,
                    "author": "sansasnarkk"
                },
                {
                    "level": 1,
                    "comment": "https://firesmoke.ca/forecasts/current/\n\nMost of the areas where people live in Canada aren't being hit hard by this. Ottawa and Toronto are bad, but not actually as bad as NYC.",
                    "score": 6,
                    "author": "LotharVonPittinsberg"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I live like 20 minutes from where the fire was. Shit was insane. Thank fuck for that rain.",
            "score": 6,
            "author": "Sir_Smeglord",
            "replies": []
        },
        {
            "level": 0,
            "comment": "That went from \"my dad's lungs\" to \"doritos\" real quick",
            "score": 5,
            "author": "Amourofzedoute",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Philadelphia got just as bad as NYC overnight. We reached an AQI of around 460 during the peak",
            "score": 5,
            "author": "firewindrefuge",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Does it smell bad?",
            "score": 14,
            "author": "MadFaux78",
            "replies": [
                {
                    "level": 1,
                    "comment": "So bad. I stopped noticing it then I went to take a shower and when I came out, I could smell it inside my apartment very prominently. Like someone burned food on the stove.",
                    "score": 18,
                    "author": "GinkosFavoriteMushi",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I’m in Buffalo, NY and it’s smelled like a campfire the past 2 days. Our air quality got to right around 200(unsafe conditions), I can only imagine the cities like Rochester or NYC that got into the hazardous levels (300+)",
                    "score": 12,
                    "author": "naterr3343",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s bad for people with respiratory illnesses, like asthma and COPD.  The small particulates can even be absorbed into your bloodstream. \n\nStay inside if you can, and filter the air in your home if possible. Wear a mask if you must go outside.",
                            "score": 7,
                            "author": "It_Was_Serendipity"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Where I am in Ontario about an hour from Ottawa it smells like a musky campfire",
                    "score": 53,
                    "author": "TrustedChimp495",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "new yorker here: its more of a feeling on your face like chopping onions than it is a smell, the smell is faint but smoky",
                    "score": 12,
                    "author": "xjitz",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's because your nerves/brains has gone numb to the actual smell.",
                            "score": 17,
                            "author": "boogiewithasuitcase",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It smells like fire. Not a particularly unpleasant smell, but it’s affecting my breathing in northern Delaware (and I don’t already have breathing problems).",
                    "score": 9,
                    "author": "SmileFirstThenSpeak"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This shit looks like that orange haze from GTA San Andreas on PS2",
            "score": 4,
            "author": "burrekatt"
        },
        {
            "level": 0,
            "comment": "Reminds me of when I was in Korea. Yellow smog alerts.",
            "score": 4,
            "author": "btbam666"
        },
        {
            "level": 0,
            "comment": "Man, that's bad. New York being shrouded in that smoke is terrible. I hope there aren't any casualties, but environment wise, that's probably going to do some damage.",
            "score": 4,
            "author": "Pixel_Nerd92"
        },
        {
            "level": 0,
            "comment": "C'mon Canada. Stop lighting your land on fire",
            "score": 4,
            "author": "destraight"
        },
        {
            "level": 0,
            "comment": "NY in the year 2077. Vault Tech nowhere to be seen",
            "score": 16,
            "author": "flyingdutchman_12345",
            "replies": [
                {
                    "level": 1,
                    "comment": "NY right now. This isn’t some far away future or hypothetical, it’s literally what we went to work and back in.",
                    "score": 5,
                    "author": "froggythefish",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "This reminds me of pictures of Manhattan in the 70s.",
            "score": 9,
            "author": "jppianoguy"
        },
        {
            "level": 0,
            "comment": "Behold the impacts from Climate Change. It’s only going to get worse. What is your country doing to get to it’s emission targets by 2030 and 2050?",
            "score": 27,
            "author": "Wazza17",
            "replies": [
                {
                    "level": 1,
                    "comment": "we're banning abortion so there will be many sets of lungs to help filter our air.",
                    "score": 44,
                    "author": "masshole4life",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wouldn't it be smarter to ban having kids?",
                            "score": 6,
                            "author": "Lync51",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Well the us is so progressive on climate change they are gonna let my state sink into the ocean so we have less emissions.",
                    "score": 6,
                    "author": "CEDFTW"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just a friendly reminder of the war of 1812. Reliving the Burning of the Whitehouse in 1814. \n\n\\- Love, Canada",
            "score": 16,
            "author": "salteedog007"
        },
        {
            "level": 0,
            "comment": "Just put out the fire🤷‍♂️",
            "score": 3,
            "author": "DatBoi650"
        },
        {
            "level": 0,
            "comment": "You don't need lungs",
            "score": 3,
            "author": "NukeouT"
        },
        {
            "level": 0,
            "comment": "Yall need to chill with those mexican filters",
            "score": 3,
            "author": "finghz"
        },
        {
            "level": 0,
            "comment": "This is like the Fog from Spider-Man PS1.",
            "score": 3,
            "author": "Jepho7"
        },
        {
            "level": 0,
            "comment": "Holy crap that’s aweful. I hope we’re helping Canada as much as possible",
            "score": 3,
            "author": "kettlebell43276"
        },
        {
            "level": 0,
            "comment": "Hello children did you liked Mad Max movie ? This is the gift of the older generation for you ! A Mad Max planet ! Enjoy ! EcONoMy fIrSt \n\n( sarcastaball matchpoint )",
            "score": 3,
            "author": "Humble-Whereas-4634"
        },
        {
            "level": 0,
            "comment": "The East Coast didn't care when it was happening to the West Coast. But now that it's effecting the East Coast, everyone should care. lol",
            "score": 3,
            "author": "poli8999"
        },
        {
            "level": 0,
            "comment": "We're living in Mordor now.",
            "score": 5,
            "author": "bushido216"
        },
        {
            "level": 0,
            "comment": "I heard if you watch a satellite view of the smoke it looks like all these fires started at one time.",
            "score": 7,
            "author": "zryan3564",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah during a lightning storm, which is how most start",
                    "score": 8,
                    "author": "acoustic11",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Flashbacks to the Oregon wildfires a few years ago 🔥 🌲",
            "score": 6,
            "author": "Rethtalos",
            "replies": []
        },
        {
            "level": 0,
            "comment": "And imagine what it’s like here in Canada I’m only 23 I’m always from the fire that is the size of New York itself (my work camp that is) and my work itself is 18 km away, kinda messed",
            "score": 5,
            "author": "racing-"
        }
    ]
}