{
    "id": "1443j3c",
    "score": 438,
    "title": "China preparing young children for war.",
    "author": "Professional_Leg8183",
    "date": 1686213345.0,
    "url": "https://www.reddit.com/r/interestingasfuck/comments/1443j3c",
    "media_urls": [
        "https://v.redd.it/hhif682v9r4b1"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\n**This is a heavily moderated subreddit. Please note these rules + sidebar or get banned:**\n\n\n* If this post declares something as a fact, then proof is required\n* The title must be fully descriptive\n* No text is allowed on images/gifs/videos\n* Common/recent reposts are not allowed (posts from another subreddit do not count as a 'repost'. Provide link if reporting)\n\n*See [this post](https://redd.it/ij26vk) for a more detailed rule list*\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/interestingasfuck) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "That dummy got stabbed in the balls jeez",
            "score": 37,
            "author": "_kingjoshh",
            "replies": [
                {
                    "level": 1,
                    "comment": "They all did! Imagine the horror of walking across the battlefield to collect your wounded and they are all alive ball-less(?)",
                    "score": 8,
                    "author": "redditpulledmebackin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "\"Tourniquet the balls! Oh god, it's in my mouth!\"",
                            "score": 5,
                            "author": "neon_soup",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Lmfao dear god, that’s imagery that I didn’t need",
                                    "score": 4,
                                    "author": "redditpulledmebackin"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Bouncing Betty was a landmine designed for just that in ww2",
                            "score": 1,
                            "author": "dMarrs"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I imagine it'd be like fighting ewoks in that battlefront 2 game mode",
            "score": 98,
            "author": "camm44",
            "replies": [
                {
                    "level": 1,
                    "comment": "The forest won't take me tonight you damn teddy bears!!!",
                    "score": 16,
                    "author": "Acadea_Kat"
                },
                {
                    "level": 1,
                    "comment": "yeah, kinda different from sudan child soldiers..",
                    "score": 6,
                    "author": "DakkarLeviathanFFXI",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Meh. Pretty much little ewoks",
                            "score": 2,
                            "author": "camm44"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Goat comment",
                    "score": 2,
                    "author": "Bladerun12345"
                },
                {
                    "level": 1,
                    "comment": "Nope, it's like scouts, but next level. In next 10 years China will have huge ready for action army, in 15-  they will need to use it somewhere.",
                    "score": 1,
                    "author": "dobriygoodwin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Still going to fight them as kids",
                            "score": 2,
                            "author": "camm44"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "FWIW this is an “amusement park” \n\nAnd objectively would be so fun to do as a kid. \n\nNot condoning this in anyway though. In the larger context it’s a bit unnerving.",
            "score": 55,
            "author": "ColdTacoPoo",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's extremely unnerving no doubt... but it *does* look really fun",
                    "score": 14,
                    "author": "LigmaLover56"
                }
            ]
        },
        {
            "level": 0,
            "comment": "People equating this to video games are delusional. Chinese people play video games as well as Americans. THIS on the other hand is asinine.",
            "score": 102,
            "author": "Kade1205",
            "replies": [
                {
                    "level": 1,
                    "comment": "If I was a kid this would be insanely fun",
                    "score": 68,
                    "author": "Accomplished-Ad8968",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah… this looks cool af. I’d totally bring my kid to this\n\nIf I had one",
                            "score": 23,
                            "author": "Marlosy"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This video is form amusement park.\n\nAnyway look at the USA kids in the shooting range photos. How hypocrite most of the people are right?",
                    "score": 23,
                    "author": "reddittallintallin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The kid is at the range with their family. This looks like state funded war games.",
                            "score": 26,
                            "author": "Nameroc55",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "These kids are at a privately organized summer camp. It's cosplay. I think it's in bad taste, but ultimately these are games.\n\nMeanwhile, google \"Kid Firearm Camp\" and read all about the options available for you to send your kids to NRA affiliated camps where playing with guns is the actual entire point of the camp. Here's a picture of children playing sniper with a long rifle and spotter at one of these camps. https://www.nrawc.org/media/4205/nra-whittington-center-adventure-camp-dsc_096126.jpg\n\n\"Taking kids to a firing range is wholesome fun\" is a nonsense rebuttal and defense of US gun/military culture. The US military actively funds action movies where it can look cool and spends millions on visibility events like fly-overs and stunts. We have a large contingent of people who think Christmas cards with their kids posing with guns is cute. We don't have a leg to stand on when it comes to \"Boy, the CCP sure likes to glorify their military to kids of all ages!\" (You want to talk about grooming...).",
                                    "score": 9,
                                    "author": "CholetisCanon",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Long range shooting is a valid sport.  Good gun etiquette isn't \"playing sniper\" it's practicing safety around something integral to American culture.",
                                            "score": 3,
                                            "author": "Nameroc55",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Long range shooting is valid, true. \n\nThe glorification of guns as seen in American culture is not normal nor is it integral to American culture. \n\nAgain, no legs to stand on here. Some Chinese would say that military service is \"integral\" to their culture and these camps are just fun ways to honor those who make their country possible. \n\nSo, basically this: https://friendsofcedarmountain.org/2022/04/childrens-civil-war-camp/",
                                                    "score": 2,
                                                    "author": "CholetisCanon",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "The weapons being used in the video above are still in use in Ukraine.  No one is using a Sharps on the battlefield today. \n\nQuit shilling for a country that is ACTIVELY committing genocide.",
                                                            "score": 1,
                                                            "author": "Nameroc55",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "&gt;The weapons being used in the video above are still in use in Ukraine.\n\nI'm pretty sure that even Russia isn't using wooden play guns in Ukraine, nor what amount to aggressively skinned t-shirt canons.",
                                                                    "score": 1,
                                                                    "author": "CholetisCanon"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Hey, if you don't want guns in your neighborhood, move to Japan.\nThey have very strict gun laws, and for as long as you ignore the near-effortless assassination of Shinzo Abe, no gun crime to speak of!\n\n(If you want more internally consistent yet still fairly relaxed gun laws, than what the NFA has turned the US into, Switzerland or the Czech republic is your best bet)",
                                            "score": 0,
                                            "author": "Least-Surround8317",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Cool. Let's do gun ownership like they do in any of those places.",
                                                    "score": 4,
                                                    "author": "CholetisCanon",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Don't forget to take a copy of our city blueprints too, as North America forgot how to build livable cities somewhere around the 1950s.",
                                                            "score": 3,
                                                            "author": "Least-Surround8317"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I really didn’t want to use my personal info to sign in on ur NRA link in order to see the image but I’ll take your word for it, it’s pretty icky that we have that",
                                            "score": 1,
                                            "author": "Natural_Drawing_9740"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I mean, don't Americans grow up knowing they might get drafted if a war broke out? And still, Chinese people don't usually have access to guns as easily as americans do.",
                                    "score": 2,
                                    "author": "DankKirbo",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "We are not the only country with a draft and not even a mandatory service requirement like Finland, Japan, Israel, Iran, or S. korea",
                                            "score": 2,
                                            "author": "Nameroc55",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yes, but you're (along Israel, Iran and South Korea) really the only country that is always at conflict somewhere in the world.",
                                                    "score": -8,
                                                    "author": "DankKirbo",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "dude nobody is getting drafted for one of those \"small\" wars the US participates in. you would need something like WW3 for that to happen and at that point most NATO countries would be drafting not just the US.",
                                                            "score": 7,
                                                            "author": "Mediocre_Status_7411"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I can assure you that most of our people do not want to be at conflict everywhere\n\nAlso : I remember when the Ukraine front happened and reddit was full of memes asking the USA to intervene. \n\nCan't knock us for getting our hands in everything (which we need to stop doing) while also begging us to get our hands in things",
                                                            "score": 5,
                                                            "author": "Rawesome16",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "No one begged you to get your dick in anything, so stfu and stay home",
                                                                    "score": -2,
                                                                    "author": "Swimming_Instance816",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "People 100% were looking towards the US when the war broke out. I don’t support our government but you’re delusional if you don’t think people wanted us there. \n\nWe aren’t getting free healthcare so might as well put all that war funding to use",
                                                                            "score": 3,
                                                                            "author": "Reasonable-Ad8862"
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Where do I mention dicks? Are they on your mind because you are one? \n\nFucking dumbass. Come back when you have a reasonable point",
                                                                            "score": 1,
                                                                            "author": "Rawesome16",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Yeah, I know that (I'm sure not many people supported the Iraq War), what I meant was that it's mostly industrial conglomerates those conflicts benefit. Literally Fidel Castro acknowledged this when he got asked. \"American people I think are good people, yes, but the government...\"",
                                                                    "score": -1,
                                                                    "author": "DankKirbo"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Totalitarian regimes aren't often comfortable with citizens having the means to oust the govt from power ...",
                                            "score": 1,
                                            "author": "Ok_Lifeguard_6508"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "kids are training with real guns at the range, here they are in a park playing with things that are not usefull in current conflicts.\n\nif you see kids in medieval park playing with swords you consider there is a training? \nbayonet in the current war scenario (go to ukraine) is like using archers in ww II. bayonets is a thing from the past  (ww1). i know is issued to soldiers, and could have their use, but not as this kids are \"training\"",
                                    "score": 0,
                                    "author": "reddittallintallin",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ask the Taliban if those guns weren't useful in current conflict.",
                                            "score": 3,
                                            "author": "Nameroc55"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "If you have enough people equipped with bayonets and enough disrespect for human life, they can be useful.  China definitely has enough people and more than enough disrespect for human life.  \n\nClubs work too, allegedly.\n https://www.bbc.com/news/world-asia-53061476",
                                            "score": 1,
                                            "author": "Ok_Lifeguard_6508",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "lol, give everyone in china a drone with explosives, and they will b more effective, and certainly china can build those.\n\nmachine guns exist for a reason, and made nearly obsolete the charge to the trenches.",
                                                    "score": 2,
                                                    "author": "reddittallintallin"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "It would maybe be closer to something like AirSoft?",
                                    "score": 0,
                                    "author": "smartguy05",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I play airsoft.  This isn't that dude. There's no propaganda or drills.  It's two teams that split and play CTF.  Other fields are by and large the same.  Even Milsim West isn't this wild and the best players cosplay as either RUSFOR or militia.",
                                            "score": 2,
                                            "author": "Nameroc55"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Please source this statement.  Thanks.",
                            "score": 1,
                            "author": "Drake_Acheron"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Basically, people are looking for something to blame. How about all the people who smoke and drink daily, which isn't a hobby.",
                    "score": 3,
                    "author": "SirLlamaGeddon"
                },
                {
                    "level": 1,
                    "comment": "More asinine than laser tag? If this is an amusement park as others are saying, I don’t see the difference.",
                    "score": 1,
                    "author": "BookDumb-StreetDumb"
                },
                {
                    "level": 1,
                    "comment": "Some kids learn to shoot before they can walk around here.",
                    "score": 1,
                    "author": "30acrefarm"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Didn’t Japan do the same in the 1930’s?",
            "score": 11,
            "author": "Signal-Session-6637"
        },
        {
            "level": 0,
            "comment": "If they're preparing them for bayonet charges, they should just go ahead and train them to dig their own graves, too.",
            "score": 17,
            "author": "emperor1978",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well one six foot grave will fit 2-3 of them so it’s pretty efficient. Get one Uyghur to dig his/her own grave and you can fit 2-3 children.",
                    "score": 5,
                    "author": "1grfe"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So our future is to die on a battlefield stabbed in the nut by a toddler with a bayonet?",
            "score": 5,
            "author": "Early_Permit_2072",
            "replies": [
                {
                    "level": 1,
                    "comment": "No sir. Both nuts. Sure they will grow. But soon they will learn to aim low.",
                    "score": 4,
                    "author": "Unheardecho44"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I've known a lot of Americans who learned to shoot real guns as a kid, and there are people here who are worried about Chinese kids using fake WW1 guns in a thematical park.",
            "score": 5,
            "author": "vougvini"
        },
        {
            "level": 0,
            "comment": "Well, they'll need a lot of people for incoming WWIII.",
            "score": 5,
            "author": "Due-Dot6450"
        },
        {
            "level": 0,
            "comment": "while we prepare our kids for hormone therapy! we are so fucked",
            "score": -1,
            "author": "617teddy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Bruh how do y’all manage to being trans people into everything",
                    "score": 11,
                    "author": "The_upsetti_spagetti",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Cause it's the only news we are allowed to see right now",
                            "score": 12,
                            "author": "Distinct-Awareness19",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Fr it’s so annoying. Like can we cool it with the moral panic and focus on fixing real problems",
                                    "score": 3,
                                    "author": "The_upsetti_spagetti",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Discrimination against LGTBIQA+ people is a real problem",
                                            "score": 7,
                                            "author": "Connorus",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yea definitely. I just mean like the whole moral panic creating this increase in transphobia. So many people using trans people as a scapegoat to blame",
                                                    "score": 6,
                                                    "author": "The_upsetti_spagetti",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Humans have always done it with minority groups, unfortunately.",
                                                            "score": 3,
                                                            "author": "Xylogy_D",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Yeah, it would be nice if we could do some more learning from our mistakes",
                                                                    "score": 1,
                                                                    "author": "The_upsetti_spagetti"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah true. But some times they over step.",
                                                    "score": -5,
                                                    "author": "Unheardecho44",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Like when?",
                                                            "score": 2,
                                                            "author": "Connorus",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah I was training my kid on the 60mm mortar just yesterday.",
                    "score": 3,
                    "author": "Catman762",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How is little tim's aim getting on",
                            "score": 2,
                            "author": "Sensitive_Doubt_2372",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hes getting better. Still can't carry the base plate very far though.",
                                    "score": 4,
                                    "author": "Catman762"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "So much for childhood",
            "score": 3,
            "author": "dexterthekilla"
        },
        {
            "level": 0,
            "comment": "It makes complete sense as the Chinese have no regard for life",
            "score": 0,
            "author": "SnotBuster54",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s always been like that. They put the worst leaders in charge and in turn, he kills 50% of them.",
                    "score": -7,
                    "author": "Longjumping_Drag2752",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Moa has joined the chat",
                            "score": 1,
                            "author": "DueComplaint5471"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "How frequent are the school shootout parties in China, anybody knows?",
            "score": 0,
            "author": "LinguoBuxo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ask the Uighurs.",
                    "score": 15,
                    "author": "Nameroc55"
                },
                {
                    "level": 1,
                    "comment": "Nobody knows because they would get swept under the rug because they would make the dictatorship look bad.",
                    "score": 18,
                    "author": "Loud-Cheesecake-2766"
                },
                {
                    "level": 1,
                    "comment": "Seeing as it's near impossible to for civilians to access guns, they are less likely",
                    "score": 6,
                    "author": "brinz1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They are using guns in the video.",
                            "score": -5,
                            "author": "Apprehensive_Bus1268"
                        },
                        {
                            "level": 2,
                            "comment": "even if they were chinese fakes?",
                            "score": -2,
                            "author": "LinguoBuxo"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Xi Youth",
            "score": 1,
            "author": "Ljsurfer88"
        },
        {
            "level": 0,
            "comment": "America does it with call of duty",
            "score": -5,
            "author": "GeoBk",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s a garbage, disingenuous comparison",
                    "score": 6,
                    "author": "yaddibo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Pellet guns, paint ball, gangs and don’t forget the militarized police departments.",
                            "score": -1,
                            "author": "GeoBk",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What the hell does that have to do with the first lie you spewed?",
                                    "score": 2,
                                    "author": "yaddibo"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "And our kids aren’t even allowed to defend themselves or they get punished!",
            "score": 0,
            "author": "foley800",
            "replies": [
                {
                    "level": 1,
                    "comment": "American Kids getting bullied: “I’m telling my parents!”\n\nChinese Kids: “FIRE THE MORTAR”\n\n/s /s /s",
                    "score": 2,
                    "author": "ShoppingUnique1383"
                }
            ]
        },
        {
            "level": 0,
            "comment": "They unlocked volkssturm militia.",
            "score": 1,
            "author": "ariesjame"
        },
        {
            "level": 0,
            "comment": "great video about this if anyone wants to know more [https://m.youtube.com/watch?v=NUaYNhzEq_E](https://m.youtube.com/watch?v=NUaYNhzEq_E)",
            "score": 1,
            "author": "megahendrik"
        },
        {
            "level": 0,
            "comment": "kids, your bayonet thrusting power comes from the hips. You really gotta rotate in to the enemy to drive the blade home, then follow up with a butt stroke to put them on the ground. Use your anger.\n\nAlso, don't trust small children with hand grenades. They can't throw far enough to ensure they're not in the danger zone.",
            "score": 1,
            "author": "SweatyTax4669"
        },
        {
            "level": 0,
            "comment": "You are so silly saying this is preparing them for war. My school literally did a Vimy ridge reenactment toy guns and all.",
            "score": 1,
            "author": "Connor9819"
        },
        {
            "level": 0,
            "comment": "It would be hilarious if these kids don’t know who to stab since that’s no longer the uniform of Japan.",
            "score": 1,
            "author": "Zaku41k"
        },
        {
            "level": 0,
            "comment": "As a kid who grew up on bases, this would have been alot of fun. Seeing this looks horrible but I'm sure those kids are having a blast.",
            "score": 1,
            "author": "jahowl"
        },
        {
            "level": 0,
            "comment": "We played combat in the sixties much like that and read Nick Fury and his howling commandos comic books",
            "score": 1,
            "author": "No_Afternoon_2719"
        },
        {
            "level": 0,
            "comment": "That looks fun anyone complaining is a pussy.",
            "score": 1,
            "author": "iamsimplythatdude"
        },
        {
            "level": 0,
            "comment": "That's nothing. In the USA, we subject our kids to live fire exercises.",
            "score": 1,
            "author": "Piscivore_67"
        },
        {
            "level": 0,
            "comment": "Absolute last country to need this",
            "score": 1,
            "author": "captain_iglo2020"
        },
        {
            "level": 0,
            "comment": "I think it’s actually a theme park but America could do some good teaching our children about surviving during an invasion instead of being naive like we can’t be",
            "score": 1,
            "author": "Melodic_Bee5190"
        },
        {
            "level": 0,
            "comment": "Just asking, how the kids holding some heavy ass 17 pounds rocket launcher like they are holding plastic toy gun?",
            "score": 1,
            "author": "2Rnimation"
        },
        {
            "level": 0,
            "comment": "First thought was this. Why are there so many little plumber people being so aggressive with guns training for war.",
            "score": 1,
            "author": "Unheardecho44"
        },
        {
            "level": 0,
            "comment": "This is a friendly version of Spartan training (For context, Spartan Training starts at age of 7 and the training is quite brutal.)",
            "score": 1,
            "author": "ninja_boy23424"
        },
        {
            "level": 0,
            "comment": "Chinese psyops playing 4-D chess with Americans in this post.",
            "score": 1,
            "author": "enilcReddit"
        },
        {
            "level": 0,
            "comment": "Well us preaparing how not to be a man or woman",
            "score": 1,
            "author": "Eren_Light_Yeager"
        },
        {
            "level": 0,
            "comment": "Chinese Disneyland",
            "score": 1,
            "author": "Holiday_Case8667"
        },
        {
            "level": 0,
            "comment": "Well this does look fun though. Exposure to how to use tools and real stuff probably does benefit mental development like hang eye coordination.",
            "score": 1,
            "author": "Unheardecho44"
        },
        {
            "level": 0,
            "comment": "Onward comrade 🫡",
            "score": 1,
            "author": "Fluid-Tie2493"
        },
        {
            "level": 0,
            "comment": "This is messed up-",
            "score": 1,
            "author": "Lilyetter"
        },
        {
            "level": 0,
            "comment": "Have you seen a US Marine?  We'd kick those kids ass",
            "score": 1,
            "author": "VividLifeToday"
        },
        {
            "level": 0,
            "comment": "That's it.",
            "score": 1,
            "author": "YikesDawg_"
        },
        {
            "level": 0,
            "comment": "Would you like to know more?",
            "score": 1,
            "author": "go-fuck-yourself_"
        },
        {
            "level": 0,
            "comment": "It's easy to train to fight when your props don't fight back!!!!!",
            "score": 1,
            "author": "Various_Ad_1759"
        },
        {
            "level": 0,
            "comment": "Jojo rabbit vibes",
            "score": 1,
            "author": "Sad-_-Face"
        },
        {
            "level": 0,
            "comment": "In the US the kids practice at school with live rounds.",
            "score": 1,
            "author": "NegativeTheme"
        },
        {
            "level": 0,
            "comment": "pretty much enders game",
            "score": 1,
            "author": "Softspokenclark"
        },
        {
            "level": 0,
            "comment": "Jinjin Rabbit",
            "score": 1,
            "author": "sirfuzzybean"
        },
        {
            "level": 0,
            "comment": "lol indian propaganda",
            "score": 1,
            "author": "Beeelaal"
        },
        {
            "level": 0,
            "comment": "No workers? :(",
            "score": 1,
            "author": "Outrageous-Brief-964"
        },
        {
            "level": 0,
            "comment": "There was mandatory paramilitary training at the university I spent a year at in China (exchange student). It was a joke and everybody knew it. They didn't fire any guns and spent most of the time learning how to parade. It lasted a couple days.\n\nThe Boy Scouts prepared me better for war than that likely would.",
            "score": 1,
            "author": "Independent-Ad-1921"
        },
        {
            "level": 0,
            "comment": "I bet they don't even get to choose their pronouns",
            "score": 1,
            "author": "helix466"
        },
        {
            "level": 0,
            "comment": "And what ate we doingbin America.  Teaching kids to be offended by pronouns",
            "score": 1,
            "author": "Agreeable_Memory_67"
        },
        {
            "level": 0,
            "comment": "How is this any different than in the US where most children are proficient with firearms in elementary school?",
            "score": 1,
            "author": "arhramor"
        },
        {
            "level": 0,
            "comment": "Wtf, China, this people live in a circus.",
            "score": 1,
            "author": "epwhat"
        },
        {
            "level": 0,
            "comment": "Just send em now?",
            "score": 1,
            "author": "Acrobatic-Capital-85"
        },
        {
            "level": 0,
            "comment": "Laughable.\n\nIn the US our children have *actual combat experience*.\n\nAnd the Chinese try to use that fact against us while training their own kids for war?",
            "score": 1,
            "author": "mega_moustache_woman"
        },
        {
            "level": 0,
            "comment": "American kids are now full of Pride. That’ll be our demise. A nation with no balls to fight will get rolled over.",
            "score": 1,
            "author": "Meltedwhisky"
        },
        {
            "level": 0,
            "comment": "And we’re trying to get rid of gun culture",
            "score": 1,
            "author": "Comprehensive_Bed84"
        },
        {
            "level": 0,
            "comment": "Not impressed.  Any chav from Birkenhead I’ll fuck these kids up.  :p",
            "score": 1,
            "author": "apollyoneum1"
        },
        {
            "level": 0,
            "comment": "Why are they all wearing Ferrari hats? Max Verstappen better watch out for himself!",
            "score": 1,
            "author": "Hrevak"
        },
        {
            "level": 0,
            "comment": "Americans do this too. But they use live action teammates to practice.",
            "score": 1,
            "author": "Coder_Arg"
        },
        {
            "level": 0,
            "comment": "u/savevideobot",
            "score": 1,
            "author": "LEDDWC",
            "replies": [
                {
                    "level": 1,
                    "comment": "###[View link](https://rapidsave.com/info?url=/r/interestingasfuck/comments/1443j3c/china_preparing_young_children_for_war/)\n\n\n --- \n [**Info**](https://np.reddit.com/user/SaveVideo/comments/jv323v/info/)&amp;#32;|&amp;#32; [**Feedback**](https://np.reddit.com/message/compose/?to=Kryptonh&amp;subject=Feedback for savevideobot)&amp;#32;|&amp;#32;[**Donate**](https://ko-fi.com/getvideo) &amp;#32;|&amp;#32; [**DMCA**](https://np.reddit.com/message/compose/?to=Kryptonh&amp;subject=Content removal request for savevideo&amp;message=https://np.reddit.com//r/interestingasfuck/comments/1443j3c/china_preparing_young_children_for_war/) &amp;#32;|&amp;#32; \n [^(pinterest video downloader)](https://ptsave.com) &amp;#32;|&amp;#32; [^(twitter video downloader)](https://twitsave.com)",
                    "score": 1,
                    "author": "savevideobot"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Stab him in the dick!",
            "score": 1,
            "author": "Uncle_polo"
        },
        {
            "level": 0,
            "comment": "While America is preparing children for war in different ways. School shootings...",
            "score": 1,
            "author": "showmiaface"
        },
        {
            "level": 0,
            "comment": "4 Ft targets are my favorite",
            "score": 1,
            "author": "Moist_Llama86"
        },
        {
            "level": 0,
            "comment": "Yeh very impressive,  but I bet they don't  know  their  own pronouns",
            "score": 1,
            "author": "Successful_Warthog58"
        },
        {
            "level": 0,
            "comment": "That’s cute :)",
            "score": 1,
            "author": "Proper_Ad_871"
        },
        {
            "level": 0,
            "comment": "oh guys, the irony here",
            "score": 1,
            "author": "Roni1209"
        },
        {
            "level": 0,
            "comment": "Has nothing on American,crazed Christian conservatives and their gun cult culture.",
            "score": 1,
            "author": "dMarrs"
        },
        {
            "level": 0,
            "comment": "While the U.S. military is covering pronouns, China is preparing to whoop our butts.",
            "score": -4,
            "author": "2Icemonkey"
        },
        {
            "level": 0,
            "comment": "Good, better than yelling at people on Fortnite",
            "score": -20,
            "author": "Alfiy_wolf",
            "replies": [
                {
                    "level": 1,
                    "comment": "Is it?",
                    "score": 7,
                    "author": "Phat-Lines",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How is it any different from manipulating the youth with media? \n\nAmerica has more schools shootings than China - so I doubt it will increase violence.\n\n- children use to play pretend war when I was growing up\n\nSure it’s odd but is it really different from teaching a fighting style or how to use weapons like most Asian culture does?",
                            "score": -15,
                            "author": "Alfiy_wolf",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yup, America does have more shootings than China. If you are assuming I am pro-USA or anti-China, you are wrong. In my opinion the US and China are both major world powers who do all they can do expand their hegemony by any means. I won’t say they are equally bad because it’s complicated, but both can get fucked (the nation-state governments, not the people of each nation, just to be clear). \n\nFortnite is a video game. You know about video games? \n\nIf you would rather your child be involved in military indoctrination and nationalism, than play a video game, you are a bad parent.",
                                    "score": 7,
                                    "author": "Phat-Lines",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Also giving kids toy guns and teaching them to play pretend war is indoctrination to a degree too",
                                            "score": -2,
                                            "author": "Alfiy_wolf",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "If you think giving a kid a toy gun is the same as what is happening in this video (if it’s real? Ngl this video seems like something some anti-China account would post) then you probably need to rethink somethings.",
                                                    "score": 4,
                                                    "author": "Phat-Lines",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I’m not saying it’s the same I’m saying it’s similar in some ways, how is it any different from karate",
                                                            "score": -4,
                                                            "author": "Alfiy_wolf",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Well, when wars happen and thousands or millions die, do they teach them karate or do they teach them things like we can see in the video? \n\nCome on man, you can see it’s not similar. Not to say the USA doesn’t indoctrinate kids in exactly the same way, but they don’t do it through fortnite.",
                                                                    "score": 6,
                                                                    "author": "Phat-Lines",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "That’s agree to disagree I guess we were raised differently",
                                                                            "score": 2,
                                                                            "author": "Alfiy_wolf",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Yeah you was raised to think the military indoctrination of small children by the Chinese military  is the same as a kid learning karate at a local leisure centre lol.",
                                                                                    "score": 6,
                                                                                    "author": "Phat-Lines",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Also better than getting triggered by seeing someone drive a diesel engine vehicle or by seeing someone eat a chicken burger.",
                    "score": 3,
                    "author": "night_0w1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hard agree here",
                            "score": 2,
                            "author": "Alfiy_wolf"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "And this is why the west will get steamrolled in the near future.",
            "score": -19,
            "author": "Darkfantasy11691",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lol naaaaaa China would get clapped so hard you see how their butt buddies are doing in a country 1/10th their size?",
                    "score": 1,
                    "author": "Substantial_Bet5764",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The west are too pre occupied with 300 genders and enrolling transgenders in the army. China and co are raising killing machines. China won’t have to initiate a war they will just let the west self destruct in wokeness.",
                            "score": -13,
                            "author": "Darkfantasy11691",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Lol although I agree with your first statement China still getting clapped americas military would make it 1930’s China in a heartbeat haha\n\nNot to mention Japan right there not wanting to get straight annihilated",
                                    "score": 4,
                                    "author": "Substantial_Bet5764",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That’s why I think China are playing the waiting game. They gave the west tiktok to turn them into vegetables and it seems to be working. I’m guessing within 20-30 years the damage will be done. The boys being born now are encouraged not to be men and are pushed into being little weak genderless creatures. This is not a recipe for success. BRICS will come out on top and are well on track to doing so.",
                                            "score": -3,
                                            "author": "Darkfantasy11691",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Like I said I’m all here to agree with ya bud except on the losing part never count out America in war time we absolutely run shit",
                                                    "score": -1,
                                                    "author": "Substantial_Bet5764",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Except when they went to Vietnam, or the Middle East. Let’s not pretend those wars were not an embarrassing shit show.",
                                                            "score": 1,
                                                            "author": "Darkfantasy11691",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Brics is notoriously shit. Russia is getting grinded down by Ukraine (An old ally). China can’t take Taiwan to save its life. South Africa…is South Africa lolol and india is about to face the worlds WORST heat crisis in decades. Neither country has a decent currency (maybe except china). European countries have stronger economic power then brics let alone America. Which is 3x the size of chinas economy alone. How the hell is brics winning again? Because they are not controlling the economic stage, it’s just not happening.",
                                                                    "score": 1,
                                                                    "author": "UnderstandingOk7885",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "It’s not about what’s happening today, just take some time and look at the direction they are going. It’s not like they are going backwards.\n\nChina are investing heavily in Africa, there’s more to Africa than the south also.",
                                                                            "score": 1,
                                                                            "author": "Darkfantasy11691",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "I’m aware of that also. Chinas plan isn’t “uniting Africa against the west” lmao it’s profit…those African countries who are in debt to China are not too happy with China right now I reckon. And that relationship will only worsen.",
                                                                                    "score": 1,
                                                                                    "author": "UnderstandingOk7885"
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "…actually that’s not correct, in fact it’s incorrect. China IS going backwards in a sense. They have a huuuge old population and not enough young population to replace. Allll those retirements.. (I reckon china doesn’t want to pay) will take a toll these next few decades. Chinas economy shot up, if you study basic economics then you know that means it’s due for a retraction…there’s obviously things about this world you have yet to learn young grass hoppa 💯",
                                                                                    "score": 1,
                                                                                    "author": "UnderstandingOk7885",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "They weren’t? Lol just look at the body counts on each side bro? If the American military wants another military wiped off the face of this earth then that’s what they do?\n\nSure do they then run into counter insurgencies? Of course but that’s only because the actual nations armies they are facing have been dissolved by americas military might in a matter of months",
                                                                    "score": 1,
                                                                    "author": "Substantial_Bet5764",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "It does worry me a little bit on how far they will go to stay on top. But as strong as they are (and allies) now, nothing lasts forever.",
                                                            "score": 1,
                                                            "author": "Darkfantasy11691",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Oh we will fall and maybe relatively soon but we will take ourselves out from the inside no outside force will conquer America we unite better than any country when we are attacked",
                                                                    "score": 1,
                                                                    "author": "Substantial_Bet5764"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "You have a one dimensional mind💯 troop numbers are not everything obviously. ask google which Air Force is the most advanced and which ones has the most quantity of jet fighters. The us army, us air force AND us navy take 1,2,&amp;4 spot in the world. China is shit compared to 🇺🇸. But in their defense….everyone is shit compared to the USA. Not one single country could match usa. USA is literally in a league of its own. Anyone who disagrees with that is disagreeing with reality. Period. I won’t get into the many obvious reasons why.. it’s wasting my time.  your a troll most likely💯 or ill-informed",
                                    "score": 2,
                                    "author": "UnderstandingOk7885"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Except you rely on exports for oil and have one aircraft carrier in the entire PLAN.  Good luck establishing control over the strait of Malaka with one carrier.",
                    "score": 1,
                    "author": "Nameroc55",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m from the U.K.",
                            "score": 2,
                            "author": "Darkfantasy11691",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well as a member state that has the F-35 as well as conducted numerous highly successful coordinated drills with US and Japanese military, I think the UK would be an excellent ally in a conflict with China.  China uses bodies, the west uses tech.",
                                    "score": 2,
                                    "author": "Nameroc55",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "We also just won the latest tank competition. If we went to war today we win easy. May not be the case in a few decades.",
                                            "score": 1,
                                            "author": "Darkfantasy11691",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I don't see a world where China overtakes the US and their allies.  Not without nukes or some new technology.",
                                                    "score": 1,
                                                    "author": "Nameroc55",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It doesn’t have to be violently. China are very patient and the 100 year war is a thing, it’s quite interesting really. The way things are going the west will self destruct themselves/ourselves. Our society is the most degenerate on earth, especially the USA. I’m from the U.K. and we tend to follow y’all on terms of societal norms.",
                                                            "score": 1,
                                                            "author": "Darkfantasy11691"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "china is a fucked up place, what an unhappy place, with lots of mental issues.",
            "score": -4,
            "author": "rafter2021"
        }
    ]
}