{
    "id": "144bici",
    "score": 202,
    "title": "Anna Coleman Watts Ladd was an American sculptor who moved to France in 1917 to work with Francis Derwent Wood, helping severely injured WW1 veterans. Together, they created facial prosthetics to cover severe facial deformities.",
    "author": "bigmeat",
    "date": 1686236236.0,
    "url": "https://www.reddit.com/r/interestingasfuck/comments/144bici",
    "media_urls": [
        "https://i.imgur.com/Xou3i0e.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\n**This is a heavily moderated subreddit. Please note these rules + sidebar or get banned:**\n\n\n* If this post declares something as a fact, then proof is required\n* The title must be fully descriptive\n* No text is allowed on images/gifs/videos\n* Common/recent reposts are not allowed (posts from another subreddit do not count as a 'repost'. Provide link if reporting)\n\n*See [this post](https://redd.it/ij26vk) for a more detailed rule list*\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/interestingasfuck) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "In Ladd's studio, it took close to a month to build a customized mask, which was made out of galvanized copper. The thickness of the mask was one thirty-second of an inch or, as a visitor to her studio once noted, \"the thinness of a visiting card.\" The mask weighed between 4 and 9 ounces and was typically held in place with the assistance of spectacles. Ladd would also spend considerable time painting the mask while the wearer had it on, ensuring that it matched their skin tones.\n\nLadd received numerous letters of gratitude from soldiers. One soldier wrote, \"Thanks to you, I will have a home...the woman I love no longer finds me repulsive, as she had a right to do.\"\n\nIn total, Ladd's studio created 185 masks, which pales in comparison to the number of facial casualties from the war. It was estimated that around 20,000 individuals suffered facial injuries.",
            "score": 16,
            "author": "bigmeat"
        },
        {
            "level": 0,
            "comment": "*Richard Harrow enters chat* \n\nGod damn, what a great character.",
            "score": 6,
            "author": "AnEvenNicerGuy"
        },
        {
            "level": 0,
            "comment": "The French did the same, referring to the patients as \"L'homme sans visage\"...the men without faces.",
            "score": 1,
            "author": "Sweetknees66"
        },
        {
            "level": 0,
            "comment": "Wounds, not deformities",
            "score": -3,
            "author": "Navadaaf2",
            "replies": [
                {
                    "level": 1,
                    "comment": "tomato",
                    "score": 3,
                    "author": "dangodohertyy"
                }
            ]
        }
    ]
}