{
    "id": "144zcut",
    "score": 5900,
    "title": "There's a site called Forgotify that plays all the songs on spotify that have never been listened to. Whatever song you play, you're the first person listening it on the platform.",
    "author": "mindyour",
    "date": 1686298961.0,
    "url": "https://www.reddit.com/r/interestingasfuck/comments/144zcut",
    "media_urls": [
        "https://v.redd.it/02ji802lcy4b1"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\n**This is a heavily moderated subreddit. Please note these rules + sidebar or get banned:**\n\n\n* If this post declares something as a fact, then proof is required\n* The title must be fully descriptive\n* No text is allowed on images/gifs/videos\n* Common/recent reposts are not allowed (posts from another subreddit do not count as a 'repost'. Provide link if reporting)\n\n*See [this post](https://redd.it/ij26vk) for a more detailed rule list*\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/interestingasfuck) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "I bet this will be like finding a good shirt in the clearance section; sure there is a hit, but not before you’ve gone through a few hundred.",
            "score": 265,
            "author": "BoredBoredBoard",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes some of them have no listens [for a good reason](https://open.spotify.com/track/0NTMYV6xKvwx02GUDo7wWr)",
                    "score": 108,
                    "author": "Weird_Cantaloupe2757",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That lady probably uploaded a bunch of songs 8 years ago and now she's going to get a random royalty check in the mail from Spotify for 85 cents because you shared that link.",
                            "score": 86,
                            "author": "oddmanout",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "85 cents for 1 listen? It's likely more like 0.00085 🤣",
                                    "score": 11,
                                    "author": "hpool82"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Wesley Willis would be proud",
                            "score": 9,
                            "author": "grivers1989"
                        },
                        {
                            "level": 2,
                            "comment": "I'd rather listen to the poop grunts.",
                            "score": 10,
                            "author": "Drinkin_Abe_Lincoln"
                        },
                        {
                            "level": 2,
                            "comment": "Honestly, not that bad. I was expecting my ears to bleed.",
                            "score": 3,
                            "author": "Mr__Citizen"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "One of them is probably just someone recording their poop grunts in a musical rhythm.",
                    "score": 23,
                    "author": "WinterHound42",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[Like this?](https://open.spotify.com/track/1lmzyCW1w3nrDE2ySyj2nb)",
                            "score": 15,
                            "author": "oddmanout",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I should be surprised but.. I'm not.",
                                    "score": 10,
                                    "author": "WinterHound42",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Bro... Same",
                                            "score": 3,
                                            "author": "DerDRFDNR"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I've listened to worse",
                            "score": 1,
                            "author": "DeliciousWarthog53",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Like most modern music? It's really hard to distinguish it from actual music and just screeching animals.",
                                    "score": 1,
                                    "author": "WinterHound42",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Don't insult the poor animals by putting them and modern music in the same comment lol",
                                            "score": 1,
                                            "author": "DeliciousWarthog53",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I've made a terrible mistake",
                                                    "score": 2,
                                                    "author": "WinterHound42",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It's OK. Go listen to the music you love, drink some beer and smoke a doobie. And he'll, if ya can get laid, even better",
                                                            "score": 3,
                                                            "author": "DeliciousWarthog53"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I did find a really cool song through this once, but I can’t for the life of me remember what it was called or who the artist was since switching to Apple Music.",
                    "score": 6,
                    "author": "ContactHonest2406"
                },
                {
                    "level": 1,
                    "comment": "I just opened it for the first time ever and I have sampled three songs and I liked all three of them.",
                    "score": 5,
                    "author": "FrameComprehensive88"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is interesting. But do family or friends of the artists never listen to the music just once ? Even though they might not like the genre ? Just wondering...",
            "score": 378,
            "author": "Maaskantenaar",
            "replies": [
                {
                    "level": 1,
                    "comment": "Tried it a while back. It seems to be mostly tracks that were released years ago on CD, tape or vinyl which were uploaded to spotify much later. I got lots of 80s music and some non-English music, including some from Turkey.\n\nA lot of it is music that's been listened to in the past, just not on Spotify. Many labels have uploaded their entire back catalogue, because why not?\n\nA lot of self-released music probably doesn't show up, as the uploader has probably listened to it on there even if no-one else has.",
                    "score": 176,
                    "author": "AmalgramFive",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's been around almost ten years.",
                            "score": 7,
                            "author": "grendel303"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I wondered the same thing. How about the artist themselves?  How are they not listening to their own stuff?",
                    "score": 78,
                    "author": "mindyour",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's easy to upload your music to spotify. Like with Distrokid you pay $20 a year for unlimited uploads on all popular streaming services (I'm sure there are cheaper options as well). Some people make a lot of stuff and don't bother advertising!",
                            "score": 56,
                            "author": "Low-E_McDjentface",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Did not know that. Thanks. I don't know why I thought there was a stricter requirement.",
                                    "score": 15,
                                    "author": "mindyour",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It makes sense that streaming services would let people upload for a fee. That way they get paid and just have to store the music- which is cheap.  \n\nThey only have to pay the artists if it gets played a lot.",
                                            "score": 2,
                                            "author": "blueavole"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "So my old cassettes can be uploaded if I convert to mp3s? Nonsense I made as a kid?",
                                    "score": 2,
                                    "author": "RoguePlanet1",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Pretty much, unless there's some copyrighted stuff on there",
                                            "score": 2,
                                            "author": "Low-E_McDjentface"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You know it’s bad if even they don’t want to listen to it.",
                            "score": 8,
                            "author": "Known-Economy-6425",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I hope that was sarcasm :p",
                                    "score": -2,
                                    "author": "CherryShort2563"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You do realize that Spotify is not the only way to listen to music? When an artist wants to listen to their own music I'm pretty sure they're not going to do it on Spotify.",
                            "score": 3,
                            "author": "ToggoStar"
                        },
                        {
                            "level": 2,
                            "comment": "I just went to the site. It doesn't have a \"listened to\" count on the songs. How does anyone know that they are the first. Do the 3 songs I listened to disappear now that they have been heard?",
                            "score": 3,
                            "author": "Mascbro26"
                        },
                        {
                            "level": 2,
                            "comment": "As a producer, I can say that after spending consecutive days working on something, I get tired of hearing it.\n\nSo once it's finished and I have it where I want it, I put it on Distrokid, let them push it to Spotify, and then I usually forget about it.",
                            "score": 7,
                            "author": "Gheauxst"
                        },
                        {
                            "level": 2,
                            "comment": "If I make a song I probably have it accessible on a more practical, ethical, or slightly more justifiable planform than spotify",
                            "score": 1,
                            "author": "Ashirogi8112008"
                        },
                        {
                            "level": 2,
                            "comment": "It's not like everyone uses spotify (or streaming services in general) to listen to music. (I don't, as the free versions have ads and sounds like crap &amp; i'm not going to pay my money to company which exploits the artists, if I can just buy from the artists directly somewhere (usually bandcamp) and have the files on my disc instead of \"streaming\" == downloading the song everytime I play it (like if bandwidth was free / without any ecological impacts",
                            "score": 1,
                            "author": "IridescentMeowMeow"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Probably they sent them the audio track before uploading, or at least that's how I would do it",
                    "score": 3,
                    "author": "MagicDog1234",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That explains a lot, did not think of that",
                            "score": 2,
                            "author": "Maaskantenaar"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "just tried it. first song i heard, had 6k listeners",
                    "score": 1,
                    "author": "kroggaard"
                },
                {
                    "level": 1,
                    "comment": "Not always 😭",
                    "score": 1,
                    "author": "Fun_Chemist_7423"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Signmeupify! Also makes me think about how there’s about 24 hours of video uploaded to YouTube every second… I wonder what the upload rate is for music time per second.",
            "score": 52,
            "author": "Agreeable_Purchase69",
            "replies": [
                {
                    "level": 1,
                    "comment": "That is an interesting thought. There is a lot more production that goes into music. Even \"bad\" music or rushed recordings takes some effort. Anybody and everybody with a phone camera can take a video and put it up on youtube with little thought.",
                    "score": 8,
                    "author": "Summitstory",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "yeah, good point. if were talking about uploading it on spotify, it might be worse, cuz just the act of uploading it takes time.",
                            "score": 0,
                            "author": "mrlock_"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "So if someone listens to it once it gets removed?",
            "score": 43,
            "author": "ElRetardio",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, and then it will be really forgotten...",
                    "score": 65,
                    "author": "Informal_Ad3771",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Forgetify 2.0 plays songs that have only ever been listened to once.",
                            "score": 59,
                            "author": "El_Grande_El",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Forgetwofy plays songs only heard twice",
                                    "score": 11,
                                    "author": "charrcheese",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Fourgetify plays songs only heard 3 times",
                                            "score": 6,
                                            "author": "kilkennykid"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'm guessing this thing probably makes an API call to Spotify that says roughly, \"Give me a random song that has been listened to 0 times.\"  Once Spotify records a \"play\" action for that song anywhere in their platform, it would no longer be eligible to be included in the results for that API query.",
                    "score": 8,
                    "author": "harrisofpeoria"
                },
                {
                    "level": 1,
                    "comment": "Woaaah…",
                    "score": 2,
                    "author": "Rude-fishy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That’s amazing, I can’t wait until I don’t try this.",
            "score": 28,
            "author": "VioEnvy"
        },
        {
            "level": 0,
            "comment": "Pretty sure this is how Spotify is finding the weekly recommended songs for me",
            "score": 9,
            "author": "extremesalmon",
            "replies": [
                {
                    "level": 1,
                    "comment": "Seriously. What the fuck even is half that nonsense???",
                    "score": 3,
                    "author": "DMT1984",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "76 monthly listens, 3 songs, thanks for trying but nah",
                            "score": 2,
                            "author": "extremesalmon"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "On one hand that's super sad some one really talented might get exposed via forgetify. On the other hand there is a very good reason why that 30% has never been listened to.",
            "score": 15,
            "author": "shaundisbuddyguy"
        },
        {
            "level": 0,
            "comment": "Is that really the creepiest thing? Really?",
            "score": 19,
            "author": "Former-Class8551",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not only the creepiest but really weird too.",
                    "score": 0,
                    "author": "YborBum",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Just implying the forget part is extremely stupid. You can't forget something you haven't heard before...",
                            "score": 2,
                            "author": "Former-Class8551"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "There is this artist that I've discovered back in 2009. Few years back I've found his songs on Spotify. Since then I'm his only monthly listener 😂",
            "score": 4,
            "author": "Manawastaken"
        },
        {
            "level": 0,
            "comment": "Just not listened to on Spotify. It doesn't have to be super creepy strange stuff...",
            "score": 9,
            "author": "Justme100001"
        },
        {
            "level": 0,
            "comment": "I used to listen to it before it was cool.",
            "score": 3,
            "author": "baldychinito"
        },
        {
            "level": 0,
            "comment": "So when I listen to a song on that playlist for the first time, is it removed from the playlist? If it stays on the playlist after listening, I have to assume I’m not the first person to listen to the song.",
            "score": 3,
            "author": "KajePihlaja",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm guessing these preview don't count",
                    "score": 1,
                    "author": "SlobZombie13"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I just tried it.  I got a song off of some album of nothing but a guy playing a bongo by himself.  It's... uh... ok, I guess.\n\n[Also, some sort of Jewish reggae rapper rapping the rules of Judaism.](https://open.spotify.com/track/1Kg2thu38TQpTccfvdxJX6)",
            "score": 3,
            "author": "oddmanout"
        },
        {
            "level": 0,
            "comment": "Hey, maybe some of mine will be listened to!",
            "score": 2,
            "author": "ArtVice"
        },
        {
            "level": 0,
            "comment": "I love something about the bald guy's intonation/accent/cadence. Perfect delivery",
            "score": 2,
            "author": "Zarzar222",
            "replies": [
                {
                    "level": 1,
                    "comment": "Belgian accent if i’m not mistaken, west-flemish I hear atleast",
                    "score": 1,
                    "author": "Interesting_Quail379"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I hope i dont forget to try Forgotify..",
            "score": 2,
            "author": "MememeSama"
        },
        {
            "level": 0,
            "comment": "Wasn't expecting Broden to have that accent",
            "score": 2,
            "author": "TeejyHamz"
        },
        {
            "level": 0,
            "comment": "I feel like this is funny for the first 5 minutes until you realise there's a reason why it has 0 listens.",
            "score": 2,
            "author": "kaibe8"
        },
        {
            "level": 0,
            "comment": "It’s a mistranslation it’s fogertyify it just plays CCR songs",
            "score": 2,
            "author": "tonezone78"
        },
        {
            "level": 0,
            "comment": "Got a song called “dancing all alone” ironic",
            "score": 2,
            "author": "phinbenoob"
        },
        {
            "level": 0,
            "comment": "I got [this track](https://open.spotify.com/track/24VBPhca2hq9ZoHZKrWbNu) released in 2000, I think. That's sad.",
            "score": 1,
            "author": "Shamefuru-Dispray",
            "replies": [
                {
                    "level": 1,
                    "comment": "That reminded me of “that one night” from the Office",
                    "score": 1,
                    "author": "charrcheese"
                }
            ]
        },
        {
            "level": 0,
            "comment": "First and last…",
            "score": 1,
            "author": "TockOhead"
        },
        {
            "level": 0,
            "comment": "What is that accent? \nSounds like a bad attempted Russian accent?",
            "score": 1,
            "author": "PronounceHayes",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sounds Norwegian or Finnish to me.",
                    "score": 1,
                    "author": "None_Professional",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I actually think Dutch now",
                            "score": 1,
                            "author": "PronounceHayes",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think it’s a Flemish accent",
                                    "score": 1,
                                    "author": "Interesting_Quail379"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I got some opera singer sing Mambo Italiano.\n\nI remember that song, dif artist, on Married To The Mob.",
            "score": 1,
            "author": "AGripInVan"
        },
        {
            "level": 0,
            "comment": "Talk about a limited shelf life but cool idea.",
            "score": 1,
            "author": "BornAgainBlue"
        },
        {
            "level": 0,
            "comment": "I never heard the guy’s accent before.",
            "score": 1,
            "author": "wulfgang14",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sounds Danish.",
                    "score": 1,
                    "author": "DMT1984"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Great for sampling",
            "score": 1,
            "author": "Jaytee303"
        },
        {
            "level": 0,
            "comment": "It’s all old music",
            "score": 1,
            "author": "Beneficial-Strain223"
        },
        {
            "level": 0,
            "comment": "I checked it out the other day not too bad. There are some good songs",
            "score": 1,
            "author": "Shrakov"
        },
        {
            "level": 0,
            "comment": "[confused](https://open.spotify.com/track/7g7ykw2giaG0MN8BGJzLhP?si=BSzNmD9cQfOFVb4SFEya2Q&amp;context=spotify%3Aalbum%3A2m8ADHbC1LcZMUfELNwK0b)",
            "score": 1,
            "author": "Bexspd"
        },
        {
            "level": 0,
            "comment": "As a independent musician I can say I'm not surprised at all that there are songs with zero listen, some of mine are probably on that playlist",
            "score": 1,
            "author": "Elegant_Substance715"
        },
        {
            "level": 0,
            "comment": "I'll be honest, Humphrey Lyttelton - “The Other Parlophones 1951-1954\" was rockin'!",
            "score": 1,
            "author": "SadMap7915"
        },
        {
            "level": 0,
            "comment": "Wait till they find out 30% of Spotify's music is bot generated, and 100% of the plays on that 30% are, you guessed it, bots.",
            "score": -2,
            "author": "Hiiipower111",
            "replies": [
                {
                    "level": 1,
                    "comment": "I just went to the website for the first/ last time. All ofnit is awful and should not be listened to by anyone with human ears",
                    "score": 3,
                    "author": "chucklesbtoken2",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Bahahaha",
                            "score": 0,
                            "author": "Hiiipower111"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "So what they mean is that it didn't get played on Spotify. Is everyone forgetting that there are many other ways to have listened to music?",
            "score": -1,
            "author": "Qoyuble"
        },
        {
            "level": 0,
            "comment": "The Song with same name is not on Spotify ironically. \nBut! I did just look at the google page and it had iHeart and you tube and a couple more but didn’t see Spotify on it",
            "score": 0,
            "author": "Dry_Noise3011"
        },
        {
            "level": 0,
            "comment": "Some guy from Europe started using my Spotify account. I wondered if he got my user name and password via Forgotify. I don't know for a fact that that's how it happened.",
            "score": 0,
            "author": "OlyScott"
        }
    ]
}