{
    "id": "14553vi",
    "score": 1,
    "title": "My beer was made by AI",
    "author": "darrenpauli",
    "date": 1686316833.0,
    "url": "https://www.reddit.com/r/interestingasfuck/comments/14553vi",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\n**This is a heavily moderated subreddit. Please note these rules + sidebar or get banned:**\n\n\n* If this post declares something as a fact, then proof is required\n* The title must be fully descriptive\n* No text is allowed on images/gifs/videos\n* Common/recent reposts are not allowed (posts from another subreddit do not count as a 'repost'. Provide link if reporting)\n\n*See [this post](https://redd.it/ij26vk) for a more detailed rule list*\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/interestingasfuck) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "As if IPAs weren't douchie enough.",
            "score": 29,
            "author": "alejandro_kirk",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ah shit, but they taste so good.",
                    "score": 2,
                    "author": "SincereChimichanga"
                }
            ]
        },
        {
            "level": 0,
            "comment": "🙄",
            "score": 8,
            "author": "Odd_Masterpiece9092"
        },
        {
            "level": 0,
            "comment": "*scans barcode*\nWhy did this ring up as a pesticide?",
            "score": 7,
            "author": "radioactive_walrus"
        },
        {
            "level": 0,
            "comment": "Any good?",
            "score": 3,
            "author": "GreatTragedy",
            "replies": [
                {
                    "level": 1,
                    "comment": "As a craft beer fan that was my first thought as well.\n\nAlthough I too have been known to feel artificially intelligent after several drinks.",
                    "score": 6,
                    "author": "Silk2212"
                },
                {
                    "level": 1,
                    "comment": "Decent, yep! Not earth shattering but better than I feared :D",
                    "score": 2,
                    "author": "darrenpauli"
                }
            ]
        },
        {
            "level": 0,
            "comment": "To be fair to the brewer, I reckon (there's nothing in their site so this is only opinion) they're having a bit of fun with it, rather than testing if AI could replace the head brewers or whoever. \nBrewers down here in Australia like to experiment a bit, as they do elsewhere. Some beers they put out are bloody awful but it's all in the spirit of fun and Dainton are respected. \nThat said, this wasn't anything to write home about. Seems chatgpt makes pretty boring beer lol",
            "score": 4,
            "author": "darrenpauli"
        },
        {
            "level": 0,
            "comment": "Me: give me your best IPA beer recipe\n\nChatGPT\n\nCertainly! Here's a recipe for a classic American-style IPA:\n\nIngredients:\n\n    11 lbs (5 kg) Pale malt\n    1 lb (0.45 kg) Crystal 40 malt\n    0.5 lb (0.23 kg) Carapils malt\n    0.5 lb (0.23 kg) Munich malt\n    0.5 lb (0.23 kg) Wheat malt\n    0.25 lb (0.11 kg) Victory malt\n    1 oz (28 g) Columbus hops (bittering)\n    1 oz (28 g) Cascade hops (flavor)\n    2 oz (57 g) Centennial hops (aroma)\n    1 oz (28 g) Cascade hops (dry hop)\n    1 oz (28 g) Centennial hops (dry hop)\n    1 package of American Ale yeast (e.g., Wyeast 1056 or White Labs WLP001)\n    1 tsp Irish moss (clarifying agent)\n    5 oz (142 g) Priming sugar (for bottling)\n\nInstructions:\n\n    Heat 3 gallons (11 liters) of water in a large pot and bring it to a temperature of around 152°F (67°C). This will be your mash water.\n\n    Crush all the grains and add them to a mesh bag. Place the bag in the pot of hot water and stir well. Maintain the temperature at 152°F (67°C) for 60 minutes to allow the enzymes to convert starches into fermentable sugars.\n\n    After 60 minutes, remove the grain bag and let it drain back into the pot. Rinse the bag with a small amount of hot water to extract any remaining sugars.\n\n    Bring the liquid in the pot (the wort) to a boil. Once boiling, add the Columbus hops and let them boil for 60 minutes.\n\n    After 45 minutes of boiling, add the Irish moss to help clarify the beer.\n\n    After 60 minutes, turn off the heat and add the Cascade hops. Let them steep for 10 minutes.\n\n    Cool the wort rapidly by placing the pot in an ice bath or using a wort chiller until the temperature reaches around 68°F (20°C).\n\n    Transfer the cooled wort to a sanitized fermentation vessel (such as a glass carboy or plastic bucket) and pitch the yeast.\n\n    Ferment the beer at a temperature between 65°F to 70°F (18°C to 21°C) for about a week or until fermentation activity subsides.\n\n    After primary fermentation, add the dry hops (Cascade and Centennial) directly to the fermentation vessel. Let them sit for 5 to 7 days to enhance the aroma.\n\n    When ready to bottle, dissolve the priming sugar in a small amount of boiling water and add it to the beer. Stir gently to ensure even distribution.\n\n    Transfer the beer to sanitized bottles and cap them. Allow the beer to carbonate for approximately 2 weeks at room temperature.\n\n    After the carbonation period, your IPA should be ready to enjoy! Chill the bottles before opening and pour into a glass to fully appreciate the flavors and aromas.\n\nRemember to sanitize all equipment properly throughout the brewing process to prevent contamination. Enjoy your homemade IPA!",
            "score": 3,
            "author": "Buck_Thorn"
        },
        {
            "level": 0,
            "comment": "So you now have the nano bots!",
            "score": 5,
            "author": "gdb7"
        },
        {
            "level": 0,
            "comment": "That’s gotta be the stupidest thing I’ve ever heard of.",
            "score": 3,
            "author": "JuanShagner",
            "replies": [
                {
                    "level": 1,
                    "comment": "Mostly because it looks bad.",
                    "score": 0,
                    "author": "Facts_About_Cats"
                }
            ]
        },
        {
            "level": 0,
            "comment": "1.8 std drinks wtf",
            "score": 1,
            "author": "JamHead__",
            "replies": [
                {
                    "level": 1,
                    "comment": "6.5% ABV",
                    "score": 2,
                    "author": "CordialeOfficial"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yes, let’s put brewmasters and artists out of work so we can enrich tech bros. 👎",
            "score": 2,
            "author": "Dio_Yuji"
        },
        {
            "level": 0,
            "comment": "This picture of this chilled beer is giving me chills",
            "score": 1,
            "author": "surajvj"
        },
        {
            "level": 0,
            "comment": "One of our local breweries (9 Mile Legacy) did a Robot vs Human event where they had both AI &amp; their brewmaster come up with different recipes for the same beer, then brewed both and did side-by-side tasting.",
            "score": 1,
            "author": "Big_Knife_SK",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well.... who won?",
                    "score": 2,
                    "author": "xero_peace",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "ChatGPT narrowly won but they had to do a lot of edits to the initial recipe it spat out.\n\nhttps://www.bnnbloomberg.ca/robot-vs-human-saskatoon-brewer-goes-head-to-head-with-chatgpt-designed-beer-1.1916448",
                            "score": 0,
                            "author": "Big_Knife_SK"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "From my understanding, the artwork is made by AI not the beer itself",
            "score": -1,
            "author": "ellermg",
            "replies": [
                {
                    "level": 1,
                    "comment": "I mean not physically but the second image shows that the recipe, artwork and blurbs were all AI generated",
                    "score": 5,
                    "author": "StoreBrandCereal",
                    "replies": [
                        {
                            "level": 2,
                            "comment": " That's seriously fucked. Soon 99% of jobs will be AI, the rich will shuffle money between themselves and everyone gets to play apocalypse survival.",
                            "score": 5,
                            "author": "Emergency_Type143",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Lol, I'll play French Revolution while y'all fight over scraps. I'm going to the source.",
                                    "score": 1,
                                    "author": "xero_peace"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "awful",
            "score": 1,
            "author": "Zulimations"
        },
        {
            "level": 0,
            "comment": "So AI is no longer a technological advancement, it's a marketing ploy.",
            "score": 1,
            "author": "VividLifeToday",
            "replies": [
                {
                    "level": 1,
                    "comment": "Always has been...",
                    "score": 1,
                    "author": "Coder_Arg"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thanks I hate it",
            "score": 1,
            "author": "Evethefief"
        },
        {
            "level": 0,
            "comment": "American IPA so bad, it can be AI generated xD.",
            "score": 1,
            "author": "Arcanile"
        },
        {
            "level": 0,
            "comment": "All your hops are belong to me",
            "score": 1,
            "author": "slider240sx"
        },
        {
            "level": 0,
            "comment": "False!  The hand only has 5 fingers.",
            "score": 1,
            "author": "shenan"
        },
        {
            "level": 0,
            "comment": "1.8 std drinks, and a pregnancy warning. Better use protection with this one.",
            "score": 1,
            "author": "mkells41"
        }
    ]
}