{
    "id": "146rvyf",
    "score": 202,
    "title": "On December 17, 1903, in Kitty Hawk, North Carolina, the Wright Brothers successfully flew an airplane for the first time. The markers show how far they got (the farthest was 852 ft)",
    "author": "Mad_Season_1994",
    "date": 1686483926.0,
    "url": "https://www.reddit.com/r/interestingasfuck/comments/146rvyf",
    "media_urls": [
        "https://i.redd.it/30t0r6r6md5b1.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\n**This is a heavily moderated subreddit. Please note these rules + sidebar or get banned:**\n\n\n* If this post declares something as a fact, then proof is required\n* The title must be fully descriptive\n* No text is allowed on images/gifs/videos\n* Common/recent reposts are not allowed (posts from another subreddit do not count as a 'repost'. Provide link if reporting)\n\n*See [this post](https://redd.it/ij26vk) for a more detailed rule list*\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/interestingasfuck) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "In case any of you decide to go to the memorial, there is a monument at the top of a hill. That is NOT where they flew the airplane in the bottom picture from. That hill is actually where they conducted tests with gliders a few years before. For testing the airplane/\"flying machine\", they started from the ground where the plaque in the first picture is and put the plane basically on a sled/track, powered it up and went off.\n\nAlso fun fact, the plane was destroyed by wind on that very same day after their last test. But it was patched up and now sits in the National Air and Space Museum\n\nAlso ALSO fun fact: Wilbur Wright once said “no airship will ever fly from New York to Paris.”",
            "score": 15,
            "author": "Mad_Season_1994",
            "replies": [
                {
                    "level": 1,
                    "comment": "Five years later, on Sept. 17, 1908, a modified Wright Brothers aircraft crashed during a demonstration at Fort Myer, Va., seriously injuring pilot Orville Wright and killing the observer, U.S. Army Lt. Thomas E. Selfridge. The first death due to powered flight.",
                    "score": 5,
                    "author": "jebus_sabes"
                },
                {
                    "level": 1,
                    "comment": "Im going there on Wednesday :D Ive been there once before and I cant wait to go again",
                    "score": 5,
                    "author": "ApolloSP1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The Wrights first controlled pitch, roll, and yaw.  Ture controlled flight",
            "score": 2,
            "author": "OutdoorRaleigh"
        },
        {
            "level": 0,
            "comment": "[source 1](https://www.aps.org/publications/apsnews/200407/history.cfm#:~:text=Santos%2DDumont%20made%20his%20first,main%20envelope%20lost%20its%20shape.)\n\n[source 2](https://www.cnn.com/2003/TECH/ptech/12/10/brazil.santosdumont.reut/#:~:text=It%20was%20on%20November%2012,the%20airplane%20all%20over%20Europe.)\n\nI would personally attribute this guy to modern flight.... Js\n\nHowever ALL of it is cool as hell",
            "score": 3,
            "author": "Confident-Local-8016",
            "replies": [
                {
                    "level": 1,
                    "comment": "Whitehead is another matter but the Santos argument doesn't hold water.  There were plenty of local witnesses to them circling  a field in Ohio in 1904, these photos are supposed to be from that time https://www.wright-brothers.org/Information\\_Desk/Just\\_the\\_Facts/Airplanes/Flyer\\_II.htm",
                    "score": 2,
                    "author": "MrmmphMrmmph"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Crazy to think we had multiple societies around the world who had air travel 70+ years before the Wright brothers.  Airships were common place throughout the 1800s",
            "score": 2,
            "author": "VanManDiscs"
        },
        {
            "level": 0,
            "comment": "And Ohio and North Carolina car tags have been beefin ever since",
            "score": 4,
            "author": "Substantial_Bet5764"
        },
        {
            "level": 0,
            "comment": "Gustav Weisskopf from Germany on August 14, in 1901 in Fairfield, CT was the first to fly.",
            "score": 2,
            "author": "Drachenfels1999",
            "replies": [
                {
                    "level": 1,
                    "comment": "From [Wikipedia](https://en.m.wikipedia.org/wiki/Wright_brothers):\n\n&gt;\tFirst powered flight claims are made for Clément Ader, Gustave Whitehead, Richard Pearse, and Karl Jatho for their variously documented tests in years prior to and including 1903. Claims that the first true flight occurred after 1903 are made for Traian Vuia and Alberto Santos-Dumont. Supporters of the post-Wright pioneers argue that techniques used by the Wright brothers disqualify them as first to make successful airplane flights. Those techniques were: A launch rail; skids instead of wheels; a headwind at takeoff; and a catapult after 1903. Supporters of the Wright brothers argue that proven, repeated, controlled, and sustained flights by the brothers entitle them to credit as inventors of the airplane, regardless of those techniques.\n\n&gt;\tThe aviation historian C.H. Gibbs-Smith was a supporter of the Wrights' claim to primacy in flight. He wrote that a barn door can be made to \"fly\" for a short distance if enough energy is applied to it; he determined that the very limited flight experiments of Ader, Vuia, and others were \"powered hops\" instead of fully controlled flights.",
                    "score": 10,
                    "author": "thermobear",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ah yes, because taking off from an airfield or smooth surface, and going into a headwind, or using a catapult, mean you're not really flying, says every navy flier.",
                            "score": 2,
                            "author": "Little_Creme_5932"
                        },
                        {
                            "level": 2,
                            "comment": "I sourced Alberto Santos-Dumont as well",
                            "score": 1,
                            "author": "Confident-Local-8016"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The flights that nobody photographed and he never reproduced... Even then they were uncontrolled.",
                    "score": 6,
                    "author": "wasdlmb"
                },
                {
                    "level": 1,
                    "comment": "True but that doesn't have anything to do with this post ...",
                    "score": 0,
                    "author": "fuckmethisburns",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "In relation to the plaque pictured, it absolutely does.",
                            "score": 1,
                            "author": "Drachenfels1999"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Slingshot powered is not a airplane. Santos Dumont flew for the first time.",
            "score": 1,
            "author": "Chloe0075",
            "replies": [
                {
                    "level": 1,
                    "comment": "TIL the F/A-18 is not an airplane.\n\nThey were flying for miles before Santos Dumont made his first flight.",
                    "score": 3,
                    "author": "wasdlmb"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I choose to believe it was [Gustav Whitehead in Bridgeport](https://www.nbcconnecticut.com/news/local/was-connecticut-first-in-flight/2024574/) in 1901.",
            "score": 1,
            "author": "notablyunfamous",
            "replies": [
                {
                    "level": 1,
                    "comment": "you're free to believe anything you like.",
                    "score": 2,
                    "author": "Elmojomo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Even better when it’s the truth, right? It’s more important to be accurate than to go with the crowd. Agreed?",
                            "score": -1,
                            "author": "notablyunfamous",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Generally, yes, but the documentation says otherwise.\n\nI wasn't there, and I suspect neither were you, so all we have to go on are third (or worse) hand accounts, none of which can be proven or disproven with absolute authority at this point.\n\nThe greater weight of evidence is that \"true controlled, powered flight\" was demonstrated by the Wrights in 1903.\n\nProve me wrong.  I'm genuinely interested to hear if there's strong evidence for an earlier controlled flight of any duration that could be called more than a hop or short assisted glide.",
                                    "score": 2,
                                    "author": "Elmojomo",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It would. But the documentation actually says: other than the Wright brothers.",
                                            "score": 0,
                                            "author": "notablyunfamous",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "?",
                                                    "score": 2,
                                                    "author": "Elmojomo"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The first flight was actually made by a possibly autistic german immigrant from connecticut who was such a recluse his own wife had no idea what he did all day. The wright brothers stole his idea for the lightweight engines that made their flight possible. The story was covered up because not only was the german inventor crazy but he didn't seem to want any credit at all",
            "score": -2,
            "author": "AreaProfessional7",
            "replies": [
                {
                    "level": 1,
                    "comment": "*Laughs in Santos Dumont*",
                    "score": 5,
                    "author": "ThunderdopePhil",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I know right\n\n[Source enough?](https://www.history.com/news/history-faceoff-who-was-first-in-flight)",
                            "score": 2,
                            "author": "Confident-Local-8016",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Wow, that was the heck of a rabbit hole. I am now officially a believer, thank you for the source.",
                                    "score": 2,
                                    "author": "NotMyRea1Reddit"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "They must have also broke the record for the quickest sale of designer watches and perfumes.",
            "score": 1,
            "author": "KeyToCancel"
        },
        {
            "level": 0,
            "comment": "Read a interesting article that it was a con. Some other bloke did it first but the Wrights  had money and connections and basically made it up as there's no footage. Plus ca change.",
            "score": 1,
            "author": "dequincyjelly"
        },
        {
            "level": 0,
            "comment": "Two great men from Ohio",
            "score": 1,
            "author": "munistadium"
        }
    ]
}