{
    "id": "1472s7w",
    "score": 167,
    "title": "Fossil skull of Deinotherium giganteum, a very large relative of modern elephants with downward facing tusks from the Miocene-Pliocene of Europe. Art by Roman Uchytel.",
    "author": "ImHalfCentaur1",
    "date": 1686511544.0,
    "url": "https://www.reddit.com/r/interestingasfuck/comments/1472s7w",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\n**This is a heavily moderated subreddit. Please note these rules + sidebar or get banned:**\n\n\n* If this post declares something as a fact, then proof is required\n* The title must be fully descriptive\n* No text is allowed on images/gifs/videos\n* Common/recent reposts are not allowed (posts from another subreddit do not count as a 'repost'. Provide link if reporting)\n\n*See [this post](https://redd.it/ij26vk) for a more detailed rule list*\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/interestingasfuck) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "These are super-interesting animals that were actually pretty different from modern elephants, and the artwork is cool but (many experts, if not most, would say) out of date and probably inaccurate.  But awesome.\n\nDeinotheria differed from elephants in a bunch of ways, such as having a longer and more flexible neck and being a lot better at running, even though some of them were much bigger than modern elephants.  Their tusks grew out of the lower jaw, not upper jaw, and probably weren't surrounded by skin.  Their lower lips were behind the tusks, not in front, and the tusks entirely came out the mouth, not beneath it, as in this artwork.\n\nThey did have shorter, heavier trunks, but apparently long enough ones to reach the ground easily; current reconstructions say they probably had to use their trunks to drink water, for instance.  Their tusks show wear from use on the sides and back, suggesting they used them for pulling, probably to pull on vegetation.  There are a bunch of ways they could have done this, probably in conjuction with the trunk (to pull things apart? to pull small trees down?), but it's hard to say exactly.",
            "score": 15,
            "author": "MostBotsAreBad",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; it's hard to say exactly\n\nA well written piece. Nice work, MBAB",
                    "score": 3,
                    "author": "fabulousfred"
                }
            ]
        },
        {
            "level": 0,
            "comment": "But why? To scratch their knees?",
            "score": 1,
            "author": "BaneRiders",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm sure they were utilized for digging up roots and tubers among other things.",
                    "score": 2,
                    "author": "skinnergy"
                },
                {
                    "level": 1,
                    "comment": "Any number of reasons. Sexual Selection, defense, food gathering to just name a few.",
                    "score": 1,
                    "author": "ImHalfCentaur1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "No wonder... I always pondered how the heck can the elephants scratch any itches they may have.. with THIS I see how it can be done",
            "score": 1,
            "author": "LinguoBuxo"
        },
        {
            "level": 0,
            "comment": "It makes more sense pointed this way...able to clear away brush and get to the roots in one motion",
            "score": 1,
            "author": "1984Slice",
            "replies": [
                {
                    "level": 1,
                    "comment": "Except they couldn’t reach the ground. This is one of the largest Proboscideans ever.",
                    "score": 1,
                    "author": "ImHalfCentaur1"
                }
            ]
        }
    ]
}