{
    "id": "14740bn",
    "score": 226,
    "title": "Nearly 3 foot wide Paleozoic petrified tree cutting with amethyst growing inside of it.",
    "author": "plastic-shrubs",
    "date": 1686514398.0,
    "url": "https://www.reddit.com/r/interestingasfuck/comments/14740bn",
    "media_urls": [
        "https://i.redd.it/hdoq3p065g5b1.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\n**This is a heavily moderated subreddit. Please note these rules + sidebar or get banned:**\n\n\n* If this post declares something as a fact, then proof is required\n* The title must be fully descriptive\n* No text is allowed on images/gifs/videos\n* Common/recent reposts are not allowed (posts from another subreddit do not count as a 'repost'. Provide link if reporting)\n\n*See [this post](https://redd.it/ij26vk) for a more detailed rule list*\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/interestingasfuck) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Even better...\n\n... there's a happy little ghost inside the tree.",
            "score": 6,
            "author": "weirdgroovynerd"
        },
        {
            "level": 0,
            "comment": "We once bought a rustic house in the USA southwest featuring slabs of polished mesquite as the kitchen counters, and we've seen regional structures built of pumice and petrified wood. A slab of this amythest-filled tree would fit in well in that old adobe home. 8-)",
            "score": 5,
            "author": "Chard069"
        },
        {
            "level": 0,
            "comment": "See how off centered the central rings are? That wider part between the smallest ring and the edge of the cross section is known as support wood. This indicates that this was the underside of a large limb, or the ground side of a leaning trunk. The rings grew larger here to support the additional load. Basically, it’s upside down.",
            "score": 2,
            "author": "skinnedthom"
        }
    ]
}