{
    "id": "j5t483",
    "score": 165323,
    "title": "102-year-old Beatrice Lumpkin put on a face shield and gloves and took her ballot to the mailbox today. When she was born, women couldn't vote.",
    "author": "dickfromaccounting",
    "date": 1601935999.0,
    "url": "https://www.reddit.com/r/interestingasfuck/comments/j5t483",
    "media_urls": [
        "https://i.redd.it/50fu6bhnocr51.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "That's a great story...but I can't stop thinking about what her work email address would be.",
            "score": 6720,
            "author": "mrcold",
            "replies": [
                {
                    "level": 1,
                    "comment": "Her social security number is 114 if that helps",
                    "score": 3365,
                    "author": "ThatRealBiggieCheese",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "1936 was the first SSN. She just might be 1.",
                            "score": 1862,
                            "author": "ZPhox",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Excuse my ignorance but is that possible? Do ssn’s get re-used on death? Do they endlessly go up or are they the same random generation of 9 numbers?",
                                    "score": 636,
                                    "author": "SEDGE-DemonSeed",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "They are not random. It's composed of an area number, a group number, and a serial number.",
                                            "score": 822,
                                            "author": "Falcondance",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Up until summer of 2011 that was true, now they’re random",
                                                    "score": 664,
                                                    "author": "pilotman996",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Was there a reason that changed other than just running out of area, group, and serial numbers? Possibly that algorithms could figure it out easier?",
                                                            "score": 271,
                                                            "author": "megashitfactory",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Yeah Social Security numbers are basically the lock and key to stealing someone's identity and the area code stuff made them much easier to steal for no reason.",
                                                                    "score": 499,
                                                                    "author": "whelp_welp",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "We should switch from social security numbers to social security hashes.\n\n\"What's the last 128 characters of your social security hash?\"\n\n\"c444deb8a73ec...\"",
                                                                            "score": 204,
                                                                            "author": "explodingtuna",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "What you should do is what we do in Canada. Our equivalent (Social Insurance Number, aka SIN) is illegal to use s as ID. It’s only to be used for taxation purposes.",
                                                                                    "score": 48,
                                                                                    "author": "millijuna",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Non-American here, what could a person conceivably do with someone else's SSN? I've always heard how much of a secret they are and how disastrous it would be for them to be leaked but never really understood why.",
                                                                            "score": 38,
                                                                            "author": "static_motion",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "I’m not super knowledgeable about this but from personal experience a lot of bank/money stuffs ask for your SSN to verify stuff so it’s just another key to get the monies. \n\nAdditionally, I think having someone’s SSN would allow you to open up loans/cards/accounts in their name if all they ask for is your name and SSN. Some parents have ruined their kids credit score by doing so.",
                                                                                    "score": 39,
                                                                                    "author": "CelestialWombat",
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "An SSN is basically how the government tracks your identity. Basically you're assigned the number and banks, credit bureaus, and your tax returns use it to tie all of that info to you. If somebody steals it they can take out a credit card in your name and max it in a day. If they do it right, it would be entirely on you to prove that you didn't do it.",
                                                                                    "score": 4,
                                                                                    "author": "Knoke1",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Also 000-499 prefixes were reserved for males and 500-999 for females. Just more identifying info for no reason.\n\nEdit: apparently I was given false information at some point.",
                                                                            "score": 85,
                                                                            "author": "[deleted]",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Thats not true. I’m a male and in 500-999",
                                                                                    "score": 84,
                                                                                    "author": "Mydogfartsconstantly",
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "SSN’s were never meant to be this all-encompassing national unique ID, and thus was never designed to be secure. I believe the SSA even explicitly says that it shouldn’t be used as a unique identifier. \n\nHowever, bc we have this resistance to establishing any sort of universal ID system in the US (because, “free-dumb” or something) it’s basically the one thing we have and every financial system has latched onto it given the lack of alternatives.",
                                                                                    "score": 120,
                                                                                    "author": "ArbiterofRegret",
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "The first 3 digits? I know plenty of females with 4xx-xx-xxxx SSN",
                                                                                    "score": 6,
                                                                                    "author": "Mr_MacGrubber",
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Cool well here’s to being born before then",
                                                                                    "score": 9,
                                                                                    "author": "[deleted]",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Risk of identity theft. \n\nIf you know the birthday and county of birth of someone you can guess their ssn to a reasonable chunk. \n\nThe algorithm point is also probably true. When I moved away to university, I met a girl who was born in the same hospital as me, 2 days apart. I was able to guess her SSN within 10 guesses",
                                                                    "score": 93,
                                                                    "author": "pilotman996",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "In short, Americans are too stubborn to get a universal id. The social secruity department decided to exist and do stuff and the tax department and businesses and the like saw a great number that everyone had their own of to keep track of who is who. Eventually the tax department tied a deduction to parents getting their kid a SSN. The number was never meant to be all that important so it wasn’t made to be. Now, you library card is probably more secure than your SSN\n\nCGP Grey has a great video on it all",
                                                                            "score": 9,
                                                                            "author": "CaptainBlobTheSuprem",
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Why were you guessing each other's ssn's?",
                                                                            "score": 25,
                                                                            "author": "Jcat555",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "It was like 3am during a hackathon. We were talking about randomization and security for some piece of code earlier in the day so it sort of paralleled. \n\nBasically: over-caffeinated, under-rested, nerds",
                                                                                    "score": 56,
                                                                                    "author": "pilotman996",
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Cos making out is over rated..",
                                                                                    "score": 47,
                                                                                    "author": "314sn",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "essentially that’s it. they changed it to random to make it more secure.",
                                                                    "score": 18,
                                                                    "author": "Dr_Cheez"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Yeah man. So dumb. My whole family (wife and kids) all our SSNs start the same way. 533 represent! But my newest gets hers and it’s all 003 or something. It’s like she’s not even family.",
                                                            "score": 45,
                                                            "author": "jweic",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "My brother and I have sequential numbers even though we were born six years apart.",
                                                    "score": 9,
                                                    "author": "xenya",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Social security numbers didn't used to get assigned at birth. You had to register for them. If your adults registered for them at the same time, they end up sequential or very nearly so.",
                                                            "score": 11,
                                                            "author": "zitsel",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Did your parents file for numbers for you both at the same time?",
                                                            "score": 3,
                                                            "author": "husbandbulges"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "So at the minimum they’d have to be 3 numbers?",
                                                    "score": 14,
                                                    "author": "SEDGE-DemonSeed",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I think so, something 001-001-0001 or whatever",
                                                            "score": 11,
                                                            "author": "7screws",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "the middle number does not have to be 3 just fyi, could be 001 01 0001 in some places.",
                                                                    "score": 18,
                                                                    "author": "LordDanOfTheNoobs",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I feel like I’ve only ever seen forms like W4 with space for 9 letters and not 10?",
                                                                            "score": 3,
                                                                            "author": "Maddiecattie"
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Damn Roosevelt!",
                                                                    "score": 6,
                                                                    "author": "DecisiveEmu_Victory"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I don’t know exactly how it works, but it’s not random generation. My wife is two days older than me, and our social security numbers share many of the same digits.",
                                            "score": 36,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "They randomized them in 2011 to reduce identity theft",
                                                    "score": 32,
                                                    "author": "pilotman996",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "They originally were given out regionally. So a set of 1000 consecutive numbers would be given to a hospital, when the hospital had assigned all those (usually in order as a simple way to keep track), they would ask for another 1000. \n\nThat actually wasn’t as bad as it sounds and there were more places than just hospitals that you could apply for a ssn. But in 1987 there was a big movement to encourage parents to apply for a ssn at birth in the delivery hospital. So after that point, knowing where and when someone was born could drastically narrow the likely of ssn they would have.\n\n2011 made them actually  pseudo random instead of just hoping people were applying randomly.",
                                                    "score": 4,
                                                    "author": "jwadamson"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "there are only 10 digits 0-9. \nfor each \"column\" there can only be 10 choices. So, with one column there are 10 choices, if there are two columns the first one can have 10 choices and for EACH of those 10 choices the second column  can present 1 of 10 choices. So, with two columns one can express everything from 00 to 99 which is 100 choices. \n\nThe generalization of this formula is 10^n where ^ = \"to the power of \" and \"n\" = the number of columns.  \n\nFor example if there were 4 columns one could express 0000 to 9999 and 10^4 is 10,000, which how many numbers could be expressed. \n\n\nRegarding SSN, the SSN has 9 digits, following our formula we can represent 1,000,000,000. Since we know there is a finite number of SSN's and essentially a non-finite number of Americans, at some point, we must re-use the numbers.  \n\nFeel free to use this formula any time you like. How man combinations can a lock make? how many different keys can a car have? how many whatever.",
                                            "score": 14,
                                            "author": "ohyeaoksure",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I'm pretty sure that is Mr Burns' SSN \n\nEdit. Burns is 2,Roosevelt is 1",
                                    "score": 29,
                                    "author": "SanchoBlackout69"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Her Social Security Number is XXVII",
                            "score": 23,
                            "author": "RestEqualsRust",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "She has a can of peaches in her pantry that says product of the Ottoman Empire",
                                    "score": 4,
                                    "author": "ThatRealBiggieCheese",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Well, shit, I wasn’t *going* to open a credit card in her name but now...",
                            "score": 42,
                            "author": "duaneap",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Girls in my school had the last name blumpklin. I feel for them.",
                    "score": 265,
                    "author": "mjmandi72",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was in USCG boot camp with a young woman with the last name Swallows. When she graduated, she was given the rank of Seaman.",
                            "score": 213,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I am sure this was met with maturity by all her crewmates and was not exploited for a joke in anyway.\n\nBut knowing Coasties myself...",
                                    "score": 113,
                                    "author": "waiting_for_rain",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Does the USCG have an HR department?",
                                            "score": 14,
                                            "author": "Virgin_Dildo_Lover",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Joke answer: yes but its off shore\n\nNon joke answer: AFAIK they are subject to the UCMJ (military only justice system) like the other military branches, so criminal complaints would go through that.",
                                                    "score": 20,
                                                    "author": "waiting_for_rain"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "We had an Indian fella in my USMC bootcamp. His last name was Begay. Surprisingly very little jokes about it. He was also 30 and we were all 18. Felt like an old man to us I guess so we didn't mess with him.",
                                    "score": 45,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 34,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That's hilarious.",
                                                    "score": 16,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 12,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Knew a guy who went by BJ and all I ever thought was why would you willingly put yourself through that. Calling blowjobs, BJs is ingrained into the English language at this point. You're only setting yourself up.",
                                                    "score": 5,
                                                    "author": "interestingsidenote"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "We had a navy cadet, last name Stains.",
                                    "score": 50,
                                    "author": "vbevan",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I went through boot with a kid, last name Sailor.\n\nI mean, what choice did he have?",
                                            "score": 29,
                                            "author": "ShillinTheVillain"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "F",
                                    "score": 23,
                                    "author": "beanoverender"
                                },
                                {
                                    "level": 3,
                                    "comment": "I was in USMC boot camp with a recruit named Phuck. He pronounced it \"Puck\" but you could probably guess what they called him.",
                                    "score": 10,
                                    "author": "spudsy518"
                                },
                                {
                                    "level": 3,
                                    "comment": "Knew a Seaman Guzzler, Seaman Ball, and Seaman Butts when I was in A-School in Charleston",
                                    "score": 6,
                                    "author": "LosingSkin"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The family that owns the largest furniture store in America is named Blumpkin. They are very rich, and very, very nice, and no one thinks anything of their name at all. \n\n\nhttps://www.nfm.com/meet-our-leaders",
                            "score": 14,
                            "author": "whenIwasasailor",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "First I thought of B. Lumpkin and then I thought of it as a verb like don't you be lumpkin!",
                            "score": 14,
                            "author": "terpsarelife",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That’s a very wholesome way to look at blumpkin.",
                                    "score": 6,
                                    "author": "srroberts07",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Lmao took me a min to get that, thanks for the laugh!",
                    "score": 58,
                    "author": "WaXXinDatA55",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What’s the joke?",
                            "score": 30,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "B. Lumpkin —&gt; Blumpkin",
                                    "score": 46,
                                    "author": "premenopausal",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah and?",
                                            "score": 56,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "A blumpkin is when receiving a blow job while taking a shit",
                                                    "score": 98,
                                                    "author": "Underwater_Grilling",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "So a normal Tuesday evening",
                                                            "score": 41,
                                                            "author": "Virgin_Dildo_Lover",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Just realized what tomorrow is! Thanks OP!",
                                                                    "score": 7,
                                                                    "author": "Bigbadwolf6049"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Learned a new thing today",
                                                            "score": 32,
                                                            "author": "Smegmaliciousss",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "English doesn't even have a dedicated word for a gender neutral pronoun, but it has this.",
                                                            "score": 8,
                                                            "author": "AboutHelpTools3"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "... oh",
                                                            "score": 4,
                                                            "author": "elizacandle"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "It's a term for a specific sexual act, involving the stimulation of the male sexual organ while the stimulated person is feeding the porcelain throne kibble from inside their digestive tract.\n\nIt's apparently common enough that even wiktionary has it.",
                                                    "score": 21,
                                                    "author": "JeshkaTheLoon",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 7,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Soooo....what?",
                                            "score": 15,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "A “blumpkin” is when you get head while taking a shit.",
                                                    "score": 28,
                                                    "author": "kneight88",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Ew and thanks for telling me",
                                                            "score": 16,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": ".---.---.---.--.-.@-.----..-.biz",
                    "score": 32,
                    "author": "ThisIsNotKimJongUn",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Blumpkin24@blumpkinstoilets.com",
                    "score": 7,
                    "author": "Nepiton"
                },
                {
                    "level": 1,
                    "comment": "TIL.",
                    "score": 4,
                    "author": "LanceFree"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Beatrice Lumpkin — who began voting 80 years ago — said the first presidential candidate she voted for was FDR in 1940. She hasn't missed a vote since. [Read more](https://www.cbsnews.com/news/election-2020-102-year-old-woman-ballot-ppe-chicago/)",
            "score": 2225,
            "author": "dickfromaccounting",
            "replies": [
                {
                    "level": 1,
                    "comment": "Pretty crazy to me that America let black men vote before white women could.",
                    "score": 508,
                    "author": "conservatismer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "In many places they only had the \"right to vote\" on paper. In reality, poll tests and poll taxes would keep them from actually exercising that right.",
                            "score": 580,
                            "author": "Korwinga",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Also literal armed mobs of racist mother fuckers.",
                                    "score": 434,
                                    "author": "Excal2",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Poll watchers, as Trump politely requested during \"his\" debate.",
                                            "score": 193,
                                            "author": "casper911ca",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Exactly.\n\nThis is why the Proud Boys threw up celebration videos after he told them to \"stand back and stand by\".\n\nThey're itching to threaten and kill their fellow citizens in service to this pathetic clown.\n\nI don't think I'll ever understand what  motivates someone to plan to commit multiple felonies impeding the rights of his fellow common citizens. But  to do it for Trump? God that's just hard to fathom.",
                                                    "score": 84,
                                                    "author": "Excal2",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Also the DT Jr. Video asking for \"Army for Trump\" to join a \"security operation\" and \"help us watch them. Not just on Election Day, but also during early voting and at the counting boards.\"\n\nThe militaristic verbiage. I can just see the open carry folks now and even intimidation of the polling officials.\n https://www.npr.org/2020/09/30/918766323/trumps-calls-for-poll-watchers-raises-fears-about-voter-intimidation",
                                                            "score": 27,
                                                            "author": "casper911ca",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "There’s a good documentary of this! It’s called All in: The Fight for Democracy on Amazon Prime.",
                                    "score": 16,
                                    "author": "_The_Tempest_",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "That’s a remnant of property qualifications. Some stated allowed “free men of color to vote immediately after the Revolutionary War as long as they qualified under the other regulations.\n\nThis slowly changed throughout history.  It used to be male property owners could vote, then some states lifted the property ownership for whites but keep it for free men of color, then some states did the opposite and restricted the voting rights of free men of color based on ancestry or other random qualifications. \n\nThen after the 15th amendment, which prohibited states from restricting the right to vote based on race, etc. many states found loopholes, “Black Codes”, most of which were passed at the state or local level in direct response to the 14th and 15th amendment immediately following the Civil War. \n\nThe first “Women Rights” conference didn’t even happen until 1848.  Men of color who owned land had been voting for over half a century by the point the firm women’s conference even happened. It wasn’t until after the 15th amendment that the women’s suffrage movement really took off. By 1870 women could vote in two territories, Utah and Wyoming, but not in any states. 8 years later the 19th amendment protecting the right to vote regardless of sex was proposed to congress, but would not be ratified until 1919, a full four decades later. \n\nSorry for the rant. I’m a history professor without a class to teach.",
                            "score": 88,
                            "author": "AtomicTanAndBlack",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This be your classroom bro, go off. Apologies are not necessary.",
                                    "score": 26,
                                    "author": "Drunksmurf101"
                                },
                                {
                                    "level": 3,
                                    "comment": "Thanks for the refresher, Prof. Quality post.",
                                    "score": 11,
                                    "author": "TedTheGreek_Atheos"
                                },
                                {
                                    "level": 3,
                                    "comment": "Don't be sorry, I love history and this was very interesting, thank you!",
                                    "score": 14,
                                    "author": "CalmAtADisco"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 43,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "On the flip side, America has only had 10 black senators ever, and 2 of them were in the 1870s! Only 2 black senators were elected between 1876 and 2005!\n\nTo date, 57 women have served in the United States Senate, with 26 serving at this time.",
                                    "score": 38,
                                    "author": "Pure-Sort",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That is interesting!",
                                            "score": 10,
                                            "author": "NerdBot9000"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 110,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah and the DNC hated him lol",
                            "score": 31,
                            "author": "TheTurboGay",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "FDR was against public unions, helped bolster communism in China and specifically worked to exclude black people from the new deal and GI Bill for war time service.\n\n\nHe's actually pretty shitty.",
                            "score": 70,
                            "author": "LegitimateOversight",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "well how do i measure the man..\n\nthat first comment there, it has two sentences. your comment has two as well.\n\ni don't know what to repeat on reddit for the next few years. can someone help me out?",
                                    "score": 30,
                                    "author": "hoxxxxx",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Learn more, get context. I dont think many historical figures were good or evil; just champions of different ideas of their time. Looking through a modern lens, most figures are a mixed bag.",
                                            "score": 18,
                                            "author": "Drunksmurf101"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Also put the entire Japanese American population into internment camps, and tried to justify it.",
                                    "score": 62,
                                    "author": "Kerbonaut2019",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Oh snap, forgot about that one.\n\nAnd threatened to stack the Supreme Court if they didn't rule in his favor.\n\nReally pretty shit.",
                                            "score": 28,
                                            "author": "LegitimateOversight",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Which politician isn't?",
                                    "score": 34,
                                    "author": "ImHopelesslyInLove",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "I think it’s somewhat hard to hold him to the standards of the present; how could he predict that communism in China would turn out the way it did? We didn’t even know the USSR was atrocious until after FDR’s death.\n\nI agree that people should have exercised their moral compass, but we have to keep in mind the various political pressures they were under and the different circumstances. Hindsight is 20/20, but no one is a clairvoyant",
                                    "score": 6,
                                    "author": "prettylittleliongirl",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "We just gonna ignore him leading the US out of the Great Depression and through most of WWII?",
                                    "score": 34,
                                    "author": "BBN2IL",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "red lining alone makes him a pos. The generational wealth and educational divide it caused will be felt for many more generations. And don't think for a second that wasn't the intent",
                                    "score": 4,
                                    "author": "cporter1188",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I agree completely.\n\nNot someone to be praised in the least bit.",
                                            "score": 6,
                                            "author": "LegitimateOversight"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "She also has an elite tier name. Beatrice Lumpkin could be the protagonist of a 50-book series of young adult novels who lives on a farm outside a small town.",
                    "score": 11,
                    "author": "MundaneInternetGuy"
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 42,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "B.Lumpkin",
            "score": 565,
            "author": "TVxStrange",
            "replies": [
                {
                    "level": 1,
                    "comment": "P. I. Staker. Come on!",
                    "score": 87,
                    "author": "Jumbo_Cactaur",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's...its a swan",
                            "score": 24,
                            "author": "Kyle102997",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It has a long elongated neck",
                                    "score": 9,
                                    "author": "solidsausage900"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 23,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "What?",
                    "score": 10,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s a sex thing, kinda gross too",
                            "score": 13,
                            "author": "HardcoreHazza",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Only kinda gross? Really?",
                                    "score": 4,
                                    "author": "xatrinka",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "*here you go* \n\nA blumpkin refers to the delicate art of giving someone a blow job while they sit on the toilet and do a poo.",
                            "score": 26,
                            "author": "boobercal",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "And up until the 1970s, women didn't have the right to open a bank account in their own names or take out a mortgage without a male co-signer. Blatant inequalities like that are not very far back in history. Most of our parents were alive at that time.",
            "score": 276,
            "author": "Birdie121",
            "replies": [
                {
                    "level": 1,
                    "comment": "And let’s not forget marital rape was legal until the 90s",
                    "score": 148,
                    "author": "_useless_reptile_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's still legal in at least 10 countries around the world and many countries around the world still force women to marry the man who raped her as well. There are still over 46 countries in the world where their are no domestic violence protection laws for women unless there is greivous bodily harm or death.  In the UK, a family estate is still passed down to the eldest son. In 18 countries around the world women aren't allowed to accept a job without their husbands permission. In Saudi Arabia, women still aren't allowed to drive a car. We still have a long way to go to achieve equality.",
                            "score": 67,
                            "author": "dancingelves25",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not at all a defense of saudi arabia, but MBS issued a decree a few years back allowing saudi women to drive. Your point still stands.",
                                    "score": 36,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Glad to hear they finally got the right. I just read they are detaining some of the female activists involved though, which is sad.",
                                            "score": 11,
                                            "author": "dancingelves25"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Here is another depressing fact:\n\nIn several US states, marrying 12-13-year-old girls away is legal.\n\nEven more depressing, in some states, the girls aren't allowed to divorce without their parent's permission until they're 18.",
                                    "score": 29,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That's messed up.",
                                            "score": 7,
                                            "author": "dancingelves25"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The first women's athletic shoe was released in 1978.",
                            "score": 35,
                            "author": "Langlie",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Right, and even now marital rape is usually dealt with under a separate law with more lenient penalties than non-marital rape.",
                            "score": 26,
                            "author": "Birdie121"
                        },
                        {
                            "level": 2,
                            "comment": "You know, \"the 80s\" and all \"those\" decades from 1970-2000 seemed to be such long periods of time, but 10 years isn't that long for so much to change. Hm.",
                            "score": 3,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why does the dude on the bike look like Nightcrawler form X-Men?",
            "score": 218,
            "author": "LegacyMinecraft",
            "replies": [
                {
                    "level": 1,
                    "comment": "He must’ve blue himself",
                    "score": 53,
                    "author": "rolindirty",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He's on his way to a blue man group meeting, they got that great Dr Funke to come and and sign copies of his new book",
                            "score": 4,
                            "author": "GreenWithENVE"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "To be honest, when she was born no one her age could vote.",
            "score": 434,
            "author": "ahbi_santini2",
            "replies": [
                {
                    "level": 1,
                    "comment": "When you were born no one your age could vote either. Strange coincidence",
                    "score": 181,
                    "author": "ozzy_thedog",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "when I was born, I was the same age as she was when she was born",
                            "score": 113,
                            "author": "DeadBambii",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 55,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "At age 6 and without a face?",
                                            "score": 10,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I was born the youngest person alive. Top that.",
                                    "score": 19,
                                    "author": "Mr830BedTime",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "When I was born, I was my parents oldest child.",
                                            "score": 12,
                                            "author": "SixFootJockey",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "My mother had a cesarean, so I was never actually born. Therefore, I cannot die.",
                                                    "score": 15,
                                                    "author": "Mr830BedTime",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "You can also kill Hamlet",
                                                            "score": 7,
                                                            "author": "garfieldandfriends2"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Not natural born, so can’t be President either.",
                                                            "score": 6,
                                                            "author": "ItsMEMusic"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "so.... she technically survived 2 pandemics? ( flu and covid? )",
            "score": 105,
            "author": "_Chxrles",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 95,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "yes the plague of justinian was a particularly nasty one, im glad she made it through that one",
                            "score": 5,
                            "author": "mwmwmwmwmmdw"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The original SARS, Ebola, and the Seine Flu all happened quite recently. Chances are you have lived through quite a few pandemics.",
                    "score": 25,
                    "author": "LotharVonPittinsberg",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think those were only epidemics",
                            "score": 20,
                            "author": "idekmanijustworkhere",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Swine flu was a pandemic, the others weren't",
                                    "score": 18,
                                    "author": "SuperSMT"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "she might not survive covid, its not over yet.",
                    "score": 20,
                    "author": "RedditAdminsRcunts44",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 42,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They’re thinking your viral load has a lot to do with it.\n\nThat’s why bars and large gatherings are very bad. Get multiple people spreading and breathing all their germs on everyone and you’re ending up with a higher viral load.",
                                    "score": 23,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 13,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Well, it depends what she and her insurance (or family) could afford.\n\nI had to live in to different regard-type residential homes for a while. One was lovely and, though I wanted to be home) it was a good place to stay. Well staffed and everybody had their own rooms. Outside therapist came in and the care was top notch.\n\nBefore that, I had been in one with minimum, barely trained staff and shared rooms. It was nowhere *near* the quality of care that it needed to be. Thankfully, I had enough resources that my family stepped in and petitioned my insurance provider until I was moved to the better home (after which I reported it and sent videos I took to a group that investigates nursing home abuse.)\n\nThe bad home had over 90 Covid deaths. The second had 5 *cases* and 3 deaths. The home you are in makes a HUGE difference to the chances of survival.",
                                                    "score": 5,
                                                    "author": "fightwithgrace"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Does viral load refer to the number of covid organisms that are inside the body? \n\n&gt;That’s why bars and large gatherings are very bad. Get multiple people spreading and breathing all their germs on everyone and you’re ending up with a higher viral load.\n\nOr it could be simply due to genetics. There are chain smokers in the world who live to be 105 while a healthy 20 year old can die of a random brain aneurism.",
                                            "score": 6,
                                            "author": "zold5",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "She's obese but a strong gust of wind could send here packing?",
                                    "score": 7,
                                    "author": "ratshitty_heavenjoke",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 7,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "“Face shield and gloves”\n\nBihh that’s a whole ass hazmat suit lmao\n\nEdit: Y’all I’m at 666 likes don’t fuck this up\n\nEdit again: You bastards",
            "score": 849,
            "author": "SoiledFlapjacks",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 259,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There is 1 old woman Among Us",
                            "score": 22,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "&gt;&gt;cute little spaceman\n\nSpaceperson* c’mon it’s 2020",
                            "score": 35,
                            "author": "sellwinerugs",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You mean Astronaut? She's clearly American",
                                    "score": 25,
                                    "author": "Dressundertheradar"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Pink is confirmed I saw her do the voting task.",
                            "score": 4,
                            "author": "Knoke1"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I do want this ‘among us’ cosplay",
                    "score": 54,
                    "author": "theSomberscientist",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "It's a PAPR hood. It's designed to be connected to a hose coming from a compressor that filters the air and feeds it up to you. I can see she has something connected to the back, but I doubt she has a PAPR. The material is purposefully not breathable, so I hope she's not using it without anything. I definitely think someone of her age should take extreme caution leaving their house in a pandemic. This might be beyond extreme.",
                    "score": 3,
                    "author": "AnotherLolAnon"
                },
                {
                    "level": 1,
                    "comment": "She goes through all that protection and some asshole goes right up to her to snap a photo lol",
                    "score": 8,
                    "author": "Bluth-President",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You think it's more likely that some random person saw an old woman voting and quickly ran up to snap a photo or that it's someone she knew who was with her the whole time?",
                            "score": 12,
                            "author": "iushciuweiush"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "For those who might not know, women needed a constitutional amendment to vote.\n\nThe Supreme Court ruled that women had the right to vote in the 1870’s I believe but their vote was suppressed for decades. Even leading to arrests.\n\nIt was passing the Nineteenth Amendment that it became part of the U.S. Constitution on August 18, 1920. It states, \"The right of citizens of the United States to vote shall not be denied or abridged by the United States or by any State on account of sex.\"",
            "score": 70,
            "author": "Limp_Distribution",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Beatrice has been fighting for working people and minorities for decades now.\n\nShe professes a lifetime love of science and became a mathematics instructor in 1967 at the future Malcolm X College.\n\nhttps://i.imgur.com/rV5AZ2N.png",
            "score": 110,
            "author": "TooShiftyForYou",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I had to look it up:\n\n&gt;The 1920 election was the first United States presidential election in which women were permitted to vote in every state.\n\nBeatrice Lumpkin was born in 1918, so she was 2 years old when all women were permitted to vote.\n\nOP’s title *“When she was born, women couldn't vote”* is technically correct, but that’s not the world she grew up in.",
            "score": 250,
            "author": "sumpuran",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think it was more used just as a line to make the reader have a gauge on just how long she’s been alive and how much history she’s lived through.",
                    "score": 128,
                    "author": "dushdj",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And how not that long ago half the population didn't have the right to vote.",
                            "score": 52,
                            "author": "devourer09",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's pretty crazy to think how deeply entrenched patriarchy has been in societies. Like comparing [Black suffrage](https://en.wikipedia.org/wiki/Black_suffrage) to [women's suffrage](https://en.wikipedia.org/wiki/Women%27s_suffrage) is very eye opening, in the UK for example the first black man to vote was in 1774 but the first women to vote were in 1918(women could vote at 30 with property qualifications or as graduates of UK universities, only in 1928 did they get equal voting rights).",
                                    "score": 10,
                                    "author": "futurarmy"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I thi k it's more to show the time line of progress. If you are young, segregation and treating women like inferior beings seems like eons ago. In reality, they existed within the lifetime of some people.\n\nDon't just take something as never going to change because it has always been that way. What is right is not the same as what is morally correct, and both of those can and will change.",
                    "score": 20,
                    "author": "LotharVonPittinsberg"
                },
                {
                    "level": 1,
                    "comment": "\n&gt;1918, so she was 2 years old when all women were permitted to vote.\n\nAll women [didn't get the right to vote](https://en.m.wikipedia.org/wiki/Nineteenth_Amendment_to_the_United_States_Constitution#Limitations) until the 50s and 60s. There were racist laws in many places that prevented various minorities from voting.",
                    "score": 13,
                    "author": "wallabee_kingpin_"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have a r/Tooafraiftoask question. I'd appreciate if someone can answer.\n\nIf someone casted their ballot, but died before election day, or died during the counting of the votes. Would their vote be counted, or could it be considered fraudulent?",
            "score": 5,
            "author": "Wolviam"
        },
        {
            "level": 0,
            "comment": "Pink sus",
            "score": 40,
            "author": "LordJuan4",
            "replies": [
                {
                    "level": 1,
                    "comment": "I saw her doing task by the mailbox so she safe",
                    "score": 27,
                    "author": "Millum2009",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "But the taskbar didn't go up.",
                            "score": 4,
                            "author": "jfhvac",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "She ready for the medbay scan",
                    "score": 4,
                    "author": "nimb0slice"
                },
                {
                    "level": 1,
                    "comment": "Had to scroll too far for this. I am disappoint.",
                    "score": 6,
                    "author": "teooet"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Pink isn’t the imposter guys! I saw her do her task (vote)!!",
            "score": 7,
            "author": "skyk3409"
        },
        {
            "level": 0,
            "comment": "Plot twist: she voted for trump",
            "score": 135,
            "author": "Watermelonjokes",
            "replies": [
                {
                    "level": 1,
                    "comment": "She's a socalist labor activist so I'm gonna say no",
                    "score": 54,
                    "author": "history777"
                },
                {
                    "level": 1,
                    "comment": "This post would disappear mysteriously fast",
                    "score": 54,
                    "author": "xFaro"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That's a hell of a lot more than just *face shield and gloves*.",
            "score": 11,
            "author": "Rdubya291"
        },
        {
            "level": 0,
            "comment": "I bet she voted for biden.",
            "score": 5,
            "author": "VivecsWrath",
            "replies": [
                {
                    "level": 1,
                    "comment": "Probably she lives in Chicago and she is a labor/minority rights activist.",
                    "score": 9,
                    "author": "Alone-Monk"
                }
            ]
        },
        {
            "level": 0,
            "comment": "One of the members of blue man group thinks he’s slick riding in the background...I see you.",
            "score": 6,
            "author": "metal_bone"
        },
        {
            "level": 0,
            "comment": "Good for you, Bea!!❤️",
            "score": 5,
            "author": "Xunaun"
        },
        {
            "level": 0,
            "comment": "Also when she was ten: Spanish Flu. She ain’t fuckin’ around.",
            "score": 6,
            "author": "splunge4me2"
        },
        {
            "level": 0,
            "comment": "I'm not gonna lie I'm not an American but voting by mail seems dangerous.",
            "score": 5,
            "author": "homelikepants45"
        },
        {
            "level": 0,
            "comment": "She is the only good BLumpkin out there.",
            "score": 14,
            "author": "Bohbo",
            "replies": [
                {
                    "level": 1,
                    "comment": "I beg to differ sir",
                    "score": 16,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "That's a pretty dystopian picture, I'd say.",
            "score": 4,
            "author": "Nousernamesleft0001"
        },
        {
            "level": 0,
            "comment": "Vote",
            "score": 4,
            "author": "Dells51"
        },
        {
            "level": 0,
            "comment": "Mrs B. Lumpkin you say?",
            "score": 5,
            "author": "The_Real_Selma_Blair"
        },
        {
            "level": 0,
            "comment": "I couldn't vote when i was born either. She aint special",
            "score": 28,
            "author": "SpiceyMeatball00"
        },
        {
            "level": 0,
            "comment": "So uh... are we just not gonna talk about the blue kid on the bike?",
            "score": 6,
            "author": "DoctorGuessWho",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Pink is safe guys",
            "score": 8,
            "author": "ThatSquidyBitch"
        },
        {
            "level": 0,
            "comment": "Nice costume. Bless her heart.",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I love her commitment",
            "score": 3,
            "author": "peanutsandsquirrels"
        },
        {
            "level": 0,
            "comment": "As a women, this is why I vote .... for those who fought the fight for me.",
            "score": 3,
            "author": "ElixirChicken"
        }
    ]
}