{
    "id": "orz0ak",
    "score": 160280,
    "title": "Still the most impressive way to light the Olympic flame.",
    "author": "ameen__shaikh",
    "date": 1627307091.0,
    "url": "https://www.reddit.com/r/interestingasfuck/comments/orz0ak",
    "media_urls": [
        "https://i.imgur.com/GaTVVZw.gifv"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\n**Please note:**\n\n* If this post declares something as a fact proof is required.\n* The title must be descriptive\n* No text is allowed on images\n* Common/recent reposts are not allowed\n\n*See [this post](https://redd.it/ij26vk) for more information.*\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/interestingasfuck) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "\"The arrow used by Antonio Rebollo to light the cauldron during the Opening Ceremony was specially designed to support the flame and avoid the archer burning himself. It was made of tempered duralumin, weighed about 100 grams and was a little over a metre long. Several arrows were created to prepare for and carry out the performance, one of which is kept at The Olympic Museum in Lausanne.\"",
            "score": 14491,
            "author": "WorkO0",
            "replies": [
                {
                    "level": 1,
                    "comment": "We should mention he was a Paralympian, and he did a cracking job under all that pressure.",
                    "score": 8229,
                    "author": "FiftyPencePeace",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The link does mention this.     \n     \n&gt;Antonio Rebollo is a para-olympic archery multi-medalist. The arrow that Antonio shot is now in the Olympic museum in Switzerland.",
                            "score": 384,
                            "author": "Mythril_Zombie",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Switzerland, eh? He really overshot it then.",
                                    "score": 482,
                                    "author": "fondista",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "He actually did overshoot it. It was on purpose. The goal was to overshoot the arrow and have someone ignite the flame electronically.",
                                            "score": 55,
                                            "author": "FourthBar_NorthStar",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I know, but it never hurts to mention :-) It wasn't a mistake, it was top class archery.",
                                                    "score": 13,
                                                    "author": "fondista"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yeah... would if he missed?",
                            "score": 2735,
                            "author": "Loggerdon",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He made them agree to give him a second shot. \n\nBut he also practiced it a thousand times.",
                                    "score": 4375,
                                    "author": "AtomicSamuraiCyborg",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Don’t  fear the man who has practiced a thousand different kicks, but the man who has practiced one kick a thousand times.\nBruce Lee",
                                            "score": 2952,
                                            "author": "StillGotLove4GOT",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "*Me spamming the same kick in tekken over and over*\n\nIm a goddamn genius",
                                                    "score": 2630,
                                                    "author": "Lumpy_Doubt",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Kazuya's leg spinning attack was my path to Tekken God Prime.",
                                                            "score": 295,
                                                            "author": "_DEDSEC_",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I won a local Tekken 2 tournament with Lei basically just using his high kick to a low leg sweep... Over... And over... And over... It was great. I was 10 years old taking out full grown adults lol.",
                                                                    "score": 189,
                                                                    "author": "MetalFingers760",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Ugh I loved playing as Eddy Gordo in the third and I’m almost certain my friend David used your strategy and beat my spinning, spamming Brazilian badassness nearly every time.",
                                                                            "score": 42,
                                                                            "author": "Van-garde",
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "There was a recent game exhibition before corona started to which I went, I was 18 at the time, and I noticed Tekken 7 or 8 on Xbox, me and my bro started playing it with our fav childhood characters from PSP Tekken. Naturally Kazuya's spinning attack won most of the time. \n\nBut then the exhibition staff noticed what I was doing and they joined in trying to beat me, granted some of them tried really hard. But I still managed to win. \n\nI really enjoyed the nostalgia vibes everyone showed though including myself.",
                                                                            "score": 33,
                                                                            "author": "_DEDSEC_",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I'm gonna rolling death cradle then jaguar bomb the flame in 2024",
                                                            "score": 92,
                                                            "author": "[deleted]"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Hello? FGC police? Yes I found the Eddy Gordo player.",
                                                            "score": 14,
                                                            "author": "ArchAngelZXV",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Min-Max your stats.\n\n\\- gamers",
                                                    "score": 19,
                                                    "author": "GuerrillaApe",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Is there a word for this literary device e.g. doing things right and doing the right things.",
                                                    "score": 16,
                                                    "author": "entropy_bucket",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I like to call it \"the shwippy shwawp\"",
                                                            "score": 16,
                                                            "author": "[deleted]"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "https://i.imgur.com/XhpwVi3.jpg",
                                            "score": 21,
                                            "author": "El_Impresionante"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "\"HE GETS ANOTHER SHOT!\"",
                                            "score": 54,
                                            "author": "poliuy",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "*(shuffles through the movie script)*\n\n🙄 Yeah, yeah... he gets another shot. 🙄",
                                                    "score": 36,
                                                    "author": "El_Impresionante"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Didn’t he missed a few in practice prior to this??",
                                            "score": 7,
                                            "author": "KindBob"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Then The Blackfish would have to step in.\n\n*Gimme that!*",
                                    "score": 106,
                                    "author": "fuzzytradr",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Hey Edmure hold ma beer",
                                            "score": 18,
                                            "author": "cat_stiel"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "He did. The flame was lit by remote control. They didn't want to take that risk.",
                                    "score": 1693,
                                    "author": "webbyyy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Wasn't a miss per se, they told him to aim past the target.  Didn't want to risk the arrow ricocheting out of the cauldron and into the crowd.  The camera angle was intentional to make both the aim and timing less clear.\n\n*EDIT: watch this, skip to 1:20 or so* https://www.youtube.com/watch?v=Fca-MbAKOV0",
                                            "score": 1367,
                                            "author": "disco_biscuit",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "On the other hand _impaled by meter-long flaming arrow at the Olympics_ would make a hell of an epitaph for a tombstone...",
                                                    "score": 39,
                                                    "author": "EloquentBaboon"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "&gt;Wasn't a miss per se, they told him to aim past the target.  Didn't want to risk the arrow ricocheting out of the cauldron and into the crowd.  \n\nNow this I hadn't heard before. Would you mind sharing your source?\n\nEdit: No source yet for the \"trying to avoid a **ricochet**\" claim..",
                                                    "score": 484,
                                                    "author": "IsItManOrMonster",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "the shot went off exactly as intended\n\nhttps://www.latimes.com/archives/la-xpm-1993-02-02-sp-993-story.html\n\n&gt; The organizers could have ignited the flame automatically if he had missed, an unlikely prospect considering that he failed to hit the target only twice in nearly 700 practice shots. But just in case, he brought along a second arrow after extracting a promise from them that they would allow him another shot.\n\n&gt; It was not necessary. The arrow sailed over the caldron at exactly the right spot, passing through the gas from a jet inside to ignite the flame. Most observers thought Rebollo’s arrow landed in the caldron, but that was never the plan.",
                                                            "score": 81,
                                                            "author": "[deleted]"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "There's video from outside the stadium where you see the arrow flying out the stadium. (And the cauldron lighting) It was on the news the next day. Probably on YouTube somewhere?",
                                                            "score": 373,
                                                            "author": "jedimaster-bator",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Oh I've seen the arrow miss. What I had not heard was that this was _on purpose_. Could be a post-facto explanation they came up with to save face, though..",
                                                                    "score": 262,
                                                                    "author": "IsItManOrMonster",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "It's mentioned in the [Wikipedia article](https://en.wikipedia.org/wiki/1992_Summer_Olympics_opening_ceremony).",
                                                                            "score": 122,
                                                                            "author": "webbyyy",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "http://news.bbc.co.uk/sport2/hi/olympics2000/926190.stm\n\nHere’s the actual source if people were still skeptical",
                                                                                    "score": 113,
                                                                                    "author": "yamuthasofat",
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "The relevant sentence is supported by two sources, one being a weird website listing it as some sort of \"camera trickery\", and the other one being the official report framing it completely different (in the sense that he lit the gas coming out of the cauldron, which should be the procedure for a shot like this anyway).\n\nTLDR: While he intentionally shot over the cauldron, it would be different to phrase it as \"he intentionally missed\".\n\nBtw the Wikipedia article only links the viewer, but you can find the exact page (72) under [this](https://digital.la84.org/digital/collection/p17103coll8/id/35348/rec/59) link.\n\n/edit: 2nd + 3rd word",
                                                                                    "score": 47,
                                                                                    "author": "Ghargobyl"
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I mean, you don't have to hit the thing if the gasses are flamable",
                                                                            "score": 191,
                                                                            "author": "VesilahdenVerajilla",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "This is how I always assumed it had been done",
                                                                                    "score": 103,
                                                                                    "author": "Schnelt0r",
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "True. however, the flames would have then spread from the arrow to the cauldron. Instead, the flames rise up from the bottom if you look closely",
                                                                                    "score": 52,
                                                                                    "author": "anonimouse99",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Where can you find this alleged video?",
                                                                            "score": 18,
                                                                            "author": "RancorWranglerAMA",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "This was explained in r/archery past week. The arrow was not meant to land in the cauldron but to get through some gas (like a stove), lit it, then land safely behind the stadium. Which is exactly what it did.",
                                                                    "score": 47,
                                                                    "author": "ehproque",
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Got a arrow in the knee that day",
                                                                    "score": 46,
                                                                    "author": "In9e",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 6,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "It didnt miss but the remote control flame went on too early. It should take a second or 2 to burst like that using a fire arrow.",
                                            "score": 449,
                                            "author": "xxMeiaxx",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Not in the water temple",
                                                    "score": 294,
                                                    "author": "GullibleDetective",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "What did any of us do to deserve the fucking water temple…",
                                                            "score": 16,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": ".... Don't even. The Water Temple sucks.",
                                                            "score": 61,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "now all i can hear in my head is the echoing of those fucking boots\n\nalso i might be remembering it wrong but the boots sounds a lot like the doors opening",
                                                                    "score": 13,
                                                                    "author": "[deleted]",
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I enjoy the Water Temple.",
                                                                    "score": 23,
                                                                    "author": "Cumfart_420",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[This contemporary source](https://www.latimes.com/archives/la-xpm-1993-02-02-sp-993-story.html) says his arrow did in fact ignite the gas. He had only missed twice taking nearly 700 practice shots leading up to the event.",
                                                    "score": 167,
                                                    "author": "wtysonc",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "That's what I was going to say.. All he needed to do was get it into that massive cloud of gas and it would ignite.\n\nEDIT: OK, so now I'm starting to doubt myself and thinking maybe the olympic committee lied which wouldn't actually surprise me. If the arrow ignited the gas cloud wouldn't it ignite from the arrow downward? Here is a frame by frame I did from the source video:\n\nhttps://imgur.com/a/VILgm41",
                                                            "score": 97,
                                                            "author": "nahog99",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "That last frame could very well be the arrow igniting the gas from the top down. The flame would propagate down, burning and extinguishing as the flame moved down into the couldron. It would result in the appearance of a flame looking like it was lit from the bottom if captured in 1 frame at the right time.",
                                                                    "score": 14,
                                                                    "author": "SquirtsOnIt"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "If I've learned anything from my time on reddit, it's what happens when you get an open flame too close to a grill/bonfire/etc that you've left soaking in accelerant long enough for fumes to build up...",
                                                                    "score": 6,
                                                                    "author": "MaritMonkey",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "The fumes would still burn starting from the fire source. In the video the fire obviously starts from away from the arrow.",
                                                                            "score": 12,
                                                                            "author": "SnicklefritzSkad"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Looking at the video of it going over and out the stadium, the fire looks to erupt from the bottom of the cauldron. If the arrow did ignite the gas, wouldn't the ignition start above the cauldron where the arrow passed through?",
                                                            "score": 15,
                                                            "author": "thetransportedman"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I wanted to believe that article, and I *almost entirely* did, but I still wanted to take a closer look... If you go frame by frame, doesn't it appear to ignite from beneath? Wouldn't this be the opposite if the arrow was the source of ignition?\n\nhttps://imgur.com/a/VILgm41",
                                                            "score": 5,
                                                            "author": "nahog99"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "What are you talking about? It's natural gas is it not? Turn a gas grill on and then put a lighter to it, it'll fireball in under half a second.",
                                                    "score": 57,
                                                    "author": "Karavage"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[Too early?](https://i.imgur.com/2Z3kTtT.gifv)",
                                                    "score": 48,
                                                    "author": "IHadThatUsername",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Lol thanks for posting this. People are so /r/confidentlyincorrect it blows my mind.",
                                                            "score": 22,
                                                            "author": "nahog99",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "It was close to always make me wonder as a kid if the flame passed through the gas and actually lit it. But obviously not.",
                                                    "score": 5,
                                                    "author": "KidGold"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "6 more weeks of Winter Olympics.",
                                    "score": 15,
                                    "author": "RamenJunkie"
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 8,
                                    "author": "[deleted]",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt; would if \n\nOk fucking come on now \n\nWe’ve put up with “would of”, I will not tolerate “would if”",
                                    "score": 78,
                                    "author": "reecewagner",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I would an done better",
                                            "score": 14,
                                            "author": "Bruised_Penguin"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Apparently he made a deal with the Olympic committee that he’d get a second shot!",
                                    "score": 55,
                                    "author": "FiftyPencePeace",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "ballsiest torch lighter ever",
                            "score": 21,
                            "author": "Yakhov"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I wanted to ask if he burnt himself whilst shooting. Thanks for the information beforehand!",
                    "score": 367,
                    "author": "DaVinciJunior",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "i'd scar myself on purpose just to tell people bout my new badass wound",
                            "score": 145,
                            "author": "asseaterpleaser",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "wounds heal\n\nchicks dig scars\n\npain is temporary\n\nglory is forever.",
                                    "score": 110,
                                    "author": "Schedulator",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "So much wisdom from Keanu Reeves movies. The wisdom of Bodhi always gets me too: \"If you want the ultimate, you've got to be willing to pay the ultimate price. It's not tragic to die doing what you love.\"",
                                            "score": 26,
                                            "author": "wizard_of_awesome62",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I'm willing to bet they burnt some birds that were likely sitting on the edge of the cauldron\n\nEDIT: lol, looks like that actually happened at the '88 Olympics https://www.sbnation.com/lookit/2017/8/9/16119834/peace-doves-olympic-opening-ceremony-1988-seoul",
                            "score": 41,
                            "author": "jagnew78",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "As a Mistborn fan I'm appalled at this waste of duralumin.",
                    "score": 170,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "TIL duralumin is real and not made up by Sanderson",
                            "score": 152,
                            "author": "el_hefay",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I definitely thought that was made up. Does this mean that fucking bendalloy is also a real thing? Because I assume he also made that up to match with how insane Wayne is.",
                                    "score": 46,
                                    "author": "FireHazard11",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt; bendalloy \n\nYes, it's called Wood's metal. It's an alloy of bismuth, lead, tin, and cadmium (so it's pretty damn toxic.) It has a really low melting point (160f) so it's used in things like heat sensitive fire sprinklers, gas blow-off valves, etc.",
                                            "score": 70,
                                            "author": "bolotieshark",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Oh, so that explains why Wayne is batshit crazy.",
                                                    "score": 40,
                                                    "author": "FireHazard11",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "yeah, didn't they mention pretty early on that some of the metals were toxic and it caused problems? I can't remember it's been a while.",
                                                            "score": 18,
                                                            "author": "thedirtyknapkin",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Kelsier warned Vin to always burn off excess metal before sleeping because some of them were toxic, but bendalloy is stated to be really rare so I wouldn't be the least bit surprised if Wayne tried to stretch his supply by keeping it overnight.",
                                                                    "score": 23,
                                                                    "author": "FireHazard11",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "He can also just tap gold if he accidentally poisons himself",
                                                                            "score": 10,
                                                                            "author": "NovaAzure"
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Not to mention you never know when you need to throw up a speed bubble at a moments notice. Probably better to risk insanity than go without bendalloy reserves.",
                                                                            "score": 7,
                                                                            "author": "taicrunch"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "A surprising number of people don’t realize that electrum is a real thing too and not a fantasy metal.",
                                            "score": 9,
                                            "author": "SmartAlec105"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt;Does this mean that fucking bendalloy is also a real thing?\n\n[It is](https://en.wikipedia.org/wiki/Wood%27s_metal)",
                                            "score": 13,
                                            "author": "cwg930"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "The only ones made up by Sanderson are the \"God Metals\" (Atium and Lerasium), &gt;!which makes sense because they were the metallic forms of Ruin and Preservation respectively, so they wouldn't exist in a \"normal universe\".!&lt;",
                                    "score": 32,
                                    "author": "MobiusF117"
                                },
                                {
                                    "level": 3,
                                    "comment": "Duralumins just a fancy name for aluminium/copper alloy, also known as aircraft grade aluminum.\n\nPure aluminium is pretty weak and not really useful for anything. During WW1 the Germans figured out how to alloy it with copper and make a material that was strong, light and could be heat treated, perfect for aircraft. They called it duralumin so that the Allies would think they'd invented a special new wonder metal",
                                    "score": 5,
                                    "author": "Moose_in_a_Swanndri",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'm still impressed by the fact he held the fire  close to his fingers for few seconds before releasing.it do looks like gonna burn a bit.",
                    "score": 113,
                    "author": "-swxxt-",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; it do looks like gonna burn a bit\n\nWut",
                            "score": 23,
                            "author": "Bruised_Penguin",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "IT DO LOOKS LIKE GONNA BURN A BIT",
                                    "score": 32,
                                    "author": "nahog99",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": " it do looks like gonna burn a bit",
                                    "score": 10,
                                    "author": "Cristian_01"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Wow thanks for the information friend, really appreciate it!",
                    "score": 50,
                    "author": "ameen__shaikh",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "They were made by Easton. \n\nI worked there as an intern. They have 3 or 4 of these in big shadow boxes hanging up around the factory/office building in Salt Lake City. \n\nThe Easton family and their foundation were a big influence in getting archery readmitted into the Olympics for the 1972 games after being absent since the 1910s or 20s.",
                    "score": 10,
                    "author": "Alcancia"
                },
                {
                    "level": 1,
                    "comment": "The gas lit Olympic Torch auto lit at the right time to to give the impression it was lit by a flaming arrow.",
                    "score": 89,
                    "author": "cryptolicious501",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Imagine if a bird happened by right then like what happened to Randy Johnson.",
            "score": 2336,
            "author": "thealexstorm",
            "replies": [
                {
                    "level": 1,
                    "comment": "There was a torch lighting that BBQ'd a bunch of birds that were sitting on it",
                    "score": 607,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not just \"birds,\" but a bunch of doves they'd released earlier in the ceremony.",
                            "score": 368,
                            "author": "OOZ662",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Pretending to care about and then burning the literal symbol of peace because it would minorly inconvenience the process of proving whose nation is the best is a pretty solid metaphor though.",
                                    "score": 340,
                                    "author": "Briar_Thorn"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Why didnt anyone link [this](https://m.youtube.com/watch?v=8dgXRXVScFM) yet?",
                            "score": 28,
                            "author": "dudeitsrazz"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "bird flys into the rafters in a panic, setting the rafters on fire. substandard building codes led to the fire rapidly spreading and killing thousands before they could escape the stadium. An olympic to remember.",
                    "score": 39,
                    "author": "KaidenUmara",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Imagine no more, google the 1988 Olympics torch lighting.",
                    "score": 24,
                    "author": "SelectFromWhereOrder",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "For the curious people to lazy to do the search: https://www.reddit.com/r/olympics/comments/4wgi47/the_lighting_of_the_torch_at_the_1988_seoul/",
                            "score": 21,
                            "author": "Orazur_",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It would become a Phoenix I believe",
                    "score": 40,
                    "author": "blondechinesehair",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Briefly",
                            "score": 29,
                            "author": "--redacted--"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Or Dani Rojas in Ted Lasso",
                    "score": 4,
                    "author": "matthewsmazes",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Gondor calls for aid.",
            "score": 1042,
            "author": "mahatmamamama",
            "replies": [
                {
                    "level": 1,
                    "comment": "And rohan shall answer",
                    "score": 210,
                    "author": "Double-Fit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "WILL",
                            "score": 49,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Share the *LOAD*",
                    "score": 21,
                    "author": "solo_shot1st",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is cool. Think of the pressure on him as millions watching across the globe.",
            "score": 4838,
            "author": "NaSinRao",
            "replies": [
                {
                    "level": 1,
                    "comment": "It looked like the flame was hitting the top of his hand. But he’s like I’ll burn my hand before I mess this up.",
                    "score": 246,
                    "author": "Picardknows",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "If I recall, his arrow wasn't all that close, just good camera angles to allow for a big margin of error. Dont think the flame was actually lit with the arrow.",
                    "score": 2240,
                    "author": "Westy154",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Could be. But this is also a gas flame so even if the arrow was somewhere near the top of the torch, it would have still ignited it.",
                            "score": 1376,
                            "author": "NaSinRao",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Still a risk of no ignition during the \"big moment\" so likely had another ignition source just to make sure",
                                    "score": 822,
                                    "author": "Erkeric",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 274,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "TIK TIK TIK TIK TIK TIK TIK TIK TIK TIK TIK TIK TIK\n\nFWOOOM",
                                                    "score": 244,
                                                    "author": "mhc-ask",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 30,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Quality *Hives* track",
                                                            "score": 22,
                                                            "author": "DRF19",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Immediately starting singing it in my head",
                                                                    "score": 9,
                                                                    "author": "Get-Degerstromd"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Can't have been. There weren't 3-5 other males standing around offering their ways to light the torch better.",
                                                    "score": 53,
                                                    "author": "DMCSnake"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "They apparently crafted multiple arrows for the performance just in case he missed",
                                            "score": 43,
                                            "author": "DaddyDizz_",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "The arrow was shot at a high angle above the bonfire (which was then lit remotely) in order to keep the audience members safe. The arrow flew over the stadium and into a sand pit that was stationed outside.",
                                    "score": 119,
                                    "author": "Eft_inc",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "By sand pit, I'm assuming some poor schmuck who just happened to be walking by....... \"Honey, you will not believe what just happened to me.....\"",
                                            "score": 44,
                                            "author": "V65Pilot",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "*hair still smoldering*",
                                                    "score": 15,
                                                    "author": "Cistoran"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 46,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It’s sailed over the top and landed behind but the shot was accurate and I believe executed exactly as planned",
                            "score": 103,
                            "author": "Moist_Expression",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes, it was always the intent. And it all worked and looked, great.",
                                    "score": 37,
                                    "author": "Westy154"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "He was never supposed to get it in either, IIRC. Barcelona 1992 for those wondering.",
                            "score": 14,
                            "author": "justgotnewglasses",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Indeed. The worked just like they wanted it to.",
                                    "score": 8,
                                    "author": "Westy154"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Someone posted this the other day. I can’t find it, but they linked to articles about how the arrow was intentionally overshot. It was just lit at the right time, not by the arrow.",
                            "score": 131,
                            "author": "jaretok",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "In all the articles I see they said he hit the shot igniting the gas as the arrow flew over it but they had remote back up just in case. Trying to find where it says they did it automatically.",
                                    "score": 49,
                                    "author": "danceswithshibe",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Surely they'd have to activate the remote backup as the arrow flew past anyway otherwise it would look bad.",
                                            "score": 25,
                                            "author": "MerryGifmas",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "the arrow overshot and it was planned due to safety reasons (nobody wants a spectator getting bonked by a flaming arrow)\n\nstill very impressive and cool!",
                            "score": 38,
                            "author": "fambestera",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "*Brynden Tully liked that*",
            "score": 1143,
            "author": "ricuno",
            "replies": [
                {
                    "level": 1,
                    "comment": "*Edmure Tully disliked that*",
                    "score": 440,
                    "author": "dimaltay",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Naw man, Edmure tried to like it several times but couldn't.",
                            "score": 95,
                            "author": "isurewill",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "hence the dislike",
                                    "score": 44,
                                    "author": "justplanecrazy_",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Always thought that was mean. The poor guy just lost his dad, and they all look down on him for not making what looks like a fairly difficult shot anyway T_T",
                                            "score": 24,
                                            "author": "Late_Apartment_",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah in the show Edmure is portrayed as an incompetent fool and Blackfish as a total hardass who hates his nephew in that scene. I hated it.  \n\nIn the books Edmure is grief stricken and just cant hold it together. Blackfish is much more empathetic and  even tells Catleyn about how Lord Tully missed his shot when his own father died too.   \n\n&gt;“It is no disgrace to miss your shot,” her uncle told her quietly. “Edmure should hear that. The day my own lord father went downriver, Hoster missed as well.”",
                                                    "score": 36,
                                                    "author": "SupremeLeaderSnoke",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "For what it's worth, I believe if you have no loyalty to that character from the books then you have a few scenes that are a bit lighter in a series that's omnipresently dark.  He's a bit of - if not comic relief then at least some dark humor.\n\nHe tries to be a good commander but doesn't have the strategic genius of Robb Stark.  He has to marry a Frey to secure a strategic alliance but he's worried about how pretty she'll be.  He wants his uncle's respect and constantly fails.  He orders his men to stand down in order to save them and has to live with the shame.  \n\nLike a lot of things his finale in the final season was really bad, and played for laughs, and I don't think I can forgive it.  For the rest, I agree that the book version was a much better and more nuanced character, but if you've never read the books I think his on-screen portrayal was fun and interesting.",
                                                            "score": 11,
                                                            "author": "Slaphappydap"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Happened different in the books but Dumb and Dumber fucked it up. In the books he can't hit the shot cause he's still in deep grief and mourning for his father. Edmure from the books is the best Lord in the series probably, he actually cares about his people. He lets them into Riverrun to keep them safe, he defends the Riverlands at the Red Fork which dumbass Robb should've properly informed Edmure of his plans. In the show he is written as a fool but in the books he's actually dope.\n\n&gt;Edmure cursed softly. “The wind,” he said, pulling a second arrow. “Again.” The brand kissed the oil-soaked rag behind the arrowhead, the flames went licking up, Edmure lifted,\npulled, and released. High and far the arrow flew. Too far. It vanished in the river a dozen yards beyond the boat, its fire winking out in an instant. A flush was creeping up Edmure’s\nneck, red as his beard. “Once more,” he commanded, taking a third arrow from the quiver. *He is as tight as his bowstring*, Catelyn thought. Ser Brynden must have seen the same thing. “Let me, my lord,” he offered. \"I can do it,” Edmure insisted. He let them light the arrow, jerked the bow up, took a deep breath, drew back the arrow. For a long moment he seemed to hesitate while the fire crept up the shaft, crackling. Finally he released. The arrow flashed up and up, and finally curved down again, falling, falling … and hissing past the billowing sail. A narrow miss, no more than a handspan, and yet a miss. “The Others take it!” her\nbrother swore. The boat was almost out of range, drifting in and out among the river mists. Wordless, Edmure thrust the bow at his uncle\n\n&gt; **“It is no disgrace to miss your shot,” her uncle told her quietly. “Edmure should hear that. The day my own lord father went downriver, Hoster missed as well.”**\n\n&gt; Last night in his cups he had broken down and wept, full of regrets for things undone and words unsaid. He ought never to have ridden off to fight his battle on the fords, he told her tearfully; he should have stayed at their father’s bedside. “I should have been with him, as you were,” he said. “Did he speak of me at the end? Tell me true, Cat. Did he ask\nfor me?”\n\n- A Storm of Swords, Chapter 35, Catelyn IV",
                                            "score": 36,
                                            "author": "smittyDXps32",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Man I lost my dad recently and that last paragraph hits hard. I realized after experiencing it myself that George does a great job of capturing grief",
                                                    "score": 5,
                                                    "author": "GreasiestGuy"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Olympic guy should've shot and walked away without looking like the Blackfish.",
                            "score": 16,
                            "author": "saadakhtar",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "*Rickon Stark disliked that*",
                    "score": 43,
                    "author": "TameVegan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Who?",
                            "score": 14,
                            "author": "saadakhtar",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He shoulda zigged or zagged",
                                    "score": 38,
                                    "author": "participationmedals",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "SERPENTINE RICKON.",
                                            "score": 7,
                                            "author": "scrumblejumbles",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Guy running late to the stadium gets impaled by arrow in the car park.",
            "score": 242,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Fucking Mondays.",
                    "score": 37,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "A whole new take on “Friendly Fire”\n\nI’ll see myself out.",
                    "score": 9,
                    "author": "swiftfastjudgement"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Barcelona 92!",
            "score": 70,
            "author": "surienc",
            "replies": [
                {
                    "level": 1,
                    "comment": "To this day, any time I hear mention of Barcelona, Freddie Mercury's epic voice sings it in my head",
                    "score": 10,
                    "author": "Nimmyzed",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Too bad for dude standing in the car park outside who got a flaming arrow in the belly.",
            "score": 730,
            "author": "kleptophobiac",
            "replies": [
                {
                    "level": 1,
                    "comment": "Message for you, sir",
                    "score": 263,
                    "author": "thylocene06",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lmao that's my dad's ringtone for when he gets texts (text-tone?) and it gets me every time",
                            "score": 35,
                            "author": "Mr_EkShun",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Legit used it as my AOL \"you got mail\" sound in the 90s",
                                    "score": 13,
                                    "author": "WhiteZero",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "r/unexpectedmontypython",
                            "score": 56,
                            "author": "Deraj2004"
                        },
                        {
                            "level": 2,
                            "comment": "Concorde! Concorde, speak to me!",
                            "score": 8,
                            "author": "AlexTheGiant",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I used to be an Olympian until I took a flaming arrow to the knee.",
                    "score": 55,
                    "author": "Dunkleostrich",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's a meme I haven't seen in many moons",
                            "score": 9,
                            "author": "that1prince"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "At least it cauterized right away. Although the crime would go unsolved. \"Hey look a dead guy\" *investigator sees the arrow* \"lets go that way\"",
                    "score": 95,
                    "author": "Cranky_Windlass",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's a Mitch Hedberg joke.",
                            "score": 30,
                            "author": "mandalore237",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Rice is great when you’re hungry and want 2,000 of something.",
                                    "score": 31,
                                    "author": "jimtrickington",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah but what happened to the Dufresnes? Who can eat at a time like this?",
                                            "score": 9,
                                            "author": "patsyst0ne",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Bush, search party of three. You can eat once you find the Dufresnes.",
                                                    "score": 9,
                                                    "author": "SinopicCynic",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I vaguely remember seeing this from another angle and it looked like a bigger miss.  \n\nAlso weird that the flame lit from the bottom up, you would expect it to light top down.",
            "score": 631,
            "author": "redunculuspanda",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s just for show. Pretty much every lighting if you look closely you can tell it’s being lit from inside the cauldron rather than the torch",
                    "score": 678,
                    "author": "thylocene06",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Movie magic made for live TV.",
                            "score": 151,
                            "author": "Kalki271",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Do you remember that 90s Discovery channel show called Movie Magic? It got my brother and me really into special effects.",
                                    "score": 30,
                                    "author": "LaChuteQuiMarche"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "If you've ever lit a gas grill when the starter takes too long or you have trouble lighting a match, you know they're not just running full bore gas in a giant invisible cloud waiting for some poor sack to get close enough to ignite it.",
                            "score": 60,
                            "author": "rickane58",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Exactly, they wouldn't risk blowing up the tower like that. People really think he's lighting it like a lighter over a stove",
                                    "score": 27,
                                    "author": "boardingschmordin",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah he went high over it and the cauldron lit remotely - from the one angle it was awesome but the angle I saw was clearly set up, not that it mattered. It's all a show.",
                    "score": 80,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sure, it's all impressive when *he* does it, but when *I* do that I'm just, \"too drunk to shop at Dick's Sporting Goods \"",
            "score": 955,
            "author": "SchrodingersNutsack",
            "replies": [
                {
                    "level": 1,
                    "comment": "“Outdoor World”  will welcome you with open arms.\n\n*Source*-am a drunk",
                    "score": 107,
                    "author": "JHighDa03"
                },
                {
                    "level": 1,
                    "comment": "2/10 store, they dont let you and your buddies play hockey in the aisle with a baseball for a puck.",
                    "score": 18,
                    "author": "rayEW",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "One of few times I remember the lighting of it. It was pretty cool.",
            "score": 132,
            "author": "dshults77",
            "replies": [
                {
                    "level": 1,
                    "comment": "It was sweet and extremely memorable",
                    "score": 13,
                    "author": "Porkyrogue",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just glad this guy is more Bryden Blackfish than Edmure Tully.",
            "score": 60,
            "author": "rluke09",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I remember watching this live, everyone was talking about it.",
            "score": 16,
            "author": "OH_Krill",
            "replies": []
        },
        {
            "level": 0,
            "comment": "First in a string of really good lightings.\n\nAn archer firing a flaming arrow (I personally never realized he was a paralympian - it was just cool).\n\nMuhammad Ali being showed one of the highest Olympic honours after having been disrespected so hard years (a whole career) earlier.\n\nCathy Freeman being the symbol of the Olympics after all the bullshit aboriginals had had to endure ever since the Europeans landed.\n\nThe only other lighting I remember is in Rio, which I also thought was a cool nod to one of the most scandalous \"lost\" gold medals (Vanderlei de Lima).",
            "score": 76,
            "author": "friskfyr32",
            "replies": [
                {
                    "level": 1,
                    "comment": "Don't forget Bobby Hill relighting the torch with Dale's cigarette he lit off the torch.",
                    "score": 30,
                    "author": "Wild_Doogy_Plumm",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Iirc it was a cigarette lit with a cigarette lit with a cigarette that was lit by the torch",
                            "score": 7,
                            "author": "Mrchristopherrr"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Best olímpic games ever, so far",
            "score": 29,
            "author": "GeorgeLZ4",
            "replies": [
                {
                    "level": 1,
                    "comment": "I can still hear Freddy and Montserrat singing over this, and the crowds loudly cheering **HOLA** to the world.\n\n\nBarcelona '92 was peak modern Olympics (at least in the *showtime* department) imho; no future event was able to conjure the same amount of magic and spectacle for the public.",
                    "score": 10,
                    "author": "DenverCoderIX"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Before I clicked, I said to myself \"this better be the arrow shot\"",
            "score": 68,
            "author": "Hazelwood38",
            "replies": []
        },
        {
            "level": 0,
            "comment": "In the dark!!",
            "score": 48,
            "author": "BethJ2018",
            "replies": []
        },
        {
            "level": 0,
            "comment": "In case you still don’t know how it happened here you go.\r  \n\r  \nHe was never meant to light it by sending the arrow inside the torch. He rehearsed it so that it would pass over. The torch had gas that was supposed to ignite with the flaming arrow passing by, but in case he missed the organizers had an automatic ignition button prepared so that it would go in flames anyways. They never hid the fact that this was rehearsed to look like he had lighten the torch with the arrow. They did several documentaries and interviews about it. You are not discovering anything guys. \r  \n\r  \nYou have to understand this arrow had to go over thousands of people, over the torch and out the stadium, that in and off itself is insane. He rehearsed it over 700 times and only missed twice. He had to send it over and out and that is exactly what he did. On top of that he was a Paralympic athlete, which makes it even more impressive.",
            "score": 26,
            "author": "thegreaterikku"
        },
        {
            "level": 0,
            "comment": "The only way to top this would be for a bomber jet to precisely drop a single firebomb into the cauldron",
            "score": 72,
            "author": "Azair_Blaidd",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nothing screams Olympic ideals like napalm.",
                    "score": 118,
                    "author": "whooo_me",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And fighter jets",
                            "score": 15,
                            "author": "l0c0pez",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I love the smell of Olympics in the morning",
                            "score": 9,
                            "author": "duckinfum",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "'Murica",
                            "score": 19,
                            "author": "Wootbeers"
                        },
                        {
                            "level": 2,
                            "comment": "Smells like....    Victory!",
                            "score": 5,
                            "author": "not_another_drummer"
                        },
                        {
                            "level": 2,
                            "comment": "&gt;Nothing screams Olympic ideals like napalm.\n\nKilling a large part of the audience by accidentally dropping napalm too early from a jet fighter sounds more like a gender reveal party kind of thing.",
                            "score": 25,
                            "author": "I_Pork_Saucy_Ladies",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "To be honest this seems exactly the kind of stunt the USA would do",
                    "score": 38,
                    "author": "Yrouel86",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "We’ll have our chance LA 2024.\n\nEdit: 2028!",
                            "score": 20,
                            "author": "Bot8556",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "2028",
                                    "score": 11,
                                    "author": "moose098"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": " lighting it with the after burner would be dope",
                    "score": 6,
                    "author": "wastingtoomuchthyme",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Where did the arrow land, though? Did a neighborhood burn down? Did they have to disperse a burning crowd? Is there now a chicken on fire?",
            "score": 18,
            "author": "EVnegative",
            "replies": [
                {
                    "level": 1,
                    "comment": "An area behind the stadium was blocked, the arrow landed safely on the road, they immediately picked it up.",
                    "score": 36,
                    "author": "BattalionSkimmer",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Me hitting the end crystals to defeat the enderdragon",
            "score": 19,
            "author": "Immanuelcun1"
        }
    ]
}