{
    "id": "pm5vic",
    "score": 142012,
    "title": "The moment George Bush learned 9/11 happened while reading at an elementary school.",
    "author": "mohammedibnakar",
    "date": 1631360230.0,
    "url": "https://www.reddit.com/r/interestingasfuck/comments/pm5vic",
    "media_urls": [
        "https://i.redd.it/0kektdpv1vm71.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\n**Please note:**\n\n* If this post declares something as a fact proof is required.\n* The title must be descriptive\n* No text is allowed on images\n* Common/recent reposts are not allowed\n\n*See [this post](https://redd.it/ij26vk) for more information.*\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/interestingasfuck) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "The moment I understood the severity of 9/11 at the age of 9 was when I got home from school early and every TV channel was playing the news reels over and over. No cartoons?",
            "score": 413,
            "author": "kylefofyle",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ah, the innocence. I feel sorry for the children that had to grow up a bit quicker that day.",
                    "score": 126,
                    "author": "Plenty_Act_5664"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 894,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I lived near a nuclear power plant when this happened and we all thought for sure someone was going to attack it. It was a pretty terrifying time. I’m glad your dad was okay.",
                    "score": 186,
                    "author": "IcanSew831",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I remember walking into history class and asking my teacher (who had the TV on for the first time that year) if it was an accident…. Then seeing the second plane hit a couple of minutes later.\n\nI was 17 and a Junior in high school.",
            "score": 4685,
            "author": "caitycc",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was in history too. Someone popped in and said he needed to come to the teachers lounge now and ran off. A single minute later he was back in the room turning on the news coverage. \n\nEven before the second plane, he knew we would be witnessing major American history that day. He made sure we all knew the significance of the second plane hitting as it happened right in front of our eyes. He told us that America would likely be at war for the foreseeable future. as the morning went on we just kept seeing more and more attacks, and sure enough, we haven't seen a year of peace since...",
                    "score": 2222,
                    "author": "moderndudeingeneral",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The worst thing about “this is war” is the guys who killed everyone else killed themselves too. You can’t fight something like that.  You’re trying to destroy an ideology, not the perps with bombs.",
                            "score": 1217,
                            "author": "logicalnegation",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I said that both times I came home from Afghanistan when people would ask me. Hey are we going to win this or what??? My response was always \" You can't kill an idea.\" This is not something you \"win\".  You can kill as many people as you want but this enemy isn't something that's really tangible. The Taliban, ISIS whatever. They are ideologies. Shit we wiped the floor with Germany in WW2 and there is still NAZI's today. We never went into Afghanistan to flatten the country at all. We tried the hearts and minds thing (mostly). Could we have \"won\". Sure but you have to make sure you understand the definition of what you consider \"winning\" is.  We absolutely could have murdered basically the entire population and enslaved who ever we didn't. Would have made us terrible human beings and 10x worse than the enemy we went to fight in the first place but we certainly had the technology/weapons and man power to do it.  War today is complex. Way more so than 1939 to 1945. Back then there was a clearly defined good vs evil with clearly defined goals.  Sorry didn't meant to write a wall of info here but i seen your post and its so rare and refreshing to find someone who understands.",
                                    "score": 1081,
                                    "author": "MRChuckNorris",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Does literally every classroom in the states have a tv in it if something like this happened in the UK back then they'd have to probably gather us all in the school hall and wheel in the one tiny school TV",
                    "score": 252,
                    "author": "cpndavvers",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No, not all schools had TVs in the states. My classes were about 50/50. So I spent like half my day watching live coverage with classmates, and the other half of the day discussing it as a class with the teachers that didn’t have TVs. Ironically, my history teacher was one of the rooms without a TV.",
                            "score": 106,
                            "author": "pipcafe"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wasn’t this when the second plane hit?  I think he knew the first one hit, when we all thought “maybe this was an accident.”",
            "score": 14403,
            "author": "mtxsound",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah right before they started the session with the kids the news was a propeller plane accidentally went into the tower. This picture is taken when he heard “a second plane hit the south tower, the USA is under attack”",
                    "score": 3486,
                    "author": "Aggressive-Counter52",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah it was a fast moving morning.  Then that afternoon, everything slowed down for a few days.",
                            "score": 1505,
                            "author": "mtxsound",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Wow yes you perfectly described how it felt to me. Time moved quickly at first, then slowed to a crawl as I watched everything unfold on television. \nI was 20, in Atlanta, and I'll never ever forget walking in from a grocery trip and hearing my mom crying on my answering machine. The second plane had hit and it was such an odd, eerie feeling. I sat down and turned on my TV, don't think I turned it off for days. It's such a vivid memory, even now.\n\nEdited for clarity",
                                    "score": 739,
                                    "author": "MisfitHeather138",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "And the 24 hour news cycle was born.",
                                            "score": 476,
                                            "author": "lightoasis1",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Absolutely. I remember flipping back and forth between channels-and for some reason Shepherd Smith sticks out in my mind because by day 2 he had these deep, dark circles under his eyes. He looked like a zombie, I'll never forget that. But yes 100% this birthed the 24hr news cycle",
                                                    "score": 302,
                                                    "author": "MisfitHeather138",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I don't want to blame everything on 9/11 but it certainly didn't help. Ever since the 24-hour news cycle came about, things have gotten progressively worse politically. Or maybe I'm just not a teenager anymore.",
                                                            "score": 241,
                                                            "author": "lightoasis1",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Little of column A, little of column B",
                                                                    "score": 117,
                                                                    "author": "BurnerJerkzog"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Ah, some people aren’t old enough to remember baby Jessica down in the well is what birthed the 24hr news cycle some 14 years before.\n\nedit: some may say it began 7 years after baby Jessica with the OJ Simpson murder trial in “94",
                                                            "score": 30,
                                                            "author": "bigpurplebang",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Headline News was already running 24 hour news for years before 9/11",
                                                    "score": 17,
                                                    "author": "syn_ack_"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Correct - this was when he was told a second plane had hit the second tower and America was under attack",
                    "score": 7279,
                    "author": "ButWeNeverSawHisWife",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I remember hearing the live broadcast on radio when the first tower was hit. I was in my car running an errand for work. They were speculating on the radio that a propeller plane, like a Cessna, hit the first tower.\n\nI remember going in my office and we were all laughing light-heartedly over the impossibility of a pilot not seeing the tower, and we assumed there was fog.\n\nThe light-hearted attitude didn't last long.",
                            "score": 5836,
                            "author": "absolutelynotagoblin",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This memory just hit me so clearly....\n\nI remember sitting in my Freshman Geography class, and the teacher from next door, opened our classroom door abruptly. She said so seriously... \"Turn on the News.\" We all stopped talking immediately, our teacher stood  up at his desk, and fumble the remote for a second, like it was an alien in his hand. We turned to the TV, first channel it's already on is live reporting... There's the first tower with smoke. The girl three chairs behind me starts crying, and proceeds to start having a panic attack. She just moved to here (The South) from New York. The teacher from next door beckons her, and they leave for what I now assume was the counselors office. I turn back the tv, and no one knows what's really happening. The news is chaotic, everyone is whispering among themselves, and everyone is trying to watch the news, listen, and talk all at once. Then it happens...\n\nWe all sit there in school, and watch on live television, and the second plane crashes into the other tower. We all go silent, we don't know what just happened... We do, but we don't really. I feel like all of us went through the rest of that day like ghosts. Kids were being pulled from school left and right. It was the longest, quietest, day in high school, I ever remember.\n\nEdit: Thank you ALL for sharing your memories as well... It's been surreal to read through so many people feeling the exact same as myself. It's hard to remember sometimes, we were all there, we ALL experienced this together.  It's almost an eerie feeling. Also, thank you stranger for my award.",
                                    "score": 3463,
                                    "author": "Umbr33on",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I was a Junior in HS, so close in age to you.  Before the bell rang for class to begin, I was in my coaches classroom across the hall from my English class.  I was getting a book cover because we had to wrap our textbooks with one.  He had the TV on and I remember seeing the tower with smoke coming from it.  They said a plane had hit it.  I was thinking like a kitty Cessna prop plane or something.  \n\nA few minutes later as we were in class my teacher put on the news.  We saw the second one hit, and it was surreal.  It was clear it was an attack.  My friend who was in class with me didn’t know it at the time, but his uncle was one of the firemen who was in the building when it collapsed.  We (he) literally watched the death of his uncle on live television.  It was a horrible day.",
                                            "score": 1281,
                                            "author": "InsidiousExpert",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That second plane is seared into my memory. I was a middle schooler, home schooled, my mom and I were just about to start the school day when a neighbor called and told us to turn on the news.\n\nWe tuned in just in time to see the second strike.  It didn’t feel real. Like you we were thinking the first plane was some little puddle jumper cesna. To see this massive jumbo jet ram a building like a ballistic missile, it just didn’t feel real.  My mom burst into tears, I just sat there in stunned silence, just trying to process what I’d just seen.",
                                                    "score": 564,
                                                    "author": "The5Virtues",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I was 6, almost 7 I was sure to remind everyone, they sent us home early and I caught it on the tv and asked my mom what she was watching and she just said \"a war\". \n\nI assumed it was an old war documentary but I remember thinking that was weird because only dad watched those.",
                                                            "score": 372,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Yeah I was about 6 or 7 too I remember my dad pulling me from school and telling me “we’re under attack”. I live right next to Hanscom AFB in MA too and I’ll never forget the sounds of 5-6 jets flying over my house so loud that I thought they were literally gonna crash into it. Crazy times man.",
                                                                    "score": 163,
                                                                    "author": "JapanTheMan",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Yeah that happened here too. About 20 or so minutes after the second plane hit my mom and I heard this deafening roar that shook the entire house.\n\nTurned out it was the first of many pairs of F-18s scrambled to patrol the skies overhead.  We lived in Dallas at the time and there was big concern that any other major city could be next, so the local airbase had fighters patrolling the sky afterward. They flew so low ( I assume to avoid showing up on potential enemy radar) that every time they passed by the house would tremble. They moved so fast that the tremble would come first and we’d hear the roar of the engines as a sort of aftershock to their passing by.",
                                                                            "score": 83,
                                                                            "author": "The5Virtues",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "This was similar to what happened to me, except 4th grade. None of us really understood what had happened. The first tower was hit before school and I just remember my dad crying. The second tower was hit while I was at school and we watched the news for the remainder of the day. I don’t think I really understood what had happened until a few years later while I was watching a documentary in my freshman history class and that included a 5 minute stretch of film from inside the lobby of one of the towers after people had started jumping. You could hear them when they landed, and i don’t know why but I absolutely broke. At that point I was old enough to really empathize and it was the first time I had seen actual footage like that of it. I would have appreciated a little warning from my teacher that this type of content was included. Just awful.",
                                            "score": 557,
                                            "author": "sentientfleshlight",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The lobby scene you're talking about is featured in the new Nat Geo 9/11 doc on Hulu. Man it's a tough watch when the firefighters are just staring at each other listening to bodies crash onto the roof above them.",
                                                    "score": 171,
                                                    "author": "mrtrollmaster",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "The Netflix turning point doc has a ton of graphic content in the first few episodes about this too. Such as people visibly clinging to the side of the towers and jumping and stuff. Really distressing.",
                                                            "score": 98,
                                                            "author": "Smearwashere",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I believe they show one person hit the ground. First time I saw that. Most of the videos shown in the past cut off before that …",
                                                                    "score": 29,
                                                                    "author": "JoshTylerClarke",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "There’s also a great documentary called 9/11.\n\nIt’s about two amateur documentarians deciding to film the life of a firefighter who just started the job. That day they were there and the less experienced cameraman asked to go with the firefighters to a run to check the smell of gas.\n\nHe heard the plane and looked up with the camera to film the first plane hitting.\n\nThe rest of the day he spent with the fire chief in the tower and outside. He said it was pure horror, just the first sight he saw when he entered caused him to break down remembering it.\n\nOne of the firefighters mentioned that when he realized it was bodies hitting the ground he wondered how bad it was up there to jump.",
                                                            "score": 71,
                                                            "author": "Saranightfire1",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "The footage from Jules and Gédéon Naudet, adn their planned documentary concerning NY frefigthers was extrodinary. If you ever get to see their doc \"9/11\" (2002 film) don't miss it",
                                                            "score": 39,
                                                            "author": "CoastMtns",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Really high on the list of things I never want to hear is the sound a desperate person makes hitting the pavement after jumping from a high rise so they don't burn to death. What the fuck was your teacher thinking??",
                                                    "score": 259,
                                                    "author": "Alert-Potato",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I remember that footage, and that sound.\nGod, that sound was awful.",
                                                            "score": 86,
                                                            "author": "Werechupacabra",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I remember the pictures the kids drew that saw it of the \"birds\" diving from the tower...I was in 7th grade History with Mr. Garber for the second plane.  The bus going to school for the first one.",
                                                                    "score": 20,
                                                                    "author": "Cultural-Bug6675309",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "My son was nine at the time and up until then, had always insisted he was going to grow up and be a pilot. After watching the horror of that day he never spoke of that dream again. \nI still remember feeling how life as we knew it was forever changed that day and how sick I was thinking of the people in the towers. \nLater on it was so so eerie when there where no airplanes, only fighter jets and military helicopters in the sky.",
                                                                            "score": 23,
                                                                            "author": "Millyswolf",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Similar memories here. I was in fourth grade at the time. We were in gym class and the tescher had a radio on playing music from a station, when suddenly the music stopped and the radio host started talking about what happened with the first tower. We finished up gym class and went to our classroom and the teacher had the tv out, and we had the news turned on. I still remember watching the first tower collapse, and hearing one of my classmates ask the teacher if everyone got out okay.",
                                            "score": 118,
                                            "author": "-Kemphler-",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Almost same exact story for me. I was a freshman in high school sitting in Literature. We thought we were watching scenes from a movie. It was very surreal. Like no one knew how to react to this. The silence in the school was brutal.",
                                            "score": 145,
                                            "author": "Fluid_Contract_9700",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "This. Like the more I think about it, all I really remember thinking that day was how loud the bells were.",
                                                    "score": 67,
                                                    "author": "Umbr33on",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "They used to play an oldies radio station between classes. No music was played for a while (months) after. Indeed, the bells were deafening.",
                                                            "score": 47,
                                                            "author": "Fluid_Contract_9700",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "IIRC wasn’t there some stunt earlier in NY with someone attempting to parachute on to the Statue of Liberty from a small plane, which just added to the speculation that the first tower hit was probably a small prop plane?",
                                    "score": 80,
                                    "author": "juan-de-fuca",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "I was in fourth grade and my brother was in first grade. We were home for lunch and mom and I had the radio on. They were talking about the first plane and my mom said “oh, it sounds like a plane went down in the states” (we are in Nova Scotia). I left to go watch TV with my brother and as I walked out, the phone rang and it was my dad telling my mom to go get the kids away from the TV because something was very wrong. She came into the TV room just as the second plane hit and the three of us just stood there completely shocked at what we had just seen. What gets me emotional every anniversary is remembering my brother, who would have been 6 or 7 look at my mom and go “mummy were there people in that plane?” And then my poor mum, who was just as confused as us, had to sit down and explain to us that some people are horrible as we all watched the towers crumble.",
                                    "score": 123,
                                    "author": "mileysmustache",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "The Today Show initially reported it as a Cessna as well. My mother called me at work to tell me, knowing we had clients in the towers.",
                                    "score": 42,
                                    "author": "Suedeegz",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "I have a similar story about the Utøya attacks in Norway. Reading there had been a large bomb in Oslo I yelled to my brother that there's been a terrorist attack in Norway, he replied with a typical teenage \"Who cares?\"\n\nAs more became known about that day we all became shocked, and we haven't mentioned it since.",
                                    "score": 77,
                                    "author": "NewAccountEachYear",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "It's been 20 years since we had a light-hearted attitude.",
                                    "score": 74,
                                    "author": "AllAfterIncinerators",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I remember feeing like he was totally inept at dealing with it when I first saw the video of this moment years ago and seeing him just sit there for a minute. \nI re watched it last night 15-20 years later and can clearly see the agony on his face. The magnitude of that moment simply required a moment to process. Working through what to do as the leader of the free world is simply unfathomable",
                            "score": 87,
                            "author": "Peach_Mediocre",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I understand your sentiment here. I used to think \"what a dummy\" at his initial reaction. Years of living life has helped me realize that his reaction in that moment was completely understandable.",
                                    "score": 37,
                                    "author": "copper_rainbows",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "is the precise language used somehow on record? I'd love to know exactly what the other guy said in that moment.",
                            "score": 50,
                            "author": "ElectricFlesh",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I believe the exact language used was “a second plane hit the second tower. America is under attack” \n\nThis was shortly after Bush learned of the first plane right before he walked into the classroom. He was informed that a plane had hit the first tower, but at the time they just assumed that it was a pilot that had gotten lost, and not the beginning of the worst attack to ever happen on US soil.",
                                    "score": 123,
                                    "author": "adamsflys",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Also the Empire State Building was hit before by a plane because they did get lost and couldn’t avoid it.",
                                            "score": 48,
                                            "author": "Longbongos",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "https://en.wikipedia.org/wiki/1945_Empire_State_Building_B-25_crash",
                                                    "score": 21,
                                                    "author": "GitEmSteveDave",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "It’s pretty close to what I wrote - there was a good doco released recently on Apple TV+ called 9/11 inside the presidents war room, which basically goes through Bush’s day from start to finish and has good interviews with Bush and all that were close to him that day",
                                    "score": 52,
                                    "author": "ButWeNeverSawHisWife",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Say what you will about the guy but I can't imagine any human being at that time being fully prepared for that... Unbelievable",
                            "score": 246,
                            "author": "__jh96",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 162,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It changed the world and will forever have an effect on how things work.",
                                            "score": 44,
                                            "author": "RestartingMyLife0918",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Correct. First once’s a shitty accident. Second ones an act of war.",
                    "score": 215,
                    "author": "Pooshonmyhazeer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "“The first one was likely an accident, the second one was an attack, and the third plane [the one that hit the Pentagon] was a declaration of war” - George W Bush in an interview with NatGeo ten years later",
                            "score": 267,
                            "author": "MagicJoshByGosh",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not saying I tried to rip that because I’ve probably watched it before but yessir!! Good call",
                                    "score": 48,
                                    "author": "Pooshonmyhazeer"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "And interestingly that’s where a lot of the audio on conspiracy theory videos come from. The conspiracy makes it seem like people heard “second explosion” because of a bomb or controlled explosion, but they were talking about the second plane.",
                    "score": 57,
                    "author": "2AlephNullAndBeyond",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;On September 11, 2001, [White House Chief of Staff Andy] Card approached [then President] Bush as he was visiting Emma E. Booker Elementary School in Sarasota, Florida, and whispered in his ear the news that a second plane had hit the World Trade Center, confirming that a terrorist attack was underway. Card later recounted his story, saying that he whispered \"A second plane hit the second tower. America is under attack.\"\n\nSource: Wikipedia",
            "score": 14250,
            "author": "TimoniumTown",
            "replies": [
                {
                    "level": 1,
                    "comment": "Its a trip there are people on here that were not even alive for it. Im old.\n\nWoah. I forgot i even posted this",
                    "score": 7028,
                    "author": "Stillalivedoe",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "On PBS NewsHour last night, they shared the stat that 1 in 4 Americans today were not alive on 9/11. Ooof.",
                            "score": 3844,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Makes sense. Everyone who is younger than 20 wasn't alive then. \n\nThe people under 20 making up one fourth of the population makes perfect sense. I'm surprised the number isn't higher, to be honest.\n\nEdit: changed \"20 or younger\" to \"younger than 20\"",
                                    "score": 1631,
                                    "author": "modern_milkman",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Nah I'm 20 and was chewing my fingers in a crib when it happend but I was still alive for it!",
                                            "score": 624,
                                            "author": "B00thTrush",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I imagine you messed your pants that day too! We all did in a way.x",
                                                    "score": 90,
                                                    "author": "Tracirainbow69"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "True. I messed up that part. I fixed it in the comment.",
                                                    "score": 120,
                                                    "author": "modern_milkman",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Thank you for your service!",
                                                    "score": 245,
                                                    "author": "CowardlyDodge",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I was in Home Depot the other day at self checkout. I had to hit the button for help because one of the items wouldn’t scan. When the nice young guy came over (with gauges in his ears and some pretty rockin’ and substantial sideburns) to help I couldn’t help by notice him punch in his employee code. It was 2-0-0-2.     \n          \n“Hmmm,” I thought, “2002. I wonder what happened in 2002 that was so special for him to make that year his code? Let’s see…That was the year I got my license and my sweet 1965 Ford Galaxy in flawless pearl white. And also (and maybe not by coincidence) my first girlfriend in high school. Maybe it was something like that…”      \n       \nThen I looked closer at his face and saw how there wasn’t a single wrinkle and his eyes still had the clear brightness of youth. “Oh god. That’s his *birth-year* isn’t it?” And I knew with certainty that it was. And I paid and took my receipt from the machine and said thank you and tried to remember what it was like to be nineteen on my way out the door and it felt like another lifetime.",
                                                            "score": 60,
                                                            "author": "ItalicsWhore",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Millenials wait longer to have kids and have fewer kids than gen x.",
                                            "score": 111,
                                            "author": "jesse_winkers_neck",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I met the guy who claimed to take this photo at a college thing. He was doing a presentation it was really well done.\n\nEdit: I find it a little odd that this is the comment that got me the most upvotes in my 5 years on Reddit, but this gave me a good pick me up!",
            "score": 4330,
            "author": "Grimowl",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think the photographer is Paul Richards. But there are couple of different shots of this same moment from different photographers",
                    "score": 1401,
                    "author": "MoreGaghPlease",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It really captures the feeling a lot of people experienced that day. Horror and shock",
                            "score": 283,
                            "author": "sunscreenkween",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[Here is the video](https://m.youtube.com/watch?v=5WztB6HzXxI)\n\nEdit: I was just providing info",
                    "score": 405,
                    "author": "daddakamabb1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Omg. The comments on that video are beyond crazy.\n\nI just can’t resolve myself to the fact that the same people commenting that it was a satanic ritual and those kids’ chanting was necessary to carry it out are also licensed to drive.",
                            "score": 70,
                            "author": "AlaskaSnowJade",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "He later explained this moment and his actions that he was processing what he'd just been told and didn't want to cause a panic or chaos with the media by just getting up and leaving.",
                            "score": 187,
                            "author": "dainternets",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I get why so many people dislike Bush, but I clearly understand his choice. He wished not to cause panic with the kids by leaving so abruptly, and I can respect that choice.\n\nBesides , even as a President, imagine having a rather chipper morning reading a children's book to a classroom and then getting the news that the country is under a massive terrorist attack. How in the fuck is anybody gonna act except to be as stoic and calm as possible. You really cannot show a lapse in emotions during such an event. You have to be stoic as possible and show calmness even when nobody else is.",
                                    "score": 123,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I remember when 9/11 happened, I was in third grade and the teachers brought everyone to the auditorium and told us what happened. My first thought was “it’ll be ok, the police would catch the bad guys” then I went back to my class and kept coloring. \n\nI had no idea the severity of the situation.",
            "score": 3801,
            "author": "I_am_dean",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was in 3rd grade as well. I remember thinking that a plane crash was bad, but that it probably crashed in a field somewhere and I didn’t understand why it was such major news. Then had to watch news footage on repeat once they sent us home from school. And I just wanted my folks to turn it off so I could watch cartoons. I had no concept of how serious it all was.",
                    "score": 127,
                    "author": "geckosquaredance",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Same with 3rd grade. I honestly don't remember a lot about that day. The main thing I remember is my teacher in a panic and watching her run out of the room after being told something. As far as I recall, she didn't turn on the tv. Probably because we were a bunch of 8 year olds.",
                            "score": 32,
                            "author": "FrostWhyte"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Ahhh, the beauty of being an innocent child:(",
                    "score": 1141,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I remember when my mom told me what happened I asked why they didn't arrest the bad guys when they parachuted out of the planes. I didn't understand what she meant when she said they didn't jump out before it hit.",
                            "score": 311,
                            "author": "CloserToDog",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Damn, I think you just unlocked a memory for me. I vaguely remember thinking they would’ve escaped via parachute too, but I don’t think I’ve thought of it since. I was in the third grade.",
                                    "score": 73,
                                    "author": "whitemamba83"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Not 9/11 but I just remembered this and it's pretty relevant:\n\nWhen I first got told what the Holocaust and concentration camps were it took me an awfull lot of time to realize that it wasn't \"just like summer camp\".",
                            "score": 13,
                            "author": "funkaria"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I was in 3rd grade too. We got sent home and I lived in a smaller town all the way down in Texas.",
                    "score": 159,
                    "author": "BilllisCool",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was in south Louisiana, they didn’t send us home but I remember my mom coming to pick me up early.",
                            "score": 71,
                            "author": "I_am_dean",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "We were sent home in Canada, or at least in my province. I was way young but I think the adults were on edge with all the other planes being diverted here.",
                            "score": 32,
                            "author": "deinoswyrd",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It was at this moment President Bush found out, the plane crash was in fact, not an accident. \n\nBefore entering the classroom, Bush was quickly briefed by Rear Admiral Deborah Loewer (acting security advisor), “Sir, it appears a small twin engine prop plane has crashed into one of towers of the trade center in New York”.\n\nThe school’s principal, Bush, and WH Chief of Staff Andrew Card all had the same reaction, “Oh what a horrible accident, the pilot must’ve had a heart attack or something”.\n\nBush proceeded to enter the classroom and read to the kids. Only a few moments later Andrew Card returned to whisper in Bush’s ear the following words, “A second plane has hit the second tower. America is under attack” —Andrew Card (White House Chief of Staff)\n\nThis is his reaction",
            "score": 1180,
            "author": "Ucranium",
            "replies": []
        },
        {
            "level": 0,
            "comment": "The teacher in that room said he stayed behind physically but she felt the President had left the room mentally",
            "score": 1086,
            "author": "KP3889",
            "replies": [
                {
                    "level": 1,
                    "comment": "You can really see it on his face in all the footage",
                    "score": 313,
                    "author": "PhillyCheesesteakSub"
                },
                {
                    "level": 1,
                    "comment": "He absolutely did. You can see him in videos processing it briefly, then switch into National Defense mode and start calculating.",
                    "score": 126,
                    "author": "itsyaboi_dc"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was in Marine Corps boot camp in Parris Island, SC.  We were in a squad bay cleaning our rifles when our drill instructors asked all the recruits who had family members who worked at the Pentagon and the Twin Towers.  Graduation a month later was a surreal experience.",
            "score": 67,
            "author": "corgimidgets",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Today is actually my birthday.\nYeah I know worst birthday ever. But when I was born apparently my mom saw the attacks one the news and said “turn off this movie, I don’t like it” and my dad said “this isn’t a movie. This is the news”",
            "score": 8295,
            "author": "matojo91101",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's not the worst birthday ever. Edit: today is my son's birthday too, so I have bias here ;)\n\nAlso, thanks for sharing. I remember being in grade 5, in Canada, and hearing over the PA that america was under attack. I remember being confused, and scared.",
                    "score": 1974,
                    "author": "slothyCheetah",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "When you think about it, when is the worst birthday ever that everyone can agree?  \nI'd say it's December 24-25 as you either receive a birthday present or Santa's",
                            "score": 616,
                            "author": "Jankufood",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Also, February 29.",
                                    "score": 289,
                                    "author": "danielredmayne",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah, my arts teacher is apparently 10.",
                                            "score": 205,
                                            "author": "icantfindausername_3",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "My best buds GF has that birthday and I'm surprised I haven't been murdered yet with how often I've made the joke that he's dating a minor. (we're in our 30s..)",
                                                    "score": 73,
                                                    "author": "Shloppins",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Yup. I’m friends with a set of twins that were born on Feb 29 in 1988. In non-leap years, one of them celebrates on the 28th of February, and the other on March 1st. In regular leap years, there’s a joint party for both.",
                                            "score": 42,
                                            "author": "Nuisance21",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I've met 3 people with that birthday, all 3 love it.  It's incredibly unique.  I'm sure some don't like it, but you can't please everyone.",
                                            "score": 70,
                                            "author": "IAmTheFatman666",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Wow, thats a shit way to let people know :/",
                            "score": 78,
                            "author": "Forkant",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Kind of a hilarious mental image though. \"In this morning's announcements we are having pizza for lunch, Ashley Thomas has won student of the month, and the United States of America is under attack by terrorists. Thousands are presumed dead but let's not let that spoil the fact that Friday is skate night. Have a great day, kids.\"",
                                    "score": 69,
                                    "author": "Energy_Turtle",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I remember the morning of 9/11 in high school, it was my friend’s 18th birthday. She was so excited before school that morning. I barely remember her, but I always think of her today (among all the other things). What a thing to have emblazoned in your memory for life and have to feel on your birthday.",
                    "score": 198,
                    "author": "LadyChiTown",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Happy birthday, hope you get some cake or something",
                    "score": 59,
                    "author": "Extension_Buffalo782",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Happy birthday ❤️",
                    "score": 103,
                    "author": "I_am_freddie_mercury",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "“Sir, 9/11 just happened”\n\n“What?”",
            "score": 4990,
            "author": "Detective_Pancake",
            "replies": [
                {
                    "level": 1,
                    "comment": "\"9 out of 11 what?\"",
                    "score": 1099,
                    "author": "TunafishSandworm",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Only 9 out of 11 dentists liked your toothpaste",
                            "score": 397,
                            "author": "fargame",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And the remaining two crashed planes into the towers after tasting it",
                                    "score": 21,
                                    "author": "ahsanashfaq2809"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "“I SAID 9/11 JUST HAPPENED.”",
                    "score": 40,
                    "author": "Pvt_Wierzbowski",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "\"Sir in 15 years they will kill a gorilla in a zoo causing a rift in reality with our timeline going down the worst path\"\n\n\"Wut???\"",
                    "score": 637,
                    "author": "IDespiseFatties",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "\"Protect Harambe at all costs.\"",
                            "score": 171,
                            "author": "TunafishSandworm",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "\"Save the cheer-gorilla, save the world\"",
                                    "score": 20,
                                    "author": "RuggedTracker",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "\"no, it's still midday\"",
                    "score": 227,
                    "author": "thecodingninja12",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Bush did 311",
                    "score": 22,
                    "author": "Itsmethematt",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "„Jimmy for the third time today, no, we can’t get 7/11 right now.“",
                    "score": 89,
                    "author": "oofersIII"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m an Australian, the morning of September 12, Aus time, my mum came into my room to wake me up and tell me “there’s been a disaster in America”",
            "score": 242,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am too. I was 11 and getting ready for school in the family room with my mum. My brother (13 a the time) came out of his room and told her to turn on the news,  that he thought a plane had hit a tower somewhere. I don't remember exactly what she said, but she essentially brushed it off and said it might old footage of a previous disaster. He went back to his room. A few minutes later, he came out of his room again. I'll never forget the look of sadness and fear on his face as he said quietly \"mum...you need to watch\".",
                    "score": 106,
                    "author": "FancyPantsyBanshee"
                }
            ]
        },
        {
            "level": 0,
            "comment": "He was heavily criticized at the time because after this moment he still sat there for a little while, so people were pissed he didn’t get up and leave immediately. I was in a classroom when it happened, 8th grade. I was in this advanced math class and we met an hour before everyone else came to school. Remember a teacher running into the room and rushing to turn on the TV while we were in session. Legitimately just sat there for the first 30sec wondering if this was some movie or something and clearly it wasn’t. That day in school was surreal. We all just grouped up in classrooms and watched the news, didn’t do any work really but we stayed the whole day. Teachers were great though, I remember all of them asking us how we were and if we needed to talk/etc. One of those days you won’t forget where you were at.",
            "score": 1150,
            "author": "james_randolph",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same but I was in 9th grade. Heck, before the second plane hit, I even joked with some classmates that it must have been ValuJet. We were all pretty glued to the news that day. I kind of understand Bush continuing to read. He probably didn't want to alarm a classroom of elementary school kids.",
                    "score": 438,
                    "author": "JA1987",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I remember that, too. Everybody was scared and angry anybody who didn't act scared and angry was somehow inhuman. He had a fraction of a second to decide if he was going to take immediate action or act calm and not terrify a room full of school children. That decision didn't come out until later.",
                    "score": 238,
                    "author": "centumcellae85",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was in elementary school too. Everybody thought it was joking until parent started picking up their kid",
            "score": 136,
            "author": "Middle_Avocado",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Technically this is the moment he's being told that the second plane hit.  I'm sure this has been said ...but just in case.",
            "score": 330,
            "author": "mikehipp",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah the first one, by a lot, was thought to be an \"accident.\" The second plane was 100% terrorism.",
                    "score": 74,
                    "author": "DC4MVP"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was at work, huddled together watching the news. \n\nI remember the chill that passed through everyone when the Pentagon was hit. At that moment, it felt like anything might happen next. \n\nWe didn’t know how many planes there were, who was doing it, what they were trying to accomplish, or why. We didn’t know if there might be hundreds of planes/missiles or whatever. Since we didn’t know these things, we wondered if our city was safe.\n\nWhen the first tower fell, most of the people around me watching it happen but could not comprehend it. After a few seconds, I blurted out: “Its gone!”.  Two people disagreed, said “no, its just behind the other tower”. \n\nWhen the second tower collapsed, I remember the look of horror on the faces around me. One of them, from New York, walked away, unable to watch anymore.\n\nThe anthrax letters came like a couple of days later. This made me wonder “what is next?”. It was all so unpredictable and confusing.\n\nI remember making contingency plans with family on the 11th and 12th to evacuate the United States. We felt like there would soon be military checkpoints at major intersections, and we wanted to get ahead of that, before road travel became restricted.\n\nA friend who was planning to visit from Canada in a few weeks called to cancel on the 12th or 13th, saying they didn’t want to come if there was going to be a war inside the United States.\n\nThis may sound insane, but keep in mind we didn’t know for the first few days who was doing this, why, or what they may do next.",
            "score": 121,
            "author": "scatter82",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This picture gives me chills",
            "score": 1060,
            "author": "thecbjfan",
            "replies": [
                {
                    "level": 1,
                    "comment": "There’s this great documentary on Apple TV about the day following bush around. Gives great insight into what he was doing and thinking on that day",
                    "score": 250,
                    "author": "SerDire",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That line when they showed this shot, something like \"you're watching a president, in real time, process a major disaster on live tv\" or something like that. Which is true, it's something we've pretty much never seen before.",
                            "score": 163,
                            "author": "mainvolume",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "End of innocence for a lot of us",
                    "score": 151,
                    "author": "rodneyjesus",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The hope and promise that was the 90s ended that day. Timeline diverged.",
                            "score": 146,
                            "author": "greatunknownpub",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And anyone not with us was against us. I remember that all too clearly.",
                                    "score": 35,
                                    "author": "munk_e_man",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You know what’s crazy. I remember him getting a lot of shit for this reaction like it proved how clueless and cold he was. But, now when I see him in this moment I see a guy who is sitting in front of a room filled with young children and he’s been told that essentially people are flying passenger planes into buildings killing people and he’s likely their #1 target.",
                    "score": 622,
                    "author": "ThePopeofHell",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s the look of a man who just had an absolutely enormous amount of responsibility placed on his shoulders, while sitting in front of a classroom full of children. You can almost tell he’s trying to give nothing away, but he’s shook to his core.",
                            "score": 233,
                            "author": "LouSputhole94",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "People forget just how unthinkable this was. Like, just wrapping your head around that commercial airlines were being used as missiles on this scale, took some pause. No one knew how many were still out there, or where they were going. It was and still is just utterly insane of a situation. You can see the realization slowly sink in.",
                            "score": 232,
                            "author": "Schtekarn",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": " Props to the guy (I think it was the FAA administrator) who gave the order to ground every plane. It was his first day on the job I believe. Nothing like that had ever been attempted, and he gave the order and stuck by it.",
                                    "score": 61,
                                    "author": "fatherseamus",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I can't believe Bush was still in elementary school when 911 happened.",
            "score": 16030,
            "author": "Marshal_Bessieres",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s too bad he was interrupted when was just starting to make some progress toward learning to read.",
                    "score": 3264,
                    "author": "DukeOfDouchebury",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "“GO AWAY IM READING SUPER FUDGE”",
                            "score": 982,
                            "author": "Mangy_Karl",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Don’t make me do stuff",
                                    "score": 381,
                                    "author": "violent_e38",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was days from finalizing my daughter’s adoption and a few more from turning 21. \nI was working fast food, customer comes in and mentioned the first plane hit. So we turned the news on, myself and the manager watched the second plane hit. \n\nMy first reaction was “ holy fuck “   It was the most fucked up thing I’d ever seen. It felt like after Oklahoma City but so much worse. Because I knew what it meant, one can be an accident but two is pretty clear. \n\nI still have trouble watching things about 9/11. Then to have one of the happiest days of my life  two days later with my daughter, that week was an unbelievable roller coaster of emotions.\n\nFrom my trip to the Smithsonian a few years ago. https://i.imgur.com/akB6XQC.jpg",
            "score": 29,
            "author": "simplejack2123"
        },
        {
            "level": 0,
            "comment": "I was sitting in the Travis Air Force Base Terminal waiting to get on a Space-A flight to go back to Okinawa to visit my family. I was fresh out of tech school and ready to relax for a bit after the 8 or so months of boot camp and tech school to become a Medical Technician (4N0).\n\nI remember sitting in the waiting area watching the morning news when all this shit happened. They told us to sit tight and they'd get us on flights as soon as they could. After another hour or so I realized I wasn't going anywhere, at least not on leave. \n\nI called my boss and told her my situation, and that I'd probably still be getting on a flight soon to which she replies, \"Oh, your leave is cancelled, get your shit and go back to your room until you hear something from me.\"\n\nNeedless to say I didn't go to Okinawa that day, I actually never got to take leave again for the next 4 years after that, so fuck you Bin Laden and all you fucking terrorist fucks.",
            "score": 190,
            "author": "ZeusOne",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 30,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Nothing like being 7 years old and watching 2000 people die on TV in front of you and realising those are people jumping and then seeing every adult in your life start sobbing and your mother asking why she ever came to this country if it wasn't safe either and worrying about her friends who worked in the Towers back in NYC and your neighbour complaining about dirty Arabs and being scared bc your dad (who looks Arab) is being stopped at airports for \"random security checks\" then you see it announced that there's a war starting and you just sit there, taking it all in and remembering every single moment bc you have a freakish memory, and then being reminded of it and living it year after year after year.\n\nThen you grow up, understand all the nuances, but somehow you're still 7 and its still bizarre.",
            "score": 1396,
            "author": "harlow714",
            "replies": [
                {
                    "level": 1,
                    "comment": "The feeling of being uncomfortable being brown and being too young to understand exactly why",
                    "score": 163,
                    "author": "guitarfluffy",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I remember a lot of ppl criticizing his for his reaction in that moment. Looking back the composure he had to keep calm with a group of children is amazing",
            "score": 1032,
            "author": "Hazelwood38",
            "replies": [
                {
                    "level": 1,
                    "comment": "I always think of my teachers that day. I never knew the magnitude of the situation because every single one of my teachers remained calm, so as to keep their classes calm.",
                    "score": 322,
                    "author": "nessao616",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was in high school. They announced what happened and all the TVs went on in the school. A few hours later the administration is going from classroom to classroom all day long, telling the teachers to turn off the TV and do school stuff. The TV would be turned off and go back on a minute later; one of the teachers said something along the lines of \"when I was a kid we watched TV after JFK was shot. this is your generational moment.\" \n\n&amp;#x200B;\n\nThe really funny thing from school that day was some of the students freaking out, thinking that the terrorists were coming for our high school next. Because after the WTC and Pentagon were attacked, their next target would obviously be a small high school hundreds of miles away. The admin addressed this concern by having our middle-aged morbidly obese janitor/handyman sit on a chair outside of the locked school doors with a baseball bat.",
                            "score": 249,
                            "author": "PeeweesSpiritAnimal",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This is the ONLY funny story I have read about 9/11! Picturing him w a baseball bat and a hat tilted to the right- 😄 can’t imagine what he must have been thinking about though! Wtf is happening to my country!!? I need to quit this job and not deal with these spoiled brats! (Poor scared kiddos!) …..  EVERYTHING else about that day still shocks me to the core! 😔thanks for sharing -",
                                    "score": 33,
                                    "author": "Atifootbal"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Regardless of politics. Look at his face. Imagine for a moment what he might be thinking. To be in the highest executive position in the land and know that you have to do something about this.\n\nThis must have been an intense line of thoughts. \n\nYes yes and I know he wasn't the sharpest knife in the drawer, but the guy was human, and genuinely looks concerned about what this would mean going forward.",
            "score": 5317,
            "author": "UMustB",
            "replies": [
                {
                    "level": 1,
                    "comment": "In the UK, we had a documentary showed this week about the attack from the perspective of Bush and his team, even had him giving an interview throughout. I remember him saying how he had to just stay calm and finish the reading in order to not scare the children. Then they rushed off to a communications room set up in order to find out more. \n\nHe said about how angry and frustrated he was about not being able to return to the Whitehouse straight away, especially as the attacks just became worse throughout the morning. At one point there was a phone call threatening Air Force One although it thankfully turned out to be a hoax.",
                    "score": 1747,
                    "author": "SatansAssociate",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There's a Documentary on Netflix about it as well called Turning Point: 9/11 and the War on Terror, that mentions Air Force One's engines were already running when Bush was ascending the stairs (something that *never* happens) and the plane was already moving before Bush had even sat down.",
                            "score": 231,
                            "author": "ILaughAtFunnyShit",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My daughter said she remembers hearing a loud boom that day (she was only 3). It was the jets flying overhead from WPAFB going supersonic.",
                                    "score": 67,
                                    "author": "Suspicious_Story_464",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I lived near a major traffic lane for approaching and orbiting MSP. There were suddenly just no planes. Then about a week later I was outside with the dog and I heard a single jet for the first time, which immediately caught my attention because it had been so quiet. It was a single F-16 (military fighter) passing over at about 3,000 feet. It was a weird, but very concrete moment that confirmed the feeling that things were different forever now.",
                                            "score": 20,
                                            "author": "IgnoringHisAge",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Do you know what that documentary was called, I’d like to give it a watch",
                            "score": 269,
                            "author": "thetobesgeorge",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "'9/11: Inside the President's War Room'. It was on BBC1 when I watched it, so it's most likely still on the iplayer.",
                                    "score": 432,
                                    "author": "SatansAssociate",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It’s also available to stream on Apple TV+",
                                            "score": 86,
                                            "author": "tricerascott2",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "They also talk about this in the new, multi-part 9/11 documentary on Netflix called Turning Point. Highly recommend.",
                                    "score": 14,
                                    "author": "Mechtroop",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I watched this too, absolutely fascinating insights. Highly recommend",
                            "score": 76,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "its in TV+ now",
                                    "score": 18,
                                    "author": "nmpraveen",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;he wasn’t the sharpest knife in the drawer\n\n[Interesting read](https://keithhennessey.com/2013/04/24/smarter/)",
                    "score": 679,
                    "author": "PanthersChamps",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah this always amazes me. Many people who know bush say he was always the smartest person in the room. That folksy attitude disarms people a little too much I think.",
                            "score": 614,
                            "author": "JalapenoTampon",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think it was because his [Bushisms](https://www.youtube.com/watch?v=JhmdEq3JhoY) which were really just speech impediments for Freudian Slips rather than a display of intelligence.",
                                    "score": 61,
                                    "author": "ILaughAtFunnyShit",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 393,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "\"Hey, it's me Destin. Welcome back to *Smarter Every Day*\"",
                                            "score": 17,
                                            "author": "Raff_Out_Loud",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I won't lie, growing up outside NYC, I definitely had a snobby attitude on southern accents. \n\nNow that I moved for a job in Dallas, that has completely gone away. People are pretty damn smart here.",
                                            "score": 121,
                                            "author": "absolut_on_ice",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I think that look reflects the weight of the world being squarely placed on one's shoulders.",
                    "score": 316,
                    "author": "dickem52",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Indeed. I can’t possibly imagine the thoughts going through his head right now. Worry for the nation, worry for the people of New York, the people at the Pentagon, the people on Flight 93. This was probably the worst news a US President had received since Pearl Harbor. An attack on American soil.",
                            "score": 36,
                            "author": "LouSputhole94",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "https://www.politico.com/magazine/story/2016/09/were-the-only-plane-in-the-sky-214230/\n\nThis is a really good read to show how the president and staff close to him reacted to 9/11, on the day. Everything from the school visit, to being stuck in the Air Force One. It’s about an 1 hour read.",
            "score": 89,
            "author": "ieatdogsfordinner",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I was a 14 yo kid living on Camp Lejeune. And from that point on, getting on that base would never be the same...Crazy",
            "score": 16,
            "author": "SmashAdams837"
        },
        {
            "level": 0,
            "comment": "My dad woke me up and told me to turn on the tv after the first plane hit. Then the second plane hit. I laid in my bed watching. I don’t think I blinked or moved for 4 hours.",
            "score": 17,
            "author": "plaid_cloud"
        },
        {
            "level": 0,
            "comment": "Who remebers “America’s Mayor”?",
            "score": 19,
            "author": "CeepsAhoy",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This event hits close to home. My mother was there when it happened. She saw it, heard it, felt it. My dad had to drive as fast as he could to get her the hell out of New York. All planes were grounded, shit was crazy. I never got to experience it but the videos and the knowledge my mom have given me a new light on everything. I feel like kids (13) at my age take a lot for granted and this experience and the videos I saw changed that. I'm thankful for the safe environment I live in.",
            "score": 78,
            "author": "One_Bar4",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I feel like I remember being really impressed with how he handled it. He finished reading the book to the kids without alarming them and then quietly excused himself. It was the perfect way he could have handled it.",
            "score": 970,
            "author": "stephelan",
            "replies": [
                {
                    "level": 1,
                    "comment": "Whatever he did right after this moment, he was always going to be criticised. I thought he handled it well too, but I think no matter what he ended up doing people would’ve been on his back for it. There’s validity on both sides of course.",
                    "score": 429,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "A lot of reasons to criticize bush, these 10 or so minutes isnt one of them",
                    "score": 207,
                    "author": "Murda6",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "20 years later and I still can't look at the photos. \n\nI was listening to the radio at work when there was a bulletin that a plane hit the first tower. We turned on a tv and saw the 2nd plane hit. My co-workers and I were sobbing.\n\nWhen the plane hit near Pittsburgh, 40 miles from our home, I grabbed my kids out of school and went home. I sat in front of the TV crying all day and into the night.\n\nThe horror of watching people jumping to their death! Can you imagine having to pick your death? Death by burning or death by jumping 90 floors.\n\nCan you imagine being in an airplane with your child, seeing that you are being flown into a building or the Earth?\n\nThe Pentagon was hit. Multiple rumors were flying on the radio that there were car bombs throughout D.C. Other rumors were that bridges had bombs under them.\n\nWe were under attack and our aggressors were unknown at that point.\n\nI did not work the next day but thought it wise to gas up my car. I went to the station and there was a huge line. Some kid was playing \"It's the End of the World\" over and over.",
            "score": 256,
            "author": "tiredoldbitch",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 108,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Same here, same age. My mother explaining why people were jumping from the towers as we watched it happening in real time was the moment my childhood ended.",
                            "score": 37,
                            "author": "dumbsaintofthemind"
                        },
                        {
                            "level": 2,
                            "comment": "Reading comments like this makes me thankful that I never saw any footage until I was an adult. Being in elementary school when it happened, we never discussed it in history class (oh god a moment I was alive for is now a part of history classes) in later years of school. It wasn’t until I went searching for information on my own that I first saw any of the footage. All of it. \n\nGood god I was only seven. I thank heaven for my parents shielding me.",
                            "score": 20,
                            "author": "NerdyNinjaAssassin",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I just read the story of the youngest victim at the time on one of the planes. She was 2 and on her way to Disneyland with her mom and dad. They were supposed to leave the day before on a different flight but the dad had a work conflict and switched it for that morning.",
                    "score": 29,
                    "author": "YANMDM",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "A few on the national guard planes that day were not armed in anyway, and a few pilots were planning to legit ram any planes in the airspace.  As in fly into a plane, killing yourself and many of people",
                    "score": 19,
                    "author": "cannotbefaded"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I remember when we thought he was the most unqualified American president the world would ever see.",
            "score": 3449,
            "author": "quirkyhermit",
            "replies": [
                {
                    "level": 1,
                    "comment": "The original Meme President",
                    "score": 188,
                    "author": "spaceace76",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "And here we are",
                    "score": 773,
                    "author": "cantrunfromthepuns",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Ahhh a simpler time.",
                    "score": 91,
                    "author": "anachronisticflaneur",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Something that always bothered me was at the time so many people were saying how he reacted entirely wrong and unpresidential, except for he's in a school room with kids.  How is he supposed to react, start screaming, scare the hell out of the kids, and yell \"We're all going to die!\"?  Taking time to think and not immediately reacting I thought was entirely reasonable.  With the information he just got, it could mean a great many things.",
            "score": 369,
            "author": "madmaxextra",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 62,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "is everyone okay whats up with the comments?",
            "score": 353,
            "author": "titopai",
            "replies": [
                {
                    "level": 1,
                    "comment": "Welcome to Reddit",
                    "score": 173,
                    "author": "bfischer250"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s so weird looking back on this 20 years later. I was in 7th grade in New Jersey on the shore about 45 minutes away from NYC. A few of my classmates had parents who worked in NYC and one even had a parent who worked in the World Trade Center. \n\nI was in Mr. Ford’s 4 period band class when another teacher Ms Thiel came in to tell Adam his father was ok and made it out. She said it out loud to the class and everyone looked at her confused. She looked to Mr. Ford and simply said “they don’t know?” and he simply shook his head. Ms. Thiel took Adam out into the hallway, there was some quiet conversation among the students some of thought maybe Adam’s dad had surgery…then Adam came back in less than a minute.\n\nClass ended I caught Adam in the hallway. He made it sound like a plane had flown into the World Trade Center but from how he said it - the way I remember in my head - gave me the impression it was like a private jet with a drunk pilot hitting the building.\n\nI had another class then lunch half of which was eating the other half was running around outside. At the time my older brother was fresh out of college and working as a substitute teacher in the middle school. He found me outside and pulled me away from playing with my friends. He told me look at the sky, what do you notice that’s different? I thought this was like a joke or a trick question. He then said “you notice how there’s no planes in the air?”\n\nAnd that’s how I learned about 9/11. My dad was a firefighter and went to ground zero the next day to help. He took pics on a disposable camera when he went so if anyone is interested in seeing those pics let me know and I’ll post them later.\n\n*edit: seems like some people wanted to see the photos, [here you go](https://m.imgur.com/a/ij8x7)",
            "score": 43,
            "author": "rodneymccay67",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Today is my birthday and I turned 18 in 2001. I was in my first year of college, studying graphic design and living on campus. I had reading comprehension class at 9 and wasn’t aware anything had happened until I encountered some commotion while walking across campus. I was passing another residence hall when a (white) dude came out and started pointing at another student (who was likely Indian) and said, “your people bombed our country!” I was stunned in place for a moment, thinking WTF, leave that poor kid alone! I will never forget the look of fear on his face and could just see the blood drain from him as he was as clueless as I was in that moment. I got to class along with other pockets of students out that typical Tuesday, some coming from the dining hall etc. When I got to my class, not many people were there because our teacher was explaining there was a national emergency and turning people away at the door. A few students stood and watched the tv that was mounted on the wall. They had cancelled all classes for that day immediately. I went back to my dorm. The entire country was halted. Flights grounded. Everyone was told to go home and check in with family etc. I got back to my room in time to settle in for the second plane to hit. The entire nation watched that and you could feel us all gasp and hold our breath. I remember going through all kinds of emotions and even laughing at the absurdity of it all. You realize America is the home of Hollywood movies and it seemed like we’d seen this before in a fictional action film. I remember saying that I was just waiting for the Stay Puffed Marshmallow Man to come tromping around the corner next! I glued to the television for the next 5 days at least. For the next several years, my birthday was overshadowed (rightly so) and I got apologies for that being my birthday for a long time. Now days it just makes it hard for people to forget my birthday. I still like my birthday of course and it always turns out to be a beautiful, cooler end of summer day, just like it was in 2001.",
            "score": 46,
            "author": "babyBear83",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This was actually in my hometown (well, my parents decided to move us there shortly before 9/11 happened). I know people who say that they were there, in that classroom, when it happened. My dad remembers getting stuck in massive traffic because of Bush’s limo when trying to drive home.",
            "score": 11,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I remember that day. I was in 4th grade and it was really hot outside. We were told to go inside by our PE teacher, which wasn’t unusual if it was too hot. We then went back to our home room to await early dismissal because of “a plane crash.” It was weird, but we were all excited to go home. Not even a minute later, my brother and I were called to the office to go home. That was super weird and a massive red flag to my brother and I because 1) we rode the bus to school and 2) that meant either my mom, dad or both were picking us up when they were supposed to be at work.\n\nWe got to the office hallway and it was chaos. It seemed like every parent had rushed to the school to get their kids. I saw my dad and he physically grabbed both of us and rushed us home. I remember asking what was happening and he told me to be quiet so he could listen to the news in the car on the way home. He was just as confused as me. My parents both worked in DC and my dad kept calling my mom and telling her to get out of there as fast as possible. Didn’t matter if she came home or went to a friends house nearby. He just wanted her to get away from the Capital and White House. She made it home safely a couple hours later. It was a hard day to process.",
            "score": 13,
            "author": "Sector7B"
        },
        {
            "level": 0,
            "comment": "I’ve heard people say that the look on his face is indicative of the fact that he knew.\n\nTo me, it looks like he absolutely had no clue.  He genuinely looks like he just had his mind blown.",
            "score": 249,
            "author": "InsidiousExpert",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm guessing a million different things are crossing his mind in this moment, shock, pain, disbelief, anger, rage, fear. Probably the full range of negative emotions. This was supposed to be a simple day at a kindergarten. The US in this moment, right here, is now at war. This an immense burden that has dropped upon him in this moment and Bush, while president, is only human after all.",
                    "score": 55,
                    "author": "oak120"
                },
                {
                    "level": 1,
                    "comment": "It looks like he doesn't understand what he's hearing. One of those moments that take a few seconds to process what you just heard.",
                    "score": 136,
                    "author": "ironhide_ivan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Bewilderment.  Disbelief.  Shock.  \n\nAlso, he knows that it meant war.",
                            "score": 78,
                            "author": "InsidiousExpert",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I went to the elementary school about a mile from this one in second grade. I ended up going to middle school with a few of the kids that were in this classroom. The teacher who’s classroom this was, Ms. Daniels(Kay Daniels), ended up being my 6th grade teacher. She was one of the best teachers I ever had.",
            "score": 12,
            "author": "Elegant_Earthworm",
            "replies": []
        }
    ]
}