{
    "id": "124zza4",
    "score": 14,
    "title": "Are tritanomaly and night blindness related?",
    "author": "Cassatrash",
    "date": 1680032831.0,
    "url": "https://www.reddit.com/r/askscience/comments/124zza4",
    "media_urls": [],
    "other_urls": [],
    "postText": "So after taking about like 6 different online color blind tests I figured out that I might have tritanomaly color blindness. While I understand I should probably see an eye specialist for a real diagnosis, I’m having a lot of questions popping up after reading about colorblindness. As long as I can remember I’ve just had this weird thing with some shades of blue where it just blurs everything around it. I never really thought much of it or even that I could be colorblind until recently. I know for sure that I am pretty severely night blind and so is my mother and I’m wondering if the two (night blindness and tritanomaly) are correlated or if it’s just a coincidence and they aren’t related at all. I’m also curious because to my knowledge my dad isn’t color blind (my born sex is female) and can see perfectly fine at night time as well.",
    "comments": [
        {
            "level": 0,
            "comment": "Tritanomaly is very rare and (I think) it's not very well understood, since cases are so rarely encountered. I think there's even still debate regarding whether tritanomaly is actually a thing like prot/deuteranomaly (where the pigment is present but misformed), or whether it's actually just incomplete tritanopia (where the pigment is *absent*, but maybe only in some cones).\n\nIt's also possible that tritanomaly cases are *acquired*, meaning that something happened to impair or damage the S-cones. I guess it's possible that, if that were the case, rod function (subserving \"night vision\") might also be impaired.\n\nBut that's all pretty hard to know from here. But the notion of *acquired* color deficiency brings to mind the possibility of *disease*.\n\nI would recommend that, if you haven't gone in a long while, you should see an optometrist or someone else who can have a look in there to make sure you don't have any kind of degenerative retinal disease going on. Lots of disorders can show up, early on, as distorted color vision, night blindness, blurriness, etc etc.",
            "score": 3,
            "author": "aggasalk",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah that’s kind of my thoughts after reading is that I might have cataracts or something. I do regularly go to the eye doctor though because I wear glasses and they’ve never noticed anything. I also don’t want people to get the wrong idea that I’m asking medical advice, just like you said there’s just not a lot of information available. I do see an optometrist yearly and I’ve had these symptoms my whole life. In my head it would make sense that if I can’t see dark blues very well that would make sense that I’m night blind but I’m also not a scientist or a doctor and I don’t know how the human eye works 😂",
                    "score": 2,
                    "author": "Cassatrash",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "well that's good then!\n\ni searched for a bit and i can't find any indication of connection between tritanomaly/tritanopia and night blindness. it depends on exactly what you mean, i guess? the rod system is very separate, very functionally independent, of the cone system (which includes the S-cones, which are dysfunctional in tritanomaly). *but* it is tuned for sort-of similar wavelengths. which is why it's well known that if you want to better-maintain a state of dark adaptation, you should keep to using very long (reddish) wavelengths, e.g. if you want to look at star charts while stargazing. if you look at white light (which includes the shorter wavelengths the S-cones and the rods like), then the rods are much more affected, which is bad for night vision.\n\nthere *is* an interesting effect called \"Purkinje shift\" (https://en.wikipedia.org/wiki/Purkinje_effect), which is a strange alteration in the appearance of colors in a narrow luminance range where both cones and rods are able to work together. people with normal color vision will report, in this range of luminance, that colors appear bluer, and that blues seem more intense. this is presumably because, in this narrow range, S-cone and rod signals are correlated and reinforcing.\n\nfor that reason, *you'd think* that there would be interesting studies out there of strange Purkinje-shift phenomena in tritanopes/tritanomalats. But I can't find any! I think it's because such subjects are so rare, but I'd love to be corrected or to learn more about the topic...",
                            "score": 2,
                            "author": "aggasalk",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That is actually super interesting and exactly the kind of answer I was looking for. I read the wiki article and it almost made exact sense to me because that’s how I feel like I perceive the world in the dark is just a bunch of blue that I can’t see 😂 maybe I can find studies to participate in even though I’m really not super color blind it barely effects my life. I didn’t even know until the last couple of days",
                                    "score": 2,
                                    "author": "Cassatrash"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "My only argument with the blue lights is that it’s not just those for me I can actually see those better. It’s actually like neon light blue, or for instance like the petsmart sign at night time, I know that it says pet smart but I can’t read it. Or neon open signs I can see the open in red but the blue around it could be a square or some bizarre shape and I would never know the difference. Another good example is like old tvs with no input, that color actually physically hurts me lol. \n\nMy other question is why am I so night blind, would that be a separate condition? Unless it’s well lit and I know where I’m going I don’t drive at night time. I’m more worried that I might have signs of cataracts but I go to the eye doctor regularly and they’ve never noticed anything and I’ve had these symptoms as long as I can remember",
                    "score": 2,
                    "author": "Cassatrash"
                }
            ]
        }
    ]
}