{
    "id": "129w0hn",
    "score": 218,
    "title": "What is the reason for the varying magnetisms of different alloys of iron nickel and cobalt?",
    "author": "Remote_Doughnut_5261",
    "date": 1680465090.0,
    "url": "https://www.reddit.com/r/askscience/comments/129w0hn",
    "media_urls": [],
    "other_urls": [
        "https://imgur.com/a/D6bqzZ2)."
    ],
    "postText": "I was reading technology review 1972 and there was this interesting [chart](https://imgur.com/a/D6bqzZ2). There is no obvious pattern and so I was curious what the theoretical reason was for these varying degrees of magnetism.",
    "comments": [
        {
            "level": 0,
            "comment": "It all comes down to the long range order of magnetic spin. Because these are alloys, it’s difficult to identify the short-range structure giving rise to the long range order. There are multiple types of magnetism. In this case the materials are likely ferrimagnetic where some amount of spin is cancelled out by nearby spin. Imagine if you had a local structure of 10 atoms with net “up-spin” of 10 if that structure is next to a local structure of 10 atoms with “down-spin” of 5, then the average magnetism would be the same as a ferromagnet with a net spin of 5 for those 20 atoms.\n\nBecause of the challenge in identifying the local structures, it is difficult to identify the reason for the trend in these alloys.",
            "score": 12,
            "author": "vendetta0311",
            "replies": [
                {
                    "level": 1,
                    "comment": "As a guitarist, I find this chart fascinating! Can you confirm how I interpret this? It seems that pure cobalt (front left) has the lowest magnetism, and those two peaks on the right represent differing alloys of iron and nickel. Do I have the right of it? And I would assume that a composite of the two would not have similar properties as the alloy.",
                    "score": 8,
                    "author": "Andaeron",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Why would you care, as a guitarist?",
                            "score": 5,
                            "author": "Remote_Doughnut_5261",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Electric guitar pickups use a magnetic field to observe the movement of the strings.",
                                    "score": 8,
                                    "author": "NikitaFox",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thanks :)",
                                            "score": 2,
                                            "author": "Remote_Doughnut_5261",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "And the most common string materials are steel, cobalt, and nickel, in various configurations. It would explain some design choices between string compositions, and maybe offer some insight as to which performance claims are legit.",
                                                    "score": 4,
                                                    "author": "Andaeron"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "For pure iron, it comes down to the underlying crystal structure.\n\nIn a cubic close-packed lattice, also known as face-centred cubic, all electrons of the iron are involved in strong metallic bonding. This means all electrons in the outer shells are strongly delocalised and can move about quite easily and are not prone to form any magnetic order. This allotrope of iron is called austenite, and it is paramagnetic.\n\nIn a body-centred lattice, instead, the d_x^2-y^2 d_z^2 orbitals don't point at a nearest-neighbour atom. This means that they are much less involved in the metallic bonding, instead they are fairly localised and have strong magnetic interactions. This allotrope is called ferrite, and it is ferromagnetic.\n\nFor pure iron, ferrite is stable below 900 C, and austenite is stable between 900 – 1400 C, but adding nickel can make austenite stable at room temperature. I guess this explains the minimum in permeability between iron and nickel in your diagram.",
            "score": 3,
            "author": "luckyluke193",
            "replies": [
                {
                    "level": 1,
                    "comment": "Austenite is more magnetic right?",
                    "score": 1,
                    "author": "Remote_Doughnut_5261"
                }
            ]
        }
    ]
}