{
    "id": "12avmuk",
    "score": 2389,
    "title": "Can a photon, from a source other than the sun, pass through the sun completely? In summary, does the sphere of the sun cast a shadow if there were a much brighter light source on the other side of it?",
    "author": "jkk45k3jkl534l",
    "date": 1680551488.0,
    "url": "https://www.reddit.com/r/askscience/comments/12avmuk",
    "media_urls": [],
    "other_urls": [],
    "postText": "If a photon can't pass through something, then that thing is creating a shadow of some form because a shadow is a lack of photons due to an obstruction. I've heard that some forms of energy, like plasma, don't block photons though. Can photons (not originating from the sun) pass through the center of the sun and make it to the other side?\n\nEx. If you had a laser, could you shine it at the sun and then see that laser on the other side of the sun? (Let's assume the observer on the other side of the sun can differentiate between light from the sun and light from the laser.)",
    "comments": [
        {
            "level": 0,
            "comment": "The sun is not transparent. The visible surface of the sun would be the same even if you disregarded all the emitted light and only considered how much it obscures background objects. Looking at the limb of the sun it can be seen that the sun's surface turns from fully transparent to fully opaque over a distance of maybe hundreds of km as the density of the solar plasma increases the deeper you go. The measure of how translucent something is, ie. how much stuff is needed between you and an object to obscure the latter, is called [optical depth](https://en.wikipedia.org/wiki/Optical_depth_(astrophysics\\)) or optical thickness.\n\nPlasma is particularly good at being opaque, as being an ionized gas, all the free electrons in it are very happy to absorb and scatter light as it goes through, much moreso than the same amount of neutral gas would.\n\nThe fact that stars are, indeed, opaque, can be exploited to find binary stars, particularly dimmer companions in close orbits around a brighter, more massive star. If the pair orbits edge-on from our perspective, such that the components [transit](https://en.wikipedia.org/wiki/Astronomical_transit) each other, each transit causes a tiny dip in the binary's total brightness because some of either star's light is blocked by its companion.",
            "score": 1572,
            "author": "Sharlinator",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 258,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 65,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 22,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 27,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is a great answer, but I have a follow up: what if we had a photon with an extremely large wavelength, say larger than the diameter of the sun.  First, is EMR with this long a wavelength possible? If yes, wouldn't the sun be transparent to that photon?",
                    "score": 60,
                    "author": "141421",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There would still be a chance it would be absorbed or scattered.\n\nIt would have a frequency below 0.2 Hz.",
                            "score": 26,
                            "author": "FM79SG"
                        },
                        {
                            "level": 2,
                            "comment": "great question :) ~ 0.21 Hz, I can't find any info on this! But It'd diffract around the sun I assume?\n\nEdit* https://hypertextbook.com/facts/2001/ElizabethWong.shtml",
                            "score": 42,
                            "author": "thepatterninchaos",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This is somehow hard to digest: take a distance that is almost incomprehensible to the human mind (the sun diameter) a speed that is equally absurd (speed of light) and you get a diffracted frequency that is a mundane 0.21 Hz. More or less a person’s breathing frequency at night.",
                                    "score": 36,
                                    "author": "RoastedRhino",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "This is actually a trivial question from wave physics.\n\nTo any wave, obstacles shorter than its wavelength are basically invisible. The wave just passes by and around the object. It's not like it's transparent per se, it's more like it's too small to interact with the wave.\n\nSo yes, there is a frequency below which the wave would just keep on truckin' as if the Sun wasn't even there.\n\n&gt; is EMR with this long a wavelength possible?\n\nTechnically yes, but working with that kind of wave would be challenging, since it's so different from all the other waves we normally use.",
                            "score": 5,
                            "author": "florinandrei",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Add to this the fact that photons produced in solar fusion may take hundreds of thousands of years to actually travel through the seething mass of the sun’s interior and escape into space. This further complicates the idea of whether any photons could travel through the sun from any outside source.",
                    "score": 4,
                    "author": "scarabic"
                },
                {
                    "level": 1,
                    "comment": "But when I shine a flashlight at a candle, the flame doesn’t cast a shadow. Is it because a candle flame isn’t hot enough or dense enough to be opaque?",
                    "score": 32,
                    "author": "shortformyheight",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 43,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I would suspect that in this case the flame is not so much opaque as the pocket of low-density air is acting as a lens. It may be bending the light rather than absorbing it. \n\nThe way to check would be by changing the distance between the wall and the flame. If it is opaque, the effect should be more stark the closer the flame. If it is a lens, then the effect should decrease with distance.",
                                    "score": 0,
                                    "author": "PatrickKieliszek",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;If it is opaque, the effect should be more stark the closer the flame. If it is a lens, then the effect should decrease with distance.\n\nAren't those the same thing? Closer is stronger and farther is weaker in both cases.",
                                            "score": 2,
                                            "author": "viliml",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Flames do technically cast a faint shadow. But they are indeed not very opaque at all, being just a cloud of soot particles suspended in the air, undergoing combustion, if we’re talking about the yellow type of flame. So in this case the reason they *look* opaque is that they’re (typically) brighter than the background. But have a \"thick\" enough flame (stars are slightly larger than a candle flame…) and it will certainly absorb or scatter most of the light passing through it.",
                            "score": 134,
                            "author": "Sharlinator",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 165,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 38,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 9,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 23,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "That makes sense, thanks!",
                                    "score": 2,
                                    "author": "shortformyheight"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It does actually. Get a brighter flashlight. My phone flashlight turned up all the way will create a shadow when cast on a lighters flame.\n\nTurn off all other lights and get close to a wall, depending on the brightness of the phone it might be very very faint",
                            "score": 11,
                            "author": "w3_ar3_farm3rs"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Sort of unrelated, but sort of related to the binary star detection technique.\n\nYou can do a trick with [these glow necklaces](https://www.glowwithus.com/glow_balls.htm) that come with joints so you can make a sphere with glowing lines of longitude. If you spin it on the axis, you see a glowing ball with darker lines at specific places. The _darker_ lines appear where the glow necklaces line up because instead of adding together, the one in front blocks the light from the one behind it.",
                    "score": 3,
                    "author": "db8me"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Agree with everyone else that stars can cast shadows. A real-life example of this is the eclipsing ternary star Algol in the constellation Perseus:\n\n“Algol is a three-star system, consisting of Beta Persei Aa1, Aa2, and Ab – in which the hot luminous primary β Persei Aa1 and the larger, but cooler and fainter, β Persei Aa2 regularly pass in front of each other, causing eclipses. Thus Algol's magnitude is usually near-constant at 2.1, but regularly dips to 3.4 every 2.86 days during the roughly 10-hour-long partial eclipses. The secondary eclipse when the brighter primary star occults the fainter secondary is very shallow and can only be detected photoelectrically.” [Wikipedia](https://en.wikipedia.org/wiki/Algol)\n\nThough both of the main components of Algol are stars generating photons, the dimmer of the two periodically blocks photons of the brighter when moving in front of it as seen from Earth, causing a decrease in brightness or “shadow”. If this weren’t true and photons could pass through the dimmer star, no decrease in brightness would be observed.",
            "score": 67,
            "author": "LittleMountain5"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 592,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 537,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 102,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 152,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 88,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 63,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[removed]",
                                                            "score": 23,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[removed]",
                                                                    "score": 15,
                                                                    "author": "[deleted]",
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[removed]",
                                                                    "score": 9,
                                                                    "author": "[deleted]",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 1,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 2,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 9,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 19,
                                    "author": "[deleted]",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 7,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 2,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 84,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 68,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 35,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 47,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[removed]",
                                                            "score": 122,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[removed]",
                                                                    "score": 23,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[removed]",
                                                                            "score": 22,
                                                                            "author": "[deleted]",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "[removed]",
                                                                                    "score": 16,
                                                                                    "author": "[deleted]",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "[removed]",
                                                            "score": 16,
                                                            "author": "[deleted]"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 10,
                                    "author": "[deleted]"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 5,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 27,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 9,
                                            "author": "[deleted]",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 8,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 46,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 131,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 17,
                                    "author": "[deleted]",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 19,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 9,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 0,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[removed]",
                                                            "score": 8,
                                                            "author": "[deleted]"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 16,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 10,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 3,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 14,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[removed]",
                                                            "score": 15,
                                                            "author": "[deleted]"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 0,
                                    "author": "[deleted]"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 37,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": -7,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 7,
                                            "author": "[deleted]",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 21,
                                            "author": "[deleted]"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 12,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": -1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 10,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is actually one method to see eclipsing binaries. When two stars are next to each other we have a baseline for the brightness of the system as a whole that we can plot as the stars orbit each other. When one passes in front of the other the photons of the star behind get blocked, and thus the total brightness of the system decreases and we can see that drop in luminosity.\n\nSo to answer your question, no, it is very unlikely a photon from another light source would pass completely through the sun without being absorbed by an electron in the sun. Even photons generated in the core of stars from fusion get bounced around from electron to electron countless numbers of times before slowly making it's way towards the surface and escaping. This process can take millions of years and any information from the photons creation would be lost.",
            "score": 16,
            "author": "Danni293"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 63,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 13,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Interesting aside: Your question is essentially the reason why we have the Cosmic Background Radiation.  \n\nAs another poster said, the suns plasma is absolutely opaque because it is extremely good at absorbing photons due to its state of being dissociated elementary particles. But that high energy state also makes it very luminous as a black body radiator. Individual photons inside the sun are quicky absorbed as others are produced and likely travel very short distances in their very brief lifespans. \n\nThis was the state of the early universe around 0-300,000 years after the big bang. Hot, opaque plasma. \n\nThe moment the universe stopped being opaque, those photons that were given off at that time could finally go much greater distances. Some are still zinging around the universe. But because the universe is expanding, the light has become stretched out from its initially low wavelengths to microwaves, not quite the longest waves, but very close.",
            "score": 7,
            "author": "rvralph803",
            "replies": [
                {
                    "level": 1,
                    "comment": "We can't know much about what happened before that moment of last opacity because no extant photons exist from before that time.",
                    "score": 4,
                    "author": "rvralph803",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Possible? Yes, there is a probability that the photon passes through unhindered. Likely? Not very.\n\nPhotons that are emitted by fusion in the core of the star can take millions of years to emerge from the sun as they are absorbed and released and scattered in a continuous cycle up to the surface.",
            "score": 5,
            "author": "Guses"
        },
        {
            "level": 0,
            "comment": "Atomic physicist here. The honest answer is: Depends on the wavelength (color) of the photon. Given the chemical/atomic composition of the sun, it will absorb certain lights, and other types might go through. If we are talking specifically of visible and near infrared light (as most lasers are), it most likely would be completely absorbed. \n\nThis is true for all matter, it will only block/absorb light that \"fits\" within it's atomic structure. This is why X-ray can pass thought your skin to image your bones.",
            "score": 56,
            "author": "36colouringPencils",
            "replies": [
                {
                    "level": 1,
                    "comment": "On the atomic scale, everything you said is true. However, on the stellar scale, it is almost certainly false. There is so much matter in the sun that even the highest energy gamma rays don't stand a chance. I guess if you had a low enough frequency radio wave where the wavelength was substantially larger than the sun...",
                    "score": 52,
                    "author": "troyunrau",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "The Sun is billions of times thicker than your bones (in terms of area density). It doesn't matter if your calculated transmission probability would be 10^-10^9 or 10^-3\\*10^9 or whatever, either way no photon ever passes through unless we are extremely close to the limb.",
                    "score": 29,
                    "author": "mfb-"
                },
                {
                    "level": 1,
                    "comment": "Yes but even if the absorption length of a photon is thousands of Km, the sun is much larger than that :)",
                    "score": 2,
                    "author": "FM79SG",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Photons emitted by the sun can take millions of years to reach the surface and be \"free\" as they are constantly being absorbed and re-emitted in scattering directions.",
                    "score": 2,
                    "author": "Guses"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Can it? Yes, possibly - there’s a chance that photon could travel to the end of the universe without being disturbed per the laws of quantum mechanics, although that chance is infinitesimally small\n\nIs it likely? No, the sun is a huge shitload of matter at the end of the day in a plasma state that’s really good at trapping EM\n\nTherefore yes a star could cast a shadow and there are so many binary systems out there I’d be surprised if this hasn’t been witnessed yet",
            "score": 3,
            "author": "DowntownRefugee"
        },
        {
            "level": 0,
            "comment": "Hey there, I'm noticing a lot of problematic answers here, so let me help. \n\nThe brightness of a star, its luminosity, is the amount of energy output per unit of time. That's taking into account both the wavelengths of light and the total amount of photons its emitting, in essence. \n\nIn theory, absolutely it can cast a shadow - but not in every scenario. \n\nA higher luminosity star than our sun could mean, for this hypothetical star, it's producing much higher frequency light, but physically less photons. If that \"brighter\" star were directly behind our sun, our sun would absorb the light, and thus cast a shadow. Of course, distance would matter, but this is a hypothetical scenario where another star is adjacent to ours, without the stars colliding.\n\nHowever, a more luminous star than our sun could also mean it's emitting, for example a million times the amount of photons, but at a lower wavelength than our solar average. In that case, photons would hypothetically pass through the sun, and thus not produce a shadow.\n\nFun fact: Even though photons could travel entirely through our sun without being affected, the frequency of light that matches the diameter of the sun, is an EXTREMELY low frequency of 0.216 hz, which as I understand, isn't something a star typically even produces.\n\nHope this helps!",
            "score": 10,
            "author": "numatter",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;0.216 hz\n\nI mean here we are getting really into a semantic discussion if radio waves are \"light\", or if all electromagnetic radiation can be considered \"light\" for that matter. \n\nIn the more commonly used meaning of light, the sun will cast a shadow, even if you can't notice it because the sun is much brighter.",
                    "score": 7,
                    "author": "FalconX88",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They all use photons though!",
                            "score": 4,
                            "author": "beefygravy"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;A higher luminosity star than our sun could mean, for this hypothetical star, it's producing much higher frequency light\n\n&amp;#x200B;\n\n&gt;However, a more luminous star than our sun could also mean it's emitting, for example a million times the amount of photons, but at a lower wavelength than our solar average.\n\nThese statements are a bit confusing. Why would red photons pass through our sun? A star that is more luminous than the sun just means it's emitting more power. If that star is on the main sequence, it would be hotter than our sun, so it would also mean it's bluer and physically larger. A star that is cooler than our sun, and on the main sequence, is automatically less luminous. However, a star that is cooler than our sun, but physically larger, for example because it's very puffy and is now a red giant, i.e. not on the main sequence, will be more luminous. This is because, assuming a black body of a given temperature, more area (i.e. bigger size) means more power. It just happens that, because of internal physics, main sequence stars that are larger (massive) are also bigger (in diameter) and hotter (bluer in color) than our Sun. Check out Herzsprung-Russel diagrams for a nice overview.\n\nPhotons would definitely not pass through our sun, since the optical depth (aka opacity) for the sun, especially deeper inside, is very large. It takes a photon created in the core thousands of years to reach the surface, because it keeps colliding with other particles. Even if a lower energy photon would make it to the sun, inverse compton scattering would boost its frequency up, don't you think? And then, one might add, is it the same photon anyway, after the first collision?\n\nObservationally speaking, in astronomy, we can see that when a star eclipses another, there is a dip in the brightness of the system.  \n\n\nwith regard to radio wavelenghts, it doesn't even count as passing through if the photon has an uncertainty in position larger than our sun.",
                    "score": 1,
                    "author": "Blakut",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "It is possible, but extremely unlikely.\n\nFirst a bit about photons.  When a photon strikes matter, it is usually absorbed.  This excites the matter it struck.  In other words, now the matter has too much energy.  It then gives off a photon, which travels on its merry way.\n\nBut it's not the same photon as the one that was absorbed.  It's probably not even the same energy that was absorbed.  Plus, the sun is a lot more than just a ball of plasma.  There's a whole lot of matter there - all being held there by gravity.  Its core is probably extremely dense - far more dense than the Earth.  This is only an educated guess since we haven't actually gone there to measure it.  But it's a pretty well educated guess, if it follows the laws of physics the rest of us do.\n\nSo to answer your question, no.  It's slightly possible, but only in the sense that anything is possible with quantum mechanics.  It's also possible that all your undergarments will spontaneously quantum tunnel one foot to your left.  But it's so extremely unlikely - as a matter of random chance.\n\nI say that largely because I don't get invited to those parties.",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was just imagining that party where all panties translate instantly to one side. What would the asking price for a ticket be?",
                    "score": 2,
                    "author": "MariusStuparu",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "No. Photons can’t pass through the sun. It takes the ones in there maybe thousands of years to get out I understand. \nBut to answer your question in it’s fullest, if you get a candle and place it in sunlight neither source is creating a shadow on the other. They are both producing photons. Firing at each other. The sun is still producing light on its opposite side to the candle.",
            "score": 2,
            "author": "betamale3"
        },
        {
            "level": 0,
            "comment": "If the sun didn't omit any light, then yes it would cast a shadow.\n\nThe sun does omit light so no, it won't cast a shadow. However, if theres a much brighter object, and theres an eclipse where the sun comes between  us and that thing, then we wouldn't see the brighter light and earth would seem \"darker\" than if the other objects light was hitting us.\n\nYou could just test this at home. Point a flashlight at the wall, align a brighter flashlight behind it point at the same spot. Light don't go through the back of the flashlight. There will be a light on the wall and a brighter halo around it.",
            "score": 0,
            "author": "_Reyne"
        },
        {
            "level": 0,
            "comment": "Light will bend around a gravitationally heavy object, even if you had another sun parallel with our own, most the light would bend around it. If you could get a particle of light to hit the sun it would most likely re-release the photon quickly after. The light in the sun takes over 50,000 years to travel from the core and escape, and the sun's energy moves outward not inward.",
            "score": 1,
            "author": "Lunasi"
        }
    ]
}