{
    "id": "12bl7ni",
    "score": 8,
    "title": "What does it mean when people say that quantum mechanics is probabilistic?",
    "author": "eagle_565",
    "date": 1680619343.0,
    "url": "https://www.reddit.com/r/askscience/comments/12bl7ni",
    "media_urls": [],
    "other_urls": [],
    "postText": "People sometimes say that quantum mechanics is probabilistic. Normally we use probabilities when we don't have all the information or computing power necessary to make exact calculations like the probability that a certain sports team will win their next game. In theory if we had all the relevant information we would be able to predict the outcome of the game with certainty. Is quantum mechanics seen as probabilistic because we can't have all the information in practice due to the uncertainty principle, or is there a deeper reason?",
    "comments": [
        {
            "level": 0,
            "comment": "Quantum Mechanics has as afundamental idea that \"perfect\" information is not possible for an individual particle.  The precise definition of the state of a particle is defined as a probability of multiple possible states, only resolving into a definitive state upon measurement.\n\nIt is important to understand that experiments appear to affirm the idea that the state of the particle is determined by the measurement (quantum physicists like to say that its waveform collapses).  Hidden additional information that might lead to the appearance of uncertainty does not show up in experiments designed to reveal the telltale signs of finer informational structures.\n\nQuantum mechanics is arguably the most mathematically rigorous branch of physics.  The confusing theoretical predictions match the experimental results well enough that it appears more complete as a theory than most other areas of physics (baring quantum electrodynamics contradicting general relativity).",
            "score": 7,
            "author": "DustySwordsman"
        },
        {
            "level": 0,
            "comment": "Information isn't really the issue. Even if you knew the exact form of the quantum state a system is in (which is everything there is to know about a system), you still couldn't predict the outcome of some measurements on that system. Fundamentally, some properties of the system *don't even have well-defined values* until measured\\*. It's not that they're somehow hidden, they just don't have a definite value for that state in the first place.\n\n\\-----\n\n\\*This is using the \"standard\" interpretation of quantum mechanics, which keeps a property called \"locality\" intact.",
            "score": 5,
            "author": "d0meson",
            "replies": [
                {
                    "level": 1,
                    "comment": "It helped me to think of fundamental particles as analogous to sound waves. Obviously a wave can either have a specific frequency and undefined position or a specific position and undefined frequency. You have to stack up different pure frequencies together to make the sound blurt out at one particular moment. The more specific you want the sound, the more frequencies you have to add. \n\nSo it's not that if you just had better microphones you could define both their position and frequency. It's that the more precisely it has one defined element, the less precisely it will define the other.",
                    "score": 1,
                    "author": "That-Soup3492"
                }
            ]
        },
        {
            "level": 0,
            "comment": "In the standard or Copenhagen interpretation of quantum mechanics, it is genuinely probabilistic at the most fundamental level, and even with perfect information it would be impossible to predict what the outcome of a quantum event would be. The Copenhagen interpretation of quantum mechanics says that quantum systems exist in superpositions of pure states, and when you measure it, the system collapses randomly to one of those pure states.\n\nThere are some alternatives. The Bohm interpretation says that quantum mechanics is really deterministic, but that it's not possible to actually have perfect information, so it appears random. Some information is always kept hidden and inaccessible. A drawback of this interpretation is that, for technical reasons not worth going into here, this hidden information somehow has to propagate faster than the speed of light, which by conventional physics isn't possible.\n\nObjective collapse interpretations are similar to the Copenhagen interpretation in that they really are random, but in these models, collapse isn't triggered by \"measurement\", which is a pretty vague term if you think about it, but rather there are additional terms that suppress the randomness as the system gets bigger. For small systems, these effects are negligible, but for big systems, these effects mean the system's randomness is negligible, so it doesn't seem to behave randomly any more. A measuring device measures a definite outcome, then, because it's big enough that it passes this threshold and can't see the randomness any more.\n\nMost interestingly, we have the many worlds interpretation. This one says that every outcome of a quantum event happens, so it's actually not random at all. The question then becomes, if every possible outcome happens, why do I only ever feel like a single one did? If there's a \"me\" in every possible world, each one seeing a single possible outcome, what makes it so that I'm this me and not a different me, and why does that process seem random?",
            "score": 3,
            "author": "Redingold"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Science took a great leap forward when models to predict or try to understand the behaviour of the World moved away from models describing what will happen to the much more realistic model describing what might happen.\n\nThis does not only apply to quantum mechanics. \n\nHowever impressive the maths looks, all conclusions of mathematical models of the World are refined statements of page one. Many , if not most, mathematical models have some very convenient but often apparently absurd assumptions on page one.\n\nFor example, you might find a model describing the behaviour of piles of grit or sand that starts of stating, \"assuming the particles can be considered to be spherical\"; it takes very little investigation to show that this is not true.  Nevertheless, many predictions or estimates arising from these apparent absurdities give useful guidance to engineers.\n\nThis very useful outcome  is often explained because the errors due to the assumption are caused by a very high number of different random effects; regardless of the probability structure of any particular effect, the cumulative effect is expected to approach a Normal Distribution.  Normal being a symmetrical curve, the average is assumed to be a reasonable indication of the observed behaviour.  This central limit theorem, as it is known, is just another convenient assumption of page one.\n\nAssuming Normality in random processes is so common that it is often  used without justification and stated as a fact.\n\nMistake?  Well Sometimes.\n\n I was involved in making instruments for estimating difficult flow (polyphase, gas and solid particle mixtures), earlier attempts to describe the signals produced all assumed the particle distribution was Normal and furthermore that the particle size distribution was also Normal.  But that would give a finite probability of a negative number of particles being possible and negative diameter particles; central limit notwithstanding, this was a step too far.\n\n I built a mathematical model assuming that the Signal was due to the combined effect of a large number of populations of same size particles with the distribution of particle sizes of each population being describable as Log Normal. (Log Normal has its origin at zero).  In addition, I justified the statement that each of the smaller, same diameter populations, was distributed in space following a Poisson Distribution (Also has an origin at zero).\n\nThe resulting insight allowed the instruments to be understood and designed to maximise the reliability and range of the resulting instrument application. it worked.",
            "score": 2,
            "author": "PoetryandScience"
        },
        {
            "level": 0,
            "comment": "Standard physics assume we don't know everything but can still predict a lot by putting up some assumptions. Determining a winning team for example is based upon that and can be successful if the assumptions are good and fail if they are not. In this case, the probability is based on the validity of our assumptions.\n\nNow for quantum mechanics, whatever the assumptions we could put, the results don't change. The Young slits experiment shows it really well: even if we send electrons one by one, if they are in a &lt;-1|1&gt; state, they will make an interference pattern. But, if we send all 1 it should make only 2 figures. Therefore it can act both as a particle and a wave. \n\nThe conclusion is: if a ball is thrown at a couple slits, we can assume a trajectory and determine a \"landing position\" with a tolerance on the position, but if we throw a 2 state particle, we can't predict where it will land nor which slit it will pass. It's either here or there or further on the interference pattern. It has a presence probability that does not depend on any other parameter than its state. And states are fixed when measured but it can be superposed before.\n\nThe uncertainty principle comes from a mathematical conclusion based off schrodinger's equation. It does not affect the states or the duality.",
            "score": 1,
            "author": "El_Sephiroth",
            "replies": [
                {
                    "level": 1,
                    "comment": "As I don't know if you understand well, and the post is long enough, I make a little edit here.\n\nIf we know the state beforehand, it does not make an interference pattern. It's not like if we knew we could predict. The superposed states have properties that a one state particle does not. The particle is not +1 or - 1 and we don't know, it's both. That is why it is a probability and not an assumption mistake.\n\nAt least that's what the experiment says.",
                    "score": 2,
                    "author": "El_Sephiroth"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Take the half life of an element as being 1 year - you know that on average half of those particles will decay within one year.\n\nHowever if you look at just one particle alone, it may decay in 1 year, it may decay in 1000 years. It is truly random with no hidden variables at play as far as we know.",
            "score": 1,
            "author": "Synthyz"
        }
    ]
}