{
    "id": "12bs3ma",
    "score": 775,
    "title": "Why does the parasite have to go through the mosquito for humans to get Filariasis?",
    "author": "ryum1503",
    "date": 1680633335.0,
    "url": "https://www.reddit.com/r/askscience/comments/12bs3ma",
    "media_urls": [],
    "other_urls": [],
    "postText": "Filariasis or Elephantiasis is a human disease caused by the nematode parasite Wuchereria bancrofti. The adult parasite gives birth to a microfilaria from the lymphatic system. The worm then goes into the human's circulatory system, gets sucked by a mosquito, develops until it is reintroduced to another human host and develop into adults in the lymphatic system. Thus its cycle. I have heard that the mosquito is a necessary step in the cycle, but I don't see why other than it being the transmission vector. Is there another reason the parasite has to go through the mosquito in order for it to develop? Do mosquitoes contribute to the nematode's development? What are the differences between the filaria larvae before it has been ingested by the mosquito and after it has been injected into the human host?",
    "comments": [
        {
            "level": 0,
            "comment": "Parasitologist here,\n\nFilarial nematode parasites, like many vector borne diseases, undergo several stages of development in their insect hosts. The microfilariae that are produced from adults have a protective sheath which is sloughed off in the mosquito / fly (for loa loa, onchocerciasis, etc)  midgut after taking a blood meal. These L1 stage worms, as far as we know, do not autoreinfect hosts probably because a) bad for the gene pool, and b) could overwhelm and kill the definitive host. Instead larvae (for lymphatic filariasis) migrate to the mosquito wing muscle, invade cells, and develop twice more to become infectious L3 stage worms which exit the muscle and migrate out onto the skin of the next host the mosquito feeds on. This L3 stage is primed to infect humans.\n\nThis kind of parasitism is common since it allows for horizontal transmission between definitive hosts. And if you are a parasite that needs to get to the bloodstream, what better way to get passed around than through a blood sucking insect?",
            "score": 367,
            "author": "FanksForTheFish",
            "replies": [
                {
                    "level": 1,
                    "comment": "Returned Peace Corps Volunteer here,\n\nNothing technical to add but just wanted to say that the filaria vector I'm familiar with from Congo-Brazzaville were these absolutely gorgeous jeweled flies. They had a mottled outside that had irregular patches of shiny black and jewel tones in yellow, red or orange and well proportioned translucent black wings. Absolutely evil creatures.  Before they bite you, they secrete a numbing agent which wears off just before they take the fangs (or whatever) out of your skin.  Then you notice them just before they fly away.  If you don't know what they are, the experience is\n\n1. Oh, pretty\n2. Hey, it landed on me\n3. Wow it's sitting there a while\n4. OH &amp;%#$&amp;\\^! that hurt!\n5. Bye\n6. I guess that explains why I take that pill every week\n\nAs someone who consumes a lot of science communication, I would say that your question is somewhat reversed.  You asked why THAT parasite HAS TO follow that vector.  The answer of course is that it doesn't have to.  It IS that parasite only because it happened upon this vector. It evolved then, in ways that further take advantage of the options available to it.  Any mutated ancestors who were not able to take advantage of their environment (human-&gt;mosquito/fly-&gt;human) didn't flourish.  If it had evolved a different vector or lifecycle, it would be a different creature.",
                    "score": 163,
                    "author": "papadjeef",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Are you referring to Deer flies (Chrysops)? They transmit loa loa in west Africa, which is a fun eye worm that isn’t deadly but pretty gross. And they are quite nasty like horse flies in the way they bite. They have this sawblade kind of mouth.\n\nThere’s also some pretty black flies that transmit river blindness filarial worms but they are pretty small and their bites are pretty nasty too.\n\nHope you are in good health! Ivermectin tends to do the trick to keep infections from developing and there’s new treatments that might work to cure patent infections (see emodepside) though they aren’t marketed yet.",
                            "score": 43,
                            "author": "FanksForTheFish",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Curious CVT here whose knowledge of microfilaria is pretty much canine heart worm based: can humans in endemic areas take monthly ivermectin, the way we dose products like HeartGard? Or do they need to take a daily preventative like the old Filaribits? (Though that was diethylcarbamazine, not ivermectin, and less safe as well as less convenient, in dogs.) Are there topicals like selamectin (Revolution) that can be used instead of orals? Do infections with adult worms need to be treated with melarsomine injections? I just wonder how similar the whole situation is! (And I am very grateful to live in an area that has no known human-hosted filariasis, and where even the canine version is limited somewhat by a cold season that interrupts mosquito populations every year.)",
                                    "score": 18,
                                    "author": "h3rbi74",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The WHO does 6 month ivermectin courses for filarial prevention yes. That’s a major factor limiting the spread of filarial disease because only larval stages of the parasites are killed with ivermectin, same with Dirofilaria in dogs.",
                                            "score": 2,
                                            "author": "FanksForTheFish"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Meh.  I have a degree in Architecture so I don't have specific biological names.  Everyone, including Peace Corps referred to the eye worm as Filaria and the flies as Filaria Flies. The google image search for chrysops doesn't match my 25 yr old memory of \"Filaria flies\".  The deer flies look very boring compared to what we had.\n\nNone of us ever got sick from it. The prophylactic meds worked for everyone.",
                                    "score": 36,
                                    "author": "papadjeef",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "There are 8 different species and 3 categories of these worms, each with slightly different disease symptoms and insect vectors. They all have similar life cycles but are pretty similar otherwise.",
                                            "score": 5,
                                            "author": "zbertoli"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Does Loa loa also cause river blindness? Or is only Onchocerca? I always get confused since they’re both in the eye",
                                    "score": 3,
                                    "author": "roenim",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Onchocerciasis causes blindness because microfilariae travel up the optic nerve on occasion from the subderma and die, which releases their intercelular symbiotic bacteria Wolbachia, causing massive inflammation and death of the nerve. There’s some evidence that tetracycline, an antibiotic removing the wolbachia but not the production of microfilariae, also prevent blindness. But having a lot of worms going into optic nerves likely isn’t great for your eyesight.\n\nLoa loa travels about as an adult stage parasite so can’t get into the nerve as it’s way too big.",
                                            "score": 3,
                                            "author": "FanksForTheFish"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt; You asked why THAT parasite HAS TO follow that vector. The answer of course is that it doesn't have to. The answer of course is that it doesn't have to. It IS that parasite only because it happened upon this vector.\n\nYou're right in the answer, but I think in this case, OP might've just worded the questions poorly. I think OP was basically asking \"what is the mechanism/process that's going on that it needs the mosquito as the vector rather than being able to infect humans directly?\" (I could be wrong, though.)",
                            "score": 8,
                            "author": "valryuu",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Also filarial worms are not picky when it comes to their hosts at a species level because they can brute force their way in so loads of mosquito species can vector Brugia malayi for example. The vector relationship also depends on life history traits. There’s some worms that are released into the bloodstream periodically to overlap with mosquitoes (morning and evening) but others just go through the day to overlap with black flies. There’s so much unknown as to what drives these mechanisms though, and what makes any given species a permissive vector.",
                                    "score": 0,
                                    "author": "FanksForTheFish"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Fun but gross fact, Human Filariasis causes some men to have a huge scrotum.  I remember my infectious disease course showing a picture carrying his nutsack in a wheelbarrow.  Couldn’t find that one but here is another [NSFW picture](https://ima.org.uk/12771/predicting-extinction-of-filarial-worm-infections/)",
            "score": 23,
            "author": "IamsomebodyAMA",
            "replies": [
                {
                    "level": 1,
                    "comment": "I remember that picture from long ago!  To a grade schooler, it sounds funny, to an adult, no thanks.",
                    "score": 7,
                    "author": "DougK76"
                },
                {
                    "level": 1,
                    "comment": "Was his name Randy? Iir, he astray have himself the disease so get pity and a Marijuana card.",
                    "score": 7,
                    "author": "mechmind"
                }
            ]
        }
    ]
}