{
    "id": "12carfi",
    "score": 28,
    "title": "Can you actually create gold from say uranium if you bombard it with alpha-particles?",
    "author": "Major_Some",
    "date": 1680675727.0,
    "url": "https://www.reddit.com/r/askscience/comments/12carfi",
    "media_urls": [],
    "other_urls": [],
    "postText": "This question has been in my mind since we learnt fission.I think this would be super time consuming but is it possible..if you give enough time?If yes how many years might it take?Is it economically feasible?Has someone tried it?",
    "comments": [
        {
            "level": 0,
            "comment": "Not sure about the process for uranium to gold, maybe a particle accelerator but [bismuth to gold has been done](https://en.wikipedia.org/wiki/Glenn_T._Seaborg#Return_to_California). Glenn Seaborg did it back in the 80s at Lawrence Berkeley National Laboratory. [This article goes a bit into the process and difficulty for doing it with lead.](https://www.scientificamerican.com/article/fact-or-fiction-lead-can-be-turned-into-gold/). While the same process that's used for bismuth can be used, the difficulty is separating the lead from the gold afterwards.",
            "score": 20,
            "author": "SuperSimpleSam",
            "replies": [
                {
                    "level": 1,
                    "comment": "So basically it is possible,but it's gonna be hard to separate them?",
                    "score": 3,
                    "author": "Major_Some",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Possible but not economically feasible. They are just converting a few thousand atoms.",
                            "score": 17,
                            "author": "SuperSimpleSam",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yea I guess you would need a lot of uranium to make super small amounts of gold.Makes sense.",
                                    "score": 3,
                                    "author": "Major_Some"
                                },
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 1,
                                    "author": "[deleted]"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "To put it simply, alpha particles (or neutrons, which are usually better for this sort of thing) are way more expensive than gold.\n\nGold costs a little less than $12,000 for a mole right now. You can just have it shipped to your house.\n\nBy contrast, if I wanted a mole of neutrons, I could go to the High-Flux Isotope Reactor at Oak Ridge. (Well, I couldn't. But someone who did the right paperwork could.) This thing produces an astonishing number of neutrons -- my calculation is in the neighborhood of a mole per day. But it cost $56M/year to operate in 2010. Even if that represents continuous operation, it still costs about $150,000 for a mole of neutrons. So if you could convert those neutrons to gold at 100% efficiency, with no cost of the starting material or the separation, it would still be many times more expensive than buying it or digging it out of the ground.",
                            "score": 13,
                            "author": "uh-okay-I-guess",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "From a nuclear physics perspective the obvious starting place is platinum, ideally enriched to have more platinum-196 (~25% in nature). That can catch a slow neutron and become platinum-197 which then decays to gold-197, the only stable isotope of it. Currently platinum is cheaper than gold, that used to be different, and if you do isotope separation you have extra costs there. You better aim at a good conversion ratio because you'll also produce platinum-193 with a half life of 50 years, so the waste platinum will be radioactive for centuries.",
                                    "score": 7,
                                    "author": "mfb-"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Splitting uranium into gold plus something else is not completely impossible but it's not a likely reaction. With elements nearby (platinum, mercury, ...) you have better chances to end up with gold. In the lab that can be done. It's just far too expensive for things that occur naturally. You would spend something like millions of dollars per gram instead of tens of dollars for gold from a mine.",
            "score": 7,
            "author": "mfb-"
        }
    ]
}