{
    "id": "12j9yeb",
    "score": 67,
    "title": "What might night sky have looked like 4½ billion years ago ?",
    "author": "JackPiner-175",
    "date": 1681273858.0,
    "url": "https://www.reddit.com/r/askscience/comments/12j9yeb",
    "media_urls": [],
    "other_urls": [],
    "postText": "Obviously no one was around, but I always wondered if there were more stars ? How many more ?",
    "comments": [
        {
            "level": 0,
            "comment": "Hi!  This is somewhat impossible to answer, because stars in our Milky Way have moved around so much- it takes about 230 million years for the sun to orbit our Milky Way once, so we've done it ~20 times since 4.5 billion years ago.  That means all the stars near us then are long ago gone, though there are some astronomers looking to find our long lost siblings via a lot of orbital dynamics and astrochemistry (I actually wrote an article for Astronomy magazine at some point about this, [here!](https://astronomy.com/magazine/news/2020/07/the-suns-lost-siblings)).\n\nOne thing I *can* tell you is 4.5 billion years ago when the sun was young, we hadn't had time to drift too far from the home nebula where our sun and hundreds (perhaps thousands) of other stars were born.  We can actually see examples of what I'm talking about in our own night sky- most of the stars that make up the Big Dipper are actually part of the [Ursa Major moving group](https://en.wikipedia.org/wiki/Ursa_Major_moving_group), where the stars are all about 300 million years old and have moved about 80 light years from the home cluster/nebula region.  At 4.5 billion years old, though, probably a better example is the [Pleiades](https://en.wikipedia.org/wiki/Pleiades), where the stars are ~100 million years old and probably have another few hundred million years before they completely dissapate.\n\nSo, why do I bring this up?  Because our sun undoubtedly hung out with its own stellar siblings in the time period we are talking about, as it isn't enough time to dissipate- some would be bigger stars, some smaller, but there would unquestionably be a much more dense stellar neighborhood than what the Sun's area looks like today.  So what you'd see with your eyes are, indeed, more bright, young stars- how many is hard to say, but they would certainly dominate.\n\nHope this is helpful!",
            "score": 98,
            "author": "Andromeda321",
            "replies": [
                {
                    "level": 1,
                    "comment": "might we have been able to see any of the nebula itself? would there have been a haze filling the night sky? or would it have been too diffuse to see?",
                    "score": 10,
                    "author": "aggasalk"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not exactly where you were coming from, but 4.5 billion years ago, if you’re talking about the view from earth, the solar system was in the last stages of formation. The newly formed planets were still wreathed in the remains of the presolar nebula. The night sky would be aglow with the newly lit sun ionizing the nearby gas. The sky would be full of planetesimals and asteroids passing near by and entering the atmosphere in in firery trails. If you were viewing the sky at the right time, Jupiter might have been near enough to show a visible disk in the night sky. A fifth gas giant might also have been visible in the night sky, dancing with the other planets before getting ejected into the outer void",
            "score": 9,
            "author": "UnamedStreamNumber9"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 2,
                    "author": "[deleted]"
                }
            ]
        }
    ]
}