{
    "id": "12ti8sl",
    "score": 18,
    "title": "Does memorizing cause forgetfulness in other things?",
    "author": "Capri-SunGod",
    "date": 1682031655.0,
    "url": "https://www.reddit.com/r/askscience/comments/12ti8sl",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi. Real dumb question here, but I couldn’t really find a solid answer on the internet.\n\nSo specifically, I want to learn Japanese, but especially Kanji is brutal and I had this thought that if I were to memorize a couple thousand of those characters, I might start losing other information or even start to get forgetful? I fear that memorizing so much stuff might affect my memory in a bad way.\n\nIs this thought true at all? You can also direct me to some articles about this if you got any",
    "comments": [
        {
            "level": 0,
            "comment": "No specific articles come to mind, but my understanding from studying some cog. psych. courses and reading up on research is that human long term memory doesn't seem to have limits in a strict sense. So in general, you shouldn't worry that you will forget due to capacity being reached.\nAFAIK there are two main theories for forgetting - one is that it happens due to decay, other due to interference. Interference means that if you have some knowledge that is similar to what you are trying to learn e.g. Japanese, this old knowledge might be affected somewhat and be more difficult to recall sometimes. Or that this old knowledge can interfere with you trying to learn Japanese and make learning it more difficult. You can read up on intereference theory in psychology. In this sense, Japanese seems very different compared to Western languages, so it shouldn't be a problem. \nAnother thing is that learning languages might be special in some sense, but I believe this is usually true during developmental years in early childhood.",
            "score": 8,
            "author": "abd3fg",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much for the detailed explanation! I’m very curious to know more about the interference theory, I’ll definitely read up on it. \n\nWhat do you exactly mean that learning a language is special during early years and not as much later on though? Do you mean that as an adult you rewire your brain less effectively or something?",
                    "score": 2,
                    "author": "Capri-SunGod",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes, brain is more plastic when younger and is more amenable to some types of learning. It doesn't mean that you can't do it later, though, just some mechanisms seem to be more rigid when being older and it might take longer. But even here it might be interference in play - you have much more prewired knowledge already as you grow older.",
                            "score": 1,
                            "author": "abd3fg"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Interference is a concept that's been studied. [Here's](https://en.wikipedia.org/wiki/Interference_theory) the wiki.\nAn example of proactive interference is imagine if a friend wants to be called a different name. The next time you run into them, it'll be harder to remember their new name just because of the habit of using their previous name so many times. The old information proactively interferes with recalling the new. Retroactive interference is the opposite - like when you change addresses, the new address you memorize and use routinely will eventually worsen your ability to recall your old address -- most likely, anyway.\n\nWhat does cause forgetfulness is not using the information, or rather the opposite - [rehearsal increases recall-ability.](https://en.wikipedia.org/wiki/Memory_rehearsal) Think of your brain's connections like streets through a city. The major thoroughfares - the things you use constantly - have tons of lanes and are well paved. The things you rarely use are those rural side streets that few people if any have occasion to travel on, so they are small and 'forgotten' about.",
            "score": 5,
            "author": "dtmc",
            "replies": [
                {
                    "level": 1,
                    "comment": "a better analogy is walking in the wild. you discover new paths and the more often you use them, the more pronounced the trail becomes. but if you don't use a path for very long, the grass or whatever evens out and the trail becomes lost.",
                    "score": 2,
                    "author": "fuerdiesache",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "indeed",
                            "score": 1,
                            "author": "dtmc"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 4,
            "author": "[deleted]"
        }
    ]
}