{
    "id": "12wd2cd",
    "score": 2905,
    "title": "Do plants like lavender, rosemary, chrysanthemums, etc. actually work as just plants to repel insects?",
    "author": "PHealthy",
    "date": 1682262296.0,
    "url": "https://www.reddit.com/r/askscience/comments/12wd2cd",
    "media_urls": [],
    "other_urls": [],
    "postText": "To clarify, insect pests like mosquitoes.",
    "comments": [
        {
            "level": 0,
            "comment": "No, the plants do not naturally produce enough oils to mave a meaningful effect on repelling mosquitoes in an environment.\n\nhttps://malariajournal.biomedcentral.com/articles/10.1186/1475-2875-10-S1-S11 \n\nhttps://pubmed.ncbi.nlm.nih.gov/7707049/",
            "score": 1729,
            "author": "darwinn_69",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for the links, I found these going down your rabbithole:  \n\n&gt;The repellent activity of essential oils of lemon eucalyptus (Eucalyptus maculata citrodion), rue (Ruta chalepensis), oleoresin of pyrethrum (Chrysanthemum cinerariaefolium) and neem (Azadiracta indica) have been field tested as 40%, 50% and 75% solutions in coconut oil against populations of mosquitoes consisting mainly of Mansonia in Gambella, western Ethiopia. A latin square design was used to randomize the test subjects for possible individual differences for mosquito attraction. Repellency was evaluated as the percentage protection. Deet was included in the study for comparison. All the plant products manifested repellency. At 50% concentration at which the highest repellency was recorded the protection was 91.6%, 87.0%, 96.0%, 97.9% for rue, neem, pyrethrum and deet, respectively. The essential oil of lemon eucalyptus was not tried at this concentration. At a 40% concentration deet, lemon eucalyptus and pyrethrum were significantly (p &lt; 0.05) more effective than rue and neem. At a 50% concentration, deet and pyrethrum were significantly better (p &lt; 0.05) than rue and neem. At a 75% concentration concentration, deet and lemon eucalypus performed significantly better (p &lt; 0.05) than pyrethrum and neem. The difference between pyrethrum and neem was also significant (p &lt; 0.01).\n\n[https://pubmed.ncbi.nlm.nih.gov/12672146/](https://pubmed.ncbi.nlm.nih.gov/12672146/)\n\n&gt;MyggA Natural (Bioglan, Lund, Sweden) is a commercially available repellent against blood-feeding arthropods. It contains 30% of lemon-scented eucalyptus, Corymbia citriodora (Hook.) K. D. Hill &amp; L. A. S. Johnson (Myrtaceae), oil with a minimum of 50% p-menthane-3,8-diol. MyggA Natural also contains small amounts of the essential oils of lavender, Lavandula angustifolia Mill. (Lamiaceae), and geranium, Pelargonium graveolens L'Her. (Geraniaceae). In laboratory bioassays, MyggA Natural and C. citriodora oil exhibited 100% repellency against host-seeking nymphs of Ixodes ricinus (L.) (Acari: Ixodidae). Lavender oil and geranium oil, when diluted to 1% in 1,2-propanediol, had weak repellent activities on I. ricinus nymphs, but when diluted to 30% in 1,2-propanediol had 100% repellencies. 1,2-Propanediol (100%) had no significant repellent activity in comparison with that of the control. In field tests in tick-infested areas in central Sweden, tick repellency of MyggA Natural and C. citriodora oil was tested by the blanket-dragging technique for 4 d during a 6-d period. The repellencies (74 and 85%, respectively) on day 1 are similar (89%) to that of blankets treated in a similar manner with 19% diethyl-methyl-benzamide, based on previous work. Repellencies declined significantly from day 1 to day 6 (74 to 45% for MyggA Natural; 85 to 42% for C. citriodora oil).\n\nhttps://pubmed.ncbi.nlm.nih.gov/16892632/",
                    "score": 307,
                    "author": "PHealthy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Are you asking if the isolated, concentrated oil repels mosquitoes? Or if just having the plants around has the same effect? Growing a plant is not going to produce the same amount of oil nor is it going to deliver that oil into the air out the surrounding area.",
                            "score": 231,
                            "author": "HomeWasGood",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's exactly the point, these plants do not have anywhere near the effective concentration of oils needed to repel pests. Especially as simply naturally releasing volatiles.",
                                    "score": 218,
                                    "author": "PHealthy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Fun story. My buddy used a citronella plant in his tent camping to repel mosquitos. Appearnetly it worked, in a roundabout way. It appearently attracted a lot of spiders.",
                                            "score": 301,
                                            "author": "Efficiency-Then",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Reminds me of when we used to burn citronella candles when camping. The buckets containing the candles always had dead bugs in them. I assume the draw of the light was enough to overcome the effects of the citronella for a lot of bugs. It might still be a net plus of repelling mosquitos specifically,I don't know.",
                                                    "score": 61,
                                                    "author": "Suppafly",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Citronella candles don't repel mosquitos, there's a disclaimer on the lable of the off! Brand ones that even says so",
                                                            "score": 59,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "They do (or at least, working as intended, they do). The Off! disclaimer is legalese **\"Because this product is not EPA registered, these candles are not intended to repel mosquitos.\"**\n\nIn short, citronella is a pesticide under EPA rules (albeit quite a safe one), you are exempt from reregistering your product under what's probably a bunch of regulatory red tape if you don't claim it will control insects. It's kinda like how you can't sell crack pipes at the gas station but you can sell [Love Roses ;)](https://en.wikipedia.org/wiki/Love_rose)\n\nSee the 2nd thing under 'Regulatory History', then point 4, then the second thing down: [US EPA](https://www3.epa.gov/pesticides/chem_search/reg_actions/reregistration/fs_PC-021901_1-Feb-97.pdf)",
                                                                    "score": 17,
                                                                    "author": "kuhewa"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Yeah you’ll see a lot that even say citronella *scented* but don’t even have any citronella oil in them.",
                                                                    "score": 35,
                                                                    "author": "Breeze7206",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I think citronella scented is easier to word/ more appealing than 'candle containing 0.5% citronella oil' (which is the case for the Off! candle). The typical way to scent something citronella is with citronella oil, as is used as a food additive etc... unless you use isolated citronellol, citronellal, and/or geraniol, which would probably more expensive so what's the point.",
                                                                            "score": 4,
                                                                            "author": "kuhewa",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "It’s not a matter of “easier,” it’s legal. At least in the US, wording is everything. If it says “scented” look at the label and it’ll likely show there’s no citronella oil or a minuscule amount and boosted with fragrance to make it seems like a stronger candle. Also .5% is pretty normal for most citronella candles. You might find some that go a little higher.",
                                                                                    "score": 2,
                                                                                    "author": "Breeze7206",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "What are they even supposed to do then?",
                                                                    "score": 4,
                                                                    "author": "Suppafly"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "If you're willing to 'take the long way around,' you could try to bolster the ecology of the area with concerning pests in a way to attract their predators. Bats, birds, spiders... And the spiders will appreciate the cover and lure of a bushy lavender.",
                                            "score": 95,
                                            "author": "Van-garde",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yep, I get nice fat black widows in my lavender every year. I don't pick the lavender.",
                                                    "score": 54,
                                                    "author": "1nquiringMinds",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "You don't wanna be Spiderman?",
                                                            "score": 8,
                                                            "author": "DragonMiltton"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 4,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Blue dish soap and water in a mister works excellent for all types of insects!",
                                                    "score": 5,
                                                    "author": "Slapchop420"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "So you asked a question you knew the answer to?",
                                            "score": -99,
                                            "author": "PM_ME_STEAM_KEY_PLZ",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "They followed the link, learned something, and then continued the conversation. Does that somehow offend you?",
                                                    "score": 70,
                                                    "author": "keethraxmn"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "OP learned the answer after reading material provided to them at the root of this chain. After that they explained what they learned to someone else who asked a clarifying question.",
                                                    "score": 149,
                                                    "author": "RealisticMeddler"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Do you know how time works?",
                                                    "score": 54,
                                                    "author": "bigfatmuscles",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Wibbly wobbly ball of timey wimey... Stuff?",
                                                            "score": 5,
                                                            "author": "sirbissel"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The organic spray I use at our farm contains oils extracted from those plants (rosemary, eucalyptus, neem, etc) but simply planting these won’t work to repel pests; however, there is a technique called push-pull farming, where you do plant one plant which repel a pest away and from your crop and plant another which attracts them to it and away from your crop.  It just doesn’t include those plants.\n\nHere’s the wiki: https://en.m.wikipedia.org/wiki/Push–pull_agricultural_pest_management",
                            "score": 23,
                            "author": "Lylibean",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Wow! What an amazing concept! Is your farm located in Africa? I was wondering if the plant varieties would be the same in the US?",
                                    "score": 9,
                                    "author": "mcdeac",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Well it was developed in Kenya and seems like the wiki talks specifically about Maize and Sorghum. In Africa we eat a lot of Sorghum (as porridge and a drink), so there is a market for it, but I'm sure in the US even if no one knows what Sorghum is nor eats it, it could probably be used for animal feed. However, the cost/benefit might not be worth it, as we know Cargill and Monsanto will happily nuke corn with pesticides to avoid these issues anyway.\n\nThere are a few other relationships like this that I know of, and probably many many more still.\n\nCarrots and onions are often planted together because the onions deter the carrot fly, which can damage the carrots. The carrots can help break up soil and create channels for water to flow to the onion roots.\n\nGarlic can be planted around the base of roses to deter aphids and other pests. \n\nTomatoes and basil have a symbiotic relationship. The strong scent of basil repels tomato hornworms, which are a common pest for tomato plants, while also attracting beneficial insects like bees and butterflies that help to pollinate tomato flowers. On the flip side, the tomato plant secretes a chemical that can help to repel pests that may attack the basil plant.",
                                            "score": 8,
                                            "author": "Cruach",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Sorghum is growing in popularity as a grain for human consumption. It is also fairly popular as a feed crop.",
                                                    "score": 3,
                                                    "author": "Matt_Lauer_cansuckit",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Rightfully so, it's very nutritious. I ate Sorghum porridge every morning for years until I moved to Europe, but I can't find it for sale here so I've had to go back to oats.",
                                                            "score": 3,
                                                            "author": "Cruach"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "The wiki also talks about how the method is best used with locally sourced plants, suggesting anyone could use the method, you’d just plant different stuff depending on where you are.",
                                                    "score": 2,
                                                    "author": "DexLovesGames_DLG"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "The wiki also talks about how the method is best used with locally sourced plants, suggesting anyone could use the method, you’d just plant different stuff depending on where you are.",
                                                    "score": 1,
                                                    "author": "DexLovesGames_DLG"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "This is actually the one true power of essential oils: \n\nBug repellent. So many different kinds that do the trick.",
                            "score": 14,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 7,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "This is correct. But put them around the outside of your garden, crawling insects are deterred by the smell and as a bonus deer don't think much of them either.",
                    "score": 17,
                    "author": "seatheanswerman"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not if they're just sitting there, but there's some evidence that damaging the leaves of some of these plants (catnip and silvervine in the study below) increases their emission of insect-repellent compounds, definitely enough that they are effective repellents when the damaged leaves are rubbed on skin/fur, possibly enough that they may have some repellent effect on the area. \n\n(Not relevant to your question, but I find it fascinating that this may be the underlying reason for cats' compulsion to chew and then rub themselves on catnip - they are applying insect repellent to their fur)\n\nhttps://www.cell.com/iscience/fulltext/S2589-0042(22)00726-X",
            "score": 49,
            "author": "goosie7"
        },
        {
            "level": 0,
            "comment": "For mosquitoes, your bigger effect is gonna be standing water management, since that's your bigger predictor of general number of available mosquitoes to begin with, as well as what attracts mosquitoes looking for breeding ground. You have a bucket of nasty water, and repellent plants aren't going to help much at all.\n\nMany insects are repelled by various plant species because they spend their entire life cycles on or around plants, thus having high contact. I imagine that for mosquitoes, even with males feeding on pollen, they spend much less time in contact, instead being near water or on other surfaces. Without a high air concentration they're not going to be effected by deterrents.",
            "score": 315,
            "author": "MissNouveau",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 108,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is absolutely false. Empirical studies do not support partner cropping to repel specific pets, whether that's marigolds to keep bunnies and deer away, or rosemary to allegedly keep aphids away.\n\nThere's been like *a lot* of research into agriculture. It would be pretty much immediately taken up by farmers large and small if all you'd have to do is plant an herb near your cash crop and it really make an impact in preventing bugs.\n\nIt also doesn't even make sense. Plants basically only produce chemicals to try to fight the things that feed on them. They don't create a force field or create a chemical cloud so pervasive as to block the ability to detect tastier plants.",
                            "score": 27,
                            "author": "f3nnies",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I mean, it depends on the type of farming. In a large farm with hectares and hectares of a single crop, you'd need hectares of a partner crop to be effective, and this might make it the enterprise unprofitable. In a market garden you absolutely make use of partner relationships, where having thin rows of various different plants means you can attract an entire ecosystem of insects that sort of control and regulate each other. The same way a forest might work, where plant and animal diversity means there's never an opportunity for dominance by any single species.",
                                    "score": 3,
                                    "author": "Cruach"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Used coffee grounds in water features on your property will both prevent female mosquitos from laying eggs, as well as reduce viability of any larvae that do manage to hatch, according to [this study](https://parasitesandvectors.biomedcentral.com/articles/10.1186/s13071-015-0874-6)",
                    "score": 96,
                    "author": "RearEchelon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Makes sense given caffeine is a plant adaptation meant to kill insects",
                            "score": 20,
                            "author": "5ykes"
                        },
                        {
                            "level": 2,
                            "comment": "That study mentions the effects of caffeine in there a fair bit which reminded me of a PBS Eons video - [Why Does Caffeine Exist?](https://youtu.be/PzshAqowsyI) which gets into the how different plants made caffeine (coffee and citrus (which also has caffeine in it in small quantities) have a common ancestor of about 100M years).",
                            "score": 76,
                            "author": "shagieIsMe",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Love Eons, thanks for linking. Haven't watched this one",
                                    "score": 20,
                                    "author": "Receptor-Ligand"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You could also use Bti bacteria in the standing water to kill mosquito larvae. See [Bacillus thuringiensis israelensis on wikipedia](https://en.wikipedia.org/wiki/Bacillus_thuringiensis_israelensis)\n\nI use it to avoid blackflies in newly planted potted plants or  mosquitos in my lotus plant pond. These bacteria are available as powders or in water solutions.\n\nFun fact: parts of the genome of these bacteria is also used in genetically modified corn (bt-corn), which makes all corn cells produce the same poison as the bacteria.",
                    "score": 24,
                    "author": "ka0n",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "huh, I knew BT was effective against caterpillars, never thought to use it against mozzies.",
                            "score": 7,
                            "author": "Car-face",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "(Bt-i) – Bacillus thuringiensis var israelensis is the strain that kills mosquito, black fly, and fungus gnat larvae. One common commercial product made from BT-I are Mosquitoes dunks/bits.",
                                    "score": 9,
                                    "author": "travelswithcushion"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "There are mosquito repellent pellets that you can put anywhere water puddles…really helped reduce the mosquitos in my yard. I also planted a citronella plant.",
                    "score": 6,
                    "author": "Helechawagirl",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I used the pond pellets in my backyard as well because I have clay soil and the neighbor kept overwatering and flooding my yard.",
                            "score": 6,
                            "author": "mcdeac"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Do clogged rain gutters cause an increase in mosquito populations?",
                    "score": 1,
                    "author": "DexLovesGames_DLG"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not the plants themselves BUT the oils can have some efficacy for certain pests. I own a lavender farm and people constantly ask me if it is organic and I laugh. NOTHING eats lavender ( save for goats) but I NEVER EVER in years have had to worry about any insects. They hate it. The biggest concern I have is rot and fungus from inadequate drainage. So anecdotally I’m saying since the pests don’t like the plant it’s probably because of the terpenes and oil.",
            "score": 17,
            "author": "flaskman"
        },
        {
            "level": 0,
            "comment": "Catnip is very effective against one type of mosquito - thankfully it's the one in my area!\n\nI think the misconception is that the plants will deter them passively, they won't. You are supposed to put the repelling plants at doorways, the theory is that the scent stays on you when you walk past and rub yourself against it.\n\nThe only way catnip works for me is to grab a handful of stems and leaves, crush it up really well and rub it onto my skin.\n\n&amp;#x200B;\n\n\"The active component of catnip, nepetalactone, repels insects and is about ten times more effective at repelling mosquitoes than DEET, the compound used in most commercial insect repellents\" **source:** [https://www.sciencedaily.com/releases/2001/08/010828075659.htm](https://www.sciencedaily.com/releases/2001/08/010828075659.htm)",
            "score": 78,
            "author": "djdefenda",
            "replies": [
                {
                    "level": 1,
                    "comment": "Do you get the added bonus of cats approaching you?",
                    "score": 40,
                    "author": "petevertas"
                },
                {
                    "level": 1,
                    "comment": "Plus it'll have the bonus effect of cats wanting to come over to you for a fuss, win win.",
                    "score": 17,
                    "author": "MakingShitAwkward"
                },
                {
                    "level": 1,
                    "comment": "I'm willing to consider that nepetalactone could work against mosquitoes or even just a specific species of mosquito-- especially because directly applying an oil is going to be at way higher concentrations of compound than just having the plant near you. Even a ton of catnip near the patio isn't going to just blind mosquitoes tracking all people. But I do wonder if there's any mosquito research specialists that look at this methodology:\n\n&gt;Peterson put groups of 20 mosquitoes in a two-foot glass tube, half of which was treated with nepetalactone. After 10 minutes, only an average of 20 percent — about four mosquitoes — remained on the side of the tube treated with a high dose (1.0 percent) of the oil. In the low-dose test (0.1 percent) with nepetalactone, an average of 25 percent — five mosquitoes — stayed on the treated side. The same tests with DEET (diethyl-m-toluamide) resulted in approximately 40 percent to 45 percent — eight-nine mosquitoes — remaining on the treated side.\n\nThey're trying to test for a literal repellant, as in smells bad enough to make mosquitoes keep away, which is fine. But then comparing that to DEET is actually pretty deliberately misleading, because that's NOT how DEET works. DEET works by masking human scent, not by discouraging mosquitoes from being in the area. Mosquitoes will be all around you with DEET, but they won't be able to see you, you're basically scent camoflaged.\n\nBasically, nepetalactone being 10 times better than DEET at repelling doesn't mean it's good at repelling, because DEET doesn't repel mosquitoes that way anyway. Ten times a small number is still going to be small?",
                    "score": 5,
                    "author": "f3nnies",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You'd have to contact the authors to get deep into the details.\n\nPersonally, I beleive control situations in the lab aren't always a good representation of what happens in real-life, outdoors. \n\nWhat I can tell you for sure, anecdotally, is that I used catnip every day for 2 weeks until my plant was too stripped to keep harvesting it, on the 15th day I used aeroguard and I got bitten all over me.",
                            "score": 2,
                            "author": "djdefenda"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Most people don't have a silica-gel chromatograph in their garden so purified nepetalactone might be hard to come by.",
                    "score": 9,
                    "author": "PHealthy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I wonder...can I just rub some catnip on my fingers and then my neck and stuff? Before heading out? Dry or fresh?",
                            "score": 8,
                            "author": "Djaja",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's exactly what I said in my comment - take a handful of leaves and stem, crush it and grind it using your hands, and then vigorously apply to the skin. After an hour or so, apply more. \n\nI use all the leftover bits and put it in a wire cage on the back of my pedestal fan, and it worked well keeping the mosquitos away",
                                    "score": 9,
                                    "author": "djdefenda"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not the ones you mentioned.\n\nSome plants did evolve pesticides, some even evolved the same ones independently from each other (but from common precursors), like in case of caffeine. Caffeine is just one step away from a common chemical found in most plants, thus a lot of plants evolved in independently, and it fucks with insect brains. It fucks with our brains too, but it doesn't kill us",
            "score": 5,
            "author": "CallFromMargin"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 19,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "My question isn't about concentrated oils or chemical derivatives, but just the plants.",
                    "score": 27,
                    "author": "PHealthy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Just the plant, powdered chrisantemum was used as an ancient treatment for lice and other insects. Purified compounds work a lot better, obviously, but the plant itself still has a certain effect. It's how it protects itself from pests.",
                            "score": -5,
                            "author": "V0idL0rd",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The living, healthy, unmolested plant in a garden. That's my question.",
                                    "score": 29,
                                    "author": "PHealthy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "We planted several citronella around the backyard. Turns out it’s a nice shady plant for the mosquitoes to hide in when it’s hot. Brush up against it and they come out in a cloud. However if you pick the leaves and wad them up and rub the oils on your skin the mosquitoes will leave you alone.",
                                            "score": 9,
                                            "author": "pale_blue_problem"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": -6,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Do you have a source? Can you amend your top comment since it's not addressing the question?",
                                                    "score": 7,
                                                    "author": "PHealthy",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "They don't have one, because it's not true. The pyrethrin in the plant is not in large quantities and is not distributed from the plant.",
                                                            "score": 17,
                                                            "author": "Uhhhhh55"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Not sure we're really answering the question still. If chrysanthemums are planted in the yard will there be fewer mosquitoes.",
                                    "score": 12,
                                    "author": "Luxury-ghost",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Depends on how many there were to begin with and what else is present.  If you plant them around plants you want insects to avoid, they’re quite effective as they’re aromatic, meaning they release their poisonous oils into the air.  Insects will avoid that harsh environment if they have a better option elsewhere.\n\nIf you have a hyperventilating naked human standing in a yard ringed with chrysanthemums, you’re going to still be attracting most of the mosquitoes nearby.\n\nIf that naked person was lying in a bed of mums, having rubbed themselves in the flowers, you might get a few adventurous mosquitoes, but most would just look for something better.\n\nThis made me think… has anyone created a mosquito variation on a bug zapper?  Tricks them into thinking a surface is a food source when it’s actually high voltage?",
                                            "score": 6,
                                            "author": "Em_Adespoton",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 3,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Seems to me co2 plus an IR lamp, surrounded by an electrified mesh should do the trick, but maybe mosquitoes are too sensitive to electricity.\n\nSeems odd that nobody’s created an effective trap yet though.",
                                                            "score": 2,
                                                            "author": "Em_Adespoton",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[removed]",
                                                                    "score": 2,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Those seem to be targeting tiger mosquitoes only?  I live way too far north for albopictus.\n\nHere’s the varieties I’m trying to deal with:\n\nAedes aboriginis\nAedes aloponotum\nAedes campestris\nAedes canadensis\nAedes cataphylla\nAedes cinereus\nAedes communis\nAedes decticus\nAedes diantaeus\nAedes dorsalis\nAedes euedes\nAedes excrucians\nAedes fitchii\nAedes flavescens\nAedes hendersoni\nAedes hexodontus\nAedes impiger\nAedes implicatus\nAedes increpitus\nAedes intrudens\nAedes japonicus japonicus\nAedes mercurator\nAedes melanimon\nAedes nevadensis\nAedes nigripes\nAedes pionips\nAedes provocans\nAedes pullatus\nAedes punctor\nAedes riparius\nAedes schizopinax\nAedes sierrensis\nAedes spencerii spencerii\nAedes spencerii idahoensis\nAedes sticticus\nAedes togoi\nAedes vexans vexans\nAedes vexans nipponii\n\nAnopheles earlei\nAnopheles freeborni\nAnopheles punctipennis\n\nCulex pipiens\nCulex restuans\nCulex tarsalis\nCulex territans\n\nCuliseta alaskaensis\nCuliseta impatiens\nCuliseta incidens\nCuliseta inornata\nCuliseta minnesotae\nCuliseta morsitans\nCuliseta particeps\n\nCoquillettidia perturbans",
                                                                            "score": 2,
                                                                            "author": "Em_Adespoton"
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "In our experience it caught some but you're fighting an almost infinite supply outdoors. Plus attractants can just bring more in.",
                                                                    "score": 1,
                                                                    "author": "invalid_user_taken"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m hoping to see what different herbs and such will do with my garden this year since I’ve never paid attention to “companion planting” and the bugs have been crazy. On the flip side, our neighbors have horses and we have chickens and I just saw a damn mouse?/ rat? Yesterday so besides buying the traps and all that, I was reading that peppermint oil will repel mice, rats and other bugs, rodents. We shall see🤞🏼",
            "score": 4,
            "author": "c_orchid"
        },
        {
            "level": 0,
            "comment": "So then the solution is either some type of active management (chickens, bats, spiders, C02 attraction trap, pesticide, etc) or preemptive action like removing standing water sources. There really isn't some fully passive system that will deter or repel mosquitoes. :(",
            "score": 1,
            "author": "Autski"
        },
        {
            "level": 0,
            "comment": "Yes, several plants like lavender, rosemary, chrysanthemums, citronella grass, lemongrass, and mint have insect-repelling properties due to the presence of natural oils in their leaves, stems, and flowers. These oils act as natural insecticides and can help to repel mosquitoes, flies, fleas, and other insects from the surrounding area. However, the effectiveness of plants as insect repellents may vary depending on factors such as the location, climate, plant variety, and insect species.",
            "score": -2,
            "author": "elder_scrolls_fan"
        }
    ]
}