{
    "id": "12yekof",
    "score": 3136,
    "title": "Was the year and day duration the same back in the Jurassic Era?",
    "author": "jo53_100",
    "date": 1682416389.0,
    "url": "https://www.reddit.com/r/askscience/comments/12yekof",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "The day would have been around 30 mins-1hr shorter (as tidal interactions with the Moon have gradually slowed the Earth's rotation). The year has been fundamentally the same since the early days of the solar system.",
            "score": 3061,
            "author": "Unearthed_Arsecano",
            "replies": [
                {
                    "level": 1,
                    "comment": "One thing I always wondered was if this would have an effect on the climate—I would assume extreme temperatures would be somewhat moderated by a shorter day cycle. Is this amount enough to be noticeable?",
                    "score": 10,
                    "author": "LibertyLizard",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'd guess the same amount of energy would be received. But less fluctuation between high and low temps for a shorter cycle day.",
                            "score": 5,
                            "author": "DIYdoofus"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I assume you mean the year has always been roughly 365.25 * 24 hours, correct? So in earlier times there might have been more days in a year if each day was shorter.",
                    "score": 753,
                    "author": "slightly_offtopic",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They year has always (at least for the last ~4 billion years) been the same number of hours long, where you assume an hour is defined solely as 3,600 seconds and has no dependence on day length (as is the case in modern science).",
                            "score": 1290,
                            "author": "Unearthed_Arsecano",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "wow this blows my mind. so the orbit has been more or less completely stable since the earth was formed??\n\nedit: has the moon's orbit also been fixed since it was created?\n\nedit 2: I'm seeing confusing claims now, apparently the moon drifts away from the earth very slowly? Any reason why the earth wouldn't be doing the same with the sun?",
                                    "score": 253,
                                    "author": "hucchsuulemaga",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt; I'm seeing confusing claims now, apparently the moon drifts away from the earth very slowly? Any reason why the earth wouldn't be doing the same with the sun?\n\nThe Moon and Earth are closer together and the ratio of their masses is much smaller than that of the Sun and Earth. So the Moon can affect the Earth's rotation, and the Earth can affect the Moon's orbit, on a much shorter timescale than any significant changes to the Earth-Sun system would occur on.",
                                            "score": 59,
                                            "author": "RSkyhawk172",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Moon was like 2% closer too. It drifts away roughly as fast as your fingernail grows.",
                                            "score": 237,
                                            "author": "oswaldcopperpot",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Does this mean the tidal impact on the oceans was larger when the Moon was closer?",
                                                    "score": 42,
                                                    "author": "DoSomeTh1ng",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Well, gravity being dependent on distance (square of it, to be precise) would imply yes. But also, 2% distance change means that a 6' tide will change by a few inches, which won't be too dramatic.",
                                                            "score": 13,
                                                            "author": "Naturage"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 107,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Technically yes, but there exists no material strong enough to pull with sufficient force on the nails to move the moon. However if we pushed the moon away with massive rockets or other fantastical devices the nails would start to grow in a comical fashion",
                                                            "score": 44,
                                                            "author": "Littleme02",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "As fast as the average finger nail grows? Because my nails grow like crazy fast. I have to cut them like every five days.",
                                                    "score": 23,
                                                    "author": "stevesmittens",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "That’s why it’s an average. You are vastly out performing your peers. Well done mate!",
                                                            "score": 46,
                                                            "author": "tehnoodles",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Correct, it drifts out at the average human speed an average human fingernail grows: 0.73 meters/sec.\n\nApparently the /s was needed",
                                                            "score": -2,
                                                            "author": "Tarhish",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Maybe you should go to a doctor, 73 cm nail growth per second sounds quite spectacular! Imagine having to sleep outside, because your house was filling up with nail...🤣",
                                                                    "score": 50,
                                                                    "author": "IamTheJohn",
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "That's about half as fast as a human usually walks.\n\n0.73m/s=2.6km/h=1.6mph (rounded)\n\nAverage human walking speed is about 1.42m/s or 5km/h or 3mph\n\nSo if someone walked away from someone else and both point at each other, their nails would constantly touch...",
                                                                    "score": 5,
                                                                    "author": "Jofarin"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Your fingernails grow slowly — in fact, they grow about one tenth of an inch (2.5 millimeters) each month. Says Google.",
                                                                    "score": 5,
                                                                    "author": "FItzierpi",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "That is so counterintuitive! You would think being further down in Earth's gravity well would slow down the moon's velocity, not speed it up.  Wouldn't the moon need to be accelerating to get further away? Where does the extra delta-v come from? Tidal forces from the sun?",
                                                    "score": 7,
                                                    "author": "bl1eveucanfly",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Tidal forces from the earth actually. The earth spins faster than the moon orbits, so the tidal forces are dragging the moon around ~~faster~~ to a higher orbit and slowing the rotation of earth down. It’ll apparently reach equilibrium in around 50 billion years, with the earth day matching the lunar orbit period of 47 days.",
                                                            "score": 30,
                                                            "author": "ozzimark",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "&gt; It’ll apparently reach equilibrium in around 50 billion years,\n\nOur star is on the main sequence, so it's going to balloon up into a red giant a bit sooner than 50 billion years.",
                                                                    "score": 14,
                                                                    "author": "LeiningensAnts",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "15 billion is the estimate I heard.\n\nSupposedly the increasing heat output of the sun as it ages will cause the Earth to start slowly losing it's Oceans over several million years, turning  the Earth into a lifeless desert in something like 500 million years.",
                                                                            "score": 13,
                                                                            "author": "BCProgramming",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "500 million years? Source?",
                                                                                    "score": 6,
                                                                                    "author": "Tommy27",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "It's not deep enough into the gravity well to be pulled in. Except for that very rare balancing act, a spacial object is either moving away or toward another object. So, on that spectrum, the moon slowly moves away from the earth. That causes tides and rotation to change.",
                                                            "score": 3,
                                                            "author": "CassandraVindicated",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "It has nothing to do with how deep inside the gravity well the moon is. If earth and moon were pointlike particles, then as long as the moon's total energy is not too high, it would always stay in a stable orbit. \n\nThe fact that the moon's orbit changes hinges on it having a volume. Different parts of the moon would have different orbits around earth, in particular with different orbital periods, but they are all forced into the same orbit by the gravitational pull of all the neighboring moon particles. It's this interaction which changes the orbit over time. Though even here, the changing orbit tends towards a stable one which will be achieved at some point far in the future. And this does not depend on where exactly in the gravity well the moon starts (though every suitable starting configuration has its own stable orbit in the end).",
                                                                    "score": 1,
                                                                    "author": "Vercassivelaunos"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Yeah it has to be. The earth is very heavy, to dislodge it from it's orbit there would have to be a catastrophic impact or a sustained force pulling it in one direction for billions of years (there is no such thing). \n\nI think even when the moon was formed by collision with our twin planet the orbit was changed only a little since our twin pretty much had the same orbit.",
                                            "score": 121,
                                            "author": "Ulyks",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It doesn't have to be. There are dozens of other solar systems we have found where the planets have pulled on each other until they fell into an orbital resonance. \n\nAssuming no disruptions and the star lives long enough, this is the eventual state that every solar system will fall into. Our solar system is taking a long time because of how far apart the planets are compared to most other solar systems, although be aware there is a measurement bias making exoplanets close to their star easier to detect.\n\nExample:\n\nhttps://en.m.wikipedia.org/wiki/Gliese_876",
                                                    "score": 118,
                                                    "author": "CuppaJoe12",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Orbital resonance is the correct answer.. all planetary bodies affect gravitational baricenters. Orbital periods and positions do vary slightly over time with multi-body systems..",
                                                            "score": 25,
                                                            "author": "snow_traveler"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "You don't call other star systems \"solar systems\", since solar means the sun is associated with it\n\nEdit: I meant to say planetary systems not star systems",
                                                            "score": 12,
                                                            "author": "Logsha97",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I always forget to make the difference as in my native language there is no difference.",
                                                                    "score": 35,
                                                                    "author": "Kittelsen",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "English speaking people who aren't very familiar with space would not be able to tell either.",
                                                                            "score": 18,
                                                                            "author": "commiecomrade",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "It's almost as if in common definition it's a distinction without a difference.",
                                                                                    "score": 7,
                                                                                    "author": "xafimrev2"
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Interesting. Can I ask what language? And is there a word for 'of the sun'? What do you call solar power?",
                                                                            "score": 2,
                                                                            "author": "lloydthelloyd",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Norwegian. It's called solsystem, even our space agency says [solsystem](https://www.romsenter.no/no/Laer-om-rommet/Rom-for-barn/Du-store-verden/Melkeveien-vaart-hjem) for other star systems as well. You can call them stjernesystem( stjerne means star), but I've not heard it much in use. Solar power is called solkraft. Sol is sun. Of the sun? I dunno, use it in a sentence?",
                                                                                    "score": 5,
                                                                                    "author": "Kittelsen",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Interesting. Thank you for the clarification. \n\nAs a layman, a \"star system\" sounds like it would refer to multiple stars, not a star and exoplanets. Is there another term that is more clear? Exoplanet system?",
                                                                    "score": 13,
                                                                    "author": "CuppaJoe12",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Yeah either referred to as a planetary or exoplanetary system. \n\nStar system is definitely a collection of stars.",
                                                                            "score": 3,
                                                                            "author": "123rune20"
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Solar : relating to Sol, our Sun\n\nStellar: relating to *a* star or stars in general.\n\nThe phrase you want is '**stellar** systems' in English.",
                                                                            "score": 1,
                                                                            "author": "PlaidBastard",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "The Sun's name in English is... the Sun. Just as the Moon is the Moon, not \"Luna\".\n\n*Sol* is just the Latin name for it, but that's not official in any capacity. The IAU always prefers the native name in any particular language.",
                                                                                    "score": 3,
                                                                                    "author": "Ameisen",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I thought exoplanets technically weren't planets?",
                                                                    "score": 7,
                                                                    "author": "CuppaJoe12",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "An exoplanet is simply a planet that is orbiting a star other than Sol. Maybe you got that conflated with \"dwarf planets,\" which aren't technically planets?",
                                                                            "score": 14,
                                                                            "author": "sadsack_of_shit",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Astronomers are bad at  grammatical logic. They take a noun, as a modifier to it, and think that creates a new, exclusive category separate from the modified noun, which is not how the English language (or any other major language that I know of) works. Nobody thinks that a dirt road isn’t a road or a Christmas tree isn’t a tree.",
                                                                                    "score": 3,
                                                                                    "author": "craigiest",
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "They do not \"wander\" across the sky like the planets in our solar system do. I thought that was still part of the definition of a planet, but I looked it up and it is not.\n\nExoplanets are planets.",
                                                                                    "score": 4,
                                                                                    "author": "CuppaJoe12",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Did we have a twin planet?",
                                                    "score": 6,
                                                    "author": "New-Value4194",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Theia.\n\nThey’re referring to the Giant Impact Theory for the formation of the Moon.\n\nBasically a planet (named Theia after the mother of Selene the Titan of the Moon) approximately the size of Mars hit Earth very early in its history and the impact resulted in enough debris being ejected into space to form the Moon. Explaining how it has a similar geological make up AND is so hecking huge compared to its primary.\n\nWhich incidentally if true would be major points towards the “Rare Earth Hypothesis” as an answer to the Fermi Paradox.",
                                                            "score": 24,
                                                            "author": "SolomonBlack",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "If some how a star that had been ejected from a solar system came by our orbit or got captured by our sun that could throw us away \n\nI mean the chances of that are so minimal but ya know, interesting to think about",
                                                    "score": 2,
                                                    "author": "Slit23",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Oh yeah, a star or black hole going through our solar system could wreak havoc on everything.\n\nEven the sun itself could collide or be swallowed up.\n\nBut chances of that happening are indeed very very low since space is so big. \n\nYet another thing on the long list of anxieties, I suppose :-)",
                                                            "score": 2,
                                                            "author": "Ulyks"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Was the meteor that killed the dinos catastrophic enough?",
                                                    "score": 1,
                                                    "author": "Rxasaurus",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Earth's mass is about 6 x 10^(24) kg, and that impactor is estimated as something like 10^17 kg (with a wide interval, could also be 10^15 kg).  \nSo the mass ratio is about the same as that of a 0.01 gram - 1 gram object hitting a 10 ton (EDITED: originally said 10 000 ton) object.\n\nI dare say that it wouldn't have much of an impact (hah) on Earth's orbit.\n\nEDIT: Corrected, thanks! Funny how you can be off by a factor of thousand and still have the result be valid.",
                                                            "score": 71,
                                                            "author": "exscape",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "To put this into perspective for people who aren't good with numerical measurements, it's the equivalent of a raisin slamming into a semitruck.",
                                                                    "score": 59,
                                                                    "author": "valryuu",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Thank you for the visual metaphor.",
                                                                            "score": 11,
                                                                            "author": "nomnombubbles"
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Laden or unladen?",
                                                                            "score": 9,
                                                                            "author": "k20350",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "African or European?",
                                                                                    "score": 8,
                                                                                    "author": "goj1ra"
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "What's about the size of a raisin and hits semis on the regular...flies.",
                                                                            "score": 4,
                                                                            "author": "conventionistG",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "I was looking for mass, not size. Flies tend to have even less than 0.01 grams. They can also greatly vary in size/mass based on their species and variants. That's why I didn't use flies in the example.",
                                                                                    "score": 5,
                                                                                    "author": "valryuu",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "10^(15-17) kg compared to 10^(24) kg is the same mass ratio as a 0.01-1 gram object hitting a 10 ton object, not a 10,000 ton object.\n\nYour point still stands.",
                                                                    "score": 31,
                                                                    "author": "GloriousDawn",
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "That makes the asteroid ☄️ sound puny. I feel like I could take it on now",
                                                                    "score": 5,
                                                                    "author": "Slit23",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Joke suspected, but:\n\nEarth : Asteroid :: Asteroid : 10^7 of you by mass, give or take an order of magnitude.\n\nBasically you could fling a lump consisting of all living humans (I seem to recall a viral post that talked about putting us all into a 1km wide meatball) at such an asteroid and have about as much effect on its motion as the asteroid did on Earth's motion, i.e. none.\n\nLuckily there'd be no-one left to suffer the smell.",
                                                                            "score": 11,
                                                                            "author": "palordrolap"
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Lots of nice maths here and below on the relative masses of the meteor and the earth, but no mention of the relative velocity. \n\nSurely it's the momentum that the meteor imparts that's important, not just its mass. \n\n(It would have to be going pretty damn fast though)",
                                                                    "score": 3,
                                                                    "author": "rwtwm1",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "No not at all. \n\nIt was a catastrophe for life on earth of course but for the planet itself it was just a scratch.\n\nThe asteroid weighed approximately 300 thousand tons compared to 5.972 × 10^21 tons for earth.\n\nIn other words it was just 0.0000000000005 % of earths weight.",
                                                            "score": 32,
                                                            "author": "Ulyks",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Reminds me of how the oceans and mountains vary no more from the mean than the irregularities on the surface of a bowling ball, to scale.  It's hard to believe until you check the calculations.",
                                                                    "score": 14,
                                                                    "author": "frank_mania",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "This is a misconception based on the tolerance for diameter of a billiard ball, not the bumps/pits\n\nhttps://ourplnt.com/earth-smooth-billiard-ball/",
                                                                            "score": 13,
                                                                            "author": "crispy_stool",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "woah, good catch.  as someone put it: \"It's hard to believe until you check the calculations.\"",
                                                                                    "score": 5,
                                                                                    "author": "conventionistG"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "That’s crazy when you think the asteroid was bigger than Mount Everest but couldn’t come close to hurting the earth. Just life on earth. It’s like how the damage we’re doing to earth right now doesn’t actually hurt earth it just makes earth inhospitable for life \n\nWe could launch every nuke on earth and it may ruin life on earth but earth itself she’ll be just fine",
                                                                    "score": 7,
                                                                    "author": "Slit23",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Oh yeah, and the damage that we are doing also won't hurt life in general, plenty of species are going extinct but even warming the planet 4-6 degrees will still be very habitable for life in general.\n\nAnimals and plants will migrate and many more will go extinct but it's more due to the speed of change and some species getting trapped on mountains and such.\n\nA warmer earth possibly even has a higher carrying capacity for life, opening up antarctica for plant life.\n\nIt's just that it would take time and the weather would become much more extreme and unpredictable making agriculture impossible and by extension ending civilization entirely forever.\n\nWe would fall back to hunter gathering societies, never to rise again.\n\nA nuclear war would be similar. The radiation would be bad but the half time would steadily decrease that radiation and plant and animal life continues even in places like Chernobyl. \n\nA nuclear winter could perhaps trigger a new ice age? Not sure about that. Either way nothing, life on the planet hasn't seen before.\n\nIt will evolve and adapt like always.\n\nAs for the planet itself, we can't damage it, even if we try.",
                                                                            "score": 5,
                                                                            "author": "Ulyks"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "That meteor wasn’t especially big. It just hit in the exact right spot to create a cataclysm.  Had it hit in the middle of the ocean, it wouldn’t have been great, but it also wouldn’t have killed almost all life\n\n\nThe impact site having a combination of shallow water and rock with high levels of hydrocarbons led to a huge volume of gas and ash being released into the atmosphere and blocking out the sun for a few years.  Only like 10-15% of the earth surface had the right conditions to have lead to a mass extinction.",
                                                            "score": 21,
                                                            "author": "davdev",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "It still left the second biggest impact crater we have in the geological record after Vredefort. \n\nWe don’t actually have much selection for comparable impacts to Chicxulub within the time scale of complex life on Earth. Additional factors are definitely worth keeping in mind but it’s not like we have a bunch of other events that didn’t and need explanation. And least one other impact is suspected as the gunman in the ~~Devonian~~ *Ed: Eocene* event too.",
                                                                    "score": 5,
                                                                    "author": "SolomonBlack"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I don't know about other things people are saying here, but definitely meteor that would kill us all (or dinosaurs) wouldn't have to be big enough to make any impact on Earth's orbit.",
                                                            "score": 9,
                                                            "author": "MamoKupMiGlany",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "The meteor wasn't the thing that killed the dinosaurs. Apparently, it was that mixed with an environmental collapse or something I recently heard about.",
                                                                    "score": -1,
                                                                    "author": "Synchro_Shoukan",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Many magnitudes too small. The earth weighs somewhere in the neighbourhood of 175000000000 times as much as the meteor would have, which would be like you getting hit with something that weighs 0.0000004 grams.",
                                                            "score": 16,
                                                            "author": "Knows_all_secrets",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I know that the dynamics of the solar system were more varied very early on (as I recall Neptune and Uranus are thought to have initially been in significantly different orbits), and I'm not well versed enough in that area to speculate as to whether the Earth's orbit might have varied, but once the initial chaos of formation ended, Earth's orbit has not greatly changed. \n\nThe Moon's orbit however has significantly changed, by the same mechanism that causes the day to get longer. The Earth transfers energy from its rotation to the Moon via the tides, slowing itself down and pushing the Moon into a higher orbit.",
                                            "score": 11,
                                            "author": "Unearthed_Arsecano",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Does it? I thought that you couldnt apply this sort of laplaces demon to our solar system (to see it unwind) because of the non uniform velocities involved. Ie we only see the average speeds by clocking laps but never see the speedometer.",
                                            "score": 3,
                                            "author": "pinktwinkie",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "No you can very much do that. The issue is that for all most all many-bodied systems there's both no closed form solution, and the orbits are a chaotic system. However we can measure orbital velocities &amp; distances, and as a result the masses of major objects in the solar system fairly well, which allows us to do iterative calculations with the aid of computers.",
                                                    "score": 5,
                                                    "author": "half3clipse",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "To add to u/half3clipse's excellent answer, in general the [three-body problem](https://en.wikipedia.org/wiki/Three-body_problem) has no closed solution, so orbits tend to be chaotic when you have many interacting celestial bodies. However, in our solar system's case it helps that so much of the entire mass of the solar system is concentrated in the Sun (about [99.8% in fact](https://mobile.arc.nasa.gov/public/iexplore/missions/pages/solarsystem/sun.html).) Because the planets are also relatively far apart we can, to a reasonable first approximation, treat the orbit of each planet as a two-body problem of just that planet + the Sun, which does have a closed form and will be very stable over long periods of time.",
                                                    "score": 5,
                                                    "author": "-d-a-s-h-",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt; Any reason why the earth wouldn't be doing the same with the sun?\n\nThe Moon is 30 Earth diameters away from Earth, but Earth is 120 Sun diameters away from the Sun. Since tidal forces scale with distance^3, this makes Earth's tides on the sun much weaker than the Moon's tides on Earth.",
                                            "score": 3,
                                            "author": "gandraw",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "## Tidal Force and Tidal Locking\n\nWhen two celestial bodies are large and orbit close enough around each other (and love each other very much), their gravity can be strong enough to cause a tidal bulge. The part of each body facing the other is pulled more strongly by gravity than the past facing away because it is closer. As the bodies rotate, this bulge moves to the side a bit, but is still pulled by gravity toward the other body because it bulges out a little closer. This produces a torque against rotation and slows down the rotation. It also acts like a gravitational slingshot, speeding up the orbits around each other (energy transfers from axial rotation to orbital speed). However a lot of this energy is lost rather than transferred, used instead to mush the body around to cause the bulge and usually converted to heat. So it isn't a straight conservation of momentum equation.\n\nThe Moon has slowed its rotation so much it has stopped relative to the Earth. It is tidally locked. The Earth isn't tidally locked so it will continue having its rotation slowed by the Moon. It will also keep speeding up the Moon's orbit, causing the orbit to expand. \n\nTidal Locking can fail if the gravity is too small to make a tidal bulge of significance. It can fail if the rotational speed of the body is so fast, the bulge can't form or the rear bulge rotates around to reverse the torque (no molten core can cause these non-moving tides). Multi-body systems can also mess things up by making other bulges with reverse torques which is a big reason why the Earth-Moon system is less affected by the Sun while Mercury and Venus have had their rotation heavily slowed by the Sun.",
                                            "score": 3,
                                            "author": "CapinWinky",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 67,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 99,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 30,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 17,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[removed]",
                                                            "score": 14,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[removed]",
                                                                    "score": 10,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[removed]",
                                                                            "score": 3,
                                                                            "author": "[deleted]",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[removed]",
                                                                    "score": 7,
                                                                    "author": "[deleted]",
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[removed]",
                                                                    "score": 5,
                                                                    "author": "[deleted]",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 1,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "The year must be changing because the mass of the sun is changing?  I assume it's just too small for any reasonable sig figs?",
                                    "score": 2,
                                    "author": "MattAmoroso"
                                },
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": -20,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "No, the rate at which the earth orbits the sun is completely independent from rate it spins on its axis.\n\nThere would be more, but shorter days to compensate.",
                                            "score": 97,
                                            "author": "Sword_n_board"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "A year happens when the earth completes an orbit around the sun. That orbit is completely independent of how fast the earth is rotating.",
                                            "score": 38,
                                            "author": "Marsstriker"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Days have nothing to do with years.\n\nHow many times the earth rotates is not related to the earth making a full revolution around the sun. If the earth is rotating faster, the earth doesn't also magically speed up in its path around the sun.",
                                            "score": 25,
                                            "author": "Flyingcow93"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "No, there is no direct connection between days and years.\n\nA day is how long it takes a planet (the Earth in this case) to make a full rotation on its axis.\n\nA year is how long it takes a planet to make a full orbit around its star (the Sun for us).\n\nThere is no inherent connection between the two. An Earth-year currently happens to take around 365.25 Earth-days, which are around 24 hours long. (365.25 days per year) x (24 hours per day) = 8766 hours per year. The year hasn't really changed, so back in the Jurassic it was still ~8766 hours, but days were shorter (~23 hours per day). This means there would've instead been around 381 days per year then.",
                                            "score": 16,
                                            "author": "DonaldPShimoda",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "The year (orbital period) has the same number of hours as now 365*24 = 8760. But more days (rotational periods) fit into it 8760/23= 380.",
                                            "score": 8,
                                            "author": "Batmanpuncher",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "This is the best explanation. The year isn't shorter but the shorter days results in there being more of them in a year.",
                                                    "score": 2,
                                                    "author": "jwildman16"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "No. One is dependent on earth rotation. One is dependent on earth orbit around the sun.",
                                            "score": 2,
                                            "author": "ICEKAT"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "The year would still be 8765.76 hours long (365.25 days X 24 hours)\n\nBut if the day was an hour shorter that would mean you'd see 381.12 days in a year (counting actual days.)",
                                            "score": 2,
                                            "author": "Blackpaw8825"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "A lot of people jumped in to explain this, but I just want to say it's a really good question. Good on you for having the courage to ask about something you don't know.",
                                            "score": 2,
                                            "author": "areReady",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Doing the math based off your equation and then dividing by a shorter day (23 or 23.5 hrs), one could hypothesize that there was anywhere from 373 to 381 days in a Jurassic year.",
                            "score": 118,
                            "author": "hic_maneo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They are 2 different things. The length of time it takes the earth to complete an orbit around the sun is not directly tied to the number of rotations the earth itself makes. \n\nThe earth could be spinning twice as fast and it wouldn't necessarily take a different amount of time to orbit the sun. \n\nIt's a bit confusing because we tie the two things together (365.25 days in a year), but they really aren't that tightly related.  \n\nSo, having said that the days were shorter back in Jurassic times, doesn't mean that earth took \"more days\" to go around the sun. At least not by our current definition of a day/year.\n\nThe relationship  between a Jurrasic day and a Jurrasic year would have different definitions compared to today. The year would be very close to the same as today, but as noted earlier the days would have been a bit shorter.  \n\nSo, yes, the math would show that a Jurrasic Year had more Jurrasic Days than a modern year has modern days, but empirically the year would have been the same duration as it is today.",
                                    "score": 37,
                                    "author": "spitoon1",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Am I missing something? I would think they're very much related.  If the earth spins twice as fast there will be twice as many days in 1 orbit about the sun, i.e. there would 365\\*2 = 730 days of 12 hours each.",
                                            "score": 16,
                                            "author": "natterca",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "True. However, that wouldn't change how long it took the earth to orbit the sun.  \n\nIf your scale is the number of days, then yes, it took more days, but it takes the same ultimate duration.",
                                                    "score": -6,
                                                    "author": "spitoon1",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Nobody said it would change how long it would take the earth to orbit the sun. Take the correction.",
                                                            "score": 5,
                                                            "author": "gamboncorner"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "An interesting example of days and years not really being tied to one another is Mercury and Venus. One day on Mercury is two years, or half a day per year. Venus, on the other hand, has just shy of two days per year. \n\nA good comparison with Earth, though, is Mars, since the Martian day is only ~40 minutes longer than ours, but has 668 of them to a year.",
                                            "score": 39,
                                            "author": "VikingSlayer",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Can I subscribe to your solar system facts?",
                                                    "score": 13,
                                                    "author": "Poldi1"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Are those days defined as sunset to sunset or rotating completely irrespective of the sun",
                                                    "score": 2,
                                                    "author": "Margravos",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I'm assuming one complete rotation respective to starting location of rotation.",
                                                            "score": 2,
                                                            "author": "SpicyJw"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Are you familiar with what it might have been before Theia, based on the hypothesis that Earth collided with another planet to form the moon? Seems like that would have made a pretty big adjustment. I remember the axial tilt is possibility a result of this collision as well.",
                                    "score": 10,
                                    "author": "m1ndbl0wn",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Can we really know what the original Earth was like before the Theia impact made it basically Earth 2.0?",
                                            "score": 33,
                                            "author": "Pickle_Rick01",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "We kind of can infer some things as there are certainly constraints as to the nature of the impact. For example, we believe the Earth dynamo is in a subcritical state which means it can sustain its large scale field but it could not restart it if it was stopped. If it is sub critical now it must have always been sub critical and so must have existed at the time of impact. Any impact scenario that can not reproduce this must then be wrong. \n\nWe can play this same game with various other properties of the Earth-Moon system to apply more constraints on the nature of the impact.",
                                                    "score": 11,
                                                    "author": "dukesdj",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Yes, there are zircons that formed 4.5 billion years ago as the earth first started to cool. They have other elements trapped inside that tell us stuff about the earth then as well as give us stuff to use radio isotope dating on.",
                                                    "score": 4,
                                                    "author": "CyberneticPanda"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I would think those familiar with the simulations NASA ran were aware of the parameters of Earth 1.0 and Theia that were used to come up with Earth 2.0 and moon 1.0 that are currently in place",
                                                    "score": 4,
                                                    "author": "m1ndbl0wn",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It’s a really chaotic interaction and we can’t be sure how big each body was originally. You could simulate it but you have no way to know if your results are accurate.",
                                                            "score": 13,
                                                            "author": "Admiral_Dildozer",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Yea, at some point you're just trying to discover the properties of the simulation software, rather than the pre-impact Earth.",
                                                                    "score": 7,
                                                                    "author": "SkyPL"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The semi major axis of earth's orbit has remained largely the same for a few billion years.",
                            "score": 6,
                            "author": "RhesusFactor"
                        },
                        {
                            "level": 2,
                            "comment": "I believe by definition a year and a day have nothing to do with each other. A year is how long the planet takes to rotate around the sun, a day is how long it takes the planet to rotate 360 degrees on its axis. \n\nA day could be longer than a year, and I think we have observed some planets where this is true.\n\nSo what they are saying is the time the earth takes to rotate the sun has not changed, but its axis rotation speed has been slowing down for a long time and continues to do so, just very very slowly.",
                            "score": 4,
                            "author": "lutiana"
                        },
                        {
                            "level": 2,
                            "comment": "1.5 hors x 365 days /23.5 hours means there were about 23 more days in 1 year rotation?",
                            "score": 3,
                            "author": "guinader"
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": -1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If the earth spins on its axis more quickly, and spins around the sun at the same speed, then there are more axis rotations per solar rotation. I.e. more days per year.",
                                    "score": 13,
                                    "author": "Luxury-ghost"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Cool, there would have been more days in the year, but the year would still be the same. I could age at the same rate but get more days.",
                    "score": 9,
                    "author": "Boogy83",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "The Earth also gains about 100 tons of space dust/meteorites per day. The act of having to accelerate all of this extra weight to the current rotation speed, slows it down a bit.",
                    "score": 47,
                    "author": "SlickBlackCadillac",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 57,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That 5,200 number is picked just so it conveniently comes to 100 tons per week. Truth is that no one knows for sure what the daily average is, just that it is a lot!",
                                    "score": 29,
                                    "author": "SlickBlackCadillac"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Woah, a hundred _tons_, _a day??_ where is all this matter coming from?",
                            "score": 10,
                            "author": "TheOrigamiKid",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Litterally dust and tiny micro meteorites/ice comet shards\n\nSpace isnt empty, just mostly empty. And thenplanet is like a giant magnet.",
                                    "score": 31,
                                    "author": "JTibbs",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "That's amazing and totally new to me. Do you have a link to where I can learn more?",
                            "score": 5,
                            "author": "SUPE-snow",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "How did people figure that out? Did they just use current measurements of the rotation slowing down and figure out from there what it would have been when multiplied by that length of time?",
                    "score": 5,
                    "author": "bmbreath",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes, but also there are some finely bedded sediments that preserve tidal cycles. Since the moon's orbit was also changing, they can use the two rates to calculate a lot of things. I don't fully understand the math behind it, but it lines up with what we see presently happening.",
                            "score": 9,
                            "author": "mglyptostroboides"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;would have been around 30 mins-1hr shorter\n\nBut also more action packed.  So relativistically dinosaurs might have sensed that their days were longer because there was so much drama happening, with various flying dinosaurs constantly plotting to overthrow the King Rex and all his minions of evil.  Meanwhile under the sea there was a lot of sex happening all over the place, it was like a big ol disco flippers flapping every which way.  They all lived fast and furious!",
                    "score": 8,
                    "author": "elvesunited"
                },
                {
                    "level": 1,
                    "comment": "&gt;The year has been fundamentally the same since the early days of the solar system. \n\nSo it's not like the moon who is slightly moving away ?",
                    "score": 2,
                    "author": "topinanbour-rex",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Interesting about the year being the same length. My understanding was that orbits were chaotic in the long run— must be longer than 4 billion years I suppose",
                    "score": 1,
                    "author": "ThoughtBoner1"
                },
                {
                    "level": 1,
                    "comment": "Is there a way to verify that Earth's orbit and the length of a year have not changed in the past 200 million years?  Another star or rogue planet might get close enough to alter orbits.",
                    "score": 1,
                    "author": "hawkwings",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Made it through several top comments that didn’t really answer your question directly, going off into the weeds… all worth reading but some a little tangential and some just not concise or direct enough for me. So here goes, for the day length at least.\n\nDuring the Jurassic Era, roughly 200 million to 145 million years ago, a “day” as in one complet rotation of the Earth around its axis, would have been a bit shorter at around 23 hours, compared to the current average of 24 hours or 86,400 seconds (give or take a few milliseconds). The basic reason for the difference would be the moon’s orbit creating an *extremely* gradual braking force on the Earth’s rotation. This means we gain a tiny tiny fraction of a second to the length of the day each year, averaged out over *millennia.*\n\nAs for the year, well how are we counting? We just changed the length of a “day” so we need an unchanged unit for a reference point.\n\nWe established the day was shorter, which means subjectively the year, as in one complete orbit around the Sun, was more of those shorter days. That would make the Jurassic Year about 381 Jurassic Days.\n\nBut objectively, it probably took about the same number of *hours* to orbit the Sun, assuming all the other factors affecting the Earth’s orbit were roughly the same. But that’s getting beyond what I can say.",
            "score": 75,
            "author": "Sylvurphlame",
            "replies": [
                {
                    "level": 1,
                    "comment": "thank you!",
                    "score": 9,
                    "author": "jo53_100",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not quite, the moon acts kinda like a big but very slow brake. Days have infinitesimally been getting longer as the moon saps our angular momentum.\n\nOur period around the sun however should not have changed though",
            "score": 532,
            "author": "That_Guy_Frank",
            "replies": [
                {
                    "level": 1,
                    "comment": "Gven enough time, would the earths rotation eventually stop?",
                    "score": 104,
                    "author": "superbadonkey",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Given infinite time (or more precisely, tens of billions of years), the ultimate state of the Earth-Moon system would become completely tidally locked, such that the orbit of the Moon was the same length as a day (and the same length as the lunar day also). At this point, there'd be no more tides to transfer energy as the same part of the Earth always faces the Moon and vice-versa. \n\nThis is unlikely to happen as the Sun is likely to grow and consume the Earth long before then.\n\nEDIT: See /u/dukesdj below, the eventual tidal locking of the Earth to the Moon is only possible if you ignore the Sun's gravitational influence, and it's not fully accurate to say that there wouldn't be tides, just that they would no longer change/move.",
                            "score": 39,
                            "author": "Unearthed_Arsecano",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Certainly, it will scorch the Earth bare... but I don't think the Sun will quite make it to Earth's orbit before it starts to collapse down into a white dwarf.",
                                    "score": 8,
                                    "author": "shemjaza",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's not currently known for certain which will happen. I believe the current expectation [is in line with a scenario where the Earth is consumed by the Sun](https://arxiv.org/abs/0801.4031) but it's not utterly guaranteed. \n\nRegardless, it is quite definitely true that the dynamics of the Earth-Moon system would be disrupted by the Sun at this point and predicting their orbital interactions in isolation is pointless.",
                                            "score": 15,
                                            "author": "Unearthed_Arsecano",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "We might like to think we have another 4.5 billion years before we have to worry about earth being eaten by the sun, but really, in about 500 million years the sun's luminosity will have increased enough to boil away all the oceans.",
                                                    "score": 4,
                                                    "author": "alien_clown_ninja"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I don't think the Sun will disrupt orbital mechanics that greatly. It may get larger, but it is also getting less massive and less dense. The center of gravity won't change much and its pull can only get weaker overall.",
                                                    "score": 2,
                                                    "author": "Reniconix",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "As the Sun loses mass its gravitational potential gets shallower and causes an outward migration of any orbiting planets. Neglecting all other effects such as tides and just considering the Solar mass loss, the Earth will migrate from 1 AU to about 5AU between now to the end of the red giant phase. This would put us where Jupiter is.\n\nTides will counteract this and cause Earth to migrate inwards at a rate faster than the mass loss though. This was tenuously determined in the 90s when tides were accounted for. However, recent work suggests those estimates underestimated the rate of tidal migration.",
                                                            "score": 3,
                                                            "author": "dukesdj"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "This is not correct. The Moon becomes dynamically unstable at twice the Hill radius which is significantly closer than how far the Moon would have to migrate for the Earth to become tidally locked to it. There is no 3-body tidal equilibrium state for the Sun-Earth-Moon system.\n\nI would also note a subtlety here. When a system is tidally locked, or lets be even more strict and say in tidal equilibrium, tides still exist! It is simply that there is no longer a phase lag between the tidal forcing and the tidal response. As such no migration can occur as there is a symmetry in the tidal potential of the perturbed bodies which results in no net torque on either the spins or the orbits of either. But the tide still is there!",
                                    "score": 7,
                                    "author": "dukesdj",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt; This is unlikely to happen as the Sun is likely to grow and consume the Earth long before then.\n\nAnd long before that (in around 1 billion years), the tides will be greatly diminished by the runaway evaporation of the oceans caused by a relatively small increase in the sun's luminosity. The remaining tidal effects will be in the water vapor rich atmosphere and have minimal ongoing effects on the rotation of the planet and the orbit of the moon.\n\nBut since this event will also likely mean the end of the entire carbon cycle on earth, nobody will be around to care.",
                                    "score": 4,
                                    "author": "pbmonster",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Don't forget the tides in the earth itself. Land tides are not much smaller than mid-ocean tides now.  Tides at the coast are just bigger and more noticeable, especially in some locations, because the water is free to slop about in a way that the solid surface can't.",
                                            "score": 2,
                                            "author": "jaa101",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Oceanic tides are responsible for the vast majority of tidal dissipation (what determines the rate of tidal migration). The Earth tides contribute surprisingly little.",
                                                    "score": 3,
                                                    "author": "dukesdj",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "No, the Earth's rotation will not eventually stop. It will not become tidally locked to the sun. Given enough time, the Earth will become tidally locked to the Moon so only one side of the Earth will face the Moon, but still the Earth will continue to rotate.\n\nEdit: As some people have pointed out, this is not entirely accurate. I have ignored/assumed certain things for simplicity. For example, the aging Sun may disrupt the Earth/Moon long before the Earth can become tidally locked to the Moon. And if that doesn't happen, as the Moon drifts further away from Earth its orbit will eventually be disrupted by the gravitational influence of the Sun. And once that happens, the Earth will eventually become tidally locked to the remnants of the Sun. Even then, the Earth will still \"rotate\" at least in the sense that its rotation will synchronize with its orbit around the Sun.",
                            "score": 266,
                            "author": "omgwtfbbqgrass",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That would be quite cool. Countries in the future could advertise to tourists from the other side with \"come and see the weird round thing in our sky!\".",
                                    "score": 170,
                                    "author": "wj9eh",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "We are in a lot of trouble if humans in the distant future call the moon the weird round thing in the sky",
                                            "score": 323,
                                            "author": "big_duo3674",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I mean, there's an uncomfortably nonzero number of people who are convinced Earth is flat...",
                                                    "score": 82,
                                                    "author": "thatben",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I saw a short video the other day about a group of flat-earthers who set out to prove scientifically that the earth is flat.\n\nFirst, they bought a super precise tool that used lasers and gyroscopes. They were going to use it to show the earth doesn't rotate on it's axis. Except it showed that it was changing position by 15 degrees each hour, which it would do if it was on a rotating, round earth.\n\nThen they devised some kind of test with two walls with holes in them and placed them far enough apart that the curvature of the earth would change the angle you needed to aim the light to shine through both holes. And that's what happened.\n\nThey dismissed both results as erroneous because they didn't match the desired results.",
                                                            "score": 49,
                                                            "author": "Awdayshus",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Was it from \"Behind the Curve\"? They did a very similar experiment, and dismissed it because of like... \"heavenly aether\" or something like that lol",
                                                                    "score": 11,
                                                                    "author": "MauPow",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I could have been. What I saw was in short clips, either on the clock app or somewhere like r/whatcouldgowrong",
                                                                            "score": 2,
                                                                            "author": "Awdayshus"
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Thanks Bob! RIP.",
                                                                    "score": 3,
                                                                    "author": "Xyex"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I feel like now is the appropriate time to mention Idiocracy.\n\nhttps://en.m.wikipedia.org/wiki/Idiocracy\n\nIn the minds of men, anything is possible.",
                                                            "score": 17,
                                                            "author": "AndyManCan4",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I like how you linked to the wikipedia page of the movie as if it's some obscure philosophical tract.",
                                                                    "score": 8,
                                                                    "author": "Fireproofspider",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Sadly not. Our sun will die before Earth becomes tidally locked with the moon.",
                                            "score": 59,
                                            "author": "StefanL88",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Unfortunately, earth will be consumed by the sun in its Red Giant phase long before the earth becomes tidally locked to the moon. The moon’s tidal braking will take several billions of years to sap enough energy from earth’s orbit to “lock” earth, but the sun only has about one billion years left in its main sequence.",
                                            "score": 43,
                                            "author": "SpaceyCoffee",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "According to [this](https://theconversation.com/amp/the-sun-wont-die-for-5-billion-years-so-why-do-humans-have-only-1-billion-years-left-on-earth-37379) the sun won’t become a red giant until around 5 billion years from now, though it’s gradually becoming hotter so in about 1 billion years that will be enough to boil off our oceans.",
                                                    "score": 22,
                                                    "author": "hypnosifl",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I love how distressing we, creatures who live about 100 years, tops, find the prospect of something being *only* a billion years away.",
                                                    "score": 46,
                                                    "author": "iMissTheOldInternet",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Love the existential dread people get over the heat death of the universe",
                                                            "score": 12,
                                                            "author": "paecmaker",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "We are ridiculous creatures. 99% of our species’s existence, we’ve been grubbing in the dirt and chasing ungulates to exhaustion to survive. Then a few thousand years ago some people start scratching weird symbols in clay tablets and before you know it we’re launching rockets into space and spending all our time sitting in front of glass and plastic with electricity roaring through it and deeply worried that we’ll be forgotten when the lights go out in the universe.",
                                                                    "score": 21,
                                                                    "author": "iMissTheOldInternet"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Well human minds arent especially good at comprehending big numbers. \n\nAnd I think it’s more about the fact that things we think are absolutely permanent are not at all. Someone posted a link on reddit a couple months ago that had a long long timeline of all the things that will eventually happen, like Hawaii disappearing underwater and continents completely reshaping and the heat death of the universe. It really messes with your mind to think that something like Hawaii just wont even exist at a certain point",
                                                            "score": 29,
                                                            "author": "RickTitus",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Yeah, I know, but it’s strange watching it in action. Like, Hawaii is a good example. On a geologic time scale, it’s absolutely transitory. But on a human time scale, it is very much permanent. It will be around for tens of millions of years. Humanity, as a species, hasn’t yet made it half a million years. A *thousand* years ago is an unfathomably long time for humanity. But we are still somehow capable of worrying about things a thousand thousand thousand years off. It’s just peculiar.",
                                                                    "score": 19,
                                                                    "author": "iMissTheOldInternet",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Honestly we see it playing out in an even more compressed fashion in the American west where it is likely stretches of California and other states were settled when the region was going through on of it's wettest phases and now the impermanence of fresh water is biting people in the ass.",
                                                                            "score": 14,
                                                                            "author": "Isord"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Given how short a time period we’ve been on this planet, it’s hard to imagine that we’ll be fossils long before anything significant occurs geologically or astronomically. \n\nThe one that really cooks my noodle is, low power radio was about 120 years ago and significant high power radio blasted at space was about 65 years ago. That’s not even a drop in the bucket of life on this planet. Further will some alien life containing planet be at the stage where they’re listening to space radios for our broadcasts when our signals reach their planet? And by the time it does, and they send a signal back will we still exist?",
                                                            "score": 7,
                                                            "author": "Pizza_Low",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "It seems highly unlikely to me that our communication radio waves will be sufficiently coherent to be interpreted by beings in another star system. Space is, radiologically, a pretty noisy place, and even on earth those radio waves were hardly perfect fidelity.\n\nI’ve also read that the first significant television broadcast was of the 1936 Olympics, and specifically Hitler opening the games. It’s an interesting thought experiment, imagining a spaceship a few light-decades away catching the grand diesel punk opera that is the 20th century. Imagine the first season of a show being World War 2. On the other hand, without our proximity to it, would it even be interesting to watch?\n\nOn any kind of significant timeline, I’m increasingly having trouble believing we’ll still be around. The Anthropocene, to the extent it is ever known by intelligent life after us, will likely be thought of primarily as the weird layer of the geologic record where radioactivity jumps a bit, right at that thin smear of micro plastics that nearly uniformly covered the planet for the blink of a geologic eye.",
                                                                    "score": 4,
                                                                    "author": "iMissTheOldInternet",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Assuming some alien space ship is able to pick up a reasonably clean analog broadcast signal of either tv or radio and decode it, I’d think their astronomers and archaeologists would be interested in learning about our culture. Especially if they are advanced enough to have crewed space craft.\n\nBut life on this planet has been around for about 3.7 billion years. Of that, as a planet, we’ve only been broadcasting on our presence for about 120 years. Maybe a little more if you include noise from thinks like power lines and transformers. So most likely some life containing alien planet will also be in some low tech stage or a very remote possibility of being very advanced.\n\nOur broadcasts I think would be noticeable on a radio telescope even if the signal has degraded to just static.",
                                                                            "score": 3,
                                                                            "author": "Pizza_Low"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I remember as a kid watching space documentaries and being terrified of the Andromeda Galaxy crashing into the Milky Way",
                                                            "score": 4,
                                                            "author": "MapaRaccoon"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Can you suggest a book, not textbook, that goes into detail about stars?",
                                                    "score": 1,
                                                    "author": "ChepaukPitch"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "..that would actually make a space elevator way more practical. \n\n...but if humanity doesn't already have one by then, we are probably extinct.",
                                            "score": 14,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "One of the problems with a space elevator is that you need a material that can support it's own weight over an enormous distance. Connecting to the moon instead of a closer artificial satellite actually makes it less practical.\n\n(Even though some parts of the elevator will be effectively weightless on the way to the moon, a very long part of it won't be)",
                                                    "score": 21,
                                                    "author": "StefanL88",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Not to mention that the moon’s orbit is elliptical. So the material would have to be able to stretch Or have a great big fishing reel reeling in the excess.",
                                                            "score": 15,
                                                            "author": "duplicitea",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Space elevators don’t go to the moon. Just low orbit. \nThat thing would have to be nearly a quarter million miles long.",
                                                    "score": 8,
                                                    "author": "Admiral_Dildozer",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt; Space elevators don’t go to the moon. Just low orbit.\n\nSpace elevators have to reach to beyond geosynchronous orbit which by today's standards is a very high orbit, though still about ten times closer than the moon.",
                                                            "score": 9,
                                                            "author": "jaa101",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "You say that, but go look at the fall of the bronze age empires.  The ability to read and write was lost in some places.",
                                            "score": 2,
                                            "author": "youknow99"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Where then would the axis of rotation be? Somewhere between the two bodies, proportioned by their masses?",
                                    "score": 9,
                                    "author": "itriedidied",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The axis is still inside the earth, but you are right it is not at the centre.",
                                            "score": 23,
                                            "author": "supra728"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Yes the center of mass of the Earth-Moon system would be between the two bodies. Even now the center of mass of the Earth-Moon system is far from the Earth's center, but still within the Earth.",
                                            "score": 7,
                                            "author": "omgwtfbbqgrass",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "By way of contrast, Pluto and its largest moon Charon orbit around a center of mass outside both objects. The other four known moons of Pluto all orbit around this point in space.",
                                                    "score": 4,
                                                    "author": "oneAUaway"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "The same place as it is now; at the centre of gravity of the Earth-Moon system.",
                                            "score": 4,
                                            "author": "wasmic",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "One caveat: the moon is stealing our rotational angular momentum and using it to raise its orbit.   I don’t know the actual result but it’s theoretically possible for our center of mass to migrate outside the surface of the earth",
                                                    "score": 3,
                                                    "author": "actuallyserious650",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I feel like the moon isn't big enough for that to happen, could be wrong though.\n\nCheck out Pluto/Charon for a system with the centre of mass in the void of space",
                                                            "score": 2,
                                                            "author": "consider-the-carrots",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "The earth would still rotate even if it became tidally locked with the sun; however, its rotation rate would synchronize with its orbit around the sun. So it would result in one rotation of the earth for each revolution around the sun.\n\nTidal locking involves one side of an object constantly facing the body it orbits. So for the earth to cease rotating, the sun-facing side of the earth would need to change slowly through the year.\n\nBut honestly, its imposible for an object in the universe to completely stop rotating, since there's always a larger body to orbit and it is all just frames of reference anyways.",
                                    "score": 19,
                                    "author": "rockingmonkey"
                                },
                                {
                                    "level": 3,
                                    "comment": "Actually no! If you neglect the evolution of the bodies in question and just consider the 3 body problem including tides then what happens is the Moon migrates outwards until about twice the Hill radius where the influence of the Sun becomes important. At this point the Moons orbit becomes dynamically unstable and would eventually be stripped from the Earth. After this point the dominant influence on the Earth would be the Sun and hence it would tidally lock to the Sun. Keep running time forward and eventually the Sun would also tidally lock to the Earth and you would have a complete tidal equilibrium. Where did the Moon go? Either into the Sun, into the Earth, or out of the system.",
                                    "score": 4,
                                    "author": "dukesdj"
                                },
                                {
                                    "level": 3,
                                    "comment": "I'm pretty sure this is wrong. I've learned that by the time earth would be tidally locked to the moon, the moon will already long have escaped Earth's gravitational domination, as in it will no longer be Earth's moon before mutual tidal locking.",
                                    "score": 2,
                                    "author": "xThefo",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "This is correct. Once the Moon gets to twice the hill radius it will become dynamically unstable due to the influence of the Suns gravitational potential. As such the Earth can not tidally lock to the Moon before it is stripped.",
                                            "score": 8,
                                            "author": "dukesdj"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "No; instead, the Earth and Moon will tidally lock so that the same sides of each are always facing one another.",
                            "score": 6,
                            "author": "Snoofleglax",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "As the moon saps the Earth's angular momentum, what does *it* gain?  Longer revolution periods around the earth?",
                    "score": 4,
                    "author": "gameshot911",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It gains angular momentum. \n\nEarth is currently tugging on the moon to move faster (and vice versa), so the net effect is one speeds up and one slows down until they're both tidally locked and stop trying to change each-other.",
                            "score": 2,
                            "author": "TheSoCalled",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "So the moon is slowly revolving around the earth with greater velocity, reducing its orbital period?",
                                    "score": 2,
                                    "author": "gameshot911",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yep, the moon is speeding up as it slows the earth down, so the moon takes less time to do a full orbit (in hours).\n\nThe speed of the earth's rotation and the speed of the moon are getting closer together over time, so eventually the moon does one orbit per 'day'... because days are longer, and the moon is faster. If you looked up then, the moon would appear stationary above one part of the earth so wouldn't *appear* to orbit at all.",
                                            "score": 2,
                                            "author": "TheSoCalled"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Is the change in length of day split equally between extra daylight and extra nighttime hours? Maybe it's a dumb question, but we don't have 12 hours of sun and 12 hours of dark (in most places) so I wanted to ask if we are getting  slightly more sunlight and slightly more sleep, but less of it",
                    "score": 2,
                    "author": "Internet_Adventurer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The number of hours of daylight is more about the angle that the earth is 'tilted' as it spins on its axis.   The earth's axis isn't straight up and down, it's actually off at an angle of 23 degrees. \n\nWhen we're on one side of the sun, that tilt points the bottom of the earth more directly at the sun (24hrs daylight in Antarctica), but if you move the earth to the other side of the sun and leave the tilt the same, now the top is pointing more directly at the sun (24hrs daylight in the arctic).  \n\nSo days get longer and shorter in an annual cycle as the tilted earth moves around the sun. It's the same reason the sun doesn't go directly above you when it moves from east to west each day, it follows an arc that changes depending on the time of year and your location because really you're standing on a tilted ball. 😉 \n\nLonger days caused by the moon slowing the Earth down aren't changing the tilt (as far as I know), and so days and nights will get longer by the same amount on average.... like normal, you'll just see more of them summer than in winter.",
                            "score": 2,
                            "author": "TheSoCalled"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It depends on how you count a day and how you count a year. Also the earth accelerates and decelerates around a middle area where sometimes the sun exists and sometimes the point the earth is moving around actually is just an empty point in space. It is very complicated. If you want a direct comparison like as if you instantly transported 200 million years into the past you'd find an Earth that had an orbit of 385 days around the sun and 23 hours of day/night cycle from rotation on our own planetary axis. Also the moon would be a lot closer to earth. The moon at its formation was 15,000–20,000 miles away, as opposed to the current average distance of 238,000 miles. Anyways, this all leaves a very complicated sticky mess that can simply be explained by an equation by someone smarter than myself instead of actually using unchangeable/static numbers. Since it's not as simple as day/night and orbital angular momentum.",
            "score": 15,
            "author": "CryptographerPerfect"
        },
        {
            "level": 0,
            "comment": "From what I understand after reading some comments is the time it took the earth to complete its orbit around the sun is roughly the same as it is now. The details of the terra-lunar system were different but its relationship to the sun has not changed, unless there were some interloping bodies whose evidence and effects are lost to the dirt.",
            "score": 4,
            "author": "Ocudomus"
        },
        {
            "level": 0,
            "comment": "&gt;Was the year and day duration the same back in the Jurassic Era?\n\nYes, and no.\n\nBy definition, a day is 86400 seconds and the second is fixed at 9,192,631,770 cycles of the radiation produced by the transition between two levels of the cesium-133 atom.  Similarly, a year is 31.56 megaseconds.  So, yes.  These durations were the same in the Jurassic as they are now.\n\nHowever, if you're defining a day as the duration of the rotation of the Earth, and a year as the duration of the Earth's orbit, then no, they were different back in the Jurassic era.  Both the day and the year were probably shorter.  Tidal effects slowly bleed off energy by converting movements in the oceans and crust into friction and heat, which would radiate away into space.\n\nOh, and let's not forget a certain impact with a rather sizable chunk of interplanetary debris.  That would have thrown a bit of sand into the orbital mechanics.",
            "score": 3,
            "author": "The_camperdave",
            "replies": []
        }
    ]
}