{
    "id": "136jsg8",
    "score": 24,
    "title": "How does cellular ion channels let the proper ion through ?",
    "author": "Vanry7",
    "date": 1683118596.0,
    "url": "https://www.reddit.com/r/askscience/comments/136jsg8",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello there, basically the title.\n\nWhy do ion channels in cells (mainly referring to sodium and potassium ones) manage to be selective for the proper metallic ion  ?\n\nI'm a chemist quite educated in bio, I would appreciate a detailed the answer. Sources to go further would be lovely too !",
    "comments": [
        {
            "level": 0,
            "comment": "This is an area of research that has been pretty well studied. In fact multiple crystal structures of ion channel's-particularly potassium channels have been resolved which include the capture of ions in transit through the channel. This revealed which amino acids were involved in that thansit and importantly the role of water as a hydration shell around each ion which provides the size component for ion selectivity. \nFor detailed explanations the primary literature is rife with examples. Search for \"selectivity filters.\" \nAnother level of selectivity is the permeability ratio each channel has for different ions. Potassium channels can conduct other ions including sodium, but the permeability is sufficiently slow that when is potassium is around it preferentially passes through. In controlled research settings where the ions around a channel can be controlled 100% you can measure this differential in permeability.",
            "score": 6,
            "author": "CharlesOSmith"
        },
        {
            "level": 0,
            "comment": "It's easy to exclude larger ions by simply making the channel narrower. The cool thing is, ions that are smaller can also be excluded by accounting for the hydration shell.\n\nFor example, there's the potassium channel with a narrowest diameter of about 3Å. That allows a potassium ion in, only if it abandons its water molecules (K+ diameter is about 2.66Å). But it can still pass through because it makes equivalent interactions with amino acids along that narrow stretch. A sodium ion is smaller (1.9Å), but it still can't bring a water molecule along (that complex is still too large). And because it's smaller, it can't properly interact with enough of the amino acids along the narrow channel, making it energetically unfavorable to go there.",
            "score": 2,
            "author": "CrateDane",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is exactly how it was explained to me during my undergrad, except my professor left out the hydration she'll aspect. This makes much more sense than the residue gap having the selectivity of a difference in diameter of a single valence shell",
                    "score": 1,
                    "author": "ScienceIsSexy420"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The selectivity of ion channels is mainly due to the presence of specific amino acid residues lining the channel pore. These residues form a filter that allows only certain ions to pass through while excluding others. The exact composition and geometry of this filter vary among different ion channels, leading to their distinct selectivity profiles.\r  \n\r  \nFor example, the selectivity filter of potassium channels is lined by four carbonyl oxygen atoms from the backbone of the protein, which form a narrow and highly electronegative pore. This pore allows for the passage of K+ ions, but not Na+ ions, which are too small to interact with all four carbonyls simultaneously. In contrast, the selectivity filter of sodium channels contains a ring of negatively charged glutamate residues, which interact specifically with Na+ ions but exclude K+ ions.\r  \n\r  \nThe selectivity of ion channels is not only determined by the properties of the filter residues but also by the surrounding environment. The hydration shell of metal ions plays a critical role in their selectivity, as ions need to shed their hydration shell to pass through the narrow pore. The hydration shell of Na+ ions is more tightly bound than that of K+ ions, which makes it more difficult for Na+ ions to lose their water molecules and pass through the filter.",
            "score": 2,
            "author": "Dramatic_Discount287"
        },
        {
            "level": 0,
            "comment": "Talking about ion channels not pores, channels work by lock-key and rotation to transfer ions. \nSelectivity of  ions comes from 1) Sizing down channel to  ion size 2) Exhibiting similiar ionic opposite charge\n3) Most important is %Affinity, calcium channels has 100 times more affinity for calcium than sodium becaus of specific amino acids like aspartate , alanine for sodium\n\n\nElactrostatic and Chemical affinity worls in a way eg one molecule has affinity for two different molecules but more for one specific \n\n\n**Eg- a channel is activated by certain stimuli chemical like for example only in presence of exces of calcium some certaim substance are released that bind to and activate the transporte or bind to channel and reduce its size or is already binded to channel and stimuli will cause it to release widening the pore. Once channel or transporter are active  Furthur movement is gradient controlled.  Its natural that if there is higher Calcium ions then potassium to achieve equilibrium excess ones  here calcium will force pass through channel**\n\nEg. In a room 10 people are sitting properly. Now 50 more people are introduced and due to lack of chairs forced to stand in room. When the door is opned and and people are allwed to pass outside group of those exceas people who were standing will pass first while already comfortable sitting one will pass late or will stay as it is. Similiary when calcium ions concentraction increases it initiate a stimuli that activates ca selective channel and excess group that is calcium will pass first until equikibrium is achieved",
            "score": 1,
            "author": "Kong_Don"
        }
    ]
}