{
    "id": "13k3hd1",
    "score": 85,
    "title": "By le chatlier's principle, if hair bleaching is an exothermic reaction, why do hair salons use heat lamps to \"speed up\" the process?",
    "author": "CountYourCarbons",
    "date": 1684333997.0,
    "url": "https://www.reddit.com/r/askscience/comments/13k3hd1",
    "media_urls": [],
    "other_urls": [],
    "postText": "Cosmetology to chemistry pls\n\nEdit: thanks yall s/o to irreversible reactions",
    "comments": [
        {
            "level": 0,
            "comment": "Le chateliers principle is applied to reversible reactions in order to control the yield of a reversible reaction. Disturbing the system in favourable ways changes the proportions of reactants and products within the system that is in equilibrium. Le Chateliers principle does not depend on the rate of reaction(forwards and backwards). So in some reactions, there is a trade-off between achieving a desirable yield and an optimal rate of reaction(one that doesn’t take forever for equilibrium to be established).",
            "score": 58,
            "author": "Solitari1607"
        },
        {
            "level": 0,
            "comment": "First, Le Chateliers principle doesn't apply here as this is not an equilibrium reaction.\n\nSecond, Le Chateliers principle is a way of predicing relative changes in molecular concentrations based on changes to the Gibbs free energy, but provides no information about how rapidly those changes will occur.\n\nYou are incorrectly applying the prediction that adding heat to an equilbrium reaction will push it in the endothermic direction.",
            "score": 14,
            "author": "toodlesandpoodles"
        },
        {
            "level": 0,
            "comment": "Temperature affects both the rate of a reaction and the equilibrium point. Higher temperatures frequently increase the rate of a reaction regardless of what side of the equilibrium the system is on. So long as the rise in temperature doesn’t cross the equilibrium point of the system you’re likely to get an overall speed up with higher temperature in an exothermic reaction.\n\nA similar trade off with le chateliers principle happens in the Haber process, which is an industrial reaction used to make ammonia. The reaction itself is exothermic, but the Haber process goes faster at higher temperatures due to the increased rate of energetic molecular interactions.",
            "score": 64,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Hair bleaching isn't a reversible reaction, most of the products are radical propogation using hydrogen peroxide.  The radicals oxidize organic components and melanin, which results in lighter coloured hair. The higher heat lowers the activation energy, and speeds the reaction.  \n\n&amp;#x200B;\n\nSmaller upward energy hill due to increased energy in rxn conditions before a large downward hill.",
            "score": 21,
            "author": "metalgrizzlycannon"
        },
        {
            "level": 0,
            "comment": "For the same reason you generally need a heat source to start a fire. It's an exothermic reaction, but the reaction rate at room temperature can be too slow to wait for it. Raising the temperature generally speeds up all reactions. An endothermic reaction will be sped up slightly more, but there are many cases where this reverse reaction is completely irrelevant in the temperature range we consider.",
            "score": 8,
            "author": "mfb-"
        }
    ]
}