{
    "id": "13xpk1w",
    "score": 41,
    "title": "What happens in the brain when someone gets migraine aura?",
    "author": "takuhi",
    "date": 1685644679.0,
    "url": "https://www.reddit.com/r/askscience/comments/13xpk1w",
    "media_urls": [],
    "other_urls": [],
    "postText": "As far as I’m aware migraine aura isn’t caused by anything physical in the eyes. What’s actually happening in the brain to cause the aura? Is it somehow reflected in some disruption or pattern in the visual cortex?",
    "comments": [
        {
            "level": 0,
            "comment": "at least in the case of the classic visual aura, where you see a scintillating pattern slowly moving out into peripheral vision, followed by a deep scotoma, the aura is almost certainly something called \"cortical spreading depression\" in primary visual cortex.\n\nhttps://en.wikipedia.org/wiki/Cortical_spreading_depression\n\nbasically, starting somewhere in the foveal confluence (a twisty part of visual cortex where several visual areas converge), something happens to produce a wave of very high neural activity that lasts for several seconds, followed by deep suppression that lasts for several minutes. the wave moves at ~3mm per minute, so it takes ~20 minutes to traverse the entire primary visual cortex.\n\nsome have hypothesized that this CSD is not just correlated with but somehow causal in some types of migraine - the CSD produces biochemical waste or other sorts of imbalance that sifts through that hemisphere (maybe just through CS fluid) and irritates the trigeminal nerve (which is why the side of the aura typically is the same side the headache will be on).\n\nyears ago I recorded many of my own auras (they stopped long ago) and fit a simple cortical wave model to them. [it was pretty neat! you can read some of my journals, with figures, here:] (https://xuexixs.blogspot.com/search/label/migraine?updated-max=2012-08-16T15:24:00-04:00&amp;max-results=20&amp;start=32&amp;by-date=false)",
            "score": 31,
            "author": "aggasalk",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for the piece of information I didn’t even know I needed. Do you think that if we assume that it’s irritating for trigeminal nerve, we could somehow alleviate it? Massage or cold, or both?",
                    "score": 2,
                    "author": "Fenek673",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "i'm sorry, but that i can't say. i'm a vision scientist, not a headache/pain scientist. my headaches are/were never severe, a regular-strength ibuprofen usually does the job..",
                            "score": 1,
                            "author": "aggasalk",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks regardless! I’ll experiment a bit on my own",
                                    "score": 1,
                                    "author": "Fenek673"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is so helpful. I look forward to reading all of it. Thank you!",
                    "score": 1,
                    "author": "White_Lobster"
                },
                {
                    "level": 1,
                    "comment": "&gt; something happens to produce a wave of very high neural activity\n\nDo you have insight what that is? I had a hard time finding it on wiki.",
                    "score": 1,
                    "author": "LimeyLassen",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "not really, i think it's still very mysterious. the typical location where the wave starts is near the margin of primary visual cortex (V1) in the foveal confluence. this is a very distinct and complicated bit of cortex. it's also especially tortuous in terms of the gyri (cortical folds) there. it could be that this makes blood flow there more susceptible to small vasospasms that might set off the spreading depression. But as I said it's pretty mysterious still. Migraine aura are very difficult to capture in the lab.",
                            "score": 1,
                            "author": "aggasalk"
                        }
                    ]
                }
            ]
        }
    ]
}