{
    "id": "143yu7e",
    "score": 25,
    "title": "How is the expansion rate of the universe derived from the CMB?",
    "author": "EverAccelerating",
    "date": 1686197415.0,
    "url": "https://www.reddit.com/r/askscience/comments/143yu7e",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’ve been fascinated by the Hubble Tension, and I know there are two primary avenues towards deriving this value (though I’m aware of other newer methods such as using gravitational waves). The first — involving measuring distances &amp; velocities via standard candles like Cephied Variables and Type 1a supernovae — is intuitive and readily understandable by a layman like me. But I never see any details on how the expansion rate is calculated from the other primary method, that of examining the Cosmic Microwave Background.\n\nIs there an intuitive not-too-technical way of explaining how the value is found via the CMB?",
    "comments": [
        {
            "level": 0,
            "comment": "In general relativity, there are a set of equations called the FLRW metric. This describes how the universe would expand if it were a uniform soup at cosmological scales. However, it is not specific to what kind of soup the universe is; so you can apply FLRW if the universe is entirely made of matter, or entirely made of radiation, or entirely made of dark matter, or some combination thereof. The 'discovery' of dark energy came when we realized that none of our observations matched any of our FLRW calculations unless we assumed that the universe had a significant amount of dark energy.\n\nWhen we observe the CMB, we notice that it is very very smooth, but there are some rough spots. We call that the CMB anisotropy. The size and properties of the roughness are themselves affected by the make-up of the universe. We can use FLRW and play around with the parameters until we get a model universe where the roughness of the CMB is consistent with what we observe. We then use those parameters to calculate what the Hubble constant should be today.\n\nIf you want an analogy, observing galaxies is like watching a car race and measuring its lap time. Observing the CMB lets us examine the engine etc. in enough detail that we should be able to calculate the cars lap time.",
            "score": 10,
            "author": "superbob201",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;If you want an analogy, observing galaxies is like watching a car race and measuring its lap time. Observing the CMB lets us examine the engine etc. in enough detail that we should be able to calculate the cars lap time.\n\nI just want to say:  great analogy!  And that each method serves as a good independent test of the other; it is important that both ways of determining the lap time closely agree — it confirms for us both that our stopwatches are accurate, and that our mechanical understanding of the engine's design is sound.",
                    "score": 6,
                    "author": "forte2718"
                }
            ]
        }
    ]
}