{
    "id": "146fivl",
    "score": 452,
    "title": "Why is nitrogen an inert gas such a potent substance of all of our explosives? Nitro glycerin is a nitrate of glycerin, nitrocellulose is a nitrate of cellulose and TNT is a nitrate of toulenue?",
    "author": "H5N1BirdFlu",
    "date": 1686442726.0,
    "url": "https://www.reddit.com/r/askscience/comments/146fivl",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Nitrogen doesn't like bonding with other molecules, and it takes a lot of energy to get it to do so.  And when it is made to bond to other things, it wants to be free, and when it gets free all that energy comes back out again.  [This is blog has other examples of what happens when you bind nitrogen with other things](https://www.science.org/content/blog-post/things-i-won-t-work-hexanitrohexaazaisowurtzitane)",
            "score": 594,
            "author": "Cyanopicacooki",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is also why we make so much nitrogen fertilizer.  It doesn't occur much in nature, some bacteria can produce it such as in clover root nodules.\n\nEdit: I'm referring to bound, accessible, nitrogen in nature",
                    "score": 118,
                    "author": "_AlreadyTaken_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I would instead describe \\*how important it is in nature\\*  \n\n\nIt does occur a lot and doing so is essential to life (making DNA and protein). But there are only a few pathways through which gaseous nitrogen is fixed. Otherwise, organisims use nitrogen that has already been fixed (nitrates in the soil, proteins from other organisms, decaying matter, etc.).",
                            "score": 7,
                            "author": "Helios4242"
                        },
                        {
                            "level": 2,
                            "comment": "Not that I'm arguing something I don't know much about, but . . .        \n&gt; [nitrogen] doesn't occur much in nature      \n        \n . . . it's the most abundant gas in our atmosphere. Can you expand on your statement? Things aren't adding up.",
                            "score": 16,
                            "author": "Noble_Flatulence",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They mean \"nitrogen that is a part of molecules other than N2\". Lots of plants need nitrogen, but they are incapable of extracting it from the air because it's hard to get the N2 to turn into something else.",
                                    "score": 92,
                                    "author": "Shufflepants"
                                },
                                {
                                    "level": 3,
                                    "comment": "Nitrogen compounds, nitrogen bonded with anything other another nitrogen, are rare by some standards.",
                                    "score": 20,
                                    "author": "sirblastalot"
                                },
                                {
                                    "level": 3,
                                    "comment": "Nitrogen in the form that plants need (nitrate, NO3-, nitrogen + 3 oxygens + an extra electron; or ammonium, NH4+, nitrogen + 4 hydrogens - an electron) isn't abundant in soils. Nitrogen-fixing bacteria can take in atmospheric bacteria and produce these \"fixed\" nitrogen compounds. But plants themselves can't do that. Fun fact - lightning strikes can also fix nitrogen (because the lightning bolt provides the massive amounts of energy for N2 molecules to split), which is why you'll hear gardeners say that a spring thunderstorm is good for the garden - the storm produces a small amount of free fertilizer.",
                                    "score": 26,
                                    "author": "etcpt"
                                },
                                {
                                    "level": 3,
                                    "comment": "Most plants can't absorb nitrogen gas out of the air. Instead, they need nitrogen containing compounds in the soil. \n\nThose nitrogen-containing compounds (nitrates, ammonia etc) are what's relatively rare.",
                                    "score": 11,
                                    "author": "Some1-Somewhere"
                                },
                                {
                                    "level": 3,
                                    "comment": "They specified \"nitrogen fertilizer\", which is ammonium nitrate. Ammonium nitrate does not occur in large quantities in nature. It is predominantly made by adding nitric acid to ammonia (produced from the Haber-Bosch Process). Edited to clarify synthesis.",
                                    "score": 4,
                                    "author": "HoldMyBeerMustPetDog"
                                },
                                {
                                    "level": 3,
                                    "comment": "Nitrogen that's able to be absorbed isn't readily found in nature, it needs to be converted to a form that can be absorbed. Nitrogen bonds very strongly to itself in a triple-bond, but there are bacteria that can process it into a soluble and absorbable form",
                                    "score": 5,
                                    "author": "NovaVix"
                                },
                                {
                                    "level": 3,
                                    "comment": "Seems like they're saying BOUND nitrogen doesn't occur often. Not nitrogen in general.",
                                    "score": 3,
                                    "author": "Peanutor15"
                                },
                                {
                                    "level": 3,
                                    "comment": "Your mistake was that the word you inserted into their sentence was the wrong word. Sometimes when something isn't adding up, best thing to do is to reread what you just read.",
                                    "score": -1,
                                    "author": "Jemima_Snuggleduck"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It's in every DNA nucleotide, every RNA nucleotide and every amino acid though...",
                            "score": 1,
                            "author": "lapsangoose"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Saw this and thought :  “This will be a link to Chemicals I Won’t Work With. “\n\nWas not disappointed.",
                    "score": 15,
                    "author": "daisypusherrests"
                },
                {
                    "level": 1,
                    "comment": "Thank you all for great answers",
                    "score": 28,
                    "author": "H5N1BirdFlu",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I want to add a note that nobody's actually covered in any of these answers. The reason it's so potent of an explosive is that the density of the explosive as a solid is many, many times higher than when those compounds react to become a gas. The explosive reaction is what converts these molecules to a gas, and once they're in gaseous form they undergo further entropy, wanting to move from an area of high pressure to an area of low pressure. The rate at which this reaction occurs in the explosive dictates just HOW explosive it is as well, this is why different explosives are used for different purposes (and why there's a distinction between high and low explosives, it's based on this reaction rate). For context, one gram of TNT produces 1 liter of gas. 1 liter of volume, for context, is the volume that 1000 grams of water takes up, so the expansion ratio for TNT is 1:1000. Now imagine a bomb with 500,000g (500kg) of TNT, which is a common bomb yield for air dropped warheads (it's the 1000lb bomb class for those unfamiliar with metric). That bomb almost immediately produces 500 million liters of gas in a space that only takes 500 liters of explosive. For context, an Olympic swimming pool is only 2.5 million liters. If I misplaced a decimal anywhere someone feel free to let me know, but I think I got it all right since I checked everything twice lol.\n\nTNT isn't as commonly used today as it used to be, but it's still a gold standard explosive that is used as the high explosive to which all others are compared in explosive yield, which is why I picked it to do the math with. Also its expansion ratio is a nice whole round number, so the math is easy lol",
                            "score": 11,
                            "author": "Faxon",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; and once they're in gaseous form they undergo further entropy\n\nEntropy is a state variable, not a process something can undergo, but I think the intended meaning is: The compressive stiffness of a gas is approximately equal to its pressure, proportional to the temperature and amount and inversely proportional to the confining volume; for entropic reasons, gases tend to expand to match the surrounding pressure.",
                                    "score": 3,
                                    "author": "Chemomechanics"
                                },
                                {
                                    "level": 3,
                                    "comment": "Very informative thank you",
                                    "score": 1,
                                    "author": "H5N1BirdFlu"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thank you for reminding me of my favorite chemistry blog (technically blog section: Things I Won't Work With)! It is also the only chemistry blog I like/know of but it's so good.\n\nI know my favorite molecule's name because of this blog: FOOF! It sounds so cute and goes so boom, apparently. :3",
                    "score": 21,
                    "author": "angelicism",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "When I worked at a University - in an Arts faculty - I showed that blog to a professor - I could hear his laughter from 5 doors down the corridor.  I still go back and read bits from time to time.",
                            "score": 12,
                            "author": "Cyanopicacooki"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "What makes it bond to other things? What is that “energy” that makes it bond?",
                    "score": 2,
                    "author": "-Narme-",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Nitrogen has very strong bonds to itself. You need to break those before it can form some other compound.\n\nLightning strikes are the main natural source of \"fixed\" nitrogen. We use really high temperature and pressure reactions with platinum catalyst to do it artificially.\n\nSome bacteria can do it using special enzymes in an atmosphere without oxygen, and some plants create little environments for those bacteria in their root nodules.",
                            "score": 9,
                            "author": "Kandiru"
                        },
                        {
                            "level": 2,
                            "comment": "Usually heat and/or pressure, but if other atoms/molecules have a high ionic charge or a hungry valence shell to goose their reactive potential along Nitrogen likes them more.",
                            "score": 2,
                            "author": "Bumblemeister"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "In other words, precisely because nitrogen gas is so stable, is also why it packs so much energy in other forms.",
                    "score": 2,
                    "author": "CanadaJack",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Nitrogen isn't a noble gas. It will work with plenty of things, it just isn't always happy about it.",
                                    "score": 3,
                                    "author": "NetworkLlama"
                                },
                                {
                                    "level": 3,
                                    "comment": "Helium mixed with a bit of nitrogen, both in their inert forms, can form a condensate that's as explosive as conventional explosives and was considered a possibility for rocket propellants, but that's not actually a separate compound per se.",
                                    "score": 2,
                                    "author": "CanadaJack"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "So Nitrogen is the introvert of the molecules huh??",
                    "score": 4,
                    "author": "OSUfirebird18",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well...it does enjoy being with its own kind in a less exciting arrangement (N2). But lots of folks really like having it around and if you treat it right and put some effort in it can be really energetic! \n\nIt's nowhere near as sociable as Carbon or even Oxygen (let's be honest, those two will link up with ANYTHING). So it's trying, but it very much enjoys returning to its safe space to rest up and it takes some coaxing to play around with others again.\n\nSo yeah, it's an introvert.",
                            "score": 14,
                            "author": "Bumblemeister",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "So Nitrogen is those type of supremacist that will have explosive relationship with anything other than itself, got  it!\n\n/s",
                                    "score": 1,
                                    "author": "Sherinz89"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The short answer is that Nitrogen has a strong energy incentive to be bound only to itself with a triple bond as N≡N - so any compound that contains nitrogen is generally going to be less stable than one that does not. \n\nThe reason that Nitrogen gas is so inert is because of the strength of the N≡N bond. It takes a large amount of energy to break this bond, and because its so easily reformed it takes very little energy for a compound to shed any Nitrogen by comparison.\n\nFor a particularly extreme example, have a look at Nitrogen Tri-Iodide, and generally any compound with an Azide group is also going to be hideously keen to detonate.\n\nEdit: For a particularly humorous introduction to 'energetic compound' chemistry, which almost always includes Nitrogen, have a read of Derek Lowe's 'Things I Won't Work With' blog: https://www.science.org/topic/blog-category/things-i-wont-work-with. I particularly recommend the one about Hexanitrohexaazaisowurtzitane (aka CL-20)",
            "score": 159,
            "author": "asteconn",
            "replies": [
                {
                    "level": 1,
                    "comment": "Just a slight elaboration, not all compoundsk with an azide are explosive. There is a general rule of thumb (calculator online somewhere) that rates likelihood of explosivity against the percent of nitrogen atoms in your molecule. If you have a big organic molecule with one azide group chances are fairly low that it will ever detonate unless maybe you really force it to",
                    "score": 20,
                    "author": "saganmypants"
                },
                {
                    "level": 1,
                    "comment": "So, in other words, Nitrogen is the ultimate narcissist? Ready to blow everything up to smithereens at the slightest opportunity it gets. Because how dare you stuff it in a tiny cage with all those lowly carbons and/or hydrogens? Nitrogen's electrons were never meant to be stolen by some graphite peasants. To suggest that Nitrogen should enter in a bond with anything but itself is an outrage of explosive proportions!",
                    "score": 5,
                    "author": "ExpStealer"
                }
            ]
        },
        {
            "level": 0,
            "comment": "As the other comments mentioned diatomic nitrogen is an energetically very favorable state. \n\nAdditionally explosives make use of another property of nitrogen compounds.\nEvery proper explosive starts out as either a solid or liquid and decomposes into several particles of gas per particle of explosive. Now gas occupies a much higher volume per mol than solids or liquids (for example solid TNT has a molar volume of about 0,13 l/mol while an ideal gas has 22,4 l/mol) and this \"explosive\" volume change is one of the main causes of the pressure wave. Nitrogen compounds usually straight up completely decompose into diatomic nitrogen, while hydrogen and carbon compounds might go through subreactions first or even need atmospheric oxygen, reducing the net increase of gas molecules. Especially carbon compounds have a tendency to require atmospheric oxygen and do incomplete oxidations, resulting in soothe.\n\nSo nitrogenbonds are used in explosives both because  they store large amounts of energy and because they guarantee a net gain in gas molecules.",
            "score": 22,
            "author": "Balthasar-Hohenheim",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nitrates and nitramines also have some intermediate products in all sorts of nitrogen-oxygen compounds. And quite sophisticated decomposition pathways. One can see this nicely in the beirut explosion where large amounts of red fumes from NO2 were liberated.",
                    "score": 6,
                    "author": "AmmoniumDinitramide",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "True the reaction pathway of nitrogen are among the most complex and fascinating of the main group elements.\n\n  In my anorganic chemistry \"Vordiplom\" (roughly the halfeway point of the old German diploma system) my professor allowed me to choose the starting question and I was able to \"cheese\" the exam by choosing the nitrogen pathway from industrial fixation to fertilizer production as this question covered everything we had done so far.\n\nYou are right that under oxygen rich (fertilizer explosion) or high energy (lightning strike) conditions nitrogen-oxygen compounds are formed. Though since may of those are still gases that isn't really a problem for explosives. In Beirut there probably wasn't enough stuff for the large amount of excess oxygen to react to as the fertilizer was already a high oxygen content nitrogen-oxygen compound.",
                            "score": 2,
                            "author": "Balthasar-Hohenheim"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's at least partly *because* nitrogen gas is so inert. Its bonding energy is so low, that when nitrogen in other forms besides N2 (with much higher bonding energy) undergo a chemical reaction and form N2, the difference in bonding energy that's released by the reaction is generally very large.",
            "score": 41,
            "author": "gipp"
        },
        {
            "level": 0,
            "comment": "When an explosion occurs that contains nitrogen and the bonds between the nitrogen and other elements are broken the nitrogen pairs with other nitrogen creating triple bonds. When bonds are formed they create a release of energy. When triple bonds are formed they release a lot of energy. Therefore explosives that contain nitrogen will release a great deal of energy as the nitrogen atoms come together to create the diatomic N2 gas. Additional oxygen and carbon will also create H2O and CO2 that when the explosion takes place which also releases energy from the formation of their bonds.",
            "score": 22,
            "author": "BrumLeaves"
        },
        {
            "level": 0,
            "comment": "The nitrogen in nitrate is bonded to oxygen, N2 is two nitrogens triple bonded together - a much more stable arrangement. Breaking the N-O bonds and forming nitrogen-nitrogen triple bonds releases a lot of energy, hence bang.",
            "score": 4,
            "author": "PD_31"
        },
        {
            "level": 0,
            "comment": "I want to point out that the element that exists in one particular molecule is not indicative of the reactivity,  toxicity, or chemical properties of another molecules containing the same element.\n\nSodium fluoride strengthens teeth.  Whereas hydrochloric acid is poison.\n\nSodium chloride is table salt (dissolves in water). Whereas Sodium metal catches on fire if it gets wet.\n\nI guess I just would just never ask the question, why n2 is inert and other n containing compounds are explosive.(or the same of some other element)",
            "score": 0,
            "author": "Azor88",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;Sodium fluoride strengthens teeth. Whereas hydrochloric acid is poison.\n\nDid you mean hydrofluoric acid? Otherwise these two have no common element.",
                    "score": 3,
                    "author": "the_fungible_man"
                }
            ]
        },
        {
            "level": 0,
            "comment": "All things in nature have a sort of state they wanna end up in. Things that are high up wanna fall down. \n\nWhen they get there, they really wanna stay there, and it takes effort and energy to change them from that resting place. Things that have fallen take time and effort to go back up, and won't magically float on their own.\n\nAs it turns out, \"down\" for nitrogen is being nitrogen just chilling out with itself. \"Up\" for nitrogen is when it sticks to anything else. It can, but it doesn't really like it, and it'll take the first possible opportunity to \"fall\" back into being nitrogen with itself again. N(triplebond)N is like a ball at the bottom of a smooth valley, while TNT is like a smooth metal ball balancing on a half-done jenga tower, 30 floors tall, in windy conditions. It wants to fall, and the ball wants to stay down.",
            "score": 0,
            "author": "IlliteratePig",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks!",
                    "score": 1,
                    "author": "H5N1BirdFlu"
                }
            ]
        }
    ]
}