{
    "id": "6c3t0s",
    "score": 21354,
    "title": "If each day is only 23h56m4s, over the course of 4 years, we accumulate 95.7 hours of unaccounted time when approximating each day to 24 hours. We give ourselves one extra day in February, which accounts for only 24 hours of that extra time, but where does that extra 71.7 hours go?",
    "author": "fornoggg",
    "date": 1495202494.0,
    "url": "https://www.reddit.com/r/askscience/comments/6c3t0s",
    "media_urls": [],
    "other_urls": [],
    "postText": "This also means that our calendar should shift over 3 days every 4 years, changing the \"location\" of the seasons in our man made calendar\n\nEdit: Thanks for the responses everyone, I understand it totally now. My students ask me this question every year when I teach the unit on Earth and space and every year a student asks me this, so this year I'm getting the jump on them and doing my research before they inevitably ask me. Its difficult to quench the curiosity of kids, now only to anticipate what they're follow up question Will be...",
    "comments": [
        {
            "level": 0,
            "comment": "It sounds like you're confusing [sidereal time](https://en.wikipedia.org/wiki/Sidereal_time) with [solar time](https://en.wikipedia.org/wiki/Solar_time).  A sidereal day is the amount of time it takes for the Earth to rotate by 360°, and is indeed 23h56m4s.  A solar day is the interval between two successive instances of the Sun crossing the [local meridian](https://en.wikipedia.org/wiki/Meridian_\\(astronomy\\)).  Since the Earth moves by roughly 1° around the Sun each day, the Earth has to rotate by roughly 361° for the Sun to cross the local meridian.  In [this image](https://en.wikipedia.org/wiki/File:Sidereal_day_\\(prograde\\).png), sidereal time is the difference between the blue circles labelled \"1\" and \"2\", where solar time is the difference between the blue circles labelled \"1\" and \"3\".",
            "score": 14790,
            "author": "plaidhat1",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is the answer. All the leap year mumbo jumbo is essentially independent of this",
                    "score": 3544,
                    "author": "spacecraftily",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Seriously, this explanation made me feel smarter for understanding it. Hi, I'm 37 years old and I learned something today that I can teach my son.",
                            "score": 2117,
                            "author": "Beardandchill",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If you think that's cool, try the implications: first, the Earth rotates by a degree every 4 minutes, and by 15 degrees an hour.  Second, if you go outside and look at the stars, and you want to see the stars tomorrow night in exactly the same position they're in now, you need to look 4 minutes earlier.",
                                    "score": 1333,
                                    "author": "plaidhat1",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "There was an old Andy Griffeth show about the extra 4 minutes because of someone thought Barney didn't use his turn signal so they had to wait the next day minus 4 minutes to get the same sun glare on the turnsignal",
                                            "score": 717,
                                            "author": "hotroddaveusa",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Interesting.  If you happen to come across that episode or its title, I'd like to see it.",
                                                    "score": 187,
                                                    "author": "plaidhat1",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It wasn't Andy Griffith, it was Mayberry, R.F.D. \n\nhttp://www.dailymotion.com/video/x1g3dhp_mayberry-rfd-s01e10-sam-gets-a-ticket_shortfilms\n\nUnfortunately, they don't do the minutes calculation.\n\n",
                                                            "score": 302,
                                                            "author": "avidday",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Aaaand I just watched the whole episode.  \"Men are important too.  Otherwise women wouldn't have anyone to take charge of. \"",
                                                                    "score": 160,
                                                                    "author": "wordyplayer",
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Five dollars!  I could drop that and not care.\nWhat is that in real money?  Like £1000?  ",
                                                                    "score": 8,
                                                                    "author": "urqy",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Why? The sun is in the same position every 24 hours, not every 23:56.",
                                                    "score": 35,
                                                    "author": "Poromenos",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Not precisely since we are angled 23.5 degrees to the sun and not everyone is the the equator.",
                                                            "score": 92,
                                                            "author": "Jumbobie",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Yes, but the four minutes doesn't fix that, does it? You'd have to wait a year.",
                                                                    "score": 28,
                                                                    "author": "Poromenos",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "It takes an extra 4 minutes for the Earth to spin the 1 degree of orbit around the sun it traveled in the past 24ish hours. So the sun is in the same longitudinal plane Asher that extra 4 minutes. If I'm understanding this correctly. Vsause did a video about this. https://youtu.be/IJhgZBn-LHg",
                                                                            "score": 60,
                                                                            "author": "guss1",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "You're confusing sidereal and solar time again. If you had to wait 4 minutes for the sun to be in the same place day after day, then solar noon would drift - and eventually it would be solar noon at midnight.\n\nIn this case, if you want the sun to be in the same position (not accounting for seasonal inclination change), you'd wait one solar day - 24 hours.",
                                                                                    "score": 56,
                                                                                    "author": "TheRealEdwardAbbey"
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "But we're actually counting with 4 minutes added. That's because we have 24 hour day, not 23:56",
                                                                                    "score": 21,
                                                                                    "author": "grandoz039"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Think of it as if the earth were stationary, spinning in place, while the sun orbits earth. Every 23 hours 56 minutes the earth returns to its original orientation, but the sun is no longer in the same spot. It takes another 4 minutes for the earth to catch up. ",
                                                            "score": 27,
                                                            "author": "Desperado2583",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Yes, that's my point. If they wanted to get the same sun glare, they had to wait 24 hours, not 23:56, no?",
                                                                    "score": 24,
                                                                    "author": "Poromenos",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "You are right. This is because the sun moves around in the sky. After 23:56, the stars are in the exact same places in the sky but not the sun.",
                                                                            "score": 31,
                                                                            "author": "pogrmman",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Its in the same position every 24 hours, but the angle is slightly different due to the traveling around the Sun",
                                                            "score": 7,
                                                            "author": "[deleted]"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 116,
                                    "author": "[deleted]",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 36,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "\"It's like in that episode of Cosmos where...\" is a pretty common phrase around the house.",
                                            "score": 6,
                                            "author": "Beardandchill"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Make sure to throw in a little Calvin's dad silliness in your explanation, just to keep your kid on their toes. ",
                                    "score": 13,
                                    "author": "zezzene",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The sun sets in Flagstaff, Arizona. That's why the rocks there are so red.",
                                            "score": 9,
                                            "author": "[deleted]"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "what, you didn't get the booklet everyone gets when they become an adult that explains everything ever?",
                                    "score": 10,
                                    "author": "slapfestnest",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ha! What a lack of knowledge this person possesses! I bet they don't even know where to get the booklet. Let's shame them further by showing them exactly where to get it and how! ",
                                            "score": 2,
                                            "author": "[deleted]"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "While you're at it you can talk about sidereal versus synodic lunar orbits. The time it takes to go from full moon to full moon is longer than the time it takes the moon to go 360° around the earth. There are about 12 full moons in a year, but each time there is a full moon it has had to go a little further around the earth to be opposite the sun. In the course of a year, all the little furthers add up to one more orbit, so it takes about 13/12 times longer between full moons compared to going 360° around earth.",
                                    "score": 5,
                                    "author": "rogamore"
                                },
                                {
                                    "level": 3,
                                    "comment": "That is a great feeling, when you learn something and you understand well enough to explain it to someone else. ",
                                    "score": 3,
                                    "author": "Falsus"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "In thinking about this, I just realized something somewhat interesting: there will always be exactly one more sidereal day in a year than there are solar days. I'm pretty sure this is true of elliptical orbits and non-integer year:day ratios. Although it does imply that if there are an integer number of days in a solar year, there will also be an integer number of days in a sidereal year. In fact, I think you can even apply this to reverse rotating planets (relative to their direction of orbit) like Venus.\n\nCan someone confirm this? I'm just working this out in my head. ",
                            "score": 76,
                            "author": "B0Boman",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You're totally right. It's just a straight \"+1\" as long as you book keep the number of solar days for a retrograde planet like Venus as a \"negative\" day.\n\nVenutian years are 1.9 Venutian solar days. (-1.9) \nNow we use your formula\nVenutian years are (-1.9 + 1=-0.9)  0.9 sidereal days.\n\nNow if we take the absolute value of everything (cuz that's how a Venutian would observe the patterns)\n\nSidereal Day &gt; Year &gt; Solar Day\n\n",
                                    "score": 66,
                                    "author": "spacecraftily",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt; In thinking about this, I just realized something somewhat interesting: there will always be exactly one more sidereal day in a year than there are solar days\n\nA future novel, written by a future Jules Verne, about a space-travel-era Phileas Fogg with this as a plot point, is just waiting to be written.",
                                    "score": 41,
                                    "author": "Dunan",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Not necessarily. If the Earth spun the other way around, then there would be one fewer. Follow it to the extreme: if the Earth didn't spin at all in the sidereal frame (i.e. counter-rotation of one day per year in the solar frame), it would still have solar days since it will complete one orbit per year. If the planet didn't spin at all in the solar frame, it will never complete a solar day but have one sidereal day per year due to the orbit.",
                                    "score": 18,
                                    "author": "LittleKingsguard",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "They said \"exactly one more sidereal day in a year than there are solar days\".  You said, essentially 1 - 0 = 1 and 0- (-1) = 1.  No?",
                                            "score": 2,
                                            "author": "virtuous_sloth",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "True. If you want to ask someone an advanced trivia question, ask them how many times a year the earth rotates on its axis. Unless they're an astronomer, expect an argument when you tell them it's 366 and not 365.",
                                    "score": 2,
                                    "author": "OberonOberon"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "So why is there a leap year?",
                            "score": 3,
                            "author": "ivievine",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Because the orbit time is not a clean (integer) number of solar* days.  \n\nSaid another way: the time that Earth takes to come back to where it started takes 365.25 times as long as it takes to spin around.\n\n*As someone else has pointed out above me. The number of sidereal days is always \"1+\" number of solar days. So really if the orbit time is not an integer number is solar days, it also won't be an integer number of sidereal days.",
                                    "score": 6,
                                    "author": "spacecraftily"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "360 degrees in a circle, 365 days in a year, eg, like you said, ~1 degree a day. I don't know why, but that's pretty cool to think about like that and I never had before.  Thanks!",
                    "score": 203,
                    "author": "justf_rtheupv_te",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Interesting is that the closeness of both numbers (degrees in a circle and days in a year) is not a coincidence. \n\n5150 years ago the sumerians were the first (that we know of) to count the days of the year (to know when to seed the grains, and using the fact that the shadow of a stone at noon each day repeats after a year). They got the 360±4 days number, which is relatively close to 3 x 4 x 5 x 6 = 360\n- and they already considered the 3 x 4 x 5 = 60 a pretty magic number (roughly how we consider 100 a significant number today) so surely that cannot be a coincidence, it must mean something! \n\nSo the sumerians picked a 360 days year, and decreed that the remaining 5 days are outside of the year, so why work then if nobody counted interest on loans during those  days (by religious decree), let's spent 5 days partying, drinking, and celebrating the new year! \n\nAnd this is why we have 360 degrees around the circle - one degree is the distance covered by the Earth around the sun during one day.  ",
                            "score": 229,
                            "author": "ddalex",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Tolkien's hobbits did the same thing. Their calendar has 2 days bookending the year, and 3 days in the middle of the year, that aren't part of any month or week. I always thought that it would be a nice system to use.",
                                    "score": 33,
                                    "author": "Roachmeister",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Someone had posted an idea for 13 months of 28 days, plus one extra day 'New year's day'. This would make every 7th, 14th, 21st, 28th Sundays in each month.",
                                            "score": 28,
                                            "author": "someguy3",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "There's a book called [A Sideways Look At Time](https://www.amazon.com/dp/1585423068/ref=cm_sw_r_cp_apa_lv8hzbTJAZ0J4) that explores how time was recorded, understood, and affected by various cultures over the millennia. It mentions this 13 month setup as a simpler way of keeping time for us today, and sets the extra days aside for the equinoxes. It makes for interesting reading.",
                                                    "score": 6,
                                                    "author": "altrocks"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Hobbits also have 13 months, and had much fewer years than the rest of the world ",
                                            "score": 11,
                                            "author": "effa94",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "13 months? No way. Smarch weather is awful.",
                                                    "score": 10,
                                                    "author": "Laimbrane",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "So teach us to number our days, that we may apply our hearts unto wisdom",
                                    "score": 44,
                                    "author": "ihadanamebutforgot",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah, got it. Continue. \n\nNow to build some plantations and hope I can finish Stonehenge before that bastard Hiawatha does. ",
                                            "score": 26,
                                            "author": "skine09",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Just beware of Alexander.  He'll befriend you and then immediately declare war.",
                                                    "score": 5,
                                                    "author": "cyclops1771"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "At what point did people equate a year with circling the sun though? Surely 5000 years ago was before anybody knew that a year was an orbit around the sun, it's not an  easy thing to deduce. \n\nSo how would they connect a circle to a year?",
                                    "score": 3,
                                    "author": "bullett2434",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 15,
                                            "author": "[deleted]",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "A circle is a logical shape for how the sun moves through the sky. Only in the case of 5,000 years ago they likely thought the sun was moving around the earth - so we're actually talking about them associating a year with the sun's going around the earth-ish (returning to the same position in the sky).",
                                            "score": 7,
                                            "author": "Mayor__Defacto",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Pretty sure the Sumerians did NOT think the Sun revolved around the Earth, as they had drawn the orbits of all 6 visible planets (including the Moon) the Earth in some of their historical drawings.  Egyptians also, I believe, thought the Earth revolved around the Sun.  I may be wrong about the Egyptians.\n\n*Edit* corrected myself...",
                                                    "score": 12,
                                                    "author": "dragonriot"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "They wouldn't have thought of it as an orbit, but they would have noticed the sessions repeating, and with a little more observation the stars returning to the exact same positions and the sun to the same rising/seeing point and noon height. These observations would have been more obvious to preindustrual people without clocks and artificial lighting than they are to us.",
                                            "score": 2,
                                            "author": "craigiest"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 69,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 73,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's the 13th highly composite number. Defined by having more divisor than any number lower than it.\n\nThey go 2^(1), 2^(2), 2^(1)3^(1), 2^(3)3^(2), 2^(4)3^(1), 2^(1)3^(1)5^(1), etc. up to 360=2^(3)3^(2)5^(1).\n\nRamanujan figured out some interesting things about them, I believe.",
                                            "score": 44,
                                            "author": "swng",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "     &gt;&gt;&gt;[x for x in range(1, 360+1) if 360 % x == 0]\n     [1, 2, 3, 4, 5, 6, 8, 9, 10, 12, 15, 18, 20, 24, 30, 36, 40, 45, 60, 72, 90, 120, 180, 360]",
                                            "score": 2,
                                            "author": "chileano",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "    &gt;&gt;&gt;[x for x in range(1, 359+2) if 360 % x == 0]\n    [1, 2, 3, 4, 5, 6, 8, 9, 10, 12, 15, 18, 20, 24, 30, 36, 40, 45, 60, 72, 90, 120, 180, 360]",
                                                    "score": 4,
                                                    "author": "raptorraptor",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Also, I'm convinced it's not a coincidence that there's 365 days in a year and 360 degrees in a circle - the 360 is likely due to the fact 360 divides 12 and works with counting systems like base 10 and base 60 that the Babylonians used, but it's too much of a coincidence that the two numbers are so close.",
                            "score": 5,
                            "author": "rnelsonee",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The 360 degree circle was derived from the annual calendar used by the Babylonians.\n\nhttp://mathforum.org/library/drmath/view/59075.html\n\nThat the numbers are similar isn't a coincidence. It's intentional.\n",
                                    "score": 4,
                                    "author": "_jbardwell_",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt; A solar day is the interval between two successive instances of the Sun crossing the local meridian. \n\n\nwhich is how long on our clocks?\n",
                    "score": 34,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It varies through the year due to axial tilt and the elliptical orbit, but the mean is 24.0000006 hours",
                            "score": 43,
                            "author": "StatmanIbrahimovic",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "The sun thing is 24 hours, or you would get your daylight time all turned around multiple times a year.",
                            "score": 19,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "24 hours.  Take the number of seconds to travel 360^o , divide by 360 to get number of seconds to travel 1^o .  Then divide that by 60, you have number of minutes to travel 1^o , which is about 4.  Add that back to the 360^o time, you get roughly 24 hours (and a little change, hence the need for a leap year).  Alternatively, since you get ~3.989 minutes/degree, multiply that by 361 (to get number of minutes/day), divide by 60 to get 24.0009 hours per solar day.",
                            "score": 66,
                            "author": "whatlike_withacloth",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "About 24 hours.\n\nIt actually varies by a few seconds over the course of a year, due to the Earth's orbit being not precisely circular.",
                            "score": 5,
                            "author": "green_meklar",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Since our orbit is elliptical, does that mean the solar day varies in length depending on where we are in the orbit?",
                    "score": 21,
                    "author": "scherlock79",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes, but it's a minor difference given the earth also wobbles on its axis and the max difference is only about 4 million miles, compared to the 90 million miles average distance from the earth to the sun. We're also moving further away from the sun at 1/2 inch per year. ",
                            "score": 42,
                            "author": "17954699",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Assuming that half inch is true (and I assume you know it is), and assuming gravity from celestial objects (mostly the sun) affects that, then is it also correct to assume that over time that 1/2 inch will increase as we get further from the sun? How many years will it take before it becomes larger units of distance, such as a yard/meter per year? Or what is the rate of increase in that distance?",
                                    "score": 18,
                                    "author": "tigolex",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's not due to a constant force that would have a greater net impact as the orbital radius increases. It's mostly due to the force of the sun's gravity decreasing as the sun burns its mass into light and radiates it into space. This is the only source I've read on the topic, to give you an accurate sense of how little I actually know about it personally:\n\nhttp://curious.astro.cornell.edu/about-us/41-our-solar-system/the-earth/orbit/83-is-the-distance-from-the-earth-to-the-sun-changing-advanced\n\n&gt;The Sun is powered by nuclear fusion, which means the Sun is continuously transforming a small part of its mass into energy. As the mass of the Sun goes down, our orbit gets proportionally bigger. However, over the entire main sequence lifetime of the Sun (about 10 billion years), the Sun will only lose about 0.1% of its mass, which means that the Earth should move out by just ~150,000 km (small compared to the total Earth-Sun distance of ~150,000,000 km). If we assume that the Sun's rate of nuclear fusion today is the same as the average rate over those 10 billion years (a bold assumption, but it should give us a rough idea of the answer), then we're moving away from the Sun at the rate of ~1.5 cm (less than an inch) per year. I probably don't even need to mention that this is so small that we don't have to worry about freezing.",
                                            "score": 24,
                                            "author": "BoojumG",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I'm not sure, but I heard it's because the sun is slowly losing mass and the effect of the earth-moon duopoly is to move the earth a little further away each year. This article goes into more detail:\n\nhttps://www.newscientist.com/article/dn17228-why-is-the-earth-moving-away-from-the-sun/\n\nAs for when it will become more significant, probably not until the Sun becomes a Red Giant. So even though we'd have moved further away by then it won't matter much because the Sun will have grown exponentially larger.",
                                            "score": 6,
                                            "author": "17954699"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It does vary a little, enough that telling the time (as measured on earth using a 24 hours clock) accurately using a sundial requires making adjustments based on the time of year. This adjustment also takes into account the fact that the earth is significantly tilted relative to it's orbit.\n\nBy construction, sundials measure \"apparent solar time\" i.e. the time according to the position of the sun, with solar noon (12 on a sundial) always being the time when the sun is exactly on the meridian of the sundial (i.e. directly on the line from North to South). \n\nThe difference between the actual length of each solar day and the average solar day (24 hours) varies quite a lot by season, and has to be added or subtracted to the time on a sundial (the apparent solar time) to get the measured time that humans use, where each day is defined to be 24 hours long. It can vary by around -14 to +16 minutes. The way this is calculated is called [the equation of time](https://en.wikipedia.org/wiki/Equation_of_time).",
                            "score": 7,
                            "author": "Reasonably_Sure"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That's how long it takes for a 360° rotation of the earth. Since it's also revolving around the sun it requires more than a 360° turn for the same point to be facing the sun again. Therefore, a \"day\" as we know it is more than 360° and a lot closer to 24 hours than your estimate.",
            "score": 7064,
            "author": "jimjim1992",
            "replies": [
                {
                    "level": 1,
                    "comment": "The approximately 24 hour day that we know is called a solar day, and the 4 minute shorter day is called a stellar day.\n\nedit:  Just as a ball park calculation to see why it's four minutes shorter: with respect to the sun, in 365 days, the Earth rotates 366 times (365 times around its own axis, and once due to its orbit). With respect to itself, the Earth rotates 365 times in that time. So the following two ratios should be about the same:\n\n366/(24*60) = 0.254166...\n\n365/(24*60-4) = 0.254178...\n\n ",
                    "score": 1944,
                    "author": "fattymattk",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A.K.A. sidereal time.",
                            "score": 696,
                            "author": "hobbycollector",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Which is, counterintuitively, pronounced sigh-deer-eal.",
                                    "score": 542,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 355,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Can you use that in a sentence please?",
                                                    "score": 121,
                                                    "author": "Tonberry_Slayer",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Today's advanced telescopes are of invaluable use in studying the sidereal universe.\n\nIt basically means \"far away\", \"among the distant stars\", or \"pertaining to the distant stars\". The above sentence refers specifically to the universe outside our own solar system.",
                                                            "score": 161,
                                                            "author": "Mixels",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "So if I say \"Whoah! That is totally sidereal!\" \n\nIt would be like me saying \"Whoah! That's totally far out, man!\" ",
                                                                    "score": 97,
                                                                    "author": "ThePootKnocker",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Sorry to butt in :P I suppose it could be used that way. We use the word sidereal more often in Spanish, this is the first time I've heard it in English. See, in Spanish, outer space = espacio **sideral** and so... while sidereal isn't used as a slang word in Spanish for anything, as far a I know, I don't see why it couldn't be one. Sidereal implies the vastness, otherworldness of space or something like that.",
                                                                            "score": 58,
                                                                            "author": "aliendividedbyzero",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "&gt;\"vastness, otherworldness...\"\n\nThat's enough for me. It means something is totally awesome!\n\nI will begin to use this although no one will know what I am saying.",
                                                                                    "score": 52,
                                                                                    "author": "ThePootKnocker",
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Yes, the English word \"sidereal\" is basically a scientific term, not often used in everyday discourse.But there are ltos of itnerestign similar qwords between Englisha nd all the Romance langauges.",
                                                                                    "score": 7,
                                                                                    "author": "DaddyCatALSO",
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "I learned a word today, thanks!",
                                                                                    "score": 5,
                                                                                    "author": "CharlesDickensABox"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I just love that we got to etymology from here and about one of my favorite concepts no less. Thanks!!",
                                                    "score": 2,
                                                    "author": "the_enginerd"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Rhymes with ethereal?\n\nThanks for this.  I've seen this word a few times and always mentally pronounced it side-real.  You may have saved me from future embarrassment.",
                                            "score": 59,
                                            "author": "Kylynara",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Might not have been too much embarrassment. There's a street in my neighborhood named \"Sidereal\" (all the streets are named after space things). The number of people who know the correct pronunciation are few and far between.",
                                                    "score": 2,
                                                    "author": "percykins"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I never even thought about the fact that this could be pronounced some other way but now that you mention it I'm not even sure why I've been pronouncing it correctly all these years.",
                                            "score": 15,
                                            "author": "drunkenknight9",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt; counterintuitively,\n\nhuh. That's always how I thought you pronounced it. Maybe the first time I heard the term was on a podcast or something.",
                                            "score": 5,
                                            "author": "V1per41"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "thanks for that! it pops up all the time in discussions about watches because the equation of time (difference between sidereal time and political (?) time) is a complication on a bunch of nice watches. ",
                                            "score": 4,
                                            "author": "tastar1"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I mean, thanks for the tip, but how do you think that would be pronounced intuitively? ",
                                            "score": 34,
                                            "author": "Perpetual_Entropy",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "IDK, side-reel?",
                                                    "score": 205,
                                                    "author": "jimethn",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I could see someone easily just looking at it and seeing two different words put together and saying them separately: side-real time  \n\nI'm with you though, my first guess was how that person said as well. ",
                                                    "score": 35,
                                                    "author": "PM_ME_UR_ASS_GIRLS",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I don't know, I too think it's more intuitive to pronounce it \"side-real\", especially because the two words put together seem to have a relevant meaning.",
                                                            "score": 17,
                                                            "author": "LotzaMozzaParmaKarma",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I think it depends on your base.  The English native speaker in me can easily see the word as \"sidereal\".  But because I'm also a French speaker, I see see -re-al too. This is really subjective and probably based on what languages and backgrounds a person has (language in general, not just this word).",
                                                                    "score": 8,
                                                                    "author": "molotovzav",
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "The \"ereal\" suffix should have been a giveaway, but I understand how people could overlook that.",
                                                                    "score": 10,
                                                                    "author": "Colonel_K_The_Great",
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I get the -ereal suffix now, but my mind went to side real as well. And it seems to make sense in a way.\n\nLike... side because it's facing the same direction (or side), and also a 360 degree, or \"real\" full rotation...",
                                                                    "score": 2,
                                                                    "author": "BrewCrewKevin"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Well also SideReal time sounds sick af. Like some sort of Sci Fi Technobabble. Then you find out that it is a real thing. ",
                                                            "score": 3,
                                                            "author": "loscarlos"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Side-reel? ",
                                                    "score": 19,
                                                    "author": "ProjecTJack",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "How was your day?\n\nStellar.",
                            "score": 29,
                            "author": "ireadforthearticle"
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 286,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 104,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 99,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 43,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 14,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "This is why the night sky changes throughout the year. Each day, the stars have moved about 4 minutes to the West when viewed at the same time of night. Not coincidentally, 4 X 365 / 60 = 365.333... That .333 is why we need leap years.",
                            "score": 6,
                            "author": "CyberneticPanda"
                        },
                        {
                            "level": 2,
                            "comment": "Could it be that your edit is slightly incorrect? I'd think that, from Earth's perspective, it revolves 366 times in 365 days. In this time span, you'll only observe 365 rotations if you go by the sun's dawning and setting, because it takes slightly more than one actual rotation to get to an observed rotation.\n\nI might need more coffee though. ",
                            "score": 16,
                            "author": "zyygh",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 31,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Also, 0.24255 \\* 4 = 0.9702, which is why we add a day every 4 years.  Except adding a day every 4 years is too much, so we omit adding a day every 100 years.  But doing that takes away too much, so we omit omitting adding a day back in every 400 years.  I think were going to be OK for a while with that plan.",
                                            "score": 10,
                                            "author": "_NW_",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Exactly. After one solar year, the earth has made 366.25 rotations relative to the universe. But since the earth is rotating around the sun in the same direction, we experience only 365.25 sunsets each year.",
                    "score": 129,
                    "author": "Im_riding_a_lion",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That seems really cool, but my brain can't work that out. Could you explain it in a way someone on 3 hours of sleep could understand?",
                            "score": 43,
                            "author": "Aesnop",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "put a chair in the middle of the room. look at the chair. spin yourself in a circle (pirouette) and end looking at the chair again.  Thats 360 degrees. \n\nNow spin yourself in a circle, while simultaneously taking a step around the room, and still end up facing the chair. Because you moved around the room you have to turn further than 360 degrees to end up facing the chair again.   (If you walk around the room the \"wrong\" way, it will be less than 360 degrees, if you walk around it the \"right\" way, it will be more than 360 degrees)\n\nSo if you keep spinning and going around you could count two things\n\n1) How many times did I look straight at the chair. (solar day)\n2) How many times did I spin in a complete circle (360 degrees)\n\nThose are two different numbers. \n\nThe following image may illustrate : https://en.wikipedia.org/wiki/File:Sidereal_day_(prograde).png\n\n",
                                    "score": 238,
                                    "author": "CaucusInferredBulk",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "He said he was on three hours of sleep. If you make him spin around in circles he's just going to fall down!",
                                            "score": 107,
                                            "author": "solepsis",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Thanks this helped me lol",
                                            "score": 11,
                                            "author": "schroederrr"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "wow the chair makes total sense! thanks for the simplification!",
                                            "score": 3,
                                            "author": "[deleted]"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Grab two identical coins and lay them side by side on a table. Hold one of them in place and rotate the other around it so their surfaces are always in contact. \n\nNotice how one full revolution around the stationary coin is two full rotations of the coin you're moving? It's like that.  Try it with differently sized coins. Imagine the coin you're rotating is earth and that the top of it is where you live. It's noon when the top of the coin faces the sun and midnight at the bottom. \n\nAbout half a year from now, the sun will be on the other side of the earth. At that point, if we have done an whole number of full rotations (these are the 23h56m periods mentioned in the post), it will be night where it used to be day. The extra 4 minutes is the time it takes earth's rotation to catch up to the sun's new position in the sky. ",
                                    "score": 31,
                                    "author": "DubiousCosmos",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I tried explaining to a friend that the moon rotated on its axis using a similar method, and he would have none of it.\n\nThen again, he's not entirely sure the moon isn't a hologram in a dome over a flat earth, so there is that...",
                                            "score": 8,
                                            "author": "PM_ur_Rump",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Put yourself in the \"north\" side of earth looking down on the planet. It spins counter clockwise. Now zoom out and you will see it orbits*(edit from rotates) around the sun counter clockwise. So it is like a tire rolling in the same direction it is moving. So in the end the earth would have rotated around itself approx. 366 times. But one of them is not felt because it is \"spread out\" all around the entire year orbit. Making us feel 365. More or less. I think. Don't know if that helped. Happy Friday!  ",
                                    "score": 11,
                                    "author": "estabienpati"
                                },
                                {
                                    "level": 3,
                                    "comment": "If the earth did not rotate at all, but it went around the sun, you'd see the sun go around the sky once per year. Effectively one \"day\" would exist just because of the earth traveling around the sun, instead of the earth spinning.\n\nActually though, that gives us a \"backwards\" day.",
                                    "score": 17,
                                    "author": "DIYaquarist"
                                },
                                {
                                    "level": 3,
                                    "comment": "I drew a bad diagram in MS Paint to help illustrate it:\n\nhttp://imgur.com/u8pV63q\n\nThe idea is that if you were to track the Earth's spin and pretend it wasn't moving relative to the Sun, you'd end up a little \"off\". Over the course of its orbit, while we track the rotation of midday (by keeping it the same throughout - it doesn't swap over to night half way through the year, because we have factored that into our timing), you end up having spun less than you expect because you've been spinning in the opposite direction to keep track.\n\nThe end result is that one affects the other, and that the Sun does not look like a fried egg when drawn in such a way.",
                                    "score": 11,
                                    "author": "Korlus"
                                },
                                {
                                    "level": 3,
                                    "comment": "Maybe it would help to think with smaller numbers.  Suppose that the Earth rotates on its own axis at the same rate that it orbits the sun.  This means that the same side of Earth is always going to be facing the sun, while the other side will always be dark.  If you are standing on Earth, it will look like you are not moving relative to the sun at all.  So, after one trip around the sun, Earth has rotated about its axis 1 time, but you subtract 1 to get the number of \"days\" you experience, which is 0.\n\nThe same principle holds true if the Earth rotated 2 times while orbiting the sun once.  Now, if you picture Earth after a half orbit about the sun, the opposite side of Earth will be facing the sun (so half a day had passed), and after a full orbit a whole day has passed.  You have done 2 rotations, but experienced 1 day.\n\nThe same holds true for any number of rotations during one orbit, and in Earth's case it's about 366.25.",
                                    "score": 8,
                                    "author": "_wetnap_",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Stand in the centre of your bedroom and slowly walk toward your bed. Pull back the covers, get in the bed and pull the covers over yourself. Allow yourself to fall asleep. When you awake, read the other responses to your question. ",
                                    "score": 2,
                                    "author": "mrgonzalez"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yep. The actual length of a day is 24 hours and 0.002 seconds on average (and very gradually getting longer as the Moon recedes).",
                    "score": 188,
                    "author": "CrateDane",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 43,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No, this is handled by leap seconds rather than leap years.\n\nLeap seconds adjust the daytime so sunrise isn't eventually at 2PM.\n\nLeap years adjust the seasons so spring isn't eventually in September (in the northern hemisphere).",
                                    "score": 307,
                                    "author": "CrateDane",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Aw, but I want it at 2PM. Dang scientists ruining stuff for us night people.  ",
                                            "score": 111,
                                            "author": "redfricker",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You should sign up for Mars colony.  You'll get some GREAT confusing times that way.\n\nEven better, consider living on the moon.  You'll see sunrise about once a month.  If that's not weird enough for you, you'll see the Earth hang in the sky at about the same spot throughout the entire year (and slowly change phase like the moon changes for us).",
                                                    "score": 30,
                                                    "author": "hovissimo",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Move to the north (or south based on where you live). The northern you are (at least, in summer) earlier the sunrise come. OR the sun doesn't even settle. ",
                                                    "score": 2,
                                                    "author": "SirButcher"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 13,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "A couple weeks ago it was 30C. Then it snowed. This week was 20C-30C. Therefore need a 12 day year.",
                                                    "score": 36,
                                                    "author": "DontPromoteIgnorance",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[removed]",
                                                            "score": 2,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "30C = 86F \n\n20C = ~room temperature (68F)\n\nCelsius is nice in that cold temperatures are negative and not seemingly arbitrary.\n",
                                                                    "score": 4,
                                                                    "author": "KC14",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I'd say 1C is pretty cold.\n\nAnd Celsius is just as arbitrary as Fahrenheit, since they're both based on the freezing and boiling points of water. It's just slightly more intuitive to know 0 and 100 instead of 32 and 212.",
                                                                            "score": 6,
                                                                            "author": "jwota",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Maybe more governments and corporations should work to reduce climate change...  :)",
                                                    "score": 2,
                                                    "author": "Arcane_Pozhar",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Leap years handle the discrepancy between the solar year and solar days, with a complete solar year being 365 days 5 hours 48 minutes 46 seconds. That's 365.242199074 days, which means that the solar/tropical year isn't in line with an even number of solar days, causing the calendar to drift relative to the seasons.  \nI could cover all the complicated rules and maths involved, but [[this video]](https://www.youtube.com/watch?v=qkt_wmRKYNQ) handles it pretty well, explaining the history of leap years and how we *could* do better.  \nedit: My numbers are different from the video (by about 800ms) because I asked Google instead of referencing the video for them.",
                                    "score": 63,
                                    "author": "Ryltarr",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That's a great video thanks! ",
                                            "score": 2,
                                            "author": "ImNotGaySoStopAsking",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Right, that's why a leap year is cancelled every century. But that's not quite accurate either, so we bring one back every 400 years. I learn this before Google when I ran into an example in the old classic c programming book by Kernighan and Ritchie. Didn't know leap year does that and the equation puzzle me for a bit. ",
                                    "score": 30,
                                    "author": "snakesoup88",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The leap year has more to do with how long it takes for the earth to orbit the sun, rather than how long it takes for the earth to rotate about its axis",
                                            "score": 20,
                                            "author": "ezpickins"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Well, no. The leap year is more about the number of days per year and less about the not-to-even length of the day.  \nThat .002 second difference is handled by adding seconds every so often, about every 500 days.",
                                            "score": 17,
                                            "author": "Ryltarr",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "The 'discard a leap year in 3/4 of 1/100 years' is very accurate too, which is a fluke.\n\nI believe our current calendar is good enough to still have the solstices on 21-Dec and 21-Jun in the 5th millenium.",
                                            "score": 4,
                                            "author": "sirgog",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Whoa, I never even thought of this. Good explanation",
                    "score": 12,
                    "author": "Drunken_Economist",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Even accounting for your points the leap year isn't perfect and doesn't catch us up perfectly. We added one extra second to last year to catch us up. ",
                    "score": 3,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The leap second is actually added to account for the (unpredictably) slowing rotation of the earth due to tidal forces with the moon. ",
                            "score": 5,
                            "author": "qzex"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is...awesome. I'm 40 years old and never even thought about this.\n\nI do have a plan in place in case of zombie outbreak though.",
                    "score": 5,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "Isn't the Earth minorly slowing it's rotation though?",
                    "score": 3,
                    "author": "auto01",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It is, the moon is getting further away all the time, which affects how fast the earth spins. I don't have the numbers on hand, but I believe that speed change is extremely minor compared to the time discrepancy in a day.",
                            "score": 3,
                            "author": "jimjim1992",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There's a fun graph on wikipedia which shows how long the day is:\nhttps://upload.wikimedia.org/wikipedia/commons/5/5b/Deviation_of_day_length_from_SI_day.svg\n\nWhile tidal effects of the moon steal angular momentum from the Earth slowing down the day,  earthquakes and other internal shifts of mass can pull mass closer to the center which speeds it up.  The net effect is rather chaotic over the short term which suggests the later effect is dominant on these time scales..",
                                    "score": 2,
                                    "author": "AsterJ"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You could also explain this from a different perspective. Imagine if the earth didn't rotate *at all* relative to the galaxy.  That means that 1 day now lasts 1 YEAR as the earth orbits around the sun.  The sun now also moves from west to east, but VERY slowly!  So at the end of the year you're \"losing\" 1 day as the sun has traveled backward in relation to what we currently experience with East-to-West sun movement.  So the earth has actually rotated approximately 366 times during a year, but we only experience 365 cycles of the Sun rising and setting.\n\nIf you want more information, look up Solar days vs Sidereal days.",
                    "score": 3,
                    "author": "Brarsh"
                },
                {
                    "level": 1,
                    "comment": "With the remaining excess being maid up by the occasional addition of leap seconds.",
                    "score": 2,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "And the leap year in the question isn't necessarily related, it's due to the fact that the earth rotation is not connected to us going around the sun.  The earth spins and we mark a day when the sun goes overhead.  A year happens when the earth goes around the sun once.  Since these revolutions/orbits aren't related, we need an extra quarter day on 365 to get back to our original position around the sun to mark.  ",
                    "score": 2,
                    "author": "Kar_Man"
                },
                {
                    "level": 1,
                    "comment": "So could that more than 360 degree turn (aside from the axis tiliting) be part of why the sun sets later in the summer/rises early in the winter?",
                    "score": 2,
                    "author": "Worldlover67",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "No, 23h25m4s is the length of a *sideral day*, which is the time it takes to face the same direction relevant to an object outside the solar system (such as the galactic center). A solar day (the time it takes for the sun to reach the same angle in the sky) is about 24 hours (give or take a few seconds on certain days, considering the earth moves at different speeds at different parts of its ellipse).\n\nLeap years are a different kettle of fish. You see, the speed at which the earth rotates, and the speed at which it revolves around the sun are not connected, and the solar year is 365d5h48m46s (which is 11m14s less than 365.25 days) so we accumulate nearly a quarter of a day (to be specific, 24.219907407407407407407407407407%) per year, which would mean over time, our calendar would slip and we'd end up with summer in the northern hemisphere for christmas! over the course of 100 years, autumn would begin to creep into august, and spring into January, as the seasons shifted over by 24 days. So, we could add an extra day ever 4 years to fix it right? However, since the solar year is 11m14s shorter than that .25, we're now shifting 11m14s a year in the other direction. in 128 years, we'd be one day off. So we do better by NOT including an extra day on years divisible by 100. But we also knew we could do better, so we made an exception to that rule: If the year was divisible by 400 it WOULD be a Leap Year. Now it will take 3300 years to diverge for the calendar year and solar year to converge by a single day!",
            "score": 155,
            "author": "Posts_for_Alot",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you, got it now",
                    "score": 7,
                    "author": "selous"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The 4 minute discrepency is our position relative to the stars, not the sun.  We measure days by the sun, not the stars.\n\nSo, one day is 1440 minutes.  One orbit is 365.25 days.  So every time we've completed one *solar* day - that is, the sun has returned to the same relative position it started in, we've moved further 1/365.25° in our orbit.  Leaving the stars 1440/365.25 minutes out of place - 3.94 minutes.\n\nThis \"discrepency\" doesn't need to be accounted for, because once it's happened 365.25 times, the stars are back where they started.\n\nThe leap year accounts for that 0.25 in our 365.25 day orbit.  So you can see where 4*0.25 becomes simple.",
            "score": 41,
            "author": "wosmo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Mind blown! Thanks for writing this. ",
                    "score": 4,
                    "author": "exfex21"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Your math is off, we add add the lap day because the solar year is actually about 365 1/4 days, we add the extra day every 4 years to account for that. We actually had to change it a while back to account for the fact that its slightly less the 365 1/4 \n\nHeres a better explanation...\n\nThe exact length of a solar year is actually 11 minutes and 14 seconds less than 365 ¼ days. That means that even if you add a leap day every four years, the calendar would still overshoot the solar year by a little bit—11 minutes and 14 seconds per year. These minutes and seconds really start to add up: after 128 years, the calendar would gain an entire extra day. So, the leap year rule, \"add a leap year every four years\" was a good rule, but not good enough!\n\nCalendar Correction, Part II\n\nTo rectify the situation, the creators of our calendar (the Gregorian calendar, introduced in 1582) decided to omit leap years three times every four hundred years. This would shorten the calendar every so often and rid it of the annual excess of 11 minutes and 14 seconds. So in addition to the rule that a leap year occurs every four years, a new rule was added: a century year is not a leap year unless it is evenly divisible by 400. This rule manages to eliminate three leap years every few hundred years.\n\nhttps://www.infoplease.com/leap-year-101-next-when-list-days-calendar-years-calculation-last-rules",
            "score": 243,
            "author": "fishing-engineer",
            "replies": [
                {
                    "level": 1,
                    "comment": "How did they know in 1582 that there was an excess of 11 minutes and 14 seconds going around the sun?",
                    "score": 55,
                    "author": "Nebraska_Actually",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; How did they know in 1582 that there was an excess of 11 minutes and 14 seconds going around the sun?\n\nThey knew because over 1582 years, the solstices had drifted from their 21st of the month position by ten days.",
                            "score": 95,
                            "author": "The_camperdave"
                        },
                        {
                            "level": 2,
                            "comment": "One of the reasons mechanical clocks were invented was to figure out things like that.  They were quite useful for astronomy.\n",
                            "score": 68,
                            "author": "phunkydroid",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Instead of asking the natural follow-up, I just looked it up myself. (For anyone interested in further info).\n\nMechanical clocks date back to the 14th century, including the [Wells Cathedral Clock](https://en.wikipedia.org/wiki/Wells_Cathedral_clock) and [Salisbury Cathedral Clock](https://en.wikipedia.org/wiki/Salisbury_cathedral_clock).",
                                    "score": 37,
                                    "author": "Nebraska_Actually",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "By recording the time using a sun dial with a mechanical clock. For example, if on January 1st of 1582, the moment the sun dial did not cast a shadow, the time on a mechanical clock read 12:00. The following year on January 1st , the moment the sun dial did not cast a shadow, the time on the mechanical clock would have read 12:02 and 48 seconds. Hense, the extra 11 minutes even when you account in and extra day for leap years.",
                            "score": 5,
                            "author": "GlenC0co",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "But mechanical clocks weren't nearly that accurate over a years time. How did they account for that? ",
                                    "score": 2,
                                    "author": "ScaryShoes",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "They didn't. People were aware of the seasonal drift literally since the invention of calendars, because the solstices and equinoxes didn't fall on the same day every year. You can pretty easily calculate solstices and equinoxes with primitive equipment - for example, if you simply erect a big pole and then mark where its shadow falls on a direct north-south line every day, the extremes of that shadow will be on the winter and summer solstices. Many ancient temples, such as Chichen Itza, were built in alignment to the sun rising on the equinoxes.\n\nWhen your civilization advances enough to create a yearly calendar, you'll note that over time, the summer and winter solstices no longer fall on the same day. So you add some days to make them match up again. Then you'll figure out that you seem to be losing about one day per four years, so you'll add a day per four years. That'll work for longer, then you'll realize that you're gaining about a day per hundred years. You'll fix that, and then about a thousand years later you'll realize you're losing a day per four hundred years. That's where things stand as of today. :)",
                                            "score": 5,
                                            "author": "percykins"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My question is when is the next time they skip a leap year?",
                    "score": 5,
                    "author": "Grandpa_Utz",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "2100.\n\nSkip every 100 years, but not every 400 years. So the next skips will be 2100, 2200, 2300, (2400 is a leap year), 2500, 2600, 2700, (2800 is a leap year), etc ",
                            "score": 40,
                            "author": "joebob431",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "So 2000 was a leap year?",
                                    "score": 3,
                                    "author": "BenTVNerd21",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yes. Because it's divisible by 4, it's a leap year. BUT, because it's divisible by 100, it's not a leap year. But THEN it's divisible by 400 so it's a leap year again. Simple! ^(/s) ",
                                            "score": 11,
                                            "author": "joebob431"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "A lot of people are pointing out the difference between sidereal days and solar days, but there's an important piece to a proper answer that's (mostly) being neglected: leap days are to fix the disparity between how long it takes for the Earth to *revolve* around the sun once (8766.15 hours (+/-, depending on which definition you're using)) and how many hours are in 365 solar days (8760). That 6.15 hour disparity is what's corrected with leap days. Without Feb. 29, seasons would slowly (but noticeably) shift. Across a single lifetime, the winter solstice (in the north) could work its way to November. Leap days do *not* address anything related to how the Earth *rotates* on its axis (aside from the fact that that's how we count days).\n\nIf there really was a ~4 minute disparity between a 24 hour \"day\" and a 23h56m4s *solar* day, then you'd notice that the sun would rise/set earlier and earlier. In three months, you'd get sunrise at midnight and sunset at noon. Three more months, sunrise at 6pm and sunset at 6am.  \nThis clearly doesn't happen, and it's because a solar day really is (on average) almost exactly 24 hours. (See all the other answers about sidereal days vs solar days to explain where 23h56m4s comes from).\n\nOn a parting note, I want to actually answer \"where does that extra [time] go?\" Each year, it goes into the changing night sky. The constellations shift with the seasons *exactly* the way the sun would in my hypothetical scenario above. If you could see Orion even during the day, and you kept careful track, you'd notice that it rises and sets 36**6** times while the sun only rises and sets 365 times.",
            "score": 18,
            "author": "ThePrettyOne",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for writing this. I feel like this was a clearer explanation than the others I read. ",
                    "score": 2,
                    "author": "FroodLoops"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You are thinking of the rotation period of the earth. The earth takes slightly shorter than 24 hours for one revolution. \n\nHowever, after one rotation, it also has progressed on its orbit around the sun.  So after one full rotation, the sun is not in the same position. If you wait a bit longer (for a total of almost exactly24h), the sun is in the same position again.\n\nThe leap day has nothing to do with earth's rotation, it has to do with the time it takes to orbit the sun. The earth needs 365 and 1/4 (rounded) days to orbit the sun. The leap day keeps the year aligned with the orbit around the sun. Without the leap day, the seasons would slowly shift (at a rate of roughly 1 month every 120 years).",
            "score": 44,
            "author": "KToff",
            "replies": []
        },
        {
            "level": 0,
            "comment": "The sidereal day is 23h56m4s, which is the time for one 360° rotation of the Earth.\nThe solar day (from noon to noon) is almost exactly 24h, and is the only one that matters for our lifes.\nIf one day you see the night sky at 9pm, you will see the same sky the next day at 8:56, then 8:52 and so on. After one year, this difference will sum to one day, so you will returning seeing those stars at 9 (aproximately, because one year is slightly longer than 365 days)",
            "score": 21,
            "author": "Goregue"
        },
        {
            "level": 0,
            "comment": "Once you account for solar days vs. stellar days the *once-every-4-years* leap day turns out to be **too much**, actually.  Which is why we actually *subtract* leap days!\n\nYou know the leap days as once every 4 years, and yes, that's mostly true.  But did you know that every hundred years, we *don't* have a leap year?  Any year that is divisible by 100, and thus ends in 00 (1900, 1800, 1700, etc...) is **not** a leap year.  BUT, there's a second exception to that exception: Any year that ends in 00 AND is divisible by 400 (*i.e.* 1600, 2000, 2400) is **still** a leap year.",
            "score": 18,
            "author": "garrettj100",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I'd like to congratulate you.\nYou took the base data, calculated the difference and came up with a reasonable question.\nYou were missing one variable, sidereal time, and you sought an explanation as to the variance of theory with observed data.\nYou learned, others learned. Science and logic FTW!",
            "score": 39,
            "author": "lastthursdayism"
        },
        {
            "level": 0,
            "comment": "You're confusing a few different measurements here.\n\nThe 23:56:04 figure is for a *sidereal* day. That is, the time taken for the Earth to rotate once with respect to the background stars. But the calendar works by *solar* days, which are actually 24 hours (at least on average).\n\nNotice how the difference (3 minutes and 56 seconds every day) is almost exactly enough to add up to one extra day each year. That's because the Earth goes around the Sun once per year, so the rate at which its solar days 'fall behind' has to come to one full day each year. (To illustrate, imagine if the Earth didn't rotate at all relative to the background stars. We would still get exactly 1 solar day each year.)\n\nLeap day has nothing to do with the 3-minute-56-second discrepancy. It's due entirely to the fact that we insist on having the new calendar year start at midnight, and the discrepancy between the (non-integer) number of solar days in a year and the (integer) number of days on our calendar.",
            "score": 7,
            "author": "green_meklar",
            "replies": []
        },
        {
            "level": 0,
            "comment": "In 23:56:04 the planet completes one revolution on its axis. This is a sidereal day, and if you want to figure out where in the sky to find a star then knowing the local sidereal time is important.\n\nDuring that time the planet also goes a little bit of the way around the sun. In 24:00:00 the rotation of the planet on it's axis plus the orbiting around the sun combine to get the sun to the same place in the sky (not accounting for seasonal variations). This is a solar day and is the most useful day for day to day life. \n\nIn 365.24 solar days (or 366.24 sidereal days) earth completes one orbit of the sun. Our calendar approximates this as being 365 solar days most years or 366 solar days in leap years. \n\nLeap days are correcting for differences between the length of a year and the length of 365 solar days. The difference between a solar and sidereal day is correcting for the fact that over the course of a year the orbit of the planet \"unwinds\" one day. They're different things entirely. A different orbit could see a year of 365.01 solar days, needing a leap day only once in a century while still having a similar sidereal and solar day length. ",
            "score": 12,
            "author": "Koooooj"
        },
        {
            "level": 0,
            "comment": "A day is 24 hours. If the day weren't 24 hours then after a period of months the Sun would be in the sky at midnight, or it would be dark at noon.\n\nThe year is not a full integer multiple number of days in length, however. And that would cause the seasons to shift their timing in the year over time. Which was what happened when the Julian calendar was in use. The Gregorian calendar adds or skips leap days in such a way that it takes about 3000 years for the timing of the seasons to be off by a day (which can be fixed with ad hoc leap days or skipping leap days, should civilization continue that long).\n\nThe difference you're talking about is the difference between the solar day and the sidereal day, or when the sun appears at the same place in the sky versus when the stars appear at the same place in the sky. What you'll find is that it is roughly 1/365th of a day shorter than a solar day. Over the course of a year the position of the stars relative to the solar time of day shifts over a complete rotation of the sky, because the Earth is in orbit of the Sun.",
            "score": 10,
            "author": "rocketsocks"
        },
        {
            "level": 0,
            "comment": "There are some pretty good explanations here, there's just one further that I thought would be interesting to add:\n\nIf you notice, the difference between the 23h56m4s and 24h over the course of a year is ~1 day. (Almost exactly if you use the exact length of a year and sidereal day, but still off by a little, hence leap seconds.) That is a clue that the difference is a result of orbiting the sun. In fact, if the earth did not rotate about it's axis, a solar day would be equal to a year, and the difference between a solar day and a sidereal day would again be 1 full day. That is exactly what happens if you are on one of the poles, where the sun rises and sets once a year.",
            "score": 4,
            "author": "HawkEgg"
        },
        {
            "level": 0,
            "comment": "This is a conflict between systems. Consider this, from wikipedia\n\n\"In astronomy, the Julian year is a unit of time; it is defined as 365.25 days of exactly 86400 seconds (SI base unit), totalling exactly 31557600 seconds in the Julian astronomical year.\"\n\nThat is an artificial simplification in which the daily discrepancies just get tossed away, they don't accumulate. That is the difference between our simplified system and the real world is fairly constant.\n\nLeap days are used to adjust the Julian calendar in order to be able to keep Stonehenge alignments in synch with equinoxes and solstices and keep track of Easter.\n \nThe algorithm for deciding if a year is a leap year starts like this:\n\nIf the year is evenly divisible by 4 it is a leap year,\n\nUnless it is also evenly divisible by 100 which means it is not a leap year,\n\nUnless it is also evenly divisible by 400 in which case it is in fact a leap year.\n\nThe algorithm usually stops here because we change the calendar more often than the next step size.\n\nThis calendar was designed to keep the seasons from drifting.\n\n\n ",
            "score": 4,
            "author": "farticustheelder",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Earth actually rotates around its axis 3,56 minutes less than 24 hours. If we would not be adding 3,56 min to get a 24 hours day, for everyday demand to get sun on its exact spot on every high noon, we would have on 21. december high noon sun on exact midnight hours (and/or viseversa).",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Fun fact - the difference between sidereal and solar days means that the earliest sunset of the year is not necessarily on the shortest day of the year. As you near the winter solstice (shortest day) the difference becomes significant.\n\nIn the Pacific NW (for example) the earliest sunset is usually Dec 12 (ish). The days continue to get shorter until Dec 21st (or 22nd) because the sunrise gets later faster than the sunset gets earlier.\n",
            "score": 3,
            "author": "somewhat_random"
        },
        {
            "level": 0,
            "comment": "You are confusing the various times. A solar day is 24 hours which is the time from when a particular part of the earth is facing the sun, to when that same piece of earth is again facing the sun. The time you quoted is for a sidereal day, which is a similar definition but to a distant stellar body. The reason for a leap day is to account for the fact that these solar days don't align exactly with the earths orbit, which is a completely seperately defined length of time, at 265.2422 solar days. As you can see this number lines up far better with our leap system.",
            "score": 6,
            "author": "binaryblade"
        },
        {
            "level": 0,
            "comment": "In fact if you want to take into account not only a full rotation if the earth, (360 degrees) and one day closer to one full orbit (365 days), you end up only having to rotate 359 or so to face the same position relative to the sun, which means 24 hours really is close. Close to a minute within 24 hours actually. Which is why if we loosely round to one extra minute each day, we end up with approximately six hours every year, thus the need to account for an extra day every four.",
            "score": 5,
            "author": "ThatKarmaWhore"
        },
        {
            "level": 0,
            "comment": "I'm pretty late to the party it seems, but 23h56m4s is the *sidereal* rotation rate (as others have said), meaning that each non-Sun star rises and sets every 23h56m4s.\n\nBut that's not why I'm here.\n\nI'm here to point out an awesome Lewis Carroll piece about this.  Carroll wrote a bunch of humorous dialogues centered around conundrums of various sorts.  In one of them the big question is what is more useful -- a clock that's right twice a day or one that's right only twice a year?  Alice, of course, picks twice a year (but for the wrong reason) and her interlocutor points out that's silly, since the stopped clock is right exactly twice per day, and to know what time it is you just have to wait until the clock is correct, and then you know exactly what time it is...\n\nOf course, a common sort of clock that's right exactly twice a year is a *sidereal* clock, and it's extremely useful for astronomy and stellar navigation.  ",
            "score": 3,
            "author": "drzowie"
        },
        {
            "level": 0,
            "comment": "the length of a day is defined by measuring planets rotation relative to some other \"fixed\" astronomical object. For that we have one of two options, we can use the object it's orbiting, or we can use far away stars. \n\nIn the first case you get synodic time, and since the earth is orbiting the sun, synodic time for our little rock is usually referred to as solar time. \n\nIn the second case you get sidereal time. \n\nFor the purposes of calendars and tracking seasons and blah blah all that every day use, we use solar time, not sidereal time. The mean solar day is defined exactly as 24 hours (or rather 86 400 SI seconds but whatever). However since a year is given by earth's rotation around the sun, we end up with a small time shortage on the calendar day since it takes about 365.24 solar days for the earth to complete one orbit. Since the calendar date is supposed to represent earth's position in it's orbit and thus the change of seasons caused by distance to the sun and blah blah etc  that .24 would cause the calendar to drift. Thus leap years. \n\nnow sidereal time is mostly of use to astronomers and other folks who like looking at stars. It also gives us a \"better\" true day because the earths motion around the sun slightly extends the solar day by a little under 4 minutes in comparison to the sidereal period of motion. However this does not affect the calendar because our calendar isn't based off sidereal time. ",
            "score": 7,
            "author": "half3clipse",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 6,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Aside from your math being off and confusing solar and sidereal days, an extra day every four Februarys is not the only corrective measure we use. \n\nThere are also leap seconds which are applied when needed, and also century years are not leap years unless they are divisible by 400. (2000 was a leap year, but 1900 wasn't and 2100 won't be) ",
            "score": 7,
            "author": "Hypersapien",
            "replies": []
        },
        {
            "level": 0,
            "comment": "23h56m4s is the length of a sidereal day, which is how long it takes the earth to rotate once relative to far away stars. For our calendars, however, it is much more convenient to go by our rotation relative to the sun. This type of measurement is called a solar day. Going by the solar day, the calendar is off by about 1 day every 4 years, which is why we have leap years.",
            "score": 4,
            "author": "Penguin236"
        },
        {
            "level": 0,
            "comment": "One year is one rotation around the sun and not calculated by 360° rotation time. Earth completes one trip around the sun in 365 days, 5 hours, 48 minutes and 47 seconds. 23 hours and 56 minutes day called sidereal day (aka 360° turn) 24h day is considered 361° turn. 1° is gotten from earth movement in space  ( as far as i know, feel free to correct me ).\n",
            "score": 4,
            "author": "Logic_No",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 6,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Is this on netflix yet?",
                    "score": 3,
                    "author": "iforgotmyolduser"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "A day is 24 hours long. One 360° rotation takes ~23h 56m. These are not the same thing. There are a whole lot of good replies here explaining it.",
                    "score": 6,
                    "author": "calste"
                }
            ]
        },
        {
            "level": 0,
            "comment": "People have already answered your actual question, but as a side note, the leap day by itself is an OVERcorrection for our orbit around the sun. That is why any year that is divisible by 100 will not be a leap year despite being divisible by 4 (i.e. The year 2100 will not be a leap year). However, this TOO is an overcorrection, so years that are divisible by 400 are leap years (i.e. The year 2000 was a leap year)",
            "score": 2,
            "author": "jicerswine",
            "replies": []
        },
        {
            "level": 0,
            "comment": "ok so now we all have devices which update their clocks all the time, does that updated time change according to the seasons? i've noticed my microwave clock has differed from my iphone clock by a few minutes in the last two months (last time we had a powercut and i reset it) but it didn't change much in the six months before that (when we moved house and i last set it) or does it just happen the same amount every day, and my microwave is knackered?",
            "score": 2,
            "author": "ben_jamin_h",
            "replies": [
                {
                    "level": 1,
                    "comment": "Small devices use a [quartz clock](https://en.wikipedia.org/wiki/Quartz_clock), in which a well-regulagted small voltage is put across a cheap crystal. It vibrates at a known frequency, and this is used to count time. They are accurate usually to within 10 seconds a month.\n\niPhones and pretty much any Internet-connected talk to other computers using [Network Time Protocol](https://en.wikipedia.org/wiki/Network_Time_Protocol) where your iPhone asks the internet \"What time is it?\" and it responds, and then they ask/answer a few more times and figure out how long the packets take to travel. The internet computer itself uses NTP and the chain eventually ends up talking to the folks in Colorado and/or Maryland who run the official national time servers (Colorado runs the radio signal for wireless and can survive nuclear attacks... Maryland is just at NIST, close to DC and the official time, which is kept at the US Naval Observatory right next to Mike Pence's official residence).",
                    "score": 2,
                    "author": "rnelsonee",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "If the earth orbits the sun in an elliptical orbit and the south pole is farther away from the sun in the winter( trying to remember 6th grade science), will the orbit change ever so slightly that over time so that the north pole will become farther away from the sun in the winter?",
            "score": 2,
            "author": "kram1234"
        }
    ]
}