{
    "id": "6uc2os",
    "score": 20185,
    "title": "What affect does the quantity of injuries have on healing time? For example, would a paper cut take longer to heal if I had a broken Jaw at the same time?",
    "author": "Atari1729",
    "date": 1502995456.0,
    "url": "https://www.reddit.com/r/askscience/comments/6uc2os",
    "media_urls": [],
    "other_urls": [],
    "postText": "Edit: First gold, thank you kind stranger.",
    "comments": [
        {
            "level": 0,
            "comment": "A distal injury won't affect another injury until it begins needing more resources than the body has to distribute - take burns for example. \n\nIf you had a burn on your hand all sorts of plasma and proteins and immune related cells would be rushing to the site (some already there) causing both local inflammation and an immune response that ultimately results in a blister - the blister is full of immune cells that help to repair the damaged tissues by providing an ideal micro environment for healing. Now let's say there's a burn to a large portion of your body; depending on the degree and the inflammation response (3rd degree burns have a different response as many of the biological channels of cell repair are completely destroyed) while your body will send out all its required immune cells that it has it might simply not be enough - in this case bacterial infections can take hold in the blisters as they provide an ideal environment for certain infections to grow, this results in sepsis and eventually septic shock. Imagine that the bodies immune repair system is spread too thin to repair both burns - it doesn't have a very good system at establishing where it should send immune cells with regard to controlling sepsis beyond directing blood away from the extremities and towards critical organs as septic shock progresses. \n\nUltimately it depends on the nature of the two injuries but yes they could affect one another.",
            "score": 1992,
            "author": "jimbob1245",
            "replies": [
                {
                    "level": 1,
                    "comment": "Does that mean that in some cases it's better to leave a blister intact to heal on its own instead of popping it?",
                    "score": 313,
                    "author": "Ridog101",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's pretty much always a better idea simply because opening a blister introduces an infection risk.",
                            "score": 849,
                            "author": "mehennas",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 81,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 40,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 19,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 52,
                                    "author": "[deleted]",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Is that true for pimples too?",
                                    "score": 50,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Absolutely. Popping pimples can run the risk of rupturing the wrong way and sending some very nasty bacteria right into your body. If that happens, most likely outcome is just making it worse/heal slower, but there could certainly be a worse infection.",
                                            "score": 135,
                                            "author": "mehennas",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 21,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 14,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 13,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 26,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 133,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If they're painful, you can drain them with a sterilised needle and then dress them. ",
                                    "score": 94,
                                    "author": "LogicDragon",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "If you leave them alone, once the healing's done what happens to the blister? Never been patient long enough to find out. Do the fluids just go away and the skin bubble flattens out?",
                                    "score": 43,
                                    "author": "McMammoth",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Pretty much, the bubble flattens and the skin falls off kinda like it does after a sunburn.",
                                            "score": 81,
                                            "author": "Sergiotor9",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "It should be noted that if the blister is in a position that it will pop NO MATTER WHAT (on the bottom of your foot, or a part of your hand that's getting more wear than usual), you should try to pop it as cleanly as possible, because it runs the risk of being ruptured/torn off unintentionally, which will leave a giant open sore with very little protection over it, making your risk higher.",
                                    "score": 5,
                                    "author": "RareKazDewMelon"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "i was under the impression that it's almost always better to leave blisters than to pop them",
                            "score": 57,
                            "author": "wadss",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It is. Lancing a blister slows healing and leaves you wide open to infection, increasing the likelihood of scarring.\n\nThat said, I have done it in the past as a field-expedient just to get home-- sometimes if you're on a long hike, you have to pop them to get your boots back on. You just deal with the downsides once you're back to the car.",
                                    "score": 63,
                                    "author": "ZombieHoratioAlger",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 12,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "If I remember my first aid correctly you always leave them intact and try to cushion around them with moleskin, cutting a hole in the center for the blister.",
                            "score": 12,
                            "author": "yetanothercfcgrunt"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Someone can correct me if I'm wrong, but I think Disseminated Intravascular Coagulation would be a good example of what OP is asking about. If your clotting cascade runs rampant, then you can use up all of your clotting factors and not be able to respond to a secondary trauma that is in need of hemostasis.",
                    "score": 15,
                    "author": "Ah-Cool",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm almost 100% sure DIC is caused by exposure to tissue factor which is not usually seen in circulation and excess thrombin. \n\nPlus if you used up all of your clotting factors you wouldn't clot. ",
                            "score": 3,
                            "author": "StupidityHurts",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "A fun bit of trivia:\n\nIn polytrauma injuries involving a traumatic brain injury and bone fracture, the fracture may actually heal at a faster rate than the same fracture alone. The mechanism is currently not well understood, but some researchers speculate it's related to enhanced macrophage mobilization.\n\nEDIT: For some more formal reading, check out some of work being performed in small animal models: [here](https://www.ncbi.nlm.nih.gov/pubmed/25682315), [here](https://www.ncbi.nlm.nih.gov/pubmed/26636276), [and here](http://globalprojects.ucsf.edu/project/murine-model-polytrauma-understanding-molecular-basis-accelerated-bone-repair-concomitant). Then, even more exciting, check out [this study](https://www.ncbi.nlm.nih.gov/pubmed/22323691) that looked at human patients with combined TBI + fracture injuries. Finally, to try to sum it up as best as we can, check out these lit reviews: [here](https://www.ncbi.nlm.nih.gov/pubmed/25873754) and [here](https://www.ncbi.nlm.nih.gov/pubmed/15710151)",
            "score": 4873,
            "author": "ElFritoBandito",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 2285,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 1586,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 1793,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 252,
                                            "author": "[deleted]",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 200,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 124,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[removed]",
                                                            "score": 13,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 12,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[removed]",
                                                            "score": 10,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 3,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 95,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 203,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 57,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 40,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 33,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 17,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 136,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 30,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 15,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 9,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Well the brain injury heal slower than without the bone injury? I.e. is it just an averaging out, or are both injuries benefited?",
                    "score": 37,
                    "author": "euyyn",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Right now, because of the complexity of quantifying recovery from traumatic brain injuries (what is considered recovered? regain of cognitive function? regain of cells? how do we measure these metrics accurately?), less is known about the brain. Since fracture repair can be quantified quite easily (how much bone tissue is formed? is there a union? how strong is the new bone?), we know there is evidence of faster bone regeneration with an additional  traumatic brain injury.",
                            "score": 36,
                            "author": "ElFritoBandito"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I understood the first part. But my medical and anatomical knowledge is limited :(",
                    "score": 104,
                    "author": "Dyllock105",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Macrophages are white blood cells that eat other cells and \"debris\" like dead cells, bacteria, and virus infected cells. \n\nThe guess there is that a brain injury causes more of them to circulate through your blood stream, leading to a better \"cleaning\" of the fracture site, and faster healing. ",
                            "score": 262,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "So it's like \"Red alert guys! Brain injury! We need everyone working overtime.\" And they happen to fix the fracture while they're at it?",
                                    "score": 69,
                                    "author": "Belazriel",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yes, that's what we think. But if that is true and how it works exactly remains unknown",
                                            "score": 36,
                                            "author": "bantha-food"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 124,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 52,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "But there's more too! Additionally, macrophages may also change their phenotype from the classic \"white blood cell\" that we know to attack, protect, but most importantly collect into another phenotype that promotes angiogenesis, bone formation, and recruitment of other growth factors. The macrophage is an increasingly important cell type in these healing responses!",
                                    "score": 27,
                                    "author": "ElFritoBandito",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 6,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Not exactly. The healing process requires cell replication, and replicated cells age slightly. Aging is a disease of DNA breakdown and we have a limited number of times that each cell line can divide (average dividing number of human cells is 40-50). Those turtles that age to 150-190 years, their diving numbers are in the upper 90's.\n\nStem cells are useful because they are \"cell zero\" some of the earliest cells we have in our bodies. So when they divide and make stuff the dividing number on those cells is super low meaning that those cells are young and function well.\n\nIn test tubes we've demonstrated that elongating our telomeres can increase dividing numbers significantly. ",
                                            "score": 12,
                                            "author": "WinterCharm",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Does that mean that if I hurt myself a lot I would age faster (because my cells are replicating more)?",
                                                    "score": 8,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "So if you found the compound that triggers the white blood cells brain injury response, you'd have super healing serum?",
                                    "score": 4,
                                    "author": "KevinRonaldJonesy"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 231,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 69,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Would this be related to heterotopic ossification in TBI/SCI? ",
                    "score": 62,
                    "author": "_polarized_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Clinically, it definitely looks like it. I've seen plenty of TBI patients get super robust callus formation at the fracture site. The patients with traumatic brain injuries lay down a ton of extra bone precursor (callus) at the fracture and in my experience, it all solidifies into a super stable mass of bone. \n\nBut I've never bothered to check if there's actual data on it. It just \"eyeballs\" very similar to it. Assumed it was a part of the same spectrum. \n\nEdit: Looks like it. \nhttp://dx.doi.org/10.1111/j.1445-2197.2008.04803.x\nhttp://dx.doi.org/10.1089/neu.2006.23.708\n\nIntuitively it made sense, so I'd never bothered to look up. Researchers lump it into excessive bone formation, whether hypertrophic callus or heterotopic ossification. So I'm going with yes. \n",
                            "score": 43,
                            "author": "drawlwhenidrink",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Does this have anything to do with hair growth increasing and darker and coarser hair than normal growing around healing sites?  Guys I met in orthopedic wards that had had major accidents like me seemed to have similar experiences with hair. (Long term the hair went away.)",
                                    "score": 3,
                                    "author": "Retireegeorge",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 56,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 54,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 10,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Please add [source(s)](https://www.reddit.com/r/askscience/wiki/sources) so your post can be restored.",
                    "score": 13,
                    "author": "PatronBernard",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks! Done!",
                            "score": 6,
                            "author": "ElFritoBandito",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 10,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Common to have multiple injuries, like in the surgical ICUs from traumas. Healing comes down to infection control, nutrition (usually the issue) and rehab.\n\nWith large body surface area burn patients, very hard to feed them enough, even with a feeding tube 24 hrs a day to meet calorie requirements to heal.\n\nEdit for additional info: Acute critical illness can lead to catabolism exceeding anabolism, even in adequately nourished people. Obesity, is equal or more risk for wasting.",
            "score": 3612,
            "author": "Professor-md",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wow. I'm curious now how many calories are used in the repair of different injuries.\n\nUPDATE : http://ask.metafilter.com/112868/How-to-measure-calories-burned-to-heal-from-various-injuries",
                    "score": 1283,
                    "author": "EnduredDreams",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Dietitians will frequently calculate increased calorie requirements for our patients in the ICU based on the etiology of their disease for example trauma, infection, burns, etc. \n\nSource, am a doc. ",
                            "score": 1101,
                            "author": "DrThirdOpinion",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 263,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Am surgical/trauma chief resident, I can answer this.   Looks like most answers are vague.\n\nSo there are equations out there to calculate what a persons basal metabolic rate is, ie calories needed to lay in bed and breath.  For the average person this is somewhere around 1800 calories or so.  \n\nFor the severe poly trauma patients and the severe sepsis (infection) patients where nutrition becomes important, they are usually bed bound, intubated, and very sick, (I'll have them on lots of meds and all sorts of crap.)\n\nFor these patients, we will typically not only increase their caloric intake from their basal metabolic rate by 30% or so, we will also make sure they are getting 2grams of protein per kilo (basically the same as recommended for weight lifters). \n\nThis is usually done through a feeding tube as they can't swallow.  \n\nThere are complex methods of determining if that is adequate, it's called a metabolic cart and it measures various chemicals or proteins your body puts out to get a specific caloric need.  This is not done often, as it's difficult.  And mostly we can eyeball it with our equations and get it really close. \n\nLiterally could talk for an hour about nutrition in the super sick patient but I think you get the idea.  So calories around 2500 for the avg sized person and protein around 150 grams a day.  ",
                                            "score": 470,
                                            "author": "cmcewen",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Hey! Question: does class or type of anesthetic change anything? I'd think someone of them might mess with metabolism, but I'm not sure.",
                                                    "score": 32,
                                                    "author": "Ae3qe27u",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Does this kind of thing apply to patients with chronic issues, usually non threatening issues, such as pain?",
                                                    "score": 16,
                                                    "author": "Geawiel",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Not OP but pre-med with many chronic illnesses.\n\nI would assume (and from life experience) that no it does not. Chronic pain and illness patients bodies tend to adapt, sometimes incredibly impressively, to their situation. While our caloric intake should be about the 1800 a day, more or less as many with chronic conditions don't have much excess energy output, things like the meds we're on as well as our appetite and the disorders themselves drastically change the situation. That's why it's not uncommon to see those with chronic health conditions under or overweight. The problem is that for us, our bodies aren't generally trying to heal in so much as it is attacking itself. So the body adapts to that constant. Where when you have something like a burn victim or a comatose ICU car accident patient, it's mostly repair at that point in time. ",
                                                            "score": 23,
                                                            "author": "hai_lei",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Here to second this, but as a not pre-med chronically ill person. We have the same caloric needs and sometimes slightly less than a healthy person (aside from a few very specific diseases). However, many of us may do best with different nutritional profiles than the average person. It's often a pain to figure out the best diet. ",
                                                                    "score": 7,
                                                                    "author": "CATastrophic_ferret"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 47,
                                            "author": "[deleted]",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "For perspective on things, the top end of what healthy athletes are burning for peak performanec is like 8000cal/day.\n\nhttp://www.mensjournal.com/health-fitness/nutrition/the-tour-de-france-diet-how-to-consume-8-000-calories-a-day-20140710",
                                            "score": 70,
                                            "author": "self_driving_sanders",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That's why so many professional athletes (especially football players) gain so much weight when they retire. That 8000 calorie a day appetite doesn't just go away overnight. ",
                                                    "score": 159,
                                                    "author": "iamthegh05t",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It also accounts for the concerns when an athlete shows up after the off-season 10-20 pounds heavier. While the extra weight may affect that athlete's performance, it more importantly indicates that they were slacking on training in the offseason.",
                                                            "score": 106,
                                                            "author": "AnneHathawayTitts",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "How do you even eat 8000cals a day? I break even at about  about 3500 and dont gain unless I can pull 4k constantly. I start to struggle after eating about 3200 to eat anymore.",
                                                            "score": 45,
                                                            "author": "toss6969",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Calorie dense foods. I used race (amateur) on a bike as well as doing long endurance rides (audax) and there would be days I'd eat near 8,000 calories.\n\nCarbohydrate powder in the drink bottle, gels, that sort of stuff. Too many Clif bars. You'd eat constantly actually on the bike. A Clif bar is over 250 calories... 10 of them is over 2,500!\n\nAnd then have two dinners after. Sometimes three.\n\nTo start, you have to get used to eating and digesting *while* actually exercising- *that* is difficult starting out. You don't feel like chewing and swallowing something in the middle of a hard workout.\n\nHence a lot of liquid calories. But once you get over that I didn't find it particularly difficult to be honest.     \n\nI'd still lose weight during the season despite eating a ridiculous amount.",
                                                                    "score": 93,
                                                                    "author": "blorg",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "If you're burning that much do you actually feel hungry for all those calories?  Or is it just constant force feeding?",
                                                                            "score": 30,
                                                                            "author": "notabigmelvillecrowd",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Not OP but I do this kind of exercise. You feel hungry, sometimes insatiably ravenous.  After I did a 16hr hike where I packed 8k calories.  I ate all of it on the hike and ate an entire pizza after I was done.  Then the next day was still hungry more than usual.  I ended up maintaining my weight loss rate with no blip despite eating well over 15k over two days.  If you a lot of exercise as your routine, then you eat a certain way as your routine.  You don't feel like it's crazy or forceful because your body needs and your mentality adapts to it.\n\nNinja edit: There are some people who will feel like it's forceful.  I remember some fellow athletes having this problem.",
                                                                                    "score": 41,
                                                                                    "author": "[deleted]",
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "You don't until it's too late. You either can't perform and it impacts your ability to compete, or worse, you bonk and hit the wall. \n\nNutrition in endurance sports makes all the difference",
                                                                                    "score": 43,
                                                                                    "author": "obi_wan_the_phony"
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Tell me about it, work hard on the feed all day with 2 training days and game day, I've lost 5kg this season and it dosn't help that my legs have built up more from all the running and driving.\n\nSo hard to enjoy a meal orhave the motivation to eat it when constantly full. \n\nmaybe you right,more snake type stuff while working, bars and drinks. Thanks for the advice!!",
                                                                            "score": 7,
                                                                            "author": "toss6969",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "You don't gorge yourself on salads for starters. \n\nAfter that, 3 big meals with various snacks will get you several thousand calories. You can easily eat over 1,000 calories for breakfast alone. 3 large eggs made with cheese and butter, 2 sausage patties, 2 pieces of buttered toast, and a cup of milk is around 1400 calories. Throw in a side of fruit and you're up to almost 1500 calories in a single meal. \n\nWhen I was on a rowing team in high school I could eat all that and still be have room for more. Throw in an equal sized lunch and supper and that's 4500 calories without even trying. Add a bunch of energy bars and other high calorie snacks throughout the day and you've got 8000 calories easy.",
                                                                    "score": 8,
                                                                    "author": "FireHazard11",
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[Here's a video](https://www.youtube.com/watch?v=YQEJyjKTH9g) about a top level strongman eating 12k kcal in one day.\n\nGranted, the man's a giant (6'8\", ~400 lbs), but even at his measurements, his basal metabolic rate is something like 3.3k kcal, so in the video, he's eating almost 4 times his bmr.",
                                                                    "score": 5,
                                                                    "author": "fluffhoof",
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "&gt; How do you even eat 8000cals a day?\n\nThis comment, in reply to an article on \"how to consume 8000 calories a day\".\n\nTL;DR: as /u/blorg said for TdF dudes it's a combo of calorie dense foods (fats) and simple carbs (e.g. rice). Another athlete type to look at is [sumo wrestlers](http://www.livestrong.com/article/479972-the-sumo-wrestlers-diet/) who seem to target between 4k-10k cals/day.",
                                                                    "score": 11,
                                                                    "author": "dee7r"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "You'd gain 2.5 lbs of fat PER DAY on a 12,000 calorie diet even assuming an extremely high (3000 kcal) TDEE\n\nEDIT: this was just a little joke based on the rule of thumb that adding 3,500 calories to your weekly total energy expenditure, you should expect to gain about a pound of body weight (fat or muscle). It's not actually possible to put on multiple pounds of mass in a 24 hour period. RIP your glycemic index if you ate like this, though.  ",
                                            "score": 104,
                                            "author": "darkautumnhour",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "As someone who has always had trouble gaining weight (6'1, 155), I once went on a cruise that was a bit boring but had heaps of amazing, never ending food. I gained around 12lbs in 5 days and always wondered at the amount of calories I was eating per day.",
                                                    "score": 64,
                                                    "author": "Dominant88",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 113,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "For those wondering, a healthy adult can store about 500g of glycogen in their liver and muscles (mostly in the liver). Every gram of glycogen is bound to about 3 grams of water though, so completely depleting those reserves is about 2kg difference on the scale or 4.5lbs, which matches your findings.",
                                                                    "score": 87,
                                                                    "author": "Mechakoopa",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I wonder if it would be possible to use that to an advantage when cycling. Given how much weight is a factor when climbing, if you could manage to deplete your glycogen to the point where you only had a small buffer left and then just consume gels/drinks to maintain that level. Saving, for example, 1.5kg is significant enough that some teams have been apparently already experimenting with functional dehydration: http://www.cyclingnews.com/news/team-sky-doctor-palfreeman-says-functional-dehydration-could-help-froome-climb-quicker/",
                                                                            "score": 5,
                                                                            "author": "AllezAllezAllezAllez",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "It took a few months for me to level back out. Here's A rough idea of what I had every day:\nBreakfast:\nLarge plate filled from the breakfast buffet.\nLunch:\n3 course a la carte \nSnack:\nWhatever I felt like from the buffet\nDinner:\n4 course a la carte\nNight snack:\nPizza or hot dog with fries\n\nPlus, like 8-12 beers per day.",
                                                                    "score": 17,
                                                                    "author": "Dominant88",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Now I am envious of what you were eating and then 8-12 beers on top of that. If I ever wanted to kill myself I would just follow that diet until I died of a heart attack a few years later.",
                                                                            "score": 16,
                                                                            "author": "JimblesSpaghetti",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Haha, I've always said if I got to the point where I just wanted to end it all I would do death by BBQ at a local joint that does a platter for 10 people that contains everything on the menu.  Just keep going back for it until I keel over with brisket and fried oysters hanging out of my mouth.",
                                                                                    "score": 24,
                                                                                    "author": "notabigmelvillecrowd",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Yep, the whole two weeks I was in Japan I looked like I was about 5 months pregnant from gorging on delicious, salty food constantly.  We stayed at a lot of amazing ryokan and were getting served breakfasts and sometimes dinners that were probably about my whole day's worth of calories in one meal.  I didn't want to only eat hotel food, so I tried my best to stuff in lunch and as many snacks as possible in between.  It was like reverse fat camp.  Two days after being home, I was right back to normal.  I was just loaded with water.",
                                                                    "score": 10,
                                                                    "author": "notabigmelvillecrowd",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "That's.... a lot of food. Did you even leave the dining room?!?",
                                                            "score": 12,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "people can fluctuate 10 pounds in a day. Are you sure it wasn't water/food weight?",
                                                            "score": 4,
                                                            "author": "LSF604",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Your body doesn't actually absorb the whole 12,000 calories, right?  In addition to some other things I can't remember, I recall that insoluble fiber also regulates calories absorbed.  ",
                                                    "score": 132,
                                                    "author": "blurryfacedfugue",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Correct. If you eat that many calories in a day it doesn't a go to fat. ",
                                                            "score": 52,
                                                            "author": "Alec_Ich",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[deleted]",
                                                                    "score": 20,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[removed]",
                                                                            "score": 62,
                                                                            "author": "[deleted]",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "[removed]",
                                                                                    "score": 9,
                                                                                    "author": "[deleted]",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Yes, absolutely; if you feel okay to not eat on the other day. It's a hard diet to start doing if you're used to eating constant meals. Go check out the [intermittent fasting](http://reddit.com/r/intermittentfasting/) sub-reddit; there are many benefits to eating this way, though skipping every other day is not necessarily a common IF protocol.",
                                                                            "score": 6,
                                                                            "author": "abhspire"
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[removed]",
                                                                    "score": 45,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[removed]",
                                                                            "score": 41,
                                                                            "author": "[deleted]",
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[removed]",
                                                                            "score": 15,
                                                                            "author": "[deleted]",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "[removed]",
                                                                                    "score": 6,
                                                                                    "author": "[deleted]",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[removed]",
                                                                            "score": 7,
                                                                            "author": "[deleted]",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "[removed]",
                                                                                    "score": 9,
                                                                                    "author": "[deleted]",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[removed]",
                                                                    "score": 7,
                                                                    "author": "[deleted]",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 6,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 170,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 39,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 28,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 13,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 11,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[removed]",
                                                            "score": 20,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "In relation to your curiosity, I find this to be fun and relevant information.  Exercising is a form of injury infliction,  when you exercise you essentially create micro tears and muscle breakdown.  Your body then uses calories on top of your basal metabolic rate to facilitate the muscle damage repair.  Not only do you repair this muscle but it grows more robust to prevent that same injury from occurring again from the same amount of work output.  Even your bones will grow thicker and more robust in response to the torque applied to the structures.  (Best prevention and reversal for osteoporosis is weight lifting anything even a couple pounds heavier than what your body is used to). All this burns calories due to self inflicted micro injuries. \n\nEdit: Yeah,  I like biology not grammar",
                            "score": 290,
                            "author": "sunnydandthebeard",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Muscle growth (I don't know about bone) is a form of microinjury, but weight loss of the average fat molecule (C55H104O6) is really just combining it with 78O2 and exhaling/pissing 55CO2 and 52H2O out.  And no, I saw it on a Ted video. ",
                                    "score": 37,
                                    "author": "TheUltimateSalesman",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You're very close but not quite right. Converting fat into CO2 doesn't require oxygen. \n\n\n\nFat is stored as triglycerides which are three fatty acids attached to glycerol. When fat is broken down, the fatty acids are released and then are broken down themselves. This process is called beta oxidation and it breaks the fatty acids down two carbons at a time to produce acetyl CoA. \n\n\n\nAcetyl CoA then enters the citric acid cycle where it is bound to oxaloacetate to form citrate. The citrate is then converted, stepwise, back into oxaloacetate, losing two carbons in the process. Those carbons leave the body as CO2. \n\n\n\nNotice that this didn't require any oxygen. The O2 that we breath only serves a purpose later on in this pathway. \n\n\n\nThe citric acid cycle results in the creation of molecules which are very good at moving electrons from one place to another. These molecules then move the electrons to the electron transport chain. This is basically a staircase where electrons are passed from one molecule to the next, losing energy each time. The final molecule that accepts the electrons is O2, forming H2O. \n\n\n\nThe energy lost from the electrons during this process is used to pump protons across the inner mitochondrial membrane. When these protons flow back across the membrane, they power a molecule called ATP synthase (through a mechanism that's still being fully investigated) creating ATP, which is the energy currency of the body. \n\n\n\nAs for bone, it is constantly being remodeled with or without any injury. Cells called osteoclasts break down bone and osteoblasts rebuild it. The exact way in the which the bones are remodeled is due to the stresses that the bones have experienced. They will strengthen themselves in areas that experience a lot of stress and weaken themselves in areas that don't. \n\n\n\nIncidentally, this is why it's so difficult to design implants that strengthen or support bones. The metal (which is much stronger than bone) takes most of the stress, tricking the bone into thinking it hadn't experienced any stress and leading it weaken itself. ",
                                            "score": 23,
                                            "author": "squamesh"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Well the parent isn't saying anything about the mechanism of \"burning calories' which is, yes, the decomposition of a fat molecule. The parent is saying that the decomposition of a fat molecule occurs because A) exercise and B) subsequent repair of microtears to muscles ",
                                            "score": 7,
                                            "author": "hana_bana"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "This is one of the primary reasons weightlifting is effectively dense when it comes to energy consumption. Your hour at the gym requires calories to rebuild for the next 36+ hours. ",
                            "score": 55,
                            "author": "All_Work_All_Play",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "EPOC isn't a huge source of burned calories though. it's more like the cherry on top",
                                    "score": 3,
                                    "author": "MickiFreeIsNotAGirl"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "That's really interesting, never really considered a lot of that stuff.",
                            "score": 22,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 13,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Added note, also changes the components of the diet. Normally you want more carbs than fat or protein (about 60-25-15%) but in injury/wound healing you want to up the  fat and protein. ",
                            "score": 15,
                            "author": "ecksdeeeXD",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Per uptodate.com, \"An acceptable initial nutritional goal is 8 to 10 kcal of calories/kg per day and then 18 to 25 kcal and 1.5 grams of protein/kg per day after five to seven days, although these targets have not been rigorously validated... The basis of protein prescriptions is the hope for mitigation of the breakdown of muscle proteins into amino acids, which then serve as the substrate for gluconeogenesis, as reflected in a favorable nitrogen balance.\"\n\nAnd \n\n\"Carbohydrates are believed to be the preferred energy source during this period because fat mobilization is impaired.\"",
                                    "score": 10,
                                    "author": "Professor-md"
                                },
                                {
                                    "level": 3,
                                    "comment": "What's the reasoning for wanting more carbs than fat or protein in a normal situation? ",
                                    "score": 16,
                                    "author": "manyhits",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The carbs are just easy energy. If you don't exsrcise or get injured you don't need too much protein.",
                                            "score": 10,
                                            "author": "[deleted]"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "It's what the sugar industry has brainwashed us into thinking for the past 50 years",
                                            "score": 17,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "For sure (hence macros) same thing goes with bed sores, people with low protein diets are far more susceptible to bed sores and slow wound healing of those same sores.",
                                    "score": 4,
                                    "author": "sunnydandthebeard"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;very hard to feed them enough, even with a feeding tube 24 hrs a day to meet calorie requirements to heal.\n\nis the hard limit the amount of stuff you can physically get in there or the body's ability to process it once it's inside? ",
                    "score": 102,
                    "author": "Nanaki__",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It depends on the condition, but a lot of times surgeries requires patients to be NPO (nothing by mouth) and then after surgeries MDs usually like to advance diet from clear liquids, full liquids, low fiber, etc. These advancing diets tend to be low in calories (think jello, soups). That in combination of having to stop the feeds for procedures and test, and volume limitation (can only concentrate so much). That said, there are some emerging research on whether it's good to feed patients on critical condition or not, so I find that interesting. Source: am dietitian \n\nEDIT: I guess I answered this question for patients who can eat (usually not in ICU who are tube feed dependent). For tube-fed patients, yes, stopping feeds is the major factor in limited nutrition intake. \n\nEDIT2 clarification.",
                            "score": 55,
                            "author": "Deibchan",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 17,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "So I answered the above question for someone who can eat. (Ie not on tube feeding)\n\nClear liquids, at least at my hospital, means minimal calories/carb so like jello and broth. Not much caloric intake, and it's intentional (MD usually wants to see that patient can tolerate this, especially after major surgeries that involves the GI tract). Full liquids can include fat, usually go hard on creamy soups. Adding oil will add calories but couple things to consider: palatability. Many patients are off surgeries and not feeling too great, usually high fat food is not desired nor tolerated. Second: fat is not the most easiest thing to digest, so probably best to not start chugging oil right after. That said, if patient can tolerated then yeah, it'll be good. \n\nGoing on a tangent but dietitians like quick advancement. Depends on disease conditions but there aren't a lot of evidence based research supporting the traditional diet advancement and we think this under feeds people. Rationale is that people get more calorie quicker and heal quicker. But it really depends on the surgeries done and pre-surgical nutritional markers too. ",
                                            "score": 41,
                                            "author": "Deibchan",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Being hospitalized for UC was so bad. Three weeks of jello, broth, and popsicles, plus I was on methylprednisolone so I had a huge appetite. Fats and dairy were completely off the table. I know a couple people who have done it for 6 weeks or more, I think I would have given in and ate a burger or something.",
                                                    "score": 9,
                                                    "author": "VoraciousGhost"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Hmm I've never thought about this, I'm curious too. I'm sure it doesn't taste great",
                                            "score": 3,
                                            "author": "Impulse3"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yeah more of a volume limitation, but a icu dietician/nutrionist would have a better answer. Part of the problem is stopping feeds for frequent surgery and dressing changes under sedation (which we try not to stop feeds for).",
                            "score": 93,
                            "author": "Professor-md",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm being pedantic. But nutritionist is really an unregulated term in most places. So I'd doubt a hospital would have a nutritionist in place of a registered dietitian.   \nSorry. ",
                                    "score": 20,
                                    "author": "MickiFreeIsNotAGirl",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Clinical nutrition is a masters degree. We have them in my hospital (large university med center).\n\nEdit: Dietitians have a masters degree in clinical nutrition. I don't think they're called nutritionists. Not sure.",
                                            "score": 21,
                                            "author": "Professor-md",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Anyone can call themselves a nutritionist, therefore we prefer dietitian. \n\nSource: am registered dietitian",
                                                    "score": 23,
                                                    "author": "I_am_lorde_yaya",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Hospital pharmacy tech who makes TPNs here. We have registered dieticians who calculate the macro nutrients for TPNs (and consult on other dietary needs outside of TPNs/pharmacy's scope). So, at least at my hospital group, they are definitely RDs. \n\nEdit: aka I'm agreeing. It sounded kinda like I was arguing, sorry!",
                                            "score": 8,
                                            "author": "Julia_Kat"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Speech &amp; swallowing therapist here. I work with adults who have feeding tubes. There are two ways feeding tubes work. First is a continuous drip into the stomach, controlled at a certain rate (volume/hour usually 50-80 cc/hr). The second is called \"bolus\" feeds, where a set volume is put in all at once (e.g., 400 mL 4x/day).\n\nIn either scenario there is a volume limit. A stomach can only hold so much based on your body size. \n\nThe other, less obvious issue is that even if you jack up the rate or volume of feeding a person receives per day, it doesn't correlate directly to them gaining weight.\n\nUsually, if someone sick enough to need a feeding tube, there are systemic things going on: cancer, dementia, ALS, Parkinsons... How I usually explain it to my patients and their families is that the person is sick and part of the disease means they can't abosrb nutrition like a healthy person does. Even if we keep putting food in them, their body isn't absorbing it.\n\nSo long answer to your short question... the answer is both. there is a limit to the stuff that physically get into a body. And there is often a limit to what is being absorbed due to the person's medical condition. I hope this makes sense and feel free to ask if you have any other questions.",
                            "score": 11,
                            "author": "redrightreturning"
                        },
                        {
                            "level": 2,
                            "comment": "Dietitian here. I've worked in a variety of settings, including the ICU. The short answer to your question is: both.\n\nHere's the long answer: The limiting factor is really patient-dependant. When a patient needs excessive calories (such as wound healing), usually they'll be tube fed. I've never dealt with burns, personally, so I can't speak to that so I'll just speak from my experience with wounds.\n\nGenerally, we say \"if the gut works, use it\"  so we will always preferentially tube feed (enteral nutrition or EN) over feeding through the vein (parenteral nutrition or PN). Unfortunately, if the injuries are severe enough, we have to use PN. With tube feeds, we're pretty lucky as the formulas are usually pretty customizable. We can choose the ratio of protein to other calories, the concentration of calories, how broken down the formula is, the osmolarity of the formula (simplified: the \"particle load\"), the micronutrients included, fibre content, and can even add modulars for extra protein and fibre. We make this choice depending on the patient's injuries and what we think they can tolerate. PN is a lot less customizable and, because of osmolarity, you usually can't push as many calories per ml of water going in, so patients can end up with edema if they require a lot of calories.\n\nIn terms of EN, our signs of tolerance are things like vomiting, stomach distension (bloating), diarrhea, and gastric residuals (how much formula is sitting in the stomach at a time - this ones a bit controversial). If there is injury to the GI tract or sometimes just as a result of trauma/surgery, the patient can have what's called an ileus, which is basically your GI tract refusing to do it's job of digesting and absorbing food. Depending on what your particular brand of intolerance is and the type of formula you're on will tell us different things about what the tolerance issue is. Sometimes it is as simple as pushing more formula than your body can handle while it's also trying to keep you alive while it deals with your trauma. Sometimes it's a lot more complex. ",
                            "score": 11,
                            "author": "derpandderpette",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "What happens if you don't feed them enough? Will they heal slower or will their condition worsen or get infections or something?",
                    "score": 48,
                    "author": "bman12three4",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yup, all the above. Malnutrition can lead to infections, progression of disease and poorly healing wounds.\n\nEdit: in regard to critical injuries of patients in a hospital. Not paper cuts or a broken jaw.",
                            "score": 79,
                            "author": "Professor-md",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 23,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 19,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 12,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Co-morbidities also influence the healing time as well. People on chronic corticos for COPD, for example, have a very difficult time with healing. Also, type of healing process matters, too: a wound heals slower via secondary intention than it would primary; this principle explains sutures and staples post-op.",
                    "score": 11,
                    "author": "themaninthesea",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; chronic corticos for COPD\n\nTranslation: Long-term use of corticosteroids, the anti-inflammatory type of steroid (prednisone, dexamethasone, hydrocortisone, etc.), for chronic obstructive pulmonary disease causes poor wound healing due to these drugs' effects on immune function, skin elasticity, and activity of cells involved in repair, such as fibroblasts.",
                            "score": 9,
                            "author": "punstersquared"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Okay, follow up question on the whole calorie for healing thing. If I had a limited supply of food, and a fixed date of rescue... would it be beneficial to cut off my legs? First pretending I ate them and then without. Would the loss of all that extra body tissue that needed to be maintained mean enough extra calories for my organs to survive, or would the extra energy needed to heal my stumps far outweigh the usual upkeep of healthy legs?",
                    "score": 33,
                    "author": "aquaqmar",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "First, ew. Second, the shock and risk of blood loss and infection, etc would be great unless you're in a surgical ward and trained. \n\nEating your legs (again ew) would provide calories and energy... But in this scenario you're already starving to death. When that happens your body burns all your fat and starts cannibalizing muscle tissue for energy... And digestion itself takes energy... So I don't think you could expect to get much benefit; your body has already drawn fat and muscle energy from your legs and there's a point of diminishing returns. At that point you'd be so weak and emaciated that the operation would probably kill you anyway without medical support. ",
                            "score": 70,
                            "author": "AnticitizenPrime",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 7,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 19,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "no... it wouldn't help. Your calories would go towards healing you rather than keeping you stable. You would also not be able to do anything without legs.",
                            "score": 35,
                            "author": "Z0di",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Could you please explain your edit? I don't understand.  ",
                    "score": 7,
                    "author": "mikeet9",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 3,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "To answer the question simply, yes, absolutely. \n\nDifferent types of illness have unique calorie requirements. \n\nA polytrauma patient is different than a septic patient is different than a burn patient with regards to protein, carbohydrate, electrolyte, and fluid requirements. \n\nA dietician who works in the ICU could probably answer this question a lot more thoroughly than I can. I usually just write the order for a nutrition consult and leave it up to them. \n\nSource, am a doc, although this is definitely not my area of expertise. ",
            "score": 416,
            "author": "DrThirdOpinion",
            "replies": [
                {
                    "level": 1,
                    "comment": "Does stress stop healing? Or slow healing?  ",
                    "score": 36,
                    "author": "just4luck",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I can't specifically comment on how it speeds up or slows the healing process, but it does physically age your cells due to the oxidative stress they undergo when something bad happens to the body. I remember reading about an experimental IV synthetic anti-oxidant they were trying out on ICU patients which would help buffer the stress, dunno where the therapy is in the pipeline nowadays. ",
                            "score": 37,
                            "author": "4lwaysnever",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Are the calorie requirements for a septic patient unusually high? I seem to remember some arguments when I was hospitalized for sepsis. ",
                    "score": 14,
                    "author": "MaybeImTheNanny"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 855,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; (Bone isn't a tissue but you get what i mean) with two types of ressources to rebuild.\n\nOf course bone is a tissue. It contains osteoblasts, osteoclasts, and various other cell types. They require the same nutrients as every other cell, and osteoblasts require calcium on top of that. \n\nAs to the original question, I don't think there are any data to suggest that a local injury affects regeneration of a more distant local injury. To put things in perspective, your skin and gut are *constantly* shedding tissue and regenerating it. A papercut it is a drop in the bucket compared to those metabolic demands. \n\nBone, likewise, exists as a dynamic equilibrium between osteoclasts, which are constantly destroying it, and osteoblasts, which are constantly making new bone. You can think of healing as osteoblasts temporarily getting the upper hand. There are plenty of situations where unwanted new bone is produced (eg osteoarthritis) with no impact on metabolism or healing elsewhere.",
                    "score": 275,
                    "author": "fastspinecho",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 95,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 52,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 8,
                                    "author": "[deleted]",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 7,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 6,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 14,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm a pain management physician. There's a low likelihood that two separate injuries would significantly affect each other unless they are major (2nd/3rd degree burns, broken bones, etc).\n\nTwo injuries in the same area, however, if the second occurs before the first one is fully healed, or sometimes even after its healed, can predispose to longer healing times and ultimately decreased function and possibly chronic pain. There's evidence that prolonged pain and inflammation can cause neurological changes in nerves that can lead to chronic pain. That's why using ice, nsaids (such as ibuprofen), and most importantly, physical therapy, after an injury is important. ",
            "score": 62,
            "author": "Kleeroy"
        },
        {
            "level": 0,
            "comment": "There is an asksience threat from 2015 about (almost exactly) the same topic, maybe you'll find a satisfying answer there:\n\nhttps://www.reddit.com/r/askscience/comments/3vx6mi/do_multiple_wounds_heal_slower_than_just_a_single/?st=j6h3fu31&amp;sh=3398b910 \n\nFor the lazy: these are the two top comments:\n\n* #1\n\n&gt;\nDepends on how close they are too.\nWounds close mechanically as well as having regrowth. If you take a little biopsy from your skin, first off you have a scab, and you also have stem cells in reservoirs of stem cells around the wound that start to proliferate and these daughter cells migrate towards the centre of the wound where they meet, stop migrating and start to thicken up. Here is a picture where the green is skin (Keratin5) and red are stem cells, and the wound is to the right, so the skin you can see already starting to point to the wound centre. This wound is 4 days old.\nHere is a wound that is totally healed. The scab is the big weird thing on top.\nHowever, at the same time fibroblasts orientate towards the wound centre and start to muscularly contract the wound closed. A 1.5mm wound is basically invisible once the wound contraction is finished, a 3mm wound is less than half that size after a few days.\nAnd so several small wounds in a close location would not optimally contract and might heal slower.\nadditionally\nWounds need blood flow, and that can be effected with multiple wounds. If you have wounds that are local, and interfere with blood flow, they can become chronic wounds. Wounds that affect skin in a complete circle around the arm or leg can be like that.\n\n* #2 \n\n&gt; not necessarily. If one had three paper cuts of small size on different parts of their body they'd all heal at the same rate.\nWhen learning about tissue healing, we are generally taught that there are three phases: Inflammatory response, Proliferation, Maturation/remodeling. In the inflammatory response phase, your immune system activates to fight off infection, when the wound is sufficiently \"sterilized\" the Proliferation phase begins. In this, the granulocytes start collecting near the wound area and new tissue is laid down in a messy \"spaghetti-like\" structure. In the maturation remodeling phase, the tissue is stretched and aligned along the lines of pull of the tissue and the tissue normalizes. That's a brief overview. The type of damage also plays a role. Incisions (straight edged cuts in skin) heal faster than lacerations (jagged edged cuts in skin, like tears). also the deeper the cut is, the longer it takes to heal cause tissues heal from deep to superficial layers. thats it in a sort of nutshell. If you have more questions feel free to ask!\n\n[and further down]\n\n&gt; Your body has metabolic limits, you have limits on the resources you can take in through diet. With multiple wounds those resources are split. How split and how much that slows you down depends on all the usual factors - general health and diet primarily.\n\n**this last part seems to answer your question**, albeit without providing any source.",
            "score": 17,
            "author": "Franzvst"
        },
        {
            "level": 0,
            "comment": "I'm just here to say I love this sub for its great, well supported answers",
            "score": 53,
            "author": "puma721",
            "replies": []
        },
        {
            "level": 0,
            "comment": "There's a lot of great answers on here, and I've also seen several people ask if overall stress appears to affect healing. The answer appears to be yes. There's a famous study where students were given small cuts essentially and were found to heal more slowly closer to exam times.\n\nSome reading on this subject: https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3052954/",
            "score": 8,
            "author": "0bjection1"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 36,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 20,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I broke my left hand two weeks ago when a car hit me while biking. The nails on my right hand hand have continued growing and needed to be cut, however the nails on my left hand have stopped growing. Is this because healing the left hand is using resources before it reaches the nails?",
            "score": 5,
            "author": "shumkins"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 3,
            "author": "[deleted]",
            "replies": []
        }
    ]
}