{
    "id": "7yx524",
    "score": 37669,
    "title": "Why is it that during winter it's not uncommon to have days with abnormally high temperature and summer-like weather, but in the summer it never drops to winter-like weather for a day?",
    "author": "This31415926535",
    "date": 1519143817.0,
    "url": "https://www.reddit.com/r/askscience/comments/7yx524",
    "media_urls": [],
    "other_urls": [],
    "postText": "I live in the USA Midwest",
    "comments": [
        {
            "level": 0,
            "comment": "Just a reminder that /r/AskScience aims to provide in-depth answers that are accurate, up to date, and on topic.\n\nIn particular **anecdotes are not permitted**, especially as a top level comment. This is not the right subreddit to discuss what is your local weather is. So far we have had to remove more than 80% of the comments because most of them are along the lines of \"Funny. In Alabama it's 74°f atm\", \"I am from North Canton, Ohio. I have no idea what you are talking about\" or \"..You’ve obviously never been to England\".",
            "score": 1,
            "author": "electric_ionland",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Hmm, lots of incomplete answers here.\n\nTake a look at [this graph](https://www.e-education.psu.edu/earth103/sites/www.e-education.psu.edu.earth103/files/module03/fig8sol.png) of solar intensity vs latitude.  As you can see, the summer pole receives about as much sunlight as the equator (actually, slightly more because of the 24-hour days in the arctic circle!).  On the other hand, there's a huge difference in energy provided to the equator vs the completely dark winter pole.   As a result, there's a huge difference in temperature between the winter pole and the equator, and not so much between the summer pole and equator.\n\nBut that just explains changes in temperature vs *latitude*, not changes over time, so let's think about weather systems.  Storms are created by the north-south temperature gradient: as heat moves from equator to pole, a small amount of it is converted into kinetic energy.  Heat flow causes motion, just like a very inefficient steam or gasoline engine.  When the temperature difference is large, the \"engine\" runs faster and more efficiently, creating more kinetic energy -- which is to say the storm winds blow stronger when the pole-equator temperature difference is large.\n\nSo.  In the wintertime, the difference in solar heating creates a much larger equator-pole temperature difference than in the summer.  This creates much stronger wind patterns.  So you've got stronger winds, blowing a bigger temperature gradient around across the surface of the Earth ... so you see much bigger temperature shifts from day to day.\n\nEdited to add some examples.  Here are views of temperatures and winds at the 500 mbar level [in northern hemisphere summer](https://earth.nullschool.net/#2017/08/19/1800Z/wind/isobaric/500hPa/overlay=temp/orthographic=-66.65,42.29,316) (last August 19) and [northern hemisphere winter](https://earth.nullschool.net/#2018/02/19/1800Z/wind/isobaric/500hPa/overlay=temp/orthographic=-66.65,42.29,316) (yesterday).  Colors indicate temperature contrast (purple is colder), streaks indicate wind direction and speed.",
            "score": 7023,
            "author": "agate_",
            "replies": [
                {
                    "level": 1,
                    "comment": "That website is awesome. Somehow made it all through University geography without knowing that exists.",
                    "score": 942,
                    "author": "DJ_Rupty",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Back when I was studying meteorology in the early 90s, there were no web sites. Instead, national and world weather maps were faxed every 4 hours to thousands of sites around the US by the National Weather Service. Receiving sites had to have a fax machine printing operating 24/7.\n\nA guy in our department had the primary job of pulling the faxes out -- 30 or 40 with each cycle -- and mounting them up on a big board in our main lobby. He even had to mount the ones received overnight, because in order to see weather trends you had to flip through the last 24 or 48 hours of maps. That's how we produced an \"animated\" weather map.",
                            "score": 1032,
                            "author": "RickRussellTX",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You can still receive weather fax via shortwave radio: http://www.blackcatsystems.com/software/multimode/fax.html",
                                    "score": 248,
                                    "author": "mareko_",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Hah. Maybe our university department got them this way, the guy who ran the weather reporting equipment definitely could've been a HAM operator.",
                                            "score": 78,
                                            "author": "RickRussellTX",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It's not an acronym, so it's just ham radio.\n\nTelegraph guys used the term \"ham operator\" to describe poor/ham-fisted ops. When many of these guys became early wireless operators, they brought the term over as a pejorative to describe the amateur radio guys of the era...even serious amateur experimenters would use the term negatively toward other amateurs. Somewhere in the early history, they started adopting the term as their own.\n\nHowever, it doesn't help that there are several pieces of folklore that do capitalize it.",
                                                    "score": 73,
                                                    "author": "dewdude",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Thank you for the info. I’ve wondered why it was called “ham radio”.",
                                                            "score": 20,
                                                            "author": "HappyMeatbag",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Indeed, you can receive them with a PC and an SDR and decode in software - or just download the source images directly, if you have internet access.\n\nhttp://www.nws.noaa.gov/os/marine/radiofax.htm",
                                                    "score": 2,
                                                    "author": "TheAbominableSnowman"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 10,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 3,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 1,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 53,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 30,
                                            "author": "[deleted]",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 16,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 15,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 10,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[removed]",
                                                            "score": 5,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 7,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "When my 86-year-old dad was about 10 he got a subscription to the weather map/report. It came up to CT from any by train and was delivered to his door like the paper. ",
                                    "score": 3,
                                    "author": "Pinkymouse"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[Windy.com](https://www.windy.com/) will blow your mind. Wind, waves, gusts, weather forecasting, and so much more. Pretty damn accurate (as weather forecasting can be) too.",
                            "score": 204,
                            "author": "PlNG",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Wooooow. Also a great website. Thanks!",
                                    "score": 25,
                                    "author": "DJ_Rupty"
                                },
                                {
                                    "level": 3,
                                    "comment": "Is there a website where you can get a list of every temp record broken by location and date going back decades?",
                                    "score": 4,
                                    "author": "Malak77",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "This is a site I use with some regularity: http://xmacis.rcc-acis.org/\n\nHover over \"Single-Station Data\" and pick \"Calendar Day Summaries.\" Pick which variable/summary you want (record highs would be max temp/maximum, record lows min temp/minimum... you could even do max temp/minimum to find the coldest high on a given date) and in additional options pick \"include date of occurrence.\" Next hit Station Selection and search for a city if you don't know its ID.",
                                            "score": 10,
                                            "author": "85watson14",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I'm addicted to it during hurricane and tornado season, the default view is current wind speeds.",
                            "score": 28,
                            "author": "Ehlmaris",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "\"Hey Ma, that circular zoom should be right outside our window! See anything?\"",
                                    "score": 4,
                                    "author": "fearbedragons"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I still weep for ~~wunderground~~ weatherspark, that site had the best plots for weather ever. Sadly it was taken down due to companies producing the weather data wanting more money, but alas.",
                            "score": 30,
                            "author": "hak8or",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And Weatherspark. It was hands down the best weather site around. It wasn't highly popular, but in \"weather circles\" if you will, it was dearly loved.\n\nIt had a really nice smooth map, and mountains upon mountains of data all neatly organized. It also sat on a full repository of historical weather, temporally integrated in interactive graphs right up to the present day.\n\nSadly most the users were ad-blocking their site and few were signing up for premium ($20...*a year*). They needed to migrate away from flash but didn't have the resources to back it. It's been a few years but I still sad/frustrated about it today.\n\nThe site is still up (https://weatherspark.com/), and still has some good data, but it's a shadow of it's former self.",
                                    "score": 31,
                                    "author": "ItsDijital"
                                },
                                {
                                    "level": 3,
                                    "comment": "Do you mean weatherspark, perhaps?  Wunderground is still alive and well.  Weatherspark still exists but is a shadow or its former self.",
                                    "score": 9,
                                    "author": "tuctrohs",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Wunderground has a really nice 10-day forecast chart, however it seems every few months they make it another click away or harder to get too and push super simplified and completely useless weather previews. Also it seems to misidentify my ISP location like 6/10 times which I find really confusing on how it thinks im anywhere else.",
                                            "score": 23,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Good and bad news on the Wunderground front: the San Fransisco office was closed and there have been a number of changes since being acquired by IBM in the purchase of The Weather Company...but the good news is that the team is currently in the process of cleaning up the site and reestablishing operations in Atlanta. Expect an improved experience with the same great blogs by Masters and Henson soon.\n\nSource: I work with these guys.",
                                                    "score": 3,
                                                    "author": "notkaitparker"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Ah shoot, got them mixed up, fixed my post. Thank you!",
                                            "score": 2,
                                            "author": "hak8or"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Presumably they get their data off of the governmental agencies that produce it?\n\nProcessing that data can be a whole lot of work though, so perhaps they couldn't afford to run the same kind of analysis any more?",
                                    "score": 4,
                                    "author": "zebediah49"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I look at that website every day! Makes it more fun to see and understand the weather. \n\nWas following it all during the bomb cyclone we had 2 months ago",
                            "score": 2,
                            "author": "jamiechronicles"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I've been looking at your graph for ten minutes and I still have no idea what's going on. What is the blue line? What is the red line? Where are these poles you're talking about? What portions of this graph are the temperature differences you're talking about? ",
                    "score": 122,
                    "author": "rdh2121",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 181,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Got it, thanks so much!",
                                    "score": 21,
                                    "author": "rdh2121"
                                },
                                {
                                    "level": 3,
                                    "comment": "This was a really good explanation! Thanks a lot for taking the time to write it up!",
                                    "score": 18,
                                    "author": "[deleted]"
                                },
                                {
                                    "level": 3,
                                    "comment": "...dammit, why didn't I scroll down to this wonderful explanation before re-reading OP's post for another ten minutes...?  Thanks much, Sir Jelly!",
                                    "score": 8,
                                    "author": "bighootay"
                                },
                                {
                                    "level": 3,
                                    "comment": "Isn't the graph showing insolation energy per day. Per second wouldn't it be higher in the tropics, because the sun goes directly overhead.",
                                    "score": 2,
                                    "author": "Freeewheeler",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 3,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "So the Sun is stronger near the equator, but due to the rotation of the earth it shines on each square metre for less time. Have I got that right?",
                                                    "score": 5,
                                                    "author": "Freeewheeler"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The blue line is the solar profile during the winter solstice and the red is the summer (defined as winter and summer in the northern hemisphere)\n\nThe poles are at either end, the x-axis is latitude so the left side is the South Pole and the right side is the North Pole.\n\nLook at the red line (summer) for example. The point here is the right side (North Pole) is about 500 which is only slightly higher than the middle (equater) at about 400, but the left side (South Pole) is much lower at 0.\n\nSo in summer: (0&gt;&gt;400&gt;500) South &gt;&gt; equater &gt; North.\nThere is a much larger temperature difference between pole and equater in a hemisphere's winter.",
                            "score": 3,
                            "author": "Koav",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You seem very knowledgeable about this so you'll probably have at least a basic answer for. It seems like the temperature volatility in each season is getting worse than it used to be. I feel like I'm seeing \"New Record High/Low Temperature\" almost every summer and winter. Am I imagining these changes or are they as noticeable and severe as I seem to be seeing?",
                    "score": 7,
                    "author": "Fermit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Climate change researchers predicted that rising global temperatures would have that effect ",
                            "score": 9,
                            "author": "SlothsAreCoolGuys",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "In the one from August, why is Nepal green?",
                    "score": 13,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was wondering that too. It's likely it's some effect of the Himalayas ",
                            "score": 5,
                            "author": "FullOfEels",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I was thinking the same thing, but they are much longer than that area is wide.",
                                    "score": 3,
                                    "author": "[deleted]"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I believe that is actually The Qinghai—Tibet Plateau. \n[Wiki](https://en.wikipedia.org/wiki/Tibetan_Plateau)\n\nThough I don't really know why it's green, I would guess it has to do with its elevation &amp; composure.",
                            "score": 5,
                            "author": "AmplexorJ"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "What is happening at the whirl pool at \n\n35.50° N, 95.25° W\n\nIn Oklahoma",
                    "score": 8,
                    "author": "FlyingMerpa",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well, it was 69 degrees when I woke up, and by 10, it was around freezing.  There is ice up in my trees right now.  So, a strong winter storm, to answer your question.",
                            "score": 18,
                            "author": "HughJorgens",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Um, please keep it there.\n\nThanks,\n\nWisconsin",
                                    "score": 11,
                                    "author": "bighootay"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 15,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You're right that I've swept a huge amount under the rug here -- coriolis forces, geostrophy, baroclinic instability, and boundary layer phenomena -- to focus on the thermodynamics. \n\nBut I think that considering the atmosphere as a heat engine leads to the inevitable conclusion that greater temperature gradients mean more mechanical energy, which requires greater heat flow to power it -- and thus stronger temperature advection, regardless of the mechanism which produces it.  Even if the Earth had no Coriolis force, the wind patterns and heat transport would look very different, but temperature advection would still be greater in winter than summer.",
                            "score": 23,
                            "author": "agate_",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That is an amazing site!  Thanks!",
                    "score": 2,
                    "author": "KJ6BWB"
                },
                {
                    "level": 1,
                    "comment": "Is there a restorative mass flux from the poles to the equator in the upper atmosphere?",
                    "score": 2,
                    "author": "iorgfeflkd"
                },
                {
                    "level": 1,
                    "comment": "Why does the Southern hemisphere receive more insolation, as seen in the first graph?",
                    "score": 2,
                    "author": "qLir",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "https://www.reddit.com/r/askscience/comments/7yx524/why_is_it_that_during_winter_its_not_uncommon_to/duk9jv9/",
                            "score": 2,
                            "author": "agate_"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "In Australia - where there's ocean to the south of us all the way to Antarctica - we can get cold fronts during the middle of summer that can bring freezing conditions at altitude, e.g. [like this event in 2006.](https://www.theage.com.au/news/national/victorias-white-christmas/2006/12/25/1166895228377.html) Like /u/TheRealNooth and /u/seasaltandpepper explained, to the north of the US is a landmass which transfers heat more quickly than water, thus it doesn't have the chance to remain cool in summer or warm in winter like the Southern Ocean does.",
            "score": 292,
            "author": "arcedup",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was thinking straight away that OP has never been to Melbourne. Four season in one day indeed.",
                    "score": 30,
                    "author": "SharksCantSwim",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And that's completely stable compared to Auckland's four seasons in one hour during spring. In Christchurch it's perfectly normal to go from 32C one day down to 12C the next. ",
                            "score": 7,
                            "author": "chopsuwe",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I live in Wellington and just had to look up the definition for \"Summer\". Is it an actual thing that happens?",
                                    "score": 8,
                                    "author": "Kid_Adult"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Us Americans don't get out often. We're all locked up in our cookie-cutter houses, clutching on to our guns and bibles, ignorant to the fact that there is a Southern Hemisphere. ",
                            "score": 3,
                            "author": "KrakenWarg"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Having moved from SE Australia to NE North America I really noticed the reversal in the variability of the seasons. To illustrate the consistency of Melbourne winters and the variability of the summers I looked up the record maximum and minimum temperatures in January vs July. The data really confirms my own qualitative observations that summer=variable and winter=consistent in Melbourne\n\nJanuary temperature range: 72 F (record high: 114 F; record low: 42 F)\n\nJuly temperature range: 47 F (record high: 74 F; record low: 27 F)\n\n\n\nData from [wikipedia](https://en.wikipedia.org/wiki/Climate_of_Melbourne).\n",
                    "score": 36,
                    "author": "jack47",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yep Melbourne has a [temperate oceanic climate](https://en.wikipedia.org/wiki/Oceanic_climate) , which features a small temperature range. I’m always amazed when I see American cities that have temperature ranges from -30C to 40C.",
                            "score": 26,
                            "author": "nachojackson",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hey, Minneapolis records are -41 to +42 C. It's -7C out right now, but it was shorts weather two days ago at 20C. ",
                                    "score": 15,
                                    "author": "fastinserter",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 971,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 210,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 171,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 48,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 6,
                                            "author": "[deleted]",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 1,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 1,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 78,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 35,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 19,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[removed]",
                                                            "score": 4,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[removed]",
                                                                    "score": 2,
                                                                    "author": "[deleted]",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 9,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 6,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 11,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 13,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 3,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 7,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The summer equivalent to a warm winter day would be a cold night.  Summer in many climates is quite humid.  On a cool night, the temperature will often drop to the dew point or a little below, and dew will drop out of the air.  A phase change from water vapor to liquid water entails removing a larger amount of energy than just changing the temperature, and so the temperature tends to stop dropping fast when it hits the dew point.  \n\nIf the temperature had been able to drop lower overnight, the next day wouldn't get nearly as warm and could be like a winter day.\n\nDeserts typically get colder at night than similarly warm humid places.  Part of that is the lack of cloud cover but part of of it also the lack of this dew point clamping effect.",
            "score": 532,
            "author": "tuctrohs",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 44,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's correct--the heat capacity of humid air is higher than that of dry air. But that effect is pretty small, only a few percent.  \n\nEnthalpy is a catch-all term to include the various energies involved.  In this case that most prominently includes the energy stored by the heat capacity--the energy used the change the temperature--and the energy involved in phase change between liquid and vapor.",
                            "score": 32,
                            "author": "tuctrohs",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you for the explanation.",
                                    "score": 5,
                                    "author": "xaphanos"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Nights can get quite cool in the summer in the Texas Hill Country. I got stuck on top of [Enchanted Rock](https://www.atlasobscura.com/places/enchanted-rock) in an overnight August rainstorm (when it's often well above 90F during the day) and it got pretty chilly by daybreak due to the diurnal temperature shift. In the higher elevations and arid regions of the West, and on the Pacific Northwest Coast, summer temperatures have a pretty wide range.",
                    "score": 46,
                    "author": "thelazarusproject",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 18,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Spent years living in Dallas Texas, it doesn't cool down at night during the summer. Unless you count going from 105F and 70% humidity to 92F and 90% humidity \"cooling off\" :-/",
                                    "score": 4,
                                    "author": "Haber_Dasher",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Dude, no.\n\nLast year it was 98 and our coldest day was -4, that's a 102 degree difference between winter and summer.\n\nthe PNW's temp only varies by about 30 degrees over the seasons.",
                            "score": 5,
                            "author": "bumblebritches57",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "There's a difference between winter warming and summer cooling, though.\n\nIt's not entirely uncommon to have one or two days that creep about 10 Celsius in an Edmonton winter (I've seen it hit 20, even), and then plummet back to -20 a couple of days later. I've never seen June - August drop down to -20.",
                    "score": 4,
                    "author": "renegadecanuck",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well, what you described was a 30 degree shift - have you ever seen June-August drop 30 degrees in the night from the highest temperatures in the rest of the summer?",
                            "score": 7,
                            "author": "nicholaslaux",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Most weather has to do with the jet stream, it can be warm/cool and then a front passes/the jet stream dips and it’s freezing. ",
                            "score": 2,
                            "author": "gonnaherpatitis"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Is this why, in high plains or mountainous regions (which are pretty arid, like parts of the western Dakotas or the western third of Montana) will often end up with a not insignificant amount of snow in early July for a few days and then it's suddenly summer again like nothing ever happened?",
                    "score": 3,
                    "author": "conflictedideology"
                }
            ]
        },
        {
            "level": 0,
            "comment": "In the U.S. Midwest you have the cold Arctic to the North of you and the warm Tropics to the South of you.\nIn the higher latitudes (north), you have a winter where it is pretty much always cold. Arctic winters don't have warm winter days like in the Midwest. In the tropics it is pretty much always summer. It is hot year-round.\n\nDuring a Midwest winter sometimes the air will blow down from the north and be very cold, but sometimes it will blow from the south and be warmer. There might be a 100F difference or more between northern Canada and the equator. Cold northern winter air and warm tropical air meet in the middle and we experience some of that large temperature difference.\n\nDuring a Midwest summer, the same thing happens except that the arctic is now also experiencing summer. Northern Canada is now warmer so there might only be a 40F difference between northern Canada and the equator. The midwest still experiences some cooler air traveling down from the north, but it isn't nearly as cool, so we don't experience nearly as large a difference in temperature.\n\nThe other factor involved is exactly where the cold arctic air and the warm tropical air meet. In the winter, they meet much further south while in the summer they meet farther north. This boundary is basically the polar front jet stream, which you can see from this [diagram](https://climate.ncsu.edu/images/edu/polar_front_summer_winter.jpg) is located further south in the winter. You can view the current jet stream maps [here](http://squall.sfsu.edu/gif/jetstream_init_00.gif). You can compare that to this [map](http://www.intellicast.com/National/Temperature/Current.aspx) which shows generally warmer temperatures south of the jet stream and colder temperatures north of the jet stream. ",
            "score": 127,
            "author": "96385",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think this is the real answer OP is looking for. In the US midwest especially the jet stream flip flops all over the place in winter. It's why we had a high of 80 degrees yesterday and in two days it's supposed to be below freezing.\n\nWhen the wind is blowing up from the south we have winters almost as mild as California. When the wind is blowing down from the north we have winters almost as bitter as Michigan. ",
                    "score": 48,
                    "author": "dsf900",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Thank you for actually answering the question, I swear all the answers had a ton of information that didn't answer it.",
                    "score": 6,
                    "author": "FPMC4172",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "This is the only answer that makes sense to me and actually answers OPs questions ",
                    "score": 4,
                    "author": "Shakedaddy4x"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is a really great question, and it would take me several hours that I don't have to put together a complete and understandable response. But I'll put some basic points below:\n\nFirs, it's hard to quantify something that is kind of abstract like the phenomenon you describe, but it does have a basis in truth. [Using Chicago as an example](https://en.wikipedia.org/wiki/Climate_of_Chicago#Data): In January, the average temperature (not the average high or low, the average overall temperature) is 20.8F (-6.2C). The record high in January is 67F (19C) and the record low is -33F (-36C). That's a departure of +46F and -54F between the average temperature and the record highs and lows. In contrast: in July the average temperature is 71.7F (22.1C). The record July high is 111F (44C) and the record low is 40F (4C). That's a similar departure for the record high (+39F) but a much lower departure for the record low (-32F).\n\nSo what is the cause of this discrepancy? This is due to many factors, most of which are hard to explain at anything less than a college level, but I will aim for high-school level and see how I do.\n\n\n**1. Thermal radiation**\n\nThe major contributing cause has to do with the different phenomena that cause air to cool down vs warm up. Ignoring small effects, air cools down almost solely due to [thermal radiation](https://en.wikipedia.org/wiki/Thermal_radiation) escaping into space. Thermal radiation is a very important phenomenon that is sadly misunderstood by many (because it is often poorly explained, even by physics teachers!), but in a nutshell, all matter, everywhere in the universe, emits [electromagnetic radiation](https://www.livescience.com/38169-electromagnetism.html), and the amount of energy it releases via this radiation goes up as the temperature goes up, and down as the temperature goes down. The earth and air are no exception, they are both constantly releasing thermal radiation, and without external sources of heat they would be constantly cooling off.\n\nIgnoring effects from clouds and the atmosphere absorbing and re-emitting the thermal radiation (these effects are not negligible, but not important to this explanation) it gets cooler at night because the ground and air are emitting thermal radiation out to space. This is a slow process, that is made even slower by the fact that as it cools down, it emits less energetic thermal radiation, so the rate of cooling slows down as the temperature drops.\n\nThis is all in contrast to the way the earth heats up: via light from the sun. Sunlight is (roughly) constant and [very energetic compared to the weak infrared radiation released by the earth and its air](http://faculty.icc.edu/easc111lab/labs/labi/waveradi.jpg). Even a very small amount of sun is enough to offset the cooling by earth's thermal radiation, so in the summer, with long sunny days and short nights, there just isn't much time for the temperatures to drop significantly.\n\n**2. Polar day vs. polar night (summer vs. winter)**\n\n*Note that the following explanation is specific to the [mid-latitudes](http://isen.northwestern.edu/sites/default/files/images/articles/2016/oct/Horton_globe_widgetLARGE2.png), which are areas which are not in the tropics and not near the north or south pole. It is also northern-hemisphere-specific, you need to flip the directions if you're in the southern hemisphere.*\n\nGoing along with the above point, it's worth pointing out that, when it's very cold out, the air that you're feeling didn't get that way just because of nighttime cooling: it's almost always because that air came from a much colder region. Cool/cold snaps, both in winter and summer, result from winds blowing from the north. Likewise, heat waves are usually due to air which originated further south, just because areas further south have the sun closer to overhead, and so the [solar heating is stronger](http://shrinkthatfootprint.com/wp-content/uploads/2015/07/irradiance1.jpg).\n\nIn the winter, the polar regions are in a constant night, meaning that unless warmer air is pushed up from the south, the air will just continually get colder, and colder. So even though radiational cooling as explained above gets slower and slower as you get colder, this can result in **very** cold temperatures over the course of weeks and months of constant night! \n\nOn the other hand, in the summer, the northern arctic is in constant daylight. The sun is at a low angle for sure, but even this feeble heating influence is enough to counteract most of the cooling due to thermal radiation, and it means that any air pushing south to create a cold snap will start at a much higher temperature, and even if it doesn't warm up at all as it moves south (in reality it will be warming up at least a little) it just won't be the extreme, below-zero cold that is possible in the winter.\n\n**3. Humidity's restriction on cooling air**\n\nThe existence of water vapor means that heating-vs-cooling is not an even process: for all intents and purposes, you can heat air indefinitely without hitting any barriers, but if you cool off air that has some water vapor in it, eventually you will reach the dew point: the temperature at which the humidity is 100%. When you cool down to that temperature, water vapor will start to condense into a liquid (or solid), which is an exothermic (heat-releasing) process. This means that any further cooling will be much slower, because of this extra energy that is constantly being released by the condensing water.\n\nBecause average temperatures are higher in the summer, average humidities are also higher (outside of desert areas that have very little liquid water available to evaporate). This means that it is very hard to get the right circumstances in the summer to get very cold temperatures.\n\n**tl;dr: Unfortunately I really don't have one. It's a complicated subject with complicated causes. I tried to keep the above as simple as possible, go ahead and give it a try!**\n\nWell, this answer got way longer than I thought it would, and it doesn't even really come close to the full explanation I wish I could type up. But let me know if you have any follow-up questions, and I'll try to clarify things as much as possible!",
            "score": 64,
            "author": "wazoheat",
            "replies": [
                {
                    "level": 1,
                    "comment": "This was a very helpful and thorough explanation. Thanks for taking the time to write this.",
                    "score": 12,
                    "author": "This31415926535",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "&gt; 3. Humidity's restriction on cooling air\n\nI just want to upvote and emphasize the role of humidity, which I didn't mention in my answer upthread.  In particular, the limit on water vapor abundance increases *exponentially* with temperature, and evaporating water absorbs a large amount of latent heat.  This means when you heat and cool cold air, most of the energy just goes into changing the temperature (sensible heat), humidity is a negligible factor.   But when you heat and cool *hot* air, more of your energy goes into driving evaporation and condensation (latent heat), so changes in actual temperature will be proportionately smaller.",
                    "score": 11,
                    "author": "agate_"
                },
                {
                    "level": 1,
                    "comment": "This is an easy to understand, thorough explanation, thank you!",
                    "score": 2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 33,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 9,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "It actually does happen. Ok, the first one that came in my mind wasn’t in summer, it was in May. But same idea. \n\n“Temperatures have plummeted in the past two days from 28 degrees Celsius (82 degrees Fahrenheit) on Saturday to 0.3 degrees Celsius on Monday.  (.....) However forecasts for the next few days predict temperatures soaring back above 20 degrees Celsius. “ \n\nhttps://www.sott.net/article/245456-First-Time-in-50-Years-Snow-Hits-Bosnian-Capital",
            "score": 178,
            "author": "nietbeschikbaar",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 45,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 16,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 39,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 20,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 7,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 7,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 5,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 3,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 3,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 36,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 36,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 7,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 6,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 8,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "The record high for Feb in Minnesota is 76°f while the record low is -60°f.  Averages are where those took place are mid 20's for the high and single digits for lows.\n\nThe record 24h change is 71°.\n\nThere was an almost 70° day in Feb, last year.",
                    "score": 7,
                    "author": "So_Full_Of_Fail",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 3,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 3,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "2 basic reasons.\n\n\nTL:DR\n1.  Artic air is colder in the winter than it is in the summer so you don't get real cold swings in summer, Tropical air masses are basically the same temperature in winter and summer, so if it does make it to the Midwest in winter it will still be warm leading to a larger temperature swing.\n2.  The Jetstream is stronger and closer to the Midwest in the winter.\n\n\n1.  The area around the north pole goes through temperature changes.  In the winter it is really cold(about -30F), so when that cold air gets pulled down into the Midwest it is really cold and we get to deal with all the wonderful things that cold weather brings.  In the summer that artic air is much warmer(37-54F).  So even if you get air coming south from the artic in summer it is not as cold to begin with and with much more energy being added along the way by the sun in summer it will not be nearly as cold as it is in the winter when it arrives.  Now for the opposite.  The temperature in the tropics is almost constant.  So no matter what time of year it is the same temperature air will be coming up.  So in winter, that tropical air is the same temperature as it is in summer and we notice a spring like warmup in the Midwest.\n2.  The jet stream position is such that it is just south of the Midwest in winter but still close enough that a small shift can bring up warm air.  In the summer the jet stream is much farther North meaning a large shift, much larger than in winter would need to occur to pull artic air down to the Midwest.  Add to this that it is weaker in the summer and stronger in the winter and you are more likely to get large temperature swings in winter than you are in the summer.",
            "score": 13,
            "author": "topgun2582"
        },
        {
            "level": 0,
            "comment": "[Chinook wind](http://https://en.wikipedia.org/wiki/Chinook_wind) is one cause of the warm air during winter. Essentially, you get warm air coming over a mountain that can displace the cooler air. I can't think of a similar weather phenomenon for summer to winter-like weather. ",
            "score": 10,
            "author": "Plane_freak",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I run a site that alerts on watches and warnings issued by Environment Canada and I've stored them for a few years.  They issue a Frost Warning when \"during the growing season\" ... \"widespread frost formation is expected over an extensive area\"  (https://www.canada.ca/en/environment-climate-change/services/types-weather-forecasts-use/public/criteria-alerts.html#frost). \n\nI used frost as an indicator of non-summer like weather \"during the growing season\" and I looked back at Regina (middle of the Canadian prairies more or less) and here's what I found:\n\n\n\nYear | Frost Warnings\n----|--------------\n2014 | 4\n2015 | 6\n2016 | 1\n2017 | 2\n\nNow that's hardly a definitive list of what may constitute \"winter weather\" in summer, but it should show that it certainly does happen .",
            "score": 4,
            "author": "iamnos"
        },
        {
            "level": 0,
            "comment": "Its because the longwave pattern during the summer is zonal and the long wave pattern in the winter in meridonal. The longwave pattern in the typical of the polar front jet which is the boundary between cold and warm air. It moves north during the summer and becomes zonal (flattened and straighter). In the Winter cold air forces its way south which causes the PFJ more meridonal (which is more like a steep sine wave. Cold air is +N of the jet and Warm air is -N of the jet. So, long story short, summer is more static in temperature due to the PFJ where winter is more erratic due to the variations in the PFJ. I taught meteorology for a few years for the USAF.  ",
            "score": 8,
            "author": "Charles_DexterWard"
        },
        {
            "level": 0,
            "comment": "Changes in air mass. High pressure keeps low pressure out and during summer the influx of solar radiation strengthens high press regions so low pressure is restricted to higher latitudes. During winter there is less solar radiation so high pressure systems weaken/retrograde and that allows low pressure to encroach closer toward the equator. ",
            "score": 6,
            "author": "skinnycalfman"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 14,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "It DOES happen, but it is rare.\n\nBut why do we have more warm days in winter than cold days in summer?\n\nThermodynamics.  In the summer, everything collects and holds heat.  The ground, the air, buildings, roads, cars, all of it.  The sun, even on a cloudy day, is constantly adding heat to every lighted surface.\n\nThere are no mechanisms other than convection (heating gas) conduction (heating solids or liquids) or radiation (pure energy via infrared) to move heat.  If there is no point source of low temperature, temperatures cannot fall.\n\nA cold front, or storm can bring in cold air from far away, or high in the air, but other than that, there are few viable 'sources' of cold to provide low temperatures in summer.\n\nBut in the winter, there is always a source of heat, at least part of the day.  The sun.  Add some warm air or a storm that formed over warm water, and you can get a warm day in winter.\n\nTLDR: There are few 'sources' of cold (low heat) in summer, but there is always a source of heat in winter.",
            "score": 4,
            "author": "Farmerbob1",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[Here](https://weather.com/sports-recreation/ski/news/5-extreme-temperature-drops-20130118#/1) is an article on Weather.com that describes multiple such instances. As others have alluded to it’s all to do with air currents and in these particular instances the specific geography around them comes into play.",
            "score": 2,
            "author": "LstCrzyOne"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 2,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "There is thing called the polar front jet and during the summer time but tends to be zonal which is sort of a long flat wave pattern. During the winter time this jet moves south and becomes move wavey and when it becomes wavey it brings with it frontal systems. In the frot of these waved is warm air and behind are cold air. In the summer time weather changed tend to be gradual.",
            "score": 4,
            "author": "mrjakeness"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 5,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Because heat is created by the sun that does exist. But cold is a result of the lack of a heat source. The sun makes its appearance felt when conditions make it possible during the winter months. On the other hand in the summer when the sun is  in its closest position for higher heat.  It ( the heat source) does not disappear or move further from the earth. And when it’s real cloudy or a storm arises it is not enough of a shield to stop the heat sources impact on the environment. ",
            "score": 4,
            "author": "timlinkc"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 2,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 2,
            "author": "[deleted]",
            "replies": []
        }
    ]
}