{
    "id": "mhkbe3",
    "score": 24478,
    "title": "Many of us haven’t been sick in over a year due to lack of exposure to germs (COVID stay at home etc). Does this create any risk for our immune systems in the coming years?",
    "author": "idiomech",
    "date": 1617239490.0,
    "url": "https://www.reddit.com/r/askscience/comments/mhkbe3",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "The short answer is no. The long answer: Our immune systems aren't like muscles that need to be worked out to grow strong. By the time we reach young adulthood, we are (under normal circumstances) exposed to so many microbes, pathogens, spores, allergens, etc that we have very robust immune responses, even to things we haven't been exposed to. This isn't necessarily because we have the antibodies for every disease we've been exposed to being produced and floating around our bodies at all times as \"strength\" would suggest. Rather, our immune system maintains \"the plans\" for those antibodies so if we are re-exposed to a pathogen or encounter one that's similar to one we've had in the past, our bodies can quickly and efficiently drum up the antibodies necessary to kick it to the curb.\n\nComing into contact with a pathogen triggers an immune response whether we've been exposed to it previously or not (hence why novel covid-19, for example, didn't have a 100% mortality rate), but this won't make your immune system stronger because that's not how immune systems work. They don't strengthen, they diversify. As a result, low exposure to pathogens in 2020 due to social isolation doesn't weaken or atrophy immune systems. But we don't need constant exposure to different things for our immune systems to be able to run immune responses.\n\nThat's not to say that social isolation doesn't have an effect. There's research to show that immune responses are diminished in individuals experiencing stress, loneliness, anxiety, and other negative psychological stimuli. An aggregate of 148 different studies found that people who were more socially connected had a 50% lower mortality rate. One experiment even found that people with many social ties are less susceptible to the common cold which is another coronavirus. This is not a direct effect however, it's indirect.\n\nAnd almost all bets are off with influenza. As other commenters have mentioned it's going to be very difficult to create an effective flu vaccine for the upcoming season due to the gap in case data from the prior year. Flu almost always jumps from animal populations to human populations on a regular basis so the virus is \"novel\" very often. Again, we have some ability to mount an immune response to it, but influenza continues to maintain a high mortality rate given how commonplace it is.",
            "score": 3338,
            "author": "WearingCoats",
            "replies": [
                {
                    "level": 1,
                    "comment": "Interesting! I was going off the logic that I’d heard that young kids whose parents try to keep them away from germs might be actually hurting them by not giving them germ exposure. But it sounds like that might be more of an issue for children, not adults. Does this create risk for children who have had little bacterial exposure the last year? Or is it a short enough period of time not to matter?\n\nRelated link: https://askdoctorg.com/kids-germs-bubble/",
                    "score": 446,
                    "author": "idiomech",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It is correct that exposure while young will help build your initial immune capability and that building phase is finite. You reach a point where your immune system has a pretty good database to work off of after a few years of encountering infectious or inflammatory stuff. \n\nWhat people don’t consider is that on a daily basis, our bodies are launching an immune response to literally millions of attacks that we don’t even know are going on because not every immune response causes symptoms. (Fun side fact, the symptoms of an illness are not caused by the pathogen, they are the result of your body’s immune response. Fever for example is your body raising its own temperature in an attempt to kill foreign bacteria or viruses). Even with lower socialization in quarantine, our bodies are still inundated with countless immune triggering pathogens, bacteria, spores, allergens, even our own cell mutations. Just because you haven’t gotten a head cold in a year or dodged the flu doesn’t mean your immune system isn’t still being put to the test. The world is a filthy place. \n\nThat being said, unless kids have been in hyperbaric chambers all 2020, they’re probably still being exposed to enough immune triggers to keep developing healthy and normal immune responses.",
                            "score": 649,
                            "author": "WearingCoats",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Generally agree, (though would note that some classic symptoms are caused by the immune system rather than the pathogen, but there are still plenty of symptoms and illnesses caused directly by pathogens)",
                                    "score": 118,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 42,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "All good, it's interesting stuff. Bacteria (and one virus) that produce exotoxins have direct effects which are often severe, causing many types of food poisoning, whooping cough, botulism, gas gangrene, some staph infections, and major rotavirus symptoms. Then plenty of bugs have mechanisms that dampen down immune responses and they cause a lot of tissue damage and susceptib ility to other opportunistic infections while the immune system isn't looking, eg rubella infection of a fetus, gas gangrene (again), measles encephalitis, AIDS-associated fungal infections, various bacteria that cause \"flesh eating\" ulcers and soft tissue damage (mycobacterium ulcerans, group A streptococcus) etc. There are undoubtedly effects on the immune system by all these bugs, but not all symptoms are caused by the immune system.",
                                                    "score": 113,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Right, of course! Didn't think about toxins at all, and as the other commenter said, tissue damage is also a big thing. \n\nThanks for the reply, this was very educational!",
                                                            "score": 31,
                                                            "author": "TheResolver"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "\nI believe that symptoms actually caused by the pathogens themselves, would actually be symptoms from destroyed organs or parts of the body itself. I would appreciate a specialist's input, but I think for example that the internal bleeding from Ebola is probably because of the pathogen itself... \n\nEdit: Changed \"that destroy\" to \"from destroyed\"",
                                                    "score": 19,
                                                    "author": "dionisus26",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "That is actually a good example, like rupturing or somehow destroying tissue and similar things makes sense. Thanks for the input!",
                                                            "score": 13,
                                                            "author": "TheResolver"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Something that always confused me is: if we get a fever because our bodies are trying to kill the pathogen with heat, why do we take drugs to lower the fever?",
                                    "score": 30,
                                    "author": "metalanimal",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Generally, to ease the suffering, and high temperatures for prolonged times can cause serious damage to the body...",
                                            "score": 56,
                                            "author": "dionisus26",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "So am I correct in saying that every single food supplement that claims to \"strengthen your immune system\" is snake oil?",
                                    "score": 10,
                                    "author": "LeRatslayer",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "No, that's false.\n\nVitamins are important for your immune system, particularly Vitamin D.  Which is something many people tend to be deficit in due to indoor lifestyles, especially in 2020.",
                                            "score": 33,
                                            "author": "_Vivace"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 2826,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 2030,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 561,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 1136,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 54,
                                            "author": "[deleted]"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 891,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 651,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[removed]",
                                                            "score": 68,
                                                            "author": "[deleted]"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 44,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 143,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 80,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[removed]",
                                                            "score": 9,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[removed]",
                                                                    "score": 5,
                                                                    "author": "[deleted]",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 10,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 31,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 60,
                                    "author": "[deleted]"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 34,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 4,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 137,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 121,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 72,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 41,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 13,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[removed]",
                                                            "score": 20,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 23,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 40,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 42,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 41,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 32,
                                    "author": "[deleted]",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 57,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 25,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 10,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 12,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 20,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 40,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 11,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 2,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 2,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 12,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 32,
                                    "author": "[deleted]",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 3,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 10,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 21,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 11,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 10,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 50,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 28,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 18,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 34,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 37,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 15,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 5,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 3,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 22,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 2,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Wow, really? Can you cite a source for this, I would love to read about it!\n\nEdit: I am asking about your claim that there were no or jot many reported flu cases in Montana.",
                    "score": 3,
                    "author": "skwirlio"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My institution (major midwest hospital, \\~20-30k employees, 800+ bed main hospital and multiple 100-200+ bed satellite hospitals) **has not had a single positive test of the flu since \\~mid-November.**\n\nTo highlight, in about September we switched to all COVID tests would be combo COVID/Influenza tests to see how much co-infection was occurring. Now, because we literally have no positive influenza tests, the default will now be COVID only.\n\nTo put this in perspective, it's like all auto shops in the state of Michigan all of a sudden started saying \"no one's engine oil is wearing out anymore, so we don't need to do engine oil changes until next fall, only transmission fluid changes for now\".",
            "score": 3890,
            "author": "thereisafrx",
            "replies": [
                {
                    "level": 1,
                    "comment": "There were only [21 laboratory confirmed cases last week](https://www.cdc.gov/flu/weekly/index.htm) nationwide.",
                    "score": 1328,
                    "author": "Octavus",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is based on the 23,546 samples tested which yields about 0.1% infection rate per the data.",
                            "score": 431,
                            "author": "13886435f25",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Holt crap did we just beat the flu as well!?",
                            "score": 164,
                            "author": "gr8daynenyg",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Influenza also infects animals, hence the terms like swine flu and bird flu. The Covid measures have been effective at breaking the transmission within the human population, but once we’re no longer wearing masks and distancing, once it returns to the human population in a crossover event, it will resume its usual transmission cycle.\n\nPerhaps if the idea that people who feel unwell should wear masks and not do silly things like try to work through it in the office become established norms, we might have far less severe flu seasons, but I fear that won’t be the case.\n\nI am given to believe that a lot of the reason we were able to get Covid vaccines so quickly was because of research efforts to develop flu vaccines. The team that developed the AZ vaccine at Oxford, for example, had previously been working (so far unsuccessfully) on a “universal” flu vaccine.",
                                    "score": 1018,
                                    "author": "BobbyP27",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Actually a lot of the reason we got them so quickly is because they were already working on vaccines against SARS and MERS but both of those died out before becoming a full-fledged pandemic like covid. The technology was there, but the need wasn't any more....until covid. Simply change the protein involved to fight covid, run it through the trials at lightning speed and now we have vaccines in less than a year.",
                                            "score": 447,
                                            "author": "alkakfnxcpoem"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 6,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "People need sick time to stay home. We need a national push for mandatory sick days and job protections.",
                                                    "score": 33,
                                                    "author": "newmath11"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "As well? Yeah... We didn't beat covid.",
                                    "score": 650,
                                    "author": "GrunchWeefer",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Is it just me or is the story itself logical enough that the analogy is confusing at best?",
                    "score": 256,
                    "author": "simplysalamander"
                },
                {
                    "level": 1,
                    "comment": "Is this a yes or a no to OP’s question?",
                    "score": 126,
                    "author": "AlrightyAlmighty"
                },
                {
                    "level": 1,
                    "comment": "If no one gets the flu for a year does the flu disappear?",
                    "score": 148,
                    "author": "jpritchard",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No, unfortunately, due to animal reservoirs. Depending on the specific type of influenza virus, to eliminate it entirely you might also have to eliminate it in birds, pigs, horses, cats, dogs, etc.",
                            "score": 460,
                            "author": "notevaluatedbyFDA",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "But if there are less people getting the flu, there should be less new variants based on what we learned about covid mutations, right? I’d think so anyhow?",
                                    "score": 53,
                                    "author": "FloridaFisher87",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 139,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 81,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I’m not a virologist or epidemiologist and would defer to those folks on everything I’m about to say, but my understanding is that unfortunately it’s more complicated than that. Most human cases of flu are caused by influenza A strains, and influenza A infects so many damn birds that one or two years of fewer humans getting it probably won’t have a big impact on its evolution. \n\nIt’s more possible that Covid mitigation could have impacted the evolution of influenza B (which has animal reservoirs but does primarily infect humans). But it’s also possible that the behavior-driven decrease in cases will obscure which strains we need to be most concerned about when behaviors can shift back and make planning  vaccines more difficult for the next couple seasons.\n\nBasically all the public health people I know who think about this have even less confidence than normal that they know what future flu seasons will look like, and they’re hoping people in more countries are now comfortable enough with masks that in the future they’ll wear them when they feel under the weather, especially during the winter.",
                                            "score": 59,
                                            "author": "notevaluatedbyFDA"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Nope. Maybe for a year. It's not -eradicated-, so it'll pop up again when conditions allow it to spread (both in number of contacts/travel, and in our immune resistance to a particular strain).\n\nIt's sorta the opposite of victory. Our failure to contain Coronavirus means that it's likely to become a disease -like- the flu, where there's enough of it circulating among humans and animal reservoirs at-scale that it becomes seasonal and common, with lots of mutations.\n\nThat's not saying that coronavirus as-is will rage on forever, more that vulnerable populations who are wary of influenza today have two families of virus to worry about, and we all need occasional boosters.\n\nSpanish Flu was likely the first H1N1. H1N1 still exists, it's less deadly now because the people who are most vulnerable to it... are dead. That's not victory, that's defeat. If we'd been able to stop H1N1 from spreading in 1917, there would have been one fewer way to die for the last 100 years.",
                                            "score": 105,
                                            "author": "mangeek"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 133,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 39,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 83,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 125,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 32,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 125,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 79,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[removed]",
                                                            "score": 13,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 11,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 53,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "But they were using combo COVID/flu tests for anyone who wanted a Covid test.  So they were still testing a lot of people.  And many/most people with flu-like symptoms want to get tested for Covid.",
                            "score": 25,
                            "author": "ackermann"
                        },
                        {
                            "level": 2,
                            "comment": "Still 30k employees though. These numbers are amazing to me. I hope they are true.",
                            "score": 17,
                            "author": "Crood_Oyl"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "why were there no flu cases?",
                    "score": 29,
                    "author": "ConG36C",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Flu is way less contagious than Covid-19, so all the Covid precautions stopped flu.",
                            "score": 249,
                            "author": "Upvotespoodles",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I don’t think individual covid protocols are the complete story. Flu tends to come out of tropical areas that maintain relatively high temperatures year round ([think SE Asia](https://www.webmd.com/cold-and-flu/qa/where-do-influenza-viruses-originate-and-how-do-they-mutate)). \n\nWhen the 2019-2020 strain phased out in March, travel restrictions severely reduced opportunities for the annual flu to reach the US.",
                                    "score": 23,
                                    "author": "kintsukuroi3147"
                                },
                                {
                                    "level": 3,
                                    "comment": "A ton of redditors claim most people don’t wear masks/follow distancing recommendations, the flu should spread in those areas correct?",
                                    "score": 58,
                                    "author": "Machuka420",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "If enough people still follow the guidelines then there will still be a substantial decrease.  I could be wrong about the exact number, but as I recall the main strain of Covid-19 is something like over four times as transmissible as the average flu.\n\nEdit: In any case there's [data from Australia](https://www.newscientist.com/article/2242113-australia-sees-huge-decrease-in-flu-cases-due-to-coronavirus-measures/) (their flu seasons are reversed) about a year ago which show flu rates plummeted as soon as anti-Covid public health measures were put in place.",
                                            "score": 122,
                                            "author": "_far-seeker_"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "The flu died out in those areas over the summer like it always does, and the usual travel that brings it back from where it summers (well, winters) in the southern hemisphere is practically non-existent.",
                                            "score": 60,
                                            "author": "CydeWeys"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "It depends on how many people do mask and follow recommendations. Like if you can’t get into all the stores etc without a mask, then you can’t spread flu in there. A group of unmasked people won’t generate flu spontaneously; they need someone to transmit it to them. I’m willing to bank most people forgoing a mask still aren’t going to get close to someone with flu symptoms. Flu is usually transmitted during the time when you’re symptomatic.\n\nBasically, the pockets of covidiocy are protected from the flu by the responsible people and the (relative to covid) lower transmission rate.",
                                            "score": 41,
                                            "author": "Upvotespoodles"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Flu vaccines were also at an all time high, in addition to the distancing measures",
                            "score": 11,
                            "author": "look2thecookie"
                        },
                        {
                            "level": 2,
                            "comment": "In addition to what others have said,\n\n&gt;The Centers for Disease Control and Prevention's tracking of flu vaccine distribution over the years shows that so far in the 2020-2021 flu season, 189.4 million flu vaccines have been distributed in the U.S., compared to 174 million in the 2019-2020 season.\n\nhttps://abcnews.go.com/Health/flu-numbers-year-due-higher-vaccination-rates-amid/story?id=74783195 \n\nSo 15.4 million more shots went out this past flu season than the season prior, which itself was a record setting year:\n\n&gt;CDC’s influenza vaccination coverage reports show that overall flu vaccination coverage (among people 6 months and older) during 2019-2020 increased from the previous season to nearly 52%. This is the highest flu vaccine coverage for this age group recorded since CDC recommended universal influenza vaccination of all persons 6 months and older in 2010. \n\nhttps://www.cdc.gov/flu/spotlights/2020-2021/2020-21-campaign-kickoff.htm",
                            "score": 41,
                            "author": "soleceismical"
                        },
                        {
                            "level": 2,
                            "comment": "Social distancing and masks stopped the spread of the flu almost completely.",
                            "score": 54,
                            "author": "findingemotive",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don't want to alarm you OP, but your home is not sterile, you have been exposed to plenty of germs unless you are a bubble boy/girl.     \n\nWhat you are asking about OP, is the [Hygiene hypothesis](https://en.wikipedia.org/wiki/Hygiene_hypothesis).  This is a complex question and we still don't really have a clear answer, there is evidence that this may be important in children during the development of the immune system, but no evidence that I can see that it would affect adults with developed immune systems.",
            "score": 269,
            "author": "Frari",
            "replies": [
                {
                    "level": 1,
                    "comment": "Never knew the name of this theory, thanks for sharing!",
                    "score": 31,
                    "author": "idiomech"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m no doctor, but this exact question was asked at a Q&amp;A With a panel of doctors. Their response was that The notion that we build stronger immune systems due to exposure to germs is entirely true. But it is primarily during our formative years. As an adult going a year or more without fighting germs has no noticeable effect on our immune system.",
            "score": 77,
            "author": "steveingold"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 150,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 106,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 56,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 27,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 31,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 12,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 35,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "There was interesting article about how everyone socially distancing, wearing masks and washing hands regularly due to covid actually stopped the spread of other common viruses such as flu, which in turn stopped the virus to mutate with newer strains as it usually does every year.",
            "score": 501,
            "author": "rougeocelot",
            "replies": [
                {
                    "level": 1,
                    "comment": "Your assertion here is that this article claimed that these NPIs caused influenza to stop mutating?  This seems highly unlikely (in fact downright specious) to me, as influenza has reliable animal reservoirs obviously.\n\nDo you have a link handy to this article?\n\nAs good a time as any for a reminder: don't believe everything you read, check sources if you have the time and strength and gumption, and always look for opposing pieces to see which read as more plausible given the available data.",
                    "score": 140,
                    "author": "jMyles",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Fewer infected hosts means fewer viruses means less opportunity to mutate.\n\n&gt;“It's really simple,” says Palese. “If there’s less virus around, fewer mutations happen.” He explains that if you have 10,000 infected people, statistically speaking you would expect 10 mutations to emerge. So if you had just a thousand, you would expect a 10th of that number.  \n\nhttps://www.bbc.com/future/article/20201009-could-social-distancing-make-the-flu-extinct\n\nBut yeah, there are animal reservoirs for Flu A. I don't know how the number of animal hosts to human hosts compare.",
                            "score": 86,
                            "author": "soleceismical"
                        },
                        {
                            "level": 2,
                            "comment": "I think you misunderstood the post. The claim in the article was about reducing the chances of the virus spreading and mutating because of the social distancing.\nAs with everything, these claims are obviously hypothesis and are based on someone's research, statistics and their subject knowledge in the field and cant be always 100% true.\n\nRegarding checking other sources, there will always be claims that refute this article and vice-a-versa and there should be. If there's no opposing pieces, this won't be science, it will be religion.",
                            "score": 18,
                            "author": "rougeocelot",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I don’t think the assertion is “stopped mutating”... it sounds more like the fact that proper exercising the common sense that would’ve been necessary in years past help beat back some of our most common seasonal ailments, if only for a year.",
                            "score": 34,
                            "author": "NewEnglandStory"
                        },
                        {
                            "level": 2,
                            "comment": "It's a fascinating point though.  Well really get to see how much the flu strains mutate to to humans vs animal reservoirs in a way we never have before.\n\nDon't downplay this opportunity",
                            "score": 9,
                            "author": "JackOCat"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "yeah idk why people are scared, if anything, covid distancing was overall good for us because there were less hosts for the flu to mutate in overall.",
                    "score": 27,
                    "author": "Ragnavoke",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Someone seems to have forgotten humans arnt the only hosts of the flu, this is a very hot take on the issue. The flu has plenty of hosts to mutate and become novel",
                            "score": 48,
                            "author": "Taiyaki11",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's not that humans are the only host for mutation. It's that humans WERENT a host for mutation. \n\nSince no one knows anything about mutations...Any time an organism reproduces there is a chance for a mutation to occur. It usually does nothing, sometimes it's bad for the organism, sometimes it's good. And since this is occurring at random, the number of chances it gets increases the likelihood for it to occur. With fewer hosts because humans were basically taken out of the pool, it is LESS LIKELY to have happened.\n\nIn addition to this, the mutations were not able to use selection pressure in human hosts to become more virulent. Think of it like this. A virus is in a dog. It mutates. It can now infect human cells twice as well. But there are no human cells. The mutation did not help the virus. And usually mutations come with a cost. So now it can't infect dog cells as well. The virus that would do well in humans now dies. This basic idea is why we aren't susceptible to every virus in existence.",
                                    "score": 26,
                                    "author": "Ctowncreek",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The immune system is very flexible and adaptive. Some immunity can last a lifetime, depending on how aggressively the pathogen in question evolves. It is unlikely to cause any public health issues. But if you have compromised immunity all the usual precautions apply.",
            "score": 107,
            "author": "RepresentativeSet349",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Individually, our immune systems will be fine.  But as a community,  we are in for a rebound effect of endemic illnesses.  Large future outbreaks are being predicted of the normally circulating viruses that have been suppressed by the social distancing over the last year. \n\nhttps://www.pnas.org/content/117/48/30547",
            "score": 41,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Most of the time, your immune system is tuned to its environment.  Once you get out of your environment and get exposed to other people and the diseases *they’re* immune to, there’s a problem.  I could point to things like the 70-80% of native peoples in North America that died to exposure to European diseases when the Scandinavians arrived (leading to later colonists seeing fields of cultivatable plants waiting for them, as if by providence—and of course, the diseases *they* brought wrecked the survivors of the previous centuries’ outbreaks)...but that’s an extreme example.\n\nA better example would be the disease seasons you typically see in colleges at the beginning of the school year, particularly in service academies.  At Texas A&amp;M, we referred to it as “the Corps Crud,” mostly because—as I’m sure you can imagine—it seemed to affect the Corps of Cadets more than non-regs.  It’s not a seasonal disease in the traditional sense; just a mash of diseases that hits everyone because they’re coming from all over the state (or country, or world).  \n\nThat’s what I imagine the end to social distancing measures being, anyway: a whole country coming down with the Corps Crud.",
            "score": 73,
            "author": "subnautus",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;leading to later colonists seeing fields of cultivatable plants waiting for them, as if by providence\n\nDo you have a source for this? I'm not doubting, I just have never heard this before and find it fascinating! I'd like to read more about it",
                    "score": 24,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "Annual conventions experience similar, from people coming together from all over.\n\nWe always called it “Con Crud”.",
                    "score": 8,
                    "author": "MrIantoJones"
                }
            ]
        },
        {
            "level": 0,
            "comment": "i would assume no.\n\nwhy? because the rate at which a species can mutate is influenced by its population. if there are 1/20th as many flu cases as last year, the flu is likely to mutate much slower.\n\nthe immune system isn't a muscle that needs to be worked out, its more like a program that needs to stay up to date with the latest updates, but that isn't a problem when no new updates are coming out.\n\nthe \"silver lining\" to this covid pandemic is that the countermeasures employed against it also work against the common cold and flu (not the vaccine, just the masks, handwashing, social distancing, etc), and by limiting the spread of cold/flu, we limit their ability to mutate.",
            "score": 28,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 23,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "When it comes to viral infections: the memory of that virus doesn’t last long and so our immune cells forget (aka virus changes). The only reason our immune system would benefit to exposure is to remember the infection: such as bacterial infections with non-life threatening adverse effects. Then, the exposure should be slow in that the hospitals won’t be inundated. Besides this, there is little increased risk to our system due to non-exposure to microbial infection",
            "score": 8,
            "author": "hang7po"
        }
    ]
}