{
    "id": "7gg0we",
    "score": 6,
    "title": "Just got accepted...trying to make the decision...",
    "author": "cantreadshitmusic",
    "date": 1511984526.0,
    "url": "https://www.reddit.com/r/DePauw/comments/7gg0we",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey y'all, I was accepted over the weekend and extended merit scholarship, so now I just have to make the decision...what are your favorite/least favorite parts about your experience at DePauw? I'm from a Texas and mostly kept my applications in the south at big, politically conservative universities. I'm not really sure what DePauw is like, I haven't been to visit yet, but its always been on my list of places to apply due to the programs that are offered. If you're in Honors or a Fellowship I would love to hear about that too!",
    "comments": [
        {
            "level": 0,
            "comment": "I'm Computer Science/Music class of '01 so obviously it's changed considerably since then I'm sure.  I can say though, that I loved it.  Biggest suggestion is to take advantage of the study abroad program.  I went to Scotland for a semester and it was invaluable.  \n\nThe liberal arts side, having you take classed across many areas, was fascinating.  I still maintain contact with a number of my professors, and credit a few from my non-major/minor discipline as having the most impact.  I took one poly-sci class with a professor that taught me better than anyone else how to critically think.  I took a class with a history professor who used letters home from soldiers as the only text books for the course, providing a truly unique perspective on wars I had never seen before.  I highly recommend the school, but it's up to you to make the most of it.",
            "score": 1,
            "author": "Ron_Swansons_wood"
        },
        {
            "level": 0,
            "comment": "You'll find DePauw to be a small, politically moderate university (not liberal as most and far from the most conservative).\n\nI'm a BA graduate, '13: Never heard of the place until my senior year of high school, but it drew my interest because 1) it seemed like a small school with a lot of character, 2) had a great music program, 3) of the study-abroad and honors programs and 4) the CLA students were proud of the quality of their professors. I was initially set on attending the University of Illinois, but DePauw resonated with my interests and long-term plans in a more specific way. And they were generous with financial aid, too.\n\nMy initial observations held true all four years. While I decided not to pursue music, CLA was also terrific. I was an Honor Scholar, which veered between enrichment and an unnecessary burden. That being said, I know now I'm capable of fleshing out a thesis statement over 40+ pages. The professors vary individually as people do, but all were engaged with students and personally led classes. They were also generally challenging and supportive. A few of the Tuition Exchange programs reserved places for DePauw students, which was a great perk. Studying in Turkey had a massive impact on my academic/career orientation, and I credit DePauw for making that possible. \n\nLook forward to and be forewarned about Greek life. DePauw likely has the most vibrant Greek system in the US. Believe that &gt;80% upperclassmen are Greek. So, if your in, that's great. But, a student outside of the Greek system has relatively fewer opportunities in terms of intramural activities available to them. Greek students and independents hang out, but there's a big difference between the freshmen experience, pre-rush, and being an upperclassman. Some clubs/groups/activities were vibrant: WGRE, theater and music groups come to mind. Student government too. In other instances, the kind of organizations active on other campuses barely exist at DePauw. \n\nIn short: DePauw's a fine school. You can choose to study hard, party hard or both. Greek life is at center, but there's a place for everyone here. Take advantage of their overnight stay (bunking at a freshmen dorm) and see if it's right for you. Like u/ron_swansons_wood says, it's up to you to make the most of it.\n\nEDIT: Congrats on getting accepted btw!",
            "score": 1,
            "author": "withoutcake",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's changed a lot since 2013. Greek life is way down (around 70% now and it's shrunk about 2-3% a year since my first year), and it's considerably more liberal now. ",
                    "score": 1,
                    "author": "ExtraSmooth"
                }
            ]
        }
    ]
}