{
    "id": "mkev41",
    "score": 4,
    "title": "What should i do?",
    "author": "ineverstoptalking0",
    "date": 1617606698.0,
    "url": "https://www.reddit.com/r/DePauw/comments/mkev41",
    "media_urls": [],
    "other_urls": [],
    "postText": "I had applied to depauw for regular decision and still haven't heard back from them. I've received no communication from their end, not even about any \"accepted students session,\" nothing. I was told I should apply for the media fellows program and that was the last email I got from them ( Jan 31st) After which, I did follow up multiple times but have had no response.\nDo I consider this a rejection?What should i do because i was really looking forward to attending depauw",
    "comments": [
        {
            "level": 0,
            "comment": "Log in to your application portal and see if there’s any update. If you don't find anything, the best way is to maybe email the admissions.",
            "score": 2,
            "author": "IssuesxTissues"
        },
        {
            "level": 0,
            "comment": "In my case, DePauw sent me an email that I got accepted but my official acceptance letter is not in my portal yet. It might be that there are delays on their regular decision round. Better email your counselor instead of the admission office. Good luck mate 🐯💛",
            "score": 2,
            "author": "Onigiri_Shusui",
            "replies": [
                {
                    "level": 1,
                    "comment": "firstly, congratulations and Thank you, I'll do that :)",
                    "score": 2,
                    "author": "ineverstoptalking0"
                }
            ]
        },
        {
            "level": 0,
            "comment": "ye i know it is kinda weird. I received the zoom link for admitted students first. Then, after few days, I received my official acceptance later. Hope you can get it! Go, Tigers 🐯💛",
            "score": 2,
            "author": "Joey_Nanajaemin"
        }
    ]
}