{
    "id": "sdqu8x",
    "score": 5,
    "title": "Admitted on a full-tuition scholarship!",
    "author": "OrdinaryKid02",
    "date": 1643261219.0,
    "url": "https://www.reddit.com/r/DePauw/comments/sdqu8x",
    "media_urls": [],
    "other_urls": [],
    "postText": "Any words of advice and reasons to attend Depauw?",
    "comments": [
        {
            "level": 0,
            "comment": "Hey Congrats! Are you gonna attend? Does DePauw ever give more than 50k per year?",
            "score": 2,
            "author": "Grouchy_Bug5296"
        },
        {
            "level": 0,
            "comment": "Congratulations!!",
            "score": 1,
            "author": "Own_Direction_6563"
        },
        {
            "level": 0,
            "comment": "What do you want to do with your life?  If it's science related, I can tell you that the science faculty are amazing and the support you get is fantastic.  I graduated in 2009 and my wife in 2008.\n\nCongratulations!",
            "score": 1,
            "author": "Kehrnal",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, I wanna pursue a double major in CS and Math with a minor in film.",
                    "score": 1,
                    "author": "OrdinaryKid02",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I minored in CS with a major in Biochemistry.  I teach Biochem now at a small liberal arts in Iowa.  Regularly, my wife and I talk about how much we loved our DePauw experience.  Obviously, it's been a bit since I graduated, but the Julian Science building, where you will spend most of your time, holds a very special place in my heart.  The science librarians were incredibly helpful, at night time the building was filled with students studying together in the atrium, and the facilities are beautiful.  If you live in Mason, stop by the third floor RA room and tell the RA to check above the inside closet door.  Andy says hi.",
                            "score": 2,
                            "author": "Kehrnal",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you so much for this. Sounds like you guys had a wonderful experience!!",
                                    "score": 1,
                                    "author": "OrdinaryKid02"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}