{
    "id": "t1uiet",
    "score": 2,
    "title": "Depauw sent me aid offer email but no acceptance email?",
    "author": "torymie",
    "date": 1645872970.0,
    "url": "https://www.reddit.com/r/DePauw/comments/t1uiet",
    "media_urls": [],
    "other_urls": [],
    "postText": "I applied EA but didn't hear from them until way past the deadline, when they sent me an email with financial aid offer but no status update on the portal. They also said that I have to \"confirm my admission\" by March 1st, while the enrollment deposit deadline is May 1st. \n\nDoes anyone else get the same email? Also, does \"confirming admission\" mean committing to the school?",
    "comments": [
        {
            "level": 0,
            "comment": "yes, confirming admissions means committing to the school. The march 1st thing is for priority housing, you have time till may 1 to decide. \n\nEmail them regarding this- that you got fin aid offer and not an admission update on the portal.",
            "score": 1,
            "author": "cosmojerk",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;sions means committing to the school. The march 1st thing is for priority housing, you have time till may 1 to decide.  \n&gt;  \n&gt;Email them regarding this- that you got fin aid offer and not an admission update on the portal.\n\nI emailed them as you told. Thank you!",
                    "score": 1,
                    "author": "torymie",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "welcome!",
                            "score": 1,
                            "author": "cosmojerk"
                        },
                        {
                            "level": 2,
                            "comment": "Heyy! Congrats for acceptance :). I'm also in the exact same situation as you and they said i'd have to submit COF before March 18th (I applied RD). What did they say when you emailed them?\nCan i pm you?",
                            "score": 1,
                            "author": "acidghost1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "go ahead",
                                    "score": 1,
                                    "author": "torymie",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Oh heyy!! I’m in the same situation as you. They told me to submit my COF too. I asked for an extension and still in the process of negotiating. Can I pm you?",
                                            "score": 1,
                                            "author": "_sebrii"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}