{
    "id": "izrd4k",
    "score": 5,
    "title": "LGBT friendly",
    "author": "just_a_litlecreacher",
    "date": 1601065805.0,
    "url": "https://www.reddit.com/r/apu/comments/izrd4k",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi! I'm a high school senior considering going here and I just want to know if the school is generally LGBT friendly or not as I've had my fair share of run-ins with catholic schools. Is it a good and accepting environment?",
    "comments": [
        {
            "level": 0,
            "comment": "I had hoped that someone else would chime in here because I think you ask an important question. As a straight white dude, I'm really not the best person to respond but figured that someone should so I'll do my best.\n\nAPU has a pretty contentious history with the LGBT community, and it's really not a secret. Like many Christian Universities, they have a long history of holding a traditional view of marriage and human sexuality, basically, they support straight sex and only sex after marriage. Their position on gender and identity is similarly traditional. Anything that doesn't fit that traditional view is wrong in their eyes. Since you grew up in catholic schools, I'm sure it would be similar to what you've experienced in the past, more or less.\n\nThe official position on human sexuality and the LGBT community (as well as other views they hold) can be found [here](https://www.apu.edu/about/believe/). As of today, they are not affirming of LGBT individuals and continue to have a traditional Christian view of human sexuality. The history behind that statement and the conversations around changing the statement, however, are somewhat complicated. Recently they underwent a period where they couldn't make up their mind and had a [series of rule changes](https://www.christianitytoday.com/news/2018/october/azusa-pacific-apu-reverses-gay-lgbt-student-conduct.html) where they flip-flopped and changed their official position several times. Eventually, they ended up basically where they started with an official position that outlawed same-sex student relationships.  I'm not sure if that conversation has continued at all since 2019 but due to other issues (finances as well as juggling COVID) and changes in leadership at the university, I wouldn't be surprised if it is no longer a priority like it was in 2018-19. Additionally, it is worth noting that all faculty and staff are required to sign a statement of faith that claims they too support the university's positions and beliefs, including their position on human sexuality (whether or not they actually believe the paper they are signing is another question completely).\n\nAll of the above is specific to the University's policies and positions, however, it may not fully represent the opinions of the study body or even faculty (IMO this depends on the department). While I was a student at the university, APU started to actually discuss these issues a lot more, both publically and privately. I graduated a few years ago and while I was there the conversations around LGBT issues were typically more accepting and even affirming within the student body compared to the University's official statement. There definitely are other LGBT individuals as well as many allies on campus. I personally had a number of good friends who were open to me about their sexuality, but typically these people were not really \"out\" to everyone. There definitely was a sense of fear about coming out publically on campus. The few people I did know that were completely out generally received a combination of support and pushback from other students. None of my LGBT friends felt comfortable being top public with their sexuality, even if they were out. For example, I had friends that were open to others about being gay, but they did not feel comfortable kissing other men while on campus (or around people from APU). As I said, it's been a few years since I was a student so this all could have changed to some degree since I was there.\n\nUltimately, your question was, is it an accepting environment, and I think the answer is it depends. I probably would say no, but with the disclaimer that although the university is largely not accepting, there are accepting people.\n\nIf you have questions feel free to ask. You can also feel free to send me a pm and I can put you in contact with past LGBT students, faculty, and staff (most of whom are no longer associated with the university).",
            "score": 3,
            "author": "Hereformyhobbies"
        },
        {
            "level": 0,
            "comment": "I'm pretty late here and I believe the person who replied first gave a very thorough answer, but I thought you might appreciate hearing this an LGBT person of color at the school—don't make your sexual orientation known. Although there are some very outspokenly progressive professors and students, there are also some extremely conservative and traditional there as well. Like I said, the person before me gave an extremely thorough and thoughtful answer. All I can really say is be very careful!!",
            "score": 1,
            "author": "azure_fish",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh damn that's rough. Thanks for the reply thought!",
                    "score": 1,
                    "author": "just_a_litlecreacher"
                }
            ]
        }
    ]
}