{
    "id": "13snqlh",
    "score": 0,
    "title": "Are there bonds built on cash loans to borrowers?",
    "author": "Boulang",
    "date": 1685133225.0,
    "url": "https://www.reddit.com/r/investing/comments/13snqlh",
    "media_urls": [],
    "other_urls": [],
    "postText": "Mortgage bonds are pretty straight forward.  \n\nHome loans are given to home buyers, home buyers pay interest, mortgage debt is sort of “secured” because of the value of the home.   If the prospective buyer defaults on the loan, you still have the value of the house.    Investors looking for an opportunity may invest into mortgage bonds to make money, presumably on the interest paid by the home buyers. \n\n\nAre there also bonds that are based on cash loans to individual people? \n\nI’ve been getting a lot of spam calls lately, I just don’t understand why they’re so motivated to “relieve” the tiny bit of debt I have.",
    "comments": [
        {
            "level": 0,
            "comment": "Just a guess but maybe they are pooled into a CLO by specialty credit fund?",
            "score": 2,
            "author": "greytoc",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m not familiar with finance, but I have t read about CLO before.  Thanks for the comment, reading about those now.",
                    "score": 1,
                    "author": "Boulang"
                }
            ]
        },
        {
            "level": 0,
            "comment": "There are but it's a much smaller market. Also mortgage backed securities are mostly insured by Fannie and Freddie making the risk very low.",
            "score": 2,
            "author": "EveryPassage"
        },
        {
            "level": 0,
            "comment": "There are margin loans where Elon musk, Carl icahn pledge shares of companies they run for $",
            "score": 1,
            "author": "hugh_jessol",
            "replies": [
                {
                    "level": 1,
                    "comment": "Reading about that now, thank you for the comment",
                    "score": 1,
                    "author": "Boulang"
                }
            ]
        }
    ]
}