{
    "id": "13u7cij",
    "score": 0,
    "title": "Justify Investing Internationally w/ an Example of when it helped",
    "author": "Mo-Dawg99",
    "date": 1685298227.0,
    "url": "https://www.reddit.com/r/investing/comments/13u7cij",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey all! Just started investing recently. I’ve rolled over my old work 401k and put it all into an S&amp;P500 index fund (in a Roth IRA) and am now trying to understand why international index funds will benefit my portfolio despite their low life-of-fund returns. I understand the diversity is important because history doesn’t mean similar results in the future, so if international stocks do great I’ll be able to benefit from that in the future.\n\nWhat are some examples of when international stocks did better than US domestic stocks. Did their greater success justify holding on to them despite their overall lower lifetime yields when compared to S&amp;P500 or Total Stock Market Index funds? \n\nAlso, I am 23 years old. Would my longer time horizon mean I should be okay to just invest in the S&amp;P500 index funds since I have more time to ride out bear markets?\n\nThanks!",
    "comments": [
        {
            "level": 0,
            "comment": "&gt;What are some examples of when international stocks did better than US domestic stocks. \n\n2001-2020, the US was the 5th best performing developed market on an annualized basis after Denmark, New Zealand, Australia and Hong Kong. countries 6-10 under-performed the US by less than 1% (Switzerland, Norway, Sweden, Singapore &amp; Canada). https://topforeignstocks.com/wp-content/uploads/2021/09/Single-Country-Stock-market-Performance-From-2001-to-2020.png\n\nas of a few weeks ago, EDEN, the iShares ETF for Denmark, has also outperformed VTI over the last 1, 3, 5 and 10 year periods. so Denmark alone has beaten the US from 2001-2021, and from 2013-2023.\n\nhistorically, US and international stocks move in a cycle where one outperforms for an average of about 8 years, then they flip. in recent history, foreign stocks (as measured by an MSCI index) beat US stocks (measured by the S&amp;P 500) every year from 2002-2007, and again in 2009, 2012 and 2017. https://www.lazardassetmanagement.com/us/en_us/references/social/2020-q1/annual-returns-us-vs-international-equities as mentioned, VXUS beat VTI by about 3% in 2022, and is beating the US market by about 1% so far this year, though the recent Nvidia spike may change those numbers. \n\ngoing back to the 1980s, foreign beat US every year from 1983-1988. https://www.blackrock.com/us/financial-professionals/literature/investor-education/why-bother-with-international-stocks.pdf\n\nfrom 1969-2022, foreign beat US 45% of the time over rolling 10 year periods. EDIT -- fixed the link for this one: https://web.archive.org/web/20221226033655/https://tweedy.com/resources/library_docs/papers/Dichotomy%20Btwn%20US%20and%20Non-US%20Sept2022%20Fund.pdf\n\n&gt;put it all into an S&amp;P500 index fund \n\nI did a backtest analysis on Portfolio Visualizer, showing a 50/25/25 split of S&amp;P 500/international/bonds beat the overall S&amp;P 500 from 1999-2016. https://imgur.com/a/4jz89kW\n\nhave you looked up long-term performance of the S&amp;P 500 vs. the S&amp;P 400 (mid cap) and S&amp;P 600 (small cap)? Over some long periods, like 1995-2015, small and mid cap US stocks had much better returns. https://contrarianoutlook.com/wp-content/uploads/2016/08/Large-Mid-Small-Chart.png",
            "score": 7,
            "author": "harrison_wintergreen"
        },
        {
            "level": 0,
            "comment": "Watch this video from Ben Felix about [International Diversification](https://youtu.be/1FXuMs6YRCY). You'll learn some interesting things, like US stocks underperformed non-US stocks from 1950-1989.",
            "score": 5,
            "author": "digital_tuna",
            "replies": [
                {
                    "level": 1,
                    "comment": "This Ben Felix guy is a Canadian spy trying to get more investments into his country. \n\nI know better, Canada is just hockey, poutine, an intrusive regime who freezes their peoples funds for not listening to their demands and a bunch of uninhabitable land. Not a place to invest.",
                    "score": 4,
                    "author": "4thAmendment1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;This Ben Felix guy is a Canadian spy trying to get more investments into his country. \n\nWhat? LOL\n\n&gt;I know better, Canada is just hockey, poutine, an intrusive regime who freezes their peoples funds for not listening to their demands and a bunch of uninhabitable land. Not a place to invest.\n\nIn Canadian currency, Canadian stocks beat US stocks from 2000-2020. There have been other periods of outperformance too, this is just the most recent one. [Source](https://woodgundyadvisors.cibc.com/delegate/services/file/1614689/content)\n\nMight want to check your facts, you don't understand Canada at all.",
                            "score": 2,
                            "author": "digital_tuna"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The Soviet Union existed until 1991... an Iron Curtain over eastern Europe led to the mass production by East Germany of the worst product in the history of the world (the Trabant 601 car)... China had no stock exchange until 1990... the Japanese market began its 80% crash in 1990... the Ho Chi Minh Stock Index opened in 1997, etc.\n\nThis 1950-1989 assertion is extremely deceptive and unhelpful in answering the question about non-US stocks.  The US corporate economy overwhelmingly crushed the rest of the world from 1950 to 1989, but did not necessarily beat the western Europe/Canada/Japan stock markets that existed at the time.  \n\nThe lesson should be some non-US investment can make sense, but if you try to extrapolate that to \"all\" _current_ non-US is better because of the limited results of that timeframe, that is a bad idea.  Today there are far more and different markets.",
                    "score": 0,
                    "author": "SnS2500",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;if you try to extrapolate that to \"all\" current non-US is better because of the limited results of that timeframe, that is a bad idea\n\nAgreed, but no one is suggesting non-US stocks are \"better\" than US stocks. What the data shows is that no country has the best performing stocks at all times. US stocks do not provide the best returns over all time periods as many investors incorrectly believe. The fact that US stocks have done the best on average over the last century is largely irrelevant, because we don't get to invest for 100 years, and even if we did, there's no guarantee the next 100 years will be like the past 100 years. We only have a few decades to maximize our exposure to stocks so it makes no sense to YOLO on a single country, especially when other countries can offer similar/better returns.",
                            "score": 2,
                            "author": "digital_tuna"
                        },
                        {
                            "level": 2,
                            "comment": "&gt; This 1950-1989 assertion is extremely deceptive and unhelpful in answering the question about non-US stocks.\n\nnot at all deceptive.",
                            "score": 1,
                            "author": "harrison_wintergreen"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The S&amp;P500 only is probably just fine. \n\nI choose to have international exposure, but less of it than target funds recommend so I don’t miss out on some exposure to a time when international really outperforms the US. \n\nI do about 20% of my stock investments as international instead of the 30-40% recommended in world funds or target funds.",
            "score": 2,
            "author": "astockstonk"
        },
        {
            "level": 0,
            "comment": "International beat the US last year, and so far this year.\n\nClick the below link and navigate to slide 46.\n\nhttps://am.jpmorgan.com/us/en/asset-management/adv/insights/market-insights/guide-to-the-markets/\n\nInternational has beat the US many times historically, and by a large amount",
            "score": 2,
            "author": "probablywrongbutmeh",
            "replies": [
                {
                    "level": 1,
                    "comment": "It beat the US last year. It is behind the US YTD (although I think your statement was true a month ago).\n\n&gt;International has beat the US many times historically,\n\nYes.\n\n&gt;and by a large amount\n\nYou have to go back 40 years to find significant ex-US outperformance. And that was primarily due to the Japanese stock market bubble. \n\nIf we use \"normal\" metrics - the kind you would use in evaluating the performance of a stock or ETF - we see that the US has outperformed ex-US over the last 5, 10, 20, 30, 40, and 50 years. \n\nI understand why people feel safer putting some of their portfolio in ex-US for diversity; I really do, and if they feel better doing that, they should definitely do so. \n\nWhat I object to is the idea that ex-US is somehow \"due\" to outperform, or that there is some law of nature that requires US and ex-US to go through cycles of performance and outperformance. There isn't. \n\nSo by all means people should invest internationally if they want. \n\nThey should just stop trying to prove that ex-US will soon outperform.",
                    "score": 0,
                    "author": "thewimsey",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well, it's complicated. It depends on why US stocks outperform.\n\nIf they outperform because earnings growth is stronger among US-listed firms, then you wouldn't expect the gap to close.\n\nIf, on the other hand (as appears to be the case), past US returns are the result of a drift upward in valuation relative to other markets in advanced economies, then you'd expect mean reversion and lower US returns relative to international over time.\n\nIt's complicated because the US market has better growth prospects than Europe, UK, or Japan, but worse than Canada, Australia, and emerging economies. Its valuations are extremely high. There are also foreign firms listing in the US to get that sweet dollar.",
                            "score": 2,
                            "author": "Jeff_Bezels"
                        }
                    ]
                }
            ]
        }
    ]
}