{
    "id": "13x0898",
    "score": 0,
    "title": "Satellite images to inform trades 🤔",
    "author": "ImmaJack",
    "date": 1685572088.0,
    "url": "https://www.reddit.com/r/investing/comments/13x0898",
    "media_urls": [],
    "other_urls": [],
    "postText": "Recently started using satellite images to for real estate research. Apparently it's also popular for commodities trading, especially in oil where people use it to count ships, barrels, etc. Some other communities have mentioned hedge funds frequently utilize satellite imagery as well. \n\nCurious to hear if anyone is trading or knows people trading based off of satellite images?",
    "comments": [
        {
            "level": 0,
            "comment": "Oil tankers you can actually just track by their GPS (refintiv is the main source of this)\n\nSatellite data is used more as \"alternative data\" to measure things like consumer spending (parking lot fullness), consumer demand (how hot and long factories in China are running for)\n\nAnd famously it's an alternative way to measure chineese economic strength better than reported electricity and freight usage.\n\nIt's been around for at least a decade. And it's \"insights\" don't really add any value over normal govt and corp statistics",
            "score": 15,
            "author": "enginerd03",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is actually my understanding, too. I know a quant at a hedge fund who told me they did not find the satellite imagery data worth paying for. \n\nI think just the fact that we (as in, general Reddit audience) have heard about it and seen it advertised means that it doesn't have a lot of value. The data brokers will approach the highest paying customers, first, and then go down the list, trying to sell the data. If the general public is hearing about it, it's unlikely there's any sizable, well-paying customer that hasn't taken a look and passed on it.",
                    "score": 7,
                    "author": "machinegunkisses"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I am more of a long-term investor, but have extensive experience with satellite imagery. Personally, I found the correlation in most cases to be quite low. For example, the common use case is parking lot analysis to predict retail sales - but we found the correlation to be very low.\n\nI suspect that commodity analysis is far more valuable as data prices are less expensive and there are already active players in this niche. But here are some other things my company has tried:\n\n1) We had a very good model that predicted where to do core samples for many metals (e.g. Copper, Gold). We had clients that would secure mining rights to areas, and we would secure and process satellite imagery for them to determine the best areas to take samples. It worked, but my clients never wanted to share their results with us which would have helped us immensely improve the accuracy of our predictions. \n\n2) Periodic monitoring of high-risk areas would be highly profitable in edge-case scenarios. (e.g. I had a client for whom we did monitoring. We discovered a leak in one of their facilities days before the market. This made big news. Had we traded on that information, we would have made a killing.",
            "score": 2,
            "author": "arindale"
        },
        {
            "level": 0,
            "comment": "To buy homes not available for viewing. E.G. bank owned property, location.",
            "score": 2,
            "author": "Vast_Cricket"
        },
        {
            "level": 0,
            "comment": "[https://www.skyfi.com/](https://www.skyfi.com/) this is what I've been using to get the images. Google Earth is good but not always current",
            "score": 1,
            "author": "ImmaJack",
            "replies": [
                {
                    "level": 1,
                    "comment": "Their sample pictures of NYC suck",
                    "score": 1,
                    "author": "HateDrip"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Look at the Fairfax, VA Costco’s parking lot and gas station on Google Maps and see if that makes you want to buy COST. 😃",
            "score": -1,
            "author": "ChappaquiddickTed"
        }
    ]
}