{
    "id": "13xptrd",
    "score": 0,
    "title": "How do investors pull out of private companies to show they are not happy?",
    "author": "Additional_Courage_6",
    "date": 1685645314.0,
    "url": "https://www.reddit.com/r/investing/comments/13xptrd",
    "media_urls": [],
    "other_urls": [],
    "postText": "How do investors even start the process of distancing themselves from a private company?\n\nIf you're an investor, how can you pull out to show that you are not happy? Does this have a negative effect on the company? Can the owner refuse the investor from pulling out?",
    "comments": [
        {
            "level": 0,
            "comment": "Can you provide more context? You own a stake in a private company and you are unhappy with its management / majority owner? And you want to sell your stake to show them that you are unhappy? Do you not have some kind of contract outlining your stake that describes whether you can sell it? You would also have to find someone willing to buy it from you at an acceptable price (despite the fact that you being unhappy likely means the price is lower than you want).",
            "score": 4,
            "author": "kiwimancy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not a personal conundrum. Just out of curiosity of how investors do it or would do it.\n\nSo, if the contract states that it can only be sold to external parties or via buy back, can the company typically refuse to buy back? Can the investor, if they join a board or have a position at the company, just not participate?\n\nHow do investors protect themselves to avoid issues where they no longer want to invest in the company and want to pull the money to show this? If it was a loan, can they request to be paid immediately? If it's a bond, how would they do it then?",
                    "score": 1,
                    "author": "Additional_Courage_6",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;can the company typically refuse to buy back  \n\nBuybacks are at the company's discretion.     \n\n&gt;Can the investor, if they join a board or have a position at the company, just not participate?  \n\nLike refuse to go to in to board meetings? I don't know the typical consequences for that, but I would guess they would be removed after some number of absences, either by other board members or by the board charter.  \n\n&gt;If it was a loan, can they request to be paid immediately? If it's a bond, how would they do it then?  \n\nA bonds and a loan are basically the same except one is recognized as a security and the other is not. You would have to check the terms of the loan/bond to see if it can be redeemed early without mutual agreement, but I would say that right is uncommon.  \n\nIt feels like you are talking about a specific company and investor, but not giving the name.",
                            "score": 2,
                            "author": "kiwimancy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks for your replies. No real/specific company or investor. Just always been curious about how it works. Sorry.\n\nWould you say, owners of a private company are pretty safe or have the advantage from negative outcomes from investors pulling out, seeing as they had drawn up the contract to which the investor voluntarily signed?",
                                    "score": 1,
                                    "author": "Additional_Courage_6",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "(Note, investors may be equity owners of the company. I assume by owners you mean founders and management)  \n\nThere is no generally applicable answer.  \n\nMinority investors can exert influence by  \n- Aggregating a majority of the vote to appoint favorable board members who can force certain changes   \n- Refusing to provide future financing to a company  \n- Exercising covenants and options contained in their financing contracts  \n\nIf some founder owns a majority share, or holds a majority of the voting power through dual class stock, or the company doesn't have an independent board at all. And she was able to negotiate insulated financing terms. And her company is fairly profitable and does not need new financing in the future and can pay off current debt; or other investors are quite willing to finance the company in the minority investor's place.  \n\nIn this case, there is little a minority equity or debt investor can do to influence the company. But if those things aren't true then power shifts more towards the outside investors.",
                                            "score": 1,
                                            "author": "kiwimancy",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Thank you so much for your responses. Very informative. If you don't mind, could you please break down some of the stuff for me, thanks:\n\n1 how do minority investors manage to aggregate a majority of the votes? Do they do it subtly, and how? Do they do it overtly, and how?\n\n\n2 I think this one was the impetus for my question. I was curious to know how an investor (not one that is simply loaning, because I can see how they can just not fund the company again during another seed round), who is a part of the company can get away with this, and what are the repercussions?\n\n\n3 In the situation where a big private company needs more financing for future (and more expensive projects) could former investors decide not to fund the company (collectively agree, for example if the company was being sued or not going in the direction they like) can this strain and cause the private company to collapse due to lack of investors funding, or can the company just get a loan from a bank - of the latter, why not always get funding from a bank Vs investors?",
                                                    "score": 0,
                                                    "author": "Additional_Courage_6",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I think you are envisioning a Limited Partnership with mandatory capital calls. If so, yeah, the limited partners are pretty much at the mercy of their contracts and the general partner.",
                                                            "score": 1,
                                                            "author": "kiwimancy",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Maybe!\n\nCan an incorporation have a similar set up?",
                                                                    "score": 1,
                                                                    "author": "Additional_Courage_6",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I don't think so but not sure",
                                                                            "score": 1,
                                                                            "author": "kiwimancy",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "What's an incorporated business typical set up? Or common denominator in terms of relationship between owner Vs investors?",
                                                                                    "score": 1,
                                                                                    "author": "Additional_Courage_6",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think you're rather confused about what investors are versus owners. There are two types of investors: lenders and capital investors. Lenders have loan terms, and those will follow the contract. Capital investors also become owners. \n\nFor large private businesses, the primary company organization is a corporation. Corporations determine ownership rights based on the articles of incorporation. Corporations have ownership certificates called stock. The number of shares you own in the stock corresponds to your level of ownership. \n\nThere are sometimes categories of stock, including common vs preferred, class a, class b, etc, but exploring those is something that covers an entire college course's level of material. \n\nElon Musk, for instance, did not found Tesla. He was an early investor. His large investment made him become the primary owner.",
            "score": 1,
            "author": "rice_not_wheat",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for your reply! Appreciate it. Yeah, I'm definitely hazy about this topic, so I appreciate that you can highlight that fact and tackle my misconceptions.\n\nSo a few questions, if you could answer them:\n\n. I have seen articles in the past talking about how investors/shareholders pull out which sends a signal to the market about lack of faith in the company. So I was wondering how they pulled out in the first place. Do they just sell their shares cheaply and leave?\n\n. Hypothetically, in a large private company, they have capital investors who are now on the private board, and are active in the company, but the company needs more money to invest in a new product. How is it decided if they need new capital investors vs lenders? And if the latter why not just get a loan from a bank?\n\n. Regarding Elon Musk, my understanding is that the shares continue to divide the more people invest. How did Elon Musk become the primary owner? Did he just buy out the original owners? Why did the original owners do that? Or could the original owner(s) have prevented Elon Musk from aggregating multiple shares?\n\nThanks!",
                    "score": 1,
                    "author": "Additional_Courage_6",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "* The articles you read are about publicly traded companies. Large investors tend to become minority shareholders (a majority shareholder tends to just be called an owner), and their rights are outlined in the articles of incorporation. If they are pulling out, then yes, they sell their shares. \n* The company's board would determine this. The board is appointed by shareholders. The board determines the number of shares that are authorized for sale. Taking on debt financing can often be done simply by the company's executive officers, but their decisions are reviewed by the board. \n* See above. The ownership dilutes only if the company authorizes the sale of more shares. The original owners sold to Elon, because that's what they were out to do: get a large capital investment, and to make themselves wealthy in the process. Tesla was not profitable at the time, and the founders themselves were not particularly wealthy. By selling, they became wealthy while the company was not profitable, and Musk bet that with the cash he gave the company, he could help make it profitable. They both benefitted from this arrangement.",
                            "score": 1,
                            "author": "rice_not_wheat",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you so much. Your replies are really helpful.\n\nQuick question:\n\n. In large private incorporations, are the board members typically the shareholders?\n\nIf there are 4 owners, and the founder has the most equity/shares than the other three. Would the board just be made up of the 4 of them, or would the board be made up of external advisors too, or a combination of both? \n\n. Can shareholders/equity owners decide to not be part of the board, or not invited?\n\n. Can a shareholder with equity ownership on the board be kicked out, and just be a shareholder without any input?",
                                    "score": 1,
                                    "author": "Additional_Courage_6"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}