{
    "id": "13y58lm",
    "score": 0,
    "title": "I have $24,000 in inheritance. What bank offers the most interest?",
    "author": "ScoresMann223",
    "date": 1685688225.0,
    "url": "https://www.reddit.com/r/investing/comments/13y58lm",
    "media_urls": [],
    "other_urls": [],
    "postText": "My father passed a few years ago. This money is kept in a basic account with barley any intest. Especially when you consider inflation. \n\nI have my own money working for me in the market. I don't need my inheritance to survive, so I want to do something smart with it. \n\nShould I find a 4% inrest account? Put it in bonds? I'm open to any ideas aside from putting it in the market. Thanks.\n\nReally appreciate the answers. Though the fact this post is being heavily downvoted shows how many of you are jealous babies.",
    "comments": [
        {
            "level": 0,
            "comment": "Sofi.com pays 4.2%",
            "score": 10,
            "author": "HairySphere"
        },
        {
            "level": 0,
            "comment": "I use Marcus by Goldman Sachs, 4.15%",
            "score": 6,
            "author": "dbrzo"
        },
        {
            "level": 0,
            "comment": "if you don't need the $$$ right now and is willing to lock it in a CD, SCHW can get you above 5%\n\nhttps://www.schwab.com/fixed-income/certificates-deposit",
            "score": 5,
            "author": "neocoff"
        },
        {
            "level": 0,
            "comment": "Forget banks, Incan matrimonial head masks are where it's at.",
            "score": 14,
            "author": "aytikvjo",
            "replies": [
                {
                    "level": 1,
                    "comment": "I heard if you're ordained the value is also increased, for some reason.",
                    "score": 1,
                    "author": "taplar"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lots of online savings accounts are paying &gt;4%. You can also go for treasuries or CDs for a little higher if you don't need the liquidity.",
            "score": 3,
            "author": "RandolphE6"
        },
        {
            "level": 0,
            "comment": "Vanguard vfmxx",
            "score": 3,
            "author": "Prestigious-Farm4504"
        },
        {
            "level": 0,
            "comment": "You can find an online high yield savings paying upwards of 5% and no fees and be able to stay liquid. Or if you don’t want the privilege of liquidity, a CD could get you by as well, most banks are offering upwards of 4.5% for 5 years and could be higher in a couple weeks if we get a rate hike.",
            "score": 3,
            "author": "BurreauxHoes"
        },
        {
            "level": 0,
            "comment": "CIt savings account… platinum is 4.85% and their savings connect is 4.6%",
            "score": 4,
            "author": "slambooy",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is who I use. I keep getting emails as they keep raising the rate every couple of months without me doing anything.",
                    "score": 2,
                    "author": "m1coles",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Love those emails! Haha",
                            "score": 2,
                            "author": "slambooy"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Vanguard self funded super funds?",
            "score": 2,
            "author": "Chucking_Peaches"
        },
        {
            "level": 0,
            "comment": "Deposit rates are shit. If you're in the US or Canada right now, treasury bond rates are pretty high (thanks rate hikes) and are literally the safest investment you can make. It would be a good idea to invest in those while you figure out what to do wit that money.",
            "score": 2,
            "author": "Immovable-Floss"
        },
        {
            "level": 0,
            "comment": "https://fortune.com/recommends/banking/the-best-cd-rates/",
            "score": 2,
            "author": "Vast_Cricket"
        },
        {
            "level": 0,
            "comment": "First question: when do you expect you'll want to use the money? I know you say you don't need it, but you also said you don't want to invest in the market... so I'm just curious about your timeline.\n\nThis is super oversimplified, but generally, the longer you can let it sit, the more options you likely have to make a higher return.",
            "score": 2,
            "author": "fatagrafah"
        },
        {
            "level": 0,
            "comment": "&gt; ... so I want to do something smart with it.\n\nDepends an awful lot on what you consider 'smart'.\n\nIf beating inflation by fractions of a percent is smart, then the difference between CDs, or Bonds, or a Bank isn't going to mean more than maybe 200 $/year (inflation adjusted) if you choose the right one. Of course, you could be losing that much or more if you choose one that doesn't pace inflation.\n\nHave you maxed out your 401k, IRA, Roth IRA?  Buying the same instrument in a tax free (or tax deferred) account is clearly a big plus.\n\nFunding a 529 plan could be another good option. They're super flexible in terms of who can benefit,\n\nhttps://www.savingforcollege.com/article/who-is-a-member-of-the-family-of-a-529-plan-beneficiary\n\nAnother form of mostly tax free investing would be to set up a NIMCRUT. You get a tax write-off, the assets of the fund grow tax free, and someone you choose gets a periodic payout. The payout is taxed as regular income. The NIMCRUT has a 'make up' provision that allows you to not make payouts in bad years. Eventually, what's left over in the NIMCRUT goes to a charity of your choice.\n\nhttps://learn.valur.io/nimcrut/",
            "score": 2,
            "author": "BlueSkyToday",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; Have you maxed out your 401k, IRA, Roth IRA? Buying the same instrument in a tax free (or tax deferred) account is clearly a big plus.\n\n24k is quite a bit over the IRA contribution limit.",
                    "score": 1,
                    "author": "Not_FinancialAdvice"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The Royal Nigerian Bank of Prince Achoo\n\nOr TBills",
            "score": 7,
            "author": "AVeryFineUsername",
            "replies": [
                {
                    "level": 1,
                    "comment": "Interesting.  I’m currently in the process of helping Prince Achoo get $13 million out of Nigeria.  I just need to get a $10,000 money order to them so they can pay the duty fees, and then they will split the $13 mil with me.  👍🏼",
                    "score": 1,
                    "author": "Stormy-Monday"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You got Apple Pay? You can put into Apple Cash for 4.15% until you decide what to do with the money.",
            "score": 2,
            "author": "rain168",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm a Samsung guy unfortunately.",
                    "score": 1,
                    "author": "ScoresMann223"
                },
                {
                    "level": 1,
                    "comment": "Some people are having issues getting money out of those Apple/GS accounts: https://fortune.com/2023/06/02/apple-card-goldman-sachs-savings-accounts-struggling-money/",
                    "score": 0,
                    "author": "Not_FinancialAdvice"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What's the reason you don't want to put it into the stock market?",
            "score": 2,
            "author": "YuriSinclair",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not really our place to ask that",
                    "score": 1,
                    "author": "yooiq"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Buy a (good) limited/collector edition pinball machine (stern latest elvira or james bond 60th anniversary, JJP's godfather / pirate of the carribeans), play it while watching its value climb 5 to 20% per year.",
            "score": 2,
            "author": "randomFrenchDeadbeat",
            "replies": [
                {
                    "level": 1,
                    "comment": "How do I convert my 401k into pinball machines",
                    "score": 3,
                    "author": "Updated_My_Journal",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I cant help you on that unfortunately :D We dont have 401Ks here, the system is different, our retirement pension is paid by the people currently working.",
                            "score": 2,
                            "author": "randomFrenchDeadbeat"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Uk citizen crying in 40% inheritance tax",
            "score": 1,
            "author": "Greeenpoe",
            "replies": [
                {
                    "level": 1,
                    "comment": "If OP was in the UK they wouldn’t have paid an inheritance tax, the estate would have if the estate was worth more than £350k (and only paid tax on the amount above £350k)",
                    "score": 5,
                    "author": "1hotjava",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The problem is i am 🥲",
                            "score": 1,
                            "author": "Greeenpoe",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ok, but if you are the beneficiary you still dont pay the tax, the estate it came from would. If your inheritance was 24k, you'd get 24k.",
                                    "score": 2,
                                    "author": "1hotjava"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Bask Bank has been ahead of most of the other banks I've seen for a while. They are at 4.75 APY for their normal account. Not an introductory offer.\n\nAnother option is opening a Fidelity Account. Cash there is held in SPAXX fund, which is paying about the same 4.75%. I prefer fidelity because it's easy to quickly invest in other things if you decide to at some point. They have no fee trading.",
            "score": 1,
            "author": "Veeg-Tard"
        },
        {
            "level": 0,
            "comment": "open up an account [https://www.treasurydirect.gov/RS/UN-Display.do](https://www.treasurydirect.gov/RS/UN-Display.do) these gets the best rates and lockin is only monthly",
            "score": 0,
            "author": "CircleRedKey"
        },
        {
            "level": 0,
            "comment": "You can buy almost one bitcoin with that amount…. BE YOUR OWN BANK",
            "score": 0,
            "author": "BuzzardLightning",
            "replies": [
                {
                    "level": 1,
                    "comment": "Bitcoin isn’t the only “Be your own bank” feature in crypto; OP can purchase stablecoins and leverage them on a non-custodial middleware like SpoolFi for yields. The APRs are somewhat juicier than what banks would offer anyways.",
                    "score": 1,
                    "author": "kuonanaxu"
                }
            ]
        },
        {
            "level": 0,
            "comment": "For a while, time deposit seems to be a good option.",
            "score": 1,
            "author": "naripan"
        },
        {
            "level": 0,
            "comment": "Time lock will give you a nice rate but online you can get close to 5% without a lock. So I guess it depends on 1. Whats the plan, are you shopping for a rental. 2. Will you be using it for your own house. 3. If you won't need it for decades why not just park it in an index fund\n\nI would probably not time lock it if I plan to use the money say for a rental in the next 90 days or so. 90-180 days id prolly time lock it if the rates are higher than the online guys, if I don't need it for a few decades id toss it in voo or some other index you like.",
            "score": 1,
            "author": "deathdealer351"
        },
        {
            "level": 0,
            "comment": "Me ;)",
            "score": 1,
            "author": "top_flame"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Your submission was automatically removed because it contains an email address. Please only use email addresses via the private message function. You can send a PM by navigating to the userpage of a user. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/investing) if you have any questions or concerns.*",
                    "score": 1,
                    "author": "AutoModerator"
                }
            ]
        },
        {
            "level": 0,
            "comment": "https://www.bankrate.com/banking/savings/rates/",
            "score": 1,
            "author": "NotMSUPD"
        },
        {
            "level": 0,
            "comment": "Google",
            "score": 1,
            "author": "DoobsNDeeps"
        },
        {
            "level": 0,
            "comment": "Tax sale auctions pay 10%.",
            "score": 1,
            "author": "AccomplishedBrain309"
        },
        {
            "level": 0,
            "comment": "Google it",
            "score": 1,
            "author": "Aggravating-Toe838"
        },
        {
            "level": 0,
            "comment": "Look at BankRate.com - they do a good job of answering your question.",
            "score": 1,
            "author": "ResponsibilityOk4236",
            "replies": [
                {
                    "level": 1,
                    "comment": "What a great resource! Thanks so much.",
                    "score": 1,
                    "author": "ScoresMann223"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The online banks pay pretty good interest rates, but I would open a schwab or fidelity account and buy T-bills.  Even better rates, no risk and very liquid (in case you need to take the money out), and no state taxes on your gains",
            "score": 1,
            "author": "RidingTP265",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks a ton",
                    "score": 1,
                    "author": "ScoresMann223"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Super genius everest fund",
            "score": 1,
            "author": "Organic-Pin9003"
        },
        {
            "level": 0,
            "comment": "If you don't need it, I would put part of it into some riskier assets. Digital assets are becoming much more popular and solving real-world problems. There isn't regulation yet, which makes it riskier. However, risk vs reward.",
            "score": -3,
            "author": "rmantia23",
            "replies": [
                {
                    "level": 1,
                    "comment": "I got an nft I'll sell you. $2000 pic of a bike that I guarantee shoots up 3000 percent in 5 months bro",
                    "score": 3,
                    "author": "Prestigious-Farm4504",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You're not educated on the use case assets. You'll see.",
                            "score": -2,
                            "author": "rmantia23",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What the hell are you talking about?",
                                    "score": 2,
                                    "author": "Prestigious-Farm4504",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm talking about solving real-world problems. You don't even understand what that is. The groundwork for digit assets is being laid around you. This space is so new. Do you remember how the internet came about?",
                                            "score": -2,
                                            "author": "rmantia23",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "So what real world problems are they solving?",
                                                    "score": 2,
                                                    "author": "Necessary-Tap6127",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "For real, OP listens to too many Bitcoin podcasts",
                                                            "score": 2,
                                                            "author": "Prestigious-Farm4504",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Never heard back from anyone. Here is a Bloomberg article of a use case. \n\n\nhttps://www.bloomberg.com/news/articles/2023-06-05/jpmorgan-to-use-blockchain-to-settle-usd-fx-trades-in-india-hub?leadSource=reddit_wall",
                                                                    "score": 1,
                                                                    "author": "rmantia23",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "What the hell are you talking about? Who are you?",
                                                                            "score": 0,
                                                                            "author": "Prestigious-Farm4504",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "This is what I'm talking about. \n\nhttps://twitter.com/Ripple/status/1666686623604416512?t=rALkbzgDzxS0X3bUd0fUVw&amp;s=19",
                                                                                    "score": 1,
                                                                                    "author": "rmantia23",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Moving value in real time is the biggest one. The US has the \"Faster Payments Taskforce.\"\n\nhttps://fasterpaymentstaskforce.org/\n\nRead up on what these blockchain organizations are accomplishing.\n\nHedera Hashgraph\nCasper Labs\nRipple Labs\n\nAvery Dennison has launched a product on Hedera's network called atma.io\n\nhttps://rfid.averydennison.com/en/home/products-solutions/iot/faq-atma-io-hedera.html",
                                                            "score": -1,
                                                            "author": "rmantia23"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}