{
    "id": "140fbqd",
    "score": 0,
    "title": "HELP. Im terrible with money.",
    "author": "wanderinbutnotlost",
    "date": 1685890189.0,
    "url": "https://www.reddit.com/r/investing/comments/140fbqd",
    "media_urls": [],
    "other_urls": [],
    "postText": "Back story on me, Im a single 34y/o self taught artist. I made some pretty bad financial decisons in my 20 s that ive slowly been working my way out of. I dont have to much debt under 5k but i have on repo on my record (gross I know). I planned on paying it all off by the end of summer. I live nomadically and well below my means. Anyways, my father is in control of an UGMA UTMA account  of mine (with about 16k in it)  and has been forever. Unless he releases the money or i take him to court (which I will not, because money at the end of that isnt worth that much hassle to me) I dont have access to it. At first this was frustrating to me, but now not so much. My Father has seen me make better financial decisions and in turn has given me loans against my nest egg. i dont mind doing this but im at a point where i would rather just ask him to invest somewhere where i can do somthing similar. A type of savings account that accures interests that i can also take loans against. He always talk about IRAs or 401ks, others have told me about whole term life insurance policies but all of this is another langauge to me.  Im totally clueless. Im a fucking artist. Im just grateful people even buy my work, but im past that now and need to figure out how to keep my buisness growing and invest this nest egg.",
    "comments": [
        {
            "level": 0,
            "comment": "/r/personalfinance or /r/relationships, this isn't even close to an investing question",
            "score": 17,
            "author": "medium_mammal",
            "replies": [
                {
                    "level": 1,
                    "comment": "im asking for financial advice based on my personal life. Im trying to find a good investment account for 16k, that accrues interest. with possiblites of using for secured loans.  the whole reason this deals with my dad is because he is the one who controls the account. Im just trying to find it a place that he feel like isnt a bad investment, and i can use later for my benefit. Im not at all familiar with investing out side of savings account and semi precious stones/metals. THIS IS FUCKING WHY YOUR GETTING A BACK STORY YOU TROLL STFU",
                    "score": -21,
                    "author": "wanderinbutnotlost",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "God, you are insufferable. You’re gonna need to pay people to listen to you and give you advice because no one else is gonna wanna read through your long-winded bullshit.",
                            "score": 17,
                            "author": "WHEREWEREYOUJAN6",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Says the the dude (ya im assuming your gender) with an insurgence reference is his reddit user name. And I'm the insufferable one? lawls. \n\nBut to be fair this is Reddit, so i should have known better. You get the absolute BEST and WORST parts of the internet. \n\nJust remember kiddos\n\nHappy bitches ain't hatin' &amp; Hatin' bitches ain't happy",
                                    "score": -18,
                                    "author": "wanderinbutnotlost",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Even when you try to insult people, you’re all over the place. No one would wanna waste the time to follow your haphazard mind; it’s too much effort, and it’s pretty clear there’s nothing to be got by trying to understand it. You know what I mean?",
                                            "score": 11,
                                            "author": "WHEREWEREYOUJAN6",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Sure do jelly bean &lt;3\n\nBut you're still proving my point from my haphazard brain. Youve followed long enough to reply, what now twice?\n\nBut in all reality what I personally think the problem is? That key board of yours is about probably the only excitement you get out of your life.  Hence why you lurk around reddit getting TRIGGERED lmao",
                                                    "score": -9,
                                                    "author": "wanderinbutnotlost",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I like the way people made fun of you for writing blocks of text, and now you’re trying to use line breaks. \n\nBut yeah, I’m the triggered one. \n\nMaking fun of you and others like you is entertainment for me. But sure, invent motivations for me so you can feel better about being made fin of by internet strangers.",
                                                            "score": 3,
                                                            "author": "WHEREWEREYOUJAN6",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "No, I just know how to take constructive critisim. Its sad your only  of form of entertainment is being negative. When you live authenically you could give a fuck what others think . Im sure you havent ever even left this country, and if you have it wasnt on your own accord. The world is a big place, but i feel as though your world is so incredibly tiny.\n\nGo out a live, my friend.",
                                                                    "score": 0,
                                                                    "author": "wanderinbutnotlost",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "“Only” form? I got a lot of hobbies, bro. You’re trying hard here, though, and I appreciate the effort. You’re a fun guy to make fun of.",
                                                                            "score": 2,
                                                                            "author": "WHEREWEREYOUJAN6",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Get passions, hobbys are for kids ;)",
                                                                                    "score": -1,
                                                                                    "author": "wanderinbutnotlost"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you are bad with money, you should not touch loans or go into any debt. It’s a downward spiral sucking you down even more.\n\nSafe up a little bit by keeping tight track of your expenses, try to optimize on your fix costs. Don’t buy things you don’t need, even if it’s hard sometimes.\n\nOnce you are debt free and earn more than you spend, life is so much easier.",
            "score": 8,
            "author": "ztbwl"
        },
        {
            "level": 0,
            "comment": "What are you actually trying to *do*? You say you live below your means, so you make enough money to support your lifestyle right now, and then some?",
            "score": 6,
            "author": "a_gallon_of_pcp",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yea i live in a van/ travel trailer. This past year ive been making significantly more because of my investments. Im a Gem trader/Wire smith. It took me a few years to gain my inventory ,skill level and travel experience to get where i am at. Ive traveled all over the world to source my stones at a much cheaper rate. These brave endeavours benefited me 10 fold.  I dont really want this extra money. Everything ive amassed to far I did by litterally rock collecting. Thats the cool thing about semi precious metals and stones, people always want them and they usually only go up in value. Ive seen litterally hobos, turn into multi millionaires just by digging for the right rocks. Anyways, I just want to put this money somewhere as like a nest egg for a future , with the options to take a no interest or low interest loan out against it if need be. I enjoy my lifestyle and fund it just fine. I also could continue to still use my dad as a secured credit card, that also works. I would just rather have it making money instead of just sitting there like it is. Its only 16k, but I want to put it some where it will GROW. Im 34, I wanna make up for my time fucking off, so i can continue my lifestlye while saving for a rainy day.",
                    "score": -8,
                    "author": "wanderinbutnotlost",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If your job is to trade precious metals and rocks anyways, why not get some small amount of gold or silver and keep it for emergency? If you are tempted to spend it, if it is at hand and easy to access, then better trust your dad…",
                            "score": 6,
                            "author": "ztbwl"
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 1,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "If you don’t want the extra money I’m happy to take it off your hands.",
                            "score": 1,
                            "author": "BlockChad",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "LOL. I have a weird relationship with money. Its a tool in my eyes, hence why im looking for advice on how to use this tool to benefit my life later. Ive been a legit Hobo, hitchhiked all over this country, long distanced hiked, and  back packed thru foreign countries. I know how to live on litterally nothing. Im extremely good at it after 7 years. Hence why I make a bunch and renivest in my stones. Or my travels. This was a college fund I didnt completely use up. My grandfather left it to me well over 30 years ago. SO its never even been real to me anyways. I just want to fucking put it some where at this point lol",
                                    "score": 0,
                                    "author": "wanderinbutnotlost",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Serious question: do you know anything at all about equity/fixed income? Or are you a total noob? Happy to help in either case.",
                                            "score": 2,
                                            "author": "BlockChad",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "total noob. Any literacy in these matters would be much apperciated.",
                                                    "score": 1,
                                                    "author": "wanderinbutnotlost",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Gotcha. Start with a rainy day fund. Figure out your monthly expenses, multiply it by 6 (for 6 months safety net) and stick that in a high yield savings. I recommend Marcus by Goldman Sachs. That money is federally insured up to 250k and you’ll earn the current interest rate (4.15% right now). \n\nYou’re not eligible for any kind of 401(k). Those are employer sponsored and you are self employed so forget about that. \n\nThe remaining money should go into an IRA. I recommend opening one with Fidelity. There are two types: traditional and Roth. With Roth you pay taxes now, but the investments grow tax free and you aren’t taxed when you withdraw. With traditional IRA, no tax now, but you pay taxes on any gains when you withdraw. Keep in mind you can’t touch the money until your 59.5 years old, or you’ll pay a fee. \n\nI recommend the traditional IRA given you are a novice and probably don’t want a hefty tax bill right now. \n\nWhen you open the fidelity account, there is an annual contribution limit (currently 6,500/year). When you deposit the cash it will show up as a money market fund (don’t worry about the lingo) it acts very similar to a checking account except you earn interest. \n\nI would buy $1 of FXAIX - its a mutual fund that tracks the s&amp;p and regularly pays out dividends. You need to buy at least $1 for the next part - auto investing. Once you have the $1 in FXAIX, go to the fidelity search bar and search automatic investment. Set it up so that it invests $500/month into FXAIX, that will keep you under the 6,500 annual limit and it invests by itself (aka set it and forget it). Let it auto invest until it is fully invested and just go about your life. This is pretty basic investing, but I think it makes sense for your situation. \n\nI hope this helps. Good luck.",
                                                            "score": 2,
                                                            "author": "BlockChad"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You need to structure your financial life before anything else. Start looking at your income and expenses in terms of time. Add up how much you owe every month, year, etc. Even if your income is irregular, you can save a chunk of it in a bank account that you don't touch except to pay those bills (separate from your food, gas, etc).\n\nOnce you have enough in that account to pay for several months of bills, put all your bills on autopay so you never miss them, and keep contributing to the account from your income.\n\nAssuming your father is not a sociopath, you will NEVER get a better deal on a loan than from family. If he's willing to lend you money, use that to jump start your bill autopay account. You can pay back with flexible terms, but you'll benefit tremendously from having all of your own obligations paid on time, every time.\n\nAnd if you don't already, keep a balance sheet for your business activities. Set benchmarks for yourself, track progress. You will be surprised how quickly putting all this stuff on paper results in having more money in your pocket to fund the stuff you love.",
                            "score": 1,
                            "author": "gravescd"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "1. pay debts that have bad interest rates (credit cards)\n\n2. go to r/personalfinance\n\n3. whole term life insurance policies --- no.\n\n4. I don't know much about UGMA or UTMAs, but if it is in a tax sheltered account where it can be put into a total market fund (VTI), just let it be.\n\n5. \"A type of savings account that accures interests that i can also take loans against\" .... so, you want to spend the money. Borrowing from yourself to buy things is just spending money, but with extra bullshit.",
            "score": 6,
            "author": "cheddarben",
            "replies": [
                {
                    "level": 1,
                    "comment": "No i dont want to borrow against it regularly.  I want it for EMERGENCY loans. thats pretty much why i borrowed money both times. One was for a vet bill ($1500) my dog got quilled a porpupine. The second time was for Dental work when I was super sick in Mexico. 1800 for a couple of crowns root canals and extractions.  All loans were paid back. I just call my dad a secured dredit card Because the money is there.  Like i said before, Im a van dweller. Have been for 7 years now, Id honestly spend it on stones and travel. My dad knows this, I know this, I keep it no secret. Its  Two things that make my lifestyle work. The older I get though the more i like the fact that i have that as a savings and I dont really want the money. Its nice just knowing i have it for BIG emergencies",
                    "score": 2,
                    "author": "wanderinbutnotlost",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think your use is reasonable and good. Here would be my alternative suggestion. Pay your dad LIKE you already owed him 1500.\n\nHave him put it in some interest accruing account until you get that 1500. Then use it as you need it like a loan.\n\nThe big benefit here is that emergencies WILL come up. It is better to be ahead of the ball than to have some shitty thing happen at the worst time and then a kick in the nuts for a loan to pay back.\n\nThis will give you some more mental leeway. Plus, you got that extra 1500. ;) Jmho",
                            "score": 4,
                            "author": "cheddarben"
                        },
                        {
                            "level": 2,
                            "comment": "You say you live below your means but you don't have an extra 2 grand for emergencies?\nWhat is your definition of means then? Credit cards?",
                            "score": 1,
                            "author": "Saraskins",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This was in past travels when i was still a broke a struggling artist. Like I said earlier in the post, This past year has been good to my buiness and I. So now Im in a different finanical position. Hence why I dont want to spend or use the money because I have savings for emergencies now. Im just reinvesting my extra back in my buisness or once again travel. This money is just a little nest egg. That I dont want to depelete, I want it to grow. But as a traveler I know on the road anything can go, so being able to have access to it would be nice but not at all essential. I could just litterally borrow money from my actual dad. Im just planning for any possible situation that might come up.",
                                    "score": 2,
                                    "author": "wanderinbutnotlost"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Whole-term life is generally considered not appropriate for your situation.\n\nAs you are admitting that money management is a weakness rather than a strength for you, you have only a couple of options:\n\n1. Learn about finance and investing to manage your money. No one else, other than your dad is going to care about your money as much as you do.\n2. Have someone whom you trust control your investment choices.\n3. Buy some land.",
            "score": 4,
            "author": "HollywoodHault",
            "replies": [
                {
                    "level": 1,
                    "comment": "SO I feel like this are all such generic adivce for some one like myself. I have to keep giving back story on myself to give more insight.\n\nI mainly made bad buisniess decisions in my 20s because I was a Drunk. I have 4 years not drinking and well boy does it make a difference on your wallet. Im actually not bad with money, just an addict.  Since I sobered up, Ive started, funded and maintained a decent buisness. One that Pays for me to travel all over. I live well below my means. and throw all extra money into my inventory because it makes me money. I even started taking the extra money and taking classes (welding to do more installation art with Stones) to further my trade skills. I in no way shape or form want land. I want zero resposibility of up keep on a porperty.  My dad made some of his wealth being a landlord, it burns you out.  My lifestyle is really flourishing, Owning property unattended for months doesnt really mix unless you just buy raw land. Also my father owns a bunch of stuff still, that has zero planns on sell before is his death. Because he was a landlord, any  of his properties that his currently doesnt use or livein, he has to pay capital gains taxes on upon sale. Which if yall knew my dad, the sums of those tax bills on properties he bought in the 70s in Massachusetts would probably make him keel over and die. He is a frugal as they come. I am frugal as well but in a much different way. I know how to live out a back pack, my survival skills/gear are pretty on point, my personal bilsl outside of my trailer lot fee are under 300 a month 900 if you it, and I OWN EVERYTHING. I have nothing on credit but that repo. I just want suggestions of types of accounts to possibly put this money into if you were me. This money litterally plays zero factor into my life out side of like medical/vet emergencies, which both times my father offered to pay for out right. I just told him id pay him of and use this money as collateral, because when youre a recovering alcoholic to try and practice accountability. Helps Keep you on the straight and narrow.",
                    "score": -2,
                    "author": "wanderinbutnotlost",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You’re 34. Learn to use paragraphs.",
                            "score": 6,
                            "author": "pml1990"
                        },
                        {
                            "level": 2,
                            "comment": "Generic advice? Fair enough, but giving specifically targeted advice from just a couple of text blocks of your bio would be irresponsible of we who answered you.\n\nAs for land, I didn't suggest improved land. You could buy a parcel in an area you like, or think will be more desirous 5-20 years in the future. Property taxes will be low, and you could buy in an area you think might be beneficial for your geologic interests. An example of this situation is a little spot named Gemfield, NV. (Not for sale, I'm sure, but Google Earth it.) Although you can't get a mortgage to buy unimproved land, it doesn't take much to change that situation for a later loan. Of course it depends on where you would buy the land.\n\nIt's great that you have a reliable financial backstop in your dad. why don't you have a few heart to heart talks about direction, and heed his advice as he seems to have been at least somewhat successful. He certainly could provide more accurate and targeted advice for you than anything you're likely to learn from strangers on the 'net.",
                            "score": 5,
                            "author": "HollywoodHault",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I didnt mean to make generic sound insullting my apologies. For starters, I know where ill end up. I currently perch in and around New england during the summers. Then the south west in the winter. My parents have a bunch of land. Land I will probably own at somepoint in my life. That being said, im not ready nor willing to rush into that just yet. I know so many ppl who do that all over, Ive been to all the lower 48, ive seen what parcels can look like. 16k dont get you SHIT anymore. so like I said im currently happy with my lifestyle and want no immeidate changes to it. . Im an Artist, who is single, no kids, and has extra income and wants to invest so extra cash some where i wont get burned on it. AS for the dad thing, we have had hearts to hearts over it. I took him on a 2 week road trip this winter across the country, which opened his eyes a bit. I have access to this money, if i want it I just ask. He however will not just drain these accounts for frivialous reasons. I want to counter with a good place for it to be that only beneficial in the long run.",
                                    "score": 0,
                                    "author": "wanderinbutnotlost",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Respectfully, other than in a grave, none of us know where we'll end up. There's an old saying that goes something like, 'Man plans and God laughs.' Very few of us are on the path we though we would be decades before. Life is really good at fucking up your plans.",
                                            "score": 3,
                                            "author": "HollywoodHault",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I agree with this 10000000000% person. I live and die by my faith. I've lost alot of friends in my travels, it's a big reason I live this way. I beat the fucking brakes off my life, and it's been a crazy beautiful thing. I might even die before my dad, with all the outdoor activities/backpacking I do. I know this to my core. \n\nThat's why all this investment talk is so fucking foreign to me. I just want some education, because you also never know I might live 50 more years. Just figured when looking for knowledge on a subject listen and take notes. But I always appreciate real ass insights like this. I actually use this phrase often.",
                                                    "score": 1,
                                                    "author": "Hot-Ad-1299"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lol.  I feel your pain.  I was a musician before I turned into a business person.  I listened to that little voice that said \"do something practical\" and it sounds like you are hearing that voice now.  \n\nFirst and easiest thing to do is to set up a Roth IRA account.  The limit goes up every year, but my advice is to max that thing out every year.  \n\nIf you actually have a job that offers a 401k, then contribute at least enough to get the company match maxed out (that's free money).  If you can afford more, do more.\n\nIf you are self employed look at setting up a SEP IRA.  You can actually contribute a lot of money that way.  \n\nWhole Life is garbage, don't do it.  \n\nThe main key here is to put money into those programs until it hurts.  And I mean hurts.  At least 15% of your income? But if you can do 25% or 50%, go crazy and do it.  The more you front load now and make the sacrifice, the more compound interest will take care of you.  Get your UTMA money and put it in these investment vehicle. \n\nRule of thumb: you want to retire with 25x your living expenses in investments.  But after 25 years, inflation will make you need double that, so better to shoot for 50x of your living expenses today.  Use a simple investment calculator (like the Dave Ramsey investment calculator - I like it because it is super easy to understand) to calculate how much money you need to be putting away monthly.  \n\nInvest your money in a low cost etf like VTI or VOO or, frankly, anything that has a very long term track record of delivering an average return of over 11%. \n\nGood luck",
            "score": 4,
            "author": "i__am_unstoppable",
            "replies": [
                {
                    "level": 1,
                    "comment": "FUCKING THANK YOU. You understood my post, i have a lot of moving parts. Im not looking for land, Im not looking to spend it, Im looking to just move it, add to it and have it make money over time. if I come to my dad with research, he listens. hes a pragmatic man. I just need to do the footwork is all.",
                    "score": 1,
                    "author": "wanderinbutnotlost",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I second the opinion that whole life insurance is bad. I like the advice given here.",
                            "score": 1,
                            "author": "Carl_Bravery_Sagan"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "In most states, the UTMA (Uniform Transfers to Minors Act) or UGMA (Uniform Gifts to Minors Act) account automatically transfers to the child when they reach the age of majority, which is usually 18 or 21, depending on the state. At that point, the child gains full control and ownership of the assets in the account. However, it's important to note that specific rules and regulations may vary from state to state, so it's advisable to consult with a financial advisor or legal professional for accurate information regarding your specific situation.",
            "score": 3,
            "author": "nixly76",
            "replies": [
                {
                    "level": 1,
                    "comment": "ive looked into this before with the bank. he has control over it.",
                    "score": 1,
                    "author": "wanderinbutnotlost"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you don't have an emergency fund for repairs, then you may to consider putting it in a HYSA, or put it into a money market mutual fund in a brokerage account.",
            "score": 2,
            "author": "Historical_Low4458",
            "replies": [
                {
                    "level": 1,
                    "comment": "thank you im def going to look into a HYSA",
                    "score": 2,
                    "author": "wanderinbutnotlost"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Generally, you need to build up a sizable portfolio before financial companies will allow you to borrow against it (they need collateral in case the market tanks and they can sell off a portion of your assets to protect themselves from losing money). I believe M1 offers margin on taxable brokerage accounts starting at $10k balance. I used to this as leverage when money was cheap (I think mine was 3.50%), but right now money is expensive. Consider getting a high yield savings account or money market fund. Also, you probably know this by now, but if you’re in the US, I’d look into cheap parking areas around Sedona. You could probably squeeze some good returns with their tourist economy.",
            "score": 1,
            "author": "ChappaquiddickTed",
            "replies": [
                {
                    "level": 1,
                    "comment": "THANK YOU. I have hustled the SHIT out of AZ, and sedona being one of them. Ive sold my art to stores there &lt;3 I will def looking into a HYSA",
                    "score": 1,
                    "author": "wanderinbutnotlost"
                }
            ]
        }
    ]
}