{
    "id": "1436lx7",
    "score": 1,
    "title": "Money market funds, where did the money go?",
    "author": "heshiming",
    "date": 1686123455.0,
    "url": "https://www.reddit.com/r/investing/comments/1436lx7",
    "media_urls": [],
    "other_urls": [],
    "postText": "Since the bank turmoil in March, money generally flew from bank deposits to money market funds. So there is a huge inflow for these funds. I'm wondering how they are digesting it. Did treasury somehow issued a large amount of bills during this period? Is the Fed balance sheet reflecting this inflow?\n\nOtherwise, there has to be a seller of these funds, who are selling at this rate, and why?",
    "comments": [
        {
            "level": 0,
            "comment": "Most money market funds mostly invest in the feds repo market which has unlimited size.",
            "score": 14,
            "author": "enginerd03",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is it. The Fed is paying the entire shadow banking system a guaranteed 5% not to lend and instead park its cash.\n\nThe real question is who is gonna buy all the new T-Bills over the next six months …. unless they pay a much higher rate than reverse repo.",
                    "score": 3,
                    "author": "DueSecretary4174"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Bank turmoil? If you are talking about the collapse of the silvergate, signature bank fiasco, the holdings of citizens simply get transferred to another bank. Other banks take parts of the holdings in the bankrupt banks. Money doesn't disappear if the bank falls, especially small banks, thr holdings are just delegated to be managed by other bigger banks.",
            "score": 3,
            "author": "renkendai",
            "replies": [
                {
                    "level": 1,
                    "comment": "I believe OP is talking about the M2 money supply and the significant decrease over the past couple months, shifting billions out of the banking system into MMF's.",
                    "score": 4,
                    "author": "mysonlovesbasketball"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Some of the short term loans like auto loan rates are still higher than 5%, even mortgage (6.5%) the banks make profit ....",
            "score": 0,
            "author": "Vast_Cricket"
        },
        {
            "level": 0,
            "comment": "It is just a drop in the bucket........",
            "score": 0,
            "author": "kveggie1"
        }
    ]
}