{
    "id": "1441esn",
    "score": 1,
    "title": "Seeking Insights on Gold Leasing : Risks and Profit Potential",
    "author": "raghav_456",
    "date": 1686205723.0,
    "url": "https://www.reddit.com/r/investing/comments/1441esn",
    "media_urls": [],
    "other_urls": [],
    "postText": "I recently read a few articles about gold leasing but still seek clarity if it could be a potential avenue for passive income. Can anyone share insights on its profitability, associated risks, and chances of loss? Let's discuss!. Here are a few points I'd love to hear your experiences and perspectives on:\r  \n\r  \nProfit Potential: Has anyone tried gold leasing for passive income? How profitable is it compared to other strategies?\r  \n\r  \nRisk Assessment: What are the risks involved in gold leasing? How have you managed them effectively?\r  \n\r  \nPotential for Loss: Can gold leasing lead to losses? How likely is it for the value of leased gold to decline?",
    "comments": [
        {
            "level": 0,
            "comment": "Isn't it better to just buy gold or silver bullion from reputable online dealers? \n\nIf you do decide this route I wouldn't call it an \"investment\". More of a fun hobby",
            "score": 3,
            "author": "Noosh3201",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yep. Just buy real gold. Don’t become one of those stacking gold bugs though. Before you know it you’re building a bunker and screaming about fiat collapse.",
                    "score": 1,
                    "author": "dorfWizard"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Rates are not that attractive my friend.\n\nsource: i work in the sector",
            "score": 3,
            "author": "Tacsi"
        },
        {
            "level": 0,
            "comment": "Gold doesn't produce income. It's a commodity. Why would someone borrow gold? What does the borrower do with the borrowed gold? \n\nIf you want to hold gold and generate some income - it would make more sense to hold gold futures or gold etfs and write calls against the underlying gold investment.",
            "score": 2,
            "author": "greytoc"
        },
        {
            "level": 0,
            "comment": "“ Potential for Loss: Can gold leasing lead to losses?”\n\nIf you have to ask this question you should not be investing in something this specialized",
            "score": 2,
            "author": "EstablishmentFull797"
        },
        {
            "level": 0,
            "comment": "What's gold leasing?",
            "score": 1,
            "author": "Un-Scammable",
            "replies": [
                {
                    "level": 1,
                    "comment": "In simple terms, gold leasing is when someone borrows gold from another person or organization. Gold leasing is done for different reasons. Banks may borrow gold to meet the needs of their customers, like making jewelry. Central banks also do it to manage their gold reserves and earn some money. You can read more about it [here](https://www.myjar.app/blog/potential-of-gold-leasing)",
                    "score": 0,
                    "author": "raghav_456",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So it isn't personal? It's only via government regulated business areas?",
                            "score": 1,
                            "author": "Un-Scammable"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sounds sketchy. If you do this, make sure you find something legitimate without any shadow of a doubt",
            "score": 1,
            "author": "Ackilles"
        }
    ]
}