{
    "id": "144f0wm",
    "score": 3,
    "title": "Seeking input on your experiences with Annuities",
    "author": "Trixter135",
    "date": 1686244337.0,
    "url": "https://www.reddit.com/r/investing/comments/144f0wm",
    "media_urls": [],
    "other_urls": [],
    "postText": "I have about $950k in Jackson annuities, these are within an IRA and income producing annuities and very high fees.  They will pay 4% of the Total value starting when I'm 60.  My advisor at the time suggested we invest in these years ago.  Speaking with a different advisor today, he is suggesting that the advisor should have never suggested these long term income producing annuities at such as young age (mid 30's at the time).  He said that there are other options (including some newer annuities with downside protection and no fees which I find hard to believe).  \n\nI'm looking to move these annuities to something different.  My advisor recommended the Equitable - SCS Plus 21 B series which is a 6 year annuity with a 20% downside buffer and a 500% upside cap.  It invests only in the S&amp;P 500 and has 0 fees.\n\nPros:  \n\\-20% downside Protection so if the S and P goes down to 25%, I will only be down 5%.  If it goes up 200%, I would keep the 200%  \n\\-Sleep well at night knowing that I have downside protection  \n\\-0 fees.  I dug in on this one hard.  No fees of any kind (unsure how, but seems to be the case)\n\nCons:  \n\\-500% cap over 6 years (But, I can't imagine the S and P doing over 500% in 6 years)  \n\\-No dividends.  I'm not sure exactly how big of deal this is, but I understand that I will not get any dividends if I go with the annuity\n\nSo  - Would love to hear your experiences with anything similar and thoughts on whether I'm missing something big here?",
    "comments": [
        {
            "level": 0,
            "comment": "I think you’re falling for the exact same trap again, frankly. Dividend return has been a major part of S&amp;P 500 compounding historically. \n\nThe follow up question I would ask the advisor is, is YOUR entire net worth in these funds and what do YOU get if I buy?\n\nAlso worthy of note in their own prospectus\n\n“ There is a risk of a substantial loss of your principal and previously credited interest (e.g., the initial amount invested in the Segment) because you agree to absorb all losses to the extent they exceed the downside protection provided by the Structured Investment Option at Segment maturity. The performance of the Segment Investment Option may be negative and you could lose as much as 80% to 90% of your principal and previously credited interest due to negative index performance.”\n\nFrankly, I’m not worried about the 20% downturns, which this protect you from. I’m worried about the 50% crashes with no recovery for 10 years, and you don’t get any protection there.",
            "score": 8,
            "author": "wanderingmemory",
            "replies": [
                {
                    "level": 1,
                    "comment": "Fair points - Wasn't sure about the dividend return.\n\nIf I were to just invest in the S and P outside of this in an index fund (which I'm planning on doing with a portion of my dollars), if we had a 50% crash, I'd still be down 50%, just without the 20% buffer correct?",
                    "score": 2,
                    "author": "Trixter135",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes, to your question. If you invest in the S&amp;P500 you will receive the market return.\n\nI read a bit more into the website, and the graph they use is for all 6 years. There is no mention whether they reset it YTD. So, what if the market first goes up 30%, then goes down 25%? You may not be protected. Or, what if you have a great stock market for 5 years in a row, resulting in a 100% growth over this time period, but then right as you are about to withdraw after 6 years, there is a 50% crash? I am not so sure you are protected there.",
                            "score": 2,
                            "author": "wanderingmemory"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The way most annuities work is they invest in the sp500 and give you less than they make.\n\nThey are good for people without income in some situations. There can be advantages from using insurance products with regards to taxes. \n\nThey arent good for most people. Most people would be better off investing in the sp500 directly.",
            "score": 5,
            "author": "RoundTableMaker"
        },
        {
            "level": 0,
            "comment": "In general you are buying a strategy which could be implemented in a taxable account much more cheaply.  The annuity buys you deferred taxation and expert implementation in exchange for a ton of fees. If you have an IRA you could do it at worst for slightly higher cost than it would be for taxable and it would only be slightly more  complicated.  Assuming this is a lot of money you could hire someone to do it for you fee only likely less expensive than the insurance company will charge.  If it is less money and you don't know what you are doing you are better off paying the insurance company than hiring.  \n\nNow comes the trick.  The annuity gets you mortality credits.  Unless you are in poor health mortality credits aren't worth that much till you are closer to 80.   You can look at a mortality table to figure out what chance of you dying is worth, again if under 60 and fairly healthy it ain't much.   I would not recommend an annuity unless you have a lot of taxable money you want to tax shield (an upper class use case) and even in that case I think you are better off balancing it or entirely using life products: whole life, IUL, VUL rather than annuities since you are still so young (i.e. you are better off taking the long side of term insurance than writing a policy against yourself).  \n\nAs far as the strategy, in general these strategies are a gimmick.  In investing you get paid to take risk.  The guy taking the risk gets the return.  If you don't want risk your get the return of bonds.  There are a lot of ways to make bond like returns look fancy but they are still bonds. \n\nSo mostly I'd say pay surrender charges and get this money naked into your IRA. You'll have to do a lot of math to figure out more than a probably type situation.",
            "score": 5,
            "author": "JeffB1517",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;So mostly I'd say pay surrender charges and get this money naked into your IRA. You'll have to do a lot of math to figure out more than a probably type situation.\n\nUnderstood - Thank you.",
                    "score": 2,
                    "author": "Trixter135"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My advice... Use a fee only advisor.  They are your better bet to give you more straight up advice.  Also, use an advisor that doesn't sell insurance products and that is RIA, i.e. FUDICIARY!!  Not a broker!!",
            "score": 2,
            "author": "10xwannabe",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes thank you.  I'm currently looking for one.  Thanks!",
                    "score": 1,
                    "author": "Trixter135",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My suggestion... Jump on [bogleheads.org](https://bogleheads.org).  Make an account and follow there primer on how to ask for financial advice.  There advice likely will be better then any FA.  It is  a bunch of DIY who are have no vested interest other then to give good advice.  They are all evidence based investors.\n\nAlso, a great place to ask for suggestions for fee only FA.  Vanguard has their own.  Garrett Financial planers has a whole network that ONLY do fee only time charged advice.  Pretty sure they are boglehead approved.",
                            "score": 1,
                            "author": "10xwannabe"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Does your adviser get any sort of kickback by getting you to switch to these different annuities?",
            "score": 1,
            "author": "taplar",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm working with a Fiduciary, but not 100% sure.  I'm sure there is something in it for them.",
                    "score": 1,
                    "author": "Trixter135"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You would be right, those products have no fees, assuming you don’t have a chargeable withdrawal within that 6 year surrender schedule. Purchasing one in your 30s was a bad idea, however at age 60 it’s not necessarily a bad idea for a person as their risk tolerance becomes more conservative. Essentially you are just transferring risk to equitable of more than 20% loss over the 6 years. You will not get dividends which do amount overtime. The contract probably states that the 500% cap and 20% buffer probably is “point to point  (PTP)“, but double check in the prospectus. PTP will look at the day you buy vs be 6 years later and you get how the performance does, within the buffer and cap.  If it is PTP, fluctuations within the 6 years do not matter. Lastly, you’re advisor will get paid, somehow. Nobody works for free, so ask them before purchasing. Question you have to ask yourself is a 20% stop loss (that only looks at two points in time) worth missing out on dividends over your investment timeframe (you can stay in the annuity longer than 6 years, usually up to age 90ish)?",
            "score": 1,
            "author": "skolo23",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;f it is PTP, fluctuations within the 6 years do not matter. Lastly, you’re advisor will get paid, somehow. Nobody works for free, so ask them before purchasing. Question you have to ask yourself is a 20% sto\n\nGood points and did not realize that.  I think I'll skip the annuity and maybe just jump into a S&amp;P index fund.  Thank you",
                    "score": 1,
                    "author": "Trixter135"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’ve learned over time that the higher the fee structure the lower return.  If there is a secret stew, marketed by “experts” yet costing more, it hasn’t held up over the years.  Plenty try but mostly fail, even Nobel Laureates.",
            "score": 1,
            "author": "Purpleprose180"
        },
        {
            "level": 0,
            "comment": "[4 Week T-Bills are paying over 5%](https://home.treasury.gov/resource-center/data-chart-center/interest-rates/TextView?type=daily_treasury_bill_rates&amp;field_tdr_date_value_month=202306) with no state or city taxes, just federal. Fed says they are not through raising rates so I am only buying 4 week bills and have them automatically reinvest when mature. There is no safer investment anywhere than the US Government.",
            "score": 1,
            "author": "24Robbers"
        }
    ]
}