{
    "id": "145zdqe",
    "score": 1,
    "title": "BIT0 Portfolio Composition - Confusing Prospectus",
    "author": "argybargy3j",
    "date": 1686401099.0,
    "url": "https://www.reddit.com/r/investing/comments/145zdqe",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm interested in learning more about ways to gain exposure to bitcoin over the long term, without the hassle of actually holding bitcoin, so I've been looking at BIT0.  My understanding is that BIT0 gains exposure to bitcoin by investing in futures contracts, and when you look at the prospectus, it says that \"The Fund seeks to provide capital appreciation primarily through managed exposure to bitcoin futures contracts.\"  \n\nYet when you look at the portfolio composition, more than half of the funds (currently 55%) are in cash and short-term treasuries.  Given the net expense ratio of almost 1%, can someone explain to me how a holder of BIT0 isn't just paying someone an outrageous amount of money to hold cash?  What am I missing with this fund?  Is it meant for speculators rather than long-term investors?",
    "comments": [
        {
            "level": 0,
            "comment": "The fund has exposure to bitcoin through futures, and futures contracts don't directly involve a transfer of money until settlement. On their website they list their nominal exposure to bitcoin in cash terms (about 840M as of writing), but the actual fund's assets are held in about 840M of treasuries.",
            "score": 3,
            "author": "generic_46927"
        },
        {
            "level": 0,
            "comment": "Futures contracts are leveraged. The cash position is used to offset the leverage. There is also a futures roll drag with BITO which means BITO will always under perform Spot BTC. BITO is a terrible long term investment if you want long term BTC exposure.  Just use a broker that has crypto support.",
            "score": 3,
            "author": "Reeeeeekola",
            "replies": [
                {
                    "level": 1,
                    "comment": "For those who are interested, BITC is the Optimum Roll variation. It's designed to mitigate the roll drag inherent in BITO.",
                    "score": 2,
                    "author": "arBettor"
                },
                {
                    "level": 1,
                    "comment": "Thanks.  Your reply is educational.",
                    "score": 1,
                    "author": "argybargy3j"
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt; exposure to bitcoin over the long term, without the hassle of actually holding bitcoin\n\nLook into etfs like WGMI.  Up 123% ytd, down 7% the past month.\n\n\"will invest at least 80% of its net assets (plus borrowings for investment purposes) in securities of companies that derive at least 50% of their revenue or profits from bitcoin mining operations and/or from providing specialized chips, hardware and software or other services to companies engaged in bitcoin mining.\"",
            "score": 2,
            "author": "SnS2500"
        },
        {
            "level": 0,
            "comment": "You should just burn your cash instead, itd at least be a fun way to lose money.",
            "score": 3,
            "author": "probablywrongbutmeh",
            "replies": [
                {
                    "level": 1,
                    "comment": "Cocaine and Hookers.",
                    "score": 3,
                    "author": "Valvador",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How does one buy cocaine, and meet hookers, on Wall Street?",
                            "score": 1,
                            "author": "argybargy3j"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;You should just burn your cash instead, itd at least be a fun way to lose money.\n\nLas Vegas, baby. You'll enjoy some spectacular shows and delicious buffet plus hours of fun playing the slots, roulette, craps, etc. while they suck the money out of you. You'll feel like a big-shot in your fancy hotel room and think \"I'm a high roller now\". With bitcoin you don't get shows, games, a hotel room and buffet, you just have the money sucked out of you. No fun in that.",
                    "score": 1,
                    "author": "Apprehensive_Ad_4020"
                }
            ]
        },
        {
            "level": 0,
            "comment": "While some have said, it does underperform BITC itself. However, I own about 1000 shares of BITO and receive a monthly dividend of $500. So, BITO is income producing while BITC is not.",
            "score": 0,
            "author": "jkinslan",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's paying out capital gains it's not income producing. You won't get dividends if spot BTC went down.",
                    "score": 2,
                    "author": "Reeeeeekola",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well it is down 9% from last month and I just got a dividend for .43/share.",
                            "score": 1,
                            "author": "jkinslan",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's a distribution from the NAV of the ETF. The share price went down by 43 cents you didn't accumulate new money.",
                                    "score": 2,
                                    "author": "Reeeeeekola"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Wait.  You mean they are taking 1% to manage my cash, and also pushing me into a higher tax bracket?",
                            "score": 1,
                            "author": "argybargy3j"
                        }
                    ]
                }
            ]
        }
    ]
}