{
    "id": "1463f2j",
    "score": 5,
    "title": "How to think about returns of extra mortgage/principal payments",
    "author": "PostPostMinimalist",
    "date": 1686411707.0,
    "url": "https://www.reddit.com/r/investing/comments/1463f2j",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi folks, about to get a 30-year fixed mortgage and trying to make an informed decision for what to do with excess savings each month. I have a math background but somehow this still melts my brain a bit so would appreciate some insight.\r  \n\r  \nThe standard advice is to make extra payments to principal if your interest rate is larger than the return you’d get from investing (made somewhat more complicated by taxes of course). I’ll be concrete and say I have a 5.5% interest rate, and that savings each month would be about 2x the mortgage payment.  And let’s say I expect home appreciation to be low (just tracking inflation).\r  \n\r  \nA few questions:\r  \n\r  \n(1) How do I think about the 5.5% “return” on making extra principal payments? Is this a return I’m getting on each dollar I put in for the length of the loan?  Or for how long?\r  \n\r  \n(2) If you refinance later, does this ‘return’ change? IE refinance after 5 years to 3% (nevermind if this will happen), does this mean that those extra principal payments are now only ‘returning’ 3% from this point on?\r  \n\r  \n(3) Does expected home appreciation rate play into this at all? Once mortgage/interest is done, all that money you put in is illiquid and just returns the appreciation rate no? Whereas money invested in stocks would continue to grow, on average, at a much higher rate. Basically I’m wondering if since the expected appreciation is low, that would be a reason to \\*not\\* make lots of extra principal payments and thereby tie up more money in an illiquid asset not growing as much in the long term? \r  \n\r  \nThanks all!\r",
    "comments": [
        {
            "level": 0,
            "comment": "The return only manifests at the end of the loan. When the loan ends is variable - you could pay it off early, refinance to another loan, sell your home to buy another, etc - so we can’t state definitively what the ultimate return will be. \n\nMeanwhile, any extra payments you make against the principal are effectively illiquid investments. You can’t benefit from them until the loan ends. Your subsequent monthly payments do not drop either. \n\nOver a period of 30 years, or heck even 5, you’re likely (not guaranteed, but likely) to be much better off investing that extra money in the market. You’ll also have multiple opportunities to exit if you feel like you’ve returned better than 5.5%. You definitely wouldn’t want to invest the extra cash in anything like a CD or something that returns less than 5.5% though, as now you’re effectively losing money.\n\nEdit: typo",
            "score": 6,
            "author": "SullyTheReddit",
            "replies": [
                {
                    "level": 1,
                    "comment": "Curious. I’ve thought about this as well, investing in something that has a greater ROI % than my current mortgage’s APR. However, I always step back thinking on how say $10,000 with a X% is actually going to be a higher ROI overall than $10,000 less in a hundreds of thousands mortgage loan since that loan compounds on a higher 10 to 100 times balance, i.e. $10,000 on 5% as opposed to $100,000 loan balance at 4%.\n\nWouldn’t the amount of compounded interest saved on a $100,000 loan at 4% be higher than the return of a $10,000 5% (assuming that’s guaranteed)?\n\nI don’t really know…just thinking about it. Would need to calculate it out. But any general wisdom there?",
                    "score": 3,
                    "author": "bretonics",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Mortgage interest doesn't compound. 5% on $10k is bigger than 4% on $10k.\n\nAnother way to think about it is that a $200k mortgage is identical to 20 different $10k mortgages.",
                            "score": 2,
                            "author": "hydrocyanide",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks for the example.",
                                    "score": 1,
                                    "author": "bretonics"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Let’s say you have a 100k loan at 5%, and 10k to “invest” (for round numbers). If you do nothing, your mortgage accrues 5k in interest in the first year. If you apply the 10k to your principle at the beginning of the year, your mortgage accrues 90k * 0.05 = 4.5k in interest instead. That 10k “bought” you a savings of $500. By way of contrast, if you invest 10k and earn 5% back, you earned the exact same $500. \n\nIn both cases, the investment can compound from year to year. So we can safely ignore that detail for now. \n\nSo the only real question is: which investment will return more? The loan is guaranteed at 5%. The stock market offers no guarantees. But, if you were to invest that in a relatively consistent and non-risky stock (MSFT for example), you’re far more likely to return significantly better than 5%. \n\nPlus that investment is far more liquid. You could move it from MSFT to AAPL anytime you want. Or to a T Bill if rates go up. Or use it as a down payment on another purchase (for example a car) against a loan that might have an even higher rate in the future. Basically you preserve options by not burying it in the loan where you can’t really get it back until you’re done with the loan.",
                            "score": 2,
                            "author": "SullyTheReddit",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks for the insight!",
                                    "score": 1,
                                    "author": "bretonics"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Making extra principal payments increases your equity and reduces the length of the loan/number of mortgage payments. \n\n1. Yes you are “making” 5.5% on each dollar because that is the rate of interest you pay on your borrowed cash . You just don’t see it till the end of the loan when you stop making payments sooner (or if you sell before you pay it off you see it in your increased equity stake but that return is not guaranteed to be 5.5 depending on the house market etc)\n\n2. Yes an No yes on how it effects your future extra payments . But your previous extra payments can help you if you refinance to a shorter loan term since you reduced the amount you are borrowing faster than making the minimum payment. Meaning you might can squeeze into a 15 year mortgage easier if that’s something you want.\n\n3. The biggest advantage is the mortgage is no longer eating your income sooner. So you could throw whatever use to be for your mortgage. You can invest more sooner because you have made those payments part of your “disposable”(employable?) income",
            "score": 2,
            "author": "Zero_Gravity067"
        },
        {
            "level": 0,
            "comment": "If you make a big payment, you can actually recast your loan (reduce monthly payments).",
            "score": 2,
            "author": "takitakipoke"
        },
        {
            "level": 0,
            "comment": "1) it is the lifetime of the loan\n\n2) it would be the 5.5% up until the refinance and then whatever the new rate would be.\n\n3) appreciation should not be factored in.",
            "score": 1,
            "author": "SonOfNike85"
        }
    ]
}