{
    "id": "146w2ga",
    "score": 1,
    "title": "Is it ok to backdoor a Roth IRA if you make under the max income limit?",
    "author": "TropicalGrackle",
    "date": 1686495549.0,
    "url": "https://www.reddit.com/r/investing/comments/146w2ga",
    "media_urls": [],
    "other_urls": [],
    "postText": "I file jointly with my wife and this year our combined income might be over the income limit for a Roth IRA. Thing is I don’t want to wait until the end of the year to find out. I want to max out my Roth IRA now. Is there any issue making a backdoor contribution now and then finding out at tax time we were under the income limit anyways?",
    "comments": [
        {
            "level": 0,
            "comment": "If you are eligible to do direct Roth IRA contribution, from tax perspective, that has the same effect as making a non-deductible traditional IRA contribution then converting it to Roth IRA (aka backdoor).",
            "score": 8,
            "author": "FantasticInvestor",
            "replies": [
                {
                    "level": 1,
                    "comment": "Or you can contribute to a traditional IRA this year and convert to Roth next year, if you want the tax deduction this year and/or you expect your income to be lower next year.",
                    "score": 1,
                    "author": "aznkor"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you consider the process that a backdoor IRA follows:\n\n1. Contribute to a pretax IRA with posttax money.\n2. Perhaps wait some time. Some say the IRS frowns on this process and that waiting between the two steps helps. To me this seems like putting your beer can in a paper bag and drinking from the bag: everybody knows what you're actually doing.\n3. Make certain you have zero dollars in any pretax IRA accounts for the person about to make a conversion.\n4. Instruct your broker to convert your pretax IRA dollars to Roth IRA account.\n5. Complete the IRS form (8606 I think)  to inform them that you have no taxable basis in the account.\n\nThere should be no downside other than the extra steps involved - unless you already have some pretax IRAs! The conversation step requires that you pay a pro-rata share of taxes if you do. Google that for more info if it affects you.\n\nIf you do have pretax IRAs, then you would prefer to do the direct Roth contribution instead, in which case your income limits may be an issue. Perhaps you could increase 401k contributions to make sure you stay under the limit, or consider a charitable gift find donation to lump your charitable contributions for the next few years into this year.\n\nWhatever you do, know that I'm just some guy on the Internet, not a tax advisor, and my advice is worth zero and may be totally wrong.",
            "score": 4,
            "author": "jimmityswimmity",
            "replies": [
                {
                    "level": 1,
                    "comment": "Backdoor Roth is written into law, there's nothing that can be frowned upon by the IRS.",
                    "score": 1,
                    "author": "br0mer"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The reasons direct contributions are preferred (if you are eligible):\n\n1) it's simpler\n2) no potential complications around pro-rata rules (if you have other traditional IRA money that effectively closes the back door).\n\nIf you're sure #2 doesn't apply, you could do the backdoor now if you like even if you would otherwise be eligible for a direct contribution.\n\nPersonally if I wanted to get the money invested now and I wasn't sure if I'd be over the limit for direct contribution, I would just go ahead and do the back door.",
            "score": 1,
            "author": "unbalancedcheckbook"
        },
        {
            "level": 0,
            "comment": "Yes you can. Do it if you feel even remotely unsure if you’ll cross the income phase out limit, and if you dont have pre-tax money already in a trad IRA. I’m saying this out of personal experience - good to have that peace of mind.",
            "score": 1,
            "author": "AccomplishedClub6"
        }
    ]
}