{
    "id": "147079m",
    "score": 0,
    "title": "Fidelity GO to use for work 401K rollover",
    "author": "JohnniesWaitress",
    "date": 1686505525.0,
    "url": "https://www.reddit.com/r/investing/comments/147079m",
    "media_urls": [],
    "other_urls": [],
    "postText": "Three years past retirement now and feeling like the world (Covid reduced) is going back to closer to normal I was wanting to roll over my 401K into a non work related account.    Fidelity makes it easy to take my Fidelity 401K and go to either an IRA in which I get to make all the choices or to use their Fidelity GO IRA option in which they make the choices into Fidelity funds based on some set of information I provide I presume on risk, etc.   The fee is 0.35% annually.  That’s $3500 on a million dollar account.  \n\nI was wondering if anyone has had experience with Go and what they thought?    I tend to be a leave it be and let it grow kind of guy.   I am also a believer that retirement is a 30 year gig and so stock reduction isn’t always an obvious plan of action. \n\nI can survive on my pension and future social security without ever needing to touch my 401K/IRA unless I wanted to do a splurge vacation or buy a swanky car.   \n\nI am 61 and have time to do any kind of manipulation to avoid RMDs later on so I am really just looking for opinions on GO.   Thanks.",
    "comments": [
        {
            "level": 0,
            "comment": "Fidelity Target Date funds are basically the same thing as Go and have much lower fees.  Go is a redundant program.",
            "score": 5,
            "author": "DueSecretary4174"
        },
        {
            "level": 0,
            "comment": "Consider the loss of legal protection from abandoning your 401k.  There may also be insurance options, such as stable value funds that you may not have access to otherwise.  Of course, the big drawback of the 401k is you may not have a choice and you may have to exit.  The investment options may also be very limited and/or expensive.  Just pointing out the legal angle, as that's often overlooked, and you can't go back once it's converted.  Not familiar with GO, so I'm sorry I can't comment on your primary concern.",
            "score": 1,
            "author": "Meet_The_Moment"
        },
        {
            "level": 0,
            "comment": "Fidelity Go is essentially an asset manager fund (target risk fund) that keeps you at a certain asset allocation. It’s much cheaper than the asset manager fund. Around half the cost, but with that being said, it’s a reactive rebalancing tool. Pretty much just uses an if then statement to rebalance the portfolio. \n\nIf your essential expenses are covered by SS and your pension, like you said the retirement money is for either lifestyle or legacy? Which do you value more? If it’s legacy, how’s your estate planning? Have a trust/will? Possible Roth conversions? If it’s lifestyle, then your number 1 enemy is sequence of return risk. Have a withdrawal strategy for your expenses that aren’t covered by SS or your pension will be key",
            "score": 1,
            "author": "GoodGooglyMooglyy"
        },
        {
            "level": 0,
            "comment": "I think Go is a worse than average robo.  It isn't horrible but I'd pick a better robo.  Since this money isn't taxable, if you want to stick with Fidelity AVGE is a fine choice as well for a simple all in one.",
            "score": 1,
            "author": "JeffB1517"
        }
    ]
}