{
    "id": "147sad4",
    "score": 0,
    "title": "Came across a LIRP as an investment. Not sure about the pros / cons.",
    "author": "yuppers333",
    "date": 1686590091.0,
    "url": "https://www.reddit.com/r/investing/comments/147sad4",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi Everyone! I am well into contributing to my 401K/ ROTH IRA / and brokerage. I'm on schedule to max everything out at the end of the year and have more money to invest outside of my brokerage. I am opening a mutual fund account, but am entertaining the idea of a LIRP. Does anyone have knowledge on a LIRP - Pros / Cons? Also, any experience with them? Are they a scam?",
    "comments": [
        {
            "level": 0,
            "comment": "Its not a scam but its generally not a great deal.   fees eat up most of the benefits and then some.  everything you do inside an LIRP typically costs money.  many people will tell you \"oh you just didn't have the policy written correctly\" but in reality they all cost quite a bit of money.    It depends on your risk tolerance too I guess or what you want to do with extra cash you have available.  for the lion share of people, just investing in index funds in a brokerage is the right choice once all other tax advantaged spaces are available.  If you have a ton of income you are looking to protect or suspect have more money in you estate upon death than the exclusion grants you, its possible you can have a well written policy made out and get some benefit from it but by and large, 95% of people do not need this and 95% of policies written today are generally terrible.",
            "score": 3,
            "author": "anusbarber"
        },
        {
            "level": 0,
            "comment": "It's basically a universal life policy, and I have never seen one actually do what they supposedly claim. The worse case I have seen in a dentist be sold one and put in 2.3 million over 27 years and have a total value of 1.8million. It was sold as a safe growth vehicle but he was down pretty far from the principal. I see very little use cases outside of estate planning and the max estate tax is like 13mm a person right now.",
            "score": 2,
            "author": "bbrackett"
        },
        {
            "level": 0,
            "comment": "You want a 5/10 year pay dividend policy, where you can access almost all your money by year 5, from top mutual companies like New York Life, mass mutual, and northwestern mutual with aim for around 5 years worth of expected living expenses in retirement for down years. Before retirement, you can use it as emergency fund or \"buy the dip\" fund.\n\nThese companies are owned by their policyowners so they get the profit they make, which is mostly from corporate bonds, among other things. It's a bond alternative.",
            "score": 1,
            "author": "Linny911"
        }
    ]
}