{
    "id": "148lsz6",
    "score": 9,
    "title": "SGOV ETF vs Treasury Direct",
    "author": "canadianskibum",
    "date": 1686680050.0,
    "url": "https://www.reddit.com/r/investing/comments/148lsz6",
    "media_urls": [],
    "other_urls": [],
    "postText": "What are the advantages and disadvantages of buying ETFs that follow Tbills versus buying directly from Treasury Direct. I understand ETFs have a fee but I’m more concerned with tax implications of dividends from ETFs vs what I get from Treasury Direct? Capital gains tax could be a factor but but we’re talking about fractions of a percent. Any help would be much appreciated. \n\nThanks.",
    "comments": [
        {
            "level": 0,
            "comment": "SGOV easy TD hard",
            "score": 15,
            "author": "Updated_My_Journal"
        },
        {
            "level": 0,
            "comment": "For 2022, SGOV distributions were 92.61% state tax exempt. A small amount of short-term capital gains may apply if selling shares in a taxable account.",
            "score": 6,
            "author": "Perfect-Platform-681",
            "replies": [
                {
                    "level": 1,
                    "comment": "Just buy shares near the end of the month (before the ex dividend date) and sell at the beginning of the month (after the ex dividend date). You'd likely have a short term loss that would slightly reduce your tax burden.",
                    "score": 1,
                    "author": "indie_hedgehog"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You can always buy treasuries directly from a broker. I personally don't find any value in using Treasury Direct to invest in treasuries. It depends on your financial situation and your preferences imo. Tax implications are negligible.",
            "score": 9,
            "author": "greytoc",
            "replies": [
                {
                    "level": 1,
                    "comment": "In general I agree but vanguard and Schwab don’t have auto re roll for treasuries fidelity does and treasury direct does as well. If you kind of want to set and forget.",
                    "score": 3,
                    "author": "MONGSTRADAMUS",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "In that situation a target duration treasury fund kinda solves that problem. And offers more options and flexibility.",
                            "score": 2,
                            "author": "greytoc",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "For arguments sake why would you want to pay expense ratio when you don’t have to and depending on the duration of the treasury you would be taking on some interest rate risk.",
                                    "score": 3,
                                    "author": "MONGSTRADAMUS",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That's kinda what I meant when I said that it \"depends on your financial situation and your preferences\".\n\nFor active investors and traders like myself, using Treasury Direct doesn't make sense because the treasuries cannot be used as collateral in a brokerage account. I think of Treasury Direct as a vehicle for savings and not for investing. \n\nI only use treasuries to generate yield on cash when it's not efficient to use methods like box spreads. If I need shorter term liquidity, I use a prime or government money market. \n\nFor longer duration - my risk tolerance is a bit higher, so I prefer funds that hold more than just treasuries. The expense is worth the additional yield and convenience since I don't know much about fixed income investing. \n\nThere are lots of ways to get exposure to US treasuries. All these methods exist because different people have different needs - Treasury Direct is great for people without a brokerage account. It's just not for me.\n\nBTW - What do you mean by \"taking on some interest rate risk\"? Afaik - interest rate risks exists whether someone uses Treasury Direct, buys treasuries directly, or uses a fund.",
                                            "score": 1,
                                            "author": "greytoc",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "i mean if you buy a fund thats holding longer than short term treasuries like vgsh for example thats 1-3year but it got hit pretty hard last year. The longer the duration the more interest rate risk you are taking. I am talking just etf/funds not individual treasuries that don't have any interest rate risk if you hold to duration.",
                                                    "score": 1,
                                                    "author": "MONGSTRADAMUS",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It works the same way with a fund. \n\nWith $VGSH since you mentioned it. The fund is designed as a 1 - 3 constant duration year treasury fund. \n\nThe fund will have an average yield to maturity and average weighted maturity. \n\nIf you hold the fund to at least the average maturity and reinvest dividends, it will yield the average yield. \n\nThe fund holds underlying bonds at different maturities to adjust and maintain a constant duration.\n\nSo today - if you invest in $VGSH - you can expect that in 2 years that you would have an annual yield of about 4.2% - [https://investor.vanguard.com/investment-products/etfs/profile/vgsh#portfolio-composition](https://investor.vanguard.com/investment-products/etfs/profile/vgsh#portfolio-composition) \n\nTreasuries have the same interest rate risk that you describe - if an investor bought a 2 year t-note 2 years ago, they are susceptible to the same rising or falling interest rate risks. You can smooth out the interest rates with a bond ladder - but that's kinda what you get with a constant duration fund.",
                                                            "score": 1,
                                                            "author": "greytoc",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "The point i was making if you were to buy vgsh or any longer duration treasury there will be years where you can lose Money, that wouldn’t be the case if you buy a two year treasury. You will get that yield for two years no matter what happens to interest rates between when you buy and sell.",
                                                                    "score": 1,
                                                                    "author": "MONGSTRADAMUS",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Yes. You are correct. And the same is true with VGSH. \n\nIf you buy VGSH and you hold it for 2 years, it doesn't matter what happens to interest rates because you will get that yield from VGSH. \n\nYour point that if rates rise between year 0 and year 2, the value of VGSH will fall is true. But the exact same thing will happen to the treasury, when interest rates go up, the treasury loses money in same way as VGSH.",
                                                                            "score": 2,
                                                                            "author": "greytoc"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}