{
    "id": "a1lu0s",
    "score": 3369,
    "title": "The father of the index fund says it’s probably only a matter of time before they own half of all U.S. stocks; ‘I do not believe that such concentration would serve the national interest’",
    "author": "ryeander",
    "date": 1543528239.0,
    "url": "https://www.reddit.com/r/investing/comments/a1lu0s",
    "media_urls": [],
    "other_urls": [
        "https://www.wsj.com/articles/bogle-sounds-a-warning-on-index-funds-1543504551?mod=mhp",
        "https://outline.com/DGK9Td"
    ],
    "postText": "https://www.wsj.com/articles/bogle-sounds-a-warning-on-index-funds-1543504551?mod=mhp\n\nhttps://outline.com/DGK9Td (if paywall)",
    "comments": [
        {
            "level": 0,
            "comment": "TL;DR - Index Funds are great, the problem is that the 3 big brokerages that dominate the market could soon control enough shares to bend pretty every public company to its will",
            "score": 1435,
            "author": "nealosis",
            "replies": [
                {
                    "level": 1,
                    "comment": "51% attack IRL",
                    "score": 954,
                    "author": "--MxM--",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm calling Kaiba",
                            "score": 231,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "screw the rules, i have money!",
                                    "score": 58,
                                    "author": "Borderlandsman",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Blue eyes white index funds ",
                                            "score": 34,
                                            "author": "pup_butt"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "My IRA was banished to the shadow realm.",
                                    "score": 22,
                                    "author": "Decyde"
                                },
                                {
                                    "level": 3,
                                    "comment": "Classic and AFAIK obscure moment to reference.",
                                    "score": 13,
                                    "author": "Aesthetically"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Out, am I?",
                            "score": 8,
                            "author": "_-__-__-__-__-_-_-__"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Some of those index fund companies are refusing to buy stocks of companies that have a \"super-vote\" stocks just for the founder and their buddies, with the exception of grandfathered stocks such as Facebook.",
                    "score": 258,
                    "author": "COMPUTER1313",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What does this mean? Please explain.",
                            "score": 94,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 242,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "SO can you buy all these stocks on the NYSE? Or do they only release certain types to the public? Why would you buy a stock with no voting rights?",
                                            "score": 40,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Most people don't buy stocks with the intention of voting, just as an investment of future payouts.  Splitting shares into classes allows those who want a say in the company, and those who just want dividends/value, to not have to compete for the same pool of shares.  If all shares were the same it would mean a whole bunch of vote dilution and could create a situation where someone owns a small percent of total shares, but has a majority vote due to most not participating in that system.  \n\nOn the flip side, it allows owners to retain control of their company while also issuing shares.  They get the benefit of investment without the drawback of accountability to those investors.  Since there's so much information about the markets, and they're designed to be as confusing as possible, you might not even know the shares you own are non-voting, meaning you have no say in how your investment is used.  While this prevents hostile takeovers, it also ensures terrible management remains unchallenged.  It's why Elon Musk can cuss out and hang-up on investors and they can't do much of anything about it.  Musk still controls the majority of voting shares.\n\nIf you intend to participate in company decisions, it's important to know which class of shares you need to purchase.  Voting shares are usually more expensive, and some classes don't even pay dividends(they're solely for voting).",
                                                    "score": 152,
                                                    "author": "Roast_A_Botch",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "thanks for the explanation ",
                                                            "score": 11,
                                                            "author": "potsandpans"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "So thank you. I never fully grasped some of this before.\n\nRelated question: it's a trope in literature of people being \"forced out\" of companies they founded. Is this related in some way to that?",
                                                            "score": 10,
                                                            "author": "hyperviolator",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Yes. That is exactly why these different types of shares exist.\n\n&amp;#x200B;\n\nSo let's say a company divides itself into 100 pieces. Each piece is a share. Typically, a business will have a meeting for everyone with a piece of the company to come together and decide by vote who should be in charge of the company, how the company should be run, etc.  For voting purposes, each of the 100 pieces would get one vote. Now let's say you're the company founder, and over the years you have kept 51 pieces for your self. Congratulations! Whatever you want to vote for happens, because you have a simple majority (you wouldn't split your own votes against yourself, would you?)  Now let's assume you fell on hard times and sold 2 shares, so now you only have 49 shares; and you said something really bad, and the owners of the other 51 shares hate you. They now have the majority, and use their 51 votes to override you forever. Maybe they vote to sell the company to someone else.\n\n&amp;#x200B;\n\nTo overcome this scenario, businesses have come up with voting shares, and non-voting shares. Now let's pretend the previous scenario happens, but when you set up the company, you created 50 voting shares and 50 non-voting shares, and kept the voting shares to yourself. You still fall on hard times and sell off two shares: one voting, and one non-voting. Now it doesn't matter what you do or say, because when you sold off 2 shares, you only sold one voting share. You still only have 49 shares, but there's only one other vote out there floating around. You maintain control of the company because no one can out-vote you, even though you no longer own more than 50% of the company.",
                                                                    "score": 31,
                                                                    "author": "Spiffy87"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Not usually.  Founders are typically voted out by the board.\n\nIts possible to use voting shares to stack the board and then vote out the CEO but this is more of a hostile takeover than it is just forcing out the founder.  Typically founders are forced out because the board disagrees with them.",
                                                                    "score": 9,
                                                                    "author": "Synaps4"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt;If all shares were the same it would mean a whole bunch of vote dilution and could create a situation where someone owns a small percent of total shares, but has a majority vote due to most not participating in that system. \n\nSounds like the exact same situation in terms of voting, since what matters is the relative ownership between the voters.\n\n&gt;On the flip side, it allows owners to retain control of their company while also issuing shares. They get the benefit of investment without the drawback of accountability to those investors.\n\nYup, that makes more sense. I don't agree with it but it's an actual reason. ",
                                                            "score": 2,
                                                            "author": "ric2b"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "That makes a lot more sense now, thank you for explaining that",
                                                            "score": 1,
                                                            "author": "jww1117"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Musk does not have a majority of votes, only about a quarter. He uses a supermajority requirement to make sure he maintains the status quo.  ",
                                                            "score": 1,
                                                            "author": "TeddysBigStick"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Passive investors, even some large ones, frequently place no value on voting rights. Either their share is small enough that their vote would be meaningless or they believe that either the controlling shareholders or management of the company are better placed to make decisions. E.g., I'm not going to tell Sergey how to run Google because I will probably make more money with him doing it.\n\nAlso, it's Cheaper",
                                                    "score": 6,
                                                    "author": "NewSouthWails"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Cheaper",
                                                    "score": 6,
                                                    "author": "Hamster_S_Thompson"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "When you are an individual investor your vote doesn’t mean anything when you own 100 out of 350Million shares",
                                                    "score": 18,
                                                    "author": "ultrasuperthrowaway",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "To be fair that's roughly your vote weight in a mid-size state election. People scorn the mentality that your vote doesn't count, why isn't there the same mentality for investors? Are the decisions rarely as close as political elections?",
                                                            "score": 26,
                                                            "author": "flimflambananarama",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "If a company is 70% owned by large investors, then those people effectively control the vote unless they are fairly evenly split on a proposal. The company would usually canvass privately with the big shareholders, so that they know there will be a majority before even formally proposing a vote.",
                                                                    "score": 8,
                                                                    "author": "brainwad"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[deleted]",
                                                                    "score": 7,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Interesting because in politics everyone's interests are aligned too, \"What's best for the country\", and the disagreement is how to do it. At least, in theory.",
                                                                            "score": 5,
                                                                            "author": "TripleCast"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Good job Google.",
                                            "score": 6,
                                            "author": "docmedic",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I mean... it’s not like they were doing it out of the goodness of their hearts. It’s just the way that the current leaders can make sure they retain control",
                                                    "score": 4,
                                                    "author": "zaphod4prez",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt;goodness of their hearts\n\nIsn't that just an unnecessary purity test?  They're still doing capitalism right and preventing an index fund economy monopoly.",
                                                            "score": 5,
                                                            "author": "docmedic",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Ok, sure, we can say we don't care about whether they're doing something good for the world or not*, then I'd say...they didn't do that because of anything to do with index funds. They did it so that they could retain control over the company while still raising money. The idea that this could have some bearing on index funds or whatever absolutely never crossed their mind— this stock split strategy is super common and founders do it for one reason— maintaining control.\n\nI mean I guess it's 'good job google' in the same sense that I did a good job leaving work late today because it just so happened that when I walked outside it had just stopped raining. Because, entirely by coincidence and without any intention, intelligence, or forethought on my (Google's) part, I (google) happened to do something that turned out well for me (the economy — in one small and specific way).\n\n---\n\n\\* Personally, I do care about that, and I don't think it's an \"unnecessary purity test.\" I think that \"is this morally good\" is a primary and necessary test for every action any person takes, ever, no matter what.",
                                                                    "score": 2,
                                                                    "author": "zaphod4prez"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "A good example is SNAP class C shares owned by the two founders. ",
                                            "score": 2,
                                            "author": "10-k"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Yes me too I  needs explanation ",
                                    "score": 1,
                                    "author": "lolocccc"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Just a small correction.\n\nIt's not the index fund implementing this rule it's the index itself modified their methodology and rules that a stock must follow to be in the index",
                            "score": 3,
                            "author": "SirGlass"
                        },
                        {
                            "level": 2,
                            "comment": "What is grandfathered?",
                            "score": 1,
                            "author": "Deadwolf_YT"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Wouldn’t it be the index provider that would have the control....by controlling which entities are included in the indices that the funds track?",
                    "score": 34,
                    "author": "onagoth",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The funds themselves have the voting rights.",
                            "score": 47,
                            "author": "astrange",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I see what you’re saying now.  Do fund managers typically exercise these voting rights?  Given that many index funds are passively managed, it seems like this is something that would be foregone.\n\nI’ve never come across this issue in the ETF statements that I’ve reviewed",
                                    "score": 14,
                                    "author": "onagoth",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "https://about.vanguard.com/investment-stewardship/policies-and-guidelines/\n\nhttps://about.vanguard.com/investment-stewardship/how-our-funds-voted/\n\nChecking one of the S&amp;P funds, it looks like they voted entirely with management, but they definitely reserve the right not to.",
                                            "score": 40,
                                            "author": "astrange"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Yes, they do, particularly for large component investments. There are a couple governance issues in particular that tend to pique their interest. One class of issues might be termed control rights. As others have suggested, institutional shareholders tend to dislike provisions that dilute or minimize their voting rights relative to their holdings. Along the same lines, they tend to disfavor anti-takeover measures like poison pills. They like to ensure that they have say in directors, so resolutions that reserve or create seats for independent directors are often favored. Funds and other institutional holders are also sensitive to their own public image and things that might be seen as burnishing that. So voting in favor of shareholder resolutions that might advance that — and that aren’t facially detrimental to the company’s financial performance or ability to operate — are favored. These often come in the form of things like diversity initiatives for board composition or employee hiring, or any number of lip-service resolutions pandering to issues in the public eye. \n\nExecutive compensation can be a little tricky and go either way. Funds are sensitive to the notion that executive compensation should align management’s interest with increasing shareholder value. But that can sometimes be difficult to ascertain. Funds also recognize, in the one hand, that there is a competition for top talent, favoring generous compensation packages, and, on the other hand, that compensation packages that appear outsized or disproportionate, whether measured by company financial performance or in comparison to average worker compensation, are perceived negatively. \n\nAnd, of course, funds pay attention to and vote their perceived economic interests in strategic decisions that are put to shareholders. A proposed merger would be a typical example. ",
                                            "score": 9,
                                            "author": "mortymotron"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 19,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I work for a big company that was trying to be controlled\ned by a hedge fund once. The general idea seemed to be that a lot of what they wanted done would show huge short term gains but gut long term plans. ",
                            "score": 30,
                            "author": "mtcoope",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's fine for a hedge fund because they can sell once they pump up the price. An index fund doesn't control when they sell so that strategy wouldn't work and they should, theoretically, take a more long term view.",
                                    "score": 12,
                                    "author": "[deleted]"
                                },
                                {
                                    "level": 3,
                                    "comment": "I think index fund holders for the most part are in it for long though. ",
                                    "score": 2,
                                    "author": "lemongrenade"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I think the broader issue is that it would be the same three guys in control of *every* company. ",
                            "score": 5,
                            "author": "bilbobagholder"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Maybe there needs to be some kind of regulatory framework where passive funds are always silent partners? It fits the passive mentality for them to be \"abstain only\" and just buy/sell based upon market performance.",
                    "score": 5,
                    "author": "G_Morgan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Eh, then if something questionable is coming up in a company, and they cannot vote to fix it, I assume all those stocks would be sold off, flooding the market, tanking the price. ",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That isn't how index funds work. The fund only sells if the stock falls off the index.",
                                    "score": 10,
                                    "author": "G_Morgan",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Case in point why I don’t believe ANYTHING anyone says on Reddit. Most people are morons lol. ",
                                            "score": 1,
                                            "author": "grokforpay"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "So just the free market working as intended then ",
                    "score": 3,
                    "author": "phogron",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not really. The free market only works as intended when consumers are fully informed and perfectly rational. It’s impossible to believe every index fund investor has considered the far reaching implications of fund providers with an increasingly large percentage of total market voting rights ",
                            "score": 2,
                            "author": "xwm69x",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Correct. Also, the free market can only work as intended when every agent is small enough that can't change the entire market in a meaningful way on its own, purposely or not.",
                                    "score": 1,
                                    "author": "apistograma"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Aren't they a self fulfilling prophecy though? Index fund gets investment which goes straight into the market..which makes the market rise.... which makes the index fund rise.....which makes its return better which.... makes it more attractive to investors....bit of a bubble? ",
                    "score": 6,
                    "author": "justbrowsinginpeace"
                },
                {
                    "level": 1,
                    "comment": "Not to mention the blind following of index funds has created very real distortions in valuations.",
                    "score": 2,
                    "author": "Fibbs",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So go profit off those distortions :)",
                            "score": 2,
                            "author": "grokforpay"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "come on man, i'm sure there's some moral gymnastics we can do to justify it",
                    "score": 1,
                    "author": "yunghastati"
                },
                {
                    "level": 1,
                    "comment": "Greed is Good\n\n- Gekko",
                    "score": 1,
                    "author": "desistrategist"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Its a corp governance issue, has been going on for a while.  SEC just had a listening session not long ago.\n\nThis doesnt have impact on the performance/fee advantage over active funds ",
            "score": 317,
            "author": "Teddy125",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don't know how to feel about this. One of the major aspect of modern coporate governance is increasing institutional shareholding. Time and time it has been proven that individual shareholdors seemed to be have no knowledge, or authority over their invested entity or the market.\n\nOn the flip side nobody predicted that institutional shareholding will it self become monopolistic. Government is supposed to curb the predatory sides capitalism. But what happens when the institutional shareholders becomes larger than the government itself?",
                    "score": 17,
                    "author": "anyfactor",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s fine it’s just there are too few institutions now. There need to be more. ",
                            "score": 16,
                            "author": "BlueOrcaJupiter",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Many including Buffett hold Jack C Bogle in very high regards. He is not even a billionaire, but he has an extremely rational, value oriented, low risk and I think a utilitarian view of investing.\n\nBut capitalism in it's truest form will always converge toward monopolism. Bogle is well-intentioned but he knows all about, and he cant do nothing about it. There is nothing we can do about, as congress itself is not competent nor independent enough to deal with alpha capitalist entities.\n\nIf i had argued this case with my professor who is an expert in governance, will tell me more regulations by independent  non-political competitive experts of elite class is the only way. But in real world that is never going to happen.",
                                    "score": 6,
                                    "author": "anyfactor",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;independent non-political competitive experts of elite class\n\nCan you provide some examples?",
                                            "score": 2,
                                            "author": "dingosnackmeat",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "University professors. His version of elite is slightly different than our version of elite. He defines elites as cognitivly abled, creatively gifted and with disposable income. People who are not bound by hierarchical structures or financial liabilities. ",
                                                    "score": 5,
                                                    "author": "anyfactor",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Many university professors are the antithesis of non-politicial.",
                                                            "score": 5,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Of course they are!! The selction process must be as objective and unbiased as it can be. \n\nThe position of authority in corporations and in political entities holds extreme level of power, so it must be granted to those who are not corrupt and yet gifted. \n\nEssentially what my professor is preching is libertarian capitalist meritocratic ideaolgy, with just enough regulations to create and maintain a perfect competition.\n\n He believes that every institution even wealfare public welfare institution will excel if they all are fully privatized and lead by independent, non-executive and non - political experts at the helm\n",
                                                                    "score": 2,
                                                                    "author": "anyfactor"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Everyone/thing is bound to a innate biological hierarchical structure. Both from a behavioral and social aspect. Even Kings and CEO's have to answer to their subordinates every so often.  ",
                                                            "score": 1,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Independent experts sounds very good, but I've never believed that such important institutions can ever be free of influence and conflicts of interest. That was what I was told in college about the BCE and I think most people can see that it's not working optimally.",
                                            "score": 1,
                                            "author": "apistograma"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I knew the legitimacy of this statement would be raised. But I am lazy and have no intention right now to open up my bibliography manager for my ongoing pathetic thesis. \n\nThis is a well known phenomenon that individual shareholders -\n\n- does not have the right to privileged information comapared institutional shareholder\n- individual shareholders when faced with an issue can only just sale (exit) the stock, where institutions can raise concern and effect decision making\n- markets can dynamically get skewed based on institutions activity compared to individuals activity \n- institutional shareholders concentration and power over the market makes individuals decisions trivial\n- institutions has expertise, knowledge and in some cases collective unity with other institutions that is a powerful force to reckon with.\n\nPlease google to find out more, but as far as I remember currently 80% of all public stock in US are held by institutional shareholders. And among them the top 5 institutions owns close to 50% of stocks.",
                                    "score": 4,
                                    "author": "anyfactor"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 70,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I disagree.  The market should self correct.  Index funds are on the rise because the market for active management is saturated.  The market is extremely good at determining the price of the stocks, so its difficult for active management to beat the market.  The causes more people to use index funds.  If it starts to swing too far the other way, it will create opportunities for active management to invest in undervalued companies, thus encouraging active management.  It seems to me that active vs passive will swing back and forth, but generally push toward middle ground.",
                            "score": 233,
                            "author": "asanano",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 7,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That's a good point, but not exactly the point I was trying to make.  There are several markets you are talking about.  I was referring just to the stock market, you were referring to the phone market as well.  As far as price collusion goes, the companies already have incentive to reduce competition, regardless of who/how the companies are owned.  I could certainly see extremely high index fund ownership exasperating the problem, however, I think, the problem mainly seems to fall into government regulation.",
                                            "score": 1,
                                            "author": "asanano"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Many active managers actually recommend a large spread of passive indexes in any balanced portfolio. Not all passive perhaps, but definitely a balance between the two, perhaps 90/10. (majority being indexed funds)",
                                    "score": 16,
                                    "author": "perestroika12"
                                },
                                {
                                    "level": 3,
                                    "comment": "How will active management ever beat passive management whether active is 10% or 90% of the market. Active managers are competing against themselves and the average performance of all active managers will equal passive minus the fees active managers charge.\n\nPassive investing is just going to keep growing unchecked at this rate eventually negating all the benefits of the stock market. I really don't see what stops it.",
                                    "score": -2,
                                    "author": "Asgen",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's true that active managers on average can't do better than passive, but presumably there will be some better than average investors who can beat the market.",
                                            "score": 15,
                                            "author": "Flapling",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That's always been the case. But it's very hard to pick which active managers will outperform. Hence the allure of index funds. This is why index fund penetration will just continue.",
                                                    "score": 3,
                                                    "author": "Asgen"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "And only 4% of stocks generated the market value over the last 90 years. So you only need to buy from that small base to basically have outstanding performance in the long run and beat market returns.",
                                                    "score": 5,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Great, you only need to be able to predict the future and already know the winners in order to win....",
                                                            "score": 6,
                                                            "author": "tending",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "This.  ",
                                                    "score": 2,
                                                    "author": "asanano"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt;Active managers are competing against themselves and the average performance of all active managers will equal passive minus the fees active managers charge.\n\nFlat out wrong on this one.\nImagine a poker table with 3 pros and 5 fishes. It is entirely possible to have all the pros to wins against the fishes.\n\nNote: Not arguing all active managers are beating the market but arguing average active performance =/= passive performance",
                                            "score": 10,
                                            "author": "alexpung",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "But if active managers are setting the price, then passive funds will equal the average performance of the active managers. On average, the 5 fishes will do just as well as the 3 pros.",
                                                    "score": 3,
                                                    "author": "Asgen",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "how so?\n\ncounter example:\nShitty company A (example would be FTR a few years ago) is in S&amp;P 500  \nActive managers don't buy company A  \nPassive managers still buying company A   \n\nSo according to your theory since active managers don't have any A, the price must be low. However since passive managers (**and government** see Japan) are still buying, they artificially prop up the price of A.\n  \n  \n\nThen misery occurs when said company obviously can't earn money and being kick out of the index a few years later. \n\n  \n&gt;But if active managers are setting the price\n\n  \nActive managers don't set the price, the market price is set by **all** market participants. Which include active/passive funds/government/retail and even the company itself (share buyback)\n\n  \nIt is a huge misunderstanding that active managers are dictating market prices but in fact they are only one type of market participants. \n",
                                                            "score": 1,
                                                            "author": "alexpung",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Because active managers are the only \"smart\" players in the market setting the price. In your example, the stock price of that company may not go down when misery hits because there's so much blind passive buying keeping the price up.",
                                                                    "score": 1,
                                                                    "author": "Asgen",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "dumb players are also setting the price, see any of the many bubble in history.",
                                                                            "score": 1,
                                                                            "author": "alexpung"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "One aspect is liquidity. Yeah before fees the active and passive component should have the same returns. One difference though is liquidity, passive needs to pay active for liquidity. There's a philosophical economics post on it.",
                                            "score": 2,
                                            "author": "Jiecut"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 2,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "In this scenario, it's very unclear to me whether the one stock growing 1000%/yr would price materially different than the 499 companies that are about to go bankrupt because of constant inflow of passive buying. At a minimum, this example shows how passive funds can distort pricing.\n\nIts even more acute for start up companies that may not chose to list on the stock exchange anymore if there aren't enough active managers doing price discovery and instead stay private. The American public would miss out on these gains.",
                                                    "score": 1,
                                                    "author": "Asgen"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt;If 100% of people just threw the money into the sp500 index, then bad companies would never get weeded out, there would not be a secondary market for the stocks of non-sp500 stock offerings, etc.\n\nBut in that scenario, an active investor would make a killing while passive investors lose money.",
                            "score": 18,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "A company does not succeed or fail solely on the stock market and passive investors that use the market for retirement purposes shouldn’t have to be active investors. \n\nYou’re trying to eliminate the last vestige of retirement, now that pensions are a relic and social security is on its last leg.",
                            "score": 29,
                            "author": "some88d00d",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He didn’t say the first thing, and the second is a baseless wild accusation. Get a grip, man",
                                    "score": 6,
                                    "author": "[deleted]"
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 2,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "hmmm, I mean as more investors come into the scene, there will be more demand and therefore price movement. But I can see how market efficiency may drop if a large concentration of stocks are in passive investment strategies.\n\nThere really would be no incentive for active investors to ensure the market is efficient. And then what happens? \n\nI guess we will have an age of funds that look for those inefficiencies and really REALLY exploit/manipulate the market.",
                                            "score": 6,
                                            "author": "bliss19"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I could be wrong, since I'm not very knowledgeable about investing and I don't live on the US, but aren't US 5-10 year bonds around 3%? That's above inflation. I'm sure getting S&amp;P 500 performance is much better most of the times, but they're not granted benefits despite being safer than other funds. You can't know if the index will fall 15 or 20% during the next 10 years. If your main goal is to keep your wealth at maximum safety and you're ok with lower yields, I don't see why you wouldn't just buy government debt. Maybe I'm very risk averse, but that's what I'd do if the Euro bonds weren't so stupidly low right now.",
                                    "score": 1,
                                    "author": "apistograma"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Not sure if you have heard of ISS.",
                            "score": 2,
                            "author": "Teddy125"
                        },
                        {
                            "level": 2,
                            "comment": "Let's not start using the t word. Unless we're getting rid of some *cough* most *cough* of them. ",
                            "score": 2,
                            "author": "pan-taur"
                        },
                        {
                            "level": 2,
                            "comment": "&gt;the government could just nationalize all wealth and things would be great.\n\nLMAO, yeah, about that. ",
                            "score": 2,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "&gt;then bad companies would never get weeded out, there would not be a secondary market for the stocks of non-sp500 stock offerings, etc.\n\nThat doesn't rmake sense to me. Bad companies are weeded out when their liabilities exceed their assets and they can no longer continue to be a viable business. It seems like what you want to say is that indexes lead to overvaluing certain companies. But that just increases opportunities for people who want to be active investors. the price of a stock really has nothing to do with companies being weeded out. Stock price has nothing to do with fundamentals.",
                            "score": 4,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 2,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;So you see, it does effect their ability to stay afloat. It is active investors that say \"this company has lost all their money, is 100 billion in debt, and has no plan. I will stay away from their equity offering\" that make a company go bankrupt\n\nYou seem to think that all the active investors could sell their stock, but somehow the company could stay afloat by just issuing new stock that gets bought by funds?  Fund flows are proportional to the market cap. This would murder the market cap and fund flows with it.  Not to mention each new equity issuance would be worth less than the last because of dilution. But, points for a creative yet sophistical argument.",
                                            "score": 3,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 3,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt;The over arching point is that when investors are not discriminating between companies it means there is inefficient allocation. There is a point that as passive investing grows there will be more opp for active investors, so it will never capture 100% of the market. That is very true. But, my point is that in general it is in society's interest to have as many discriminators of where capital goes as possible. Reduce that mechanism and it's not good\n\nHonestly, it's hard to follow your point, because it keeps changing. I was addressing this point you made:\n\n\"It is active investors that say \"this company has lost all their money, is 100 billion in debt, and has no plan. I will stay away from their equity offering\" that make a company go bankrupt\"\n\n&gt; It destroys the stock price.\n\nWhich causes active investors to bail leading the stock price even lower along with the market cap. are we doing some kind of academic exercise here where we imagine what the market would look like if it were 100% controlled by funds? Because I was talking about the actual market not this theoretical one that you seem to be talking about.\n",
                                                            "score": 2,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[deleted]",
                                                                    "score": 4,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Well fuck, I guess I should take it easy on the whiskey.",
                                                                            "score": 1,
                                                                            "author": "[deleted]"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I hadn't even thought about this, thanks for the well thought out explanation, it was interesting :)\n",
                            "score": 1,
                            "author": "jpiomacdonald"
                        },
                        {
                            "level": 2,
                            "comment": "Isn’t the tax already there in terms of marginal lower performance?",
                            "score": 1,
                            "author": "Cerulean358"
                        },
                        {
                            "level": 2,
                            "comment": "Wasn't there a thought that the higher the index participation gets the more inefficient the market becomes? If I was the 0.001% of the population that decides to tilt away from SP500, there would be tons of low hanging fruit",
                            "score": 1,
                            "author": "TheChosenWong"
                        },
                        {
                            "level": 2,
                            "comment": "Broker, eh...?",
                            "score": 1,
                            "author": "CL300driver"
                        },
                        {
                            "level": 2,
                            "comment": "More taxes? No thanks.",
                            "score": 1,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "lol like the individual investor votes are worth anything",
                            "score": 1,
                            "author": "shadowbannedlol"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "https://outline.com/DGK9Td\n\nIf you encounter paywall",
            "score": 44,
            "author": "ryeander",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you",
                    "score": 3,
                    "author": "Driller123m"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It is definitely a problem that should be dealt with in the near future.  At the same time, I’m not overly concerned about it, in part because I’m a small scale investor who doesn’t have the economic clout to really change anything about it.  I suppose I’ll just have to trust the powers that be... cause that’s never backfired.",
            "score": 148,
            "author": "CrymsonStarite",
            "replies": [
                {
                    "level": 1,
                    "comment": "....cause you've never nor will have another choice. \n\nMe niether lil buddy.\n\n#admiralindextillidie",
                    "score": 16,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "You can write to the powers that be. You can petition the powers that be. You can stand with signs in front of the offices of the powers that be. You can change anything with enough people doing those things with a common message. ",
                    "score": 18,
                    "author": "SqueakyToast",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You can even be ignored.",
                            "score": 8,
                            "author": "James_Solomon"
                        },
                        {
                            "level": 2,
                            "comment": "Chill out Mr. Motivation I’ll just hang out here at my house instead. ",
                            "score": 3,
                            "author": "mowbox_mowmoney",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I know right ? he needs to eat some cheetos and chillax.",
                                    "score": 2,
                                    "author": "barsoapguy"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is it a possibility that these few large companies don't have the voting rights, but that the investors receive them? Of course, that would give you voting rights in nearly every company in the world, but most people wouldn't care voting at all anyway... ",
            "score": 50,
            "author": "Pistowich",
            "replies": [
                {
                    "level": 1,
                    "comment": "Most ETF providers keep the voting rights. They probably don't have to.",
                    "score": 36,
                    "author": "astrange",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s a really interesting point. Are there ETF providers that allow owners to vote? That would be an interesting product to present.  ",
                            "score": 6,
                            "author": "openglfan",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Interesting, but probably not viable. The collective action costs of voting on everything that comes up for reach company on a well diversified fund is enormous. Most funds use services that just recommend how they should vote their proxies. Getting your average fund investor to want to be that active is counter intuitive to the goal most ETF share owners have in mind.",
                                    "score": 15,
                                    "author": "Alecomia",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah, and in addition to having hundreds of underlying companies, most individual (ETF) investors would only own fractions of shares in many cases. ",
                                            "score": 9,
                                            "author": "NotMyBike",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I agree, but it would be possible to sum up the fractional votes and vote the proportional results. I own about 78% of a share, etc.  The votes get summed up and split among the trades owned in the ETF as a weighted sum.\n\nIt would be interesting for “socially conscious “ funds.",
                                                    "score": 7,
                                                    "author": "openglfan",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "That is indeed interesting. Maybe the fund should give the fundholders the right and possibility to vote online, and the fund collects all votes. Next, all these votes are used in the voting process in the company, with all votes not used transfering to the ETF providor to give them still something.\n\nIt's just completely wrong that they get so much voting power while not taking the risks. It's even worse than dual class shares imo. ",
                                                            "score": 3,
                                                            "author": "Pistowich"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Swell Investing doesn't use ETFs (you own all the shares directly) but it does let you vote. I can't say it's worth the effort to vote for 200 companies you own $50 of.",
                                    "score": 2,
                                    "author": "astrange"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It would be a lot more complicated than that. If you directly buy stock in one company you typically receive one vote per share. When you buy an ETF you might have 1.23 shares of ABC, 0.09 shares of DEF and 0.87 shares of XYZ. You can't vote based on ownership of half a share (you also can't technically own half a share). \n\nThe ETF provider owns the stock, but you own shares of a fund who's value is determined by the underlying stocks",
                    "score": 2,
                    "author": "InfiniteExperience",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They could just round it down for partial shares. Better yet, they could combine the votes of multiple people that have partial shares to give them a combined vote. A few people would then have one vote together, which doesn't seem too complicated if they use an online voting tool that then combines all votes. The ETF provider should then vote for everyone, so for example with 40% of their shares pro, 55% against and 5% blank. ",
                            "score": 3,
                            "author": "Pistowich",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "84 percent of all stocks owned by Americans belong to the wealthiest 10 percent of households\n\nI’m not sure we need to worry about too many millennials with index funds",
            "score": 154,
            "author": "Dividendz",
            "replies": [
                {
                    "level": 1,
                    "comment": "How wealthy do you have to be in the top 10% of American households and where can I find that data?\n\nEdit: \"The top 10% of families -- those who had at least $942,000 -- held 76% of total wealth. The average amount of wealth in this group was $4 million.\"\n\n\"Everyone else in the top 50% of the country accounted for 23% of total wealth, with an average of $316,000 per family.\"\n\nhttps://money.cnn.com/2016/08/18/pf/wealth-inequality/index.html",
                    "score": 8,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Just want to point out 942k isn’t as hard to obtain as people think.   This is easily a factory worker who just retired who never touched his company 401k and investments.   Also fun fact, it now roughly costs 2 million to fully retire. ",
                            "score": 9,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "You only need to make $26K a year to be in the top 1% earners in the world.",
                            "score": 2,
                            "author": "xabl00",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Income is not net-worth. \"Wealthiest households\" means highest net-worth, not highest income.",
                                    "score": 1,
                                    "author": "N0_G00D_NAMES_LEFT"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'm a millennial and I'm probably in top 10%. Top 10% is not very hard to break into, as far as I can remember",
                    "score": 40,
                    "author": "iopq",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "In the US 56% of people will be in the top 10% of earners at some point in their lives and 12% will at some point be in the top 1%. ",
                            "score": 46,
                            "author": "Warbane",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Do you have a source for this?",
                                    "score": 17,
                                    "author": "zorro226",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Sure: here's a [NYT write-up](https://www.nytimes.com/2014/04/20/opinion/sunday/from-rags-to-riches-to-rags.html) summarizing the findings of a couple of research efforts studying long-term earnings mobility.",
                                            "score": 25,
                                            "author": "Warbane",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 2,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "If you bought a house and sold it for a large gain you could be. ",
                                                            "score": 6,
                                                            "author": "_mr_prezident"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 7,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "What does this have to do with wealthy inequality gaps and the travesty that is the top few percent of people controlling the vast majority of the wealth? ",
                                            "score": 2,
                                            "author": "hlokk101"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I assume that 84% statistic is talking about net worth not income.  It takes a net worth of $1.18 million to be in the top 10% of net worth.  That's pretty damn good for a millennial.",
                            "score": 27,
                            "author": "3f78h87",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm in my thirties, so millennial doesn't actually mean a very young person anymore",
                                    "score": 20,
                                    "author": "iopq",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "So you're saying it's \"not very hard to break\" $1.2 million net worth in your 30's?\n\nAssuming you're 35-39, if you were worth $1.18 million (which I highly doubt) you'd be in the top 4% for your age. \n\nSomething that only 1 in 25 can achieve is usually not considered especially easy.",
                                            "score": 28,
                                            "author": "3f78h87",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Why are you surprised that he claims to be in the 4% bracket? That isn't rare. Like you said, if 25 people in his age range were reading your comment, on average 1 of them would be able to make that same claim.",
                                                    "score": 10,
                                                    "author": "eman88"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Lol why do you \"highly doubt\" someone has a net worth of $1.2 million in their late 30s? I'm not in my late 30s, but my net worth is $375k higher than it was in 2013, so I've got 10 years to do that 2 more times -- with increasing income and an increasing asset base.",
                                                    "score": 4,
                                                    "author": "hydrocyanide",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "1.2 mill is pretty damn good. I started investing at age 24 once i got full time job but my dad basically said \"we are opening a schwab acct and i'm giving you 2,000 to start with\". He never said, 'hey son live cheap and save 25% of your income for a few years'. I wish i was more knowledgable about investing when i started! Granted i'm still in a decent spot but i'm likely to hit the 1m mark in my 40s not 30s.",
                                                            "score": 3,
                                                            "author": "JimBoonie69"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I used to be past that mark a few months ago, actually. But most of it in investments, so I dropped below it during the stock market correction",
                                                    "score": -2,
                                                    "author": "iopq",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Did you earn those 1.2mm yourself or obtained them through other means?\n\n",
                                                            "score": 5,
                                                            "author": "SetsunaFF",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Invested amazingly during a protracted bull market. I started to have significant income after the financial crisis was over.",
                                                                    "score": 5,
                                                                    "author": "iopq"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 32,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You are correct, jesus the people in this sub are out of touch ",
                                                    "score": 8,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt; Top 10% is not very hard to break into, as far as I can remember\n\nBy definition, the top 10% is difficult to break into else it wouldn't be the top 10%.",
                            "score": 4,
                            "author": "Thunderkleize",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I believe from what I'm reading the top 10% net worth is about a millionaire. I think that's pretty hard to achieve.",
                            "score": 3,
                            "author": "_atwork",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I had about a million, but after the stock market correction I have less. So maybe I dropped out of the top ten because of that",
                                    "score": 1,
                                    "author": "iopq",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "cool story brah, if you're in the 10% there's like 360 million other people below you.",
                                            "score": 3,
                                            "author": "shadowbannedlol",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "More like seven billion, but whatever",
                                                    "score": 4,
                                                    "author": "iopq"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Mutual funds have been around for many years.  Are ETF's really that much more popular mutual funds? ",
            "score": 7,
            "author": "Alzaraz",
            "replies": [
                {
                    "level": 1,
                    "comment": "Now both are around. \n\nDun dun dunnn ",
                    "score": 3,
                    "author": "BlueOrcaJupiter",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I get that but the etf is an alternative to the mutual fund",
                            "score": 1,
                            "author": "Alzaraz"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I get that the \"DAE INDEX FUND BUBBLE?\" thing is a /r/investing meme/circlejerk at this point, but is anyone actually reading the article? Index investing is primarily done by retail investors, which is why its only 17% of the market. Thats nothing. It is a non-issue until index investing is large enough to matter - which will never occur because institutional money will by and large always be actively managed. ",
            "score": 35,
            "author": "thejourney2016",
            "replies": [
                {
                    "level": 1,
                    "comment": "I believe what you were saying. Do you know of any source that would be a discussion of this? Is there any advantage for institutions to have their funds  actively managed?",
                    "score": 2,
                    "author": "ScarlettPuppy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If the market is wrong, then that creates opportunity for active managers to take advantage of the mispricing.\n\nBut active management is labor intensive and expensive, so only the good ones will succeed. The bad ones will die out.\n\nThis is just another example of technology and automation weeding out the weaklings. The active management business was overly bloated in my opinion. This shift is overdue.",
            "score": 52,
            "author": "tee2green",
            "replies": [
                {
                    "level": 1,
                    "comment": "The article is more about the voting power consolidation",
                    "score": 24,
                    "author": "ahjotina"
                },
                {
                    "level": 1,
                    "comment": "The lucky ones succeed.  Get a bunch of money and then tank during reversion to the mean.  This is been happening for 100 years since the advent of mutual funds.",
                    "score": 10,
                    "author": "whoomprat"
                }
            ]
        },
        {
            "level": 0,
            "comment": "They should have to allocate the share voting to the people investing in their fund.",
            "score": 5,
            "author": "bababouie",
            "replies": [
                {
                    "level": 1,
                    "comment": "This.  There's absolutely no reason they should get to vote the shares held with other people's money.",
                    "score": 5,
                    "author": "DemandMeNothing"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Assuming a trend will continue ad infinitum is not sound logic.  The bigger the indexing fad gets the less effective it will be as it creates inefficiencies for active managers to exploit.",
            "score": 21,
            "author": "Qumbo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, but then you still need other active investors to eventually realize the value you found early, otherwise. If, in the extreme, you are the only one left not in an index fund, the prices will never change for you. You could get some great dividends though.",
                    "score": 11,
                    "author": "CromulentDucky",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The market is a voting machine in the short-term and a weighing machine in the long-term.",
                            "score": 6,
                            "author": "Qumbo"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I would love to see some attempts to quantify the relationship.  I wonder if theoretical finance has figured out some kind of equilibrium on this.",
                    "score": 2,
                    "author": "reed_wright",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Does the prevalence of index funds imply that within the S&amp;P500 the good companies are undervalued and the bad companies are overvalued? Given all companies are indiscriminately bought or sold within index funds does it create opportunities for stock picking? ",
            "score": 4,
            "author": "m4329b",
            "replies": [
                {
                    "level": 1,
                    "comment": "Provided the remaining active investors keep the prices correct, then no. But the more index funds dominate, the more there can be inefficiencies as you described.",
                    "score": 4,
                    "author": "CromulentDucky",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The more index funds dominate the more you’ll see All Up or All Down days for the stock market. You’ll be yelling why is this stick going down? But it’ll all be because it’s part of the index and it’s a\nDown Day.",
                            "score": 1,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sounds like a challenge to me ehh r/wallstreetbets ",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Howard Marks mused on this subject, and expressed some similar concerns, in a recent memo. Well worth reading:\n\nhttps://www.oaktreecapital.com/docs/default-source/memos/investing-without-people.pdf\n\nThe nut of the article, in my view, is this: if active investors are effectively setting price, then widespread active investing is what makes it impossible for active investors, on average net of fees, to beat the market, which is the justification for passive (index and otherwise) funds. But if the the proportion of active investors trading stocks is displaced by passive funds, will that displacement reach a point at which active investing once again becomes profitable?\n\nI believe the answer must be yes. With enough passive investing, at some point, the dollars being invested actively become too small to materially change the price of a security. This will create opportunities (including potential arbitrage) for active investors, some of whom will succeed. Money will aggregate or flow to those active managers until, on balance, the fees charged equal the profits being reaped. ",
            "score": 5,
            "author": "mortymotron",
            "replies": [
                {
                    "level": 1,
                    "comment": "I believe the answer is yes, also.\nHowever the question remains what portion of the market needs to be passive for this to happen. My instinct is that this point is somewhere between 80% and 99.9%.",
                    "score": 3,
                    "author": "unique_usemame"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Big difference between a bunch of funds holding a bunch of stocks and ONE fund owning a bunch of stocks. I could go on and on but will spare everyone...",
            "score": 2,
            "author": "JustOneOtherSchlub"
        },
        {
            "level": 0,
            "comment": "I worked for his company and he still comes into the lunch area and sits there, met him a few times- really nice guy ",
            "score": 4,
            "author": "hmmm215"
        },
        {
            "level": 0,
            "comment": "It's also a massive problem if an abnormal selloff is triggered. ETF's dumping shares based on algorithms would be insane. Even JP Morgan Chase is predicting that the next crisis will occur because of passive funds.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/astuff] [The father of the index fund says it’s probably only a matter of time before they own half of all U.S. stocks; ‘I do not believe that such concentration would serve the national interest’](https://www.reddit.com/r/Astuff/comments/a1nxe3/the_father_of_the_index_fund_says_its_probably/)\n\n- [/r/concentrationofwealth] [The father of the index fund says it’s probably only a matter of time before they own half of all U.S. stocks; ‘I do not believe that such concentration would serve the national interest’](https://www.reddit.com/r/ConcentrationOfWealth/comments/a1p1x6/the_father_of_the_index_fund_says_its_probably/)\n\n- [/r/st34lposts] [The father of the index fund says it’s probably only a matter of time before they own half of all U.S. stocks; ‘I do not believe that such concentration would serve the national interest’](https://www.reddit.com/r/ST34Lposts/comments/bsozat/the_father_of_the_index_fund_says_its_probably/)\n\n&amp;nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*",
            "score": 1,
            "author": "TotesMessenger"
        },
        {
            "level": 0,
            "comment": "scumbag capitalists ",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Did anyone else thought this the r/WallStreet ",
            "score": 1,
            "author": "-TORERO-"
        },
        {
            "level": 0,
            "comment": "*probably*",
            "score": 1,
            "author": "luigis-"
        },
        {
            "level": 0,
            "comment": "He looks well",
            "score": 1,
            "author": "Data_Or_Else"
        },
        {
            "level": 0,
            "comment": "There's a point where indexing become pathological.\n\nRecommended read: The End of Indexing by Niels Jensen",
            "score": 1,
            "author": "NoReallyFuckReddit"
        },
        {
            "level": 0,
            "comment": "Honest question:  Is this how the BoJ ended up owning more than 51% of the stocks listed on the Japanese exchange(s)?",
            "score": 1,
            "author": "NoReallyFuckReddit"
        },
        {
            "level": 0,
            "comment": "Apart from this particular issue, do you think that a rise in index funds and passive investments will mean thatactively managed funds will have a bigger chance to beat the market? If index funds buy and hold then there are less market participants who look for discrepancies or arbitrage or whatever you want to call it.",
            "score": 1,
            "author": "matthewheat",
            "replies": []
        }
    ]
}