{
    "id": "axmp9i",
    "score": 3361,
    "title": "JPMorgan is stopping financing of private prisons and detention centers",
    "author": "CopticDuck",
    "date": 1551801645.0,
    "url": "https://www.reddit.com/r/investing/comments/axmp9i",
    "media_urls": [],
    "other_urls": [
        "https://www.reuters.com/article/us-jp-morgan-prisons/jpmorgan-backs-away-from-private-prison-finance-idUSKCN1QM1LE](https://www.reuters.com/article/us-jp-morgan-prisons/jpmorgan-backs-away-from-private-prison-finance-idUSKCN1QM1LE)"
    ],
    "postText": "A company spokesperson stated that the decision is a result of the bank's ongoing evaluations of the costs and benefits of serving different industries. This decision follows a statement from Wells Fargo last year that WFC had begun limiting credit exposure to the private prison industry and had ceased actively marketing to that sector. \n\n&amp;#x200B;\n\nUS banks in 2018, including Bank of America and Wells Fargo, raised approximately 1.8 billion in debt for 3 deals for GEO Group and CoreCivic; 2 major private prison operators.\n\n&amp;#x200B;\n\n[https://www.reuters.com/article/us-jp-morgan-prisons/jpmorgan-backs-away-from-private-prison-finance-idUSKCN1QM1LE](https://www.reuters.com/article/us-jp-morgan-prisons/jpmorgan-backs-away-from-private-prison-finance-idUSKCN1QM1LE)",
    "comments": [
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 793,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "100%. Banks actually are quite sensitive to headline risk and take it seriously. I used to work at a bank that lent money to GEO and they made the decision to exit that space like 6 years ago because they didn't want to be associated with the negative headlines. Other banks viewed the space differently and continued lending, but as headline risk ebbs and flows over time the calculus changes on whether or not these loans are worth making to the broader institution. Guess JPM finally felt it was time to call it quits.\n\nI don't know if it will make a big impact though. GEO &amp; CoreCivic are both heavy issuers of bonds and/or leverage loans. The institutional market generally isn't as worry about headline risk as banks. If GEO / Core can't get a deal done with their banks they'll just shift more debt from the bank market to the institutional markets. ",
                    "score": 169,
                    "author": "Ry-Fi",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 28,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 8,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "for sure, but those MM's have smaller balance sheets themselves and would be rounding up a different syndicate. and the company might have to offer better (or to them, worse) pricing to get commitments. getting locked out of the best tier of the debt capital markets sucks.",
                                            "score": 9,
                                            "author": "ticklishmusic"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt; Banks actually are quite sensitive to headline risk and take it seriously.\n\nThey're sensitive to headline risk because they'd prefer the spotlight and the attention of the masses to be elsewhere. If they bring too much negative attention to themselves before they know it populist politicians will be suggesting increased regulation/oversight etc, which is often 'bad for business'",
                            "score": 13,
                            "author": "slightlyintoout"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Not only do they gain positive PR, they also avoid negative PR = 2x net gain",
                    "score": 7,
                    "author": "yeezybillions"
                },
                {
                    "level": 1,
                    "comment": "They want to be the first major bank to jump on the woke marketing train.",
                    "score": 22,
                    "author": "mn_sunny",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Internally (and maybe externally idk) they already market themselves as a hip tech-company like Google or Amazon.",
                            "score": 24,
                            "author": "IWinLewsTherin",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I've seen this marketing. Chase is trying real hard to \"Hey fellow kids\" millenials. And I think it's actually working.\n\nFor people who have resources I think chase is a great bank. Chase's You Invest is free trades  with $75k of balance plus you get tons of checking account benefits. I think it's a matter of time before they lower the bar from $75k for free trades.\n\nI think the sapphire reserve is the most common credit card I see nowadays. Of course they're still trying to hit the \"mass affluent\" crowd, not ramen millenials. But despite the news there are tons of well off millenials out there. ",
                                    "score": 5,
                                    "author": "awoeoc"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 21,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 38,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;I didn't say it was a bad thing, I'm just calling a spade a spade.\n&gt;\n&gt;The inference of the headline was that the decision was driven by ethical considerations. Reading between the lines I think it's far more likely that it was a financial decision, the ethical PR spin is just a bonus.\n\nI'd argue that they are not mutually exclusive.\n\n The bank sees public opinion turning against for-profit  prisons.They look at the moral mutual funds and pension funds that have divested from \"immoral industries\" (like weapon manufacturers, fossil fuels and defense) and fear that private prisons will find themselves on the black list. They made the financial decision that distancing themselves from private prisons will increase their future returns. \n\n Instead of being associated with private prisons, and losing potential revenue, they decided to publically announce that they no longer have any future dealings with the industry. \n\nThis is one of the features of capitalism... \n\nEdit: Deleted the last sentence because it was needlessly political. ",
                                    "score": 8,
                                    "author": "ApoIIoCreed",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You're still circling back to JPMorgan making the decision based on financial consideration rather than moral grounds. It just so happens that their decision is also moral.",
                                            "score": 7,
                                            "author": "plaregold"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You mean they don't see many opportunities AND they get PR",
                    "score": 1,
                    "author": "Jive_Sloth"
                },
                {
                    "level": 1,
                    "comment": "Can a bank just choose not to service an entity bc their field?\n\nLike can I say I'm no longer accepting business from plumbers?",
                    "score": 1,
                    "author": "BuffJesus86"
                },
                {
                    "level": 1,
                    "comment": "Their paid employees in congress probably let them know of impeding changes to regulation. JP Morgan would argue that if you let them know first and adjust investment then there would be less of an economic hit caused by the new legislation.",
                    "score": 0,
                    "author": "Rumblestillskin"
                },
                {
                    "level": 1,
                    "comment": "No one said they were doing this to be the \"good guys.\" Who cares",
                    "score": 0,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Good. Holding people in jails should never be a for profit business.",
            "score": 204,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I generally try to give the “free market/for profit” people my attention when they want to argue for it.  I’m a good little liberal, but I’m more than willing to hear someone else’s argument.  I get it for things like the postal service, some parts of education, so on.  But not for holding people and using them as little more than cheap labor.  That’s just intrinsically wrong to me.",
                    "score": 80,
                    "author": "CrymsonStarite",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Generally someone arguing in favor of private prisons on a free market basis is also going to be against most civil fines and drug charges. The need for private prisons largely dies with a true free market.",
                            "score": 12,
                            "author": "WizardOfIF",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; with a true free market\n\nBut nobody's for a \"true free market\". Not even the libertarians. They just want regulations on certain things and not on others, just like everybody else. The past 2 years are pretty good proof of this now that everybody is clamoring for a \"fair market\" and not a \"free market\". ",
                                    "score": 24,
                                    "author": "DavidsWorkAccount",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "People who are calling for a free market just want a different market, where they can profit the most. ",
                                            "score": 13,
                                            "author": "Tap_Z_or_R_Twice",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Not true, I’ve talked to many economics professors who advocate for laissez-faire markets on the basis of actual research and not just because they would make more money shilling for less restriction. ",
                                                    "score": 8,
                                                    "author": "TheWolfOfBallSweat"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Then you and I have met some very different free market people...",
                                    "score": 4,
                                    "author": "CrymsonStarite"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Then maybe we should remove mandatory minimum sentencing and other common problems that keep people in jails for longer, rather than focus only on taxpayer relief.  Solve the problem rather than kicking the can down the road hoping someone else will take up the mantle.",
                                    "score": 16,
                                    "author": "CrymsonStarite"
                                },
                                {
                                    "level": 3,
                                    "comment": "Eh, it doesn't necessarily relieve the tax payer shifting a prisoner from a federally run prison to a private prison given the BoP and states still pay GEO and CoreCivic to house their inmates and manage the prisons. After all, ICE, the BoP, and various states are GEO's and CoreCivic's customers. It's just an outsourced arrangement. GEO and CoreCivic will defend their position by claiming they do offer the same detention services at a lower price, but studies have shown this doesn't always apply consistently across states and cases. While you are right in some cases private prisons do save the government money, the bigger value GEO and CoreCivic provide is really in their ability to provide beds / capacity to states and the federal government rapidly and / or that are built to spec.\n\nYou can see this in GEO's most recent earnings call transcript. The State of Idaho recently signed an emergency contract with GEO for the housing of approximately 700 medium-security inmates at GEO's Eagle Pass facility because Idaho didn't have enough space for them in their existing state fun facilities. This GEO facility was previously idle and represented open capacity available to Idaho immediately. Similarly, GEO completed the construction of a new facility for ICE recently that provides 1,000 new beds (Congress has been increasing the amount of beds assigned to ICE recently), and the same facility was built to also withstand a Category 5 hurricane, provides office space for 170 ICE staff and can serve as an emergency command center. This facility checks two boxes for ICE as providing them the beds they need while also being built to spec for a secondary mission as an emergency command center.\n\nIdaho and ICE could have theoretically do it all themselves, but it's often easier to outsource it to specialists. ",
                                    "score": 7,
                                    "author": "Ry-Fi"
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt; keep everyone it federal prisons.\n\nMaybe that is your problem?",
                                    "score": 5,
                                    "author": "klatez"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 24,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 11,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Multiple times. The prison system in America is 100% fucked and needs to be rebuilt from the ground up. ",
                                    "score": 2,
                                    "author": "lazerflipper"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's a little more complex than that. Many states turn to private prisons because they need beds within a short period of time and don't have the resources to fund the construction / update of their own prisons. Private companies can fill that void and build incremental beds rapidly and often at more affordable prices because they have existing idle facilities. The reality is these private prisons largely provide services that fulfill BoP and ICE mandates. These mandates are established by the government itself, so the government itself has  always struck me as a better place to being trying to solve the problem of private prisons rather than going after lenders. If private prisons are shuttered overnight most states simply don't have the capacity to take the influx of prisoners. The lack of beds at govt owned facilities continues to be the engine that drives growth at GEO and CoreCivic. The situation is only expected to get worse as time goes on as existing govt owned facilities continue to age and approach their useful life. Remember that NY prison that made news recently because of no heat and water during Christmas? That was govt owned and run and reflective of the aging facilities in many states that don't have the resources to provide massive upgrades / build new facilities.\n\nGranted, private prisons aren't perfect and like any industry lobby for their interests, which opens the door for perverse incentives to exist, but that isn't unique to private prisons as it exists with all industries who are able to lobby the government and influence policy to their benefit.",
                    "score": 21,
                    "author": "Ry-Fi",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; isn't unique to private prisons as it exists with all industries who are able to lobby the government and influence policy to their benefit.\n\nTrue enough, but the policies they encourage, directly or indirectly, are egregious. And I am pretty sure the lower cost-per-prisoner is more than made up by the increased rate of incarceration they encourage.",
                            "score": 16,
                            "author": "Bohnanza",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "For sure, but again, that doesn't mean a private prison doesn't serve a legitimate purpose. It just means our campaign finance / lobbying rules are screwed up. Just as a private prison company can lobby unjustly for tighter drug sentences, so too can an energy company lobby for looser environmental regulations. Shutting down the prison company as a result doesn't strike me as equitable, nor does it really solve that issue specifically. Plus, if you shut down the private prisons we're still in the same position where we need to figure out where to put all the prisoners once the private prisons are shuttered and the various states and federal facilities don't have capacity to take them. It also kind of ignores the fact these organizations have been building additional capacity in order to satisfy evolving ICE mandates and new BoP procurements (CAR 19) that again originate with the government itself due to an intrinsic lack of beds owned by the government relative to the prison population. Heck, Idaho just had to sign an emergency contract with GEO because they needed beds for prisoners and didn't have enough themselves so had to outsource.\n\nPut differently, I don't view wanting to eliminate the war on drugs, enacting prison reform, addressing mass incarceration, and limiting lobbying efforts as necessarily mutually exclusive to understanding the value some private prisons provide. Likewise, understanding the benefits private prisons provide doesn't mean they are wonder organizations without need of reform, monitoring, and regulation. Just kindly pointing out there is some nuance to the issue beyond a small cabal of folks immorally ripping huge profits off prisoners.",
                                    "score": 8,
                                    "author": "Ry-Fi",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;  It also kind of ignores the fact these organizations have been building additional capacity in order to satisfy evolving ICE mandates and new BoP procurements (CAR 19) that again originate with the government itself \n\nNot sure what to say about ICE, and not even sure what you mean by \"BoP procurements\", but to say that the increase in the prisoner population is due to to \"government itself\" ignores your own admission that these companies lobby extensively for long sentences and more laws. They skirt the 13th amendment through the clause \"...except as a punishment for crime whereof the party shall have been duly convicted...\" and yet they help determine what constitutes a crime and a proper conviction.\n\n",
                                            "score": 3,
                                            "author": "Bohnanza",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "CAR 19 represents the BoP's current procurement effort. Basically they are going out to the market and saying \"hey we need XYZ number of beds, please send us your bids and we will decide which bid makes the most sense for us and award these beds via contracts as appropriate\".\n\nSo it's the government going out and demanding beds based on budgets established by Congress and mandates / policy objectives set by the Department of Justice. \n\nTotally agree about the perverse incentives that exist, but again, that applies to every industry. Whacking the private prison industry with some frontier justice while allowing all other industries to continue lobbying for their own benefit under the same perverse set of incentives doesn't really make sense to me -- I'd much rather the lobbying issue be fixed across the board as it fixes a widespread societal issue equitably rather than playing favorites industry by industry. Furthermore, I'm not so sure eliminating private prisons will necessarily usher in a new era of prison reform in of itself, particularly because 1) private prisons primarily house ICE detainees whom aren't drug offenders which is the big prison reform issue, 2) drug reform has been occurring across the US despite the rise of private prisons, and 3) because the total number of adults incarcerated in state and federal custody has been declining despite the financial rise of private prisons: https://www.bjs.gov/content/pub/pdf/cpus16.pdf &amp; http://www.pewresearch.org/fact-tank/2018/05/02/americas-incarceration-rate-is-at-a-two-decade-low/\n\nI can understand why people include private prisons in their reform visions, and to be frank maybe that's a fair policy approach because even a small improvement might be beneficial to society -- I'm not nieve to think private prisons can do no wrong and am certainly not trying to communicate that -- but to that same end I don't see why one can't be *pro* prison &amp; mandatory sentencing reform while still utilizing private prisons supply necessary capacity to the government.\n\nI'm not trying to die on a hill for private prisons, at the end of the day I don't really care, I guess I just don't see it all as mutually exclusive. ",
                                                    "score": 1,
                                                    "author": "Ry-Fi"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The problem is even bigger than that.  The court systems are under staffed and overloaded with cases.  So you often get overworked public defenders pushing plea deals on people who might ordinarily get off in a trial.  ",
                            "score": 2,
                            "author": "unclefire"
                        },
                        {
                            "level": 2,
                            "comment": "&gt;  but that isn't unique to private prisons as it exists with all  industries who are able to lobby the government and influence policy to  their benefit. \n\nThe problem with private prisons is that even if they'd do much better than the average private business venture, you'd expect 30% of them fail within the first 3 years (the general business failure rate is about 50% within 3 years).  Unlike other ventures, government cannot allow prisons to simply fail so they prop them up, cave to their exorbitant demands etc. Other countries keep the prison operation largerly under direct government control only outsourcing things that are easily replaceable to private businesses (food, clothing, repairs  etc). These seem to have better results than US private prisons in terms of costs, repeat offenses, injury rates etc.",
                            "score": 1,
                            "author": "stenlis",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Eh -- it's a government services business. This industry typically runs on fixed price or reimbursable contracts which makes it easy to see your future revenue and plan expenses around it. This is true for companies like Leidos, Booz Allen, KBRWyle, Perspecta, all the way across the govt services spectrum to GEO and CoreCivic. There's no conspiracy or conflict there, it's just the way contracts are structured, and as a result operators in this space generally have fantastic visibility into their cash flows -- so I think you might be overthinking that component of it. \n\nAnd look, I'm not defending private prisons as the end all, dream solution. Just pointing out in this thread that we currently lack significant beds at the government level, and abolishing private prisons does nothing to solve our supply-demand imbalance. While Congress could allocate incremental funds to the DOJ/BoP, many states simply don't have the resources to rapidly fill the void in the number of beds that eliminating private prisons would create. That's really the first step we need to address before we can rationally debate the moral and economic role private prisons should or could play in our society.",
                                    "score": 1,
                                    "author": "Ry-Fi"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Would subsidies (similar to fairy farms) help deal with some of the issues? I agree that private prisons as they are now are pretty bad. The fact that they make more money by filling beds is a clear conflict. So If they got a standard pay or some sort of empty bed subsidy would that help?",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I honestly don't know -- I am not nessisarily an expert on the space, I just covered GEO when I worked at my previous employer and now I work on a trading desk where we track the space. To that end I'm aware of the financial dealings primarily of GEO, thus understand the basic premise of what drives their business and what they suggest their value add is. But beyond that I'm not a political scientist or sociologist qualified to opine on the best way to reform our prisons. \n\nOne thing to clarify though just to be clear, is that GEO and CoreCivic don't sentence people themselves, the court's obviously handle that. They just take inmate flow as it comes, so the conflict of interest isn't exactly direct. Furthermore, both company's biggest customer is ICE which typically involves temporarily housing inmates who have been captured, who need to processed, and then are released back into the general population for a court date on a later date.\n\nThe issue arises when companies are able to lobby the government -- naturally the door is open for someone like GEO or CoreCivic to support the campaigns of those who support significantly harsher sentencing as a means of boosting their own financial profile. I am sure this occurs and that certainly represents an indirect conflict that we should seek to solve from a societal perspective. That said, the data shows prison populations have been declining over the past handful of years despite the rise of private prisons, so I'm not so sure that direct conflict is as strong as many purport. ",
                                    "score": 2,
                                    "author": "Ry-Fi"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They're not doing it out of the kindness of their hearts. They know there'll be legislation against private prisons soon once a Democrat is elected as president. It's just not profitable for them to stay in a dying business. They'd invest in eating babies if that was profitable. ",
                    "score": 2,
                    "author": "mooncow-pie"
                },
                {
                    "level": 1,
                    "comment": "I recall an ex-convict doing an AMA here on reddit saying that he actually did like the private prisons better (had done time in both private and federal prisons). He said the thing he didn't like was getting charged for phone calls etc and other nickel and dime stuff but that overall the place was cleaner and better run. I know that goes against the reddit narrative that private prisons = bad but it is probably accurate. \n\nNow if the for profit part becomes an incentive to lock people up then there really is a problem. I know that at least one judge was caught doing something like that in Pennsylvania (getting kickbacks) but I don't know if it is really a widespread issue. ",
                    "score": 3,
                    "author": "RedditConsciousness",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The scarier thing isn't even bribing judges, it's lobbying to legislators to increase jail times.",
                            "score": 1,
                            "author": "butt_shrecker"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "As someone in the UK that is something I have never understood, you are just opening yourself up for abuse.\n\nNo matter the reasons this is a step in the right direction!\n\nThis reminds me when there was a report that said climate change isn't as bad as we thought, and the response was \"what if we did all this great work moving to renewable energy for nothing\" always put a smile on my face.",
                    "score": 1,
                    "author": "EMGreenfield"
                },
                {
                    "level": 1,
                    "comment": "Agreed, whenever you read a guy defending private prisons you should be suspicious of his motives. ",
                    "score": 1,
                    "author": "oarabbus"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Legalization of cannabis at the federal level must be coming soon...  Pull the money out before the prisons empty out.",
            "score": 44,
            "author": "kickercvr_01",
            "replies": [
                {
                    "level": 1,
                    "comment": "San Francisco recently expunged thousands of marijuana convictions after it became legal in California — I can't imagine this happening at the federal level (though I really believe it should).",
                    "score": 1,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 3,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Which is a great thing ",
                            "score": 5,
                            "author": "Kumbackkid"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Can't get a strike if weed is legal and not a felony like in some states. Even for just a joint",
                    "score": 1,
                    "author": "snoogins355"
                },
                {
                    "level": 1,
                    "comment": "The proportion of people in prison for cannabis possesion/distribution/etc is tiny",
                    "score": 1,
                    "author": "NuffNuffNuff"
                }
            ]
        },
        {
            "level": 0,
            "comment": "They see that writing is on the walls, politically, and are taking action now to try to get PR points",
            "score": 13,
            "author": "alucarddrol"
        },
        {
            "level": 0,
            "comment": "I would guess the private prison industry has resulted in a net negative contribution to US economics(taking people out of the workforce, huge costs from taxes),  good.\n\nAnd I'm not even talking about morality.\n\nShareholders usually only seem to care about relative performance even the actions leading to better relative performance would lead to a worse systemic performance (game theory, etc).",
            "score": 20,
            "author": "IIoWoII",
            "replies": [
                {
                    "level": 1,
                    "comment": "How is that different from regular prisons?",
                    "score": 8,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There's no direct financial incentive for regular prisons to get more prisoners. \n\nCompared to companies that would directly profit from it.\n\nAlso easier for large companies to influence politics.",
                            "score": 33,
                            "author": "IIoWoII",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There's also no incentive for them to provide improved facilities. At least with GEO and CoreCivic some degree of competition exists. Contracts to manage these prisons private prisons come up for rebid once the expire and obviously the company's track record while running the prison has a direct impact in how likely they are to win a recompete. For prisons they own, the BoP puts out regular procurements for beds to outsource the prisoner census and again track record matters. Federal and ICE facilities only have the resources provided to them by Congressional budgets, and for a lot of state facilities there is no funding or seriously constrained funding to provide improvements or new facilities. You may recall over Christmas a prison in NY made headlines because it had no heat and water during freezing temperatures. That was a federally run prison.....sure there exists no profit motive, but yet it still resulted in horrid conditions, so to some extent eliminating the profit incentive doesn't guarantee anything is fixed.",
                                    "score": 4,
                                    "author": "Ry-Fi",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt; There's also no incentive for them to provide improved facilities.\n\nNeither is there for GEO and CoreCivic. Only to become more profitable. If it's cheaper to lobby for more or larger contracts(through harsher laws, less regulation, or just [simply paying off judges](https://en.wikipedia.org/wiki/Kids_for_cash_scandal)) then they will. \n\nhttps://www.businessinsider.com/report-finds-that-private-prisons-are-more-dangerous-than-public-ones-2016-8?international=true&amp;r=US&amp;IR=T\n\nhttps://www.npr.org/2016/08/25/491340335/investigation-into-private-prisons-reveals-crowding-under-staffing-and-inmate-de?t=1551812920348",
                                            "score": 17,
                                            "author": "IIoWoII",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Totally hear you, my friend. My point was just showing that neither system necessarily results in a perfect prison. The answer to running better prisons likely lies in some combination of improved regulation, oversight, and funding. Making everything private or everything publicly funded and operated won't guarantee all the problems are magically fixed as both systems have resulted in their own share of scandals. A good prison system can exist with private operation of the prisons as well as public, as can a twisted one.\n\nTo reiterate, the private prison system exists because government run facilities don't have enough capacity to fulfill their current needs. As a result, they turn to private prisons. If we eliminate private prisons on account of them not being safe, we have no where to put the prisoners they are holding and only exacerbate the lack of beds issue at govt run facilities. So to that end it doesn't solve the current problem. As a result, I totally agree that improvements can be made and probably SHOULD be made at private prisons to make them safer and better -- but that view doesn't need to exist mutually exclusive of the existence of private prisons.",
                                                    "score": 3,
                                                    "author": "Ry-Fi"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "**Kids for cash scandal**\n\nThe \"kids for cash\" scandal centered on judicial kickbacks to two judges at the Luzerne County Court of Common Pleas in Wilkes-Barre, Pennsylvania. In 2008, judges Michael Conahan and Mark Ciavarella were accused of accepting money in return for imposing harsh adjudications on juveniles to increase occupancy at for-profit detention centers.Ciavarella disposed thousands of children to extended stays in youth centers for offenses as trivial as mocking an assistant principal on Myspace or trespassing in a vacant building. After a judge rejected an initial plea agreement in 2009, a federal grand jury returned a 48-count indictment. In 2010, Conahan pleaded guilty to one count of racketeering conspiracy and was sentenced to 17.5 years in federal prison.\n\n***\n\n^[ [^PM](https://www.reddit.com/message/compose?to=kittens_from_space) ^| [^Exclude ^me](https://reddit.com/message/compose?to=WikiTextBot&amp;message=Excludeme&amp;subject=Excludeme) ^| [^Exclude ^from ^subreddit](https://np.reddit.com/r/investing/about/banned) ^| [^FAQ ^/ ^Information](https://np.reddit.com/r/WikiTextBot/wiki/index) ^| [^Source](https://github.com/kittenswolf/WikiTextBot)   ^]\n^Downvote ^to ^remove ^| ^v0.28",
                                                    "score": 4,
                                                    "author": "WikiTextBot"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah. Two judges. And they were caught and punished. Not a compelling reason to abandon private prisons. \n\n",
                                                    "score": 0,
                                                    "author": "RedditConsciousness",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "And the two links aren't a compelling reason?",
                                                            "score": 2,
                                                            "author": "IIoWoII"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "It is illegal to do what you're suggesting. We've seen like one judge get caught getting caught doing that and that is it. ",
                                    "score": 1,
                                    "author": "RedditConsciousness",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt; It is illegal to do what you're suggesting.  \n\nIn this comment I'm suggesting lobbying, which isn't illegal.",
                                            "score": 1,
                                            "author": "IIoWoII"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Prime example - https://en.wikipedia.org/wiki/Kids_for_cash_scandal\n\nNo one is getting rich from government prisons, the perverse incentives aren't there to incarcerate people. ",
                            "score": 6,
                            "author": "DBA_HAH"
                        },
                        {
                            "level": 2,
                            "comment": "Private prisons often have contracts that guarantee a certain level of inmate population and get paid even if those cells are not occupied.  It creates incentives to push plea deals and sentences.   IIRC they also pay guards shit and are often understaffed.  \n\nPrisons should not have a profit motive.  It drives the wrong behaviors.  ",
                            "score": 0,
                            "author": "unclefire",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If they get paid regardless of the prisoner census, then doesn't that diminish the incentive to push mass incarceration and harsh sentences? They're getting paid no matter what to provide capacity.",
                                    "score": 3,
                                    "author": "Ry-Fi",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It’s government that will push for more incarceration bc they’re paying for the beds regardless.  \n\nAnd if they don’t do that the taxpayer is still covering those costs.  ",
                                            "score": 0,
                                            "author": "unclefire",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "But they've also paid for the beds at government owned and operated facilities by definition, again regardless of their utilization. If there isn't a large enough prison census to support procurement of the same number of beds in the future, the government simply scales down their need when the contracts with private prisons expires and needs to be renewed. GEO and CoreCivic have a certain number of contracts up for rebid every year, so it's an ongoing process of balancing government's demand for beds and total supply.\n\nNot to mention the number of people in jail in the US continues to fall despite GEO and CoreCivic being bigger and more prolific than ever, so this assumed direct conflict of interest doesn't really jibe with the data.\n\nI don't really follow your point.",
                                                    "score": 4,
                                                    "author": "Ry-Fi"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "How exactly do they market to this sector?",
            "score": 14,
            "author": "whochoosessquirtle",
            "replies": [
                {
                    "level": 1,
                    "comment": "I would think it's more of a business to business marketing strategy rather than business to consumer. ",
                    "score": 19,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "What do you mean? Banks lend money to corporates all the time of all sorts. Private prison companies need capital to fund ongoing operations and future investments just like anyother. In the past JPM has provided that capital along with other banks, the bond market, equity markets, and institutional investors. JPM is simply announcing they are no longer going to be providing capital to the credit facilities of private prisons. ",
                    "score": 10,
                    "author": "Ry-Fi"
                },
                {
                    "level": 1,
                    "comment": "One tactic is propaganda.",
                    "score": 2,
                    "author": "mooncow-pie"
                },
                {
                    "level": 1,
                    "comment": "Expensive gifts for prison executives.",
                    "score": 2,
                    "author": "partyinplatypus"
                },
                {
                    "level": 1,
                    "comment": "REITs",
                    "score": 0,
                    "author": "BathroomEyes"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is like hearing that Walmart made a pledge to stop molesting children. Yeah it's great that they're stopping that, but I didn't know they were doing that in the first place, and I have a lower opinion of their company because they were doing it at all.",
            "score": 6,
            "author": "ProgrammingPants"
        },
        {
            "level": 0,
            "comment": "Ohhhhhh boy, Bud is going full legal baby 🌲🔥👌🏼",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Their CEO will be running for president. ",
            "score": 2,
            "author": "Aggravating_Plantain"
        },
        {
            "level": 0,
            "comment": "Marijuana prohibition is coming to an end.",
            "score": 1,
            "author": "Biffgasm"
        },
        {
            "level": 0,
            "comment": "There no money in it anymore and they’re going to divest to a different money making venture. Don’t get it twisted they aren’t doing this for righteousness. ",
            "score": 1,
            "author": "Andruboine"
        },
        {
            "level": 0,
            "comment": "I worked for Core Civic for a couple of years, they’re a horrible company.  They’re trying to turn into a REIT, they see the writing on the wall.",
            "score": 1,
            "author": "Pliablemoose"
        },
        {
            "level": 0,
            "comment": "I was looking for some solid REITs and noticed that CXW and GEO had amazing dividend yields. Then I realized what sort of real estate it was investing in. I don’t care what the returns are, I have a soul.",
            "score": 2,
            "author": "BathroomEyes"
        },
        {
            "level": 0,
            "comment": "As they should. ",
            "score": 0,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "We all know they're not doing it out of the kindness of their hearts. They're losing money. ",
                    "score": 7,
                    "author": "mooncow-pie"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Are they going to make an announcement when they get back into this space in a few years?",
            "score": 1,
            "author": "TheSoprano"
        },
        {
            "level": 0,
            "comment": "Thank fucking God. ",
            "score": 0,
            "author": "vivecfaulkner"
        },
        {
            "level": 0,
            "comment": "Fuck, I planned on buying puts on those for the 2020 election.",
            "score": -3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "You think Trump's going to win or something? ",
                    "score": 1,
                    "author": "mooncow-pie",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "To lose.",
                            "score": 1,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 0,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Dr. Trump is just protecting the market. Obummer was really a socialist disguised as a president.",
                    "score": -14,
                    "author": "jonloovox",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "there should not be private prisons, much less a market for them. ",
                            "score": 6,
                            "author": "stealthgerbil"
                        },
                        {
                            "level": 2,
                            "comment": "&gt;unironically saying ‘Obummer’",
                            "score": 1,
                            "author": "CoinDingus"
                        },
                        {
                            "level": 2,
                            "comment": "And Trump isn't even faking the fascism. What a time to be alive.",
                            "score": -3,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Fascism is state control of private industry... you've got it backwards.  Nazis even CALLED themselves national SOCIALISTS.  It was literally the name of the party.",
                                    "score": -6,
                                    "author": "jonloovox",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You're easily confused by names.",
                                            "score": 6,
                                            "author": "tkreidolon",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The Nazis were left-wing socialists. Yes, the National Socialist Workers Party of Germany, otherwise known as the Nazi Party, was indeed socialist and it had a lot in common with the modern left. Hitler preached class warfare, agitating the working class to resist “exploitation” by capitalists , particularly Jewish capitalists, of course. Their programs called for the nationalization of education, health care, transportation, and other major industries. They instituted and vigorously enforced a strict gun control regimen. They encouraged pornography, illegitimacy, and abortion, and they denounced Christians as right-wing fanatics. Yet a popular myth persists that the Nazis themselves were right-wing extremists. This insidious lie biases the entire political landscape today.",
                                                    "score": -4,
                                                    "author": "jonloovox",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "🤦‍♂️\n\nHot take considering socialists were amongst the first against the wall during the night of long knives and then the Nazis banned the social democratic party and sent its leaders to concentration camps.\n\nAddendum: the poster above me just copy and pasted a selection from a right wing blog, more [info](https://www.snopes.com/news/2017/09/05/were-nazis-socialists/)",
                                                            "score": 2,
                                                            "author": "mickeyjawn",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "And you just linked to a left wing website.  So that just about makes us even.",
                                                                    "score": -1,
                                                                    "author": "jonloovox",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Care to extrapolate on why the nazis would prefer extrajuidicial killings of socialists and other leftists if they were also leftists? \n\nAlso, is there any evidence of snopes bias? I cannot find any.\n\nP.s [here’s](https://www.britannica.com/story/were-the-nazis-socialists) another source stating that Nazis were categorically **not** socialist. Is this source satisfactory?",
                                                                            "score": 1,
                                                                            "author": "mickeyjawn",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "There's a Snopes article on both of the issues you raise.",
                                                                                    "score": -1,
                                                                                    "author": "jonloovox",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "You're right, north korea IS democratic! ",
                                            "score": 1,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This decision was based on pr and nothing more. If private prisons shouldn't exist, then public prisons shouldn't exist. If the lever of your moral compass depends on who the owner of the prison is then you need to recalibrate your moral compass. \n\nDo you care who picked your grapes so you can purchase it at your local store? Would you decline to purchase the grapes if it was picked by a brown or black person or white person? \n\nWhat am I getting at? Like it or not someone will violate the laws that are important to a civilized society i.e murder, rape, civil violation etc. That person will need to be detained, removed from society, and if possible rehabilitated.  What? Where? How? When? \n\nRationalizing a public prison over a private prison is just as awful as rationalizing purchasing grapes picked by white person rather than brown person. ",
            "score": 0,
            "author": "buenotc"
        },
        {
            "level": 0,
            "comment": "What is the least “woke” bank out there? Don’t get me wrong. I love to get morality lessons from corporate bankers, but just in case I’d like my bank to STFU and just bank, it’d be nice to know a good boring alternative. ",
            "score": 0,
            "author": "pynoob2"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": -5,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don't think it is a democrat vs republican thing when it comes to prisons and mass incarceration. ",
                    "score": 8,
                    "author": "jwrig",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It kinda is.  Dems are not as supportive of them for many reasons while the GOP continually pushes them with the theory that privatizing stuff is always better.  It isn’t. ",
                            "score": 2,
                            "author": "unclefire",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It kind of isn’t. Bill Clinton, 1994, 3 strikes &amp; 9 Billion in fed dollars tp build more prisons ring a bell at all? Both sides have plenty of ‘blame’.  ",
                                    "score": 3,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yes neither are perfect and get blamed.  But to say both parties are the same isn’t exactly accurate either.   ",
                                            "score": 1,
                                            "author": "unclefire",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You're 100% correct; I'd personally direct the 'blame' to the party responsible for the Law keeping these people imprisoned.  Not the party looking at cheaper options for my tax dollars. ",
                                                    "score": 1,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Nah, not really. It only applied to Department of Justice prisons, which accounted for only 15% of all federal prisoners.  A total of 22 thousand prisoners, 1% of the 2.2 million locked up at the time. The other 85 percent are either in DHS facilities, or other facilities the CIA illegally renditioned.\n\nWhat is rarely pointed out, at the same time ICE had literally three or four days before the announcement awarded then CCA a billion dollar contract to \"detain\" central american immigrants seeking asylum. This contract gave CCA 20 million a month whether or not there was a single immigrant in the facility. The Federal courts ended up ruling the government could not detain immigrants but instead had to house them in the least restrictive manner. That meant we were paying millions a month of tax dollars for empty prisons.\n\n&amp;#x200B;\n\nIf the Obama administration was so against private prisons, why did the executive order only apply to the DoJ and not the other agencies that were totally under his control?\n\n&amp;#x200B;\n\n&amp;#x200B;",
                                    "score": 1,
                                    "author": "jwrig"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Which accounted for only 15% of all private prisons in this country. The Obama administration wasn't a measure of Democrats in this country. ",
                                    "score": -1,
                                    "author": "jwrig"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}