{
    "id": "fp4vxy",
    "score": 3600,
    "title": "My experience of the 2008 bailout",
    "author": "_WhatchaDoin_",
    "date": 1585195448.0,
    "url": "https://www.reddit.com/r/investing/comments/fp4vxy",
    "media_urls": [],
    "other_urls": [],
    "postText": "I wanted to share my experience of the 2008 bailouts because we are among friends. Right? And friends help each others, and share their experiences. Right?\n\n\nDuring the financial crisis of 2008, it became clear that the government had to step in. People were losing their jobs, stock market dropped by more than 30%, the market was going up and down by 5-10% a day (the amount my brokerage accounts would go up or down was more than what I was earning in a month at work). It was humbling.\n\n\nIt was really tough and difficult to trade. Buy on the down days? Sell on the up days? Hold it until sky clears, despite having bled a lot of money already? I was over leveraged too (through LEAP options), which was not the smartest thing to do at the time, but heh, are you going to lock the loss?\n\n\nThen came the bailout, with a lot of volatility leading to it. A lot of back and forth for days for politicians to get a chance to pass it. (They may have failed to pass the first version even, I don't remember).\n\n\nFinally, one of the branch passes it, and it's time for the other branch to pass it. \"About time, after the bailout, things are going to get better, we can save those companies, we can move ahead and blue sky is coming.\"\n\n\nI remember at the time, I was looking at the final votes, and I could not believe it. As the votes would come in, and it became clear that the bailout would pass, S&amp;P futures started to drop, like a stone. WTF!!! Help is coming, everything will get better, why is it dropping?\n\n\nWell, the reason is simple, by signing the bailout, politicians agreed that we were in a shitty situation, companies needed to be saved, and the lousy bailout was getting signed, and there was no more good news down the line for a while. We shot our ammos, and now let's pray. So it became sell the news.\n\n\nAs the market continued dropping days after days, and I was going to be wiped out, I had to sell to not be over leveraged anymore. I had to take a 6 figures loss. And I am fortunate that I sold, because the market continued to significantly tank for almost 6 more months to level I did not think we would reach. After selling, I was not taking as much risk anymore, I got burned hard.\n\n\nAfter we reached the bottom, I switched my positions to risky assets, and I was able to make up some of the losses. But that was a great learning experience, and I figured that I preferred to learn that lesson at the time, when my accounts were not too big than later. Recovering from a 6 figures loss is doable, but more than that, and it is a decade or more of setback.\n\n\nWell, I can say that almost 12 years later (fuck, already!), the situation is very similar.\nThis time, I was ready, and maybe that will be another post to explain what I did in 2019-2020, as it can be easily applied.\n\n\nSo today:\n\n- People were losing their jobs. Check.\n\n- Stock market dropped by more than 30%. Check.\n\n- The market was going up and down by 5-10% a day. Check.\n\n- Bailout in the process, taking days to agree on. Check.\n\n\nI am not saying that the market is going to drop after the bailout is voted, but watch out for that.\nUnlike 2008, there is no blue sky coming. The bailout is only a short term fix. How long do you think $1200 per person is going to last?\n\n\nUnlike 2008, we know that the worst is ahead of us. We still don't know. In the US, the coronavirus pandemic is expected to peak in at least 2-3 weeks. But who knows?\nAs we are doubling every 2-3 days, it could mean 100 times more new cases per day. 100 times more death per day (few weeks later the infection). It's absolutely a staggering and awful number.\nHopefully, lockdown will be enforced in every state, so we can reduce this grow rate.\nHospitals are already over capacity, nobody can tell exactly how this is going to end (except that's going to be a carnage).\nEsp. as some are talking about removing the lockdown in 2 weeks!\nAnd even after the peak, it means that people are still getting sick, people are still dying, as they are hospitalized for 2-4 weeks.\nExpect at least 1-2 months of pain, even after peak.\n\n\nI understand that the market is forward looking, but there are still many opportunities for false head starts, and failed bounces from the bottom.\n\n\nFrom my experience with the 2008 bailout, nobody could really predict the bottom. Even as it was a financial crisis.\nThis time, it is not looking pretty, so please don't be like the 2008-me, don't be over-leveraged (yet), things can go either way. Politicians are very good at messing up a crisis.\n\n\nAnd most of all, be safe and healthy, stay home as much as you can. It is going to be a rough ride, and unfortunately we are only getting started.\nMy sincere thoughts for people with friends and families that are going through hardship, sickness and death.\nHang in there!\n\nEdit: Thank you for the feedback, comments and kind words. Much appreciated. Stay safe!",
    "comments": [
        {
            "level": 0,
            "comment": "**Hi, welcome to /r/investing. Please note that as a topic focused subreddit we have higher posting standards than much of Reddit. If you are new here please take the time to review the rules and take special note of the following standards**\n\n**1) Please direct all advice requests and beginner questions to the stickied daily threads.** If this post is asking for advice or a beginner question it will likely be removed. Additionally if your question is specific to a broker or easily found on google it will likely be removed. Please direct those questions to your broker.\n\n**2) Important: /r/investing operates a zero tolerance policy for violations of our political posting guidelines so please review them [here](https://www.reddit.com/r/investing/comments/cyee69/formal_posting_guidelines_for_political_topics/) and [here](https://www.reddit.com/r/investing/comments/escewo/temporary_rule_change_what_happens_to_stocks_if/). Violations will result in a minimum 30 and likely 60 day ban upon first instance.  Note simply arguing over off topic politics is sufficient to warrant a ban - please review the linked threads before posting as this post serves as your only warning.**\n\n**3) This is an open forum but we expect you to conduct yourself like an adult. Disagree, argue, criticize but do not use personal attacks.**\n\n  I am a bot, this message appears on every post. Please don't yell at me.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/investing) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Well said, thanks for sharing your experiences. Sorry about the loss in 2008 though, that shit is rough. What are your positions right now? Holding strong on long puts? Or just waiting for the drop to buy back in?",
            "score": 582,
            "author": "Its_official_dxs",
            "replies": [
                {
                    "level": 1,
                    "comment": "I still have some vertical puts. I sold some on Monday once I reached 90% of the max profit.\n\nOne of the strategy I used a similar model to the SWAN ETF (I saw them during the 2009 period, they used to be a mutual fund before, now I noticed they have an ETF). If you scrub their white papers, you can figure out their strategy. It only works for brokerage account, unless you buy their ETF directly. Their method significantly underperforms during bull markets though, so I don't advise to do what they do (but buying their ETF for some % might be okay, even better than straight bonds).\n\nOtherwise, I still have bonds and cash ready to rebalance. I bought a bit during the drop, potentially too early, but you can never really time that. :)",
                    "score": 274,
                    "author": "_WhatchaDoin_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My financial advisor reallocated 40% to bonds!! Like an idiot. I’ve made money myself with other iras and I don’t get how these people have jobs.",
                            "score": 136,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They’ll look smart if we drop another 20%.\n\nBut yeah, that’s a pretty reactionary move for an advisor.",
                                    "score": 147,
                                    "author": "sleepwalkermusic",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That’s what I thought. This was last week when they did this haha. I made 85% on Boeing and have long puts on spy just in case. I’m new to all of this but I was in crypto for a long time so I’m ready for another 20%!",
                                            "score": 54,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I've had my finger on the trigger with Boeing - I'm kicking myself for not getting it last week!  I think it is still a good buy to hold on to long term.",
                                                    "score": 9,
                                                    "author": "TrailRunnah",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Dude, the gov is buying INTO boeing on an exchange for grants, the first thing they are gonna do is cut out shareholders when they need to collect.",
                                                            "score": 13,
                                                            "author": "RobotKing666",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "😏",
                                                    "score": 12,
                                                    "author": "notlongnot"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I can beat you there.    We recently inherited a large account and I told them to sell everything in March 1 and send us a check because we wanted to pay off our mortgage.   They told us not to worry because the account was mostly in bonds which would go up if the market continued to drop.   Not only is the account now down 10%, but, it underperformed even the most basic bond ETF or benchmark.   So they had us in really bad (junk like) bond holdings.     My fault I guess for trusting the 'experts'.",
                                    "score": 30,
                                    "author": "Pennysboat",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Refinance your mortgage, no need to pay it off. Use that investment account to buy good stocks that will grow and some dividend stocks.\n\nYou'll be better off since the mortgage rates are so low you are better off just doing a refi, unless you lose your job that is and need to pay the mortgage.",
                                            "score": 19,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Good idea.",
                                                    "score": 3,
                                                    "author": "Pennysboat",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Most financial advisors are absolute  drones, regurgitating shit you can find with a Google search. \"Everything works out in the long term\", \"Don't give in to your emotions, and just hold\"...",
                                    "score": 86,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "*Like I'm not already telling myself those things*",
                                            "score": 6,
                                            "author": "dyfrke"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Sucks. I am doing to other way around.",
                                    "score": 17,
                                    "author": "_WhatchaDoin_"
                                },
                                {
                                    "level": 3,
                                    "comment": "Why/when do they rebalance? Timing luck is real.",
                                    "score": 3,
                                    "author": "SnacksOnSeedCorn",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Not sure where you're located, but in Canada your advisor would need a discretionary license, and you would need to be signed up with a discretionary account, to make that decision without calling you to get your consent.",
                                    "score": 9,
                                    "author": "re_me",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is grade A advice OP. I've literally been saying this the entire time &amp; yet people are still taking the wrong morals/lessons from it.",
                    "score": 29,
                    "author": "jackandjill22",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Can you please elaborate, why buying metals is good, are you referring to gold and silver",
                            "score": 6,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Just gold, silver is mostly for commercial use &amp; isn't a store of value meaning that as businesses stop it's price will drop.",
                                    "score": 8,
                                    "author": "jackandjill22",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "What form does your gold investment take? For compliance reasons I can't own gold ETFs, so I think my only option is physical gold, which obviously has its own complications.",
                                            "score": 5,
                                            "author": "jackson_c_frank",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Totally agree. I'm bearish but 35% net long. I am investing in companies that can survive this, but I have some short S&amp;P positions as a hedge. I know the levels I am going to add risk on and am always looking for good opportunities that should return well regardless of the crisis. \n\nIf we go a lot lower and I see the market recovering, I am probably going to put 10-20% of my portfolio into LEAPS and levered companies to try to catch what will be one of the great rallies of our lifetime.",
            "score": 42,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "If I see a significant drop, and it is just a matter of time for things to get better, I will definitely buy into leveraged tech (like TQQQ) because most of the tech companies can work from home with barely any issue, they are profitable with a lot of cash (even after impact on ads revenue), and will bounce back very quickly as the economy recovers.\n\nNot ready to buy into it yet though. 3x is a triple edge sword. :)",
                    "score": 50,
                    "author": "_WhatchaDoin_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The only problem I see with tech, at least the big names, is they haven't corrected much at all. They are just back to late 2019 early 2020 levels. Consider Microsoft, for example, was at $60 when Trump took office and at $145ish is now just back to where it was in November of last year before the tail end surge. So the upside is incredibly limited at this point. We'd need another 40%-50% drop for me to feel good about getting in, otherwise I think they are still way too expensive.\n\nRegarding the levered ETFs, something to consider is that they try to match the daily percentage returns of the sector or market. Down moves are harder to make up. It takes more upside to offset a similar downside. That's the biggest risk. If you're in a long 3x and the sector drops 17%, for example, you've lost half your money. To get that back the sector would have to rise 33% just for you to break even. These should be treated as short term trading strategies rather than long term investments.",
                            "score": 22,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I felt the same way after observing it only regressed to the 2018 dip",
                                    "score": 9,
                                    "author": "UpOnCloud9"
                                },
                                {
                                    "level": 3,
                                    "comment": "Correct.  No blood in the streets yet.",
                                    "score": 3,
                                    "author": "dontaskme5746"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "So TQQQ is like investing in the top tech companies with 3x exposure!?",
                            "score": 14,
                            "author": "justjosh54",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It is triple NASDAQ  - objective is to perform 3x Nasdaq performance, both up and down. Highly volatile.",
                                    "score": 14,
                                    "author": "[deleted]",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Yup, it can blow in your face easily (i.e. lose most if not all of it).",
                                    "score": 13,
                                    "author": "_WhatchaDoin_",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Wow I’m all in",
                                            "score": 40,
                                            "author": "justjosh54",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "don't buy 3x bull etfs in a bear market, decay will eat your ass",
                                                    "score": 6,
                                                    "author": "bmore_conslutant",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "How long would you hold TQQQ for?  Wouldn't you be dealing with decay over a long enough period of time?",
                                            "score": 13,
                                            "author": "hrpoodersmith",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Decay mostly hurts you on these when the market goes up and down a lot or sideways. If everything's going up and recovering well, you can hold 3x long funds indefinitely. There's some thought that these are great vehicles for under 30yo inverters.\n\nIt's prob too early now, but I'll definitely be buying some of these if we're down another 25%.",
                                                    "score": 17,
                                                    "author": "GodelianKnot",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Can you explain decay? Act like I’m a child plz",
                                                            "score": 15,
                                                            "author": "justjosh54",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "let's say you own qqq\n\ngoes down 10%, then up 10%, you've lost 1% (100%-10%=90%+10% of that is 99%)\n\nif you own tqqq, qqq goes down 10% then up 10% you've lost 9% (100%-30%=70%+30% of that is 91%)\n\nrepeat a bunch of times in a volatile market and your ass has been summarily eaten",
                                                                    "score": 19,
                                                                    "author": "bmore_conslutant",
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Very basically, you are paying a little bit each day to get these 3x returns. So, if the market doesn't go up over time, you're losing money by holding these. \n\nThese funds are just another way to get leverage (ie get more than 1x returns of something). And leverage always costs money over time, no matter how you get it. (Other ways are options, or trading with margin.)",
                                                                    "score": 18,
                                                                    "author": "GodelianKnot",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "ahh I understand thank you! So how are you paying this decay, higher expense ratio or is that another con?",
                                                                            "score": 3,
                                                                            "author": "justjosh54",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "It's just built into these funds. They pay it in the process of trying to get 3x daily returns. And it's passed on to the fund's total returns. Expense ratio is separate and generally has a smaller impact. \n\nIf you look at the combined returns of a +3x and -3x fund on the same index, you'll see the overall cost of holding these.",
                                                                                    "score": 5,
                                                                                    "author": "GodelianKnot",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Caution make sure to look at how much SMB exposure some of these have.  Even SaaS could see some headwinds as companies tighten enterprise spending",
                            "score": 2,
                            "author": "entropyhaus"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Finally a well reasoned well written post of the 2008 crisis.  In 2008 certain countries like Canada weren't exposed to the crash.  This Virus is a world wide pandemic that's never been seen.   The world economy has never been completely shut down before.  This virus could swing back around for a second wave come fall and we haven't even dealt with the first wave.  \n\nI'll be surprised if we've hit bottom.  I'm keeping my powder dry for a few more down turns then I'll DCA from there.  Conflicting statements from leadership and an aggressive FED have increased my FOMO but I'm trying to stay disciplined.",
            "score": 377,
            "author": "backstreets-pizza",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; have increased my FOMO but I'm trying to stay disciplined\n\nWell said! :)",
                    "score": 98,
                    "author": "_WhatchaDoin_",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Canada was definitely affected by the 2008 crash, most countries were.  \nWe might not have been hit as hard because our housing/banking sector was more regulated but it definitely rippled here.  \nUS is our biggest trading partner and a lot of businesses here are American.  \nWe are so intertwined, especially on the border (something like 90% of our population is within 100km of the border), that anything that happens in the US affects us here.",
                    "score": 26,
                    "author": "GWAE_Zodiac",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Bruh same. I’d be up a few thousand % on BA calls if i was confident this bounce would last longer than a few days. Guess i could of been wrong too. Less stress on me just chilling cash. Even if i manage to buy back in at 15% from ATH that’s still a decent play. \n\nWanna Start DCA soon though. XLF looks so tasty",
                    "score": 16,
                    "author": "zachrf1",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I agree with the unique negative characteristic you highlighted about this crash (the fact that it's global).\n\nLet's not forget to consider the unique *positive* characteristics, though.  For example, this crash has been caused by a biological disease, whereas other crashes, like 2008, were caused by severe problems in the financial world.\n\nPerhaps I'm too optimistic, but once we clear up this virus and people go back to work, the markets could rebound faster than previous crashes.  \n\nThat is assuming that this crisis doesn't reveal some significant problems in the financial world, though.",
                    "score": 4,
                    "author": "barnymack"
                },
                {
                    "level": 1,
                    "comment": "Another thing, maybe I'm wrong, but when the stimulus is spent, it feels like \"well, they've just bailed out the country for 2 trillion\" and things go on as normal. The stimulus must lead to cutbacks elsewhere right or tax increases?",
                    "score": 8,
                    "author": "RogerCabot",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not necessarily. They're not reallocating existing money, they're adding new money into the system. In theory, this should devalue the dollar and create inflation.",
                            "score": 25,
                            "author": "jakeblues68",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Which is not fun for a cash emergency fund.",
                                    "score": 6,
                                    "author": "b2717"
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 5,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I agree with everything you wrote. That's why I said \"in theory\". I was planning on expounding on that point further, but I decided to focus more heavily on the bowl of Captain Crunch I was eating.",
                                            "score": 2,
                                            "author": "jakeblues68"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Forgive my ignorance. What DCA and FOMO stands for? Sounds like I need to do more research.",
                    "score": 2,
                    "author": "pro_man",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Dollar cost average\n\nFear of missing out",
                            "score": 4,
                            "author": "satellite779"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Another 2008 survivor here. What I learned is that leverage kills, don’t over leverage and be fine, survive another day. I also got a bit of FOMO with these 2 green days, but pretty sure we are yet to see the bottom. I’ll comfortably hold my assets if they drop more, and happy to take a loss on my puts if this is indeed the bottom. As long as I can sleep well at night, I know I’ll be fine.",
            "score": 228,
            "author": "legatinho",
            "replies": [
                {
                    "level": 1,
                    "comment": "Seriously these past few Green Day’s have me feeling major FOMO. My young investor fingers are trigger happy. I see these green days accompanied with headline after headline of how much worse this could get and refuse to believe the end is near",
                    "score": 40,
                    "author": "thtguyatwork",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Its soo hard though. Seeing Apple go from $217 to over $250 in 3 days is making me feel huge FOMO\n\nI was watching LRI last week, it hit $6. Touched over $20 yesterday. Even PLAY, dave and busters, which is CLOSED is up 250% in a week!!\n\nIt's only been a week, but, almost all single stocks hit a new bottom last week and have done nothing but go up. The market hit all time low on Monday, now we have 3 green days in a row\n\nI feel the FED is pumping the market...this shit makes no sense\n\nWondering if I should just dollar cost average instead of try to time this thing...",
                            "score": 31,
                            "author": "imadummyoptionsyay",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I don't buy the rally. The general public still hasn't grasped the long term economic impacts imo given what the president and right leaning news sources are saying. This is a be a 12 month minimum war against the virus in the best case scenario.",
                                    "score": 23,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I hear you and think I agree. It's just kind of insane to me how much certain things are up. They were way oversold so a correction is logical, but,\n\nJust looked at WYNN, a resort stock, was $35 when we hit the circuit breaker last week, over $80 now. Pays a 6% divedend too. I honestly thought hotel/resorts and casino stocks were doomed. Now I am thinking maybe I should have picked some up, they were at levels as low as the 2008 crisis... Here I am loosing money with put options when I should have been scooping up these stocks that were down 90%\n\n same with the airlines. Can they really fall back as low as they already were? Theres no more bad news that can effect them IMO unless this virus kills way more than expected and they completely shut down airports",
                                            "score": 10,
                                            "author": "imadummyoptionsyay",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "We are gonna have a death toll of 1,000 daily beginning next week in the United States alone.  I fully believe that most of the public has not fully grasped how bad this is going to get when the hospitals become overrun beginning in April.",
                                                    "score": 19,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "NYC hospitals are already starting to max out and people are dying waiting for a bed. The worst is yet to come and when it starts being less statistics and more people personally know, the pandemonium will begin",
                                                            "score": 10,
                                                            "author": "simplysalamander",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Once people see friends/family/coworkers/etc in their social circle get sick and/or die they will start to realise how serious this is and start to panic.",
                                                                    "score": 2,
                                                                    "author": "diskiller"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "There is no way the general public has fully grasped the tsunami that is heading towards our country. Next week there will be over a 1,000 dead Americans daily and that will likely continue through April. My low-end estimate for total dead in April is 30,000. Things will continue ot be bad in May and June as well as the Midwest will peak in those months. Things don't even have a chance of returning to normal until July in the absolute best case scenario.",
                            "score": 10,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "jesus, that is 9/11 times 30 or so. For the record I agree with you. The other thing I fell that people haven't been thinking about or pricing in is that in this environment it only takes one moderate size shock to make a huge impact. Imagine if California has a massive fire season or some geopolitical drama starts, or (more likely in my opinion) some sudden important corporate bankruptcy takes place. The markets might take dump over everything",
                                    "score": 5,
                                    "author": "lilolmilkjug"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "me too, that's why it's important to have a plan. I have my gambling account to do the crazy wsb stuff with a portion of my portfolio, the retirement stuff remains within a set of rules to buy / sell / rebalance that will not change.",
                            "score": 4,
                            "author": "legatinho"
                        },
                        {
                            "level": 2,
                            "comment": "Depends, if you go long and are confident in the recovery you can capitalize on this low as well in the next.",
                            "score": 2,
                            "author": "iordanissh",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I’m planning on holding long, but I’m on a small budget and really want to stretch my buy ins as far as they will go.",
                                    "score": 3,
                                    "author": "thtguyatwork"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Sorry for the seemingly dumb question but i'm very new and just trying to learn about investing/trading. What do you mean specifically when you say \"over leveraging\"?",
                    "score": 5,
                    "author": "awesomface",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "when you open a margin account, the broker will usually let you leverage your account. so for example, if you put 1000 dollars, they might allow you to trade as if you had 2000 dollars.\n\nThis works great when you are making money, as you can increase your returns. For example, a 50% gain on 2000 dollars would be a 100% gain on your actual capital.\n\nThe same happens when the market goes against you. If you lose 50% of 1000, you still have 500 to continue playing. On a leveraged account, you go to 0.\n\nWith options, things get even more complicated, as you can easily over leverage without noticing, and even a small price movement against you (let's say the underlying drops 10%) can not only wipe you out, but also get you a margin call.\n\nBy playing with less capital than you have:\n\n- You sleep better at night\n- Your hands are not so shaky and you can sit tight to let positions develop\n- You won't go bankrupt\n\nSure you will see some people leverage and go to the moon, but it might not happen to you.\n\nTwo examples I have:\n\n1 - In 2008, I sold puts on FCX at 70, the stock then dropped to 35. I doubled down thinking it was  a great buying opportunity, only to watch FCX drop even further to 15 bucks. By then I got wiped out.\n\n2 - In 2020, I saw Carnival drop to 35 bucks, and jumped the gun, sold some puts at 30, thinking there was some resistance there. Stock continued to fall to 20 bucks, eventually reaching 8 bucks. At the worst point, I was down a lot on this trade, now I'm already making some $$, even with my dog entry on some options at 35. I was able to do so because I did not over leverage, and had plenty of capital to sit thru these crazy price movements and re-position.\n\nIf I wanted, I could now sell CCL for a small profit, but I'll just let it ride. It might crash again, who knows. Bottom line it doesn't matter.",
                            "score": 13,
                            "author": "legatinho",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you that makes a lot of sense. Currently I've learned from others in my life and the internet to not be stupid and read/research as much as I can before really investing. Right now I'm barely dipping my toes into just safe blue chip and normal stock buys at a low level. Sounds like in that case i'm fine in the long run. Panic selling is mainly from over leveraging it sounds.\n\nI've been reading up on options and stuff a lot recently but I know i'm only scratching the surface on truly understanding them. Probably won't even mess with them for a while until I'm really comfortable in my knowledge. As entertaining as /r/wallstreetbets is I know i'm not built for that level of stress.",
                                    "score": 2,
                                    "author": "awesomface",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "seriously, i think 86% of the content in this subreddit is crap. but this post is very valuable, thanks for sharing.",
            "score": 284,
            "author": "PMPG",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you! Appreciated!",
                    "score": 56,
                    "author": "_WhatchaDoin_"
                },
                {
                    "level": 1,
                    "comment": "An oddly specific number, but I agree on the ballpark. I only ever see a small handful of good posts like this on most days.",
                    "score": 28,
                    "author": "RaspicaBlue",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "89% of all statistics are made up on the spot, keep that in mind.",
                            "score": 16,
                            "author": "Flattishsassy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Nope, 59%.",
                                    "score": 2,
                                    "author": "ephemeralentity",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's actually 73**.2**%.  \"You could look it up.\"",
                                            "score": 2,
                                            "author": "DeeDee_Z"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thanks for sharing. This resonates with me as I just read that the senate wont meet till April 20 which means we wont be expecting any more good news for a while. What's your plan this time?",
            "score": 50,
            "author": "Avizjx",
            "replies": [
                {
                    "level": 1,
                    "comment": "Will keep dollar cost average on any red day till we actually meet the bottom",
                    "score": 33,
                    "author": "Emran1104",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, this helps.\n\nI can have a bit of FOMO once a while too, I bough few $k of ETFs today, just in case I missed the bottom.\n\nBut I have much more ready to deploy on the side. My FOMO tells me that the best opportunity was Monday, my reason tells me that more opportunities are to come.",
                            "score": 46,
                            "author": "_WhatchaDoin_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 11,
                                    "author": "[deleted]",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Wait...you’re long? That’s not the takeaway I got from your writeup. Well, one of us will be right.",
                                    "score": 8,
                                    "author": "themvf",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "From stock return pov, 2020 is the opportunity I missed in 2008 (with much more ammo this time). It is a once in a lifetime opportunity.\n\nWait - it happens every 10 years - that can't be right!",
                                            "score": 34,
                                            "author": "_WhatchaDoin_",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You shouldn't be in a rush. The last two bubbles took 18-24 months to bottom. We're a month into this thing and this bubble is/was more than twice as large as the last. The last Dow bubble peak was at 14,000 and it was the bubble that was going to end the world. We then went on to peak at 29,000 and eveyone seemed to be acting as it's just business as usual, what's the problem? Unless you think this is just a short term correction and we're going right back to a massive bubble then we have a long way to go.",
                                                    "score": 11,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Shit. I have spy puts for 4/9. I didn’t read this news.",
                    "score": 4,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "$1200 per adult will not go far... but $600 per week from the Fed Gov for unemployment on top of what your state pays sure as shit will.  I wish I could get laid off real quick - would be a pay raise - and I’m a well paid firefighter!  \n\nThat being said I also expect more downside. \n\nSPXS and SDOW will be my bear leveraged ETF vehicles for the next few weeks. \n\nDoes anyone else have ways to make money on our way down? Not interested in futures or options.",
            "score": 116,
            "author": "JReynolds1988",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, buy SQQQ or SH. Just buy a bunch of shares as it drops and then sell once you've made a good profit. Using this method I've found to be less riskier than options and I have more gains right now than before the entire drop.",
                    "score": 25,
                    "author": "fvertk",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Can SQQQ be held for a few weeks or is that too long for returns to not be badly hurt by the expenses and decay?",
                            "score": 6,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I wouldn't hold SQQQ for weeks. I personally only day trade it, but holding it for a few days in this market should be alright. Decay is something you start to notice in the long run, it's practically negligible for short term positions (less than a few months).",
                                    "score": 4,
                                    "author": "AMB120",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;Does anyone else have ways to make money on our way down? Not interested in futures or options.\n\nYou can always short a stock or ETF. But buying put options might not be as scary as you think",
                    "score": 43,
                    "author": "whitethunder9",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Shorting scares me more than puts. With puts, my max loss is 100%. With a badly timed short it could get much worse. Imagine having shorted TSLA last December.",
                            "score": 40,
                            "author": "wickedsight",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's what tight stop losses are for.\n\nSet your intended stop loss immediately. That way if you believe you're catching a top with your short, but it continues to skyrocketed, you've lost a minimal amount. On the flip side, if you did catch a top, then your profits can vastly outweigh your losses. Even if you're right less than 50% of the time, your strategy can help you win.",
                                    "score": 10,
                                    "author": "flsurf7",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Careful with stop losses when markets can move 10% in a single day and gap through your limit price on event risk outside of market trading hours. I would (and am) hedging some of my long exposure with OTM puts.",
                                            "score": 5,
                                            "author": "ephemeralentity"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "SPXS",
                                    "score": 3,
                                    "author": "dylanx300"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I have been investing for years but buying put options scares me badly.  I honestly don’t have the fortitude to hold an April or May SPY put if it’s down 20%. I bought and sold puts for a loss yesterday. There is nothing worse in my mind than knowing your puts are erasing a $4k daily gain on your portfolio.",
                            "score": 8,
                            "author": "Ayn_Diarrhea_Rand"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Great post! Refreshingly honest.  Your views are my views on this.  A lot of people are looking at things like every crash is generic, so stocks will act in some scripted, generic fashion.  If anyone dares say \"this time it's different\" they're likely to get mocked.   The truth is: every crash is different, because different reasons cause it, and often there are different kinds of reactions to the crash.  There's a general assumption that there will be a U or V shape recovery.  We could have a U or V shape recovery, or we could have a year of deflation followed by runaway inflation. Things might never be the same after this.  Stocks do not always go up.  Look at the Nikkei.",
            "score": 65,
            "author": "ukdudeman",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; There's a general assumption that there will be a U or V shape recovery.\n\nYes, L shape is also a possibility that's on the table right now. \n\nWhen looking historically at where the growth comes from, it has been through sciences and we haven't made real breakthroughs for a long time now. \n\nWe've been surfing the tech wave and there is a little bit of AI going on but not enough to maintain the growth we need to keep the system floating without artificially inflating the bubbles.",
                    "score": 8,
                    "author": "leouf",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Fortunately, scarcity often begets innovation. I'm hoping to see the development of new technologies that focus on efficiency and self-reliance, particularly the delocalization of energy. \n\nWould you say that emerging markets is a good way to go, as the world becomes a more level playing field?",
                            "score": 2,
                            "author": "twinelephant",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes, it is about time we allocated all we have to make good progress in cold fusion.\n\nWhen we can replace oil with cheap abondant clean energy, then this will put people out of poverty all over the world and drive innovation for sure.",
                                    "score": 2,
                                    "author": "leouf"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Survivor of 2008 here.  One more thing to watch out for is the real estate market.  Nobody has mentioned it but it’s overheated in the major markets and everything is frozen for three to six months.  People tend to get 2008 wrong and think it was purely one thing.  It was never one thing. It was a collection of things that built up over time to implode everything, but the true pain comes from crashing real assets.  It is the heart of the economy and drives all aspects of consumer spending.  When it stops it crashes not just the market, but the whole economy.\n\nApril is the start of the home buying, apartment hunting, and renovation season.  It is also the time when people get out of their homes and shop retail with their newly minted refund checks.  That’s gone this year.  I’m in the process of moving and the market has fundamentally shifted.  I’m seeing things I haven’t seen in ten years.  Massive rebates, first month free, deposit waivers, TVs, 2,000 dollar gift cards for moving in type of incentives.  Dropping rent prices, disclaimers on Zillow.  That’s a giant shift from the ,”take it or fuck off,” attitude I’ve gotten in the last five years.  \n\nSomething else I noticed and can’t get out of my head is the stimulus for businesses both small and large are primarily loans.  The problem is many companies were already over leveraged to begin with.  Adding additional bridge loans will simply push many companies over the edge.  It adds underlying fixed monthly expenses that will require shorter margins or higher prices.  In competitive markets that will end several businesses on the bubble.  At the same time mortgage payments deferments only add time to the mortgage, or worse, it creates a secondary loan that adds additional monthly expenses to consumers.  \n\nOn top of that, those stimulus checks won’t come for at least 3-6 weeks and no one can currently spend like they are used to. All items are coming from online purchases and many might save their money just in case a medical or financial emergency comes up.  Even after it’s all done it will still take time for people to relax and start spending because there will be a lot of permanent layoffs.\n\n In my opinion this time period looks far worse than 2008.  I was expecting the market to enter a recession before the end of the year and have trouble from the over heated real estate market and the virus is pile driving the entire economy.  That’s not even mentioning the oil wars.  The jobs report is coming and I have said it before, I think we will see the DOW below 16,000 before this ends and another 2 stimulus packages.",
            "score": 137,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "This guy gets it. \n\nFor me, as a Canadian, it's even more acute. We have a massive real estate bubble in almost all of our major metro centers, buoyed by speculation, very low interest rates, and very lenient mortgage insurance requirements. Add in that Canadians have some of the highest personal / household debt (home equity lines of credit, credit cards, you name it) and a heavily resource-based economy that is most tightly linked to the USA (with oil prices now currently getting hammered by the Saudis and Russians).\n\nThe TSX and the Canadian economy were already dry tinder. COVID-19 will be both the accelerant and the spark. Layoffs are happening, unemployment is increasing, our dollar is devaluing, and our largest trading partner hasn't wrapped their arms around their virus response to any real degree.",
                    "score": 12,
                    "author": "MisterEyeCandy",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Agreed for real estate. Things are getting dicey.\n\nI got lucky that one of my syndications just sold this week (fortunately, despite coronavirus). But the 1031 exchange for the next syndication did not go through due to lender being nervous. I will know tomorrow if I the next syndication even buy the apartment complex. If not, that would be best, so I can redeploy more cash to the market. :)",
                    "score": 17,
                    "author": "_WhatchaDoin_",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I disagree that this looks far worse than 2008. I agree that this is not just the coronavirus causing the crash, it's been long overdue for awhile, but 2008 was a crumbling of market foundations that exposed the insolvency of so much. This is a crash due to uncertainty combined with an inevitable price correction for the market that has been propped up on stock buybacks and other unsustainable efforts.\n\nThe biggest reason I think we're in a better situation than 2008 is the means of economic recovery will be simpler. There is going to be a hit to employment, but that's not going to lead to the same mutually exclusive dynamics we had in 2008 where people no longer have a place to live and the only houses available are million dollar homes. There will be some places that end up closing, and there are going to be some lean months for many who are forced to be out of work, but the path to recovery will be much more straight forward than what needed to happen in 2008 where value needed to be completely realigned at basically a foundational level.",
                    "score": 42,
                    "author": "porscheblack",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A bad situation is a bad situation imo. We really can't say how bad this is going to be until later. The corona virus apex still has yet to reach an apex and schools and many many businesses are still closed. Hopefully this is as bad as it gets, but panic does crazy things",
                            "score": 14,
                            "author": "MakeMeMoneyHoney",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I agree with what you're saying and I'm not trying to make light of the current market. I don't expect it to recover to where it was before the drop as it was already artificially inflated, as was 2008. The only thing I was trying to point out, which I probably didn't do very well, was that the 2008 recovery was stalled due to a significant period where the incongruities between perceived value and actual value had to be rectified. In that way, the 2008 crash was similar to the dot com crash, except it was on a much larger scale.  I don't see us needing to reconcile incongruities to nearly the same degree as a result of this situation, as it's an economic disruption more than it is a fundamental reconciliation.",
                                    "score": 5,
                                    "author": "porscheblack"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 6,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I agree with you.  The only thing I worry about is that through this crash, some significant issues with the financial system will be revealed and we'll go into another depression like 2008.\n\nFingers crossed that's not the case.  I love Warren Buffett's quote: \"Once the tide goes out, we'll see who's been swimming with no trunks on.\"\n\nThe tide is out now and will be for the next few months.  Hopefully the global financial system has its trunks on.",
                            "score": 6,
                            "author": "barnymack"
                        },
                        {
                            "level": 2,
                            "comment": "I also agree that this is not as bad as 2008 - yet. \n\nIn 2008, there were serious concerns over whether the financial system would simply collapse under all of those toxic loans. Those toxic loans hit Wall Street banks just as hard as it hit the Main Street posers who bought way more house than they should have. \n\nI'm not saying it's 50/50 - but both sides were greedy.\n\nThis situation is different, as a pandemic slammed the economic brakes - something that is effecting almost everyone in a negative way. Now it becomes all about how fast we can get back to using the gas pedal.",
                            "score": 24,
                            "author": "Wilson8151",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Just every major bank and financial institution would have been insolvent last week if not for the Fed.  There is no bid for credit...they have the infrastructure in place from 2008 to support the system.  So in that respect we are in a better place than 2008.  \n\nHowever the fed is also spending a lot more this time.",
                                    "score": 8,
                                    "author": "cmbscredit",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah, but in 2008 they WERE insolvent. Several sank, others were forced to merge. TARP came in, etc. \n\nI'm not saying this is a walk in the park and nbd, but this is exactly why stress tests have been in place for the institutions. \n\nThis is JMHO, but it's the old question of \"insolvent vs. illiquid.\" For the most part, I think it's the latter, as the global economy didn't tap the brakes -- it slammed on the brakes. \n\nThe Fed and other CBs are simply throwing everything they can at the system to keep it from breaking, hoping they buy enough time for the economy to restart and support itself.",
                                            "score": 3,
                                            "author": "Wilson8151",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Dude, if you are placing your faith in stress tests then you and I have very different views of the world.  The stress tests are marketing pieces.",
                                                    "score": 2,
                                                    "author": "cmbscredit",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yeah, 2008 looked a lot worse for financial assets. This pandemic looks a lot worse in terms of potential human costs, but there isn’t an existential crisis for financial assets. There was a real threat that even the safest megacap companies in 2008 wouldn’t be able to make payroll because their checks would bounce due to all the banks vanishing overnight.",
                            "score": 3,
                            "author": "alisonstone",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think as you pointed out, the key difference, is that post 2008, there was no discontinuation of business due to disease. Of course people were diagnosed with illnesses and were dying.\n\nThere are some marked differences between then and now, which is mainly what is part of public discourse.\n\nThe rise to power of populists, globally. That was a response to perceived failures in the business of politics. Zero hour contracts; the gig economy. Good for some, and bad for others. Surveillance capitalism. Intensified emphasis on climate change, and habitat destruction. Social media going mainstream; for good and bad. The Panama Papers, peeling the veil on tax evasion. Edward Snowden. Massive share buybacks to artificially boost stock values. The deterioration of public health; and the rise of vegetarian and vegan lifestyle choices. Just to name a few.\n\nA lot has happened. The robustness of the global economy has come in to question, because real economy and speculation / investment have drifted so far apart, as to almost be in two different dimensions. Both of them, seemingly strong and fragile; depending which way the wind blows. \n\nMore so, recently, the real situation of public health. Notwithstanding that this is a very rare event in human history - there have never been more people with comorbidities, that only going to amplify the impact of this virus, in bringing about death. Those suffering from diabetes and obesity are some of the highest potential fatalities. Lobbyists and corporations have won the day; where profit was more important than health. \n\nAnd health is the key; physical, psychological, emotional and financial. This virus has exposed a big chunk of humanity, as being susceptible. \n\nThis should be a call to remedy these issues, instead of glossing over them. Business as usual is just going to set another time bomb. Change needs to be made. Public debate on priorities need to be had. Somehow, we need to change, to be stronger and better.",
            "score": 33,
            "author": "rockstarsheep",
            "replies": []
        },
        {
            "level": 0,
            "comment": "this bill includes substantial unemployment benefits through june though, $600/week in addition to state-level unemployment.  that's not something that was done in 2008, and that replaces the income and then some, of a large majority of american workers.",
            "score": 8,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Love how one of the top comments is about how people are trying to time the bottom with 3x leveraged ETF's while barely understanding the considerable risks in highly volatile markets. Mindblowing how dumb people are.\n\nBeing successful in finance is about understanding and mitigating your risks. Stop buying shit you don't understand. And even if you do understand it, you need to be extremely careful, especially with leverage (including options, margin accounts, and obviously 3x leveraged ETF's). Vast majority of people should avoid leverage even if they understand it due to human nature of greed to chase/over-risk.",
            "score": 10,
            "author": "ProductivityMonster"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 40,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's when my puts expire",
                    "score": 14,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "If it's like 2008 then we'll see the bottom around the end of 2021.",
                    "score": 4,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was a naive 22 year old in those days whose only market experience was the money the DFAS took from my military paycheck and put into my TSP. I was National Guard, so part time initially and working third shift retail on the civilian side. By time SHTF I was mobilized and gearing up for a deployment to Afghanistan in 2010. Everyone knows the adage, war is good for suffering economies, not to say the least about job security. By time I finished my contract and went full civilian was 2012 and I was working front end of a tattoo studio for the next five years. \n\nI'm in school now for accounting, trade options and more actively manage my long term investments. I'm on track to finish school EOY, but rn I'm really sweating how all the economic fallout is going to affect the job market mid to long term and that's not even considering the push toward digital automation in the financial space. \n\nAll that to say: if you aren't planning long term you're doing it wrong, and I'm not just talking about markets/investing. I dodged the bullet most millennials took I'm the GFC, and it feels like this time I might not be so lucky, pandemic or not. I can't stress this enough, if you're a part of younger generations do NOT blow off things you can do now to secure yourself later in life. Stay in school, no matter what level, and choose a career based not just off of emotional desire or what the job market looks like now. Always be thinking 10-20 years, if not more, into the future.\n\nTl;dr do what Boomers and Millennials didn't for the large part - take nothing for granted, do not get complacent, and always plan for the worst.",
            "score": 17,
            "author": "Weaponxreject",
            "replies": []
        },
        {
            "level": 0,
            "comment": "So what do you do? Sell your index fund and hope that the market goes down in the short term? No one can know that the market will be down in the short term. And what if you sell everything tomorrow and then it goes sideways up and down for the next month while you're out of the market and anxious to get back in at these relatively low prices. What then? Do you buy in after that month hoping that we don't get he next drop then? All you've gained by holding was a bunch of second guessing on every day we get a bull market bounce.",
            "score": 15,
            "author": "discover111",
            "replies": [
                {
                    "level": 1,
                    "comment": "If you are a long term investor and willing to hold and dollar cost average through the volatility, that will be a winning strategy. You will in all likelihood beat most other investors. Trading is a full time job that almost no one does successfully.",
                    "score": 21,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "I never sell - I had to in 2008 because a further 20% drop would have wiped my brokerage account, and that drop actually happened. So I am glad I saved some of it, and I learned immensely from it.\n\nI believe that the market is going up most times, and it can go down once in a while, sometimes violently. I don't like strong directional bets.\n\nSo don't sell, position your portfolio in a way that even after a 50% market drop, you don't have to sell, but actually you are ready to jump in and buy low priced if needed. It's not too hard, but FOMO makes people greedy and over committed. Everyone was laughing at Buffet when he had so much cash for the past year or two, and he said everything is expensive. Well, eventually, the wheel turns and opportunities appear, and you need to be ready to jump into the action while there is \"blood in the street\".\n\nSo right now, if your portfolio is not setup properly, it's too late. You just have to ride the wave. But next time, the market is frothy, remove the foot from the pedal, put some money on the side, and be ready.",
                    "score": 30,
                    "author": "_WhatchaDoin_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Right now SP500 is down around 28%. If you're 100% sure this is going to be like 2008 (down 56%), then definitely we're going to be down \\~50%.\n\nWhy not sell everything now, and reload when we're down 50% (or 45% to be conservative)? That way, you'll gain an easy \\~15-20%.",
                            "score": 8,
                            "author": "JonA3531",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "We can't be sure of anything, what if the market drops to 46%, how do I know it is time to get back in?\n\nTomorrow, a team in the world discover that readily available drug X + drug Y resolves 90+% of the extreme cases for Coronavirus and pretty much all deaths, and it has been applied succefully to thousands of people, then I guarantee you that the market will shoot up to the moon, and most problems will be resolved in the matter of weeks.\n\nI am not counting on this unicorm though. Prepare for the best, get ready for the worse.",
                                    "score": 29,
                                    "author": "_WhatchaDoin_",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Greed vs. fear.  That’s what makes a market.",
                                            "score": 5,
                                            "author": "cmbscredit"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I think the point is that sometimes it’s better just to sit on the sidelines with your cash in hand and wait out the roller coaster.  Yes, we get a big 10% bounce on a particular day...but that’s proceeded by a 7% drop the day before and a 6% drop the day before that.  The market is headed down long term.  It’s a bear that’s going to stay with us for a while.  Sometimes it’s better just to sit out for a couple months and enjoy a strong dollar.\n\nThese little pops here and there are markets reacting to good news and sentiment, and yes there’s money to be made along the way, but for the average joe with a 401k it’s better to sit out for a while and wait for the dust to settle.",
                    "score": 12,
                    "author": "KungFuBucket",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How do you know it's a bear that will stay with us? genuinely curious as this week seems up",
                            "score": 4,
                            "author": "UpOnCloud9",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is why you should hedge especially in turmoil.",
            "score": 8,
            "author": "chinaisasshole",
            "replies": [
                {
                    "level": 1,
                    "comment": "How?",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is great anecdotal perspective, thank you so much for sharing!\n\nSince you mentioned doubling rate, a little perspective as to where we're headed, yesterday saw a loss of 265 people; by the end of next week one person in the US will be dead of COVID-19 every minute ( &gt; 1440 people/day).",
            "score": 8,
            "author": "pushinbombadils"
        },
        {
            "level": 0,
            "comment": "But isnt this economy a result of the virus and not the result of a bad economy?",
            "score": 6,
            "author": "trkh"
        },
        {
            "level": 0,
            "comment": "I agree, but this bailout is much bigger.  We'll see what unemployment does, and how long we have to lock down",
            "score": 25,
            "author": "DataWeenie",
            "replies": [
                {
                    "level": 1,
                    "comment": "So, could the markets interpret that essentially Congress is indicating that the problem is twice as big as 2008? I don’t think anyone feels that right now.",
                    "score": 15,
                    "author": "emortio",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 26,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "what has fundamentally changed , other than people/companies can survive a little longer with this stimulus package?\n\n&amp;#x200B;\n\nIt's not like news of a vaccine just came out, or that the pandemic is slowing down.",
                                    "score": 7,
                                    "author": "PMPG",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;other than people/companies can survive a little longer with this stimulus package?\n\nThat's a huge change. Market sentiment is everything here if we want business to go back to normal once quarantine is over",
                                            "score": 8,
                                            "author": "bighand1"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "There might be another bail-out after this one.",
                            "score": 3,
                            "author": "onizuka11"
                        },
                        {
                            "level": 2,
                            "comment": "&gt;So, could the markets interpret that essentially Congress is indicating that the problem is twice as big as 2008?\n\nI don't think anyone is under the impression that any member of congress has the necessary quantitative skills to make that interpretation. A more accurate assumption could be, \"Congress is committed to halving the pain of 2008.\"",
                            "score": 5,
                            "author": "yankee-white"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thanks for the genuine insight. This is why I come here. Stay safe dude",
            "score": 12,
            "author": "xbno"
        },
        {
            "level": 0,
            "comment": "If the Cheesecake Factory sent a letter saying they are not paying their April rent then that’s all you really need to know about the state of the service industry. The unemployment numbers are going to be bad. The Congress is trying to pass the stimulus bill to minimize the impact of the unemployment numbers. I expect a deep red day today. Hold on to your hats.",
            "score": 14,
            "author": "Block_Chain_Saves",
            "replies": [
                {
                    "level": 1,
                    "comment": "\\&gt; I expect a deep red day today. Hold on to your hats.\n\nThe S&amp;P is up 100 points",
                    "score": 5,
                    "author": "HaHawk",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wow, thank you for sharing this very insightful for youngster like me",
            "score": 4,
            "author": "Tact1cal_Pandaz"
        },
        {
            "level": 0,
            "comment": "By knowing the worst is ahead of us, doesn't that mean things are priced in (sorry for using this term) and that's why we had such a steep decline quickly?",
            "score": 6,
            "author": "qwerty1234611",
            "replies": [
                {
                    "level": 1,
                    "comment": "To an extent yes it is.  The market is priced based on the probabilities of a range of possible scenarios. Pretty much all of them are worse than right now,  but the market will move based on how much worse it looks as we get more info compared with the best guess of what it will look like that we can come up with now.",
                    "score": 3,
                    "author": "lazyboredandnerdy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 5,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "You can't lose 6 figures if you don't have 6 figures. So I guess I'm good:)",
            "score": 6,
            "author": "tyros"
        },
        {
            "level": 0,
            "comment": "This isn't close to the same as 2008. Our economy is on pause right now, due to a virus that will almost certainly be gone by summer, where as in 2008 our economy had serious issues and was collapsing on itself due to negligence. Also this time we have unlimited QE which is a much larger factor then simply bailing out a few key players, this is not the same. Not to say we wont have more down days but we wont see another 25% past our lows this month, Algo's have already priced the jobless claim into the market when it was speculated by many economists that it would be in the  millions which it was and Algo's have likely priced in the recovery time of china to blunt the curve as well I would assume so that when this is over which will likely be when warm weather comes and we have effectively blunted the curve then this will disappear for some time more then likely. Not to say we wont see more cases next winter but it will likely be less due to immune systems being better at fighting it from this first time. This is just my opinion but I definitely wouldn't base your strategy off 2008.",
            "score": 4,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Thanks for taking time to share your experience.",
            "score": 15,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "My thoughts:\n\n* In 08, what convinced investors that we have reached a bottom was that the US financial system was no longer on the brink of collapse.  **The crisis was financial in origin, therefore it was resolved by coherent financial policy measures.**\n* **This time, we will require coherent and credible government public health policy measures**, complete with evidence that they will be effective (ie. new case counts start to decrease).\n\n**Unlimited QE doesn't solve the problem**, and we will see this play out every day as the market continues to move sideways in a volatile manner.  Instead of flooding the financial market with money, the gov't should flood the healthcare system to fund and provide free testing and treatment of all suspected COVID-19 patients.\n\nChina already set a good precedent here.  Chinese equities bottomed on the same day that daily new case numbers peaked -- **investors needed to see that the pandemic was under control before getting back into the market.**  Why?  Because we need consensus to be formed before we can have equilibrium pricing in the market, and consensus cannot be formed right now when investors snap back and forth with new information (ie. new lockdowns, new death estimates, new bankruptcies, new guidance reductions, etc).  **This snapping back and forth creates volatility and the market will never move towards equilibrium pricing.**\n\n**TDLR: Unlimited QE doesn't address the root cause of this problem, funding the healthcare system will.**",
            "score": 11,
            "author": "ThinSpiritual",
            "replies": [
                {
                    "level": 1,
                    "comment": "so you are saying that the market will eventually adjust towards another bottom if infection and fatality rates steadily surge and create extended pressure on the economy.\n\nI have the impression many investors are pricing in this infection peak within a certain medium risk scenario (part of hedging, positioning, rebalancing), estimating it to be in the next 6 to 8 weeks. If that expectation is not met (including any intermediate numbers that provide an indication to the worse), the market would drop further.",
                    "score": 4,
                    "author": "mekonsodre14"
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt; From my experience with the 2008 bailout, nobody could really predict the bottom.\n\nBack then after a stock dropped from 100 to 50 I bought some, the next day it dropped again to 30.",
            "score": 4,
            "author": "zxof"
        },
        {
            "level": 0,
            "comment": "But my biggest question is, why are we having corporate bailouts within *TWELVE* years of each other?? It took only TWELVE YEARS for republicans to blow this even worse than 2008.\n \n\nThis country needs massive change. This should not be happening in 2020, yet again the rich got greedy and the economy tanked and it's the rest of us who always literally pay the price. \n\nShame on you America.",
            "score": 33,
            "author": "emmgdac",
            "replies": [
                {
                    "level": 1,
                    "comment": "People got greedy in 2008. \n\nGreed had nothing to do with 2020. A government enforced lockdown due to a global pandemic causes businesses to fail. Idk why this is tough for people. No amount of capital planning would get business through this. Not doing stock buybacks doesn’t suddenly get you through this. \n\nNo idea why I keep seeing this compared to 2008, the causes are completely different.",
                    "score": 25,
                    "author": "littleapple88",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They're not completely different.\nMultiple congresspeople dumped their stocks before the crash cuz they had private information, that's greed and possible insider trading. \n\nThis country wouldnt be creeping towards a depression if we had systems in placed such as mandatory paid sick leave, mandatory minimum wage jobs for ALL jobs where people would be able to file for unemployment instead of evading taxes.  \nIf school was free, if healthcare was free- all of those systems in places wouldnt have brought us flirting with depression.\nInstead, the GOP wants to lower unemployed benefits because they believe its \"too generous\" and give corporations (not small businesses) 500B slush funds and tax cuts. \nPlease tell me where that's not greed?\n\nAnd might I remind you, the stocks were seeing the highest margins BECAUSE of trump's corporate tax cuts of 1.2 trillion for the very multibillion/trillion dollar corporations who saw the most amount of ROI in years.\n\nSo yeah, I'll compare 2008 and 2020 because it's all rooted in greed. Whether one was more obvious is subjective, but that it's all stemmed in greed of course it is. \n\nOh and let me add, America's pandemic is ALL thanks to trump for being too stupid to take precautionary measures to halt the spread- instead he worried about the corporations and \"assured\" people everything was fine and to keep going to work. Now he says *he's* willing to sacrifice *our* lives in the name of the yield. \n\nGREED.",
                            "score": 3,
                            "author": "emmgdac"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "And pray tell how Euro stocks are doing lately?",
                    "score": 2,
                    "author": "LetsFuckingG000"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That's a solid DD. Thanks.\n\nBTW pandemic doesn't hurt the markets. Containment does. Lockdown is pretty hard to lift once you've started it, especially when all countries around you still have infected. 2 months of lockdown is a very optimistic projection.",
            "score": 25,
            "author": "accidentally_right",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; 2 months of lockdown is a very optimistic projection. \n\nWe are on the precipitous of a showdown between the Democratic Governors of the largest states who have drawn a line in the sand that they are going to try and minimize the loss of life and a President who, I think, honestly believes the stock market is a report card on his performance.",
                    "score": 47,
                    "author": "yankee-white",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That is a spot on analogy. The guy is very much willing to say whatever it takes to turn market sentiment around. This evenings press conf was as if he was trying to sell the fact the country is just experiencing a small bump in the road as it's only NY and California with COVID issues...\n\n\"But if you take a look at the states and many states that I'm talking about, they don't have a problem. We have some big problems, but it's confined to certain areas, high-density areas.\"\n\nInteresting - look at all these less dense, less built up states they don't have a problem.\n\nSo so close... But missed the point...",
                            "score": 9,
                            "author": "you_up_in",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I stopped watching Trump's daily press briefings because they're are essentially useless and he just uses that time to attack the media and spread fake news and frankly just make things worse for everyone.",
                                    "score": 14,
                                    "author": "youni89",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's a joke.  He can't hold his campaign rallies anymore due to the need to avoid large gatherings, so he's replaced them with the daily coronavirus briefings.\n\n[https://www.cnn.com/2020/03/23/politics/trump-coronavirus-briefings-rallies/index.html](https://www.cnn.com/2020/03/23/politics/trump-coronavirus-briefings-rallies/index.html)",
                                            "score": 5,
                                            "author": "Hypnot0ad"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yes",
            "score": 11,
            "author": "6ixkush",
            "replies": [
                {
                    "level": 1,
                    "comment": "TL;DR: Puts gonna print after the vote passes!",
                    "score": 16,
                    "author": "Scarbane",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Diamond Hands?\n\nOh, wrong sub.\n\nBut good to see that I am not the only one just looking for some posts that comfort me with my current positions.\n\nBut as I am a man who always loses, the news for this year:\n-dow will be on all time high in dec. \n-Corona is just a flu.\n-trade war is over, best trade deal in the history of trade deals\n-OPEC is all rainbows and ponies\n-North Korea opens its borders and destroys its nuclear heads.\n-China becomes a democracy",
                            "score": 5,
                            "author": "69MarketTimer69"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yes I remember that very well as I just started playing the market and boom, Its gone...crazy times.  This is exactly how it happened though...",
            "score": 3,
            "author": "mattfox27"
        },
        {
            "level": 0,
            "comment": "In times like these, you've got to have great convictions and trust that things will recover and in the short term, be okay with seeing red all over.\n\nJust know that the economy will recover one or two years from now.. you will be back in the green. \n\nSo look at it as picking up stocks on the cheap and hold for the long term.",
            "score": 3,
            "author": "the99percent1"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "They said they had leverage. If they didn't at least remove the leverage they had the possibility of going negative.",
                    "score": 2,
                    "author": "lazyboredandnerdy",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not sure if this is a silly question, i'm very new to investing. Why do/did you sell off so much during the crash and not just wait it out to eventually come back in the coming years, especially for companies that are \"blue chip\" or very likely to come back?",
            "score": 3,
            "author": "awesomface"
        },
        {
            "level": 0,
            "comment": "Thanks for the info. It's only a loss on paper. It's only a realised loss once you sell. In hindsight you would of come up big if you weathered the storm ..\n\nGreat info nonetheless",
            "score": 8,
            "author": "Cine_Dime",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 13,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It blows my mind how little people factor opportunity cost into this. \n\nEveryone I know tells me \"just wait, it'll bounce back in the long term\", but have no answer when I say I don't want to subside off ramen for the next 2-3 years while waiting for the market to bounce back.",
                            "score": 7,
                            "author": "WheatlyWoodson",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Huh? Stocks are not your buying power. Cash is. \n\nIt IS only a lose if you sell. If you do not sell and it recovers, explain how thats a loss? Don't have your money tied up 100% in stocks if you want purchasing power.. That would require selling stocks and they do not always go up",
                            "score": 3,
                            "author": "imadummyoptionsyay",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "guys. go look up the chart of the DOW during the great depression compared to now, and prepare your life accordingly.",
            "score": 3,
            "author": "kidsupervillain"
        },
        {
            "level": 0,
            "comment": "You're correct, I was there...Fortunately was in stocks but only started buying in November of 2008 and holding through March.  Unfortunately I really didn't understand options so it was a wash on those.\n\nThank you for posting this, hopefully you'll get through to some people who are now using mad hatter logic not only with their investments but their own health.\n\nFolks, this is getting much much worse...  but I'll be relegated over here to the tin foil hat wearers.",
            "score": 5,
            "author": "Rabbitloki"
        },
        {
            "level": 0,
            "comment": "I think a couple key differences are\n1) a LOT more faith in the government and Fed in regards to bailout, QE. In 2008 there was no modern blueprint for something of this scale, it was unprecedented. This time around we know what we're doing and have a record of doing it successfully. Powell is a smart man and Bernanke made the rounds this week voicing his confidence in this being less concerning than many say. Frankly, if there's anyone I trust to weigh in on the matter it's him\n\n2) there's no major systemic reason for this downturn. In 2008 there was the mortgage bubble, in  2000 there was the dotcom bubble. In 2020 there's a growing economic shutdown due to a new pandemic. Arguably a worse situation than the others but one that will end, so long as the government is willing to spend the money to keep things afloat short term, which they've signaled they are, it will be okay.\n\nDo I think there will be further drop in the markets? Yes, dow 15k is my floor now that we have QE and stimulus going but unemployment numbers out of California spook me and I expect the dow to fall as more states announce. Do I think we'll see a long protracted fall? No, I agree with Goldmans projection of renewed growth by Q4",
            "score": 5,
            "author": "Atalung",
            "replies": [
                {
                    "level": 1,
                    "comment": "Agree with all of this.",
                    "score": 3,
                    "author": "DuckmanDrake69"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Great write up.\n\nOne thing I would disagree about is where you say that in 2008 there was blue sky ahead and now there is not. I would say that it is the other way around. In 2008, the economy was about to fall into a black hole. Today, it is an epidemic that will kill a bunch of people but then it will be gone again.",
            "score": 5,
            "author": "Krappatoa",
            "replies": []
        },
        {
            "level": 0,
            "comment": "there is supposed to be a phase 4, so another major stimulus bill is coming. but a senator complained they are in recess for a month. so that's how long we have",
            "score": 2,
            "author": "Ingivarr"
        },
        {
            "level": 0,
            "comment": "Thank you for sharing the words : )",
            "score": 2,
            "author": "coliguanda"
        },
        {
            "level": 0,
            "comment": "Thank you for providing your insight and experiences, I appreciate it!",
            "score": 2,
            "author": "VictimofKFC"
        },
        {
            "level": 0,
            "comment": "Which way we’re you over leveraged? With leap puts or calls?",
            "score": 2,
            "author": "Trowawaycausebanned4",
            "replies": [
                {
                    "level": 1,
                    "comment": "Deep ITM calls. Great for diversification at a cheaper price for sizable return, but when it tanks hard, the money is gone... Ooops.\n\nI saved what I could.",
                    "score": 4,
                    "author": "_WhatchaDoin_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What about leap calls after we hit the bottom?",
                            "score": 2,
                            "author": "Trowawaycausebanned4",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hard to tell where the bottom exactly is. Unless you are really deep ITM, you may pay a lot for the extrinsic value.\n\nIf you vega is very high, and you have stomach for it, you can add leverage by selling leap OTM put, so you are positive theta, and you may not lose money even if the market drops a bit more.",
                                    "score": 4,
                                    "author": "_WhatchaDoin_"
                                },
                                {
                                    "level": 3,
                                    "comment": "When’s the bottom hmm?\n\nThere was a 3-4 month bull market in 2008, before it absolutely tanked. \n\nNo one knows the bottom.",
                                    "score": 2,
                                    "author": "zachrf1",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thanks a lot for the post",
            "score": 2,
            "author": "willthachimp"
        },
        {
            "level": 0,
            "comment": "Thank you for sharing your points, friend.",
            "score": 2,
            "author": "FredGhost"
        },
        {
            "level": 0,
            "comment": "Thanks for your insight! My current plan is to be buying whenever the S&amp;P/Dow dips a significant amount.  We can never time the bottom and luckily I have a significant amount of cash sitting on the sidelines before this crash.",
            "score": 2,
            "author": "lightriver90"
        },
        {
            "level": 0,
            "comment": "I think the best thing to do is DCA and dont sell 401k mutual funds....enjoy reinvested dividends and dont be a bitch about it.",
            "score": 2,
            "author": "epsteinsALIVE"
        },
        {
            "level": 0,
            "comment": "if lucky can live entirely on the $53K settlement money from slipping on the pee-pee at the Costco, I’m pretty sure $1200 will easily get me by for at least the rest of the year",
            "score": 2,
            "author": "broknbottle"
        },
        {
            "level": 0,
            "comment": "I know this is a sub about investing and we're all concerned about the economy. But we need to realize that this is war, it may not be a war that can be one with bullets, but this is a war that involves every aspect of society. If we can't treat this with that kind of seriousness, we'll not have a chance in hell to recover any more quickly.",
            "score": 2,
            "author": "darmani28"
        },
        {
            "level": 0,
            "comment": "There was unclarity for months during the 2008 crisis.",
            "score": 2,
            "author": "Chesterbobby"
        },
        {
            "level": 0,
            "comment": "I don't know if this has been asked already. But how did you know that the bottom was in back then? Did you wait for a couple of green weeks before jumping back in? What was the turning point that made you decide that this was as bad as it would get?",
            "score": 2,
            "author": "g3tafix"
        },
        {
            "level": 0,
            "comment": "Great post and sharing of wisdom. Thank you! Just finished reading the article below which shares the same sentiment. [https://seekingalpha.com/article/4334358-dont-get-caught-in-bull-trap?mod=mw\\_quote\\_news](https://seekingalpha.com/article/4334358-dont-get-caught-in-bull-trap?mod=mw_quote_news)",
            "score": 2,
            "author": "thescatmancan"
        },
        {
            "level": 0,
            "comment": "One thing I remember from 2008 is Obama admin offered 8,000 dollar tax credit to buy a house. Housing prices were relatively low, and I kick myself 10 years later for not buying even something small and cheap/ fixer upper.",
            "score": 2,
            "author": "frickin_darn"
        },
        {
            "level": 0,
            "comment": "&gt;After we reached the bottom, I switched my positions to risky assets, and I was able to make up some of the losses.\n\nGenuine question - How did you know that the market had reached the bottom? What made you confident that it wouldn't drop further?",
            "score": 2,
            "author": "BigBrownBearMarket"
        },
        {
            "level": 0,
            "comment": "This just tells you nobody can time the bottom, don't try. And nobody knows the bottom. Alot of people keep messing with thier accounts and gets emotional that's why they lose money.",
            "score": 2,
            "author": "liao24"
        },
        {
            "level": 0,
            "comment": "lmao.  imagine not buying the bottom.",
            "score": 2,
            "author": "ballinurmum"
        },
        {
            "level": 0,
            "comment": "Very nice to share your story. However, I don't agree with your conclusion.\n\n2008 was a financial criss and this is not. The unemployment number may seem daunting but they will fall once things are under control. By \"under control\" it is either that we have a vaccine or the virus just disappears miraculously like SARS, or the infected keeps growing and given the current rate we will reach herd immunity by the end of the year (with many terrible deaths).\n\nDon't forget there's still one last move from the Feds - they can call a truce to the tradewar or even start reducing tariffs. That will boost confidence in the market almost immediately.",
            "score": 2,
            "author": "[deleted]"
        }
    ]
}