{
    "id": "l2t0k1",
    "score": 4656,
    "title": "GameStop (GME) halted at $72.80",
    "author": "ef_jay",
    "date": 1611338020.0,
    "url": "https://www.reddit.com/r/investing/comments/l2t0k1",
    "media_urls": [],
    "other_urls": [],
    "postText": "Looks like the squeeze is really happening. Shout out to all the people in this sub that clowned me for having GME. Citron needs to investigated for possible collusion with firms for market manipulation. They did the same damn thing with PLTR. They find stocks with momentum and then send out a hit piece just so they can get a better price to buy in. Smh",
    "comments": [
        {
            "level": 0,
            "comment": "**Hi, welcome to /r/investing. Please note that as a topic focused subreddit we have higher posting standards than much of Reddit:**\n\n**1)** Please direct all **advice requests and beginner questions to the stickied daily threads.** This includes beginner questions and portfolio help.\n\n**2) Important: We have strict political posting guidelines** (described [here](https://www.reddit.com/r/investing/comments/cyee69/formal_posting_guidelines_for_political_topics/) and [here](https://www.reddit.com/r/investing/comments/escewo/temporary_rule_change_what_happens_to_stocks_if/)). Violations will result in a likely 60 day ban upon **first instance.**\n\n**3)** This is an open forum but we expect you to conduct yourself like an adult. Disagree, argue, criticize, but **no personal attacks.**\n\n--\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/investing) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 4768,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Our Canadian friends in Waterloo: BlackBerry **$BB** looking to be the next recipients of this wall of money!",
                    "score": 1195,
                    "author": "ExaltedDLo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I might get downvoted/flamed for this, but honest opinion is that fundamentally, I feel **BB** and **PLTR** have larger merits for LT growth than **GME**. \n\nWhile I'm sure Ryan Cohen is a great leader for GME, all the games I've played are through digital downloads these days. There is a less need for an intermediary like GameStop to sell games.\n\nMeanwhile, BB and PLTR actually are building products that are needed for the foreseeable future (security + bigdata).",
                            "score": 761,
                            "author": "ornamental_stripe",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "100% agree. Cohen may pull a rabbit out of the hat on $GME, (he might be better positioned to do this than anyone, frankly) but it’s speculation and a MASSIVE short squeeze driving this run right now. \n\n$BB is badly undervalued against its tech peers. Do your own DD, but this new BlackBerry under Chen is a phoenix from the ashes of an old hardware giant. Watch this space.",
                                    "score": 291,
                                    "author": "ExaltedDLo",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Just put in another $120k into $BB... edit: yolo going $400k deep.",
                                            "score": 155,
                                            "author": "monsieurmatthieu",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 37,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Cohen will pull a big green dildo out of his ass and we will all ride it to Tendie Town™",
                                            "score": 154,
                                            "author": "heyheyfucktoday",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Wrong sub, but I agree",
                                                    "score": 142,
                                                    "author": "Money_come_money_go",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "They all blend together at this point.",
                                                            "score": 63,
                                                            "author": "heyheyfucktoday",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Exactly. R/Investing is like riding coach on the reddit stock 747",
                                                                    "score": 27,
                                                                    "author": "Tomcatjones"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "PLTR is like Delos/Rohoboam from Westworld. The shit is crazy",
                                    "score": 81,
                                    "author": "staniel_diverson",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "If only they knew how to make money.",
                                            "score": 56,
                                            "author": "Kyo91",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "They do make money, their R&amp;D costs are just insane, eventually they will be a powerhouse",
                                                    "score": 36,
                                                    "author": "Slut_Slayer9000",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Those R&amp;D costs are insane because they embed a team of engineers on every contact, who in theory work on the overall product but are really just adding features+support for their client. Their business model is way more IBM than it is Salesforce and that's the rate they'll scale at.",
                                                            "score": 33,
                                                            "author": "Kyo91",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Digital downloads are hard for people with shit Internet since it takes forever to download. It's great for people with really good Internet speeds.",
                                    "score": 18,
                                    "author": "CDN_AP",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Dude... Ryan Cohen literally built the online/digital presence of chewy.com from nothing. \n\nWhat makes you think he won't do the same thing to GME? You're literally playing into his (future) business model by committing to online/digital consumption. Thats. what. he. wants.",
                                    "score": 136,
                                    "author": "Daegoba",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Digital games is VERY different than other digital marketplaces, because the consoles OWN their own digital marketplaces, so they actually have to compete with the very consoles they sell games for, because all the consoles have built in digital stores, endorsed by the console makers already ! How can Gamestop compete on price, or anything else, when the console makers have built in console buttons leading to their official stores, and set the digital price, and everyone else has to follow their lead ?",
                                            "score": 54,
                                            "author": "HODL_monk",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 18,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 92,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You wouldn't download a car, would you?",
                                                    "score": 28,
                                                    "author": "confusedDM098",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "You can you just can't eat it.",
                                                    "score": 21,
                                                    "author": "Ffdmatt"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt; You're literally playing into his (future) business model by committing to online/digital consumption.\n\nSo you're saying that he can copy the Steam method and make it look fresh?",
                                            "score": 104,
                                            "author": "CaramelChewies",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Seems pretty classic of a Warren Buffett, cigar butt company to me. \n\n* Billions in sales despite poor management\n* improving credit/cutting costs\n* VC who knows e-commerce and has stated that he's serious about helping GME\n* New console cycle, biggest one yet\n* Growing industry that is only going to get exponentially bigger ($200B by 2023)\n* 40-50M rewards program users\n* Recent partnership with MSFT and potentially SNE \n\nYeah, they have some issues that need to be considered. That is the point of value stocks. They have problems and that's why they're not trading at the appropriate value.\n\nYes there is speculation, but I'm an avid gamer and I think there's a lot of potential. I am personally invested because I think a young, smart person like RC is exactly what this industry needs right now.\n\nLots of unanswered questions still but I'm excited to see what happens as a shareholder.",
                                                    "score": 39,
                                                    "author": "Darling_Pinky",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Well he is on the board vs actually being CEO for one. If he was in the C Suite, I would feel much more confident.\n\nBuilding something from the ground up is arguably easier than transforming a business overnight especially when the business is losing money.\n\nEdit: I have no positions in GME beyond an absurdly small percentage in an index.",
                                            "score": 22,
                                            "author": "bammayhem",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Don’t forget that Gamestop is currently testing the waters of online PC parts selling and builds.\n(Source: LTT) \n\nIf they manage to staple the name to a “Gaming PC Go-To Site” - literally the moon is the limit.\n\nThis ain’t over yet, not by a longshot!",
                                    "score": 44,
                                    "author": "tiejcsi",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "My dumb ass thought you were talking about [the Waterloo: BlackCherry sparkling water](https://www.amazon.com/Waterloo-Sparkling-Water-Flavored-Naturally/dp/B075LQ1GDZ) and I just spent time researching water stocks",
                            "score": 22,
                            "author": "LeftShark",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "BB jumped a little at the same time GME jumped.  :thinking:",
                            "score": 22,
                            "author": "Total-Contact",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "That jump though!",
                            "score": 10,
                            "author": "dhenr332",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "BB is the next one, there are still some seats left on the starship, hop on friends",
                    "score": 37,
                    "author": "Truthbelow",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "So $BB",
                    "score": 53,
                    "author": "RetardsWithAIDS",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "haha I imagine SEC investigators as well",
                    "score": 151,
                    "author": "ThomBraidy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think you are overly optimistic about how much work government workers actually get done in a day. Especially during COVID.",
                            "score": 188,
                            "author": "TeamLIFO",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yuppers. I have several friends who work for the gov't and they spend 60% of their work day playing Warzone, lol",
                                    "score": 127,
                                    "author": "trannick",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I work for the gov I play warzone what's wrong with that lol",
                                            "score": 50,
                                            "author": "def0to",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Nothing wrong with playing it after work, but they are technically being paid the taxpayer's dime to play video games during work, lol",
                                                    "score": 60,
                                                    "author": "trannick",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "And what do you have against The American Dream?",
                                                            "score": 120,
                                                            "author": "csp256",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "While I totally agree I wonder what would they be looking for? They’re not doing anything illegal as none are insiders",
                            "score": 28,
                            "author": "AphiTrickNet",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Everyone points this out in every thread like sentiment analysis is a new aspect in investing.\n\nYes WSB is more wacky than most but there were also traders scrolling 4chan back in the day on some of the SFW boards to gain information on unconstrained public opinion.",
                    "score": 10,
                    "author": "LoaderD"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 34,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's not really a surprise at all. People like Peter Lynch wrote decades ago in One Up on Wallstreet about how investment firms have CNBC and other financial media playing at their offices in case clients call them up wanting to talk about what topics are being discussed there. \n\nIt wouldn't look for the firm if their client asks them about Gamestop stock and their reaction is \"what? Gamestop is in the news?\".",
                            "score": 28,
                            "author": "ShadowLiberal"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Someone in this sub asked only a month ago if r/wallstreetbets was moving the market. I said “yes” and got downvoted. SMH.",
                    "score": 141,
                    "author": "redditpey",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well, i dont know. Its not wallstreetbets that shorted GME",
                            "score": 90,
                            "author": "Pelopida92",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well wallstreetbets definitely made the stock popular. There is a squeeze + hype.\n\nWSB at least brought the hype.",
                                    "score": 41,
                                    "author": "yevo",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Dude, we're not moving the markets. We can't. I know it seems that way, but collectively, we *might* own 5-8% of the total stake in GME. \n\nIt's the whales of the industry listening to us pool of retail investors that's moving the market.",
                            "score": 90,
                            "author": "Daegoba",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think we are agreeing with each other, though the semantics differ a little. But I’m not saying Reddit communities are actually buying and driving the stock up but  r/wallstreetbets is influencing the market, or said another way, r/wallstreetbets is moving the market. I see those statements as basically the same actions.",
                                    "score": 46,
                                    "author": "redditpey",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I’d agree here. I doubt that WSB itself has enough money to move the market, but it would not surprise me if, for every WSB investor with actual skin in the game, there are dozens or possibly even a hundred lurkers who are taking their strategic cues from them.",
                                            "score": 15,
                                            "author": "heresyforfunnprofit",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Wouldn’t a lurker of /r/WallStreetBets qualify as being a/r/WallStreetBets member and hence they would be included in having enough money to move the market?",
                                                    "score": 15,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "5-8% of the total stake in GME is huge for a company so massively shorted with so little available float, honestly. I normally agree that WSB is peanuts but in this one case, I think it's different.",
                                    "score": 28,
                                    "author": "Lezzles",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Think of how the other 92-95% of holders (at least the ones' not shorting) are feeling.",
                                            "score": 7,
                                            "author": "Daegoba"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt; It's the whales of the industry listening to us pool of retail investors that's moving the market.\n\nIn other words yes we're moving the market by being influencers who convince others to buy or sell stocks.\n\nYou don't have to personally buy or sell a bunch of shares to move the market if other people will pay attention to what you're doing and copy your moves.",
                                    "score": 6,
                                    "author": "ShadowLiberal"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Shorts won't be closing their position all at once. We could be seeing just the beginning of what this thing is capable of.",
            "score": 823,
            "author": "Dostoyevskee",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is the beginning",
                    "score": 209,
                    "author": "WittyManner0",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This.  What happened today was the $60 threshold being breached immediately after the 45, 50, and 55 levels.  When that happened, suddenly **42,000 call options** (at the $60 strike alone) were in the money.  That causes a stampede of call writers buying stocks to cover.\n\nToday's spike was due to options insanity.  I doubt the truly big shorts are out in any significant way.  They would have been crazy to try to get out today.",
                            "score": 266,
                            "author": "PlayFree_Bird",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Retail shorts got margin called or force liquidated. I don't think melvin or the big guys were forced out just yet.",
                                    "score": 127,
                                    "author": "grackychan",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "With emphasis on yet. Get out the way.",
                                            "score": 58,
                                            "author": "TheHairlessBear",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "We may see a similiar thing happen soon though.\n\nThe maximum stike price for call options I see in Feb is only $75.",
                                    "score": 32,
                                    "author": "Harudera",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That was the problem today. There were no higher call options for MMs to hedge with so all the shares were lapped up. When was the last time every single call option available for a date expired in the money?",
                                            "score": 12,
                                            "author": "spenrose22",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; When was the last time every single call option available for a date expired in the money?\n\nLast Thursday or so with GME I think.\n\nMight've happened with Tesla too I think",
                                                    "score": 11,
                                                    "author": "Harudera"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yis. This. Im Holding thru Monday. This is going to be a shitshow. \n\nHonestly, fuck citron, after this guy will be fucking bankrupt. If he seriously bought shorts at 40 he is now paying like 40% interest and has lost so much money.",
                    "score": 404,
                    "author": "brokester",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hold *way* through Monday, if you don't mind.",
                            "score": 246,
                            "author": "Piccolo_Alone",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hold until deepfuckingvalue sells",
                                    "score": 364,
                                    "author": "PARADlSE",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I agree to a point. The problem is he's a trailing indicator.",
                                            "score": 62,
                                            "author": "channingman",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "This",
                                            "score": 69,
                                            "author": "LMNOP-MD",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "he prolly doesn't even have shorts in gme, melvin prolly promised to give him a foot massage if he made a laggy stream about gme",
                            "score": 52,
                            "author": "help2ez",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That stream was pathetic at best",
                                    "score": 12,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Sadly otm put leaps jan 2022 are so expensive right now.      Need a $20 share price to break even.    \n\nThis is as dumb as kodak jumping up on blockchain news or the bull run hertz had.",
                    "score": 62,
                    "author": "rainman_104",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "KODK jumped on 700 million government funding news up to $60-ish \n\nThe next day I sold it for $10",
                            "score": 49,
                            "author": "Dk_Oneshot01",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "When you have a move like that, it’s the top. That’s how you’ll know",
                                    "score": 12,
                                    "author": "Trowawaycausebanned4"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "He gave us 5 reasons why it'll drop to $20 though. /s",
                            "score": 47,
                            "author": "MeidlingGuy",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "on some brokerages (e-trade) you literally can't sell puts on GME, the squeeze is that bad",
                            "score": 30,
                            "author": "hasbroslasher",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "E*TRADE bumped up margin requirement to 100% for GME.",
                                    "score": 16,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What in the fuck! I remember eyeballing Gamestop, then I was like eh that company is shit. I never go there anymore, don't have any reason to go there anymore.\n\nThen this happens.",
            "score": 723,
            "author": "landob",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hahaha same. I saw it back in Sept, Oct I think and I was like this is soooo cheap and with PS5 coming, it will go higher but then I saw couple of stores near my place close and then I was like nah thanks but I bought finally about a week ago to support the bros",
                    "score": 194,
                    "author": "Lordie92",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I mean that’s kinda why this is happening in the first place. A lot of people were like this company is shit and shorted it. WallStreetBets said no and now the squeeze is underway.",
                    "score": 151,
                    "author": "big_phat",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ryan Cohen said no and Wall Street bets piled on.",
                            "score": 109,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "WSB are the like the hype guys before a concert. They get the shit frothing.",
                                    "score": 68,
                                    "author": "Say_no_to_doritos",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is an artificial situation.  Nobody thinks the stock is worth this much.",
                    "score": 556,
                    "author": "Pleather_Boots",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "How can one find current short volume? Everything I’ve been able to google seems to be outdated, to December. Do updates happen monthly or something?",
            "score": 76,
            "author": "tyler7190",
            "replies": [
                {
                    "level": 1,
                    "comment": "Every 2 weeks. New short report should be coming in a couple days now I'd think",
                    "score": 53,
                    "author": "Kenney420",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not really. 2 times a month for NASDAQ and 1 times a month for NYSE  \nAnything else is just guesses and short interest is a lagging indicator anyways.",
                            "score": 31,
                            "author": "onkel_axel",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ah, only once for NYSE. I didn't know that, thanks for the correction. Thought it was twice per month across the board",
                                    "score": 15,
                                    "author": "Kenney420"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;On Friday, Citron said it would not be commenting on GameStop any longer because of attacks from the “angry mob” that owns the stock.\n\nMusic to my ears.",
            "score": 520,
            "author": "PerspectiveFew7772",
            "replies": [
                {
                    "level": 1,
                    "comment": "What an excuse to say, \"I manipulated the price so I can get in on the action\"",
                    "score": 176,
                    "author": "ChiknBreast",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "\"And I'm embarrassed to admit that I got margin called and had to close part of my position for my biggest loss ever\"",
                            "score": 100,
                            "author": "Semioteric",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I haven’t been following it too closely, but isn’t their commentary one of the principal reasons why it’s skyrocketing? I was thinking yesterday that if they just sat back and shut up they would do far better for themselves than they are doing trying to attack it actively and spurring a mob to move against them",
                    "score": 19,
                    "author": "AmericanFlagPants",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "That dude may have been laughing and smiling at how stupid people are buying Gamestop but the eyes were glazed over..  You can tell he was taking on heavy water, heavy losses and needed price to fall to recover.\n\nThe eyes never lie chico!",
                    "score": 7,
                    "author": "Hey_Hoot"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 460,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 1458,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is the best explanation of the actual mechanics of it that I’ve found, thank you.   Do you have a sense of the monetary amount that is in play here?   I assume that can be figured out by the number of shares in play.   \n\nThis link seems to show that the company value went up by nearly 2 billion since last quarter.   It’s crazy to me that one sub could be pumping a stock that much.  \n\nhttps://finance.yahoo.com/quote/GME/key-statistics/",
                            "score": 223,
                            "author": "sublliminali",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "that 2 billion is meaningless now, it could be 20 or 200 billion (look up what happened to porsche and volkswagen group in the context of short squeeze)\n\nto compare: it's like when you promise to sell a bunch of people the upcoming iphone for 100$ above MSRP. at the time of release you are realizing there are not as much iphones available as you promised to sell those people... Your customers that already paid you and time is running out, they are about to come down on your ass hard with lawsuits and repos. so you have no choice but to buy every new iphone you can find at whatever price they are offering to get out of your predicament...\n\nsomeone could offer you an iphone for 500$ or 1000$ above MSRP, but because you fucked up so bad you have no choice but to buy it at that ridiculous price...\n\nthis doesn't mean iphones are really worth 1000$ above MSRP for everyone, it just means there is so little supply that buyers are slave to whoever is selling.",
                                    "score": 196,
                                    "author": "krikke_d",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I get that, I guess I was more curious on how much money has actually changed hands, essentially how much have wsb people invested",
                                            "score": 15,
                                            "author": "sublliminali",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "That’s not what’s happening. It’s a short squeeze combined with a catalyst",
                                    "score": 46,
                                    "author": "Crobs02",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 38,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Margin calls",
                                    "score": 68,
                                    "author": "djemoneysigns",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "The expiring ones probably aren't actually share shorts, but rather call options that were sold by shorters &amp; market makers. As the price rises, they (and share shorters as well) need to buy shares to cover the risk of having to deliver shares at a low price (also see gamma exposure). This becomes particularly urgent when the call options reach their expiry date (Fridays). Then there's the effect of margin calls if share/option shorters have used leverage to short - a price rise could force them to liquidate their shorts, i.e. buy shares. All taken together, the price rise becomes a self-fulfilling prophecy - a short squeeze.",
                                    "score": 27,
                                    "author": "creamyhorror"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "He literally called January 2021. \n\nIt's actually a little scary how right he's been this whole time.\n\nStarted with 53k. Now over 11M.",
                            "score": 30,
                            "author": "amateurstatsgeek"
                        },
                        {
                            "level": 2,
                            "comment": "That was an excellent explanation, thank you! Now this really means that it is pretty overvalued right now, correct?",
                            "score": 62,
                            "author": "engineertee",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "After a short squeeze, the price will fall back down. That being said, many people on WSB are very excited about GameStop’s corporate leadership getting shuffled around and becoming a very solid company with a stock value that’s embarrassing for all the bears and short sellers that were betting on the company going under. There are all sorts of price targets. But basically, if you bought into GME before it shot up to $40, you’re going to have a very solid position for the future (or you could sell during the squeeze for some sickening profits and then buy in for the long haul once the price goes back down)",
                                    "score": 104,
                                    "author": "Darth_Candy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I can only get so erect",
                                            "score": 19,
                                            "author": "damnwhale"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt; it is pretty overvalued right now, correct?\n\nYeah probably, though they have pretty good future prospects and nobody really knows. Today's market (just look at TSLA) has surprisingly little to do with actual value. Also there's still lots of short sellers who'll have to close their positions, so it'll only go up further.",
                                    "score": 25,
                                    "author": "MeidlingGuy"
                                },
                                {
                                    "level": 3,
                                    "comment": "At this price, no. If Ryan Cohen gets his way it’s probably worth a little more than this at least. But it will be overvalued here in a few days, but it  won’t matter bc short squeeze",
                                    "score": 32,
                                    "author": "Crobs02"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "basically, shorters didn't believe in the company at $5 and started shorting the stock. this essentially is borrowing the stock to get money now ($5) and then you have to buy back at a later time. If the price goes up, you end up losing a lot of money. This means shorters head for the exit and price continues to sky.\n\nThese guys shorted more shares than were even in existence!\n\nLook up 2008 VW short squeeze, [KBIO short squeeze](https://moxreports.com/kbio-infinity-squeeze/). Fascinating case studies on an economic phenomenon where Supply becomes not existent, increasing Demand through the roof. I've learned more in the last week of trading than in my previous 2 years, it is so interesting.",
                    "score": 182,
                    "author": "Darling_Pinky",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "This post has most of the details AFAIK:\n\nhttps://www.reddit.com/r/SubredditDrama/comments/l2gfab/rwallstreetbets_set_to_private/",
                    "score": 27,
                    "author": "refpuz",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "https://www.investopedia.com/terms/s/shortsqueeze.asp",
                    "score": 7,
                    "author": "amish14"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I sold my GME shares at + 72.5%\n\nAt $4.90/share\n\nWell then..",
            "score": 46,
            "author": "SoyFuturesTrader",
            "replies": [
                {
                    "level": 1,
                    "comment": "Rip. Buy BB and you'll feel less bad in 6 months",
                    "score": 18,
                    "author": "ef_jay",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 213,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Honestly this is just a taste of what *could* happen",
                    "score": 96,
                    "author": "jeepers_sheepers",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 44,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Something does need to be done about Citron. That being said GME is not a good company imo. But I LOVE the fact that these assholes are getting what they deserve right now.",
            "score": 900,
            "author": "Dewy8790",
            "replies": [
                {
                    "level": 1,
                    "comment": "Im having so much fun watching this",
                    "score": 335,
                    "author": "that-manss",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What a time to be alive when you can be upset for \"only\" making $12,000 (132%) in 3 weeks.\n\n\nI bought 500 shares at 17.83 and sold them tuesday for $41.50. To see that all the way up at $73 today was crazy.",
                            "score": 274,
                            "author": "Messiah1934",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 501,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Story of my life, except with ARKK.  Been holding that with a cost basis of $39.76",
                                            "score": 75,
                                            "author": "Messiah1934",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I learned from Tesla. I kept selling it at 320 and buying the dip, until one day it rocketed past me...That was pre-split. Yeah. Ouch. Yeah 50% more money is cool. But 1600% more money would be way more cool. \n\nI'm diamond hands on this GME shit. This was but the tip.",
                                                    "score": 86,
                                                    "author": "ShaidarHaran2",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Feels like the wrong lesson. It sounds like you were buying tesla just for the volatility of the stock so you could make quick money and repeat. If you believed in the company you would not be quick swing trading it. \n\nI literally did the same thing with tesla and sold at 300 something last year after I was comfortable with the money I made. In hindsight obviously I wish I saw tesla for what the market sees but I did exactly what my original goal was.\n\nI still have shares in companies from that time that I have only held and never sold my position on because those are the companies I trust.\n\nIf you interpret every volatile upwards spike as news that you shouldn't sell you will get shit on eventually.",
                                                            "score": 41,
                                                            "author": "dakadoo33"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Learn from your mistakes. Don't keep doing it over and over.",
                                                    "score": 19,
                                                    "author": "argusromblei",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "You never lose money selling for a profit.",
                                                            "score": 84,
                                                            "author": "Xyst_",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[deleted]",
                                                                    "score": 25,
                                                                    "author": "[deleted]",
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "You don't lose money never asking for a raise, either. You lose potential earnings. Opportunity costs should be considered alongside literal costs.",
                                                                    "score": 32,
                                                                    "author": "Ffdmatt",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I think GME is a perfectly viable company with a future under the right leadership.  That being said, what this is about lately is something else entirely.  This is about fighting back against the unbridled greed of corporate raiders.",
                    "score": 27,
                    "author": "PlayFree_Bird",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh I agree. And im glad to see Citron getting smoked from retailers finally fighting back. I hope Citron loses everything.",
                            "score": 16,
                            "author": "Dewy8790",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They cost me a lot of money when they attacked apha with baseless claims that the market gobbled up. I really hope he got fucked by shorting GME.",
                    "score": 6,
                    "author": "Hoof_Hearted12"
                },
                {
                    "level": 1,
                    "comment": "It may not be now, but with Ryan Cohan and his team there’s strong potential",
                    "score": 51,
                    "author": "BigHarold22",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you are interested why GME is doing what it's doing I suggest checking our roaringkitty on YouTube, he predicted this over a year ago and realized the company was undervalued in the fundamentals.",
            "score": 226,
            "author": "xens999",
            "replies": [
                {
                    "level": 1,
                    "comment": "He's u/deepfuckingvalue so you know he's legit",
                    "score": 224,
                    "author": "chickthief"
                },
                {
                    "level": 1,
                    "comment": "IIRC Roaringkitty is u/DeepFuckingValue, the guy who initially yolo'd a shit ton of money into $GME, was getting shat on for a year, and now must be laughing in multimillionaire- and this has only just begun.",
                    "score": 255,
                    "author": "Important_Ad_8342",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;and now must be laughing in multimillionaire\n\nyeah last week he was up over $7 million",
                            "score": 132,
                            "author": "modsarestr8garbage",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Probably $10+ million if he’s still holding now",
                                    "score": 99,
                                    "author": "_rchr",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "He 100% is still holding. He posts every few days with his update.",
                                            "score": 91,
                                            "author": "amateurstatsgeek",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Just posted 35 minutes ago....",
                                                    "score": 36,
                                                    "author": "btroberts011",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "He's still in.\n\n3.3M in one day.\n\nWhat a fucking god.",
                                                            "score": 79,
                                                            "author": "amateurstatsgeek",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Yup, he just posted and has $11m+ now",
                                            "score": 17,
                                            "author": "LayfonGrendan"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Millionaire x7 as of last week. He had calls expiring in April - pretty sure he passed the 10x millionaire point a hour ago.",
                            "score": 48,
                            "author": "txmail",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What does the price halt mean? Is it an algo that steps in and says too much too fast, no more trading?",
            "score": 38,
            "author": "Once_a_Fool",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; Is it an algo that steps in and says too much too fast, no more trading?\n\nExactly right, it's called LULD, limit up, limit down. It's supposed to give a little thinking time for runaway events like this.",
                    "score": 51,
                    "author": "ShaidarHaran2"
                },
                {
                    "level": 1,
                    "comment": "SEC halts stocks on volatility. If they gain 10% or more in 10 minutes or less the stock is halted for another 10 minute period. GameStop was froze once today that I know of at 72.38 and some have said more than that. It’s basically a measure for the markets to agree on a price; when millions and millions of trades are executing the markets have a hard time keeping up on what the actual value of the equity is so it’s a safety measure to allow the market to figure its shit out and prevent market manipulation. It’s also kind of a remnant of the old days when quotations and trades weren’t instant, and 10% movements happening that fast could mess with investors.",
                    "score": 13,
                    "author": "MasterChief8430",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Can someone explain this to me one more time? \nCitron was suppose to release a video on why you should sell the stock, in turn massive amounts of people bought the stock to short it. \n\nAm I missing anything else.",
            "score": 97,
            "author": "Swift_Ira7",
            "replies": [
                {
                    "level": 1,
                    "comment": "The livestream about selling the stock was cancelled",
                    "score": 69,
                    "author": "3kans",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He did eventually post a video though. It wasn't very convincing. It had a very desperate air to it. In my mind, him taking the time to sit and make a video on why we shouldn't hold onto the stock, while he is holding as massive short position seems like total BS. Like of course guy who can benefit from people selling the stock and drivign down the price wants people to sell the stock and drive down the price.",
                            "score": 126,
                            "author": "YeahWhatOk",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "It was the most pathetic thing I'd ever seen out of someone who's a supposed professional doing a job for decades.\n\n1. He remembered, in a typo ridden tweet, that the inauguration was that day so he postponed it for a day. Who the fuck forgets inauguration day? It's not like it happens the same day every 4 years and it's not like this wasn't covered extensively, even more than previous inaugurations.\n2. The next day he tries again. He can't get it going. Tweets about \"technical issues.\" Then he claims he's being *hacked*. Come on, man. No one's hacking your goddamn Twitter. \n3. Eventually he just records and uploads the video. Most of it is dishonest or incorrect.\n\nIt was a shitshow from the start. I was a little worried at first because I've seen his stuff before and usually it makes a few good points. His GME one was garbage and clearly other people agreed. Share price didn't even blink. If anything, the complete lack of a solid bear case intensified the bull case.",
                            "score": 62,
                            "author": "amateurstatsgeek",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah this seemed like a definite “fuck you” to citron after that lackluster attempt at getting us to sell",
                                    "score": 14,
                                    "author": "3kans"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I just sold my 1 share of gme that Robinhood gave me when I signed up... Thanks wsb",
            "score": 84,
            "author": "jvn0510",
            "replies": [
                {
                    "level": 1,
                    "comment": "literally free money",
                    "score": 48,
                    "author": "SeeMontgomeryBurns"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I didn’t buy any and should have this sucks",
            "score": 252,
            "author": "Spirited_Assignment2",
            "replies": [
                {
                    "level": 1,
                    "comment": "Buy it right now. Shorts still have a long way to go",
                    "score": 179,
                    "author": "ef_jay",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yep. Short interest barely dropped.",
                            "score": 106,
                            "author": "chickthief",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Where's the best place to see short interest?",
                                    "score": 61,
                                    "author": "Piccolo_Alone",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Idk but there were more shorts than shares available before today, even if every single sale today was a short seller covering there are still prob more shorts than shares available",
                                            "score": 19,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "For sure. It's literally impossible for them all to have covered. Not even close.",
                                                    "score": 17,
                                                    "author": "Piccolo_Alone",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "yeah this thing is going to rip for a long fucking time. Mainly because the WSB freaks are doing this out of principle and literally wont be selling until it hits 1000. Myself included.",
                    "score": 109,
                    "author": "mightyduck19",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I wish this were true but I lost a lot of faith when as GME dropped BB spiked.  It was an easy play against two WSB hype trains.  Lots of talk but plenty of signs that a lot of those guys are quick to get out.  I hope I get to be a part of a $420.69 (and then $694.20) sell wall destruction on the way to Pluto.",
                            "score": 11,
                            "author": "MattCWAY",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The squeeze hasn't even began, strap in for $100 boys",
            "score": 28,
            "author": "RGBdragon",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Every serious investor knows Shitron's Andrew Left is, at best, a hack alarmist, barely able to put together a two-pager without extensive spelling and grammar mistakes. \n\nThis is the guy that called $SHOP a ponzi scheme at $146/share back in October 2017.\n\nAt this point, inversing his claimed positions is probably really profitable.",
            "score": 48,
            "author": "overwhelm21",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I don’t know anything about GME other than a few games I bought there a decade ago. But I do know about Citroen research. Long long time ago, I was invested in a company called EBIX. I did a lot of research and bought in and was sitting on a 10% or so gain. One afternoon I saw it crashing on CNBC and had no idea why. Took me hours to find out this BS Citeron research piece. I had to sell, lost money and the stock took a long time to recover. The piece they published was BS but I couldn’t do anything about it. \n\nSo in a strange way, I feel good about them being embarrassed.",
            "score": 23,
            "author": "Tylerdurden0823",
            "replies": [
                {
                    "level": 1,
                    "comment": "Market manipulators pure and simple",
                    "score": 18,
                    "author": "ItsReallyEasy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I literally was gonna buy game stop when it was at 2$ but I realized it would be a penny stock because there isn’t a need for physical games anymore. Boy do I feel stupid",
            "score": 75,
            "author": "Cooper-N",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's ok. Buy BB and you won't feel so bad in 6 months",
                    "score": 47,
                    "author": "ef_jay",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Who decides these stocks? Why not pick something cooler like $CMPS or other stocks I own?",
                            "score": 7,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "just to let you know BB is the next momentum stock for wsb",
            "score": 203,
            "author": "Agh1_00",
            "replies": [
                {
                    "level": 1,
                    "comment": "Also, ICLN is good for all weather.  Rain, snow, sun.  She floats.  She gives good returns.  Don’t treat her like a slut, please.",
                    "score": 39,
                    "author": "TylerDurden6969"
                },
                {
                    "level": 1,
                    "comment": "shhh ;)",
                    "score": 89,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "ah yes because it's such a kept secret",
                            "score": 106,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "How far out are we looking at this one?",
                            "score": 21,
                            "author": "gnarwhale471",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "And I would have gotten away with it if it weren't for those meddling kids\n\n- Andrew Left",
            "score": 40,
            "author": "mistressbitcoin",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I’ve had GME since 17... the squeeze isn’t over.",
            "score": 16,
            "author": "tumes1",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Michael Burry still long this? He made a killing if so.",
            "score": 17,
            "author": "chullet",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 14,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is the beginning. Shorts have to purchase roughly 100million shares to cover",
                    "score": 53,
                    "author": "Gamerofnhl",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ahhh I kinda get the concept of short squeeze now. So if there are no shares left in the market what will they do?",
                            "score": 8,
                            "author": "Lordie92",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "To my understanding,  the price will be continually bid up until more shares become liquid.",
                                    "score": 26,
                                    "author": "Methylxanthine_Fiend"
                                },
                                {
                                    "level": 3,
                                    "comment": "They keep buying any shares that pop up at higher bids to make sure they get them - it is what drives the price up.",
                                    "score": 13,
                                    "author": "txmail",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Bleed money and go bankrupt. Nobody serious is selling until at least 400$ a share",
                                    "score": 15,
                                    "author": "Gamerofnhl"
                                },
                                {
                                    "level": 3,
                                    "comment": "It's a mathematical manifestation of supply and demand. When there's no supply, but they NEED the share (and a lot of it), the price skyrockets.",
                                    "score": 7,
                                    "author": "Breakfast_Eater"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I dont pull out. As I said above. WSB literally wont be selling this until it hits 420 and then 696.9 and then 1000. \n\nThis is really a great case study in supply/demand dynamics in markets and how market structure/technicals are really the ONLY thing that matters. Fundamentals are a derivative of price movement.",
                    "score": 24,
                    "author": "mightyduck19",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Gamestop pulled a Tesla?  The stock market's just one big meme these days....",
            "score": 13,
            "author": "upL8N8"
        },
        {
            "level": 0,
            "comment": "Ngl a lot of you who fully believe in GameStops future sound like paid advertisement.  You guys could be accurate and all, but last time I heard \"this is game changing\" on a dying (or was dying) company was moviepass.",
            "score": 34,
            "author": "jackswhatshesaid",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 10,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Absolutely",
                    "score": 7,
                    "author": "G3nu1n3Hawk",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ok so I completely missed the boat and got very busy the last couple months. What changed from GameStop being a sinking ship, closing down locations, to blowing up 1000% in a month? Please",
            "score": 10,
            "author": "Cudi_buddy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Too many people shorted the stock and now they have to buy shares to complete and close their option.  So the price is getting driven up even though the company is still in bad shape.  This price jump is a temporary thing, but may last days or weeks or months.",
                    "score": 11,
                    "author": "red359"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I woke up this morning and couldn't hear. Thought I was having an ear infection.\n\nNo, it's just the sound of the ***MONEY PRINTER*** blowing out my eardrums.\n\nTO THE MOON!\n\n(Insert rocket emoji here)",
            "score": 56,
            "author": "Important_Ad_8342",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Short interest still above 100%. Squeeze has yet to happen.",
            "score": 9,
            "author": "idkyou1"
        },
        {
            "level": 0,
            "comment": "Absolutely agree.  I can't possibly fucking imagine that Citron hasn't been investigated already.  They DIRECTLY manipulate stocks.  It's fucking insane!",
            "score": 17,
            "author": "tomee638",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Anyone who says dot com was crazier is officially wrong",
            "score": 108,
            "author": "ilai_reddead",
            "replies": [
                {
                    "level": 1,
                    "comment": "this is not a crazy valuation story. It's a potential short squeeze.",
                    "score": 133,
                    "author": "olli_bombastico",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I dont think today was a squeeze, it started that way but now its just fomo into the extreme, most short squeezes are not like this",
                            "score": 43,
                            "author": "ilai_reddead",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It has 120% short interest it’s an over exposure on the shorts. The banks are calling in their leveraged positions.",
                                    "score": 49,
                                    "author": "Hank-TheSpank-Hill",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thanks r/Wallstreetbets for the win.  I bought GME back in 2017 before it tanked.  Lost so much it wasn't worth selling.  Dumped it 2 weeks ago for a face saving profit.",
            "score": 36,
            "author": "Gildenstern45",
            "replies": [
                {
                    "level": 1,
                    "comment": "Too bad you dumped two weeks ago",
                    "score": 58,
                    "author": "SenatorAstronomer"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Citron has been wrong so many times on some major winners, how is it still relevant?!?",
            "score": 8,
            "author": "chubky",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Just one correction. There has been no short squeeze on this stock yet. Not only has the number of shares available to short decreased, but the rate at which you have to pay was raised from 45% (after sitting at 20% for weeks) to 100%!!!!\n\nI've seen some DD claiming a gamma squeeze which looks most likely to me for the halted trading run up. There were almost 15,000, $40 puts that expired yesterday. I was watching the price of those Puts, and on Thursday they were trading at like $2.3 a pop, but by Friday morning, even though the stock was green on a red day, the puts had barely moved in price. THATS CUZ NOBODY WAS DUMB ENOUGH TO BUY THEM!!! As the stock slowly crept up and long buying countered any other available short positions, the puts were moving super low volume. At the point of the gamma squeeze, the puts simply went to worthless, they weren't gonna print and the shares had to be returned.\n\nExpiring puts = rocket fuel",
            "score": 7,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I don't even think that was the short squeeze. IMO there's still probably 50 million shorts out there",
            "score": 29,
            "author": "YoungGucci66",
            "replies": [
                {
                    "level": 1,
                    "comment": "GME has like 138% short interesting. it's the highest right now. Second is SPCE at 81.53% short interest. Even though i didn't make any money from the squeeze, I am glad Citron got fucked hard over it.",
                    "score": 6,
                    "author": "Getrekt11",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I bought and sold today with 100$ profit. I'll go on down to small street bets now",
            "score": 29,
            "author": "JohnnyNobody66",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 40,
            "author": "[deleted]",
            "replies": []
        }
    ]
}