{
    "id": "lgu4bx",
    "score": 4182,
    "title": "Nasdaq, NYSE Sue SEC over planned overhaul of public data feeds",
    "author": "DeprivedLondorian",
    "date": 1612965388.0,
    "url": "https://www.reddit.com/r/investing/comments/lgu4bx",
    "media_urls": [],
    "other_urls": [
        "https://www.reuters.com/article/us-sec-lawsuit-nyse-nasdaq-idUSKBN2AA09P](https://www.reuters.com/article/us-sec-lawsuit-nyse-nasdaq-idUSKBN2AA09P)"
    ],
    "postText": "source: [https://www.reuters.com/article/us-sec-lawsuit-nyse-nasdaq-idUSKBN2AA09P](https://www.reuters.com/article/us-sec-lawsuit-nyse-nasdaq-idUSKBN2AA09P)\n\nThis article is short and doesn't elaborate much on what the effects of giving public access to supply and demand data are. Sueing the SEC seems like another way to stifle access to information for retail investors disguised as a means to protect them.\n\nI have a lot of bias right now against institutional entities and I'm interested in what people have to say about this and whether or not this is more sensational news for clicks. I couldn't find a source with specifics about what the SECs overhaul would look like so I'm torn on how I feel about this.\n\nEdit: For those seeking further context, look through some of the great discussions in the comments!",
    "comments": [
        {
            "level": 0,
            "comment": "**Hi, welcome to /r/investing. Please note that as a topic focused subreddit we have higher posting standards than much of Reddit:**\n\n**1)** Please direct all **advice requests and beginner questions to the stickied daily threads.** This includes beginner questions and portfolio help.\n\n**2) Important: We have strict political posting guidelines** (described [here](https://www.reddit.com/r/investing/comments/cyee69/formal_posting_guidelines_for_political_topics/) and [here](https://www.reddit.com/r/investing/comments/escewo/temporary_rule_change_what_happens_to_stocks_if/)). Violations will result in a likely 60 day ban upon **first instance.**\n\n**3)** This is an open forum but we expect you to conduct yourself like an adult. Disagree, argue, criticize, but **no personal attacks.**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/investing) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "The only reason the exchanges do this is because it hurts their bottom line. They make good money selling this data to HFTs and the like.\n\nI'm not entire sure what data would become publicly available, but I assume it's level 2 data or something alike.\n\n The \"overly complex and more expensive\" line seems like bs to me. Sure, some people might not know what they'd be looking at, but that's already the case now with a lot of available data (have you seen the language they use in sec filings?). \n\nAnd how it would increase cost is beyond me, unless the exchanges themselves inceare prices for basic data (so this is just a red herring).\n\nBut would also love other's input as I'm not a market specialist by any means.",
            "score": 1128,
            "author": "zokjes",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, I wish I could find more specific information about what the SEC wants to change because when the verbiage gets ambiguous, I can't tell if it's for legal reasons or a lack of reasonable explanation.\n\nGood point though, I forgot about those paid premium services. Follow the money and all that",
                    "score": 199,
                    "author": "DeprivedLondorian",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They want to make Level II data publicly available. It’s used by some quants and large brokers but isn’t used or even bought by most places on the street.",
                            "score": 115,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "According to the wsj article, level 2 data accounts for over $100mm in revenue",
                                    "score": 45,
                                    "author": "marchian",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "So, pennies. Yearly or monthly haha, a drop in the bucket",
                                            "score": 21,
                                            "author": "wordsmatteror_w_e"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Is that on webull? I'm pretty sure anyone can pay for this.",
                                    "score": 14,
                                    "author": "moo_vagina",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "its part of my TD acct.",
                                            "score": 16,
                                            "author": "Wireman00",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Do you have to pay for it?",
                                                    "score": 6,
                                                    "author": "moo_vagina",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "No",
                                                            "score": 10,
                                                            "author": "Wireman00",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Damn bro that is fucking sweet.",
                                                                    "score": 6,
                                                                    "author": "moo_vagina"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I think is on Fidelity's Active Trader Pro as well.",
                                                    "score": 3,
                                                    "author": "rock_accord"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "This would be amazing for leveling the playing field of retail investors...\n\nStill need depth of book, but this is a start",
                                    "score": 12,
                                    "author": "TomahawkChopped",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Is level 2 not depth of book?\n\nI saw it as level one is best bid/ask. Level 2 is depth",
                                            "score": 13,
                                            "author": "Aeon-ChuX",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "What is 'depth of book'?",
                                                    "score": 2,
                                                    "author": "Semitar1",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Regarding the Order Book. Meaning at any time for a single security you and I can see the bid and ask price, and the last trade.\n\nDepth of book is a series of different prices and volumes people are willing to pay.\n\nEx. I want to sell 200 apples, I see the Bid price someone is willing to buy from me as $50. \nThat could be misleading. If I see the order book/depth of book I would notice someone is willing to buy 2 shares at 50, then the next person is willing to buy 98 shares at $48, then the next person has a bid at $40 for 200 shares.\n\nMeaning I end up selling my shares at around $45 instead of the $50 I thought.\n\nIt is also how at one moment someone bought GME at over $1000\n\nThey said something like \"buy the 500 cheapest shares in the market\" but there were 300 at $400 and the next one's were $1000 (I'm imagining here)\n\nWhich is why you should put a price limit when entering an order",
                                                            "score": 3,
                                                            "author": "Aeon-ChuX",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Wow, I wasn't aware that someone bought GME for $1,000. I do place limits, but that is good to know about the depth of book. It sounds like this is a pay service. Do you know if depth of book is a standard term? Meaning, if I asked my broker for it, would they know what service I am inquiring about?",
                                                                    "score": 1,
                                                                    "author": "Semitar1"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "This is virtue signaling by the SEC, of all the data some firms pay for this is probably the least useful for retail investors",
                                            "score": 14,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 14,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "When it comes to government, he who pays them the most is king.",
                                                            "score": 3,
                                                            "author": "buddychrist_dogma"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "The proposal is to add depth of book (6 total limits, not full depth).",
                                            "score": 1,
                                            "author": "trashgordon2000"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "TD already has level II for customers. It's totally useless to a retail investor. Technically you could only send your trade to one exchange, but a market orders already tries to fill at the lowest listed exchange, and limit orders will get you the price you want regardless. It's only useful for high speed algorithmic trading as far as I can tell. \n\nMaybe there are trading strategies from it, but I don't know of any.",
                                    "score": 4,
                                    "author": "dancode",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Level 2 data is absolutely not useless. You get an idea of where walls are, where shorts are setting up, etc. There's a ton of useful data there.",
                                            "score": 24,
                                            "author": "miscellaneous-bs"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "It can give you an idea of how much resistance a certain price would have. Imagine looking at GME and seeing that 1 million shares are set to sell at say $450. You could probably say hey, maybe I'll sell at $445 instead where there are less trades set to fill and I will get filled first instead of fighting the mob for $5",
                                            "score": 13,
                                            "author": "3yearstraveling",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Exactly. I put $100 into messing with penny stocks and the first one I picked went up 50% in a week so I was looking to sell. Level 2 data showed a massive sell order at $2.15 so I decided to limit sell for $2.14. Had a good feeling it'd bounce back up to there, but probably not past the massive sell.\n\nGuess what the high was for the rest of the day after I placed that order? That's right. $2.14",
                                                    "score": 10,
                                                    "author": "catechizer",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Do you have any resources to where someone dumb, such as myself, could comprehend/learn about the things you just said?",
                                                            "score": 2,
                                                            "author": "nitrousconsumed",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 20,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah, I guess I stand corrected. Algo trading could open up more to retail.",
                                                    "score": 5,
                                                    "author": "dancode"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "My limited monkey brain understanding is that it's useful for small cap stocks. If you're trying to sell a bunch of shares but aren't able to offload them because so little is trading, one could get stuck with the shares not selling, or eventually selling for less.",
                                            "score": 2,
                                            "author": "rock_accord"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "\"Only useful for high speed algorithmic trading\" just means \"competition\", in this case, it seems. If retail investors had access to this, then we could write our own trading algorithms, which would disrupt their SOP just like the recent retail boom has disrupted their SOP. \n\n\nThey don't want to work more than they already do, which is entirely relatable, but thats just the game of life, we all push and pull each other forward as a society. Some just kick and scream louder.",
                                            "score": 2,
                                            "author": "PM_UR_FRUIT_GARNISH"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Could they be referring to the demand data that is used by high freq traders to front run orders placed by retail investors? shoutout to michael lewis's flash boys book on this topic, was a good read",
                            "score": 61,
                            "author": "cruxymirth",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "As a guy who actually work in HFT flash boys is purely a fiction book - try something like *Real-Time Risk: What Investors Should Know About FinTech, High-Frequency Trading, and Flash Crashes* instead",
                                    "score": 21,
                                    "author": "anon_502",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 1,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 23,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 14,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Robinhood paid a $65M fine for lying about doing this  \n[TechCrunch: Robinhood pays $65M to settle SEC charges for past Inferior Pricing Execution](https://techcrunch.com/2020/12/17/robinhood-pays-65m-to-settle-sec-charges-for-past-inferior-pricing-execution-misleading-customers/)",
                                                    "score": 11,
                                                    "author": "mildly_enthusiastic"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 1,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Your submission has been automatically removed because the URL matches one on the /r/Investing banlist due to low quality content. If you believe the article you are trying to link is high quality content please [message the moderators](http://www.reddit.com/message/compose?to=%2Fr%2FInvesting) with a short message so that we may approve your submission. Please be aware that if your post can be sourced from a less sensationalist publication we will likely require you to do that.  Thank you.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/investing) if you have any questions or concerns.*",
                                                    "score": 2,
                                                    "author": "AutoModerator"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Is there a downside if you just do limit orders though?",
                                            "score": 1,
                                            "author": "m1a2c2kali",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "We need real time short interest reports. With today's tech, there's no excuse not to make that available. The hedge funds have that data and screw the little guy over with it regularly. Level the damn playing field.",
                            "score": 4,
                            "author": "happysheeple3"
                        },
                        {
                            "level": 2,
                            "comment": "you can find the SEC proposal here:\n\n[https://www.sec.gov/rules/proposed/2020/34-88216.pdf](https://www.sec.gov/rules/proposed/2020/34-88216.pdf)",
                            "score": 1,
                            "author": "mochajave"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Any time you see \"this is too complex\" in regards to something like this should be a red flag. It means one of two things. Either they're profiting off the public not having his knowledge or they're doing something that will outrage the general public. The idea that people are generally expected to push money into the market/economy, perform all the work to drive said economy, and elect the officials to govern but giving them access to data would be \"too confusing\" should immediately be met with legislative calls of \"bullshit\".",
                    "score": 94,
                    "author": "oupablo"
                },
                {
                    "level": 1,
                    "comment": "The “increase cost” portion of it likely relates to broker fees.  Currently Robinhood, E*Trade, et al, can offer “free” trades because you as the user are the product.  They are selling your trades and general user data to HFTs so that you are put at an immediate disadvantage.  If all of that data become publicly available then there would be no source of income from the HFTs and therefore trade commissions would return to these brokers.\n\nIt’s all a bunch of bullshit.  These “free” brokers are screwing their users.  They offer worse pricing on every trade and by selling the user data and order flow they are giving the hedge funds the ability to always optimize their own profits.  Paying commission fees with a broker that doesn’t sell order flow is significantly cheaper in the long run.",
                    "score": 93,
                    "author": "MapleYamCakes",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Having HFTs bid for your order is a good thing. It's when the broker keeps rebates (or ignores NBBO illegally in the case of rh) that it becomes a bad thing. Retail order flow is more valuable than institutional (partly because they're less informed and the MM is like likely to be on the wrong side of the trade). Market makers and hedge funds are two different things but the MM is providing a service to both sides by creating liquidity.\n\nDoes there need to be rules and regulations to protect retail investors? Yes. Are HFTs universally bad? Absolutely not. Is PFOF bad? Only if your broker isn't giving rebates to you and improving your pricing. Hard for me to see any issues when I place a marketable order and it clears for better than bid/ask midpoint.",
                            "score": 24,
                            "author": "SnacksOnSeedCorn",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "And what's stopping the brokers from selling data AND charging a commission to \"make up the loss\"? What was stopping them from selling the data before free trades became a thing?\n\nIt all just stinks. This is why people are turning to decentralized finance",
                            "score": 66,
                            "author": "McMarbles",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Robinhood offering 0 commissions forced other brokers' to also offer 0 commissions.  I don't think they can start charging for commissions again because people would just move to another 0 commission broker.",
                                    "score": 29,
                                    "author": "Tony0x01",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 16,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Sorry noob question, what are order flows? And why does access to them help?",
                                                    "score": 4,
                                                    "author": "weekendsarelame",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 15,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "/u/Gareth321 in your opinion, how much trading would justify paying the $10? Like how much activity? Trying to determine at what point the $10/mo ultimately pays for itself. I understand that this might be more subjective than I want it to be, but I don't mind paying if the value is there. I've started actively watching and trading several times a month now.",
                                                                    "score": 3,
                                                                    "author": "Semitar1",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "If I had to provide a rough estimate I'd say the equivalent of $1,000+ worth of trades each month. Poor order flow can *easily* end up with a 1% penalty. That includes just buying and holding stocks. I'm biased but I think everyone should be investing at least $1,000 each month.",
                                                                            "score": 2,
                                                                            "author": "Gareth321",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "/u/Gareth321 thanks for this information. I definitely do that amount.\n\nSo getting the best pricing is called getting the best order flow? \n\nAnd if so, I would get this if I had IBKR Pro, correct?\n\nI just want to make sure I understand this because today I did a limit buy and I was able to buy it for less than my limit. If I am understanding you correctly, I could have still gotten it cheaper than that though, right?",
                                                                                    "score": 2,
                                                                                    "author": "Semitar1",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Thank you.  Now I understand how Etrade make money.",
                                                                    "score": 2,
                                                                    "author": "ManalapanV"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "&gt; They route your order to a trading firm which sees the 10c delta, and scalps you. They buy the stock then sell it to you, all in the blink of an eye. I mean, technically you got the stock at the price you were willing to pay, right? What’s the harm?\n\nAre you sure about this? Brokers are still binded by reg NMS, and this is a clear violation of that. submitting a bid above the lowest ask is essentially a market order, and by not giving you the best NBBO price they are operating illegally.",
                                                                    "score": 1,
                                                                    "author": "FutureGT",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Does the paid version offer better access than IBKR lite?",
                                                    "score": 3,
                                                    "author": "Tony0x01",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yes, IBKR Pro has better execution.  If you're not trading a lot it's probably not worth it though.",
                                                            "score": 6,
                                                            "author": "snark42"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Yep, and there’s no monthly account fee on their Pro accounts if you have at least $100,000.",
                                                    "score": 5,
                                                    "author": "Meymo"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "is that the one whose ceo went on TV and said he wouldn't let people buy GME until it went back to 17 dollars because he thinks the stock is worth 17 dollars?  You couldn't pay me to pay that guy.",
                                                    "score": 5,
                                                    "author": "lotsofsyrup",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yes. Really shook my confidence. Still the best game in town but now I’m actively looking for alternatives.",
                                                            "score": 5,
                                                            "author": "Gareth321"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "They've been the cheapest/best game in town for years for the \"pro\" traders. Those comments and limiting GME for a day was very unfortunate though, and when I find someplace to trade FX, CSE, TSX and NEO at a reasonable price I'll probably move.",
                                                            "score": 6,
                                                            "author": "snark42"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Entering into a fiduciary relationship with an ACTUAL broker legally obligates the broker to always execute the best price for his client. That means concealing the transaction until AFTER it is completed. Otherwise they can get sued, fined, or jailed.",
                                    "score": 20,
                                    "author": "Monarc73",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 1,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Hi Redditor, it would seem you have strayed too far from WSB, there are too many emojis detected. Try making a comment with no emoji at all.  Have a great day! \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/investing) if you have any questions or concerns.*",
                                                    "score": 5,
                                                    "author": "AutoModerator"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "These discount brokerages can survive on interest alone. [In 2019, 67% of E*Trade's revenue came from interest.](https://www.kalzumeus.com/2019/6/26/how-brokerages-make-money)\n\nA freemium business model would still be very profitable. Earn interest on people's cash and sell a premium subscription.",
                            "score": 11,
                            "author": "notmymiddlename"
                        },
                        {
                            "level": 2,
                            "comment": "&gt; Paying commission fees with a broker that doesn’t sell order flow is significantly cheaper in the long run.\n\nHow much is a the cheapest commission that a client needs to pay?",
                            "score": 6,
                            "author": "Coz131",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "For most users it is definitely cheaper to have commission free trading.",
                                            "score": 2,
                                            "author": "Coz131",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 2,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I also think it democratize finance for people. We don't tell people they can't go to casinos or bet sports so why are we stopping them on high risk trades.",
                                                            "score": 1,
                                                            "author": "Coz131"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt; Paying commission fees with a broker that doesn’t sell order flow is significantly cheaper in the long run.\n\nThis is not true.",
                            "score": 6,
                            "author": "Luph",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I think brokers make money from 2 primary sources now: selling order flow and interest from users' cash.",
                            "score": 5,
                            "author": "Tony0x01",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And lending out your stocks for a fee to shorters",
                                    "score": 5,
                                    "author": "FutureCo"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "My brokerage now offers free trades (TD Ameritrade) and I can route my orders for execution however I want. Of course, it's still possible that they can sell my order to the HFT firms so they can front-run me, but who cares if I'm setting the price I want?\n\nPeople who place market orders are always at the mercy of front-runners.",
                            "score": 4,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Fidelity does this too and they offer price improvements. Over the Year I can see how much I’ve saved.",
                                    "score": 3,
                                    "author": "Comprehensive_War600"
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt; I can route my orders for execution however I want.\n\nWhat are you options for routing to trade GME?",
                                    "score": 2,
                                    "author": "snark42"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "how to learn if ur broker sells ur information and is there a website that compairs spreads?",
                            "score": 2,
                            "author": "WhitePonyWalker"
                        },
                        {
                            "level": 2,
                            "comment": "I would actually like to hear more about this. Who would you recommend for a broker then?",
                            "score": 1,
                            "author": "Comprehensive_War600"
                        },
                        {
                            "level": 2,
                            "comment": "this isn't the data that's being added, it's the depth of book data which all the hft and broker-dealers already have from exchange feeds.",
                            "score": 1,
                            "author": "trashgordon2000"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt; overly complex and more expensive \n\nI'm honestly sick of them talking to and treating us like we are some little kids. It's like this ruling class mentality these people have.",
                    "score": 29,
                    "author": "1BigUniverse"
                },
                {
                    "level": 1,
                    "comment": "Lol it's parentification, protect the unsophisticated barbarians. There are so many avenues to learn, it may be complex, they could hold some water. But how did they learn? Through learning. Uhhh oooo oooo ah ah",
                    "score": 11,
                    "author": "nonetheless156",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Reminds me of a politican's argument that ranked choice shouldn't be implemented because it's too complicated for PoC to use or something similar. It's just the bigotry of low expectations, but it's class instead of race here.",
                            "score": 7,
                            "author": "teamsprocket",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I feel like an easy compromise is requiring the data to be available for free, but on a small delay like 15 seconds. 4 updates per minute, cached, publicly available... that wont increase cost on their API (meaningfully), but still allows them to upsell for a subscription (for that &lt;1ms data)",
                    "score": 6,
                    "author": "tehnoodles"
                },
                {
                    "level": 1,
                    "comment": "No, it's just to \"complex\" and would hurt our tiny monkey brains. It's for the best.",
                    "score": 6,
                    "author": "subparreddit"
                },
                {
                    "level": 1,
                    "comment": "They use the data in their algorithm bots that bid down the price, penny by penny.",
                    "score": 6,
                    "author": "wishlist212"
                },
                {
                    "level": 1,
                    "comment": "I recall ten years ago when I joined an investment firm. Public feeds, ie searching google, was all 15 minute delay. You had to pay Six Financial or bloomberg or something for an up to date feed. So this is absolutely just another card they are holding to their chest in the name of profit making. Can't blame them, but would be nice to have free data.",
                    "score": 3,
                    "author": "coopsta133"
                },
                {
                    "level": 1,
                    "comment": "HFT won't be impacted, they're already paying hundreds of millions to have servers in the stock exchanges basement to send their trades in first after getting the data",
                    "score": 1,
                    "author": "xsvfan"
                },
                {
                    "level": 1,
                    "comment": "They offer it free in webull for new users",
                    "score": 1,
                    "author": "mccabe81"
                },
                {
                    "level": 1,
                    "comment": "Fuck them make them do business intelligence on that shit if they want to sell something",
                    "score": 1,
                    "author": "hypercube33"
                },
                {
                    "level": 1,
                    "comment": "\\&gt; supply and demand data for stocks would be added to public feeds",
                    "score": 1,
                    "author": "mintaka5"
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;“Nasdaq believes the SEC exceeded its authority by adopting an ill-considered remake of market structure,” a Nasdaq spokeswoman said in an emailed statement. The plan “would make equity markets overly complex and increase hidden costs for investors”, the statement said.\n\nAwww, me too stupid to understand supply and demand? :(\n\nFuck these clowns. They're taking fees upon fees as it is. Investors DESERVE transparency and access to information like this without paying some huckster $300/mo for some bullshit data feed",
            "score": 497,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "That has been a consistent line in the market news lately that individual traders/investors are too stupid for their own good. It's super annoying that on one side they'll say you need to take charge of your financial future by investing/trading and then on the other pretend that they need coddle people so that they dont lose their money. I guess we're all idiots no matter what!",
                    "score": 253,
                    "author": "DeprivedLondorian",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And why the fuck is gambling legal if us dummies need \"protection?\"",
                            "score": 113,
                            "author": "Norvannagh",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 36,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;state-ran \n\n\nThere's your answer.",
                                            "score": 28,
                                            "author": "officalSHEB"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "The state can reduce the budget for education so that poor people can basically \"gofundme\" it throught the lottery and then the state transferred that part of the budget it would have had for their own pensions. Originally the lottery was supposed to supplement the budget for schools not replace it. Government bureaucrats gonna bureaucrat.",
                                            "score": 8,
                                            "author": "impulsikk"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "What they mean is that we should pay them to do investing on our behalves. They want to get as much money as possible in their positions and take their expense ratio cut from our hard-earned money, which they get whether they invest well or not.",
                            "score": 28,
                            "author": "fluffynukeit"
                        },
                        {
                            "level": 2,
                            "comment": "Let people make their own decisions and learn from their own mistakes. The people who don’t know or don’t care to learn will still be going to theses financial managers. It’s 100% only because they will lose money. They don’t actually care about retail investors. What a joke.",
                            "score": 13,
                            "author": "gcko"
                        },
                        {
                            "level": 2,
                            "comment": "During the GME saga, the Nasdaq CEO also said they'd consider halting trading if a similar situation happened in the future. They certainly don't have retail investors' best interests in mind.",
                            "score": 7,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "even a commenter here said that free trading apps shouldn’t exist cause it increases volatility in the market or something. as if we’re too stupid for our own good.\n\nfuck that. so what if we cause volatility in the market, it’s supposed to be a free (lol) and open market, it’s ours and we should be able to make our own decisions, not just the hedge funds. if it’s only for the elites and the way they do (read: manipulate) things, then it’s not really a free market is it.",
                                    "score": 3,
                                    "author": "milchtea"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Increase hidden costs? Why even have hidden costs?!",
                    "score": 13,
                    "author": "WanderingKing"
                },
                {
                    "level": 1,
                    "comment": "Who aggregates this data? I feel like information should be freely available to all who desire it, but I find myself curious about who's collecting and making it consumable upstream.",
                    "score": 8,
                    "author": "LibraryAtNight",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Market makers collect it because by law they are required to, but they also sell whatever data they feel like for profit.",
                            "score": 8,
                            "author": "kismethavok"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Lol how many times I have seen the same theme, poors too stupid, poors don't know this complex stuff, leave it to the \"professionals\"",
                    "score": 2,
                    "author": "SpicyBagholder",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "it’s already stupid that you need to have money to make money. at the very least, give us transparency.",
                    "score": 1,
                    "author": "milchtea"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If Wall Street is against something, then it must mean something good for others but them.",
            "score": 344,
            "author": "waitmyhonor",
            "replies": [
                {
                    "level": 1,
                    "comment": "No this definitely good for Wall Street too. But not good for select groups so they are suing.",
                    "score": 11,
                    "author": "utalkin_tome"
                },
                {
                    "level": 1,
                    "comment": "It's not Wallstreet that stands to loose from this. Anyone who is a day trader already pays for a datafeed. They already have access to this data. They aren't supper expensive. \n\nStock exchanges make their money off selling data feeds. ECN fees are very low. Commission goes to the broker not the stock exchange. Saying the data must be provided for free means stock exchanges loose a revenue stream.\n\n\nWhile this would help the small retail trader save some money it won't do much for the long term investor where up to the minute market data isn't super relevant. In fact it might hurt the retail investor as ECN fees would likely increase substantially to make up for loss of revenue.",
                    "score": 7,
                    "author": "PoliticalDissidents"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not a lot of information to go on there.  I'm with you in being all for transparency; I'm afraid the side effect may be that it increases the \"processes\" that exchanges have to do to disclose the information and it will result in higher execution fees though.\n\nIf they don't get you one way, they'll get you another....",
            "score": 127,
            "author": "Sinkit53563",
            "replies": [
                {
                    "level": 1,
                    "comment": "Too true on the last line there haha",
                    "score": 24,
                    "author": "DeprivedLondorian"
                },
                {
                    "level": 1,
                    "comment": "which is why we need competition in the market. NYSE isn’t the only exchange in the world",
                    "score": 37,
                    "author": "TheApricotCavalier",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Supposedly that's one of the \"great parts\" of capitalism - an open market.  I'd be surprised if we saw it come to fruition any time soon though.",
                            "score": 40,
                            "author": "Sinkit53563"
                        },
                        {
                            "level": 2,
                            "comment": "RegNMS causes your order to be routed to whatever exchange offers the best price, so it's not like you really get to choose which one you're trading on.",
                            "score": 10,
                            "author": "Kyo91"
                        },
                        {
                            "level": 2,
                            "comment": "Put stocks on the block chain and bypass exchanges entirely.",
                            "score": 14,
                            "author": "PaulMorphyTT",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 7,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "From what I learned recently, the clearing house requires brokers to hold cash collateral for 2 days when you buy a stock because thats how long it takes transactions to actually get processed. \n\nIts horribly inefficient.",
                                            "score": 2,
                                            "author": "PaulMorphyTT"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Isn’t it competition that introduced the high frequency traders and selling order execution and other rent seeking aspects of the market?",
                            "score": 6,
                            "author": "Brothernod"
                        },
                        {
                            "level": 2,
                            "comment": "im waiting for an exchange based on the blockchain. Im not sure if its possible but it would be cool to be able to buy stocks in a block chain instead of depending on central locations where rich people that open up offices to be 2ms closer to the exchange.",
                            "score": 2,
                            "author": "Kaffikup",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "They aren't the only exchange in the US either. NASDAQ, BATS exists too.",
                            "score": 1,
                            "author": "PoliticalDissidents"
                        },
                        {
                            "level": 2,
                            "comment": "speaking of competition, I have to sign off for competition laws for my job, and one of the things we sign is that we didn’t commit any “abuse of dominance”. (canada)\n\nif a single hedge fund can have so much impact in the market, that shouldn’t be allowed.",
                            "score": 1,
                            "author": "milchtea"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The short story:\n\nIt's a long awaited update to the SIP feed that has been discussed for almost 2 years now. The new rules expand the content of NMS market data to include:\n\n1. information about orders in share amounts smaller than the current round lot size (e.g., 100 shares);\n\n2.  information about certain orders that are outside of an exchange’s best bid and best offer (i.e., certain depth of book data); and\n\n3. information about orders that are participating in opening, closing, and other auctions.\n\nAlso:\nCompeting consolidators, rather than the existing exclusive SIPs, will collect, consolidate, and disseminate certain NMS information.\n\nIt was adopted in December. They should be effective in 60 days, but a phased transition plan begins in 2021 to avoid chaos.\n\nSources:\n\n[Traders magazine](https://www.tradersmagazine.com/am/industry-supports-sec-market-data-rule/)\n\n[Odd lots definition](https://www.investopedia.com/odd-lot-trading-on-the-rise-4774753)\n\n[SEC's statement](https://www.sec.gov/news/public-statement/statement-lee-infrastructure-2020-02-14#_ftn6) on the issue.\n\n&gt; The proposed rule would add depth-of-book, odd-lot, and auction information to what would be defined as “core data” required to be provided in the SIP.\n\n[The possible implications](https://www.tradersmagazine.com/departments/commentary/nms-ii-an-odd-solution-for-the-odd-lot-problem/) discussed briefly.\n\n&gt;The U.S. market has an “ odd lot problem.” That’s because 100 shares of AMZN (for example), at over $200,000 not only qualifies for block size but is multiples larger than the average trade or best bid value. So what tends to happen is that algos and individual investors bid for smaller values of AMZN, creating an “insiders” market at better prices than the NBBO shows.\n\n\n&gt;One problem with this is that investors and brokers using the SIP won’t know that there are small buyers and sellers at slightly better prices in the market.",
            "score": 29,
            "author": "georgejetsonn",
            "replies": [
                {
                    "level": 1,
                    "comment": "I suspect that \"odd lot problem\" is the basis of Robinhood s business model.\n\nBy law, they have to provide NBBO for their trades. NBBO is only defined for round lots. You trade 10 shares of amzn, you'll get NBBO, but they are getting a little better than NBBO, because the market for 10 shares is alot more liquid than the market for 100 shares.",
                    "score": 3,
                    "author": "ron_leflore"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I need to know how keeping the information from the public would help anyone other than those with access already..",
            "score": 87,
            "author": "predictingzepast",
            "replies": [
                {
                    "level": 1,
                    "comment": "If it’s public the exchanges won’t be able to charge for the information. \n\nie: quants and large brokers won’t pay for information they have free access to",
                    "score": 54,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Exchanges - no we're not going to give free data, who will we sell to?\n\nSEC - I don't care\n\nTraders - What do we want? DATA!! When do we want it? NOW\n\n&amp;#x200B;\n\nThis is actually awesome. I started my trading career almost a decade ago now, and my introduction was via Bitcoin. If you've never traded Bitcoin/Crypto before, it will blow your mind on the data access your given.\n\nFull order book for bid/ask real time\n\nReal time buy/sell volumes\n\nFull futures/options OI/volume\n\nSupply &amp; Demand\n\n&amp;#x200B;\n\nThese are just all standard things, you shouldn't need to become a broker or have access to a trading terminal to see these things.\n\n&amp;#x200B;\n\nGET EM SEC!!",
            "score": 40,
            "author": "Cab000se",
            "replies": [
                {
                    "level": 1,
                    "comment": "Information is the new gold standard, that's for sure.\n\nJust curious how did you buy bitcoin 10 years ago? I've read that at the start it was super sketchy to try getting your money into it compared to the crypto services available now.",
                    "score": 10,
                    "author": "DeprivedLondorian",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sure was!\n\nThe best way was if you knew some people/online faucets back then that were basically handing them out. You could also run a laptop mining bitcoin with just CPU (I caught the end of that and everything was moving to GPUs). Unfortunately, like many, your introduction to the space is short lived as it seems like a cool idea but not really fathomable. \n\nThe run to $4 is when my attention on Bitcoin was captured again. I eventually grew the testicular fortitude(took almost a full year to convince myself, but did lots of research/tinkering/learning in that year). and went to my bank and wired money to Mt Gox. My teller tried her best to talk me out of it as once it was sent it was as good as gone (she could see my account balance at the time lol).\n\nAfter almost a full week, my funds ended up in Mt.Gox, and the rest is history. Mt.Gox we all called \"The King\" back then, because it did something like 90% of the trading volume for all of Bitcoin. Over time, more options appeared and just spread out to hedge exchange risk (which proved to be one of my best moves ever as Mt.Gox imploded).",
                            "score": 19,
                            "author": "Cab000se",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Wow thats crazy! I think a lot of folks wouldn't feel so much retrospective FOMO over bitcoin in the early days because im sure many lacked the \"testicular fortitude\" as you amazingly put it to do sketchy wire transfers haha. \n\nI would love to be a fly on the wall for the conversation between you and the bank teller! Probably thought you were another guy in a Nigerian Prince type scam",
                                    "score": 8,
                                    "author": "DeprivedLondorian",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "LOL! Exactly! She legitimately was trying to \"save\" me I don't doubt that for a second.\n\nI just hope she eventually bought some Bitcoin!!  :\\*D",
                                            "score": 5,
                                            "author": "Cab000se"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I have FOMO over that. I knew about bitcoin and was tangentially involved when they were still trying to bootstrap via IRC. For merely bothering to run the code, I could have had thousands of bitcoins. But nobody thought the crypto nonsense was going anywhere back then.",
                                            "score": 2,
                                            "author": "backupbackupusername"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt;lacked the \"testicular fortitude\"\n\nIt's nothing more than gambling. If you absolutely have to gamble, do so with a small portion of your portfolio. The vast majority of people will do best by VTSAX and chilling. Sadly the simplest of concepts are the hardest for people to grasp.",
                                            "score": 1,
                                            "author": "WackyBeachJustice"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Thanks for sharing! Was cool to read through your comment.",
                                    "score": 3,
                                    "author": "Always-Learning4",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 2,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah I have done quite a few meetups in my days. 99% of the time it was at a startbucks in a Target, always somewhere nice and public. But yeah, always would be nervous but I never had a bad experience and met a lot of cool people who were also in to nerding out on Bitcoin (go figure haha!)\n\nI haven't done this in a couple years however with the changes made to KYC for localbitcoin it could be a really big security concern.\n\nOne of the newer/coolest platforms in the Bitcoin space right now is very similar to meeting up in person but you're both in the comfort of your home. \n\n[https://bisq.network/](https://bisq.network/)",
                                                    "score": 1,
                                                    "author": "Cab000se"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Just buy and withdraw btc from exchange immediately. Use well known exchanges. Localbitcoins.com. bitstamp.com",
                            "score": 1,
                            "author": "Coz131"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "* [SEC Ruling](https://www.sec.gov/rules/final/2020/34-90610.pdf)\n\n* [SEC Statement on the  Ruling](https://www.sec.gov/news/public-statement/crenshaw-statement-market-data-infrastructure-120920)",
            "score": 6,
            "author": "nows"
        },
        {
            "level": 0,
            "comment": "Another instance where a public blockchain would shine.  All info freely available to everyone.  There is no reason to have hidden data that gives one party a leg up in the information age.",
            "score": 7,
            "author": "solarflow"
        },
        {
            "level": 0,
            "comment": "This is going to be a very unpopular take but I think it's a non-issue both ways. \n\nThe vast majority of investors honestly don't need Level 2 data. I see people digging through these order books that they dont really even seem to understand and presenting their \"findings\". I believe that larger investors who have any sort of use for this data will just pay for it.\n\nOn the exchanges claims that it'll increase hidden costs, that's probably true, but it'd probably be fractions of pennies per trade. Again, probably not hurting the average investor in a real way.\n\nI think the recent obsession with order book data is tied to a little bit of hubris.",
            "score": 16,
            "author": "Cornwallace88",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;The vast majority of investors honestly don't need Level 2 data.\n\nAgreed 100%. Level 2 data is worthless without low latency colocation. And with LL colocation we don't call it Level 2 data, its just a market data feed.\n\nAnyone trading on RH, Webull, TD, etc., it doesn't have any practical benefits. It's on par with technical analysis and reading tea leaves. For any highly liquid security there is little to no correlation between price movement and the volume of bids and asks currently placed.",
                    "score": 6,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 9,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Active traders lose money in the long run, so even accepting your premises, that would still hurt retail.",
                            "score": 7,
                            "author": "Kyo91"
                        },
                        {
                            "level": 2,
                            "comment": "I'm not trying to be condescending but that's what mean by the hubris.\n\nSo many of the posts I've seen around Level 2 data are from people complaining about xyz or coming up with some conspiracy when they don't even seem to have a full grasp what they're looking at.\n\nBut ignoring that- hey it's fine it they want to be active traders, but it's been long understood that thriving in that arena requires certain resources. Paying for better market data, maybe a bloomberg terminal, etc. \n\nEven if it's marginal costs, why should I end up seeing execution costs go up just because some new people wanted to be \"active traders\". Is that at least a fair argument",
                            "score": 14,
                            "author": "Cornwallace88",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "BS excuse. Even if you didn't trade at all you can use Level II data for modeling,  which is fun and a great way to teach higher order math to people. Some people just like data. I am fine with paying a little more for the market to be more open.\n\nIt's like saying libraries shouldn't have books on physics or calculus because the average person wouldn't understand  it, so why not make the few who are interested pay thousands a month for the privilege of access to those materials.",
                                    "score": 7,
                                    "author": "corkyskog",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I mean it's fine if you like the data, but what if I as another market participant couldn't care less about an order book. I'm still going to be stuck with whatever slight uptick in execution costs now. Why do I have to live with that?\nIf someone wants access to data that they believe will be making them excess returns, why would others foot the cost.\n\nI'd argue your example in the exact inverse though. If those books were super pricey and only a few people wanted them, and the books were going to be used exclusively for some money making venture for themselves, should the library allocate its budget to that, raise library fines, propose higher taxes etc, in order to fund that?\n\nAgain- I'm not arguing nobody understands it, I'm just pointing out that a lot of the L2 related posts I've seen have centered around fundamental misunderstandings of what they were looking at.",
                                            "score": 6,
                                            "author": "Cornwallace88",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I see your points about cost. I have spent a decent portion of my career in education industry, so I am really jaded about information being put behind paywalls. I have never seen a case where opening up information to the public has been harmful to the public.\n\nYour example already happens. The libraries do pay the premium and are able to afford it by sharing resources, meaning it may take longer to borrow the book or media, but you will eventually be able to. \n\nIn fact people have told me some libraries now have open access Bloomberg terminals. I live in a somewhat rural area, so I haven't seen one in a library myself, but that is great if true. (Especially if they also have a mathematica license)",
                                                    "score": 7,
                                                    "author": "corkyskog",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I agree that increased accessibility like that is a good thing, allowing for Bloomberg terminals to be utilized by someone who normally wouldnt be able to access it. And I can understand the natural inclination to sort of increase access to things on all fronts.\n\nPretty fair point that libraries do stuff like that already. I guess then to me this situation feels like it's mostly some new guy in town rushing into the library demanding a special subscription to something that the other people in town who use it just pay for themselves, and there's a high likelihood this guy loses interest and leaves by the time they go and get it.\n\nIt's a pessimistic view but let's be real, a lot of people posting are themselves saying they've got a few months of experience trading and demanding this or that transparency or making big corruption claims when they've barely got the lay of the land on what's going on around them.",
                                                            "score": 6,
                                                            "author": "Cornwallace88",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I just wanted to present my argument for the underrepresented data nerd, student or teacher.\n\nI won't argue about the costs, because I honestly don't know how much of an impact it would make or how they would be priced into the market.\n\nI also propose a solution to all those saying \"people won't understand the data, and will make bad trades off of it\". Just setup a test for like five or ten bucks for access, that you can keep taking until you pass. \n\nBloomberg had already created something like that as I was leaving that my students could opt to take. I don't believe there was much of a benefit to taking it because it was in Beta. But a lot of people failed their first go around being fourth year finance students... just use something like that.",
                                                                    "score": 3,
                                                                    "author": "corkyskog",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "It's definitely good advocating for people that could be getting left out on certain access to transparent markets. I guess my whole argument boils down to finding the data useless for the most part, except maybe for some very specialized traders. And it is frustrating seeing people shake faith in the markets based off bad interpretations of that same data. That's the biggest issue in my mind, the \"rigged game\" sentiment.\n\nI just think that active retail traders, whether they know it or not, are complaining about something most other retail participants in the market don't care at all about. And in pushing for something like this they're asking others to foot even a small bill for something they plan on trying to make  money off of.\n\nI like the testing idea, I wonder how that would be received by people taking it. \"Where's the question on short ladder attacks!\"",
                                                                            "score": 3,
                                                                            "author": "Cornwallace88"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 3,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yes, but there are now tons of constant posts on WSB about data that people don't understand. People think this is showing that retail should have access to this data, but people are demonstrating they can't understand it and are actually proving the point that retail is too stupid for its own good. Constantly posting about holding because Blackrock \"didn't sell\" at the peak.... using Blackrock's Q4 filings as evidence....",
                            "score": 11,
                            "author": "ya_mashinu_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If people are surprised that an asset manager the operates passive index funds didn't sell a security that is in the tracked index, then they have much further problems.",
                                    "score": 12,
                                    "author": "Kyo91",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "My point is that they don’t even know if they sold... those are quarterly. And even if the next filing shows ownership, that doesn’t mean they didn’t sell at 300+ and rebuy at sub50",
                                            "score": 10,
                                            "author": "ya_mashinu_",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Ah yeah, I forgot about that as well. But my point is that these funds aren't actively invested. The only two factors that determine whether they buy or sell is \"Is this stock in the underlying index?\" and \"have more people bought or sold the underlying fund such that we need to buy/sell more shares of every company?\"",
                                                    "score": 1,
                                                    "author": "Kyo91"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I think if people are to understand it, it needs to come at a time when emotions aren't high and trying to connect every little thing to some sort of rigged game concept.\n\nTo me the biggest indicator that people don't get what they're looking at is when they're talking about playing with like a few hundred bucks and think that the order book of a highly liquid name has some massive effect on their trade.",
                                    "score": 2,
                                    "author": "Cornwallace88"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt;will probably lead to more active traders. (rather than investors)\n\nThat's actually a travesty. As a Boglehead, watching the last month play out made my heart ache. I'm really sad to see that young people are getting the absolute worst introduction to the markets. Instead of lessons on building long term wealth, they are gambling.",
                            "score": 1,
                            "author": "WackyBeachJustice"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The SEC shouldn't be saying what products a company should provide for free. NYSE and Nasdaq are owned by Intercontinental Exchange and Nasdaq Inc. You can buy their stocks. Forcing them to give away their product (data) is just a step toward a nationalized market. If I want high level data, I'll buy it.",
            "score": 19,
            "author": "banana-flavour",
            "replies": [
                {
                    "level": 1,
                    "comment": "You bring up an interesting argument. I think this partly what's at the core of the problem is how to define what information should be available to anyone without a paywall. I see different takes in the comments about whether or not this data would benefit average traders/investors anyways.\n\nIn my opinion, it seems disingenuous to say thay people can trade on your exchange and gain an edge by paying more sort of like pay to win games - everyone can play but payers win. How to tackle that from a legality standpoint is way beyond me though.",
                    "score": 17,
                    "author": "DeprivedLondorian"
                },
                {
                    "level": 1,
                    "comment": "Saying what products a company should provide for free is literally part of the SEC's mandate. From their website: \n\n&gt; The U. S. Securities and Exchange Commission (SEC) has a three-part mission:\n\n&gt; Protect investors\n&gt; Maintain fair, orderly, and efficient markets\n&gt; Facilitate capital formation\n\nThis falls under both the first and second pillars of their mission. They are protecting investors by leveling the informational playing field, that part should be obvious. But it also falls under the second pillar because they have identified that monetizing access to components of trading data feeds has created a market inefficiency.\n\nThere's reasons to be against the move but 'muh freemarkit!' isn't one of them. The SEC was created to correct the consequences of an underregulated capital market and continues to be that backstop to this day.",
                    "score": 18,
                    "author": "Only1nDreams"
                },
                {
                    "level": 1,
                    "comment": "The issue stems from the fact that odd lots aren't guaranteed NBBO fills. With the advent of zero-commission brokers, there has been a substantial increase in odd-lot orders and they are the most vulnerable to predatory tactics by HFTs and market makers. They are free meals to flash boys.",
                    "score": 5,
                    "author": "georgejetsonn"
                },
                {
                    "level": 1,
                    "comment": "That's what I'm confused about. Do the exchanges own the data? It sounded like the SEC was going to make the changes, not require the exchanges to change anything.\n\nBecause I agree if the exchanges own the data. That's what I would expect but it doesnt seem to be the case.",
                    "score": 2,
                    "author": "Nonethewiserer"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Everyone should have access to the same data! Why would they need exclusive access if it wasn’t to get an edge on us?",
            "score": 4,
            "author": "Treday237"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 5,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Hell yeah! I'm all for info like that becoming publicly and freely available",
            "score": 2,
            "author": "viperex"
        },
        {
            "level": 0,
            "comment": "Bruh isn’t like level 2 data available for free by every retail broker except Robinhood?",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I have Etrade and Fidelity. I actually had a thread about Level 2 data a little bit ago.\n\nDoes anyone know where at within either platform to see the sell order data?",
            "score": 2,
            "author": "Semitar1"
        },
        {
            "level": 0,
            "comment": "After the GME stuff and the resulting push for more protection to hedge funds and anti-retail trading, I'm finally making the swap to forex.   \n  \nI'll keep my bonds/etf long term savings type stuff, but I'm done swing trading a market that doesn't want me and my \"small\" account.  \n  \nI trade actively because I enjoy it, keeps my mind sharp and helps keep a pulse on the news.  I don't do it for income so no reason to stick to a market that obviously doesnt want me there lol.",
            "score": 3,
            "author": "minos157"
        },
        {
            "level": 0,
            "comment": "This is why DeFi is going to explode in 2021",
            "score": 5,
            "author": "mou_mou_le_beau"
        },
        {
            "level": 0,
            "comment": "Here is a counter argument, why should NYSE and nasdaq, who spend god knows how much aggregating the data and what not give it out for free?",
            "score": 4,
            "author": "flyrugbyguy",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 3,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "cause whatever real edge they can get they will pay out the ass for.",
            "score": 2,
            "author": "Next-Bedroom2night"
        },
        {
            "level": 0,
            "comment": "That's ridiculous. All investors should be privy to all available data.",
            "score": 2,
            "author": "rservello"
        },
        {
            "level": 0,
            "comment": "All i know is that seeing the complete depth on crypto exchanges is pretty cool",
            "score": 2,
            "author": "UpDown"
        },
        {
            "level": 0,
            "comment": "Funny how my limits are always 10 cents off from triggering, then drop 20% go figure.",
            "score": 2,
            "author": "pimpedoutmonkey"
        },
        {
            "level": 0,
            "comment": "I would love to see more information about both sides. This isn't an easy \"good guy vs bad guy\" sort of suit. Both sides have some legitimate points to make based on the info in this article. I'd like to know the full details.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Idk if I understand right but the more information public and transparent the better!",
            "score": 1,
            "author": "wWolfw"
        },
        {
            "level": 0,
            "comment": "How about real time short data?",
            "score": 1,
            "author": "Spamme54321"
        },
        {
            "level": 0,
            "comment": "Time for the torch and pitchfork.",
            "score": 1,
            "author": "Intelligent_Bat_6685"
        },
        {
            "level": 0,
            "comment": "Almost finished with Flash Boys. This system is rigged.",
            "score": 1,
            "author": "GrayWalle"
        },
        {
            "level": 0,
            "comment": "Ah yes, the old “it’s too complex for you” trick. Didn’t Trump try that already with his tax returns?",
            "score": 1,
            "author": "iwantknow8"
        },
        {
            "level": 0,
            "comment": "That's why I go through a commissioned broker. You get what you pay for. Reliability issues? Privacy issues? Margin issues? Nope.  I feel like complaining of shottiness if you aren't even paying for the service is like complaining about the president but you never voted.",
            "score": 1,
            "author": "snasna102"
        }
    ]
}