{
    "id": "mcpqqp",
    "score": 3376,
    "title": "The SEC confirms it is investigating SoftBank for market manipulation. Softbank spent $17B worth of shares in the US tech market, with another $3.4B in bets to prop up their prices.",
    "author": "rrdonoo",
    "date": 1616645951.0,
    "url": "https://www.reddit.com/r/investing/comments/mcpqqp",
    "media_urls": [],
    "other_urls": [
        "https://news.bloomberglaw.com/tech-and-telecom-law/softbank-says-unaware-of-sec-probe-into-securities-trading"
    ],
    "postText": "\nhttps://news.bloomberglaw.com/tech-and-telecom-law/softbank-says-unaware-of-sec-probe-into-securities-trading\n\nOn Wednesday, short seller research site PlainSite posted a letter from the Securities and Exchange Commission on Twitter revealing that the agency is investigating SoftBank, the Japanese telecommunications company and investing giant notorious for financing various unprofitable “technology” companies like WeWork, Uber, Compass, and Oyo.\n\nAaron Greenspan, founder of the Think Computer Foundation that runs Plainsite, filed a FOIA request in December 2020 for \"any investigative materials [from January 1, 2018 to the present] pertaining to the various SoftBank companies controlled by Masayoshi Son, specifically relating to SoftBank's trading of stocks and derivatives on those stocks.\"\n\nThis request was filed in response to the revelation last fall that SoftBank was the \"Nasdaq whale.” SoftBank was responsible for stoking a huge rally in tech stocks, the Financial Times reported, because around August it began buying billions of dollars worth of call options in a shift for the company, fueling a rally that pushed up the share prices of tech companies it held billions of dollars of equity in.\n\nThanks in large part to a rally sparked by SoftBank’s high-risk market plays, firms like Tesla and Apple were up 74 and 21 percent, respectively, in the month of August alone. Executed through a small desk of traders and chief executive Masayoshi Son himself, the trading unit―named SB Northstar―and its bets won the company some $4 billion in gains at the beginning of September, before quickly melting away into nearly $3 billion in losses by the end of the month.\n\nIn a January letter responding to Greenspan’s initial request, and months after the reporting on Softbank became public, the SEC said that its search did not turn up any relevant records. Greenspan appealed the decision on March 9 and two weeks later received a letter saying that responsive records were identified, but they could not be released under legal provisions that cover ongoing investigations.\n\n“We have confirmed with Division of Enforcement staff that the investigation from which you seek records is still active and ongoing,” the SEC letter stated.\n\nAccording to the letter, the SEC maintains that releasing the records “could cause harm to the active and ongoing enforcement proceedings because, among other things, individuals and entities of interest in the underlying investigation could fabricate evidence, influence witness testimony and/or destroy or alter certain documents,” in addition to revealing cooperating witnesses and the general scope of the investigation.\n\nThe debatable merits of the SEC’s denial aside, an investigation into Softbank may indicate that its risky trading strategy is catching up to the giant. SoftBank unwound its Nasdaq derivative positions by December 2020 after investors questioned its \"controversial strategy\" which could've lost the company billions more. The last look at SB Northstar's books at the end of September showed that it had bought about $17 billion worth of shares in the US tech market, with another $3.4 billion in bets to prop up their prices.\n\nSoftBank did not immediately respond to Motherboard’s request for comment. The SEC declined to comment.",
    "comments": [
        {
            "level": 0,
            "comment": "**Hi, welcome to /r/investing. Please note that as a topic focused subreddit we have higher posting standards than much of Reddit:**\n\n**1)** Please direct all **advice requests and beginner questions to the stickied daily threads.** This includes beginner questions and portfolio help.\n\n**2) Important: We have strict political posting guidelines** (described [here](https://www.reddit.com/r/investing/comments/cyee69/formal_posting_guidelines_for_political_topics/) and [here](https://www.reddit.com/r/investing/comments/escewo/temporary_rule_change_what_happens_to_stocks_if/)). Violations will result in a likely 60 day ban upon **first instance.**\n\n**3)** This is an open forum but we expect you to conduct yourself like an adult. Disagree, argue, criticize, but **no personal attacks.**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/investing) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "I forgot they invested in WeWork, ouchie.",
            "score": 281,
            "author": "kgal1298",
            "replies": [
                {
                    "level": 1,
                    "comment": "And in Wirecard.",
                    "score": 124,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And Greensill, which recently filed for insolvency.",
                            "score": 28,
                            "author": "Packbacka",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "So basically, just reverse whatever SoftBank does..",
                                    "score": 7,
                                    "author": "Maleficent_Draft_691"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "When you find out wirecard's payment taking machine was called blitz",
                            "score": 6,
                            "author": "BoonTobias"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "WeWork is still going public via a SPAC... it's unbelievable but they will get through it while getting all the free money.",
                    "score": 70,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Maybe I’m just really dumb but I feel like going public right now Has to be absolute suicide for them. They Have a non-functional business model and with all the bad press stay got I can’t see people being excited about the stock",
                            "score": 56,
                            "author": "EriccusThegreat",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I don't think they'll ever have a functional profitable business model, so they're probably just trying to cash out why they can.",
                                    "score": 54,
                                    "author": "Arp590",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah I agree alright gonna have a short ready on that one.",
                                            "score": 8,
                                            "author": "EriccusThegreat"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Ironically I thought they were fucked before but post Covid I think they could crush it. More businesses will be looking for flexible office environments than ever before with more WFH",
                                            "score": 4,
                                            "author": "Stowski"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "That's seems to be the SOP of a lot of business lately, especially SPACS.",
                                            "score": 2,
                                            "author": "CipherScarlatti"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "You severely underestimate how dumb the market is right now.",
                                    "score": 32,
                                    "author": "JapanesePeso",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "NFTs",
                                            "score": 7,
                                            "author": "make_love_to_potato"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "OK put my point being that there’s no way that’s a good investment. And I’m not secretly missing some thing that people with a higher processor for brain are betting on?",
                                            "score": 2,
                                            "author": "EriccusThegreat",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The market is so stupidly correlated from the popularity of index investing. I wish there was an index of reasonable tech-forward companies where I’m not subjected to the whims of people who think Roblox is going to change the world but there’s not so what happens is tech or tech or financials are all green or all red almost agnostic to their underlying business.\n\nThe issue with individual stocks is it’s so time consuming to manage a diversified portfolio and you could bet against a company like WeWork and be right… but Cathie would send it to the moon on a whim.",
                                                    "score": 9,
                                                    "author": "bubumamajuju",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Yeah commercial real estate is at its lowest pretty much in history right now and it might never recover.  \nSo many big companies going full remote. I wouldnt touch wework with a 1000 ft pole even if I didn’t know about all the shady past",
                                    "score": 3,
                                    "author": "MrPoopieBoibole"
                                },
                                {
                                    "level": 3,
                                    "comment": "To an extent I feel like their business model is more attractive post-pandemic than it was before - a lot of people have realized commutes suck but also aren't sold on full WFH, and more flexible / on-demand offices could be a happy medium.\n\nThough I'm not sold on WeWork specifically even after their shady founder was forced out, and I'm especially not sold on any such business wanting to take enough of a cut to be valued as a \"tech\" company like they did.",
                                    "score": 2,
                                    "author": "euvie",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "\"Hold my beer\" ~Robinhood",
                                    "score": 2,
                                    "author": "Borsaid"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "What ticker so i can short",
                            "score": 7,
                            "author": "I_Shah",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "For now, BOWX. But they can also back out.",
                                    "score": 5,
                                    "author": "the_humeister"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The SPAC can still back out just like the IPO blew up.  Don't call something done in finance until its done.\n\nFor all we know the SPAC has another work share backup org it wants to merge with and wants to find out just how much runway WeWork has left so they can swoop in and pick at the bones.",
                            "score": 2,
                            "author": "Malforus"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "WeWork is actually a good company. Their future is corporate leasing for giant companies. When I was fund raising, I got a quote from WeWork for a HQ, $250k per month with a 2-3 year lock-in but they would provide and take care of everything for me. It was slightly overpriced but not by much. For a company like Google, FB who are running out of space or looking to expand, WeWork is a place they can stick their work from home people at or use as mini satellite offices.",
                    "score": -14,
                    "author": "Henry1502inc",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, fundamentally, WeWork's model isn't *too* crazy, it's just the company, and subsequently, its value was overhyped to shit.",
                            "score": 14,
                            "author": "superepicunicornturd"
                        },
                        {
                            "level": 2,
                            "comment": "WeWork is a *fine* company, but it's insanely overvalued for what it is. It's not a tech company, even if wildly successful it's not going to have profit or non-expensive growth like a tech company, so it shouldn't be valued like a tech company.",
                            "score": 5,
                            "author": "skycake10",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This is honestly an outdated date, it hasn’t been valued as a tech company in over a year and a half. It was valued at $3b this past summer, down from $47B.",
                                    "score": 3,
                                    "author": "-__-----",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ah yeah that makes sense, I haven't kept up since it became clear they weren't going to IPO",
                                            "score": 3,
                                            "author": "skycake10"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yup. I don't if WeWork specifically will be the leader at the end, but this is the future. Tech companies are allowing permanent remote and looking to lease pop-up offices for the devs who would prefers some days to be in the office.",
                            "score": 12,
                            "author": "EmTeeEl",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You are assuming that all WFH people will always want to actually work from home especially if their company is offering them a chance to use a WeWork office. A lot of people value separation of home and work. Plus again, in big cities where WeWorks value proposition is greatest, they are relatively attractive and had near full occupancy, such as San Francisco. They definitely expanded to fast and in some questionable regions but overall, they do have a profitable future after Covid.",
                                    "score": -1,
                                    "author": "Henry1502inc",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": " We're saying the same thing",
                                            "score": 11,
                                            "author": "EmTeeEl"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Ive worked in two separate we works they are incredibly overpriced and overrated",
                            "score": 2,
                            "author": "Abiv23"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "So tech drops another -2% tomorrow",
            "score": 389,
            "author": "LightlySaltedTit",
            "replies": [
                {
                    "level": 1,
                    "comment": "or maybe it dropped todat cuz the people on the inside got some news before we did",
                    "score": 194,
                    "author": "Bubbapurps",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "20b is a drop in the bucket. They couldn't move a single member of faang with that amount.",
                            "score": 34,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "FANG didn't fall that hard, but look outside that to small cap growth, and it's been eviscerated.  I'm down 50% since Feb, that's all long and the majority have a positive p/e.  Companies that didn't have earnings are down more than that.",
                                    "score": 48,
                                    "author": "b-lincoln",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That was close to the peak of peaks.... Good luck",
                                            "score": 7,
                                            "author": "[deleted]"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Small cap is a scary place to be",
                                            "score": 3,
                                            "author": "[deleted]"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "UPWK is down 25% after an 1100% earning surprise I don’t understand it at all other than I literally just got margin called this morning lol",
                                            "score": 1,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "The problem isn’t the 17B in shares. It’s the 3.4B in bets they made with options. If they bought ATM options that would equate to a gigantic exposure to the market. The thing is that the options they bought we’re considerably OTM which means that 3.4B worth of premium would buy them a whole lot more contracts and, consequently, an even bigger exposure to the market. That’s the main problem. Many people involved in SB operations where getting uncomfortable with the risk they were taking in  because it was getting harder and harder to manage due to the sheer size of they’re exposure. When they were finally ousted as the whale buying all those options, everyone dumped on them, but at the time I believe that they had already liquidated their positions. \n\nThe bet paid off. But that’s only because people start to notice when there’s large inflows into a stock/option and they start pilling in and making the price rise. \n\nIt’s market manipulation nonetheless, because they made those bets with the sole intent of getting other people to join in on these stocks, making the price rise as more and more people join in",
                                    "score": 10,
                                    "author": "pontedm",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Siiiiiigh. It’s been nothing but drops since like the end of February.",
                    "score": 58,
                    "author": "ryuujinusa",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's been dropping since I bought some QQQ. I'm so sorry",
                            "score": 75,
                            "author": "justonimmigrant",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Please sell so it goes up again for the rest of us",
                                    "score": 36,
                                    "author": "demonspeedin"
                                },
                                {
                                    "level": 3,
                                    "comment": "Please immediately buy SQQQ",
                                    "score": 12,
                                    "author": "d20dndmemes"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Welcome to the wonderful world of volatility.  If volatility is what you want, volatility is what you're gonna get... in both directions.",
                            "score": 7,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "SPY hit a new ATH last week...\n\nThe only way your tech stocks have been in the territory of a loss is if you bought them at the top.",
                            "score": 25,
                            "author": "fieldofmeme5",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I only buy the top",
                                    "score": 69,
                                    "author": "temp123456789098765",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "This guy bottoms",
                                            "score": 14,
                                            "author": "postdusk"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Aakk, aapl, pltr all havent really recovered from dip, they've actually declined over the 3 month period... so no not all tech has recovered",
                                    "score": 25,
                                    "author": "imabigfool95",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "PLTR and ARKK have been extremely overvalued imo. AAPL will bounce back quicker.",
                                            "score": 3,
                                            "author": "dells16",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Not arguing the price or value of the stock, however with the tech dip in general it has performed poorly in returns this quarter.",
                                                    "score": 7,
                                                    "author": "imabigfool95"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "You mean like feb 16th? \\*waves*",
                                    "score": 4,
                                    "author": "1slinkydink1"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The drops are healthy, though. Tech had gotten way out ahead of itself.",
                            "score": 5,
                            "author": "WeenisWrinkle"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Amateurs. They should manipulate cryptocurrencies because there are no regulations and fines.",
            "score": 88,
            "author": "Printer-Pam",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's what Elon is doing.",
                    "score": 89,
                    "author": "SolenoidSoldier"
                },
                {
                    "level": 1,
                    "comment": "They already do that too",
                    "score": 28,
                    "author": "Plastic_Permission81"
                },
                {
                    "level": 1,
                    "comment": "Yeah, I guess they manipulate stocks AND crypto. You know - diversification is a key to success.",
                    "score": 8,
                    "author": "nieistniejacy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is there anyone who can investigate the SEC",
            "score": 193,
            "author": "green9206",
            "replies": [
                {
                    "level": 1,
                    "comment": "Technically the FBI should be able too, yes, but I can't see that being ok'd.",
                    "score": 59,
                    "author": "jb_in_jpn",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 15,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "DoJ",
                                    "score": 13,
                                    "author": "Green_Lantern_4vr",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Who can investigate the department of justice?",
                                            "score": 7,
                                            "author": "Blamethemarket",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Special prosecutor",
                                                    "score": 14,
                                                    "author": "Green_Lantern_4vr"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Compromised institutions all the way down unfortunately",
                                            "score": 5,
                                            "author": "HallowedGestalt"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Congress? Lol who am I kidding.",
                    "score": 91,
                    "author": "Momoselfie"
                },
                {
                    "level": 1,
                    "comment": "I'm wondering this as well. This is rather reaching, but I do feel like I need some clarifications on what they're basing their grounds on.\n\nFor example, how would the Vision Fund be different and be called 'manipulation' vs. Ark's ETFs?",
                    "score": 18,
                    "author": "jinnyjuice",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They're investigating.",
                            "score": 10,
                            "author": "dodo_thecat"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The inspector general's office does.",
                    "score": 2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Cool. Their fine with be like a slap on the wrist",
            "score": 152,
            "author": "Ryuken_",
            "replies": [
                {
                    "level": 1,
                    "comment": "'Now you don't go and do that again,  ya hear?..'\n\n(*takes cut*)",
                    "score": 69,
                    "author": "predictingzepast",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Okaaaaay :(",
                            "score": 16,
                            "author": "BigTuna_103",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "*does it again anyway*",
                                    "score": 5,
                                    "author": "I_make_switch_a_roos"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Cost of doing business",
                    "score": 10,
                    "author": "Plate-toe"
                },
                {
                    "level": 1,
                    "comment": "Fine? They bought options, just like everybody else is doing. There is no law against buying options on a stock and owning shares on that same stock otherwise we all would be in jail right now. What laws did they break here?",
                    "score": 12,
                    "author": "Berisha11",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah. They were yoloing their way to the moon. \n\n&gt;Tell me the difference between stupid and illegal, and I'll have my wife's brother arrested",
                            "score": 5,
                            "author": "elus"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 14,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 175,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "TOTAL BS! Blackrock would be required to file a 13G which they haven’t done. They currently own 9 million shares from last year. Just look on whale wisdom.",
                    "score": 13,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Blackrock is primarily in the 401(k) space.  They have the DOL as well as the SEC/Finra to worry about.  They are mostly glorified index funds.  Any plays that they make is rebalancing based on the overall index.  They just have more money than any one else to do it with.",
                            "score": 3,
                            "author": "b-lincoln"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's amazing to me so many people here refuse to believe that hedge funds and other large, institutional investors manipulate the market and accuse you of wearing tinfoil hats, even though there is evidence everywhere that it's happening. Cramer even admitted he did it, and people continue to stick their heads in the sand.",
                    "score": 218,
                    "author": "unfonfortable",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The best plays are the one's anticipating the manipulation. Cause we all know it happens",
                            "score": 53,
                            "author": "smileyfrown"
                        },
                        {
                            "level": 2,
                            "comment": "It's one thing to believe that hedge funds are manipulating the markets, but it's another to think that you're fighting them by burning your money on GME",
                            "score": 70,
                            "author": "LionOfNaples",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "/u/kn347\n\nI should clarify that I’m talking about now. It’s not deniable those two particular HFs did lose big in February.\n\nAdditionally, the whole narrative of retail vs hedge funds on GME falls apart due to the fact that hedge funds are also playing on the long side as well who would just as likely screw retail over the moment it becomes profitable",
                                    "score": 8,
                                    "author": "LionOfNaples",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "He did? When was that? \nNote: I’m not doubting you I just want to see it for myself. I believe you",
                            "score": 7,
                            "author": "QueenTahllia",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "https://www.youtube.com/watch?v=jIfixbq_u0Q",
                                    "score": 26,
                                    "author": "serbeardless",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Bless",
                                            "score": 12,
                                            "author": "QueenTahllia"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[Way back in 2006 or so.](https://www.youtube.com/watch?v=W90V_DyPJTs)",
                                    "score": 8,
                                    "author": "TheEpicSock"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Not entirely by any means, but they definitely have targeted Reddit to spread FUD, used the media to push narratives spreading uncertainty, used extraordinary methods to drive the stock price down such as shorting ETFs and using the OTC exchange to short shares amongst themselves (this is a fact now), went to great effort to hide their true positions which to my understanding is not very common. If retail wasn’t a big deal, why would they go to such great efforts to get retail to sell??\n Go over to the GME thread and look at the top post that has the image of Bloomberg terminal screen. Look at how many shares exist. Retail itself definitely owns over 100% of float.. what more would you need to believe retail is a huge player in this scenario?",
                    "score": 33,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Uhh hedgefunds always try to hide positions because they don't want other hedgefunds to know. Its one of the most important pieces of information you can obtain is someone else's positions.",
                            "score": 15,
                            "author": "mtcoope",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Sure, but understand the context. First of all you are always at the mercy of the broker(s) you use. Front running is illegal but it happens a lot, and eventually institutions do have to disclose their positions.\nWhat I’m saying is that (apparently, I’m no expert) it’s not common to see such misrepresented data on market reports, so many synthetic shares of a company being released in the market (this level of naked shorting facing this much resistance), this many shares being exchanged on dark markets, etc. They are working very hard to hide their real position. And also- short squeezes are very rare, Most HF investment strategy is bland according to former Wall Street guys I’ve read. Like a mutual fund on steroids.",
                                    "score": 9,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;Black rock themselves even bought 1billion In shares and dumped it the next day. \n\nSource?",
                    "score": 4,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "There was a rally of billionaires hyping the ongoing battle for the short shorts.. Blackrock contributed and guess what.. shorts never covered.",
                    "score": 14,
                    "author": "flavorlessboner"
                },
                {
                    "level": 1,
                    "comment": "It continues to be a good lesson as to how much control we do not have. Im extremely bullish on gme because I have an overall low buy in and yes I am aware of the risks. Please dont chastise me here because I am optimistic on prospects.",
                    "score": 10,
                    "author": "Plate-toe",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Unfortunately, due to the hype surrounding GME, to anyone who hasn’t done their own research on the stock, it’s very easy to sit back and mock people for holding GME. Any group with this much passion for anything is going to be labeled as “QAnon central” because we’re dealing with topics like market/media manipulation, etc and people are vocal and speaking out against it.\n\nAsk any of these people who mock GME holders about the FTD rate on GME, or why analysts are giving it a $16 buy price and justifying it by saying “behavioral analysts have said that people will lose interest in this and splinter off from the stock, just like how people splintered off from OWS”. They’ll have no idea on what to say.",
                            "score": 3,
                            "author": "kn347",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The $16 price is justified by fundamentals. The only thing keeping it above that are Reddit traders attempting to manipulate the market by inducing a short squeeze, which is **textbook market manipulation**",
                                    "score": 0,
                                    "author": "FormerBandmate",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "They invested intom something and doubled down on it. Sure call it \"bet to prop up their prices\". They are mostly a investing company, why would they not be allowed to do that, wtf?",
            "score": 8,
            "author": "masteroflich",
            "replies": []
        },
        {
            "level": 0,
            "comment": "But nothing in regards to Robinhood right?  Funny.",
            "score": 9,
            "author": "kekehippo"
        },
        {
            "level": 0,
            "comment": "How does someone spend shares?   Who wrote that?",
            "score": 28,
            "author": "pm_me_clothed_pics",
            "replies": [
                {
                    "level": 1,
                    "comment": "Shares are the new currency",
                    "score": 10,
                    "author": "Mason-Derulo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "they actually are, if you look at dark pool activity",
                            "score": 3,
                            "author": "Basket_Fragrant"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ohh. Gonna slap them with a huge fine. By huge I mean barely enough to register on their balance sheet.",
            "score": 4,
            "author": "popejp32u"
        },
        {
            "level": 0,
            "comment": "Honest question, how do you differentiate between market manipulation and simply big bets in a case like this? Unless you find written communciation showing otherwise, can't SoftBank just say they bought those stocks and options because they thought they would be profitable investments? Seems reasonable.",
            "score": 13,
            "author": "Jmdlh123",
            "replies": [
                {
                    "level": 1,
                    "comment": "You're correct. Buying a huge number of options/shares isn't illegal. I'm interested to see what the SEC is actually investigating them for.",
                    "score": 5,
                    "author": "nortern"
                }
            ]
        },
        {
            "level": 0,
            "comment": "GME is being manipulated every day, \n\nSEC \\*crickets\\*",
            "score": 129,
            "author": "Positive_Tree",
            "replies": [
                {
                    "level": 1,
                    "comment": "That whole GME investigation seemed like a colossal waste of time. Nothing new was learned and no action was taken. SEC just likes to diddle themselves while doing jack shit.",
                    "score": 61,
                    "author": "SolenoidSoldier",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Congressional grand-standing. Don't get me wrong, DFV is a fun guy to watch, but he was just an opening act for members of Congress to posture themselves and side with \"the little guy\"",
                            "score": 27,
                            "author": "nkorner77"
                        },
                        {
                            "level": 2,
                            "comment": "Did anything actually happen besides story time for braindead congressmen?",
                            "score": 2,
                            "author": "Fuehnix"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The purchase of OTM calls at high strike prices with a Friday expiration was staggering yesterday. The sellers of those calls made a lot of money.\n\nWhoever threw a million into $100 puts expiring Friday the day before yesterday had only a 5% chance of being right at the time.",
                    "score": 6,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "You're right, it should be much much lower.",
                    "score": -45,
                    "author": "dashdashcooldash",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes on fundamentals\n\nNo on the number of shorts vs float",
                            "score": 31,
                            "author": "Positive_Tree",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "How? GameStop has made over $2 billion net profit on sales last quarter alone. GameStop is the largest retailer in the gaming industry which is valued at more than $160 billion and has a CARG of $257 billion by 2025. With them seeking to sell more PC gaming and becoming a technology first company they will be able to capture a larger chuck if this industry.",
                            "score": -25,
                            "author": "BASEbelt",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You’re confusing sales and profit, they didn’t make profit they made a loss from the report\n\nNet loss of ($215.3) million, or ($3.31) per diluted share compared to net loss of ($470.9) million, or ($5.38) per diluted share in the prior fiscal year. Adjusted net loss of ($138.8) million or ($2.14) per diluted share compared to adjusted net income of $19.1 million or $0.22 per diluted share in fiscal 2019, and;",
                                    "score": 37,
                                    "author": "swsko",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Can you point me towards the 2B net profit q4/2020 pls? I can't find it.",
                                    "score": 22,
                                    "author": "COMCAST-MONOPOLY",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It’s right on [GameStop investors section of their website](https://investor.gamestop.com/news-releases/news-release-details/gamestop-reports-fourth-quarter-and-fiscal-2020-results)\n\nThe 10k is also already filed with the SEC",
                                            "score": -12,
                                            "author": "BASEbelt",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That's sales bru.",
                                                    "score": 31,
                                                    "author": "PersecuteThis",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Seems like so many tech companies and especially startups are making losses today that people forgot what profits are, lol",
                                                            "score": 10,
                                                            "author": "schrowawey"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 13,
                                    "author": "[deleted]",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt;GameStop has made over $2 billion net profit on sales last quarter alone\n\nThese are the type of people investing in GME.",
                                    "score": 11,
                                    "author": "quickclickz"
                                },
                                {
                                    "level": 3,
                                    "comment": "2b profit my ass",
                                    "score": 4,
                                    "author": "honey_102b"
                                },
                                {
                                    "level": 3,
                                    "comment": "Do you have a source for those profit numbers? All I can find are the Financials before this last quarter. Their revenue and profit have fallen YoY since 2018.  They only had 5 billion in revenue last year and lost money.",
                                    "score": 2,
                                    "author": "dashdashcooldash"
                                },
                                {
                                    "level": 3,
                                    "comment": "So you're saying they're grossly undervalued",
                                    "score": 1,
                                    "author": "Outrageous-Win-9449"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is very common and happens daily.  Softbank must not have friends in high places.",
            "score": 11,
            "author": "melikestoread",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah we like our market manipulation domestic. It creates jobs!",
                    "score": 6,
                    "author": "EducationalGrass"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is great, but lets not stop here.\n\nLets look into their shady associations and dealings with Greensill.\n\nLets look into their shady associations and dealings with the Saudi wealth fund and other rather oppressive regimes.\n\nLets look into Alibaba's (a very large Softbank position) highly questionable accounting.\n\nThen I just wonder what other skeletons are hiding in their closet. I have absolutely zero doubt this pile of crap is hiding a lot of bad shit on their books, but hard to believe they will actually get hurt by it that bad in this day in age. Or rather, I'll believe it when I see it.",
            "score": 4,
            "author": "cbus20122"
        },
        {
            "level": 0,
            "comment": "Wen Citadel?",
            "score": 44,
            "author": "Cartnansass",
            "replies": [
                {
                    "level": 1,
                    "comment": "Only after the full bankruptcy. Then they'll scream it was Reddit that caused it.\n\nI don't want to be cynical, but I feel like the GME event may take a year or more to play out.",
                    "score": 31,
                    "author": "DorenAlexander",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;the full bankruptcy\n\nThe fuck are you talking about? Are you implying that Bloomberg, S3, Citadel, Melvin, and pretty much the entire financial system are in cahoots to pretend a single position only seriously hurt a minor hedge fund rather than bankrupt it? There is no full bankruptcy, you’ve been lied to by pump-and-dumpers and it’s morphed into a cult",
                            "score": 2,
                            "author": "FormerBandmate"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Softbank's controversies are usually about cartoonishly stupid mistakes, kinda like Deutsche Bank, whereas Citadel's mistakes take on a more nefarious tone but they always have at least a good enough financial industry reason behind it, kinda like Goldman Sachs.",
                    "score": 7,
                    "author": "hybridck"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 24,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 51,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; GRUB got bought by some European company.\n\nNot just some, the market leader in Europe. And one that is profitable in most of its markets.",
                            "score": 15,
                            "author": "Shamalamadindong",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "So I'm coming at this from the driver perspective.  I drive for all of the above companies (and a couple other private ones).  I don't see how *any* of them are going to achieve long term profitability.\n\nThey make their money in two ways:\n\n* 15% to 35% of order value from the restaurant\n\n* Delivery/service fees paid by the customer\n\nBoth of these are going lower with time.  Many states are legislating 15% caps on restaurant fees.  They are trying to pass these fees to the consumer while simultaneously racing to the bottom to compete against each other.\n\nOn the driver end, pay is becoming a major issue.  It used to be that about half the drivers would accept anything and the other half were the \"cherry pickers\" (only taking high tipping orders).  Add in surging gas prices and there is now a lack of drivers in many places.\n\nNow everyone is trying to cherry pick, and the existing cherry pickers (like me) are getting even pickier.  I only accept about 2%-7% of orders sent to me, depending on app.  Doordash is already reducing delivery distances in a lot of their markets because they can't get orders delivered.  I was delivering hour-late food on Uber tonight because they had no tip (Uber paid me 4x base pay to do it, which itself is unprofitable).\n\nI just don't see it.  But I could also be really biased here.  I see further consolidation in this industry post-covid.",
                                    "score": 25,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "For context, in the case of TKWY (who bought Grub) either they or the restaurant directly employ the delivery guys. There's no dynamic pricing nonsense.\n\nGrub is a gamble for them but the European part is working well.",
                                            "score": 6,
                                            "author": "Shamalamadindong",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I'll have to look into how that works.  DASH, UBER, and every other gig app fights tooth and nail to avoid employment reclassification because it's even less profitable with U.S. employment laws (See AB5 and Prop 22 in California).  Maybe there's a way to make it work though?",
                                                    "score": 5,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Uber just lost a case to the U.K's supreme court and are currently about to reclassify 70,000 drivers. Strangely Uber Eats seems unaffected by this ruling for now. Only Uber Drivers in the United Kingdom will recieve these benefits, \n\n\"...the minimum wage, pensions and holiday pay,\"\n\n\n\nhttps://www.google.com/amp/s/www.cbsnews.com/amp/news/uber-drivers-uk-employees-minimum-wage-holiday-pay/",
                                                            "score": 4,
                                                            "author": "ComposedStudent",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Non-AMP Link: [https://www.cbsnews.com/news/uber-drivers-uk-employees-minimum-wage-holiday-pay/](https://www.cbsnews.com/news/uber-drivers-uk-employees-minimum-wage-holiday-pay/)\n\nI'm a bot. [Why?](https://np.reddit.com/user/NoGoogleAMPBot/comments/lbz2sg/) | [Code](https://github.com/laurinneff/no-google-amp-bot) | [Report issues](https://github.com/laurinneff/no-google-amp-bot/issues)",
                                                                    "score": 3,
                                                                    "author": "NoGoogleAMPBot"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[deleted]",
                                                                    "score": 1,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "It says they will earn AT LEAST the minimum wage, and can earn more. So if you clock in for an hour and only make 1 successful delivery, the driver will get paid minimum wage.",
                                                                            "score": 2,
                                                                            "author": "Squirmin"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Wait, you have to enter a tip before you get your food?",
                                            "score": 2,
                                            "author": "RidingYourEverything",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yes, which is why most people are not tipping.",
                                                    "score": 3,
                                                    "author": "_aliased",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "And they probably have long delivery times and get cold food.  Because it's not really tipping anymore.  You're actually bidding on service.",
                                                            "score": 4,
                                                            "author": "Flfhead"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "It shouldn't be called tipping.  It's bidding for faster service.  That just wouldn't pass PR and marketing.",
                                                    "score": 3,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt; There was a good while where Doordash ran out of cash multiple times.\n\nI mean, isn't that how it goes for most \"fast growing tech startups\"? They make losses, without investor money they'd be broke in no time",
                            "score": 5,
                            "author": "schrowawey",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The only post I looked for in this thread.",
                    "score": 3,
                    "author": "Altnob"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So if I understand correctly the SEC will investigate SoftBank but won't investigate Melvin Capital or Citadel for blatant manipulation against GME and AMC?",
            "score": 76,
            "author": "ChewiezFF",
            "replies": [
                {
                    "level": 1,
                    "comment": "Does it matter? Softbank will be fined a small amount for getting caught and then be back to business.",
                    "score": 31,
                    "author": "Momoselfie",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Those fines are classified as CODB = Cost Of Doing Business. All fines do is make companies figure a way around it next time.",
                            "score": 10,
                            "author": "san_serifs"
                        },
                        {
                            "level": 2,
                            "comment": "SEC is full of baby back bitches who open their assholes to get raw dogged by all these banks and hedge funds smh",
                            "score": 5,
                            "author": "icecube373"
                        },
                        {
                            "level": 2,
                            "comment": "Getting caught doing what exactly? Being a whale is not illegal, is it?",
                            "score": 1,
                            "author": "make_love_to_potato"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Point to me the \"blatant manipulation\"",
                    "score": 8,
                    "author": "WeenisWrinkle",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I saw some memes so it must be true. I also get all my medical information from Facebook.",
                            "score": 21,
                            "author": "IamLeven"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;\tMelvin Capital or Citadel for blatant manipulation against GME and AMC?\n\n&gt;\tAMC\n\n😂😂😂They didn’t do anything wrong. Also how tf did AMC become a #2 meme stock since GME was always the better play from the beginning",
                    "score": 4,
                    "author": "I_Shah",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Better play from the beginning? AMC will actually have revenue coming in as restrictions lift, GameStop has to pull a full 180 and insert themselves into a heavily saturated online gaming market. Gme was definitely the better play in hindsight, but not because of their future earning potential",
                            "score": 5,
                            "author": "Ko8iWanKeno8i"
                        },
                        {
                            "level": 2,
                            "comment": "Hahaha if you think that and support this post then you don't understand what is happening but I wish you the best!",
                            "score": -6,
                            "author": "ChewiezFF"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "nobody gives a fuck",
                    "score": 1,
                    "author": "Freestyle7674754398"
                },
                {
                    "level": 1,
                    "comment": "Keep in mind, we're only hearing about Software well over half a year after they manipulated the market.\n\nIf they keep this glacial pace up we'll hear about Melvin Capital and Citadel at the end of this year...",
                    "score": 1,
                    "author": "ShadowLiberal"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You know, this makes me wonder if Softbank is insolvent.\n\nWhy?\n\nBecause Japan was selling a fuckton of 10y treasuries, which drove up the interest rate. There had to be a reason for that. \n\nAnd now I read about Softbank being crazy leveraged into tech, which has just been shitting the bed too.\n\nVery interesting correlation.",
            "score": 9,
            "author": "Megahuts",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Honestly how do they just print so much damn money",
            "score": 17,
            "author": "Puzzleheaded_Top447"
        },
        {
            "level": 0,
            "comment": "Anybody see the movie the Big Short?  How many wall street bankers went to jail over the 2008 subprime mortgage crisis?  If the movie was right, the answer is 1 for a few months.  Nothing changed either.  Look up Collatorized Debt Obligations called CDOs.",
            "score": 3,
            "author": "Brilliant_Effective3"
        },
        {
            "level": 0,
            "comment": "I’m so glad I sold my remaining shares a couple weeks ago",
            "score": 7,
            "author": "parisinnovember",
            "replies": [
                {
                    "level": 1,
                    "comment": "I read the post twice looking at this message thinking this is the reason why stock market is down.",
                    "score": 9,
                    "author": "InsideJoy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Nothing burger",
            "score": 4,
            "author": "iggy555"
        },
        {
            "level": 0,
            "comment": "Never go soft...",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Softvank - we just like this stock. And growing up as a small boy in Japan....",
            "score": 2,
            "author": "Yojimbo4133"
        },
        {
            "level": 0,
            "comment": "Anybody responsible for 401ks better stay far the fuck away from GME shorts. Anybody who does can go sit in the corner with melvin",
            "score": 2,
            "author": "Some1realer"
        },
        {
            "level": 0,
            "comment": "Fuck the sec, turning a blind eye to some and helping others with bigger pockets.",
            "score": 2,
            "author": "AzraelRoze"
        },
        {
            "level": 0,
            "comment": "But GME price attacks not worthy?",
            "score": 2,
            "author": "Green_Lantern_4vr",
            "replies": []
        },
        {
            "level": 0,
            "comment": "When you are a VC company that invests in software, of course it is going to make risky plays, especially in the tech scene.  Not all investments are going to work out, but this is part of the main loop of capitalism.  When you get big, you can more reasonably afford to make higher risk plays.  Even if you don't make money out of it, your investment helps to keep money moving and those funds may help other individuals make their own companies with the experiences they have accrued.",
            "score": 5,
            "author": "MechCADdie"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 5,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Probably was driving tech down all this time. Now that it's news it might change the course. Sell the rumor buy the news. Works both ways.",
                    "score": 2,
                    "author": "WoodGunsPhoto"
                },
                {
                    "level": 1,
                    "comment": "Rip to all my bullish plays",
                    "score": 2,
                    "author": "ImprSLF"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Okay, now do Citadel.",
            "score": 3,
            "author": "Retrograde_Bolide"
        },
        {
            "level": 0,
            "comment": "I bought AMD and NVDA around 14th or 15th this month. This is a great learning experience. I downloaded a widget on my home screen that shows both those stocks and their performance and my god is it gut wrenching to see them fall. Those 500 euro that I invested will most likely result in more knowledge for me than all the dozens of hours of book reading and video watching. Imo 500 euros well spent, even if they crash and burn.",
            "score": 3,
            "author": "z3bru",
            "replies": []
        },
        {
            "level": 0,
            "comment": "What about Melvin and Citadel?  Lol",
            "score": 7,
            "author": "PeterPiperRocker16",
            "replies": [
                {
                    "level": 1,
                    "comment": "What did they do? Like other than the Q Anon caliber conspiracies pushed here every day.",
                    "score": -2,
                    "author": "WeenisWrinkle",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You're either ignorant or a troll.",
                            "score": 3,
                            "author": "frndlthngnlsvgs",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Asking for evidence for conspiracy theories makes me a troll?",
                                    "score": 4,
                                    "author": "WeenisWrinkle",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Mind explaining the flash crash that happened on March 10 or January 28? Definitely not caused by the shorts, just retail casually selling. /s",
                                            "score": 1,
                                            "author": "Mikiino"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Now do cathie",
            "score": 3,
            "author": "Boston_Bruins37"
        },
        {
            "level": 0,
            "comment": "Short everything SoftBank has touched",
            "score": 2,
            "author": "Yourmombythefire"
        },
        {
            "level": 0,
            "comment": "In what world would buying call options and shares in companies you own be considered even remotely illegal or questionable? This investigation is meritless and is hilarious.",
            "score": -24,
            "author": "drhuehue",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;\tIn what world would buying call options and shares in companies you own be considered even remotely illegal or questionable?\n\nIn a world where they are *allegedly* aware of the fact that those purchases will be significant enough to result in additional buy pressure from market makers due to their need to hedge out said options positions.  \n\nhttps://papers.ssrn.com/sol3/papers.cfm?abstract_id=2123965",
                    "score": 27,
                    "author": "MasterCookSwag",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Isnt that what happened to GameStop though?",
                            "score": 6,
                            "author": "tsaf325",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah I mean there’s some combination of organic longs, short covering, and MM hedging of calls that drove GME up, but that isn’t really illegal or whatever.  Market manipulation requires the deliberate attempt to impact the free flow of markets with the intent of moving a stock price up or down, there are some qualifiers for “social harm” too. \n\nThe legalities can get pretty in the weeds pretty fast, so like a super high surface level one could say that if a bunch of people decide they think a stock is going to go up and they buy calls, forcing a MM to hedge out the exposure which pushes up the stock then that’s just a result of market mechanics.  If a single or coordinated group of large buyers decides to purchase calls with the intent of driving the price up specifically because of said hedging then that’s market manipulation.  I’d assume it’s going to be quite difficult to prove but we shall see. \n\n\n\nIf you’d like to read more there’s some writings on the legal theory here, as a warning it does get fairly in the weeds. \nhttps://repository.law.umich.edu/cgi/viewcontent.cgi?article=2978&amp;context=articles\n\n\nThe thing is, since the legalities and case law are so undefined here it’s tough to say what if anything would come of this, the closest thing I can think of is the JPM Silver case, but that’s still significantly different.  Most cases of market manipulation are tied to materially false statements, and those that are tied to trades are usually in far less liquid markets/securities.  So I guess it’ll be interesting to watch at the very least.",
                                    "score": 2,
                                    "author": "MasterCookSwag"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Any bearing on the NVIDIA deal?",
            "score": 1,
            "author": "DaneCurley"
        }
    ]
}