{
    "id": "n0ojht",
    "score": 3408,
    "title": "Apple reports another blowout quarter with sales up 54%, authorizes $90 billion in share buybacks",
    "author": "Kanolie",
    "date": 1619643193.0,
    "url": "https://www.reddit.com/r/investing/comments/n0ojht",
    "media_urls": [],
    "other_urls": [
        "https://www.cnbc.com/2021/04/28/apple-aapl-earnings-q2-2021.html"
    ],
    "postText": "Apple reported a blowout quarter on Wednesday, announcing companywide sales up 54% higher than last year, and significantly stronger profits than Wall Street expected. \n \nApple did not issue official guidance for what it expects in the quarter ending in June.\n\nHere’s how Apple did: \n\n* EPS: $1.40 vs. $0.99 est.\n* Revenue: $89.58 billion vs. $77.36 billion estimated, up 53.7% year-over-year \n* iPhone revenue: $47.94 billion vs. $41.43 billion estimated, up 65.5% year-over-year \n* Services revenue: $16.90 billion vs. $15.57 billion estimated, up 26.7% year over year \n* Other Products revenue: $7.83 billion vs. $7.79 billion estimated, up 24% year-over-year \n* Mac revenue: $9.10 billion vs. $6.86 billion estimated, up 70.1% year-over-year \n* iPad revenue: $7.80 billion vs. $5.58 billion estimated, up 78.9% year-over-year \n* Gross margin: 42.5% vs. 39.8% estimated \n* Apple authorized $90 billion in share buybacks.\n\nhttps://www.cnbc.com/2021/04/28/apple-aapl-earnings-q2-2021.html\n\nIncredible beat by Apple, beats expected revenue by over $12 billion for the quarter.",
    "comments": [
        {
            "level": 0,
            "comment": "I just don't know why I didnt make my portfolio 50% Apple and 50% Microsoft. Why do I bother with random weed and EV stocks lmao",
            "score": 1347,
            "author": "Stonkslut111",
            "replies": [
                {
                    "level": 1,
                    "comment": "Greed and instant gratification",
                    "score": 471,
                    "author": "DapperAd8388",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My ETF is 12 apple and 10% ms and it still shit the bed today",
                            "score": 72,
                            "author": "BoonTobias",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This earnings report came in after close so you would see the reaction in the share price in the next session",
                                    "score": 41,
                                    "author": "pragmojo",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It’s currently headed down, loading the springs persay",
                                            "score": 5,
                                            "author": "Le_Tache"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Agreed, I’d be do way better than I am over last couple months, and with a lot less research!",
                    "score": 50,
                    "author": "pjcruiser14",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Samesiesssss.",
                    "score": 8,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is the final straw. I’m going all in on Apple when it dips next. Tim Cook is Jesus &amp; when he leaves there’s plenty of people like Federighi to take his place. Apple is more stable then most countries",
            "score": 128,
            "author": "aids333333",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; when it dips\n\nAAPL may never see 130 again at this point",
                    "score": 36,
                    "author": "Walden_Walkabout",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah this is the dip. Buy now.",
                            "score": 7,
                            "author": "Oo0o8o0oO",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Sure thing. That’s what people were writing last August when it peaked at $134-5 or so, only to dip by more than $30 in September. Never say never.",
                                    "score": 6,
                                    "author": "SubvocalizeThis",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Today be your chance lol",
                    "score": 9,
                    "author": "Biocube16",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "&gt; Apple is more stable then most countries\n\nApple's credit rating is AA+, only ten countries' sovereign debt is higher.",
                    "score": 5,
                    "author": "ImagineAllTheKarma"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Are we not clearly heading towards a future where the top 5 companies make up the majority of the US stock market?",
            "score": 717,
            "author": "hallcyon11",
            "replies": [
                {
                    "level": 1,
                    "comment": "Really.  For someone who thinks \"That's madness\", somebody should invent the S&amp;P 490 -- same as the 500 with**out** the top 10.",
                    "score": 415,
                    "author": "DeeDee_Z",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It won't have enough market cap to offer any liquidity tho, ha ha.",
                            "score": 229,
                            "author": "RoseGardenMassacre"
                        },
                        {
                            "level": 2,
                            "comment": "I would buy an S&amp;P 420",
                            "score": 160,
                            "author": "moonsidian",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Start with $MSOS 😉",
                                    "score": 28,
                                    "author": "NextTrillion",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "My Dec 47c could use some help plz",
                                            "score": 9,
                                            "author": "groundzr0",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "At least you’re in until Dec. some of these guys were buying April / May calls 😬",
                                                    "score": 3,
                                                    "author": "NextTrillion"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "This does exist to *some* extent via the S&amp;P 500 equal weight, where every company is given the same weight (1/500th of the index).",
                            "score": 90,
                            "author": "rockinoutwith2",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Seems like an odd premise",
                                    "score": 18,
                                    "author": "TheOtherSomeOtherGuy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Someone on reddit said it actually has outperformed the normal S&amp;P",
                                            "score": 30,
                                            "author": "billbrown96",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yep, up +18% YTD vs the regular S&amp;P at +13%",
                                                    "score": 27,
                                                    "author": "rockinoutwith2",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Supposedly it's outperformed for like a decade+\n\nSPYX I think?",
                                                            "score": 12,
                                                            "author": "billbrown96",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Makes sense. The top companies are going to be your steady returns, but you'll be catching a lot of hot companies in their rapid growth stage as they enter.",
                                                    "score": 3,
                                                    "author": "CmdrMobium"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Check out $RSP\n\nNot odd at all. I've read a bunch of white papers and every one concludes that equal weighting theoretically will outperform cap weighted over the long run. It makes sense considering the following facts: 1) only 40% of stocks will make money, and the rest are losers, and 2) over the long run, 100% of gains comes from 4% of stocks. \n\nIt's really hard to pick stocks, so you need to just hold all of them. The most a stock can lose is 100%, but your winners are unbounded. If you hold an equal weighting of 10 stocks, and 9 of them lose money, if your tenth goes up 10x, you're fine. Same cannot be said if you're cap weighted - it would depend on which one it was. Theoretically, it's harder for massive companies to grow 10x compared to smaller companies, but the last 10 years would beg to differ.\n\nEdit: Added link: https://www.marketwatch.com/story/fear-the-faang-stocks-heres-a-better-sp-500-index-fund-for-you-2018-07-26",
                                            "score": 11,
                                            "author": "undefined_reference",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "The premise is that it overweights value and underweights growth. As growth stock have huge increase in multiples (high PE etc) they will become underweighted relative their market weight.\n\nAlso the aim is to diversify and \"own a bit of everything\". Since no one can predict the future, your best bet is to own a bit of every company, to take part in their rise. The key here is take part in the rise, not buy in after the rise.\n\nIf you solely buy into market cap weight, you are mostly buying into businesses who have already have a big rise. Which may sound good, buy good companies right? But there is no guarantee that it will continue into the future. And seeing huge increases, means that even more huge increases get less and less likely.\n\nThis is where many make the mistake in investing. They buy the hot stock that has already ballooned. You always have to ask yourself, \"what is going to happen with this stock tomorrow?\". Not \"what happened to it yesterday?\".\n\nWhile momentum investing has some merit, it's a dangerous game, and you gotta be quick both in and out. Which means timing. And the market will out-time you 99 out of 100 times.\n\nAnd then you have AAPL, a trillion dollar company that grows like it's a million dollar company, so what do I know.",
                                            "score": 5,
                                            "author": "spock_block"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Let me introduce you to Mr. Vanderbilt, Mr. Pichai \n\nLet me introduce you to Mr. Rockefeller, Mr. Bezos\n\nLet me introduce you to Mr. Morgan, Mr. Cook\n\nLet me introduce you to Mr. Carnegie, Mr. Nadella \n\nLet me introduce you to Mr. Hearst, Mr. Zuckerberg",
                    "score": 93,
                    "author": "bcuap10",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hearst and Zuckerberg both have good, nasty movies about them, but only WRH had the good fortune to have Marion Davies as his mistress.",
                            "score": 14,
                            "author": "baycommuter",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Check out Hearst Castle if you ever have a chance, Its a great tour.  And its on the most magnificent drive in the US",
                                    "score": 8,
                                    "author": "OakTreesForBurnZones"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Not only that, there's a chance we're heading for a future where a small list of companies will be more powerful than the entire government of that country. Think about this sentence again, in the future there's a chance of a private company in a country being more powerful than that entire government that rules that country. It's crazy to think about. I believe that would be uncharted territory and that has never happened before, but maybe it has happened in our history somewhere.",
                    "score": 49,
                    "author": "Berisha11",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "East India Company",
                            "score": 110,
                            "author": "RedditorOnReddit2"
                        },
                        {
                            "level": 2,
                            "comment": "I don't think they're de facto \"more powerful than the entire government,\" but Samsung is pretty influential in South Korea.",
                            "score": 20,
                            "author": "phsics"
                        },
                        {
                            "level": 2,
                            "comment": "It's already the case but means nothing. Big corps are more powerful than most nation states, that makes little difference though",
                            "score": 31,
                            "author": "TheNorrthStar"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Other companies need to start doing better or these companies have to start doing worse. Either way, if momentum is maintained, it's only a net gain for investors.",
                    "score": 21,
                    "author": "HulksInvinciblePants",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Except when other companies do better they just get bought by the top companies. Obviously there are exceptions, but that has been the trend.",
                            "score": 33,
                            "author": "Stuck_in_a_thing"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yes",
                    "score": 7,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "For the past 10 years I asked myself at least once a month, \"Why is my portfolio not 100% AAPL?\"\n\nToday I ask myself that question once again.",
            "score": 1354,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have failed to rebalance my portfolio that is currently 50% Shopify. For the last few weeks I've been kicking myself for not doing it. Today I'm the happiest dumbass on Reddit.",
                    "score": 231,
                    "author": "porscheblack",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "10% today. My biggest holding.",
                            "score": 69,
                            "author": "TeamKitsune",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I had been failing to rebalance away from Apple for nigh on 23 years when last summer I finally diversified into real estate. Apple is still my largest holding.",
                            "score": 5,
                            "author": "AllanBz"
                        },
                        {
                            "level": 2,
                            "comment": "95% Shopify here. Happy asf",
                            "score": 33,
                            "author": "ImAtWurk"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "If I had bought a dollar's worth of Apple stock for every dollar I've spent on Apple products over the last 15 years I'd be in a very different place",
                    "score": 40,
                    "author": "ImagineAllTheKarma",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "They are not stopping either. M1 chip is just a start of something friggin amazing.",
                    "score": 377,
                    "author": "EClarkee",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yea everyone is leagues behind now and will take years to catch up.  Look at QCOM/Nuvia, they MAY be able to catch up but I doubt it.",
                            "score": 120,
                            "author": "WorkingLevel1025",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 325,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Actually, if you belive the rumors, it's already in production. I would not be surprised if the M2 shows up on the 16\" MacBook Pro\n\n[https://www.macrumors.com/2021/04/27/apple-m2-mac-chip-enters-mass-production/](https://www.macrumors.com/2021/04/27/apple-m2-mac-chip-enters-mass-production/)\n\nI'd be willing to wager the M3 is already designed and in testing phase.",
                                            "score": 97,
                                            "author": "thedarkhalf47",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I mean it's common practice of business to have a 5+ year lead time when it comes to developing any new product, so I wouldn't doubt it.",
                                                    "score": 28,
                                                    "author": "SomethingMusic"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "You've convinced me. Short apple",
                                            "score": 58,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "lol i am not a finance guy, so take my words to mean whatever it means financially. I am describing apple as an industry insider electrical engineer who works for a similar company.",
                                                    "score": 31,
                                                    "author": "not_creative1",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I think theyre saying that since you convinced them, theyre going to buy apple stock, and then it will fall because they just bought",
                                                            "score": 67,
                                                            "author": "ElegantBiscuit",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "The ole WSB philosophy. \n\nHappy cake day!",
                                                                    "score": 4,
                                                                    "author": "po_panda",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt; Volume. Apple's volumes are so insane, very very few companies have the volume apple has in this world, so they get great pricing for components. No vendor in the world will reject apple as a customer, everyone will do whatever it takes to retain apple as a customer and gives them the highest attention (see: TSMC)\n\nTSMC is completely maxed out on capacity. If Apple didn't take up that capacity, there are plenty of other companies that would (AMD, Nvidia, etc.) Given the semiconductor shortage going on right now, Apple is likely paying a premium for TSMC's fabs. The price difference is likely the reason why Nvidia went with Samsung fabs for their new cards as opposed to TSMC. While doing so leaves probably leaves some performance on the table, they're so ahead of the competition they don't have to worry about it.",
                                            "score": 22,
                                            "author": "beyphy",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It really is hard to overstate how much runway there is for the M1 chip. \n\n&amp;#x200B;\n\nUnless you are a hardcore gamer, every other computer on the market just got absolutely outshined on their first attempt. Once everything is optimized, and they throw in more cores, even heavy pro workflows will be easily attainable on a fanless laptop. \n\n&amp;#x200B;\n\nIncredible. \n\n&amp;#x200B;\n\nI say this as someone who was once a huge apple user, but has gravitated away.\n\n&amp;#x200B;\n\nThere are no breaks on this train.",
                            "score": 6,
                            "author": "mellofello808",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I dont have AAPL in my Portfolio directly, because in the time around 2013-2015 (or so) i thought: yep, their magic's gone.",
                    "score": 98,
                    "author": "vogt935",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They were trading at 8-10x earnings back then! What a steal.",
                            "score": 94,
                            "author": "Kanolie",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Really? I'm such an idiot. I've been telling people since 2010 they finally figured out the software/hardware problem so our parents can use computers, finally.   \n\n\nAnd you're telling me that a few years later they were still \"relatively cheap\" to the PE of 20-30 we see everywhere today!?",
                                    "score": 18,
                                    "author": "nusodumi",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah, Apple was priced to shrink for a few years.  Apple doesn't talk about its future plans so the default assumption seemed to be it didn't have any, I guess.\n\nBuying in 2014-2016 was either showing faith in management, or thinking that at the very least their customer base won't shrink and will replace their devices about every 4 years.  I was mostly the latter and a little the former.",
                                            "score": 12,
                                            "author": "Worf_Of_Wall_St"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 110,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ditto. When my dad died in 2000, he left me $5k in AAPL. And at the instructions of a guy at Merril, I sold it for some mutual funds.\n\nEvery year or two I do the math.. then weep like a little girl with a skinned knee.",
                                    "score": 115,
                                    "author": "thedarkhalf47",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I know your pain. I had $6K of AAPL in an IRA in 1986. I had to cash out to make house payments when the oil field tanked. Lost the house anyway.",
                                            "score": 36,
                                            "author": "wtocel",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "thanks for this perspective/sharing your life \"lesson\" (experience)  \n\n\nwhat a bitch that is!",
                                                    "score": 15,
                                                    "author": "nusodumi",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "On the plus side, my ex wife didn’t get half of the millions I would have made so I’m happy about that lol",
                                                            "score": 15,
                                                            "author": "thedarkhalf47",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Predicting 20 years into the future is more than impossible. No point fixating on that (I know you mean it jokingly), just find the next AAPL now",
                                            "score": 51,
                                            "author": "BruceStark",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "So much this.\n\nInternally, you should always ask yourself \"Ok, that was a huge miss from me and I learned so much from it. Now, knowing what I know now, what investment is going to 10-15x over the next 5 years?\"\n\nNewsflash - you'll still be holding your ass not knowing what is going to happen just like you-15 years of living was.",
                                                    "score": 18,
                                                    "author": "EliminateThePenny"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 15,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Owie 😣\n\nYa know I remember back in 07/08 during the market crash I tried getting my parents to buy me AAPL stock. But since I was 7/8 around the time I was dismissed \"That's not how the market works\" they said. \"You're supposed to buy low and sell high not the other way around!\" they said.\n\nI still remind them about that...",
                                            "score": 13,
                                            "author": "superepicunicornturd",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I've had that dream where my adult consciousness is in my toddler body trying to convince my parents to just buy microsoft until 2001, sell it all, and buy apple",
                                                    "score": 5,
                                                    "author": "MattieShoes"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "DUDE RIGHT, this was me in 2008 with Amazon. I pitched them in high school for a stock market competition, at the time knowing very little about their business model. Just really liked books and buying stuff online lol. \n\nI must've said something semi-smart because I won the competition. I was all gassed up and trying to convince my parents to dump my summer job savings in it ($1k at the time). Trading around $60 a share IIRC. \n\nFollowed up every year up until 2019. They never listened to me. Loooooove reminding them about it :)",
                                                    "score": 4,
                                                    "author": "DeadAsspo"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "So I should buy apple.",
                    "score": 8,
                    "author": "bendy_snoot",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Naw bro\n\n-Sent from my iPhone",
                            "score": 9,
                            "author": "RaidenXVC"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 19,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Is it too late to buy some now?",
                    "score": 10,
                    "author": "streetbetshunt",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Its up only around 2% since the news hit.  I'm buying tomorrow and never selling.",
                            "score": 12,
                            "author": "OakTreesForBurnZones"
                        },
                        {
                            "level": 2,
                            "comment": "No",
                            "score": 17,
                            "author": "golfjunkie"
                        },
                        {
                            "level": 2,
                            "comment": "Nope\n\nI’ve never met someone that left the Apple ecosystem once they were in",
                            "score": 26,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I was in, and I left the first chance I got.",
                                    "score": 32,
                                    "author": "Spydude84",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm completely out but doesn't mean I can't love the stock.   \nI don't love Apple products at all, I'm just glad other people do.",
                                            "score": 19,
                                            "author": "I_can_vouch_for_that",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Looots of people leave the Apple ecosystem once in.  Lots of new people going into it too.\n\nHonestly I'm a little worried for AAPL once the boomers stop buying phones.  Not worried enough to sell my AAPL shares, but still... :-)",
                                    "score": 13,
                                    "author": "MattieShoes",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I got 4 nephews under the age of 12. The two that can get phones now only want apple. This company has dug it’s claws deep. Helps that lots schools buy ipads and imacs for their student bodies. I wouldn’t worry too much.",
                                            "score": 8,
                                            "author": "Cactus1986",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Funny cause I have about 25% of my portfolio in apple and my advisor freaks out every time I talk to him, I’ve told him basically to shut the fuck up about till they post a losing quarter. \n\nAround 2006 I had 50% and that dumbass advisor convinced me to sell and diversify right into the crash of 2008. I don’t put allot of stock in their advice aside from do I have enough to retire at my current trajectory.",
                    "score": 39,
                    "author": "bajazona",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 123,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wow, Apple is smoking it. Apple is raking in more than $1 billion revenue per day now and with a gross margin at 42.5%, that is almost $420 million per day, $17.5 million dollar per hour, almost $300k per minute, and $5k every second.",
            "score": 433,
            "author": "Force_Professional",
            "replies": [
                {
                    "level": 1,
                    "comment": "Apple made more money in the time it took me to type this than I will make all year.",
                    "score": 110,
                    "author": "Downside_Up_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 9,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No, it took me about 35 seconds to type, so around 165k.",
                                    "score": 18,
                                    "author": "Downside_Up_",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "If you practiced your typing skills that ratio would drastically improve",
                                            "score": 13,
                                            "author": "stewwwwart",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "But how much are they making every millisecond?",
                    "score": 9,
                    "author": "ocular__patdown",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "AWS leans in",
                            "score": 10,
                            "author": "hammilithome"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;$89.58 billion vs. $77.36 billion estimated, up 53.7% year-over-year\n\nThat's almost United States Defense Department budget ballpark.",
                    "score": 140,
                    "author": "barftop1001",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No it’s not\n\nYou’re off by 2.5x",
                            "score": 52,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I guess if you’re going to compare the dod annual budget to apples quarter for some reason (?) you’d be right?",
                                    "score": 72,
                                    "author": "toad_salesman",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Did you copy and paste this from your same comment on the AAPL earnings post in r/stocks",
                    "score": 9,
                    "author": "KenSpliffeyJr"
                }
            ]
        },
        {
            "level": 0,
            "comment": "90 Billion Buy Back. Lol",
            "score": 328,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "What do buy backs do for a company?",
                    "score": 99,
                    "author": "drdois",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Convince shareholders to continue to invest",
                            "score": 301,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Also reduces the outstanding shares.",
                                    "score": 204,
                                    "author": "blingblingmofo",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 152,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Ditch the IRS while returning money to shareholders unlike dividends",
                                                    "score": 53,
                                                    "author": "TheRealAndrewLeft"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "They’re like dividends except:\n\n* They are more tax efficient \n* There’s an unspoken rule that a company should never cut dividends. This rule doesn’t apply to stock buybacks, so also more flexible.",
                            "score": 165,
                            "author": "ffn",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "It is a method of returning cash to shareholders. It's been more in favor among corporations lately because its a shorter term commitment/more flexible than a dividend.",
                            "score": 52,
                            "author": "liberrimus_roob",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Investors prefer it, too. It's more favorable taxwise.",
                                    "score": 27,
                                    "author": "SteveAM1"
                                },
                                {
                                    "level": 3,
                                    "comment": "I would have preferred the one time special dividend of $7 per share. Kind of like what Costco did at the end of 2020 with their$10 per share special dividend",
                                    "score": 4,
                                    "author": "heavydhomie",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Except then you have to realize that as a gain immediately, instead of at a time of your choosing. You can always just sell the equivalent value in shares if you want to.",
                                            "score": 4,
                                            "author": "rich000",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Increases share price due to supply and demand economics.",
                            "score": 71,
                            "author": "redfour0",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "In a sense, yes. But also (and more importantly in the long term), each outstanding share represents a larger percentage of the business following a buyback. That results in more revenues/earnings per share, all else equal.",
                                    "score": 47,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "But it comes at the cost of equity though - that cash that AAPL used to buyback stock, you used to have a part of technically, as a shareholder. Now you don't anymore since they used it up. Mathematically it does nothing *directly* to the stock price. But it (usually) signals to investors that a company has some confidence in itself and that the future looks good. They wouldn't be buying their own shares if they think dark times are ahead (unless management is just pumping up their own compensation).",
                                            "score": 17,
                                            "author": "Lunar_Melody",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Idk why you were downvoted, this is pretty accurate. Additionally, I’d say that in general (and Tim Cook has said this specifically) companies won’t buy back shares if they don’t believe their stock is overvalued or even adequately valued. It only makes sense to buy shares if you 1. Have additional liquidity that you don’t need for reinvestment, and 2. Think your stock is undervalued. If you felt like your stock was adequately valued then you would just keep the cash.",
                                                    "score": 5,
                                                    "author": "XSavageWalrusX"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Also the company can sell treasury stocks as necessary if they need liquidity (not that Apple is in any danger of needing cash)",
                                            "score": 6,
                                            "author": "SomethingMusic"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 25,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Increase the % of the business owned by each shareholder by creating a liquidity event for some shareholders",
                            "score": 9,
                            "author": "guitmusic12"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is part of what will continue to push equity markets higher. It was put on pause last year due to the pandemic.",
                    "score": 9,
                    "author": "justchillingbro"
                },
                {
                    "level": 1,
                    "comment": "That’s nice. A special one time dividend would have been nice for the shareholders.",
                    "score": 3,
                    "author": "mydogsnameisbuddy",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lmao maybe I should just make my portfolio 50% AAPL and 50% GOOG.",
            "score": 49,
            "author": "Scalermann",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’d bet on Apple outliving you.",
                    "score": 29,
                    "author": "failingtolurk"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Up 50% YoY during a period of high unemployment... That's insane. What a powerhouse",
            "score": 175,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Guess we know where those stimmy checks went lol",
                    "score": 91,
                    "author": "Iwouldbangyou",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "One can guess the other company stimmy checks went to. A company that's about to report tomorrow..\n\n..\n\n\n...\n\nMCDONALD'S!",
                            "score": 23,
                            "author": "scarface910",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Puts on ice cream machines",
                                    "score": 5,
                                    "author": "BoonTobias"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "90 billion in stock buyback plus 7% increase in dividends. Great stock to own both for growth and income.",
            "score": 161,
            "author": "sandseb123",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 73,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Because both Facebook and Google are growing revenue faster than Apple, and  all three of them are at about 4.2% earnings yield. Which means if their earnings yield stays comparably the same, and that gets arbitraged away quickly, both Google's and Facebook's share price will grow faster.",
                            "score": 36,
                            "author": "WilhelmSuperhitler",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Is there a difference between Google shares except one has the ability to vote?",
                                    "score": 6,
                                    "author": "afanoftrees",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They only pay 22 cents per share after this 7% increase. How is this great? That means if you own 1000 shares of AAPL you get a whopping $220 dividend. Wee.",
                    "score": 25,
                    "author": "rmwhereithappens",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Divys are not great taxwise for many ppl",
                            "score": 10,
                            "author": "HeadInhat",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I own one share of AAPL. So this is good news.",
            "score": 31,
            "author": "Jesus_De_Christ",
            "replies": [
                {
                    "level": 1,
                    "comment": "imagine holding that one share for the next 40 years. you're good.",
                    "score": 12,
                    "author": "maz-o"
                },
                {
                    "level": 1,
                    "comment": "Me too.\n\n&amp;#x200B;\n\n*The one share gang strikes again*",
                    "score": 5,
                    "author": "Laxea"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sometimes I ask myself if Apple really is so good or if other companies aren't even trying. \n\nWhat a great earnings from a 40 year old company!",
            "score": 78,
            "author": "everybodysaysso",
            "replies": [
                {
                    "level": 1,
                    "comment": "I ask myself the same thing. I think one of the biggest factors is their products are cool and sexy. People want sexy products and will pay a premium for it. No other tech company makes sexy products.",
                    "score": 18,
                    "author": "cinnamelt22",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "They’ve also just released a new $2billion profit product..",
            "score": 146,
            "author": "fnezio",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 93,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 26,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "So you don’t have much use for them, yet you’re going to buy one?  Might be closer to $10billion.",
                                    "score": 52,
                                    "author": "BlkCdr",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 11,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Said every apple user ever lol",
                                                    "score": 15,
                                                    "author": "balling"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Yo dawg, I heard you like our dongle. So here's a dongle for your dongle, so you can dingle while you dongle",
                                                    "score": 6,
                                                    "author": "spock_block",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "You would think, but 95% of people don't need an iPhone 12 pro or pro max, or any pro version of any model year, yet they probably sell +100M of the pro model every single year. \n\nAlso, since its smooth, round, and waterproof, it should have no problem just passing through. For smaller dogs and cats it might be a problem, but even still its not that big and there are plenty of other things on a daily basis that are more of a swallow risk.",
                                    "score": 25,
                                    "author": "ElegantBiscuit",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 14,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That last bit is why AAPL never leaves my portfolio.",
                                                    "score": 25,
                                                    "author": "groundzr0"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The wearables and accessories business of apple did 7.8 Billion dollars in revenue this quarter.",
                    "score": 7,
                    "author": "Kosher-Bacon"
                },
                {
                    "level": 1,
                    "comment": "I got kids. These things are essential. You know how much shit goes missing when you have a 2 year old? It’s like a giant hide and go seek the Roku remote party",
                    "score": 3,
                    "author": "bigdogc",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Could someone check my math:\n\n$90B in share buyback @$140/sh is 643MM shares, give or take. On 16.8 billion shares, that 4% of the outstanding shares brought back.\n\nSo technically, over the course of the $90B buyback program, I should expect at 4% increase in my shares earnings, assuming all things remain the same?",
            "score": 21,
            "author": "vertigo88",
            "replies": [
                {
                    "level": 1,
                    "comment": "It also reduces the amount of dividends that they need to pay out. So when they increase dividend payments by 7%, reduce share count by 4%, and increase Free Cash Flow, they are still reducing their dividend payout ratio.\n\nNot that it really matters much but I was surprised at the 7% div increase. Figured they would do 10% even with an increased buyback plan. Their free cash flow is growing so quickly.",
                    "score": 12,
                    "author": "dreamingofaustralia"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The M1 is a gamechanger for them. And this is the FIRST iteration of this chip and it's already this good.",
            "score": 88,
            "author": "DesignerTex",
            "replies": [
                {
                    "level": 1,
                    "comment": "M1 is why I started buying Apple, and boy I am glad I did.",
                    "score": 4,
                    "author": "codefragmentXXX"
                },
                {
                    "level": 1,
                    "comment": "part of me thinks that future iPhones will have M1 chips as well.",
                    "score": 23,
                    "author": "RandomVintage",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They already do in an engineering sense. The M1 is is an evolution of the work they've done on iPhone processors for years now. It's the same technology, same people building it. This is part of why this is so valuable. They're leveraging the same skills, research and technology across their whole product lineup. My guess is the iPhone processors will continue to be marketed differently but that's just marketing.",
                            "score": 33,
                            "author": "zeValkyrie"
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 4,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I would have thought so as well but the iPad Pro also has the M1 now. From a marketing perspective it'd odd to say the least since it's not a \"Mac\" in the sense that Apple does not allow it to run Mac OS.",
                                    "score": 3,
                                    "author": "hfutrell"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is Apple’s world, we just live in it.",
            "score": 93,
            "author": "f-stats"
        },
        {
            "level": 0,
            "comment": "Almost incomprehensible. Is the not issuing guidance due to having strange YoY comparison with lockdowns?\n\n\nThe gross margin increase and continued services growth is just incredible. I'm not sure what the complaints would be... Anecdotally, Siri is bad and... Ummmm their first party software is weak. From an investing they lack exposure to cloud growth like aws, azure and Google. \n\n\nIf they're spending 90 billion MORE on share buybacks maybe they're not launching a car soon. I really thought they'd hold cash for a major thing like that. But what do I know.\n\nSo apple, Microsoft, Google and Amazon will now be 55%+ of S&amp;P500 ETFs???",
            "score": 72,
            "author": "EducationUmbrella",
            "replies": [
                {
                    "level": 1,
                    "comment": "These companies don’t make up 50% of the\nS&amp;P 500",
                    "score": 5,
                    "author": "FibroDoc",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 129,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I get what you are saying, but 2% on a $2.2 trillion company is still $44 billion.",
                    "score": 268,
                    "author": "Kanolie",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, for reference, Apple has added the rough market cap equivalent of Roku or Lululemon after hours.",
                            "score": 80,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "Holy shit that’s kinda mind blowing when you put it like that\n\nEdit: Only 41 companies are worth more than 10% of AAPL",
                            "score": 149,
                            "author": "FishSand",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Also puts into perspective their stock buyback program. $90 billion sounds massive but it's just 4% of the company lol.",
                                    "score": 58,
                                    "author": "theineffablebob"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yeah. Even take some of their \"smaller\" products like Mac or iPad. The revenue alone on those products is equivalent to that of many famous companies. Either of those products is basically comparable to Coca Cola.",
                            "score": 15,
                            "author": "dlerium"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "After hours. Open market may be different.",
                    "score": 39,
                    "author": "tiltupconcrete",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "You're just lucky it's not *down* 2%",
                    "score": 24,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "Apple rarely has large % swings after earnings.",
                    "score": 6,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Apple is still the “it just works” company and the “think different” company. Their products are used widely and the amount of value that consumers extract is obvious from this blowout report.  \n\nI’ve been holding them for about 5 years now and there have been plenty of times when analyst’s thought this is the end, but they continue to do what they do. Tim Apple leading the way.",
            "score": 46,
            "author": "AptitudeSky",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 79,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "The US's COVID relief/stimulus was so effective that the poverty rate and starvation went down in 2020. The main result of the COVID economy is that a lot of middle class people have a lot of spending money because nobody could go on vacation.",
                    "score": 29,
                    "author": "astrange",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 30,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "A lot of journalists told everyone \"we only got $1200\" because they didn't qualify for any of the other benefits, since they're single middle class people with no children and didn't apply for PPP loans.\n\nAlso a lot of Europeans seem to think 100% of Americans pay 100% of healthcare out of pocket, I've noticed.",
                                    "score": 28,
                                    "author": "astrange",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The two are not mutually exclusive.  In our lifetimes there have always been the haves and the have nots.  The contrast is growing for sure, but that’s the nature of our financial laws and tax system that favor the haves.",
                    "score": 58,
                    "author": "flux8"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Assuming similar trading volume and growth that Apple would have had without the buyback, is it possible to predict how much effect the $90 billion buyback will have on the stock price?",
            "score": 6,
            "author": "TokensForSale",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well not the stock price but on an eps basis, ya. Assuming $90 billion gets purchased at a 2.4 trillion average cost, that will reduce outstanding shares by 3.75%. This will increase all future EPS by roughly 3.9% in purpetuity\n\nHow the market reacts to that is anyone's guess.",
                    "score": 11,
                    "author": "Kanolie",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Amazing news for Apple today, which means it’ll open red tomorrow.",
            "score": 18,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well if they're buying $90 billion in stock soon, then it won't be red for long",
                    "score": 6,
                    "author": "wooshock",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think this is just the start too. Imagine once they get into the EV market, batteries, more wearables, etc. Happy they are doing well and are privacy focused.",
            "score": 33,
            "author": "luclinEQ"
        },
        {
            "level": 0,
            "comment": "I don’t know how there is anyone short on AAPL anymore.  Even r/wallstreetbets won’t go there.  When they consider a YOLO investment to be too boring to post about, you know you’re doing something right.",
            "score": 29,
            "author": "flux8",
            "replies": []
        },
        {
            "level": 0,
            "comment": "My portfolio is 90% apple, the sweet baby Jesus has answered my prayers!",
            "score": 5,
            "author": "meowthor"
        },
        {
            "level": 0,
            "comment": "sure am glad i bought the dip last month",
            "score": 3,
            "author": "carlyslayjedsen"
        },
        {
            "level": 0,
            "comment": "Not that I haven't enjoyed buying shitty hyped stocks, but I really should have just gone 20% into every FAAMG stock and watched more Netflix",
            "score": 5,
            "author": "curveball3110giants"
        },
        {
            "level": 0,
            "comment": "When Apple dipped to $116 a month ago I told my friends \"this seems like free money...\" Did I invest in it? No,  I went all in on DIS for some reason and made like $1k over the next several weeks. Then I sold for like $1100 profit and bought back into DIS because I'm fucking stupid. I really hate myself right now.",
            "score": 4,
            "author": "cry0plasma"
        },
        {
            "level": 0,
            "comment": "Aaaaand its down to 136",
            "score": 11,
            "author": "Avid_Investor",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s become Apples MO....Last quarter MSFT popped close to 10% post earnings, Google over 5% and FB now over 5%.",
                    "score": 9,
                    "author": "IndyCollector24",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I feel like it has to do with Apple being priced to perfection pre-earnings.",
                            "score": 7,
                            "author": "Avid_Investor",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm picturing a post-apocalyptic society.  National governments have been obliterated, and the world is run by megacorps.\n\nSoldiers from House Apple are awaiting the attack from the combined armies of House Amazon and House Microsoft.  Will the venerable but battle-hardened knights of Duke Berkshire arrive in time to bolster House Apple's lines?\n\nMeanwhile House Alphabet sits above the fray, safe behind their massive and impervious moat, watching the coming battle in amusement.",
            "score": 11,
            "author": "ptwonline"
        },
        {
            "level": 0,
            "comment": "Lack of guidance amounts to AH movement of only ~2%, WTF. With those earnings, dividend increase, and share buyback...increase should’ve been larger.\n\nPisses me off when I see FB jump over 5%",
            "score": 20,
            "author": "IndyCollector24",
            "replies": [
                {
                    "level": 1,
                    "comment": "Part of why its not up a ton is because Apple is already trading at a huge valuation. Its P/E was at 36x earnings. It needs quarters like these to justify those growth expectations. Still, we will see the real price action tomorrow at open.",
                    "score": 40,
                    "author": "Kanolie",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It will somehow end up down...record earnings last semester and it proceeded to drop close to 15%",
                            "score": 12,
                            "author": "IndyCollector24",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Remember the story of the tortoise and the hare?  Apple is the tortoise.  Have patience and you’ll be rewarded.  I’ve held my Apple shares since 2009 just before the first iPad was announced.",
                    "score": 15,
                    "author": "flux8",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "54% revenue growth?  Crazy.  I wasnt planning to buy more apple but now i feel obligated.",
            "score": 3,
            "author": "smokeyjay"
        },
        {
            "level": 0,
            "comment": "Bought when it dipped into the 119s. Saw Buffet selling a little and thought I screwed up. Held it anyway. Up $3K. Cool!",
            "score": 3,
            "author": "Grandebabo"
        },
        {
            "level": 0,
            "comment": "Already spent my entire stimulus check on AAPL last month. Going balls deep now.",
            "score": 3,
            "author": "Free-Care-2027"
        },
        {
            "level": 0,
            "comment": "My only major criticism of Apple is the sheer volume of buybacks; while they clearly provide a value return, I feel like a long term investment in services would do better.\n\nThen again, they're already investing $400bln or close to that for new service infrastructure, so it's not too big a criticism.",
            "score": 3,
            "author": "CorneredSponge",
            "replies": []
        },
        {
            "level": 0,
            "comment": "That may be the most impressive earning beat I've ever seen. To still grow your sales by that %. Insane. That gross margin is WILD",
            "score": 3,
            "author": "hwturner17"
        }
    ]
}