{
    "id": "c2zy4d",
    "score": 6,
    "title": "New to the community",
    "author": "cypherlode",
    "date": 1561056847.0,
    "url": "https://www.reddit.com/r/berea/comments/c2zy4d",
    "media_urls": [],
    "other_urls": [],
    "postText": "My family and I have recently moved to the Berea area.  Where would a person find general info about the town?  Are there any specific things to watch for (either bad or good)?  Food, entertainment, health &amp; fitness; any of these topics and more would be helpful.",
    "comments": [
        {
            "level": 0,
            "comment": "The Mexican restaurant up the hill isn't too expensive and it's pretty good. Papaleno's and Noodle Nirvana are a little pricier but good. The Seabury Gym is free to all students and family members. Avoid Berea Coffee and Tea. If you want somewhere to hang out, Knight's Lounge is about a 15 minute walk from campus and has card games, video games, and D&amp;D. Just general nerd stuff. There's a nice park with Skateboard ramps and a walking trail down the hill near walmart. You'll find your way around, it's a small town.",
            "score": 3,
            "author": "Crunchy_Lad"
        },
        {
            "level": 0,
            "comment": "I don’t know if we’re much help here yet, there is a really active Facebook group called Let’s Grow Berea that could probably get you a ton of personal recommendations.\n\nThere’s also a podcast called The Berea Podcast that is a local couple exploring Berea after moving back after several years away.",
            "score": 2,
            "author": "stoicjohn"
        },
        {
            "level": 0,
            "comment": "Berea is a great place to live. There’s a great library, small business community and lots to do outdoors (hiking/biking/walking trails)\nThere’s a small health food store called Happy Meadows and the farmer’s market is fantastic. For food I would try Papaleno’s, Native Bagel and Noodle Nirvana. There are lots of other great options too. I agree to stay away from BC&amp;T. \nBe sure to check out Robbie books used bookstore as well.",
            "score": 1,
            "author": "truecrimecharlie"
        }
    ]
}