{
    "id": "piis1y",
    "score": 1,
    "title": "Yield protection for international students",
    "author": "maxmaratov",
    "date": 1630867624.0,
    "url": "https://www.reddit.com/r/berea/comments/piis1y",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi everyone. I'm a prospective international student who intends to apply to Berea. I've searched for average SAT for Berea, and it was around 1200. I've got 1340 on the SAT and will retake it in October, expecting at least 1400+. So I'm wondering whether Berea College does yield protection or not since getting into this college is pretty competitive.",
    "comments": [
        {
            "level": 0,
            "comment": "I doubt if yield is an issue for Berea.",
            "score": 1,
            "author": "Brief-Breadfruit4503",
            "replies": [
                {
                    "level": 1,
                    "comment": "but now you can apply to Berea via Coalition app, which makes the process of applying way easier. Don't you think that the acceptance rate will go down significantly?",
                    "score": 1,
                    "author": "maxmaratov",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The acceptance rate for international students is already in the single digits and the yield for those accepted is very high.  This is not a concern of theirs.\n\nSee page 40 of this:\n\n[https://4efrxppj37l1sgsbr1ye6idr-wpengine.netdna-ssl.com/ira/wp-content/uploads/sites/27/2021/05/2020-2021FactBookOnline-1.pdf](https://4efrxppj37l1sgsbr1ye6idr-wpengine.netdna-ssl.com/ira/wp-content/uploads/sites/27/2021/05/2020-2021FactBookOnline-1.pdf)\n\n&amp;#x200B;\n\nAcceptance rate is around 6% and yield is over 80%.",
                            "score": 1,
                            "author": "Brief-Breadfruit4503",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "omg such a low ar... could you recommend anything to get accepted to Berea as an international student?",
                                    "score": 1,
                                    "author": "maxmaratov"
                                },
                                {
                                    "level": 3,
                                    "comment": "hello! I applied to Berea 5 days ago but haven't received the link for the application portal. I've  contacted the admission office, but they just ignore me. Does Berea have the application portal at all?",
                                    "score": 1,
                                    "author": "maxmaratov",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I am not affiliated with the school and don't know what the application portal is, but it sounds like you got your application in on time.  Now, just wait for the application status update at the end of next month and do a Worldwide Wednesday virtual visit where you can ask questions.",
                                            "score": 1,
                                            "author": "Brief-Breadfruit4503",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Thank you for a quick reply! Application portal is the site of the website where you can track the missing documents, upload portfolio, and get your decision.  Many universities have the application portal, don't know if it is a case for Berea.",
                                                    "score": 1,
                                                    "author": "maxmaratov"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}