{
    "id": "3sda0c",
    "score": 8,
    "title": "Is columbia really just for actors and film majors? (Possible Transfer)",
    "author": "ToastThaKnowing",
    "date": 1447215537.0,
    "url": "https://www.reddit.com/r/colum/comments/3sda0c",
    "media_urls": [],
    "other_urls": [],
    "postText": "I go to a medium state school thats...the academics are lacking. I went with fashion merchandising but have had a change of art and want a more broad degree plan in terms of design and liberal arts. And based on my first semester of classes here I'm feeling weary about staying and just changing majors.\nMy question is how good are the liberal arts courses. Are they intellectually stimulating, will I be challenged (creatively also)? How is fashion studies? An after thought?\nNYU Gallatin was off the table, Columbia could you be my new buddy?",
    "comments": [
        {
            "level": 0,
            "comment": "The liberal Arts courses here are as hard as you make them. \n\nFor my Math credit I took Math in art and nature, it was like high school geometry and we learned some origami. I think they have gotten read of this course since. \n\nA lot of the kids at Columbia are gifted creatively but have the reading and math abilities of 5th graders.\n\nThere are honor classes in every subject and if you use ratemyprofessor.com you can find teachers that will push you more than others. \n\nAs for the creative classes (I was a Film Major, sorry) They push you to do your best but wont fail you if you are not the best of the best.\n\nColumbia is really a \"You get out of it what you put in\" kind of place. If you want to work your ass off and constantly be creating, you can. If you want to sail by and get a diploma, you can also do that.",
            "score": 5,
            "author": "supershot666"
        },
        {
            "level": 0,
            "comment": "I'm not sure about the Fashion Studies courses, but I agree 100% that Columbia is all about how driven you are. I moved to Chicago from NC solely for Columbia's Graphic Design program and I cherished every single minute of it. All of your Professors will be current professionals in their field, and many of mine even owned their own agencies downtown. Don't get me wrong, it's very easy to get caught up with the slack classmates doing just enough to get by, but if you try your hardest and take advantage of all resources on campus (note some of the best facilities in the nation) and network as much as you can, you will love it. I enjoyed my experience at Columbia....even though the student loans are absurd.",
            "score": 2,
            "author": "carockodile"
        }
    ]
}