{
    "id": "5dn4qj",
    "score": 4,
    "title": "x-post from /r/chicagoroommates - Seeking 3rd Roommate - Logan Square - 3bdrm, 1.5 Bath. $600/mo + Utilities listed in post.",
    "author": "furrogate",
    "date": 1479484783.0,
    "url": "https://www.reddit.com/r/colum/comments/5dn4qj",
    "media_urls": [
        "https://www.reddit.com/r/colum/comments/5dn4qj/xpost_from_rchicagoroommates_seeking_3rd_roommate/"
    ],
    "other_urls": [
        "http://imgur.com/a/UP9Ge)"
    ],
    "postText": "We are both (M27, F22) Sign Language Interpreting students well along in our program (1 year remaining) at Columbia College Chicago seeking a third awesome roommate. Please review the layout of the apartment along with our personality blurb and reply to this post and/or send me a private message sharing your interest in the place.\n     \nCurrently, 22F and I are looking for someone to stay with us until April 17' when our lease is up (or, someone that can stop in for a few months and find a suitable replacement to stay with us until the official lease is up in April).\n\n[Here are some pictures of the place.](http://imgur.com/a/UP9Ge)\nThe size of the 3rd bedroom (or, YOUR bedroom) is 14' x 11'4\".\n\n**Amenities:**\n\nVery Close to Blue Line (as in, you tell your cab driver to go to the blue line stop...and you are home).\n\n2 Stories\n\nIn Unit Washer/Dryer\n\nPet Friendly (No dogs allowed per the landlord).\n \n**Utilities**: Gas (approx $40-$60/mo. Depends on your cooking habits), Electric (approx $30-$45/mo.), Internet ($60/mo).\n\n**Seeking**: **December 1st move in** or later. $600 for largest bedroom out of the three.\n  \n----------------------------\n\n -  **TOP FLOOR**:\n\n3 Bedrooms (each with closet space and windows).\n\n1.0 Bath with window, Medicine Cabinet, Under sink storage, Shower/Tub, and some counter space. Linoleum flooring.\n\nHard Wood floors (in Foyer and bedrooms).\n\nCarpeted Staircase\n\n-----------------------------\n   \n - **BOTTOM FLOOR**:\n\nOne large room including the following amenities:\n\n-- **Living Room Area**\n\nLarge Tile Floor\n\nCeiling Fan with lighting\n\nOne 4.5' x 3' Window\n\nLarge 7' x 5.5' Set of Windows\n\n-- **Kitchen Area**\n\nTrack Lighting\n\nGas, 4 Top Stove with Hood Light.\n\nOven with multiple racks.\n\nDouble Bowl Sink with Spray Nozzle.\n\nPantry with Shelving.\n\nRefrigerator, Freezer.\n\nMicrowave.\n\n--**Dining Room** \n\nNook Area\n\nSpace for a large table and chairs.\n\nTwo 2.25' x 2.25' Windows (with high placement).\n\nDoor to Washer/Dryer, and other utilities.\n\n**--0.5 Bathroom**\n\nMedicine Cabinet\n\nStorage under Sink\n\n------------------------------------------\nWe'd love to get to know you over a slice of pizza at Boiler Room! Or a cup of coffee at Gaslight if you're not so into pizza.\n\n22F and I are partners. We both tend to hang out, watch movies, cook food, and study. I myself (27M) tend to read books about philosophy and art. You can also find me playing pc games on my time off (I recently got heavily involved in ARMA 3, a military simulator. 22F and I will play Dark Souls III, Hearthstone, and, one of our all time favorites, Grand Theft Auto 5. Endless fun). To assist the school and build my personal portfolio, I work on various graphic design and photographic projects utilizing my previous degree in Interdisciplinary Fine Art Studies. I will also take up some temporary space in the apartment to work on collages, watercolor drawings, or other personal artistic endeavors. 22F enjoys time on the couch, cooking, dancing (like.. ALOT), visiting her family when time allows and generally relaxing at home without having to spend too much money.\n\nContrary to what our neighborhood says about us, we don't like to go to the abundance of overpriced bars around us to have a good time. We like to be at home, watch movies together, and reminisce about the day and weeks happenings.\n\nIf a slower speed sounds like your speed, shoot me a message! :).\n\nEDIT: Added images and In Unit Washer/Dryer bullet point.\nEDIT2: Added Dimensions of the third bedroom just after the image gallery. Dimensions are 14' x 11'4\"",
    "comments": []
}