{
    "id": "k0613",
    "score": 8,
    "title": "Just joined thanks to the subreddit compitition. Anyone else new?",
    "author": "logicalnoise",
    "date": 1314797957.0,
    "url": "https://www.reddit.com/r/colum/comments/k0613",
    "media_urls": [],
    "other_urls": [],
    "postText": "What's up? Just enrolled this summer as a PT transfer student. I'm going for Film Post production with a focus on film editing. I'm from Chicago and commute from Wheeling. Looking forward to posting stuff here and seeing fellow redditors on campus.\n\nAlso I feel like the old man on campus at 26 anyone else going around my age who isn't a graduate?",
    "comments": [
        {
            "level": 0,
            "comment": "Welcome! I'm hoping to get some Columbia Reddit meetups going and I will be advertising much more as this week finishes up.",
            "score": 4,
            "author": "inbloom27"
        },
        {
            "level": 0,
            "comment": "&gt;Just joined thanks to the subreddit compitition. Anyone else new? \n\n*Competition...FTFY\n\nDoing our school proud early in the race. Well done, sir.\n",
            "score": 2,
            "author": "elstie"
        },
        {
            "level": 0,
            "comment": "Hey there! I'm new to the subreddit, but not to Columbia - been here since Fall 2009. I know what you mean about age though - I was 22 when I first transferred in, and couldn't understand why being able to drink alcohol was such a big deal. OH RIGHT, ALL OF MY PEERS ARE NOW 17.",
            "score": 1,
            "author": "deadbirds2010",
            "replies": [
                {
                    "level": 1,
                    "comment": "lol yeah my first class last night and yeah I'm probablyu closer to teh proffessor's age.",
                    "score": 1,
                    "author": "logicalnoise"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'd be down for meet ups!",
            "score": 1,
            "author": "lemonpartydotcom"
        },
        {
            "level": 0,
            "comment": "Hey!\n\nI did install that Facebook application, but I really don't like using it much at all. Seeing as there's a bit of promise with a subreddit, why not showcase it a bit?",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "huh?",
                    "score": 1,
                    "author": "logicalnoise"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You will feel old. I'm a 24 year old transfer student, and have been the oldest one in every class. It's not bad though. ",
            "score": 0,
            "author": "carockodile",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh well everyone has been nice except for a couple rude dolts at connections yesterday. Very much looking forward to attending.",
                    "score": 1,
                    "author": "logicalnoise"
                },
                {
                    "level": 1,
                    "comment": "Ha, interesting to hear. I'm planning on transferring next year. I'll be 27.",
                    "score": 1,
                    "author": "TheLAriver"
                },
                {
                    "level": 1,
                    "comment": "There's usually someone over 25 in at least one of my classes. Doesn't really faze me though. Welcome :]",
                    "score": 1,
                    "author": "winkledoo"
                }
            ]
        }
    ]
}