{
    "id": "yzdq2",
    "score": 6,
    "title": "Anyone else having trouble meeting people?",
    "author": "[deleted]",
    "date": 1346188233.0,
    "url": "https://www.reddit.com/r/colum/comments/yzdq2",
    "media_urls": [],
    "other_urls": [],
    "postText": "Incoming freshman here. I've hung out with some people but havent made any real friends. It seems like people have quickly already formed friend groups and I'm having trouble. I know it's only been a few days, but it's weird for me cause in my hometown I had a huge group of friends and I was never not with them. Anyway, Im just curious if anyone's in the same boat.",
    "comments": [
        {
            "level": 0,
            "comment": "I've had the Sam problems. I'm in my third year and I still don't really have a solid group a friends. However, I do know a lot of people in my major and have no problem finding people to talk to now. Almost always run into people I'm friendly with whenever I'm in the city.\n\nColumbia Reddit Meetup, anyone?",
            "score": 6,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm tired of being the only Colum student going to r/Chicago stuff, I'd love to help organize something.",
                    "score": 5,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "YES. /r/colum meet-up for sure.",
                    "score": 5,
                    "author": "hugogernsback",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm down!",
                            "score": 1,
                            "author": "DvineINFEKT"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "DID YOU HEAR THAT LOGANFEELS?! SIX PEOPLE ARE DOWN. Let's do it.",
                    "score": 3,
                    "author": "DvineINFEKT"
                },
                {
                    "level": 1,
                    "comment": "I honestly hope i can develop a group of friends. in my hometown, my friends were the reason i got up in the morning haha. i'd be down for a meetup.",
                    "score": 2,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "I'm in",
                    "score": 2,
                    "author": "AbstractShadows"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Are you staying on campus? Go to every event that you can and inject yourself into social groups until you find one that you like to be around. The Cinema Slapdowns are always really fun, there's one tonight at 7 at 1104 S Wabash in fact! I met some of my best friends there last year. Keep your head up, it'll work out. ",
            "score": 3,
            "author": "Only_One_T",
            "replies": [
                {
                    "level": 1,
                    "comment": "ok, thanks for the advice.",
                    "score": 1,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I know what you mean. I've made some acquaintances, but not real friends besides my roommates. \n",
            "score": 2,
            "author": "hugogernsback"
        },
        {
            "level": 0,
            "comment": "I think a lot of people go into College with this expectation of what their social life is going to be like ad then are disappointed when it just doesn't work the same as it did in high school. I'm pretty much the same way; had trouble making friends in college, didn't really like too many people anyway, so I left. At Columbia, where I don't live but commute, I have 'class' friends and am friendly to everyone I meet, but I no longer expect to develop close friendships and a social life this way. Since so many Colum students commute, it's doubly difficult even for people that like each other to all get together outside of class.\n\nFollow the advice others have given you, but I think college is a time to have fewer and closer relationships with friends. A few years of college will prove who really wants to be friends with you, at home and at school. Believe me. A new life in a new place doesn't happen all at once; you need to stay active, maybe get a job, meet new people all the time. Use meetup.com and subscribe to r/Chicago and meet some redditors when there's something going on. None are my close friends, but every one I've met has been very friendly. Last year we would eat lunch in the loop sometimes. And finally, remember that you're in college to go to class and learn. Make that your focus!",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Not exactly in the same boat, but I know what you mean.  If you want to hang out let me know.  (I'm a freshman here too)",
            "score": 1,
            "author": "AbstractShadows",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah sure, what dorm are you in?",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "2 East 8th",
                            "score": 1,
                            "author": "AbstractShadows",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm at the dwight. would you wanna chill tonight? im going to that target thing in a few hours.",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ya sure, where and when were you thinking?",
                                            "score": 1,
                                            "author": "AbstractShadows",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "we could meet up in front of your place at 9, then do whatever from there till 10:30, if that sounds good. ill be the black haired kid wearing a red shirt.",
                                                    "score": 1,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "alright cool.  I'll see you then.",
                                                            "score": 2,
                                                            "author": "AbstractShadows"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Give it a little time... You're still settling in. Start going to all the school activities, go exploring the city and invite acquaintances along. Meet classmates (have you checked them out on Oasis yet?) and get some study groups going for difficult classes.\n\nHave you picked your major yet? If so, really start finding others in that same department and go to activities specifically geared to your major. Go to the department office and talk to the office secretary to see if there are any clubs or mailing lists you should know of.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Everyone (especially incoming freshmen) kind of clump up at first. Wait for a few weeks, be friendly in class and groups of friendly people will loosen up and you will start to make friends. Also hang out in your majors department. That helps a lot. I started doing that my Junior year and almost instantly made friends there",
            "score": 1,
            "author": "MrGrumblz"
        }
    ]
}