{
    "id": "z3t6m",
    "score": 4,
    "title": "Any 21+ people want to get a drink after Big Mouth?",
    "author": "TheLAriver",
    "date": 1346369528.0,
    "url": "https://www.reddit.com/r/colum/comments/z3t6m",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm heading over to the show and thought there might be some older students like me who would want to go to a nearby bar.\n\nKnow any good ones?",
    "comments": [
        {
            "level": 0,
            "comment": "Well, I'm not in the area quite yet, but most of the bars in the South Loop are grossly overpriced. Well, most of the bars everywhere are grossly overpriced, but the South Loop is especially offensive on that front. I'm told the Taylor Street area has some good bars; I haven't been to any of them yet, so I can't say for certain which are good. Personally I'm a fan of Cheesie's Pub &amp; Grub up on Belmont - right next door to the Belmont Red Line stop. Every drink they have is 4 dollars, which is a bit expensive for a Budweiser or a Miller, but quite reasonable for some of the fancier microbrews they serve. ",
            "score": 1,
            "author": "Ahesterd",
            "replies": [
                {
                    "level": 1,
                    "comment": "You guys have it so good here. Coming from L.A., a $6 beer is totally normal to me.\n\nI ended up going to Villains on Clark. Not bad. I had a good draft pumpkin ale that was close to 9% ABV for around $6 a glass.",
                    "score": 1,
                    "author": "TheLAriver",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I've heard tons of good things about Villains, but despite living across the street from it at the Dwight all last year, I never made it there. ",
                            "score": 1,
                            "author": "Ahesterd",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ha! That's how it goes, isn't it? I'd check it out if you're close and curious. It was a bit louder than I prefer, but still not bad.",
                                    "score": 1,
                                    "author": "TheLAriver"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}