{
    "id": "1483yne",
    "score": 22298,
    "title": "These countries are very oppressive towards human rights. Why should we be worried what they think?",
    "author": "frozen-silver",
    "date": 1686622477.0,
    "url": "https://www.reddit.com/r/WhitePeopleTwitter/comments/1483yne",
    "media_urls": [
        "https://i.redd.it/2ow48edk2p5b1.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Hello friends. In solidarity with the current reddit protests against the mismanagement of its communities, community leaders, valued contributors and userbase [we are setting every submission to \"clubhouse\" for 72 hours and increasing the Clubhouse participation threshold exponentially.](https://www.reddit.com/r/WhitePeopleTwitter/comments/147202i/whitepeopletwitter_shows_solidarity_with_the/)\n\nPlease feel free to discuss the current protests in the stickied megathread about them. We will resume normal operation after this time.Thank you for your patience and support, \n\nThe WPT moderation team.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WhitePeopleTwitter) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Go live there then Joey, you'll be much happier knowing that trans people aren't living in your head.",
            "score": 936,
            "author": "morts73",
            "replies": [
                {
                    "level": 1,
                    "comment": "Conservatives always compare the US to third world countries, because if you you compare the US to first world countries, we don't look as great.",
                    "score": 59,
                    "author": "Peter_Easter",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I’m sure he’d LOVE to live in a country where if he even dares to shit talk it’s ruler, he will go to prison and get reprogrammed.\n\nDoesn’t happen here in America.",
                    "score": 167,
                    "author": "ShadooTH",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "![gif](giphy|26ybxlujhsNxLnYbe|downsized)\n\nWhat did Joey think of these guys at the White House?",
            "score": 1540,
            "author": "whereegosdare84",
            "replies": [
                {
                    "level": 1,
                    "comment": "Rudy wearing less makeup than Donnie",
                    "score": 53,
                    "author": "Stinklepinger",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Dames*",
                    "score": 130,
                    "author": "moosewhippets",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I like to think I keep up with politics, but I have zero knowledge what the fuck this is about.",
            "score": 6144,
            "author": "RandomUserName24680",
            "replies": [
                {
                    "level": 1,
                    "comment": "A pride celebration on the white house lawn which trans and other lgbt people went to. Which to my knowledge had no naked boobies.",
                    "score": 5420,
                    "author": "Ellie_Arabella87",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Disappointing.",
                            "score": 2870,
                            "author": "nine_inch_owls",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah idk about China, Russia, Afghanistan, or Saudi Arabia, but I’m disappointed in the lack of booby shaking. I’m sure deep down those other countries are too, even if they’re not allowed to admit it.",
                                    "score": 1805,
                                    "author": "A1sauc3d",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Some of them probably partake in the booby shaking in the US. Rules for thee, but not for me and all that jazz.",
                                            "score": 91,
                                            "author": "kgal1298",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Right? These are places that would benefit from some consensual, empowered boobies.",
                                            "score": 615,
                                            "author": "cardinarium",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It's what our founder, Ben Franklin would want.",
                                                    "score": 332,
                                                    "author": "Lovecraftenberg",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "He didn't spend all that time in France indulging his appreciation for their generous cornucopia of voluptuous wigs.",
                                                            "score": 222,
                                                            "author": "BornZookeepergame481",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "He was way too busy plowing French soil to mess with wigs!",
                                                                    "score": 32,
                                                                    "author": "Outside-Flamingo-240",
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Good old star spanglin’ Franklin…",
                                                                    "score": 81,
                                                                    "author": "ScientificBeastMode",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Didn't they recently find a hidden grave under his old house?",
                                                            "score": 14,
                                                            "author": "caffeineandvodka",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Probably. It's Philadelphia. I seriously doubt there's even a single structure of any kind, house or otherwise, anywhere in Philly that doesn't have at least one hidden grave underneath it. Even the hidden graves have hidden graves under them in this city.",
                                                                    "score": 28,
                                                                    "author": "BornZookeepergame481",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "\"Consensual, empowered boobies\" is my new favorite, decontextualized phrase.",
                                                    "score": 170,
                                                    "author": "ray25lee",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "If I tell my husband this phrase, I will hear it for the rest of my life….. I shall have to ponder this dilemma.",
                                                            "score": 53,
                                                            "author": "Overall_Physics_6707",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I was going to chime in \"what dilemma\", but the more I think about it, damn, you're right. \n\n\n\nPresumably you have the boobs, and I'll leave it to your wisdom. \n\n\n\nBut I'd love to here the decision in like, a year or so.",
                                                                    "score": 14,
                                                                    "author": "dwehlen",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Not only that, what a fucking prude. Oh no its breasts! But put a Gravy seal out there with his t-shirt off and he would be fine with it?\n\nSeriously, America needs to get more like Finland and Scandinavia in general. More accepting of bodies from birth. Oh and the added bonus is that it actually drops rates of sexual offending because you don't have a load of repressed hang ups because its, natural.",
                                            "score": 135,
                                            "author": "Anarchyantz",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "People lose their minds when they see boobs, but dudes have been allowed to run around with their shirts off forever. It has always seemed like a strange double standard to me.",
                                                    "score": 19,
                                                    "author": "jambr380",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I’m so disappointed in our country.",
                                            "score": 51,
                                            "author": "chronoboy1985",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I hadn't really thought about it before but naked booby shaking right on the White House lawn has to be the #1 threat facing this country. If only some political party would build their entire platform to the exclusion of everything  else around preventing that from happening ...",
                                                    "score": 15,
                                                    "author": "FriesWithThat",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Right?! I was like, bitch?! How did I miss White House tiddies?! I wanna see the White House tiddies!",
                                    "score": 229,
                                    "author": "NowATL",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "![gif](giphy|10ND7SFK7CTuUM)",
                                            "score": 84,
                                            "author": "Past-Application-552",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I’d honestly like to live in a country like that. \n\n“Hey, today our president was dancing with topless protestors in front of the White House” sounds pretty alright to me..",
                                    "score": 117,
                                    "author": "ItsLoudB",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "fast breaking news to hand: multiple nations walk out of the UN in protest due to lack of boobies",
                            "score": 155,
                            "author": "headmasterritual",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I had high hopes for Trans Am Joe",
                            "score": 203,
                            "author": "ConfidenceNational37",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Sure, but he's a Corvrtte kind of guy, though.",
                                    "score": 74,
                                    "author": "SGTFragged",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "This is utterly unrelated but I desperately want DIY EV conversion kits to happen so I can upcycle an old broken trans am. My first cars were 80s trans ams and firebirds and I miss them lol.",
                                    "score": 30,
                                    "author": "Lanthemandragoran",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "If you can afford it, [that future is now.](https://www.electricclassiccars.co.uk/) On my lottery list for sure",
                                            "score": 17,
                                            "author": "Viking_Hippie",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Once your finished reading the twat's tweet, it sounded like dark Biden threw quite the party.",
                            "score": 395,
                            "author": "Daveinatx",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If you see the clip theres part where Biden has his sunglasses pulled down while he shows the attendees partying behind him lmao\n\nGenuinely seems like it was a fun time for everyone",
                                    "score": 126,
                                    "author": "Prozenconns",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Republicans keep making Democrats sound way cooler than they are with tweets like this. Reminds me of the “taco truck on every corner” thing",
                                    "score": 87,
                                    "author": "danishjuggler21",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Still the most heartbreaking broken campaign promise of all time",
                                            "score": 36,
                                            "author": "INJECTHEROININTODICK"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "There was a picture of someone with their breasts out, they had their hands over it but otherwise no shirt; Republicans are losing it on Twitter. \n\nThe irony is that they think it’s a perversion of the WH, someone should remind them all the evil that Trump plotted in and around the same building if they wanna talk about how bad this perversion they claim about really gets.",
                            "score": 328,
                            "author": "One_User134",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The White House has seen a LOT of naked boobies in its time. I promise.",
                                    "score": 281,
                                    "author": "wholelattapuddin",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Just not Melania's. Unless her bf came to visit while Trump was gone.",
                                            "score": 132,
                                            "author": "jamiecarl09",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "We've all seen hers.",
                                                    "score": 38,
                                                    "author": "Live_Perspective3603",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Oh yeah it has.",
                                            "score": 18,
                                            "author": "One_User134",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I mean people have lived there and some of those people have had boobies.  It's seen boobies just like most other residential buildings.",
                                            "score": 32,
                                            "author": "Ridiculisk1",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "So as far as the conservatives are concerned, a man had his shirt off at the White House.  \n\nThey seemed to be all for it [when it happened at the Capitol building](https://www.wric.com/wp-content/uploads/sites/74/2021/01/GettyImages-1230453292-1.jpg?w=1280)",
                                    "score": 166,
                                    "author": "PigSlam",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "People said the same thing you did, and how some asshole rubbed shit on the walls. Fuckin cunts.",
                                            "score": 44,
                                            "author": "One_User134"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "They give no shits about corruption, murder, famine, or oppression. Only the moral violation of the edifice they’ve built from bits and pieces of Christianity.",
                                    "score": 70,
                                    "author": "MisterWinchester",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yup, and you can’t criticize them for any of their hypocrisy cause they constantly move the goal post and bs.",
                                            "score": 19,
                                            "author": "One_User134"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "From their *version* of christianity. Jesus would be chasing these bozos with a whip across the white house lawn while the LGBTQ peeps watch.",
                                            "score": 34,
                                            "author": "Seascorpious",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "What exactly is wrong with boobs, transgender or otherwise? Everyone loves boobs. Until the past century, humans needed boobs to keep babies alive. No more hate or shame for boobs, I say.",
                                    "score": 118,
                                    "author": "MyPasswordIsMyCat",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "They’re the wrong type of person among a group of the wrong type of people. Bunch of cunts would dislike anything.",
                                            "score": 53,
                                            "author": "One_User134",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Conservatives don't want transgender people to be alive; that's why the complaints.",
                                            "score": 24,
                                            "author": "Lots42",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "So let me get this straight. They’re mad over a trans woman having her breasts out. Yet they think that trans women are men. But it’s okay for men to have their breasts out, just not women. So by acknowledging that they have an issue with trans women showing their breasts, they are actually supporting their gender identity.",
                                    "score": 51,
                                    "author": "InterestingQuote8155",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Isn't there a lot of places that allow women to be topless if they say choose?  Isn't the whole conservative message that local government should have more power than the federal government?  At least that's what they say, because they frequently get upset in scenarios where local government expresses their power over decisions like that.  \n\nAlmost every one of their ideological points has major embedded hypocrisy.",
                                    "score": 8,
                                    "author": "Josh6889",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "So, let me make sure I've got this right.\n The party of mr. grab'm by the \"p\" is upset that someone had their own hands on their own breasts? Sounds like the gop to me.",
                                    "score": 7,
                                    "author": "Weird-one0926"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Oh you know, just that now our historical enemy’s opinions on our stance on human rights somehow is of utmost importance to us…",
                    "score": 102,
                    "author": "Buddhabellymama",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah yeah, but what would Hitler think about you blabbing about *human rights*?! And what would Jack the ripper think? And freaking Vlad the Impaler? Genghis Khan? TED BUNDY?!",
                            "score": 26,
                            "author": "decadecency",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Republicans make up lies to enrage their fanboys so they'll vote against the Democrats.",
                    "score": 588,
                    "author": "TheRealEvanG",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, but why do they keep doing it in ways that make the Dems sound so much more damn based than they are? \n\nLike here, yeah, not only have you they pointed out a way in which the US is way better than those countries they make it sound like there was a top less dance number on the White House lawn for Pride. \n\nAlright, damn, we get it, the GOP hates America and wants to be more like those authoritarian hell holes but they also hate boobs? Wut?",
                            "score": 348,
                            "author": "Tyr_13",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Maybe they wanted us to get mad at Biden for not inviting us.",
                                    "score": 112,
                                    "author": "CreedTheDawg"
                                },
                                {
                                    "level": 3,
                                    "comment": "Imagine if it were all true. Joe Biden out there two-fisting blunts, surrounded by shapely bare-breasted women with loads of cash.    \n\n\nThey're describing a rap video.  Their whole scare tactic is just hip hop.",
                                    "score": 111,
                                    "author": "HopelessInAmerica",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "No wonder they’re scared.",
                                            "score": 16,
                                            "author": "CORN___BREAD"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I dunno ... Biden doing a hip-hop video would certainly scare me. Just not for the reasons they think it should.",
                                            "score": 5,
                                            "author": "Pope_Cerebus",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Because to their base, both trans people and topless women are a moral no no. They'd see it not as a cool party but as the moral degradation of America. \n\nIt's playing to their crowd, essentially.",
                                    "score": 100,
                                    "author": "ThrowACephalopod",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Some Republicans are terminally online and have no concept of what the average voter will respond to.\n\nThis is such a person. No one knows what the fuck this guy is on about except for the most hardcore MAGA lunatic.",
                                    "score": 44,
                                    "author": "AnonAmbientLight"
                                },
                                {
                                    "level": 3,
                                    "comment": "There was actually a press photo of a trans girl doing a handbra during the pride celebrations on the WH lawn recently. It was nothing, but they are predictably losing their minds over it.",
                                    "score": 32,
                                    "author": "Taniwha_NZ",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I love how their view of our bodies changes even within the same sentence. Like, they say trans women are men but they're horrified at the idea of a topless trans woman, but a topless man is fine so they clearly see her as a woman, but they insist she's not a woman because she's trans, but she's got her boobs out which is bad, but they're not boobs because that means she's a woman, but they are boobs and my god it must be exhausting to be a republican.\n\nEdit: fixed typo",
                                            "score": 27,
                                            "author": "caffeineandvodka",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You have to remember - the GOP has absolutely no political platform.  They propose no domestic or foreign policy.  They propose no economic or infrastructure policy.  They have no policies at all.\n\nBecause they don't need those things.  And they know it for a fact.\n\nBecause ***THIS*** is what gets their base to vote.\n\nThey spent decades carefully crafting the dumbest, angriest voters they could.  Everything they do is about outrage.  It's about anger and hate.\n\nThe Republican voter doesn't care about anything anymore if it doesn't give them somebody to hate and blame for their own failings.\n\nIt just so happens that right now it's trans-persons.  Before that it was the Muslims.  Before that it was the gays.  Before that it was the immigrants.  Before that it was black people.\n\nThey always need somebody to hate.",
                                                    "score": 22,
                                                    "author": "Val_Hallen"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "She could've just been standing there and they still would've lost their shit.  As always, you have to ignore what they say and look at the group that they're complaining about because it's always about hatred towards that group, not whatever technicality they're pretending to care about at that point.",
                                            "score": 19,
                                            "author": "Ridiculisk1"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Like how they lost their minds over Michelle Obama's sleeveless outfit saying it was a bad look for the White House but, meanwhile, I can find nude photos all over the internet of the former First Lady.\n\nAnd not candids or leaks.  Photos she willingly took with the intention of being nude.  Full frontal.  Nothing hidden.\n\nBut those are fine.  Ignore those.",
                                            "score": 5,
                                            "author": "Val_Hallen"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Most of them seem to hate women, so yah, I’d say they hate boobs. Even the women in the Republican Party seem to hate women.",
                                    "score": 81,
                                    "author": "Inmonic",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The women in the gop especially hate women.  If they don't, they can't have status in the party  run by conservative men.",
                                            "score": 47,
                                            "author": "pinetreesgreen"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Not hate… _control_",
                                            "score": 14,
                                            "author": "Loko8765",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "A couple days ago Republicans were getting super angry because there was new evidence Hunter Biden enjoyed being naked with consenting adult ladies.",
                                    "score": 6,
                                    "author": "Lots42",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "https://twitter.com/thekevindalton/status/1668388608196349957?s=46&amp;t=sQYCSrAoRnkPww9oHsuh6A a single trans women was topless at the White House\n\nEDIT i regret linking Kevin dalton but I don’t have the video elsewhere",
                    "score": 113,
                    "author": "JacksonCM",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well, according to the right, she's actually a guy. And it's perfectly legal for guys to go shirtless. So what are they upset about?",
                            "score": 297,
                            "author": "Nightwinddsm",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I guess the two trans men who were shirtless next to her?\n\nOr more accurately: absolutely anything they can conceivably be outraged about, with or without hypocrisy and with no regard to consistency of their beliefs.",
                                    "score": 19,
                                    "author": "Lithl",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Definitely regretted linking the prick",
                                    "score": 29,
                                    "author": "JacksonCM",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Notice they’re only mad about the trans woman showing her breasts and not the trans man who was also topless. By getting mad about the trans woman showing her breasts, they are actually validating her gender identity and the gender identity of the trans man in a backwards, misogynistic way. I actually think at its heart, transphobia stems from misogyny. You have to have problematic beliefs about women and men in order to be transphobic.",
                            "score": 156,
                            "author": "InterestingQuote8155",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They posted a video on the libs of social media subreddit (or another similar one). It was mostly non offensive, but it did appear that a trans woman pulled her top down with her hands covering the breasts.",
                    "score": 51,
                    "author": "JeffThrowSmash",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Iirc, he's not a politician or anything, just a pick me girl.",
                    "score": 14,
                    "author": "Professional-Hat-687",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Joey has a weird fixation on trans people, especially trans cum. If there is anything trans related out there, you can bet that Joey will tweet about it in terms of cum lol.",
                    "score": 42,
                    "author": "ArjunaIndrastra"
                },
                {
                    "level": 1,
                    "comment": "You see, a single trans woman took her top down and covered her breasts with her hands and shook them at the camera.\n\nThis emboldens our enemies.\n\n\"How does that embolden our enemies\", you ask?\n\nThe fact that you have to ask that question is why you are not a republican.\n\n(/s because it's 2023)",
                    "score": 5,
                    "author": "MrsMiterSaw",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sounds like a party on the white house lawn nobody knew about.",
            "score": 1688,
            "author": "envision83",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm surprised Joey didn't show up for his dose of t***** semen. He's obsessed with that stuff.",
                    "score": 591,
                    "author": "JeffThrowSmash",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Is that the dude that keeps tweeting about trans semen? Interesting that he keeps projecting that scenario over and over.",
                            "score": 415,
                            "author": "envision83",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yup it’s him.",
                                    "score": 135,
                                    "author": "Rhakha",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I kind of want to know what the deal is with the \"trans semen.\" Was there a report on Fox News on cum spiked cocktails or something? Is it cool if it's a biological male's semen?",
                                            "score": 85,
                                            "author": "ExtantPlant",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Bud Light had some ads with someone who’s trans. Conservative shit-stirrers spiraled downward into a new flavor of madness until the hyperbole was about “trans semen” in the beer.  I **think** it’s been metaphorical; but I don’t trust those folks with 5th grade language skills so who the hell knows.",
                                                    "score": 84,
                                                    "author": "A_Guest_Account",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I mean these are the people who thought plant estrogen in food is the same as free HRT and therefore we're trying to make them trans by replacing their Manly Beefed Burgers with effeminate soy alternatives so I very much doubt they know what hyperbole is, let alone how to use it correctly.",
                                                            "score": 34,
                                                            "author": "caffeineandvodka",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt; Bud Light had some ads with someone who’s trans.\n\nOh, it wasn't even that exciting. They gifted a trans social media influencer a custom can and they opened it and tasted it on their own channel.",
                                                            "score": 11,
                                                            "author": "A_Furious_Mind"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I mean there is a porno site of Whitehouse. Maybe Joey got a kink and saw it there?",
            "score": 157,
            "author": "pwningrampage",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nah some trans woman was shaking her breasts with just her fingers covering her nipples I guess. They've been spreading clips of it all over right wing media.",
                    "score": 77,
                    "author": "Mysterious-Wasabi103",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They sure do love sexy trans women.",
                            "score": 110,
                            "author": "floofandmemes",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Aren’t they worried about children seeing naked boobies when they share the video?? Why are they exposing the children to this?? Are they trying to groom them by sharing the video repeatedly?",
                                    "score": 58,
                                    "author": "CORN___BREAD",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "He’s not making the winning argument he thinks he is.",
            "score": 988,
            "author": "_A_Monkey",
            "replies": [
                {
                    "level": 1,
                    "comment": "Moral outrage from the Taliban, Chinese Communist Party, and other repressive regimes is a badge of honor.\n\nIf the Taliban thinks well of you, probably you are fucking horrible person.",
                    "score": 680,
                    "author": "pressedbread",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "They never are.",
                    "score": 51,
                    "author": "moaningsalmon",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "This is China— levels of accidental Biden advertisement.\n\nhttps://preview.redd.it/cayekdkbgq5b1.jpeg?width=692&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=21d24f20f4368b67f03c1dbd98c484bfa4e2f560\n\nIn fact, if you superimpose the text on the tweet on the cartoon that could be Biden’s whole ‘24 campaign.",
                    "score": 27,
                    "author": "anaccountthatis"
                },
                {
                    "level": 1,
                    "comment": "He's not trying to win anything. He figured out the secret herbs and spices of making money off these fools. Just say increasingly over the top things in the direction of pre existing prejudices.\n\nIn other words just take hateful idiots and masturbate their hate until money comes out.",
                    "score": 62,
                    "author": "Lanthemandragoran",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Also this almost reads like a list of who pays him. There's plenty of Russian shilling on social media, and the Chinese and Saudis have quickly realized how effective that is too. The Taliban has likely realized the similar as well.",
                            "score": 6,
                            "author": "olivegardengambler"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "He’s confessing that GOP LGBTQ intolerance is more aligned with regimes like Russia, China, Taliban etc.\n\nHe also seems to say that US should be pleasing and accommodating the backward views of the nations he refers to. So weak. So “America last”.",
                    "score": 16,
                    "author": "BringBackAoE",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Was my thought too. Anything that pisses those countries off sounds excellent to me. \n\nAlso, for better or worse, the US has the largest, most well funded military on earth by a HUGE margin. What’re those organizations / countries going to do about it? Are they gonna cross their arms and  shake their heads in disapproval? No president should give an iota of a fuck what they think.",
                    "score": 7,
                    "author": "Xandril"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not 100%, but I think they're probably thinking \"Oh! We don't have a direct source of valuable information anymore.\"\n\nTrump is a terrorist.",
            "score": 113,
            "author": "Jackieirish",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This is the transgender semen guy, right?  The guy who had like 4 tweets in a week about drinking it?",
            "score": 297,
            "author": "scipio0421",
            "replies": [
                {
                    "level": 1,
                    "comment": "Uhh…what?",
                    "score": 94,
                    "author": "cassafrasstastic3911",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Basically when Chick-Fil-A ‘wENt WoKE’ or whatever, he kept on tweeting about how they’re “putting t••••y semen in the lemonade”\n\nIf it were one or two times it’d just be weird hyperbole. …But he *just kept tweeting about it,* sometimes multiple times in a row",
                            "score": 196,
                            "author": "Nadikarosuto",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Almost felt like he was hoping someone would offer to cum in his lemonade, to be honest",
                                    "score": 59,
                                    "author": "RealBowsHaveRecurves",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Methinks the lady doth protest too much.",
                                            "score": 11,
                                            "author": "wh4tth3huh"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yes, yes it is.",
                    "score": 21,
                    "author": "Every_Brilliant1173"
                },
                {
                    "level": 1,
                    "comment": "Yeah. The dude is also extremely unhinged. Like he posted a video of him pacing around a hotel room with a tic as he rambled and ranted about disgusting people and disgusting hotel rooms. There's no doubt that he probably uses Twitter because most people would probably call the police if he posted videos like that.",
                    "score": 6,
                    "author": "olivegardengambler"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Trans girls were naked at the White House. I missed it? Where was my invite? Like I worked hard to grow boobs too.",
            "score": 1699,
            "author": "Just_Tana",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have a white house.\n\nYou are welcome to shake your naked boobs on the lawn any time you want.",
                    "score": 998,
                    "author": "The_OtherGuy_99",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "![gif](giphy|GgcusW5RLS9Nu)",
                            "score": 452,
                            "author": "Just_Tana",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I feel like I just witnessed to backstory to a great cinematic tour de force!",
                                    "score": 161,
                                    "author": "Keagank",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Nothing but good, wholesome boob-shaking!",
                                            "score": 70,
                                            "author": "bassman314",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Naked boob shaking. You forgot the naked part.",
                                                    "score": 32,
                                                    "author": "Bonnieearnold",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Fun for the hole family!",
                                                    "score": 23,
                                                    "author": "Keagank",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Oh yeah, Steve and Mary Hole, I like those two.",
                                                            "score": 4,
                                                            "author": "brcguy",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "\"Night of the Living HOA\"",
                                            "score": 31,
                                            "author": "Nekowulf"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "True allyship.",
                            "score": 12,
                            "author": "ray25lee"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I will never turn down an opportunity to see quality breasts",
                    "score": 81,
                    "author": "floofandmemes",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hold up. I thought Trans people are fake and actually their original gender? So by their rules those were male tits and therefore not offensive.\n\nSo which is it? Are Trans women women or not?",
            "score": 380,
            "author": "Orenwald",
            "replies": [
                {
                    "level": 1,
                    "comment": "Your first mistake was expecting coherent logic from people who genuinely believe government officials drink the blood of murdered children",
                    "score": 75,
                    "author": "caffeineandvodka",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "https://preview.redd.it/pbpgp8lmjr5b1.jpeg?width=743&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=acbfc4ca883f3649cb1d5ebe85ec3afd7ba0b2cd",
                            "score": 12,
                            "author": "ACasualNerd"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would be concerned if Biden was doing something those countries approve of.",
            "score": 57,
            "author": "macweirdo42",
            "replies": [
                {
                    "level": 1,
                    "comment": "Absolutely. If you're doing something that they approve of, then you need to and should reevaluate your decisions.",
                    "score": 8,
                    "author": "olivegardengambler"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Was there some kinky shit happening at the White House I didn’t hear about?",
            "score": 287,
            "author": "CertainlyAmbivalent",
            "replies": [
                {
                    "level": 1,
                    "comment": "Did...did they just make ol' Sleepy Joe look cooler?",
                    "score": 123,
                    "author": "skraptastic",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I will vote for anyone who runs on a platform of trans cuties shaking their boobies on the White House lawn",
                            "score": 83,
                            "author": "Davidfreeze",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Breaking news: a massive caravan of otaku hentai-enthusiasts are currently making their way to the United States after disembarking from Tokyo Bay.",
                                    "score": 16,
                                    "author": "chronoboy1985"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "They actually have a talent of making liberals sound and look cooler than they are. It's their skill set.",
                            "score": 11,
                            "author": "kgal1298"
                        },
                        {
                            "level": 2,
                            "comment": "Biden in a landslide",
                            "score": 27,
                            "author": "ConfidenceNational37"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Evidently thee and me, my friend.",
                    "score": 54,
                    "author": "rbryants",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "When Joey Mannarino jumps up and down in a mirror bouncing around naked he's the biggest boob alive, and those countries don't think that much of him.",
            "score": 36,
            "author": "THESIDPROF"
        },
        {
            "level": 0,
            "comment": "The correct answer is \"I don't give a fuck what these regressive countries think\".",
            "score": 36,
            "author": "ExploderPodcast"
        },
        {
            "level": 0,
            "comment": "personally, i don't give a shit what any of these countries thinks.",
            "score": 31,
            "author": "thegza10304"
        },
        {
            "level": 0,
            "comment": "Republicans: \"You are the sex you were born with no matter what\"\n\nAlso Republicans: \"Transgender boobs! RUN!\"\n\nIf this dipshit things trans women are men, why does he care if they go topless?",
            "score": 32,
            "author": "BangBangMeatMachine",
            "replies": []
        },
        {
            "level": 0,
            "comment": "What do I think of that?  Well, let’s see…\n\nI think, Fuck Afghanistan. \n\nI think, Fuck China. \n\nI think, Fuck Russia. \n\nAnd I  definitely think, Fuck Saudi Arabia. \n\nFour oppressive, anti democracy, authoritarian shitholes who are all to one degree or another the enemies of the US. \n\nWhy the fuck should any of us care one hair what any of those fuckers think?",
            "score": 521,
            "author": "Cruitire",
            "replies": [
                {
                    "level": 1,
                    "comment": "![gif](giphy|WDn21GO1KmpNK|downsized)",
                    "score": 138,
                    "author": "general-illness"
                },
                {
                    "level": 1,
                    "comment": "The GOP want to make the US like those countries except with “Christian Authoritarianism”. They see what those countries do and want to make their own version of it.",
                    "score": 63,
                    "author": "mistermatth"
                },
                {
                    "level": 1,
                    "comment": "These are the absolute last countries I want to impress. Let them be mad.",
                    "score": 28,
                    "author": "contactfive"
                },
                {
                    "level": 1,
                    "comment": "When your hatred for Muslims and Commies is surpassed by your love for authoritarianism, that’s when you become a conservative that cares about what China, Russia, Afghanistan, and Saudi Arabia think about US social politics. \n\nSurprised Iran and North Korea didn’t get a shout out as well. They’re feeling left out after working overtime.",
                    "score": 87,
                    "author": "DeathRose007",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Did I miss Joe’s tiddies?",
            "score": 25,
            "author": "AmishDeathMatch",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I missed tits?! WTF?!?!\n\n![gif](giphy|vAvKeeXROptxm|downsized)",
            "score": 24,
            "author": "djevilatw",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Joey Mannarino is incredibly obsessed with trans people. He's mentioned previously that Chic-fil-a shakes contain \"tranny semen”. I think we can all agree Joey is in no position to judge others.\n\nIn addition, what he has stated is just not true... No one has \"shaken their naked boobs on the White House lawn with (Biden)\". Moreover, what does it matter what **right-wing leaning** countries think of him or the US? Why should we be concerned with what China thinks of the US? We view China in a negative light and they couldn't care less. All in all, a ridiculous comment by Joey \"tranny semen\" Mannarino.",
            "score": 26,
            "author": "Frisky_Potato42nite",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I could without a doubt care less about the opinions of  the leaders or populace of China, Russia, and Saudi Arabia.",
            "score": 186,
            "author": "Weird-Tomorrow-9829",
            "replies": [
                {
                    "level": 1,
                    "comment": "It is I couldn't care less because if you could care less then you do care some amount.",
                    "score": 28,
                    "author": "NeverNoMarriage"
                },
                {
                    "level": 1,
                    "comment": "It’s just his slick way of dehumanizing and making an entire group inferior. This guy is a total bigot fuck. \n\nGranted, it makes no sense but I don’t give two shits about Russia or those other countries opinions.",
                    "score": 45,
                    "author": "ignatious__reilly",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I thought according to these people that being friendly with China is bad? Now they care what china thinks?",
            "score": 21,
            "author": "deadsoulinside",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I think that guy thinks way too much about transgenders and their “naked boobs”",
            "score": 20,
            "author": "dragonfliesloveme"
        },
        {
            "level": 0,
            "comment": "Let’s rephrase this:\n\nWhat do you think **China** thinks of the US having over 200 mass shootings and it being only June? \n\nWhat do you think **Russia** thinks of the US having over 200 mass shootings and it being only June? \n\nWhat do you think **Saudi Arabia** thinks of the US having over 200 mass shootings and it being only June? \n\nWhat do you think **Afghanistan** thinks of the US having over 200 mass shootings and it being only June?",
            "score": 51,
            "author": "DeadRabbit8813",
            "replies": [
                {
                    "level": 1,
                    "comment": "They’re thinking “goood goooood, let the hate flow through you”\n\nSelf-directed bouncing boobies are just too progressive though. Forced bouncing is the only acceptable bouncing 🙄 god I wish this wasn’t true",
                    "score": 11,
                    "author": "GargantuanGreenGoats"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Even if that happened (which I'm 100% sure nothing remotely similar happened) I don't care what Afghanistan, China, Russia, or Saudi Arabia thinks. The opinion of not just other countries but countries that are enemies of ours and enemies to democracy of things that happen here isn't important.\n\nThey are our enemies, their opinions of what happens here is of no importance at all and, personally, if something here upsets those countries in particular that's more of a reason to do those things.",
            "score": 70,
            "author": "tallman11282",
            "replies": [
                {
                    "level": 1,
                    "comment": "Eh, it sort of happened but not quite the way Jo-Jo makes it sound. It was a TikTok personality name Rose Montoya. Two things though - if trans women are still men (as these psychos claim) what's the big deal, men are topless in public all the time. Sometimes the moobs are bigger too.",
                    "score": 50,
                    "author": "fedora_and_a_whip",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There’s actually a topless male beside her in the video, and _he_ isn’t covering the nipples with his hands… but that doesn’t trigger Joey M.",
                            "score": 25,
                            "author": "Loko8765",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Joey, do you like movies about gladiators?",
            "score": 14,
            "author": "djkutch",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This dude sure thinks about naked trans boobs a lot",
            "score": 12,
            "author": "BlitheringIdiot0529"
        },
        {
            "level": 0,
            "comment": "Joey, are the transgenders shaking their naked boobs on the White House Lawn here in the room with us now?",
            "score": 12,
            "author": "bassman314",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This guy is a total self hating closet case. Watch any of his videos and your first thought is “He’s gay, right?”",
            "score": 11,
            "author": "Andrognick",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Sounds like a better party than the Trumps’ Christmas crapfests.",
            "score": 10,
            "author": "TheHrbekFan86"
        },
        {
            "level": 0,
            "comment": "I ..... don't...? I don't care what any of those countries think about what personal freedom means. Why do you?",
            "score": 9,
            "author": "meepgorp"
        },
        {
            "level": 0,
            "comment": "Saudi Arabia and Afghanistan don't want my mom driving or walking around town without a burqa.",
            "score": 11,
            "author": "bazilbt"
        },
        {
            "level": 0,
            "comment": "If your standard of morality is these countries, you seriously need to touch grass.",
            "score": 9,
            "author": "ilolvu"
        },
        {
            "level": 0,
            "comment": "They would hate it... and thats a good thing.\n\nLead by example.",
            "score": 8,
            "author": "Burlesque_Djin"
        },
        {
            "level": 0,
            "comment": "Why are we taking our lead from countries that have appalling human rights records.\n\nIt's almost as if that's what he wants in the US.",
            "score": 6,
            "author": "Nadger_Badger"
        },
        {
            "level": 0,
            "comment": "Well, Joey, since all those countries treat human beings like dog shit, I'm going to guess they weren't fans of your imaginary trans booby shaking.",
            "score": 8,
            "author": "LostInTheWildPlace",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Why do I frickin' care what Joey Mannarino thinks about anything?",
            "score": 8,
            "author": "GreatWhiteNorthExtra",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Everybody loves boobs.",
            "score": 7,
            "author": "Fair-boysenberry6745",
            "replies": []
        },
        {
            "level": 0,
            "comment": "WTF is he even talking about?",
            "score": 6,
            "author": "fordprefect294",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Did I miss the memo about naked boob shaking?!?! DAMMIT",
            "score": 8,
            "author": "ItsSUCHaLongStory",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This guy is so fucking obsessed it’s honestly kinda sad.",
            "score": 8,
            "author": "Lucafoxxer"
        },
        {
            "level": 0,
            "comment": "Was there boob shaking??? Dang, I missed out.... ☹️☹️☹️",
            "score": 8,
            "author": "hastingsnikcox"
        },
        {
            "level": 0,
            "comment": "On behalf of France, I'd like to say we support Joe Biden allowing transexuals to shake their naked boobs on the white house lawn with him.",
            "score": 7,
            "author": "demonTutu",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Joey, no one is forcing you to think about trans people's tits 24/7, yet here we are.",
            "score": 7,
            "author": "Over-Supermarket-557"
        },
        {
            "level": 0,
            "comment": "We should rather wonder what **Saudi Arabia** bought for two billion dollars. \n\nWe should rather wonder what fucking \"deal\" trumpleorangeskin negotiated with **Afghanistan.**.\n\nWe should rather wonder why **Russia and China** want the pale tangerine bumblefuck back in the White House so badly.",
            "score": 7,
            "author": "that-pile-of-laundry"
        },
        {
            "level": 0,
            "comment": "I genuinely hope they're mad as hell. I hope they feel like crying.",
            "score": 18,
            "author": "ConflictAgreeable689",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Is the naked boob pic even real? And your right who the hell cares what the Taliban or the Afghan govt thinks?!",
            "score": 7,
            "author": "Essay-Individual"
        },
        {
            "level": 0,
            "comment": "Naked boobs on the Whitehouse lawn? I'd love to see that, when did that happen? Oh, it didn't? Damn that's a shame.",
            "score": 5,
            "author": "floofandmemes",
            "replies": []
        },
        {
            "level": 0,
            "comment": "omw to the white house to crack open a cold one with the transgenders and their naked boobs (shaken not stirred)",
            "score": 6,
            "author": "Snoo_72851"
        },
        {
            "level": 0,
            "comment": "Did Joey have a wet dream again?",
            "score": 7,
            "author": "The84thWolf"
        },
        {
            "level": 0,
            "comment": "What do you think Canada thinks of dumbasses like this who thinks these things actually happen?",
            "score": 7,
            "author": "Muteling",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I figure they're all too busy reading top secret US national defense documents in some cheap golf club's shitter to care.",
            "score": 7,
            "author": "Pholusactual"
        },
        {
            "level": 0,
            "comment": "Wait... people were shaking their naked boobs on the White House lawn? I can't believe I missed it! Anyone got a video?",
            "score": 6,
            "author": "FSF87"
        },
        {
            "level": 0,
            "comment": "Wait, I know this one from circa 2002; \"They hate us because of our freedom. \"",
            "score": 5,
            "author": "mrducci"
        },
        {
            "level": 0,
            "comment": "Are you telling me they are the countries you aspire to have the same values as?",
            "score": 5,
            "author": "jgulliver75"
        },
        {
            "level": 0,
            "comment": "I'd pay to see his browser search history...I don't even need an imagination to know exactly what it is though, he is so obvious.",
            "score": 4,
            "author": "ColeBane"
        },
        {
            "level": 0,
            "comment": "This clown shows dude just out here sayin “naked boobs” like it’s not objectively hilarious. Like I’m supposed to read this and really wonder what the Saudis think about “naked boobs”? They gonna 9/11 us again over the “naked boobs” Joey?",
            "score": 5,
            "author": "Previous_Beautiful27"
        },
        {
            "level": 0,
            "comment": "I’m not aware of that happening, but I hope it did. And, if it pisses off those governments, so much the better.",
            "score": 5,
            "author": "Nerevarine91"
        },
        {
            "level": 0,
            "comment": "Oh no, the taliban think I’m a bad person!!!!",
            "score": 4,
            "author": "DiscombobulatedHat19"
        },
        {
            "level": 0,
            "comment": "I've looked at all the pics and videos of the event and didn't see any naked boobies at the White House. That would have been interesting, lol. \n\nWho cares what countries with blatant human rights violations think?",
            "score": 5,
            "author": "Various_Succotash_79"
        },
        {
            "level": 0,
            "comment": "Who cares what Russia, the Saudis, Chinese, and Afghanis think. Do what’s right.",
            "score": 5,
            "author": "pairolegal"
        },
        {
            "level": 0,
            "comment": "This just gives the game away. Right wingers think Afghanistan, China, Russia, and Saudi Arabia’s approach to human rights are something to *aspire* to.",
            "score": 3,
            "author": "GaiusMarius60BC",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 5,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "So republicans are trying to say they want us to be more like Afghanistan, China, Russia and Saudi Arabia?",
            "score": 5,
            "author": "CoverYourMaskHoles"
        },
        {
            "level": 0,
            "comment": "Freedom doesn't care what they think",
            "score": 5,
            "author": "pHScale",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I personally love how they started with the Taliban and the theocracy that Afghanistan is. It’s like a subconscious slip of what  their goal is.\n\nAt the end of the day I don’t really care what terrorists/theocracy or two dictatorships feel about what we do. Those are not the folks you want to warm up to in a liberal democracy, a federal republic to be specific to the United States. These are our fucking enemies, one we were literally at war with for 20 years just a few years ago.\n\nThis is what has been normalized with Trump praising and accepting love letters from Kim Jong-Un and accepting checks from Putin.",
            "score": 5,
            "author": "RammsayB"
        },
        {
            "level": 0,
            "comment": "Being gay is a crime in 3 of the 4. China has their own issues. Who really cares about what they say about a pride celebration?",
            "score": 6,
            "author": "Catlenfell"
        },
        {
            "level": 0,
            "comment": "There was a boob shaking on the WH lawn regularly from 2017-2021., and it's got to have been better than that.",
            "score": 4,
            "author": "willflameboy"
        },
        {
            "level": 0,
            "comment": "What do you think those countries thought about January 6? \n\nI’ll take the LGBQT+ community over treasonous trump klan any day.",
            "score": 5,
            "author": "SuperTopperHarley"
        }
    ]
}