{
    "id": "148evcm",
    "score": 3861,
    "title": "Agreed",
    "author": "KathrineBrill",
    "date": 1686661104.0,
    "url": "https://www.reddit.com/r/WhitePeopleTwitter/comments/148evcm",
    "media_urls": [
        "https://i.redd.it/kl0dw04e9s5b1.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Hello friends. In solidarity with the current reddit protests against the mismanagement of its communities, community leaders, valued contributors and userbase [we are setting every submission to \"clubhouse\" for 72 hours and increasing the Clubhouse participation threshold exponentially.](https://www.reddit.com/r/WhitePeopleTwitter/comments/147202i/whitepeopletwitter_shows_solidarity_with_the/)\n\nPlease feel free to discuss the current protests in the stickied megathread about them. We will resume normal operation after this time.Thank you for your patience and support, \n\nThe WPT moderation team.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WhitePeopleTwitter) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "I wish…. Unfortunately it isn’t going to happen…. Not with any republicans still around.",
            "score": 230,
            "author": "DarthArtero",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not with limp-dicked liberals around either. Biden already stated he won't consider doing anything about the Supreme Court.\n\nThe coward Dems excuse is that packing the court would delegitimize it. As if the fascists haven't already done that.",
                    "score": 139,
                    "author": "Tripwiring",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's like saying \"I'm not gonna sweep up the pile of dust on the floor because sweeping makes dust and we don't want to get any dust on the floor.\"",
                            "score": 45,
                            "author": "subject_deleted",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You CAN NOT get the dust dusty. Then it’s dirt and lets not go down that path.",
                                    "score": 10,
                                    "author": "PHenderson61"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Unfortunately you’re correct",
                            "score": 10,
                            "author": "DarthArtero"
                        },
                        {
                            "level": 2,
                            "comment": "Conservatives are trying to destroy the rule of law, so let's destroy the rule of law to stop them.\n\nSounds like a great idea. I wonder why no one is following your advice... they must be cowards.",
                            "score": 3,
                            "author": "duck_one",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's not \"destroying rule of law\" it's reforming it. We have more than 9 districts in this country. It makes perfect sense to expand the court to have more fitting representation.",
                                    "score": 6,
                                    "author": "alexagente",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Biden formed a commission of legal experts, constitutional scholars and historians to study the effects of expansion and they unanimously agreed that it was a bad idea for the stability of our country.  \n\nIt sounded like a good idea to me as well, but I trust the experts.",
                                            "score": 6,
                                            "author": "duck_one",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "And having a rogue institution operating politically against the interests of the country and without any real legal basis is stable?\n\nI don't think letting them continue with business as usual is the solution here.",
                                                    "score": 4,
                                                    "author": "alexagente",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Are you a constitutional expert, legal scholar or tenured historian focusing on the rise of authoritarianism?",
                                                            "score": -3,
                                                            "author": "duck_one",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "No but do you really think doing nothing is going to stop it?",
                                                                    "score": 2,
                                                                    "author": "alexagente"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "And when you continue to play by the rules when the other side abandons it and gets into power, then they'll do it in their interests rather than you doing it in yours. It's going to happen regardless at this point if the Republicans ever take the presidency and the Senate back. Then the Democrats will have no choice while the Republicans in power will throw all of their political enemies in prison with control of the Supreme Court and Congress using kangaroo courts after passing the very vague laws they are at a state level on the federal, taking points from dictators throughout history.  They've studied how to overthrow democracies well enough as those who have actively been involved in coups in Latin American countries in the US's interests. \n\n Trump gave them an insane amount of progress in their destabilization of democracy and the only way to stop it is for the Feds to start using the judiciary to lock up these threats, as they are currently doing with Trump, until about a quarter of the country declares civil war and secession and we can solve the problem with the blood of patriots and tyrants nourishing the tree of liberty.\n\n We are reaching the point of no return to normalcy where a large enough minority of Americans have given up on the institutions of state, especially Democracy, as they become a gradually diminishing minority and the death knell grows louder. Democracy is the greatest threat to them at this point and needs to be destroyed for them to cling to power. We just have to hope that enough of them are too old and dead before we reach that point. Then we can finally make some progress as climate change causes mass starvation, global conflict, and ecological collapse. Talk to any climate scientist and they'll laugh at you talking about the survival and continuation of modern nation states and our global economic system, where either the military will need to take control to bring some degree of stability or the people, with the military's support, will overthrow it in a desperate terror and panic as their lives are in jeopardy.",
                                                    "score": 1,
                                                    "author": "Euporophage",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "The power is always with the money and nearly 80% of the US GDP is from liberal areas of the country. Democracy in the US isn't going anywhere. Voter participation/engagement has been historically high.\n\nYour dark fantasy here has zero chance of coming to fruition.",
                                                            "score": 1,
                                                            "author": "duck_one"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "The Supreme Court doesn’t work by district. Its constituency is (supposed to be) the entire population as one. They interpret the Constitution, the don’t “practice law” in the actual sense.",
                                            "score": 1,
                                            "author": "ChampionshipLow8541"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "They are. Thanks for agreeing with me, lib",
                                    "score": -3,
                                    "author": "Tripwiring",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "What a hilarious response to sarcasm... roll with it! \n\nI never thought that would happen. I yield, you are clearly the victor!",
                                            "score": 3,
                                            "author": "duck_one"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Failing to see the long-term picture. That’s usually a trait of the conservatives. What would happen if Biden packed the Supreme Court? Then the next Republican president would pack it even more, an so on. 2-4 additional justices every election cycle. That’s idiotic and wouldn’t accomplish anything and would cripple the institution completely and permanently.",
                            "score": 0,
                            "author": "ChampionshipLow8541"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Unfortunately the blame has to land on the Senate Rs. They had the chance to stop this. They chose to bend the the knee to Trump and uphold his word",
            "score": 29,
            "author": "LingonberryPossible6",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ok so let's get rid of them too.",
                    "score": 5,
                    "author": "subject_deleted"
                },
                {
                    "level": 1,
                    "comment": "Exactly.  Even if it was shown that Trump accepted bribes from some third party to nominate one of the justices, it's the Senate that actually confirms them.  So i don't think any level of malfeasance on the part of the former guy could lead to any action.",
                    "score": 1,
                    "author": "Justavian"
                }
            ]
        },
        {
            "level": 0,
            "comment": "They’ll be the ones determining the constitutionality of the decision. You really want to make it so they lose their jobs if they uphold the conviction?",
            "score": 135,
            "author": "Listening_Heads",
            "replies": [
                {
                    "level": 1,
                    "comment": "Were founded by and protected via  checks and balances. Probably preaching to the choir, but this is another point where we found a weakness in the armor...\n\nSo, yes, I do...but also, no, because I no longer trust the integrity of so many in our governance.",
                    "score": 28,
                    "author": "dandrevee",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Some of those checks and balances were based on the idea that politicians would work for the good of the country.",
                            "score": 28,
                            "author": "icenoid",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah.. but that has failed multiple times. Partivularly in the Gilded Age and since at least the 1980s more recently...\n\nAnd thats not even considering the whole racism issue inherent in the logistics of enforcement of policies",
                                    "score": 8,
                                    "author": "dandrevee"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt; You really want to make it so they lose their jobs if they uphold the conviction?\n\nNo, we want to make it so they're disqualified from ruling on it regardless of how they want to rule, because they're the products of corruption.",
                    "score": 91,
                    "author": "AWildRapBattle",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I would take it a step further let's remove  and or fix anything trump did in office because it's all tainted.",
                            "score": 13,
                            "author": "vagueblur901"
                        },
                        {
                            "level": 2,
                            "comment": "I mean, *yeah*. But I’m not holding my breath. We also want congress to pass laws stopping *themselves* from obscenely enriching themselves by the same means in which you or I would go to prison for insider trading. \n\nI have the same faith I have in that ever happening in these three clowns abstaining from a vote on whether or not to fire themselves.",
                            "score": 22,
                            "author": "DIWhy-not"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Republicans will never vote to remove one of their own from the Supreme Court - especially when their replacements would be nominated by a Democrat. Control of the judiciary is the one thing Republicans will take electoral hits over because those are lifetime appointments with limited oversight.",
            "score": 72,
            "author": "mhb-210"
        },
        {
            "level": 0,
            "comment": "Everyone everywhere that he appointed, supported, endorsed, or worked with should be scrutinized and reviewed. Trump was a criminal before he was elected, he was a criminal while in office, and he's continued to commit crimes ever since.",
            "score": 17,
            "author": "humptydumpty369",
            "replies": [
                {
                    "level": 1,
                    "comment": "I agree completely, but posts/tweets like this annoy me, because it’s such a gross oversimplification, we might as well be saying that he should be sentenced to being Biden’s butler for the rest of his life.\n\nThe crimes he’s charged with have zero to do with his appointment of these three judges, or any judges for that matter, so there’s less than zero chance these judges are removed.  And quite honestly, they have little to do with things he did while he was actually POTUS.  Convicting Trump for these charges isn’t some magic eraser that allows us to undo everything he did while in office.\n\nHell, we have pretty solid documentation of Clarence Thomas being owned by a billionaire and his wife participating in a coup.  Those things are far more closely tied to his fitness as a SCJ and it’s not even worth trying to get a vote because the Dems know it isn’t going anywhere.",
                    "score": 6,
                    "author": "neddiddley",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "All the poorly thought out takes that end in \"...who agrees?\" or \"raise your hand\" really big me. It's almost all just a bait for attention",
                            "score": 6,
                            "author": "PlumbumDirigible",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Exactly.\n\nLike I said, I agree that there are probably a million things that he’s done over the last 7-8 that should be thoroughly investigated, but let’s not pretend anything is being reversed unless you can specifically tie it to illegal actions, and even then it’s probably an uphill battle to reverse it.\n\nThis is about as fruitful as sitting around dreaming up all the fun things you’d do if you won the PowerBall.",
                                    "score": 4,
                                    "author": "neddiddley"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Maybe, maybe if he were charged for passing every classified document he touched to the Russians from day 1 of his presidency. And those 3 justices were somehow mixed up in it, then yes.\n\nBut right now, he's only been charged for what he did after he left office. As much as I'd like to see those justices gone, this isn't going to do it.",
                            "score": 1,
                            "author": "Prestigious_Treat401"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "They should be removed, but not for this reason. They were appointed while he was president, before these crimes were committed. \n\nGorsuch’s should have been filled with Obama was president. \n\nKavanaugh’s history should have disqualified him. \n\nBarrett’s seat should have remained vacant until Biden was in office based on the precedent set with Gorsuch’s seat (which really isn’t a precedent. It was just the GOP pulling their bullshit). She is also incompetent. She couldn’t state the rights granted by the first amendment in her confirmation hearing. A Supreme Court justice should know that",
            "score": 8,
            "author": "jeophys152",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's Turtle McConnell doing. He had a feeling that it was going to go bad for the Trumplicans, so he HAD to rush the hearing and vote. And all three LIED about RvW being \"settled\" Law. See what happened there. And don't get me started about Thomas...",
                    "score": 3,
                    "author": "SteelyDan1968"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Every single person he put in their jobs NEEDS to be looked at under a magnifying glass. Treasonous people hire treasonous people to do their work, after all...",
            "score": 7,
            "author": "selkiesidhe"
        },
        {
            "level": 0,
            "comment": "I mean I don't think they were placed illegitimately, from a technicality perspective. But I would like to see Congress enact term limits. And every presidential term gets to select one.",
            "score": 6,
            "author": "Accomplished-Plan191",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, that'd be a nice way to handle it on a first in, first out basis.  Though that would set up a ~36 year term length, and that would be equal to the longest term in history. It might make sense to arrange it so there would be a 2 year cadence, with an appointment scheduled for the 1st and 3rd years of a presidential term.  If everything is going as expected, you'd replace the oldest member of the court every time, but for any unexpected departures, you'd replace the unexpected departure first.   That would lead to an expected 18 year term, which is pretty close to the historical 16 year average.",
                    "score": 2,
                    "author": "PigSlam"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Disagree.\n\nThey should be removed because they're scumbags, but Trump's espionage has nothing to do with their appointments or subsequent Senate approval.",
            "score": 4,
            "author": "Chowdah-head"
        },
        {
            "level": 0,
            "comment": "I really hate the “who agrees” posts.  It’s like the “can I get an Amen” posts on Facebook.  Low effort and tired.",
            "score": 20,
            "author": "WillyWumpLump"
        },
        {
            "level": 0,
            "comment": "That doesn’t even make sense though.  Investigate the Supreme Court and you’ll find plenty, this is a stupid tweet.",
            "score": 4,
            "author": "usingastupidiphone"
        },
        {
            "level": 0,
            "comment": "While I hate those three, this has absolutely no basis in either law or logic. They're there to stay. The way forward is to expand the court and dilute their sway.",
            "score": 4,
            "author": "pmjm"
        },
        {
            "level": 0,
            "comment": "That’s, unfortunately, not how any of this works",
            "score": 4,
            "author": "cvanhim"
        },
        {
            "level": 0,
            "comment": "While I'm not happy with how things went regarding the Supreme court, it seems like quite a leap to suggest that Trump taking documents with him in 2021 when he left office, then failing to give them back when asked somehow invalidates supreme court nominations that were completed before those crimes occurred.",
            "score": 4,
            "author": "PigSlam"
        },
        {
            "level": 0,
            "comment": "Not just them, I want every one of the federal appointments he made recalled. That includes every judge across the nation he appointed.",
            "score": 8,
            "author": "AsherTheFrost"
        },
        {
            "level": 0,
            "comment": "IMO, in a perfect world, they would be 4 Democrats, and 4 republicans, with the chief Justice apolitical and sworn to be impartial, as the deciding vote, if necessary.\n\nNot gonna happen, but it's nice to dream about, lol.",
            "score": 14,
            "author": "big_d_usernametaken",
            "replies": [
                {
                    "level": 1,
                    "comment": "In a perfect world they would *all* be apolitical.",
                    "score": 6,
                    "author": "Philip_Anderer"
                }
            ]
        },
        {
            "level": 0,
            "comment": "~~If Trump is convicted of violating the Espionage Act,~~ the three Supreme Court justices he appointed should be REMOVED.\n\nWho agrees?",
            "score": 3,
            "author": "csonny2"
        },
        {
            "level": 0,
            "comment": "Definitely agree. Not just those three,  clarence Thomas is a disgrace too.",
            "score": 2,
            "author": "bertiethebastard"
        },
        {
            "level": 0,
            "comment": "If were gonna start talking shoulds and shouldn'ts well be here all day....\n\nA self professed con man and criminal shouldn't have ever been in charge of the country....\n\nThat same orange pos shouldn't have been allowed to pick a supreme court justice...",
            "score": 2,
            "author": "rustys_shackled_ford"
        },
        {
            "level": 0,
            "comment": "Should go without saying.",
            "score": 2,
            "author": "Odd_Radio9225"
        },
        {
            "level": 0,
            "comment": "They should be removed regardless. They all committed perjury to get their positions",
            "score": 3,
            "author": "CanaDoug420"
        },
        {
            "level": 0,
            "comment": "They should be impeached for simply lying during their confirmation hearings (are those things done under oath?) about Roe v Wade. All three were questioned about it, all three said basically that it's 'settled law', yet all three voted to overturn it.",
            "score": 3,
            "author": "Stoomba"
        },
        {
            "level": 0,
            "comment": "Not so feasible. Impeachment's the only way to do that, and that just ain't gonna happen.\n\nWhich is why the court needs to be expanded immediately to fifteen justices.",
            "score": 3,
            "author": "BitterFuture"
        },
        {
            "level": 0,
            "comment": "I agree, but legally it can't be done without impeaching them, and we'll need the republicans on board for that.",
            "score": 1,
            "author": "NameLips"
        },
        {
            "level": 0,
            "comment": "Hear ye, hear ye!",
            "score": 1,
            "author": "CherryShort2563"
        },
        {
            "level": 0,
            "comment": "Abso-fucking-lutley.",
            "score": 1,
            "author": "weimaranerdad71"
        },
        {
            "level": 0,
            "comment": "They should be removed anyway. Barrett is a far-right religious nut and Kavanaugh was never fully vetted.",
            "score": 1,
            "author": "Imfrom_m-83"
        },
        {
            "level": 0,
            "comment": "yes, but don’t worry, he won’t be.",
            "score": 1,
            "author": "occupyreddit"
        },
        {
            "level": 0,
            "comment": "I'm sure many agree but I'm also sure it doesn't work like that.....I wish",
            "score": 1,
            "author": "Pure-Medicine8582"
        },
        {
            "level": 0,
            "comment": "![img](emote|t5_35n7t|3148) yes 👍",
            "score": 1,
            "author": "defectiveGOD"
        },
        {
            "level": 0,
            "comment": "Traitors' Courts",
            "score": 1,
            "author": "robotwizard_9009"
        },
        {
            "level": 0,
            "comment": "Removed and investigated, right along with the other conservatives",
            "score": 1,
            "author": "kremit73"
        },
        {
            "level": 0,
            "comment": "If you are asking Republicans if they have any shred of Integrity, the answer is None.",
            "score": 1,
            "author": "mad_titanz"
        },
        {
            "level": 0,
            "comment": "Hell, we cant even get rid of the Bought and Paid for corrupt judge that’s there! These MF’s get to do whatever they want, follow any agenda they want. Bold face lie about their Judicial opinions, and get to stay. There needs to be some sort of control over these A-holes!",
            "score": 1,
            "author": "livelarg"
        },
        {
            "level": 0,
            "comment": "Drain the swamp",
            "score": 1,
            "author": "I_eat_dookies"
        },
        {
            "level": 0,
            "comment": "I wish people would stop posting this. That's not how our system works. \n\nWe can't accuse one side of violating the law and then make up our own rules.",
            "score": 1,
            "author": "CharleyMills"
        },
        {
            "level": 0,
            "comment": "Yea pretty wild that 1/3 of the supreme court was appointed by an insurrectionist that violated the espionage act.\n\nThat isn't even counting Clarence Thomas lmao",
            "score": 1,
            "author": "LunaRealityArtificer"
        },
        {
            "level": 0,
            "comment": "Jfc, this is just idiotic. He violated the espionage act after being president, that doesn’t retroactively make the things he did as President invalid. Trump is a fucking moron and all three of these ass clowns shouldn’t be where they are, but get it done the legal way.\n\nEven suggesting this just makes a sane person look like a fucking moron, just like the republicans supporting trump.",
            "score": 1,
            "author": "Ok-Scallion-3415"
        },
        {
            "level": 0,
            "comment": "Neil Gorsuch catching strays lmao",
            "score": 1,
            "author": "havohej_"
        },
        {
            "level": 0,
            "comment": "At least the ones who lied under oath.... wait that's all three nvm",
            "score": 1,
            "author": "Kitchen-Finish-7106"
        },
        {
            "level": 0,
            "comment": "I agree those hacks should recluse themselves, but we live in bizzoro land.",
            "score": 1,
            "author": "AdTechnical9332"
        },
        {
            "level": 0,
            "comment": "That simply doesn’t follow.",
            "score": 1,
            "author": "FiendishHawk"
        },
        {
            "level": 0,
            "comment": "Hello friends. In solidarity with the current reddit protests against the mismanagement of its communities, community leaders, valued contributors and userbase [we are setting every submission to \"clubhouse\" for 72 hours and increasing the Clubhouse participation threshold exponentially.](https://www.reddit.com/r/WhitePeopleTwitter/comments/147202i/whitepeopletwitter_shows_solidarity_with_the/)\n\nPlease feel free to discuss the current protests in the stickied megathread about them. We will resume normal operation after this time.Thank you for your patience and support, \n\nThe WPT moderation team.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WhitePeopleTwitter) if you have any questions or concerns.*",
            "score": 0,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "And we've crossed over into stupid territory. The justices are awful but for reasons totally unrelated to Trump's actions. Such a deeply dumb take by someone I should ordinarily agree with.",
            "score": 0,
            "author": "rhit_engineer"
        }
    ]
}