{
    "id": "1496t46",
    "score": 2750,
    "title": "The way it always works",
    "author": "CrunchM",
    "date": 1686746280.0,
    "url": "https://www.reddit.com/r/WhitePeopleTwitter/comments/1496t46",
    "media_urls": [
        "https://i.redd.it/bfsrdftoaz5b1.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Hello friends. In solidarity with the current reddit protests against the mismanagement of its communities, community leaders, valued contributors and userbase [we are setting every submission to \"clubhouse\" for 72 hours and increasing the Clubhouse participation threshold exponentially.](https://www.reddit.com/r/WhitePeopleTwitter/comments/147202i/whitepeopletwitter_shows_solidarity_with_the/)\n\nPlease feel free to discuss the current protests in the stickied megathread about them. We will resume normal operation after this time.Thank you for your patience and support, \n\nThe WPT moderation team.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WhitePeopleTwitter) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "I used to be one of those people who were all “both sides are bad! Ya ya blah blah!” \n\nOver the past few years, I fully and completely understand just how bad the right wing is. Bad is an understatement, is there a word worse than “bad”?\n\nThe left has its issues for sure, they aren’t flawless. I’ll be dipped if I can’t name any of them off hand though….",
            "score": 283,
            "author": "DarthArtero",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m glad you’ve come around. It can be easy to get frustrated with the left leaning politicians but it’s very important to keep perspective. For example, a stomach ache is bad but is objectively much, much better than stomach cancer",
                    "score": 101,
                    "author": "Didntlikedefaultname",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "“Frustrated” is exactly the word. I get frustrated that Democrats can’t effectively stop Republicans from doing evil shit. That doesn’t mean I want to help Republicans do evil shit instead.",
                            "score": 69,
                            "author": "SolomonCRand",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yup spot on. And it often is a lesser of two evils situation but it’s also about political momentum. The more people get behind progressive policies the more they will be inacted. The more people are politically ambivalent the more it opens the door for regressive policies that benefit small but powerful groups",
                                    "score": 14,
                                    "author": "Didntlikedefaultname"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I was a politically neutral person until about 2 months ago. I've only recently switched to Democrats because the Republicans are constantly saying very stupid, irresponsible, and quite frankly dangerous things. I even tried to stay neutral during the Capitol Riots and write it off as that perhaps they were misled but then they started shooting up things and sending bomb threats to anyone that they disagreed with. The Republicans made it impossible for me to remain neutral. I was metaphorically sitting comfortably on a very high ledge until the Republicans raised the water above my head. I can either swim for a sinking life raft with the Republicans or swim for the shore during a storm with the Democrats. Believe me I wish I could have stayed neutral and ride this out but it's simply impossible now.",
                    "score": 34,
                    "author": "TheHiveMindCouncil"
                },
                {
                    "level": 1,
                    "comment": "I have voted twice and voted for Donald Trump both times. MAGA rallies, huge pickup truck, red all the way. Over the last three or four years I came to understand the errors of my ways. The right is overflowing with racism, greed, racism, and hate. I don’t want to forget who I was, but I will never go back. I can proudly say I walked away from the cult of GOP.",
                    "score": 42,
                    "author": "HowBoutIt98",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How’d you get sucked into that in the first place? What made trump appealing enough to you to vote for him twice?",
                            "score": 11,
                            "author": "Didntlikedefaultname",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It was the environment I grew up in. The town I lived in had less than six hundred residents. The class I graduated with in high school had thirty people. Everyone I knew was Republican. I voted for the candidate with (R) beside their name and no one else. Eventually I met a girl that flipped my views upside down.",
                                    "score": 23,
                                    "author": "HowBoutIt98",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thank you for answering and I’m glad you found your way. It’s interesting to hear just how powerful those identity politics and insular communities can be firsthand",
                                            "score": 11,
                                            "author": "Didntlikedefaultname"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Same boat as you bud, my family was always pretty liberal but I firmly believed both sides were corrupt and it was the \"lesser of two evils\" dilemma. Obviously the Democratic party isn't full of Saints and they have an agenda that they're looking to push that benefits them, but comparing their \"evil\" to the GOP's is like saying stealing a candy bar and shooting someone in the face are the same because they're both crimes.  \n\n\nAt this point not taking a side is just as bad as voting for the Republicans. And that's their whole strategy, it always has been. The more they can disenfranchise people who are on the fence, the less likely those people are to vote at all. It's why you never hear them talking about their game plan to *actually* make America great (again), they just like to go on and on about the libs destroying democracy and freedom. All they can do is talk shit to make their shit look less bad by comparison.",
                    "score": 6,
                    "author": "_Blackstar"
                },
                {
                    "level": 1,
                    "comment": "The right is badong.\n\nhttps://youtu.be/9DW6Gz0N6Hs",
                    "score": 8,
                    "author": "DrShanks7",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you! I was hoping someone would get that vague vague reference!",
                            "score": 2,
                            "author": "DarthArtero"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I never used \"loathsome\" in my regular vocabulary until recently when I was trying to come up with a stronger word.  Loathsome feels pretty good so I'll stick with it.",
                    "score": 2,
                    "author": "RebuiltGearbox"
                },
                {
                    "level": 1,
                    "comment": "\"Is there a word worse than bad?\"\n\n![gif](giphy|l3fZZECaqQMvKsE5a)",
                    "score": 2,
                    "author": "ArchonofTevinter"
                },
                {
                    "level": 1,
                    "comment": "There is a word worse than bad.\n\nIt's Nazi.",
                    "score": 4,
                    "author": "TheDankJedi420"
                },
                {
                    "level": 1,
                    "comment": "Beyond all the crazy, the biggest issue I have is that they have no interest in partnering or compromising on any common issues that will benefit the American people. They simply say “no” to everything without any valid facts to back up their stance. They don’t want the other side to have anything considered a win.  So zero progress is made and we all suffer for it. \n\nSince we pay their salaries, there should be some way to hold them accountable (beyond just voting, cause we see the same idiots voted in over and over) At my job I have goals, tasks, collaborations that I must complete in specific timeframes. I don’t have the option to say “I’m not doing that because I don’t feel like working with that person/team”",
                    "score": 1,
                    "author": "Taminella_Grinderfal"
                }
            ]
        },
        {
            "level": 0,
            "comment": "“I’m not political and both parties are bad” now let me lean heavily into some far right talking points…",
            "score": 286,
            "author": "Didntlikedefaultname",
            "replies": [
                {
                    "level": 1,
                    "comment": "Using Fox News buzzwords.",
                    "score": 104,
                    "author": "jimdotcom413",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "\"I don't even watch Fox though!\"",
                            "score": 68,
                            "author": "AWildRapBattle"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My dad is one of these. Has only voted Republican his *entire* fucking life, including happily voting for Trump the first time. Still has several Rush Limbaugh books up on the shelf. Claims he's not conservative, but thinks Joe Biden is *way* too far to the left and could never vote for him, so he had to vote for Trump again the second time to save the country from socialism. But he swears he's independent and gets offended when I call him conservative.\n\nI love my Boomer dad, but he's that fuckin' guy.",
                    "score": 10,
                    "author": "ShexyBaish6351",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’d be curious what actual policies he agrees or disagrees with. I feel like a lot of people who vote based on identity politics can’t really actually explain which policies or actions they support or don’t support and that can be a helpful tool to getting them more politically engaged. Sometimes. Hopefully…",
                            "score": 4,
                            "author": "Didntlikedefaultname",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He was a rightwing news junkie for a very long time, so all of his beliefs about politics are exactly what you'd think a Fox News watching Boomer would think.  \n\n\nThen came Trump, who he found inspiring, but then he watched Trump fuck up absolutely everything, and I think that was his final disillusionment. I think the fact that Trump didn't turn out to be any kind of savior, but rather a gigantic embarrassment, was the straw that kind of broke his back. He has thrown his hands up and decided that everything related to politics is complete shit, on both sides.  \n\n\nIf I were to ask him about one thing that's really important to him, it would be gun rights. And you know to which party he leans on that issue....",
                                    "score": 2,
                                    "author": "ShexyBaish6351"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "My mom is like this... she is smart enough to know she should be ashamed of her shitty beliefs, so she claims she is an independent while she bullies her suicidal trans grandchild.",
            "score": 92,
            "author": "JesusHHChrist"
        },
        {
            "level": 0,
            "comment": "Now straight white people are posing as LGBTQ or other marginalized groups to try to speak from a place of authority on topics of hate. They seem to forget people can see their other comments.",
            "score": 48,
            "author": "cujobob",
            "replies": [
                {
                    "level": 1,
                    "comment": "\"I'm the leftest leftist there is, which is why I think Donald John Trump is the progressive choice. Also, what's with all the trans people, amirite?\"",
                    "score": 13,
                    "author": "2pacalypso"
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"enlightened centrism\"",
            "score": 40,
            "author": "AWildRapBattle"
        },
        {
            "level": 0,
            "comment": "Oh you mean \"Libertarians\"?",
            "score": 48,
            "author": "thankyeestrbunny",
            "replies": [
                {
                    "level": 1,
                    "comment": "How should I go about voting R without the stigma? I also may want to see if someone is willing to date me at some point. \n\n*light bulb turns on*",
                    "score": 24,
                    "author": "jabdtx"
                },
                {
                    "level": 1,
                    "comment": "Worse, its a 'classic liberal'",
                    "score": 6,
                    "author": "Geler"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Buttery Males!!!!  Lock her up!!!  Wait it’s not fair that we be accountable for our crimes, only that you suffer for our outrage over non criminal behavior!!!",
            "score": 18,
            "author": "Bulky-Internal8579"
        },
        {
            "level": 0,
            "comment": "BoTh SiDeS",
            "score": 27,
            "author": "MountainSage58"
        },
        {
            "level": 0,
            "comment": "\"I'm a free speech absolutist that voted Dem my whole life\" -- said the fascist billionaire who's always been right wing.",
            "score": 12,
            "author": "-Epitaph-11"
        },
        {
            "level": 0,
            "comment": "It’s because centrism is inherently reactionary - it only cares where the poles, the extremes are, not where it actually stands (which, coincidentally, is for nothing)\n\n\n\n\n\n\nThere’s literally a story in the Bible (edit: King Solomon, apparently) about the inhumane nature of blind compromise. There is a reason that story is 2000+ years old.",
            "score": 23,
            "author": "shrimpleypibblez",
            "replies": [
                {
                    "level": 1,
                    "comment": "If you're referring to cutting a baby in half as a compromise, you're talking about King Solomon. King Herod ordered the death of all of the first born children in Israel in order to circumvent the coming of the Messiah who he believed would usurp him.",
                    "score": 3,
                    "author": "garthastro",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I stand corrected (as does the original comment) - only book of the Bible I know well is Ecclesiastes",
                            "score": 1,
                            "author": "shrimpleypibblez"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Centrism isn't inherently reactionary, it's just easy for reactionaries to characterize their views as centrist because they aren't advocating for anything in particular.",
                    "score": 6,
                    "author": "AWildRapBattle",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Relative might have been a better word",
                            "score": 4,
                            "author": "shrimpleypibblez"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yeah, both sides suck, but one is openly attacking minorities and claiming all lawsuits against their members are part of a conspiracy against them, the other just doesn’t do nearly enough to help the people who elected them.",
            "score": 7,
            "author": "Knight-Creep"
        },
        {
            "level": 0,
            "comment": "When they are ashamed of their ideology and beliefs, that's when they lie and start spewing \"both sides\" BS.  Too cowardly to come out and say, I am a backward regressive rightie.",
            "score": 8,
            "author": "Prestigious-Quiet-17",
            "replies": [
                {
                    "level": 1,
                    "comment": "BS = Both Sides\n\n&amp;#x200B;\n\nSee what I did there? I crack myself up...",
                    "score": 2,
                    "author": "CrunchM"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I used to consider myself centrist.\n\nThe meme is correct lads\n\nEDIT: Downvote me all you want, I stopped being a centrist when I realised centrists are just embarrassed right wingers. \n\nPush comes to shove, all centrists will side with the right.",
            "score": 8,
            "author": "A17012022",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same here. I was \"fiscally conservative, socially liberal\" as a freshman in college. Followed a bunch of libertarians on social media and devoured their opinions and content. Fast forward a few years, I'm now progressive, and it turns out that almost all of the libertarians I used to admire have outed themselves as fascists.",
                    "score": 8,
                    "author": "GiantGaping_Butthole"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Also:\n&gt;Both sides",
            "score": 2,
            "author": "YourOldManJoe"
        },
        {
            "level": 0,
            "comment": "“I’m a classical liberal. Which is a much cooler way of saying I’m a Candace Owens conservative.”",
            "score": 6,
            "author": "TheThemeSongs"
        },
        {
            "level": 0,
            "comment": "Same with the \"both sides\" bullshit. We're supposed to not notice that its exclusively one side screaming this",
            "score": 4,
            "author": "FelixVulgaris"
        },
        {
            "level": 0,
            "comment": "Also: \"I don't care about political party, I'm an issues voter.\" Repeating almost verbaitm Sean Hannitty's nightly shtick from his earlier years.",
            "score": 3,
            "author": "brianishere2"
        },
        {
            "level": 0,
            "comment": "They always question your willingness to compromise.  Like they're playing some better 'long game' by letting things get worse, instead of pushing for better while stopping the fascists.\n\nAnd they're probably stuck in this mindset.  Because crawling out would require compromising their ego.",
            "score": 3,
            "author": "FangYuan_123"
        },
        {
            "level": 0,
            "comment": "The answer to shrodingers racist is always republican.",
            "score": 2,
            "author": "got_dam_librulz"
        },
        {
            "level": 0,
            "comment": "Leftists have a fuckton of problems, sure, one I personally hate is how yall just assume everyone can see what you see, sense your nuance. No, stop calling them MAGA, all you're doing is giving legitimacy to their phrasing of Making America Great Again, don't play nice and call them what they want to be called. Call it like it fucking is, they're terrorists, end of\n\nBut to call both sides the same, is like having someone put 1 sugar in your tea, and getting equally as mad at them as you do to the person serving you the tea that they pissed in. That's how stupid anyone who calls both sides sound",
            "score": -1,
            "author": "Trosque97"
        },
        {
            "level": 0,
            "comment": "Because nobody's embarrassed to say they're on the left. There's only one reason to pretend to be bOtH sIdEs! It's because you're on the right and you know your ideas are wildly unpopular.",
            "score": 1,
            "author": "subject_deleted"
        },
        {
            "level": 0,
            "comment": "So if I don't support Fascist Lite, then I'm automatically part of the Fascist cult.  Sure.\n\nAll this does is justify my \"NO CONFIDENCE\" vote, and thorough belief that Americans are woefully, pathologically incapable of governance.",
            "score": -2,
            "author": "Just1Darque"
        },
        {
            "level": 0,
            "comment": "Hello friends. In solidarity with the current reddit protests against the mismanagement of its communities, community leaders, valued contributors and userbase [we are setting every submission to \"clubhouse\" for 72 hours and increasing the Clubhouse participation threshold exponentially.](https://www.reddit.com/r/WhitePeopleTwitter/comments/147202i/whitepeopletwitter_shows_solidarity_with_the/)\n\nPlease feel free to discuss the current protests in the stickied megathread about them. We will resume normal operation after this time.Thank you for your patience and support, \n\nThe WPT moderation team.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WhitePeopleTwitter) if you have any questions or concerns.*",
            "score": 0,
            "author": "AutoModerator"
        }
    ]
}