{
    "id": "hxl80u",
    "score": 121511,
    "title": "Bernie burning Musk to the ground.",
    "author": "[deleted]",
    "date": 1595676484.0,
    "url": "https://www.reddit.com/r/WhitePeopleTwitter/comments/hxl80u",
    "media_urls": [
        "https://i.imgur.com/ACv0Acx.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 7938,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 2827,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You said weirdos so I continued reading and damn you were right.",
                            "score": 910,
                            "author": "RuralJurorSr",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[His views on COVID-19](https://www.businessinsider.com/tesla-ceo-elon-musk-kimbal-question-coronavirus-false-positive-data-2020-7) are also pretty far out there. Lots of downplaying the virus as the cases/deaths kept rising.",
                                    "score": 638,
                                    "author": "regoapps",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 481,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "He already got the payout. He's still tweeting about COVID-19.",
                                                    "score": 238,
                                                    "author": "regoapps",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Elon is like the Kanye West of science. Believes hes a genius, is not even remotely close to one. And hes a complete douche to boot.",
                                                            "score": 451,
                                                            "author": "SlapsAR",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I've done a complete 180 on him. I used to think he was kind of cool, if a little too opinionated on topics he should have just stayed clear of. Now that he's shown his true colours he can go fuck himself. He's so unbelievably wealthy, yet he wants workers to take a massive risk just to make more. All of these billionaires should have been looking after their staff out of their own pocket until it was safe for then to come back to work, but also pushing the government to make sure that the benchmark for safety is the right one. Instead they hid away from the virus and demanded that their people go die for them. Assholes, all. Elon is particularly egregious.",
                                                                    "score": 166,
                                                                    "author": "Go_easy_on_me_folks",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Musk showed his true colors when he threatened to move his business out of Cali because the government wasn’t letting him open during quarantine",
                                                                            "score": 43,
                                                                            "author": "Mandle69",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "He showed his true colors back in 2017(?) when he called someone who criticized him a pedophile.",
                                                                                    "score": 46,
                                                                                    "author": "dragonclaw518",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "This country is more of an aristocracy than democracy. Barely anyone with wealth, power, and heavy governmental influence gives a single fuck about “regular” people. We are seen as disposable tools to people like that, not human beings worthy enough of their concern or empathy, IMO. It’s fucking sad and disgusting, if not terribly disturbing because so many people swallow their bullshit.",
                                                                            "score": 49,
                                                                            "author": "Marles216",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Blows me away that people - embarrassingly including most of my family - believes people like him, Kanye, and Trump, to be actual geniuses.  They believe, and I quote, \"trump is brilliant! He's playing chess while the democrats are playing checkers\".  \n\nI just don't get it.  They claim he supports the troops, even while I as a disabled, can't veteran provide evidence where Trump's and the GOP's policies have hurt me, lowered my benefits, etc.\n\nIt is truly a cult and it has many members.  Sadly, I see no way to reach those that are that far gone.",
                                                                    "score": 236,
                                                                    "author": "Morgansneed",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Many Americans _worship_ both celebrity and wealth, while believing in the Myth of Merit. “You can’t be rich without being smart,” therefore “Richer is smarter.” Those are assumptions without foundation. I’m not saying that there aren’t smart rich people, but the correlation between wealth and intelligence is not great. \n\nAlso, I guarantee that trump can’t play chess.\n\nEdit: wow, I got at least 30 downvotes in the last 12 hours. You hurt my feelings, trumpists and wealth-fantasists.",
                                                                            "score": 121,
                                                                            "author": "Deathbyhours",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "But he can pass a dementia test. Or did he? The first sign of dementia is repeating yourself. Why does he keep telling us he passed it?",
                                                                                    "score": 36,
                                                                                    "author": "Oblongmind420",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I still believe Kanye should be held accountable for his actions but he also does clearly suffer from pretty debilitating mental illness, so even though he’s a douche I feel a lot more sorry for him than I do Elon.",
                                                                    "score": 33,
                                                                    "author": "SirEbralPaulsay",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Seriously? I didn’t know he was THAT weird! I feel like he’s so wealthy that he probably thinks the virus won’t affect him. Since it only affects us regular people of course he doesn’t think it’s a big deal. I thought he was really intelligent so it shocks me that he’s downplaying the virus!",
                                            "score": 24,
                                            "author": "ChiTownChick",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The downplaying isn’t the worst part. He’s pushing false info about covid-19. Like at the end of June he was saying how covid-19 was overblown because cases were going up but deaths were going down (common covid conspiracy theorist logic at the time). Anyone with a little bit of critical thinking would know that you don’t die immediately after you get covid. It takes like three weeks to die. So all those new cases in June don’t end up dead until July. And now that it’s July, we’re seeing a rise in deaths again due to the rise in cases from June.",
                                                    "score": 34,
                                                    "author": "regoapps",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 531,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I don't know how anyone can respect him as a person once he started baselessly calling people pedophiles. \n\nI like his cars, I don't like him.",
                                    "score": 70,
                                    "author": "Ghost4000"
                                },
                                {
                                    "level": 3,
                                    "comment": "The Maxwell edit is pretty good.",
                                    "score": 69,
                                    "author": "IWantAnE55AMG",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Hello",
                                            "score": 31,
                                            "author": "-_MaxWell_-",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "There’s so many replies about the weirdos I can’t see the actual weirdos",
                            "score": 167,
                            "author": "ItsYaBoyKevinHere",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Same. Just want to see me some weird comments not everyone talking about the said comments",
                                    "score": 39,
                                    "author": "McFlash64",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "ikr like damn i've been scrolling down for a minute and nothing...",
                                            "score": 14,
                                            "author": "ibulleti",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 1555,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The thing that puzzles me most about these hardcore supporters is that so many of them (obviously not all) aren’t even customers of the brand. I’d understand more if they owned the product(s) but they don’t. It’s really bizarre to see and understand what exactly they’re trying to defend.",
                                    "score": 515,
                                    "author": "dfaen",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The funny thing about this comment is it applies almost equally to Trump supporters, at least on a philosophical level",
                                            "score": 366,
                                            "author": "silverlegend",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "because they identify! there's a power in associating with a brand you idolize, because you can transfer a lot of those positive attributes to yourself. \n\nthat's also because they lack any backbone of their own, and don't spend as much time tending their own garden...",
                                                    "score": 117,
                                                    "author": "SandmanSanders",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 176,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Excuse me, but I'm a temporarily embarrassed BILLIONAIRE maybe even a trillionare, thank you very much",
                                                            "score": 84,
                                                            "author": "dreamsoup16",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I don't know how accurate the $46.7 billion increase in his wealth is but to put in it perspective it would take someone earning $50,000 a year 934,000 years to earn that much. \n\nNobody 'earns' that much money, especially not in four months. They take it from other people's work. I get that his wealth isn't all in cash - probably a very small portion in fact - but it comes from the work of the employees at the companies he has holdings in. They should be receiving the rewards for their work, not people like him, hedge fund managers and other shady market manipulators.",
                                                                    "score": 44,
                                                                    "author": "vinyljunkie1245",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "People always say well he came up with the idea and had the courage to start the company as a reason they should be so wealthy, but for Musk that's not even true. He just bought in to PayPal/Tesla early on. \n\nBut even for Jeff Bezos it's not like the guy programmed everything himself. Marketed himself. There are 100s of others involved, infrastructure, capitol, educated population, relative safety and good healthcare.\n\nAmazon needed all of that to become what it is. There is a reason you don't see tech startups in other countries like you do in America. The extemely wealthy need to understand that and \"pay it forward\" with higher taxes.\n\nI don't begrudge Musk for being wealthy, but  how many Billions does a person really need. At somepoint your just sitting on a pile of gold like a mythical dragon.",
                                                                            "score": 16,
                                                                            "author": "uptoke",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Their TSLA call options/ stock prices",
                                            "score": 19,
                                            "author": "ten_girl_monkeys",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I mean people who ascribe to the thought that the US is in Late Stage Capitalism have some theories. The subreddit really doesn't do that theory justice. It is because we have become so atomized and our communities along with their institutions have been destroyed you see people almost arbitrarily latching on to strong figures. We are still social animals and we yearn for these things but they are not really possible.",
                                            "score": 48,
                                            "author": "Responsenotfound",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I owned a Tesla and I’ve seen these Teslaratis who have this wierd cult like behavior.  They’ll pretend these cars they can’t afford in the first place, have absolutely no problems.  The brand new one I bought had so many problems that I Lemonned that piece of shit car.  Musk has gone over the deep end.  He openly supports Kanye for president.  It’s funny how money makes people crazy.",
                                            "score": 50,
                                            "author": "justingold24k",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt; so many of them (obviously not all) aren’t even customers\n\nThat's because he is the meme science man and a bunch of people fashion themselves as intellectuals/science enthusiasts because they spend all day on the Internet learning useless factoids.",
                                            "score": 50,
                                            "author": "BMOstolemywife",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Just another white male hero for them to worship. Same goes for the cult of Steve Jobs.",
                                            "score": 34,
                                            "author": "JJDude",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Yeah, I had wanted a Tesla as my next car but after his Covid tweets I’m done with the brand and will absolutely tell anyone I can not to buy them because their owner is a horrible person who has no empathy for his employees, his fellow Americans or anyone other human.",
                                    "score": 15,
                                    "author": "Harbinger2001",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "He's kind of a giant piece of shit isn't he...",
                                            "score": 8,
                                            "author": "Hidesuru"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "They're right up there with Bezos-Bros",
                                    "score": 12,
                                    "author": "jsake",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "People... Like... Bezos? Why? He just hides in the shadows. Does anyone even know if Bezos actually exists?",
                                            "score": 9,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "All I know is whenever I talk shit about Amazon I get a million angry people telling me I'm an asshole for not acting like Prime is the greatest gift to the world and telling me \"the warehouse workers actually have it very good actually\".",
                                                    "score": 8,
                                                    "author": "jsake",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "reddit is fanboi central too.",
                                    "score": 77,
                                    "author": "OuTLi3R28",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Not so much anymore. I used to think he was a good person too, one of the few billionaires who was using wealth and technology to benefit more than a tiny group of other wealthy people. He peaked Reddit popularity after going on Rogan's podcast building his \"everyman's billionaire\" brand. Did a pretty good job of it too. Then managed to totally demolish the image he built only leaving diehard Musk Suckers trying their damnedest to breath some of his hot air.",
                                            "score": 51,
                                            "author": "HotShitBurrito",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Why does he have such a cult following? Because he shitposts on Twitter? I’d love a Tesla but I wouldn’t worship the guy running the company just like I don’t care about the CEOs of the other companies who make stuff I like.",
                                    "score": 52,
                                    "author": "Dr_McKay",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Right? And at the very least, there's practically no praise for the actual engineering teams behind the cars they love. Sure Musk \"transformed the company with his vision\" like literally every other businessman, but when it comes to actually designing a car, credit should almost entirely be reserved for the people doing the heavy lifting!",
                                            "score": 34,
                                            "author": "Swedishtrackstar"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "You mean r/futurology.",
                                    "score": 22,
                                    "author": "vlad_v5",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "They think he*'*s tony stark when he*'*s really edison",
                            "score": 239,
                            "author": "ViZeShadowZ",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He's more Obadiah Stane",
                                    "score": 72,
                                    "author": "ELB2001",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "More of a Justin Hammer, imo.",
                                            "score": 19,
                                            "author": "LoneStarTallBoi",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Dunno Stane paid others to copy Starks suit. Hammer actually knows a bit about tech",
                                                    "score": 16,
                                                    "author": "ELB2001",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Yes! Someone else sees the real comparison! Fucking twisted irony of the universe. Tesla would be spinning in his coil , probably wondering if his real legacy is to get fucked over by an Edison analogue every generation",
                                    "score": 61,
                                    "author": "GutzMurphy2099",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Did Elon build his rocket in a CAVE? With a box of SCRAPS?\n\nI don't think so.",
                                    "score": 78,
                                    "author": "Opus_723",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "They didn't even want his rocket in the cave.\n\nhttps://www.nytimes.com/2018/07/10/world/asia/elon-musk-thailand-cave-submarine.html",
                                            "score": 53,
                                            "author": "Aethermancer",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "God I forgot that shitfest",
                                                    "score": 8,
                                                    "author": "Andy1816"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I'm pretty sure Edison actually has some achievements though despite his recent reputation as a PR man. Musk just made some smart moves buying things.",
                                    "score": 17,
                                    "author": "JohnTDouche",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Damn I spent like five minutes scrolling and there’s only three weirdos",
                            "score": 38,
                            "author": "_The_Garbage_Dump_",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "LOL at your edit. I’m sorry for your notifications",
                            "score": 148,
                            "author": "borderbuddie"
                        },
                        {
                            "level": 2,
                            "comment": "You're not showing Elon Musk the correct amount of respect.\n\nThe man invented *tunnels*. \n\nAppreciate his genius.",
                            "score": 189,
                            "author": "Orsenfelt",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Dude, you won't believe it. He even invented *trains*!",
                                    "score": 49,
                                    "author": "DerBaumHD"
                                },
                                {
                                    "level": 3,
                                    "comment": "No no, he invented tunnels *for rich people*. Even better.",
                                    "score": 31,
                                    "author": "TosieRose",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Aye yo you can flip off notifications per comment might not be a bad idea for the shit show happening down below",
                            "score": 96,
                            "author": "Goredrak",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 20,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Your comment is the \"confirmation\" of his craziness here and you're a neutral party (neither for or against Musk) \n\nSo when the crazies see thier god king having his own words used against him then a neutral person walks in and goes \"Wow that's cray.\". They start becoming extra defensive since their world views are being put side by side to the rest of the world and they don't line up.",
                                            "score": 22,
                                            "author": "Goredrak"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Well, if we're being weirdos - I recently learned that solid brown cats are rare. This is a simple thing but caused me a bit of mental anguish realizing I had never considered the color of cats or noticed the absence of brown.",
                            "score": 114,
                            "author": "jerkface1026",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "99% of all idiots who think they are smart worship Elon Musk.",
                            "score": 51,
                            "author": "breadboy42069",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Billionaires brainwash armies of stupid people to worship them. Welcome to America. It's basically zombie land in this bitch for as much as these people use their brains.",
                            "score": 18,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "As a third world country citizen, I tried not to be biased to one \"side\" since I think the people should unite to benefit the whole country. But damn, those weirdos (I assume belong to one side) are indeed weird as heck. Kinda sad for them, I hope things get better over there!",
                            "score": 47,
                            "author": "ikanx",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It’s just cuz Elon musk has a cult of weird 20 year old boys who worship him",
                                    "score": 10,
                                    "author": "mrhuggykinz"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt;Edit: Why did my reply bring out the weirdos?\n\nIt's reddit. Pretty sure a lot of those comments are from kids to people in their early 20s trying to be edgy. \n\nBut then again, we have full grown adults arguing about wearing a piece of cloth over their face...\n\nThis world is fucking weird.",
                            "score": 33,
                            "author": "DontSuhmebro"
                        },
                        {
                            "level": 2,
                            "comment": "wasn't really Musk.\n\nIt was his cousin\n\nLion Musk\n\nOfcourse he was charged up !\n\nHe is known for being well metal\n\n&amp;#x200B;\n\nEdit: cheers for the gold stranger !",
                            "score": 38,
                            "author": "10044909",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": " Stop check your notifications now  lol.  After reading this comments,   i would  have just go to notifications and mark all of them as read. \n\nNo need to check individual comment.",
                            "score": 30,
                            "author": "Dead-Shot1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I personally learned reading individual replies was worthless a long time ago.\n\n&amp;#x200B;\n\n[https://i.imgur.com/RQglJ9g.png](https://i.imgur.com/RQglJ9g.png)\n\n&amp;#x200B;\n\nlol",
                                    "score": 15,
                                    "author": "TellMeGetOffReddit",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Get off Reddit. Sorry your username told me to",
                                            "score": 14,
                                            "author": "nono_rodval"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Here you can read the whole [thread](https://twitter.com/elonmusk/status/1286673686821515266?s=19)",
                    "score": 494,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "lmfao he really posted \"Twitter sucks\" afterwards like a fucking brooding middle school kid holy fuck.",
                            "score": 546,
                            "author": "SpaceballsTheHandle",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Imagine forming a huge part of your identity around your obsession with this fuckhead lmao.",
                                    "score": 248,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 117,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That's just their way of life though",
                                                    "score": 19,
                                                    "author": "WootyMcWoot"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I mean he tanked Tesla stock by saying 420/69 to impress his girlfriend. \n\nSo...yep.",
                                    "score": 76,
                                    "author": "emsok_dewe",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Because he is one",
                                    "score": 80,
                                    "author": "G-Geef",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "And then his ~~wife~~ baby mama tweeted at him to stop tweeting and call her.",
                                    "score": 30,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Thats awesome my man thanks for the link!",
                            "score": 86,
                            "author": "TheBearGod39",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I love that he ended his twitter hog pile with “twitter sucks”",
                                    "score": 82,
                                    "author": "ThePopeofHell",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Elon Musk Sucks!",
                                            "score": 44,
                                            "author": "sanduskyjack",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I like the suggestion that he should get lithium from his prescriber",
                            "score": 19,
                            "author": "Rick_Astley_Sanchez",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Is this an actual quote?",
                    "score": 147,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "https://twitter.com/elonmusk/status/1286866843307737088?lang=en",
                            "score": 197,
                            "author": "dimmidice",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Slowly Elon is losing all my respect",
                                    "score": 148,
                                    "author": "Dr_Apk",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Slowly? Read like any of his tweets",
                                            "score": 512,
                                            "author": "demonx19",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Back there, when he Twitted about reopen America. I stopped following him. It made me so mad, as a medical prof i was working so hard and that bitch just tweeting out reopen. And all of his tweets was against science.",
                                                    "score": 275,
                                                    "author": "Dr_Apk",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "He actually has a surprisingly extensive history of being absolutely obnoxious and idiotic on Twitter. Someone put together a compilation of all his tweets where he was just being a complete asshole to anyone that didn’t praise him, it was pretty eye opening. Dude is a narcissist.",
                                                            "score": 72,
                                                            "author": "hendrix67",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[deleted]",
                                                                    "score": 40,
                                                                    "author": "[deleted]",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Elon is 100% concerned with Teslas stockprice while people drop left and right from a global pandemic. He would sacrifice every single worker in his employ if it meant a extra couple points for Tesla in the markets. He's a ghoulish megalomaniac asshole billionaire who is more likely to simply die insanely wealthy after a liftime of grifting rather then ever get anybody to Mars.",
                                                            "score": 25,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "So you continued following after the pedo accusation fiasco?",
                                                            "score": 77,
                                                            "author": "LotharVonPittinsberg",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Twatted ftfy",
                                                            "score": 9,
                                                            "author": "TochiOrNotTochi"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Wow if you paid any attention to what a prick he is I bet you'd have lost that a loooong time ago. I too thought he was an innovative businessman, and he might be in some regards, but god damn he seems like a jackass in all other aspects.",
                                            "score": 58,
                                            "author": "daellat",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Slowly? This bitch just jumped into “billionaires who deserve the guillotine for $1000, Alex.”",
                                            "score": 52,
                                            "author": "[deleted]",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Elon has lost all my respect. Fuck Elon musk",
                                            "score": 57,
                                            "author": "a_corsair",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Ya fuck elon musk",
                                                    "score": 9,
                                                    "author": "MAXMEEKO",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 60,
                                            "author": "[deleted]",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "You still have respect for him? Even after the time he called a dude a pedophile for hurting his fragile ego?",
                                            "score": 23,
                                            "author": "LordOfTurtles",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Disgustingly enough, yes.",
                            "score": 45,
                            "author": "finitecapacity",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Ofc he doesn't get his lithium from Bolivia, there are infrastructure projects and a shitton of privatizations to do before he can. Hence the coup. What a cunt.",
                    "score": 106,
                    "author": "redwashing",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Elon: also, we get out lithium from Australia.\n\n@robiticon: Looking at your tweets tonight, you should probably be getting it from your prescriber instead\n\nI fucking lost it.",
                    "score": 30,
                    "author": "sk8thow8",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 12,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "So classic. It's ok when we do it, deal with it kid. Fucking Yanks and yank apologists.",
                    "score": 800,
                    "author": "Teh_Mongoose",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Musk isnt even American, dont let the cunt fool you\n\nHis family got rich in apartheid South Africa. This is why he's so anti-worker and against human rights.",
                            "score": 1296,
                            "author": "KID_LIFE_CRISIS",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Don't disparage Daddy Musk, I'm sure that Apartheid-Era emerald mine his father owned was entirely above-board!",
                                    "score": 633,
                                    "author": "1945BestYear",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "This is what the SpaceX Mars colony fans fail to realise.\n\nA Mars colony run by Musk isn't going to be some futuristic sci-fi space colony fantasy. It'll end up looking a lot more like one of his South African mine camps.",
                                            "score": 363,
                                            "author": "daemen",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Fascists fantasize about alien invasions, or apocalyptic impacts, or desperate space colonies, or any other variety of terribly dire circumstances, because in those circumstances they can finally feel justified in their ambitions to act like Immortan Joe.\n\nAnyone on a Musk branded space colony would surely be worked to death under the guise of it being an absolute necessity, and it would be a necessity by design. Musk has been open about his disdain for human life, and given a choice between going to Mars safely in a hundred years with a good plan or going to Mars tomorrow and treating people there like disposable slaves, he's openly said he'll pick the latter. And if the way he's treated his factory workers during a global pandemic is any indication, you can guess how he'd treat people on Mars during a water shortage that only exists because he's a big boy who makes big boy submarines and he wanted to do the thing NOW.",
                                                    "score": 216,
                                                    "author": "lankist",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Dream of becoming Immortan Joe, actually end up being one of his war boys huffing spray paint.",
                                                            "score": 58,
                                                            "author": "ReadyThor",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "If I could be half as metal as Doof Warrior I'd be pretty happy tbh",
                                                                    "score": 15,
                                                                    "author": "Strange-Score",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "It'll be ran like cruise ships and maritime law. Hire employees from countries with low employment standards, sell seats to citizens of countries with high employment standards.",
                                                    "score": 13,
                                                    "author": "InadequateUsername"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[link to Behind the Bastards - Elon Musk](https://www.iheart.com/podcast/105-behind-the-bastards-29236323/episode/part-one-i-do-not-like-63419860/)",
                                    "score": 191,
                                    "author": "hoxxxxx",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'll always up vote a Behind the Bastards link. That podcast is the best.",
                                            "score": 61,
                                            "author": "pm_me_your_livestock",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "i started listening to it a few weeks ago. i love the host, his other stuff is great too",
                                                    "score": 24,
                                                    "author": "hoxxxxx",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Listen to the Steven Seagal episode, pure gold!",
                                                            "score": 15,
                                                            "author": "Mpek3",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Ohh I know what I’m listening to today while I do my yard work.",
                                            "score": 12,
                                            "author": "Ghoulius-Caesar",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "NOOOO!! You can’t say that! Elon made his money by being an internet genius!",
                                    "score": 50,
                                    "author": "rather_retarded",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "I am loving this. Everyone I know wants to lick Elon’s balls because he smoked a joint with Joe Rogan and because oooo he’s a super cool spaceman! \n\nReddit always tells the real shit.",
                                    "score": 149,
                                    "author": "StuckWithThisOne",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 171,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 20,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Both of those guys are douchebags. I'll never understand why people like Rogan so much. The dude acts like a college kid who just finished psych 100.",
                                            "score": 139,
                                            "author": "Vanderwoolf",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I’m gonna be honest, I smoke a bit and I adore space, but I’ve never watched Joe Rogan, or that specific podcast. I’ve always gotten this exact impression and honestly the rest of TV and social media is mind numbing enough.",
                                                    "score": 39,
                                                    "author": "StuckWithThisOne",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I listened to a couple episode of his podcast. The overwhelming feeling I got is that he's always waiting for the other person to stop talking so he can start.\n\nI also cannot advocate support for someone who gives people like Alex Jones and Gavin Mcinnes platforms.",
                                                            "score": 69,
                                                            "author": "Vanderwoolf",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Giving people like that a platform is like voluntarily contracting covid. That shit has enough reach already don't help it out",
                                                                    "score": 33,
                                                                    "author": "G-Geef",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "What? But according to Joe COVID is almost impossible to contract and I'm to stupid to realize he is absolutely just pulling that out of his ass /s",
                                                                            "score": 9,
                                                                            "author": "[deleted]"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "If anything, him smoking a joint there makes him a huge fucking hypocrite. He owns companies that have drug tested and fired people for smoking weed",
                                            "score": 69,
                                            "author": "[deleted]",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "He knows how to stay relevant by pandering to people who won’t look further into him than twitter and guest appearances. But the guy is a royal asshole.",
                                            "score": 29,
                                            "author": "SprittneyBeers"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 18,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "His wealth still comes from colonizer money tho",
                                    "score": 50,
                                    "author": "bing_bang_bong",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 70,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Musk is South African with triple American and Canadian citizenship.",
                            "score": 20,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Elon Musk is South African.  The US doesn't have a monopoly on shitty people.",
                            "score": 117,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 76,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's about the formative years- childhood and adolescence. As an American working/living with South African of the privledged class, there's a certain entitlement and hubris particular to those that grew up during Apartheid, and even after- the mentality didn't disappear overnight.  I grew up down the street from one SA guy whose family moved in when we were like 15 years old  to an NYC suburb- the guy just had this extreme, loud and tone-deaf exceptionalism thing going on. It lasts to this day, 20 years later, here in the US where he's spent the majority of his life. He reminds me of a less-intelligent, just as tone-deaf and annoying version of Elon Musk in many ways. If he could speak, he would say \"What I do is exceptional, I am exceptional, and everyone should recognize me for that!\"\n\nThe Canadians I work with (we're in the mining industry) actually were first to point this out- I always thought my SA neighbor was just a peculiar dickhead. But lots of educated South African men have this trait, after working with them. Women have mentioned it to me, too- the guys just think they're special and it particularly doesn't gybe well with Canadian culture.",
                                            "score": 56,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "South African here. You are not wrong, but by now most of those assholes are some other country's problem.",
                                                    "score": 25,
                                                    "author": "JetSetMiner"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "You can tell from all the post-apartheid cricketers who are randomly spouting “All Lives Matter”. You’re in FUCKING SOUTH AFRICA, you insane racist!",
                                                    "score": 8,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I know he won't read this but if he happens to log on today and see I want him to see this.\n\n&amp;#x200B;\n\n**FUCK YOU ELON. FUCK YOU FOREVER**",
                    "score": 37,
                    "author": "PartyClock",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "...And when the coup fails and the country falls to pieces and people wanna escape to save their lives we act like we have zero responsibility for their troubles...\nWhat a dirt bag.",
                    "score": 18,
                    "author": "Gaffsgvdhdgdvh"
                },
                {
                    "level": 1,
                    "comment": "Elon is a fucking cunt.",
                    "score": 23,
                    "author": "Valkie"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That is so bad, someone just keyed his car in space.  \n\nEdit: thank you for the workingman's gold. \n\nEdit2:,Twitter harder. I get that Musk responded on Twitter, his response did not appear on this post before I made the witty reply, I don't have Twitter. In all cases, no Musks were harmed during the making of this reply, so the people for the ethical treatment of Elons (P.E.T.E.s) can stand down, he is going to be fine.",
            "score": 3547,
            "author": "explosivelydehiscent",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 2633,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A while ago Musk had his car launched into space as a PR stunt (or to test their rockets, whatever)\n\nOccasionally, annoying people get their cars scratched by keys.",
                            "score": 553,
                            "author": "xayde94",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It was to hide the body in the space suit\n\n^^^/s",
                                    "score": 186,
                                    "author": "chaun2",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "My god!\n\nDoes Twitter know about this?",
                                            "score": 38,
                                            "author": "ISawHimIFoughtHim",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Elon musk launched his car into space a while back (or maybe it was last week, idk, time has moved weirdly since 2020 Started).\n\nThis comment is saying that Elon musk’s comment about a second stimulus package is so bad that it prompted someone to go thru all the effort to key musk’s car that’s in space.",
                            "score": 127,
                            "author": "Faydeaway28",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "He's not behaving like an idiot. He's behaving like slavedriver. He's demonstrated he's smart enough to understand the topic, he chooses not to because he must be devoid of empathy.\n\nHe's not a hypocrite. He's evil. Evil people lie to get what they want.",
                            "score": 81,
                            "author": "FirstEvolutionist",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 19,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The unveiling of his true colors during recent events made decide to not get the solar power systems they  for my home. Even if some of the things they do are kinda good, when your brain functions this way I question the validity of anything they touch.",
                            "score": 20,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Yeah in a way he's like a Kardashian. Make a whole lot of noise.",
                            "score": 36,
                            "author": "Oldskoolguitar",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 1296,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yup, wants the cash to go directly to citizens and supports UBI.",
                    "score": 381,
                    "author": "duffsoveranchor",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Exactly. \n\nI’m not sticking up for Elon as he is bat shit crazy at times. \n\nThis tweet though is out of context and he does appear to support UBI. People just love to react and assume everyone is either all bad or all good. When in reality people are a varying degree of both.",
                            "score": 176,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "People are conveniently ignoring this and idk why. Guess they didn't read the whole thread? Musk is still slimey, but this tweet is out of context.",
                    "score": 166,
                    "author": "blazinrumraisin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How could it be taken out of context? He himself put that thought out there. It’d be one thing if he had started a thread explaining what he meant, but he didn’t, he waited for a reaction to “give context” to what he was saying.",
                            "score": 156,
                            "author": "cilantrokay",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 4905,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s spot on.  Brilliant",
                    "score": 879,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "When an incel gets pussy AND a few billion dollars off robinhood",
                            "score": 496,
                            "author": "Young_Djinn",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Don't forget about his daddy's emerald mine",
                                    "score": 189,
                                    "author": "eldergods666",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "And Notch is what happens when you subtract pussy from that equation.",
                                    "score": 38,
                                    "author": "T3hSwagman",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Bruh.",
                    "score": 174,
                    "author": "yrfrndnico",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Probably why half of Reddit worships the dude",
                    "score": 221,
                    "author": "MurpMan95",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 98,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 229,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "i studied applied physics and electrical engineering and can tell you that's only half true. most people whom I'm still friends with are not like that and coincidentally they also vote left. \n\nbut maybe \"le stem lords\" is referring to a specific type of person that also studies a stem subject.",
                            "score": 158,
                            "author": "qjornt",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; From STEM, an abbreviation short for \"Science, Technology, Engineering and Mathematics\". A STEMlord is a pejorative term for a particular kind of person who has studied in these areas at university or works in these fields who holds a pretentious, condescending attitude to anyone who has studied in any other fields, particularly the Arts and Humanities. They typically believe themselves to be more \"intelligent\" and \"rational\", while generally remaining incredibly ignorant outside of their areas of expertise...\n\nhttps://www.urbandictionary.com/define.php?term=STEMlord\n\nIt seems most common with those working for tech companies as software / data / electrical / mechanical engineers. Yeah, obviously not every single person who majors in a STEM field is a \"stem lord\", the term was coined to refer to a specific type as described above. Spend enough time here in the right threads and you'll see some making comments fitting the description above, though it used to be worse a few years ago.",
                                    "score": 109,
                                    "author": "proudbakunkinman",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "And a hair transplant",
                    "score": 23,
                    "author": "Miss_Smokahontas"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I fucking can’t stand that Musk twat.",
            "score": 2151,
            "author": "mediashiznaks",
            "replies": [
                {
                    "level": 1,
                    "comment": "I never understood the hype and worship he gets. He has always been a shitty person.",
                    "score": 1082,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I did get the initial praise he got, he was basically a memeing billionaire edgelord. \n\nBut it turned out he's just another asshole.",
                            "score": 1241,
                            "author": "TheDustOfMen",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah at first it kind of seemed like he may be slightly more in touch with the average person than most CEOs, but alas he is human waste like the rest",
                                    "score": 533,
                                    "author": "scooter_se",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I love what he's doing. I just hate how he's doing it.",
                                            "score": 107,
                                            "author": "PunchMeat",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I also appreciate what his underpayed and underprotected employees who are actually as smart as Musk tries to present himself as are doing. Doesn't change the fact that the man himself is a massive cunt.",
                                                    "score": 171,
                                                    "author": "redwashing",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "He is literally like Kanye. Almost the same exact situation.",
                                    "score": 47,
                                    "author": "MightyNooblet",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "He turned an even shitter person as soon as he had his hair implant done. Almost can't believe he looked like the bald guy from The Office.",
                            "score": 51,
                            "author": "zerohuntr",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 14,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "He's a supervillain in the making. If anyone is going to come up with a plan to blow up the moon, its ~~piccolo~~ *Elon Musk*",
                            "score": 30,
                            "author": "FarHarbard"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 106,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's sad that people go to great lengths to defend a celebrity who doesn't even know they exist. All the while ignoring anything negative about them. \n\n\nr/ElonMusk is pure cringe.",
                            "score": 73,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "For anyone who's interested: [Behind the Bastards: I Don't Like Elon Musk Very Much part2](https://podcasts.google.com/?feed=aHR0cHM6Ly9mZWVkcy5tZWdhcGhvbmUuZm0vYmVoaW5kdGhlYmFzdGFyZHM&amp;ep=14&amp;episode=YzA2MjRkNmUtMzdjYi0xMWVhLTg2ZTctNmJjNjE1Y2QxZjAx) and [Part1](https://podcasts.google.com/?feed=aHR0cHM6Ly9mZWVkcy5tZWdhcGhvbmUuZm0vYmVoaW5kdGhlYmFzdGFyZHM&amp;ep=14&amp;episode=YzA0ZDcxODItMzdjYi0xMWVhLTg2ZTctNjdiNmJjMWIzMmVi)",
                    "score": 25,
                    "author": "the_great_impression",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Robert Evans is a goddamn national treasure.",
                            "score": 8,
                            "author": "CosmicSpaghetti",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 1716,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Being in favor of universal basic income has nothing to do with passing government stimulus right now.\n\nUniversal basic income is at best a dream in the US right now.\n\nPeople need money yesterday to pay rent and for food.\n\nCorporations and billionaires like musk get support immediately when they want it. Bernies point seems to be that people need that sort of immediacy too.\n\nThe democrats in Congress are trying to get a bill passed ASAP to provide immediate assistance to people. Mitch McConnell laughed when asked if that would get passed soon.\n\nThat’s the conversation. That the comfortable billionaire supports UBI is nice, but almost entirely irrelevant.\n\nI am fortunate enough to have a very comfortable financial situation. Obviously I’m no billionaire but I’m fine. I can talk all goddamn day about UBI, but here’s the deal: that doesn’t pay bills in my community, which is struggling right now. And if republicans can’t bring themselves to provide minimal assistance today, I think UBI isn’t going to happen in the next few weeks when people need money\n\nThat’s the problem. Elon injects himself into EVERY conversation for publicity sake. He has hot takes, shit takes, he drives attention mostly to himself. And he has an army of fans who need to explain all his idiocy as “oh this is what he actually meant” and “see 14 months ago, he specifically said this”\n\nElon is a remarkable entrepreneur. We don’t need to rely on his Perspectives on every single topic though.\n\nUBI is nice, he should take that as a goal. He should also support people getting money soon, because rent will be due and people need to eat, and Americans are still struggling with unemployment.",
                    "score": 863,
                    "author": "madmaxturbator",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Exactly! People are defending Musk, but we are talking about RIGHT NOW. Not a goal that is currently unattainable under this administration.",
                            "score": 91,
                            "author": "Lazaras",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "People are really disillusioned to think “stimulus package” to be direct cash payments to people. Don’t get it twisted! Stimulus package is meat for the corporations, crumbs for the people.",
                                    "score": 7,
                                    "author": "jeremycinnamonbutter",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "He is agreeing with you, look at the rest of his thread. He wants money now for Americans, not big businesses.",
                            "score": 22,
                            "author": "zorcat27",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thanks! Wanted to post the same thing but couldn't find full thread.",
                    "score": 184,
                    "author": "zjuka",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "He only \"supported\" when the original tweet blew up in his face. And he supports UBI because he knows that'll never happen in the US. He's a far right conservative fooling the liberals with his electric cars. I can't wait for the Japanese &amp; Germans to enter the electric car market &amp; whoop his ass.",
                    "score": 177,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;he supports UBI because he knows that’ll never happen in the US\n\nI think lot of businessmen like the idea of UBI because it means less pressure to raise the minimum wage and it means more spending from consumers. He could legitimately be advocating for it",
                            "score": 65,
                            "author": "RoastMostToast",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Not quite accurate to what he actually wants. He complains about \"legislation\" because what he's suggesting is a single universal payment that *replaces* all the various benefits current in operation. Benefits for the elderly, for veterans, for disabilities, etc. He's taking the very typical libertarian approach of demanding less actual governance or federal programs. Just \"give people a pittance and let them do what they want\". Elon Musk does not care as much as you think he does about the swathes of average Americans that struggle on a day-to-day basis.",
                    "score": 59,
                    "author": "20Points",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "No they’re not on the same page - Musk is saying one thing and doing another. As Bernie points out, he’s tweeting against money he is happily taking. So what do you think his real stance is? His tweets? Or his bank account?",
                    "score": 37,
                    "author": "ElDabstroyero",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "All of everyone's charged feelings about these people aside: Musk's tweet was one in a series in which he said the stimulus shouldn't happen *because it includes too many special interest payments,* and we should just have direct payments to people. Bernie took Elon's tweet out of context.",
            "score": 540,
            "author": "monstaber",
            "replies": [
                {
                    "level": 1,
                    "comment": "He could have easily specified that in one tweet. He just put out that asterix after he got heat to cover his ass.",
                    "score": 97,
                    "author": "ohmy420",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 240,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 160,
            "author": "[deleted]",
            "replies": []
        }
    ]
}