{
    "id": "wxqfzw",
    "score": 135160,
    "title": "The White House started bombing today",
    "author": "sld126",
    "date": 1661463822.0,
    "url": "https://www.reddit.com/r/WhitePeopleTwitter/comments/wxqfzw",
    "media_urls": [
        "https://i.redd.it/1lvphy0gjxj91.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "The white house Twitter account calling out BS in Congress is a whole nother level of checks &amp; balances.",
            "score": 11798,
            "author": "Octavious440",
            "replies": [
                {
                    "level": 1,
                    "comment": "FoxNews Tonight unironically: \"What kind of president uses twitter to disrespect members of congress???\"",
                    "score": 7508,
                    "author": "thenewyorkgod",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "One that hasn’t had their account suspended?",
                            "score": 7251,
                            "author": "wrapboywrap",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 1302,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Let's see what Trump has to say about that: https://twitter.com/realDonaldTrump?",
                                            "score": 474,
                                            "author": "Suspicious_Bicycle",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Still enjoyable",
                                                    "score": 255,
                                                    "author": "BreakingGrad1991",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Clicked just to see it :)",
                                                            "score": 150,
                                                            "author": "Froggy3434",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Kapow! Thanks for the chortle!",
                                    "score": 536,
                                    "author": "JazzyJockJeffcoat",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "I prefer Presidents who haven't lost their Twitter account.",
                                    "score": 162,
                                    "author": "yeswecann",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Translation: \"It's ok when our side does it\"",
                            "score": 2564,
                            "author": "_Bill_Huggins_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That’s how they’ve always been lol",
                                    "score": 601,
                                    "author": "stitch-is-dope",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Their [hypocrisy around Biden's student debt forgiveness is incredible... or it would be if it wasn't the GOP, so it's moreso incredibly expected.](https://i.imgur.com/qZp6KAf.png)\n\nFull support for Trump's $1.9 trillion tax cuts for the rich, barely a peep about $742 billion in PPP loans forgiven (makes sense given some of them received it), voting against a climate bill that reduces the deficit by $300 billion while ignoring hundreds of billions in costs and serious societal effects *already* caused by fossil fuels, and the list could go on.\n\nThe total amount of student loans forgiven is ~1/2 of the current *yearly* US defense budget, which Republicans overwhelming support every year as the amount of spending rises.\n\n[Some sources here](https://www.reddit.com/r/antiwork/comments/wxjanh/conservative_priorities/ilr78jo/).",
                                            "score": 699,
                                            "author": "WhatsLeft71",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "What’s even more incredible is they’re blaming normal people for their degrees while claiming other normal people shouldn’t pay for it… as if it’s not helping normal people reclaim their financial life.",
                                                    "score": 98,
                                                    "author": "True_Pressure_418",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "It’s only ok when their our typos and covfefe.",
                                    "score": 186,
                                    "author": "ghec2000",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "What kind of congressperson takes $183K in loan forgiveness and has the gall to claim middle class people taking $10-20K in loan forgiveness is unfair?!",
                            "score": 644,
                            "author": "tunamelts2",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "A Republican one.",
                                    "score": 588,
                                    "author": "HappyLittleRadishes",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "They are huge POS's. This country has two sides. Either you care about the average, working class individual or you don't. Republicans don't. They like to pretend they're on the working class side...but they haven't enacted ANY legislation to prove it. Fuck them. Fuck anyone that votes for them that isn't in the top ten percent.",
                                            "score": 258,
                                            "author": "tunamelts2",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Wait fo real?",
                            "score": 41,
                            "author": "RacinInTheStreet",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Wendy’s PR entered the White House.",
                    "score": 236,
                    "author": "rtahyo",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Between this and President Biden’s tweet calling Republicans out on complaining about the 10K student loan forgiveness when they vehemently signed off on a 2 trillion dollar break for corporations, is hilarious. I’m here for it tho lol",
            "score": 4210,
            "author": "Rich-Ad5109",
            "replies": [
                {
                    "level": 1,
                    "comment": "Can somebody please think about the poor corporations? How CEO's are supposed to *~~buy their fifth yatch~~* pay their employees without those loans?",
                    "score": 1029,
                    "author": "HyperMarsupial",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 397,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I knew people who had less than 10 employees and got like nearly $100,000. Tons of self employed people cheated as well. It was the biggest fraud in history.",
                                    "score": 47,
                                    "author": "Illustrious_Farm7570",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "About time they took their mittens off, and they didn't even need to invent conspiracy theories or drop insults, just drop facts exposing their double standards",
                    "score": 235,
                    "author": "ChamanConTenis",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thank God. This type of messaging is long overdue. Show the world the fucking receipts.",
            "score": 2238,
            "author": "daddyvs",
            "replies": [
                {
                    "level": 1,
                    "comment": "Literally. Republicans have spouted bullshit and hypocrisy for years, I hope democrats start learning this is how they gotta play the game back with them otherwise people without common sense will never understand it and just worship trump all day long",
                    "score": 601,
                    "author": "stitch-is-dope",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Show receiipts for everyone talking shit in washington. This is a good start, but the fact that we don't have complete transparency from our paid representatives is insane. I would never hire a high paid, powerful job in my company and not have complete transparancy on what they do with company funds, when they are lying to consumers or clients who fund the business... I'm sure their corporate donors get all that info but not us peasants.",
                            "score": 58,
                            "author": "thatsagoddamnshame",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "A whole thread of the White House calling people out. \n\nhttps://twitter.com/whitehouse/status/1562916200866267138?s=21&amp;t=u52QD6xjlYIzPbexu8pxaQ",
            "score": 13865,
            "author": "sld126",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is glorious",
                    "score": 2756,
                    "author": "offft2222",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Unironically and without any Dark Brandon meme irony.\n\nThis is genuinely incredible stuff.",
                            "score": 1846,
                            "author": "notathrowaway75",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The big problem in the past is that the democrats didn't have the balls to smack back when the republicans pull shit like this. I think they are finally learning that sometimes, you gotta be blunt and not pull punches.",
                                    "score": 1725,
                                    "author": "UnorignalUser",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I think it's because he's not planning on running for reelection. Funny thing is, my option of him has only *increased* since he started pulling out the stops.",
                                            "score": 1086,
                                            "author": "TheAJGman",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "He's not? I'm not American so I've not seen anything about Biden not running but if that is the case then he should go all out in burning the GOP to the ground as best he can before he leaves office.\n\nAnd before you ask why I care, because the shitstains that called themselves conservatives in my country take direct inspiration from the shitstains that call themselves conservatives in your country. So if you lot are burning hopefully our lot will crawl back under the bridges them emerged from.",
                                                    "score": 235,
                                                    "author": "WCRugger",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "He's repeatedly said he is running. Anyone who claims there's evidence he isn't is making things up.",
                                                            "score": 126,
                                                            "author": "you-are-not-yourself",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Nah man senate Dems pulled some sneaky shit to get the IRA bill passed. They're finally fighting with their dicks out, and I fucking love it.",
                                                    "score": 574,
                                                    "author": "Super_Flea",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "All fun and games until someone's dick gets shot off!!! (I hope it's Matt Gaetz)",
                                                            "score": 152,
                                                            "author": "beerdogs_1502",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Our children will be safer once his severance package is through….",
                                                                    "score": 72,
                                                                    "author": "Accomplished_End7369",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I just hope they keep it up. Dark Brandon is having a surprisingly good influence on the party.",
                                                            "score": 326,
                                                            "author": "TheAJGman",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I said whoever forgives student loans gets my vote and my god the bastard did it.",
                                                    "score": 95,
                                                    "author": "Monti_r",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "The repayment changes are the biggest thing for me. That alone addresses the problem for so many folks. They just want to be able to pay their loans down without drowning in interest. If that hadn't been neglected for so long, we probably wouldn't have gotten to the point where mass cancelation of debt was a fairly mainstream idea.",
                                                            "score": 18,
                                                            "author": "dedicated-pedestrian"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "HIT THEM WITH THE CHAIR",
                                            "score": 25,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That bastard Markwayne Mullin had $1.4 mil forgiven. \n\nHe's the congressman that was making friends with the Jan 6 rioters and was showing them around.",
                    "score": 1295,
                    "author": "Diarygirl",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He’s a piece of shit in Oklahoma and every ad of his is escalating how much head he gave trump, it’s truly absurd",
                            "score": 83,
                            "author": "NerdLawyer55",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Wtf is a Markwayne. Is it supposed to be like Mark Twain. Lol wow",
                            "score": 363,
                            "author": "BigPharmaWorker",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "A markwayne is a measurement of the depth of bull shit.",
                                    "score": 335,
                                    "author": "weirdoldhobo1978",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "He's a former cage fighter from Oklahoma.",
                                    "score": 55,
                                    "author": "Diarygirl",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Took too many shots to the head it would seem",
                                            "score": 78,
                                            "author": "Dragula_Tsurugi",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "One of the blows was so devastating it smooshed his names together",
                                                    "score": 127,
                                                    "author": "Bigcityslams696",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Redneck Mario",
                                    "score": 29,
                                    "author": "MyTacoCardia"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Dark Brandon is real and he's done playing games.",
                    "score": 4962,
                    "author": "fatcootermeat",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Brandon Begins  \nDark Brandon  \nDark Brandon Rises → You are here",
                            "score": 3182,
                            "author": "Daniiiiii",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "![gif](giphy|5s1IgmpmHglVK)",
                                    "score": 867,
                                    "author": "DaWorzt",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "![gif](giphy|Reo6KcDGetE4zz468T)",
                                            "score": 576,
                                            "author": "hogtiedcantalope",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "As a Bernie Bro, I think hes doing pretty ok. Which was more than I expected TBH.",
                                                    "score": 514,
                                                    "author": "ToastyNathan",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "...not the hero we deserve but the hero we need!",
                                    "score": 183,
                                    "author": "darthnugget",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "r/DarkBrandon",
                                    "score": 87,
                                    "author": "Karmanacht",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Dark Brandon Forever - 2024",
                                    "score": 139,
                                    "author": "hsmith1998",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I just found out that my uncle had $40k forgiven. The dude own two house (one on a lake), a boat, jet ski, just remodeled his house, has several cars, goes on lots of trips, etc\n\n Not saying the guy doesn’t work hard because he does. But he also sits in a tractor monitoring stuff so by way of actual labor to income he’s doing just fine. \n\nWell he had no need for the loan. None at all. I dropped this in my group chat with my politically mixed family group chat. Silence so far….\n\nEdit. His was a ppp loan for his biz for which he is the only person who works there.",
                            "score": 206,
                            "author": "nixonbeach",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You should make plans for Thanksgiving and all major holiday feasts with your common sense friends instead of your tunnel vision fam, I feel ya man",
                                    "score": 82,
                                    "author": "Miserable_Site_850",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "The White House Twitter account called out Markwayne Mullin in his PPP loan after he tweeted that farmers are subsidizing doctors with this student loan forgiveness. \n\nWell I’m a doctor from Mullin’s state. And here’s my two cents:\n\n1) I make more than the cut-off so I don’t qualify for the loan forgiveness anyway.\n2) Even if I did, it’s $10k — I’m over $300k in debt on my student loans. That $10k ain’t touching shit for me.\n3) I can comfortably pay off my loans (eventually) and not starve to death. I wholeheartedly support loan forgiveness for others who are not so fortunate. If I have to pay taxes, I want it to help someone, by god.\n4) I know where Mullin lives. I know his (at least visible) business. He did not need that PPP loan.\n\nI wish these people would shut up and stop being so disingenuous. Anyway, my four cents.\n\nEdit: I should also add that my husband paid off the last of his student loan two years ago, after working nearly twenty years to pay it off. He also supports student loan forgiveness. These talking points are all bullshit.",
                                    "score": 47,
                                    "author": "peterhorse13",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I love that Dark Brandon kept receipts and is airing shit out.",
                            "score": 880,
                            "author": "Wifealope",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Marge's loan forgiveness is light weight compared to the others in the twitter thread. Yes, I'm aware I'm calling 183k light weight",
                                    "score": 280,
                                    "author": "Virgin_Dildo_Lover",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Its more than most people in her state take home in a decade.",
                                            "score": 157,
                                            "author": "swiftpunch1",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "*\"Dark Branden is tired of your shit.\"*",
                            "score": 104,
                            "author": "fidgeting_macro",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "NO\n\nMORE\n\nMALARKEY",
                            "score": 271,
                            "author": "yeetskeetleet",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "This is the America that's more like it. \n\nBiden pulls out the USA from Afghanistan and now is forgiving student loans. \n\nWhat next? Gas prices are going down?\n\nThese Democrats are destorying the country!\n\nYoung people will want to be educated and have jobs instead of turning to the military in desperation for money! How are wars going to be fought then?",
                            "score": 288,
                            "author": "monsieurpommefrites",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "To be fair, Trump set the timetable to withdraw from Afghanistan.\n\nNot that he didn't bitch about it when Biden followed through.",
                                    "score": 52,
                                    "author": "streakermaximus",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Just got my Dark Brandon shirt! Hail DB!",
                            "score": 31,
                            "author": "Dazzling_Football_19",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I don't even entirely agree with his policy, but a confident and feisty Biden is a good look.",
                            "score": 94,
                            "author": "Aitch-Kay",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Hopefully Daddy Brandon starts going after these fucking grifters and calling them out on all of their lies and ~~hypocrites~~ hypocrisy \n\nEdit: LOL whatever ¯\\\\\\_(ツ)_/¯",
                            "score": 118,
                            "author": "Mrorange002",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[omg](https://imgur.com/a/vw0DQQn)",
                    "score": 452,
                    "author": "Spaghetti-Policy-0",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 148,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Dark Brandon firing on all cylinders",
                    "score": 121,
                    "author": "BurnieTheBrony",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "The same people complaining about “spending on money on foreign policy” and “not helping Americans” complaining about being forced to help Americans.",
                    "score": 93,
                    "author": "DeaconSage",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "it literally does not matter the issue, these people take the opposing stance. this snake un-ironically eats its own tail.",
                            "score": 56,
                            "author": "misterid",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It’s about fucking time Dems started punching back.\n\nNow run ads, put up billboards, and drive the messaging into the ground.\n\nI’d like to see Biden “I did that” billboards and signs with a version of the stupid sticker people were putting on gas pumps next to every major infrastructure project. Hell, in GOP areas put the names of the GOP members that voted against it on the signs.\n\nThere MUST be some number of Republicans that will see that driving down the road, laugh, and wonder if they’re voting wrong.",
                    "score": 434,
                    "author": "MarkXIX",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Very much this. Democrats absolutely suck at marketing, though.",
                            "score": 149,
                            "author": "brycepunk1",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Dropping those receipts, god damn",
                    "score": 246,
                    "author": "Marcusmemers",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Full fucking send.",
                            "score": 84,
                            "author": "DIrtyVendetta80",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is gold. MTG, LB, etc. will still be dumb and hypocritical, but this is still awesome.",
                    "score": 73,
                    "author": "villis85"
                },
                {
                    "level": 1,
                    "comment": "The tone is perfect: no calling them hypocrites, only a “just the facts” approach. Bravo.",
                    "score": 180,
                    "author": "SuperDoofusParade",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "This is the most beautiful thing.",
                    "score": 169,
                    "author": "InterestingQuote8155",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "And they simply don’t care.  Their constituents don’t care either.",
                    "score": 575,
                    "author": "Rando1974",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Their hard core supporters don't, but if enough moderates are peeled away it will have an impact.",
                            "score": 441,
                            "author": "motormouth08",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Do moderates still exist?",
                                    "score": 186,
                                    "author": "Peter_Mansbrick",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Am I the only person who sees Biden as a moderate?\n\nWorking to rectify climate change and investing in infrastructure is not radical.  It just isn't.",
                                            "score": 40,
                                            "author": "MelanieSeraphim",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "They are few and far between, but I know several members of the GOP who are fed up enough with the incompetence and immaturity that they will not vote for the GOP this cycle. They aren't sure if they'll actually support the Democrat or simply stay home, but it's progress.",
                                            "score": 236,
                                            "author": "motormouth08",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I know one of these who does vote, against authoritarianism. He's managed to navigate the firehose of falsehood so recognizes who is actually authoritarian in the current political climate.",
                                                    "score": 57,
                                                    "author": "BoomZhakaLaka",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I \"identify\" as a conservative Republican, and have since 1989. Some of my views have changed over time,  so I'm probably far more moderate than I'm willing to admit to myself. \n\nI knew Trump was bad before the first election, and tried to talk as many people out of voting for him as I could. I voted for Biden in this last election,  and have seriously considered changing parties. \n\nWe are out here. We aren't buying the bullshit. We do not condone these actions or this behavior. We are with you, and want to see intelligence and civil discourse returned to center stage. (I know of several others in my area who I considered far more conservative than I who feel the same way.)\n\nI'm losing hope, but feel like the only thing I can do is to continue have frank and honest discussions with people.",
                                                    "score": 135,
                                                    "author": "rubrenginr",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Me and my wife are getting 20k. They write a check for their handouts I’ll write a check to the government for mine",
                    "score": 240,
                    "author": "wytesmurf",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "One claimed Oklahoma teachers were paying off the debt of Ivy League doctors. Like, first, doctors have a hell of a lot more debt than 10-20k. Second of all, it's the teachers in Oklahoma having their debt erased.",
                            "score": 231,
                            "author": "beldaran1224",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "also it DQs people making over 125k.  idk how many doctors meet that",
                                    "score": 126,
                                    "author": "Potatolimar",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "And if a doctor is making less than $125k, they absolutely deserve a little help, especially with the 5% income cap on payments. \n\nImagine going through 8+ years for degrees, then a residency (3-7years) and then earning less than $125k?  That person is drowning in debt with little hope for relief.",
                                            "score": 87,
                                            "author": "dzlux",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Like everything else they say, it’s just a bullshit attempt at pandering. Most teachers know they don’t give a fuck about us.",
                                    "score": 36,
                                    "author": "TA818"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Fuck these people are pathetic. \n\nWhy exactly was that debt forgiven? From how they talk the’d be more then happy to pay it back with interest",
                    "score": 44,
                    "author": "BonyDarkness"
                },
                {
                    "level": 1,
                    "comment": "Frustratingly, Dem administrations have been notoriously poor at effectively utilizing the 'bully pulpit' when in power. It's nice to see them hitting back (if not with the frequency/viciousness of the GOP when the deck is stacked the other way)",
                    "score": 41,
                    "author": "hockeyjoker",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "This is the coolest thing they’ve done. They brought the receipts.",
                    "score": 35,
                    "author": "minionoperation"
                },
                {
                    "level": 1,
                    "comment": "How the fuck did they get the loans in the first place? Why do they own businesses? Shouldn't they be focused on, oh I don't know, running the country?",
                    "score": 80,
                    "author": "Sweet-Emu6376",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think ahead technically owns a construction company her dad started. And a cross fit gym? I'd look it up,  but I just can't care enough for her to do it.",
                            "score": 26,
                            "author": "garash",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "She sold the CrossFit gym awhile back supposedly because her husband didn't like her fucking the trainers. CrossFit also issued a statement against her last year.",
                                    "score": 25,
                                    "author": "booniebrew"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My gawd that woman drones on and on and on.  She’s like white noise. Ugh!",
                    "score": 71,
                    "author": "BelleAriel",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not \"like\" but IS White noise.",
                            "score": 36,
                            "author": "immersemeinnature",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "White (supremacy) noise",
                                    "score": 41,
                                    "author": "darkstarr99",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is amazing",
                    "score": 22,
                    "author": "nicholasgnames"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is this the actual official Twitter for the White House because this is righteous.",
            "score": 6146,
            "author": "MountainSage58",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yep. They took names, and are dropping bombs.",
                    "score": 5010,
                    "author": "sld126",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is honest to God one of the funniest things I've ever seen. I'm so glad they're punching back!",
                            "score": 3460,
                            "author": "MountainSage58",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Dark Brandon has no fucks left to give.",
                                    "score": 2474,
                                    "author": "sld126",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Just saw the dark Brandon subreddit for the first time. I love it.",
                                            "score": 816,
                                            "author": "Bean_Storm",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Whatttt, this is the first time I’m hearing about our eldest statesman being referred to as dark Brandon. This is amazing lol",
                                                    "score": 431,
                                                    "author": "MidRangeMagic21",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "r/DarkBRANDON",
                                                            "score": 350,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "“Dark Brandon “ lol, love it!",
                                            "score": 89,
                                            "author": "f700es",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I'm sure these Reps will be on Fox News tonight crying about how unpresidential it is for Biden to attack them on Twitter.",
                                    "score": 128,
                                    "author": "Jump_Yossarian_",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The WH twitter could just respond to this with receipts from 45s twitter. Make it meta.",
                                            "score": 18,
                                            "author": "OldStretch84",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "This right here is the Biden we needed, this guy. Dems need to stop being \"nice\" and play the Republican game",
                                    "score": 71,
                                    "author": "BloopityBlue"
                                },
                                {
                                    "level": 3,
                                    "comment": "Took long enough for them to realize they have to play this game too. No \"high\" road anymore",
                                    "score": 39,
                                    "author": "Throwaway242353",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 183,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 67,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Immediately because they're snowflakes",
                                    "score": 50,
                                    "author": "Throwaway242353"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[Yep. Calling out everyone, not just her.](https://twitter.com/whitehouse/status/1562916200866267138?s=21&amp;t=u52QD6xjlYIzPbexu8pxaQ)",
                    "score": 156,
                    "author": "royalhawk345",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "This account has been waiting to go off after years of Trump tweets.",
                    "score": 350,
                    "author": "Igotshiptodotoday",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well it needs to keep the ball rolling now. Once you start at something like this it's tough to stop that momentum.",
                            "score": 111,
                            "author": "MountainSage58",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Honestly if the official white house/doj/fbi/etc. twitter/socials all start relentlessly calling out hypocrisy in this manner, it'll probably have a huge impact. Public transparency not drowned out by an ocean of mis/disinformation is needed, and this is a hilarious way of providing  it.",
                                    "score": 78,
                                    "author": "poiskdz",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It is. Fuck the hostages, do not negotiate with terrorists.",
                    "score": 64,
                    "author": "Obi_Wan_Benobi"
                },
                {
                    "level": 1,
                    "comment": "I started following The White House today. This shit’s funny.",
                    "score": 96,
                    "author": "aj0457",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Yes.  They are not fucking around.  Either this is official strategy or a Social Media intern went rogue.  Either way, I hope they keep dragging these hypocrites.\n\n![gif](giphy|Oj7yTCLSZjSt2JMwi2|downsized)",
                    "score": 88,
                    "author": "quimbykimbleton",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "What f’ed up business could this Mickey Rourke look a like possibly have had that warranted that kind of loan? This is worse than hypocrisy, it’s almost certainly fraud.",
            "score": 1403,
            "author": "lump77777",
            "replies": [
                {
                    "level": 1,
                    "comment": "She inherited some gyms from her dad",
                    "score": 480,
                    "author": "Gloomy-Ad1171",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Construction company. \n\nIt's the gyms she uses to cheat on her husband.",
                            "score": 325,
                            "author": "Jump_Yossarian_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Good for him",
                                    "score": 22,
                                    "author": "yuhanz"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Then cheated on her husband with one of the trainers",
                            "score": 79,
                            "author": "PM_me_yer_kittens",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Hey at least Mickey Rourke was quite striking when he was young",
                    "score": 49,
                    "author": "newport100",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Mickey Rourke, that's it, I know she looked familiar. I thought it was dog the bounty hunter, but Mickey is 100%",
                    "score": 203,
                    "author": "ChuckBorris187",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have a feeling if Daddy trump had done this, she'd be totally fine with it.",
            "score": 1172,
            "author": "ranting_chef",
            "replies": [
                {
                    "level": 1,
                    "comment": "She’d meet him in the gym.",
                    "score": 549,
                    "author": "sld126",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Neither of those people have ever been to a gym. Maybe a Jim, but not a gym",
                            "score": 217,
                            "author": "srcoffee",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "https://www.dailymail.co.uk/news/article-9246917/Marjorie-Taylor-Green-openly-cheated-husband-men-gym.html",
                                    "score": 161,
                                    "author": "sld126",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The picture of her \"lover\" with a BLM hat and a NDT/Bill Nye shirt is the best bit",
                                            "score": 113,
                                            "author": "hear4theDough",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Surgical bombing. Love it. Keep it coming.",
            "score": 798,
            "author": "triflingmagoo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Millionaires getting their PPP loans forgiven under the threat of political violence is what made me lose faith in this country \n\nPeople complain about moral decay and the loss of civil responsibility but that starts from the top. We emulate our leaders and if they choose to blatantly cheat the system, so will we",
                    "score": 173,
                    "author": "toooldforthisshit247",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1685,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "#N̸̺̆o̴̞̾ ̸͔̈́m̷̨̀a̷̛̩ĺ̷̩å̵͈r̸̡̾ḱ̵̞y̴̰͗,̵͔͠ ̴̳́J̴͚͠a̴̜̎ċ̸͓k̶̫̑",
                    "score": 500,
                    "author": "AdvicePerson",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Dark Brandon",
                    "score": 397,
                    "author": "hayden_evans",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Did the Democrats finally get the message that they can't play nice with Republicans? It's okay now to just call them out on their bullshit. It's not slander if it's just being real.",
                            "score": 120,
                            "author": "newbrevity",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Instead of Let’s Go Brandon, it’s now…Brandon, Let’s go!",
                    "score": 67,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I believe it's acceptable to simply co-opt \"Lets go Brandon\" as it is.  We can ruin one of the right's things for once.",
                            "score": 51,
                            "author": "DrMobius0",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "God I hate her. She’s like cow poo in Stroganoff. She ruins everything.",
            "score": 437,
            "author": "RoundComplete9333",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 94,
                    "author": "Paracortex",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sent this to my senile sister who thinks this is just pure BS. $400 billion dollars so far has been completely forgiven. Wonder how much more was stolen!",
            "score": 122,
            "author": "DJ1962",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s actually $800b forgiven under PPP.\n\n2-4x estimates of the SL.",
                    "score": 91,
                    "author": "sld126",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The White House twitter feed is calling out everyone! I love it!",
                            "score": 45,
                            "author": "DJ1962"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I really fucking wish that I could have taken a 183k forgivable loan out during the Covid. I could have paid rent and ate more than  Ramen and potatoes",
            "score": 341,
            "author": "Reasonable-Knee-6430",
            "replies": [
                {
                    "level": 1,
                    "comment": "What you mean the $1200 you got wasn’t enough to cover all your basic necessities?!",
                    "score": 120,
                    "author": "charm-type",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Clearly still living off it two years later and why they won't go back to work...",
                            "score": 29,
                            "author": "GaymerGuy79",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I want a PPP loan committee, I want everyone who used our money for any purpose whatsoever other than paying employees a paycheck in prison. These people stole from us, they belong in prison, I don’t fucking care how rich or powerful they are, this fiasco is beyond absurd and will be the republican excuse to refuse helping working people in dire times for generations. Fuck all that noise.\n\n[Edit: why the fuck do so many congressmen have PPP loans…](https://www.reddit.com/r/WhitePeopleTwitter/comments/wxta33/absolute_bloodbath_right_here/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf)",
            "score": 1539,
            "author": "WhyRedditJustWhy69",
            "replies": [
                {
                    "level": 1,
                    "comment": "The PPP fraud department is slowly working on it.",
                    "score": 682,
                    "author": "sld126",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Its not easy considering the trump administration purposely decided not to keep track.  For some reason.",
                            "score": 440,
                            "author": "Grogosh",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Cause his hotels got a big payout.",
                                    "score": 143,
                                    "author": "ruinersclub",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 99,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "What level of cognitive dissonance is that?",
                                            "score": 46,
                                            "author": "deevandiacle",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Conservative.",
                                                    "score": 72,
                                                    "author": "DiggityDanksta"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "The reason being a lot of republicans benefitted from it. Like wealthy donors and congress people",
                                    "score": 27,
                                    "author": "Whoshabooboo"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "So slowly that most fraudsters will be beyond the statute of limitations before we get through 2% of them.",
                            "score": 25,
                            "author": "Gingevere",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They increased that limitation time because of that: https://www.natlawreview.com/article/statute-limitations-ppp-and-eidl-fraud-extended-to-ten-years",
                                    "score": 20,
                                    "author": "TheRealPitabred",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "If I remember, there was supposed to be an oversight branch, but it got gutted or they got fired or whatever the fuck happened back then and so here we are",
                    "score": 88,
                    "author": "radioactivez0r",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The PPP loan program was going to be abused from the moment it didn't go to workers and went to businesses.\n\nThe government could have just cut a check to everyone and said, \"You get this money so long as your company still reports you are going to work by way of payroll tax receipts.\"\n\nBut nope. Money is too important to go to corrupt individuals. Better give them to angelic businesses and have the money trickle down. \n\nI fucking hate this timeline.",
                            "score": 78,
                            "author": "sucksathangman",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "75% of the money handed out did not go to the pay checks they were supposed to be protecting. Even read about a guy who has a PPPLOAN vanity plate on the BMW he bought with the forgiven loan.",
                    "score": 167,
                    "author": "mgyro",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Those weren't the rules of the game, though. Only 60% had to go to payroll, and employment levels had to be maintained.\n\nBut the fact that they applied for forgiveness instead of paying back the loan is what gets me. I mean, they took out the loan, they should repay it, right GOPers? \n\nhttps://www.sba.gov/funding-programs/loans/covid-19-relief-options/paycheck-protection-program/ppp-loan-forgiveness#section-header-0",
                    "score": 53,
                    "author": "AhavaZahara",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Trump fired the watch dog that was supposed to over see the payments shortly before they started. I can’t remember his name.",
                    "score": 27,
                    "author": "mrbigglessworth"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I know there aren’t many conservatives on Reddit, relatively speaking.\n\nBut, for any who see this…\n\nHow do you reconcile the blanket disapproval of the student loan forgiveness plan with the PPP loan forgiveness? \n\nI’m really curious to hear it. Someone like MTG isnt interested in being rational. She just wants to rile up her base. But, for level headed conservatives, can you please explain this?",
            "score": 238,
            "author": "tyson_3_",
            "replies": [
                {
                    "level": 1,
                    "comment": "Their argument is that these people used it to pay their employees during Covid shutdowns handed down by “the libs” and that these loans were justified because MTG, etc. are part of that sacred class known as “business owners.” “Job creators.” \n\nAnd on and on blah blah blaaaaahhhhhh\n\nA bunch of fucking redneck *help* out there in the heartland worshipping the owner class. Fantastic.",
                    "score": 144,
                    "author": "Obi_Wan_Benobi",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I know for a fact the business I was contracted under laid off 99 of 105 employees and brought less than half of them back. Their loan says \"payroll\" but there is no way the payroll was $600k. If they didn't use it for payroll, MTG sure as shit didn't.",
                            "score": 84,
                            "author": "PrawojazdyVtrumpets"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "As Republicans and boomers love to say, life isn't fair, get over it. As the party of supposed Christians the Republicans sure love going against what the Bible says about debt and loans, Jesus paid our debt for sin, don't charge excessive interest, and forgive debts after 7 years",
            "score": 1069,
            "author": "tallman11282",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Shaved Alf",
            "score": 224,
            "author": "killpuddle1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Aaaand lost the coffee 10/10",
                    "score": 52,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Great to see the Whitehouse and Dems be more aggressive in getting their message out.",
            "score": 64,
            "author": "the_G8",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I'm loving how Biden went from lame duck presidency to whooping ass with a string of wins for all Americans",
            "score": 307,
            "author": "sickofyourshit77",
            "replies": [
                {
                    "level": 1,
                    "comment": "Joe from Scranton pulled up in his car and told Americans to hop in. I love this for him and for us. 💯💯💯",
                    "score": 71,
                    "author": "Flowerandcatsgirl"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I paid my student loans in full.  I lived off of ramen in a shitty studio apartment to do it.  \n\nI’m fucking delighted that student loans have been forgiven. The government spends my tax dollars on stupider things every day. Why shouldn’t they spend some of it to make life better for my fellow citizens?",
            "score": 301,
            "author": "boooooooooo_cowboys",
            "replies": [
                {
                    "level": 1,
                    "comment": "I love it anytime it comes back to the people and not out of the country or to some big ass company.  I hope medical debt follows I don't have any but fuck it let's do it.",
                    "score": 45,
                    "author": "mexicandiaper",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Fuck these people. The student loan debt forgiveness is a tiny fraction of what was given out individually through PPP. Every single PPP loan should be audited and/or investigated because you can be damn sure that these fucking rats didn’t give a dime of that money to “employee salaries”. Whereas student loan forgiveness, that money can’t even be used elsewhere - it doesn’t touch a palm in passing.",
            "score": 59,
            "author": "hayden_evans",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Can we back up a second? Why the fuck were members of Congress even fucking eligible???",
            "score": 50,
            "author": "gir_loves_waffles",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Joe Biden did not get where he is today by insisting he did not lose",
            "score": 122,
            "author": "Connect-Swing8980",
            "replies": []
        },
        {
            "level": 0,
            "comment": "As a foreigner I have to say , only in America, and today this is a very good thing. Congratulations to your government, for finally fighting against some of the craziness from the Rep side.\nThey can't just say things out of their asses, they have to have some connection to reality.",
            "score": 323,
            "author": "219523501",
            "replies": [
                {
                    "level": 1,
                    "comment": "As an American it’s about fucking time the other side took the kids gloves off when it comes to republicans.",
                    "score": 97,
                    "author": "Ontheroadtw"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Dark Brandon: Don't pull the thang out, unless you plan to bang, Jack",
            "score": 93,
            "author": "fake_fakington",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Why does she look like she's a human version of a dog that tried to eat bees",
            "score": 30,
            "author": "Whoevenknows94",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Why did this dumb bitch even get PPP loans?",
            "score": 75,
            "author": "willi3blaz3",
            "replies": [
                {
                    "level": 1,
                    "comment": "Her family’s gyms apparently. Now let’s speculate on how much of that actually went to worker payroll\n\nEdit: A construction company she bought, still doubt those 12 employees got that money",
                    "score": 48,
                    "author": "Darkhallows27",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "If this is the Democrat socialism the Maga Republicans warned us about. I want more of it, please. Dark Brandon is on a roll, finally helping the little guy. Thank you Democrats. By the way, there's 6 adults living with me and guess what. We're all voting Democrat to infinity and beyond.",
            "score": 26,
            "author": "PerceptionThin2801"
        },
        {
            "level": 0,
            "comment": "Dark Brandon Rises 😎😎",
            "score": 24,
            "author": "ChuckBorris187",
            "replies": []
        },
        {
            "level": 0,
            "comment": "So wait. Are the gloves off for Democrats now? Because it's way past due.",
            "score": 20,
            "author": "cunty_mcfuckshit",
            "replies": []
        },
        {
            "level": 0,
            "comment": "You ugly on the inside and outside bitch",
            "score": 96,
            "author": "RoarOfErde-Tyreene",
            "replies": [
                {
                    "level": 1,
                    "comment": "I love the irony of how the most transphobic member of Congress is a woman who looks like Mickey Rourke in a cheap wig.",
                    "score": 73,
                    "author": "Lady_von_Stinkbeaver",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wow, Dark Brandon is ruthless. May his reign of terror continue forever.",
            "score": 19,
            "author": "DunkinYourAss"
        },
        {
            "level": 0,
            "comment": "I commented in a thread like last week saying Dark Brandon wants all the smoke and here we are, he’s showing them once they fuck around they’ll find out",
            "score": 62,
            "author": "taintedchops",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sleepy Joe woke up angry.",
                    "score": 58,
                    "author": "sld126"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Dark Brandon strikes back.",
            "score": 19,
            "author": "Withyhydra",
            "replies": []
        }
    ]
}