{
    "id": "xyrrow",
    "score": 130821,
    "title": "November is important",
    "author": "DaFunkJunkie",
    "date": 1665232705.0,
    "url": "https://www.reddit.com/r/WhitePeopleTwitter/comments/xyrrow",
    "media_urls": [
        "https://i.redd.it/t41vqjl9uks91.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "I’ve always believed that if voting didn’t matter there wouldn’t be millions of dollars spent every year trying to stop me from doing it.",
            "score": 5059,
            "author": "Riisiichan",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s so non-sensical to me, the people saying voting doesn’t matter also lament the amount of money donated to campaigns by super pacs. My brother in Christ, no one would be spending these insane amounts of money on campaigns if they didn’t need to get people to vote.",
                    "score": 1233,
                    "author": "jgjgleason",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If someone thinks voting doesn't matter ask them why rich people are always first in line to the ballot boxes.",
                            "score": 286,
                            "author": "Argnir",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Because they can afford to take a day off to get there early while everyone else has to wait until after 5 and wait in a ridiculous line.",
                                    "score": 138,
                                    "author": "KaiPRoberts",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "And when you realize that having election day be a day off for most businesses has been fought against for years, you start to put the pieces together.",
                                            "score": 149,
                                            "author": "Historical-Drive-667",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "And then there's me. I keep telling my employees they can be a few minutes late to work or leave a few minutes early on election day if they need to. (We live in a small town. Nowhere in town is more than 15 minutes from walking out their front door to exiting the polling place.) Show me your election sticker and I'll give you the whole day off if that's what it takes to get you to vote.\n\nI tell everyone I know that I'll give them a ride to the polls if they can't get there themselves. Our polls open at 7am. I will drag my lazy ass out of bed and have you there when they open the doors if that's what you need. I don't even care who you vote for, as long as you go. I mean this sincerely.\n\nNot one person has ever taken me up on it.",
                                                    "score": 19,
                                                    "author": "stardustandsunshine",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 13,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "The day off is just one solution they have tried. Literally every suggestion that attempts to increase ease of voting and voter turnout is met with millions of dollars to help fight it.",
                                                            "score": 19,
                                                            "author": "Historical-Drive-667",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "We have voter suppression down here in Texas. They closed every polling locations around me and I ended up going to UTSA (a south Texas university) to vote and it took 4 hours to get to cast my ballot.",
                                                            "score": 9,
                                                            "author": "El3ctricalSquash",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[removed]",
                                                                    "score": 7,
                                                                    "author": "[deleted]",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Except they're not voting out of civil pride, but because it helps them maintain their station and wealth. That's why they are eager to vote and just as eager to convince the working class to stay home.",
                                            "score": 48,
                                            "author": "HustlinInTheHall",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Early vote. Most states allow working hours to be an acceptable excuse to get an early ballot. Used to be you didn't need a reason. But, you know, Republicans trying to discourage you.",
                                            "score": 25,
                                            "author": "wollam11",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Most precincts have early voting. You can vote in person for a good three to four weeks prior to the election. I know some places are fiddling with this, but even conservative places like Indiana make it easy to vote.",
                                            "score": 17,
                                            "author": "MiserableProduct",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I’d accept this as an argument in states like Alabama. I don’t accept it for states like California or Oregon where they literally mail you your ballot with all the relevant info. If you can’t be bothered to vote when it’s made that easy, it’s on you at that point.",
                                            "score": 6,
                                            "author": "jgjgleason",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "My favorite come back to the “voting/politics doesn’t matter” is well your boss or bosses bosses boss sure thinks they matter, your landlord/mortgage bank sure think they matter, the church down the street and the KKK/Nazi parties think they matter\n\nAll those people are either voting or contributing large fn amount did money for something that “doesn’t matter”\n\nEdit: I should say I was definitely one of those people until 2016",
                            "score": 296,
                            "author": "Lost-Pineapple9791",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;I should say I was definitely one of those people until 2016\n\nDamn, you and me both. The first time I voted in my life, I helped make medicinal cannabis legal in my bright red state of North Dakota. I saw the power of voting in one moment. I've never missed a vote since, local, primary, or general, and even got my mother-in-law to vote for the first time since the 80s (and she voted Democrat for the first time!) in the 2020 election.",
                                    "score": 141,
                                    "author": "stabbingbrainiac",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "This is the way. It’s never too late to participate! Thank you.",
                                            "score": 12,
                                            "author": "maebyfunke980"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I don't agree with the logic but some ppl just get caught up in thinking that 'their' specific vote doesn't matter. If you live in a red state and vote blue its really easy to think your vote is being drowned out and thus doesn't matter.\n\nAt least thats how I used to see it. But now I see that if everyone thinks that way then you're just creating the thing you feared.",
                                    "score": 93,
                                    "author": "GlabbinGlabber",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It’s more than just that. Win or lose (if you want to look at it like that) your vote matters because if politicians see that young votes were a substantial voting block that they will have to give that demographic attention and respect. Politicians don’t dare fuck with seniors because they vote en masse but don’t mind giving the shaft to younger demographics because “what are you gonna do? Vote me it out? Lol” I kept telling younger friends and family that I don’t give a damn if you vote for Biden, trump, hitler, or Stalin but you better go vote so that my demographic gets representation.",
                                            "score": 50,
                                            "author": "cracky1028",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I have friends in both Michigan and California who say this shit!!! “Their vote doesn’t matter” - yes the fuck it does! Especially in local elections.",
                                            "score": 33,
                                            "author": "bel_esprit_",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Michigan is kinda purple too, wtf lol",
                                                    "score": 20,
                                                    "author": "tacodog7",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Local elections are how the GOP prepared for Roe. It took 40 years of voting every single election and never giving up trying to produce multiple paths to victory waiting for the opportunity to arise to move. Now they got what they wanted. It was an insane amount of effort for one singular goal. I grew up in the religious right and they were single minded for the first 20 years of my life, never wavering their support for anti-abolition candidates down the fucking school board level.",
                                                    "score": 14,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "The more important thing to remember about elections is the local stuff. Some of that shit can be decided by handfuls of votes, and that shit hits you where you live. Vote in every election, every time.",
                                            "score": 25,
                                            "author": "Procrastinista_423",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I think people are just lazy by nature and always search for an excuse to justify doing nothing. If voting doesn't matter then they can still claim the moral high ground without needing to actually do anything, so they come up with weird half-baked logic to try to claim that voting doesn't matter.",
                                    "score": 17,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is a great comment, but you need to make it clear for the apathetic ones that don’t follow everyday politics. Only 1 party is trying their hardest to stop people they don’t like from voting. Name and shame them",
                    "score": 420,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You say this and don't mention Republican suppression efforts, the effort to roll back voting rights, the effort to restrict locations and access to voting...and the worst one of all, allowing Republican legislatures to \"select\" candidates rather than pay attention to your actual votes!!! 🤯\n\nIn many states you only have about another week or less to register. Now is the time!!!",
                            "score": 22,
                            "author": "Important-Owl1661"
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 146,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I thought it was the Confederates?",
                                    "score": 56,
                                    "author": "MoscowMitchMcKremIin",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Actually, yes.",
                                            "score": 54,
                                            "author": "Pghlaxdad",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Truth!!!!\n\nThe Republican Party absolutely are the Confederates just look which party it is that's waving the Confederate flag that was the traitors to America",
                                                    "score": 13,
                                                    "author": "Professional-Tie-324",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I thought it was the Tories. God save King George.",
                                    "score": 19,
                                    "author": "ProveISaidIt"
                                },
                                {
                                    "level": 3,
                                    "comment": "No, it's those god damn Federalists",
                                    "score": 30,
                                    "author": "NotQuantified",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The Federalist Society",
                                            "score": 15,
                                            "author": "joan_wilder"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yeah, and that is possibly my biggest reason of all the reasons for voting \"liberal.\"* If your party's strategy requires disenfranchising and suppressing voters you are a pox.\n\n*Am liberal, most the DNC isn't in my opinion. I am not party affiliated because party politics is a cancer. I consider Biden to be generally a bit right of center. I still voted for him. I didn't like it, but voting for anyone else on my ballot was way the fuck worse.",
                            "score": 12,
                            "author": "Socketfusion",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The best form of voter suppression is convincing people—especially poor people—that their votes don’t matter.",
                    "score": 14,
                    "author": "Chavo9-5171",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "That's part of the fun - you get to dunk on the Koch brothers by voting against them",
                    "score": 32,
                    "author": "Talador12",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "GOP will publicly oppose but once passed they will secretly invest in marijuana industry even more than they already do",
            "score": 671,
            "author": "Safe_Mycologist76",
            "replies": [
                {
                    "level": 1,
                    "comment": "Isn't Dole a major investor?",
                    "score": 109,
                    "author": "boundfortrees",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[just gonna leave this stoey here abouy how chiquita and dole collapsed multiple governments](https://youtu.be/QgydTdThoeA)",
                            "score": 80,
                            "author": "PMtoAM______",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The US had an almost complete monopoly on Bananas. It’s crazy that companies like Monsanto control the market for almost all soybean genetics in the states in a similar way.",
                                    "score": 37,
                                    "author": "El3ctricalSquash",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The recycling industry was also made by plastics companies to keep the government off of their back.\n\nAhem [cough](https://youtu.be/KXRtNwUju5g) ahem",
                                            "score": 25,
                                            "author": "PMtoAM______"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Isn’t that what Boehner already did?",
                    "score": 26,
                    "author": "SlipperyRasputin"
                }
            ]
        },
        {
            "level": 0,
            "comment": "“He’s just buying your vote”…..by all means please do more things I want to buy my vote.",
            "score": 387,
            "author": "DevinH83",
            "replies": [
                {
                    "level": 1,
                    "comment": "Almost like... passing policies people like/helps people is the point of the government\n\nOnly Republicans think it's a bad thing lol",
                    "score": 144,
                    "author": "Matrix17",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s almost like he’s trying to help his fellow party members win their own elections..shocking",
                            "score": 24,
                            "author": "DevinH83"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You know we are fucked politically when the argument for policy passing is. \"He's buying your vote\". Last time I checked, an elected official making changes requested by his constituents is why they were elected.. even if their motivation is to get relected, if they are doing what's asked of them then that's fine. Most of us aren't naive enough to think they care about us. But this notion that it's supposed to be a R vs D popularity contest is just staggering.",
                    "score": 14,
                    "author": "ketootaku"
                }
            ]
        },
        {
            "level": 0,
            "comment": "At this point, policy should really be catering more to younger voters.  Millennials now outnumber boomers.  We just need to vote so they'll start courting our votes with better policy.\n\nEdit to add:. Early voting is already open in many states.  Better to vote early if you can since you never know what will happen on election day.  \n\nAnd also, double check to make sure you are registered.  Republicans have a habit of trying to purge voting rosters (especially of people who are likely to vote democrat like young people or minorities.\n\nEdit 2:. A typo",
            "score": 5438,
            "author": "thatguy9684736255",
            "replies": [
                {
                    "level": 1,
                    "comment": "While millennials outnumber boomers, boomers vote waaay more. 2018 midterm elections was seen as an 11 point increase for young voters but even then that was at 53% while boomers were close to 70%.\n\nIf we want to see politicians and policy makers cater towards issues for younger people, they in turn have to vote. If there is a demographic that consistently votes even if the policies are terrible, politicians will try to gain that vote.",
                    "score": 2225,
                    "author": "abado",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "We really need to make voting days national holidays. If only the olds who are retired have the day off to vote, and can afford to take the time, this is what happens. Some people literally can't afford to vote.",
                            "score": 1328,
                            "author": "heavy-metal-goth-gal",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Or just vote on Sunday like in most other countries. No idea why the US keeps voting on Tuesday's even though it doesn't really make sense anymore.",
                                    "score": 501,
                                    "author": "ssjewers",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "In the US a lot of people work on Sunday too. If you work in a service economy job, Sunday might be your busiest day. \n\nAlso, a lot of people have difficulty getting to a polling place at all, especially on a Sunday when the public transportation services run at reduced schedules. (And in most of the US, public transportation isn’t an option at all.)\n\nWhat we really need is mail in voting. \n\nAnd online voting. \n\nAnd extended in-person voting schedules, including early voting. \n\n“They” have been pretty successful at reducing voting options for the wide variety of people who would vote against “them.” Breaking the cycle will take some effort.",
                                            "score": 350,
                                            "author": "YeahIGotNuthin",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I've said it before and ill say it again, your states votes should not count unless you make voting accessible to anyone and everyone of voting age. Otherwise you might as well just make up vote counts and send them in. They'll be just as reflective of your states desires",
                                                    "score": 143,
                                                    "author": "bobafoott",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Oh, they’re working on “making up the votes” too. \n\nBut once change comes, hopefully it’ll be permanent. We don’t want to go back to the bad old days.",
                                                            "score": 73,
                                                            "author": "YeahIGotNuthin",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "It won't be. Republicans invest *all* of the resources towards undoing things the democrats do. Trust me, if we gain headway on fixing voting, Republicans will be fighting tooth and nail to undo that immediately",
                                                                    "score": 57,
                                                                    "author": "bobafoott",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I used to try to evaluate candidates individually, on their specific takes on a variety of issues of value to me. But the issue you point out is why I am, now and for the immediate future, on a “no more votes for any R candidate” bandwagon. That R is disqualifying as far as I’m concerned - there’s no “they’re a good candidate, you just don’t like that party affiliation” any more, It’s like a nazi party affiliation to me now, “by definition there are no good candidates with that affiliation.” \n\n(Extended family - who would be in a position to directly compare - assures me the comparison to nazism is not hyperbole.)\n\nI could have a local election where the R candidate was demonstrably pro-Puppies and the D candidate was on record as being unashamedly anti-Puppies, and I would just have to apologize to dog lovers everywhere, *”sorry gang, puppies are going to have to take one for the team this election cycle. There’s just too much harm Rs are going to do to let them back behind the wheel. Puppies can have their day after we finish putting out this (inter?)national fire.”*",
                                                                            "score": 31,
                                                                            "author": "YeahIGotNuthin",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Personally, I vote for the best candidate in the primaries, then the Democrat in the general election. I will fight to get a progressive on the general ballot, but if it's a choice between a corporate Democrat and any Republican, it's easy to choose the corporate Democrat. If it's a progressive Democrat vs a Republican, then it's even easier to choose the Democrat.",
                                                                                    "score": 15,
                                                                                    "author": "lemon_flavor",
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "I agree fully. I would really like to see non-radical Republicans appointed by democrats to restore faith in bipartisanship but anyone with an R next to their name does *literally nothing* but tow the party line so that's just nit an option rn",
                                                                                    "score": 11,
                                                                                    "author": "bobafoott"
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "my conservative relatives told me that with rare exception they would be voting for the big D until they don't feel like it's a choice between Cersei Lannister and Sauron",
                                                                                    "score": 9,
                                                                                    "author": "TheLastMinister"
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "You joke, but Mehmet Oz _is_ certifiably anti-puppy and is the Republican candidate in Pennsylvania, despite living in New Jersey.",
                                                                                    "score": 6,
                                                                                    "author": "CatholicCajun"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Republicans are already making up votes and the Supreme Court is going to allow them to legally overrule any votes they get anyway",
                                                            "score": 22,
                                                            "author": "Deadpool9376"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "As a network and security admin with over 2 decades of experience I can tell you with 100% certainty that online voting is a terrible idea. All voting should be done In a maner that produces an auditable paper ballot to compare to electronic counts.",
                                                    "score": 67,
                                                    "author": "Waylander0719",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "As a Linux System and DevOps Engineer, my mind went straight to one thought when this was brought up.\n\n1. Harvest collection of social security numbers and names. Store in database. \n2. Find endpoint where voting will be occurring (we'll need it for curl time)\n3. Write a script to run on a cron schedule. (This would do my curl magic)\n4. Build out ten VMs sitting on VPNs with different public IPs. (My script would live here)\n5. Build out a database server to house the data store of illegal info.\n6. Fire at will.\n7. Profit.\n\nI've been awake today for 10 minutes. No coffee, no nicotine (I'm an addict there). I'm not thinking as quickly as I normally would when doing project work.\n\nIt took me less than 10 minutes to find a way to defraud online voting.\n\nDo NOT implement this into our voting system. EVER.",
                                                            "score": 18,
                                                            "author": "elemental5252",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "You really, really do not want online voting. It is not a secure way to conducuct an election.",
                                                    "score": 19,
                                                    "author": "MisterCommonMarket",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I worry more about coercion than cybersecurity in this respect. Tons of 18 year olds living at home with parents that might want to \"see\" they're voting for who their parents want, domestic abuse situations, etc. Voting is done in private in a secure place for a reason.\n\nBut then there are so many trade offs with how you decide to do it. IMO it should be done as a digital thing with security 24/7 where you go into a little booth and hit buttons then leave, any hour of the day for a month. Armed security, only one in a booth at a time. One guard scans ID and validates and you enter your vote, and if you're registered it just works.",
                                                            "score": 8,
                                                            "author": "taronic",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "But who has to work on national holidays? The same service workers you're talking about. Giving government and office workers another day off isn't going too make a damn difference to voting.",
                                                    "score": 15,
                                                    "author": "Accountant37811",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Firmly believe that's why a certain segment of the population are fighting so hard against mail in voting. It opens the door to those who can't normally vote",
                                                            "score": 15,
                                                            "author": "Baconpwn2"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "You know, I have never understood federal employee hours. I always feel the need to comment on this. Federal services should not only be open when everyone is at work. What's the point of a post office or social security office being open 9-5 when most of the people who would need to use those services also work 9-5... and the services are not open on weekends, like wtf. Are we supposed to use our lunchbreaks and vacation days to use services?",
                                                            "score": 6,
                                                            "author": "KaiPRoberts"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Sounds like Canada. We have a lot of issues with our political system too, but between early voting, mail voting and mandatory time off work on voting day, at least everyone who wants to cast a vote gets to do so.\n\nNow if only the votes made a difference and both parties weren't just two sides of the same monopoly-supporting corporatist coin, that would be awesome.",
                                                    "score": 14,
                                                    "author": "evranch",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Shh, you're popping a lot of people's bubble here.  The world shuts down on Sunday, didn't you know???",
                                                    "score": 5,
                                                    "author": "SpottedPineapple86"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "It’s specifically to prevent poorer and less abled people from voting. That’s why we do it on Tuesdays still and haven’t changed it.",
                                            "score": 384,
                                            "author": "cantonic",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "We love our voter suppression here in the good old USofA!",
                                                    "score": 118,
                                                    "author": "midvalegifted",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "As a Canadian I find the whole US system unabashedly surreal. Good Luck to you, sounds like a lot of effort required to exercise your rights, hope enough intelligent people show up and help tip the scale.",
                                                            "score": 13,
                                                            "author": "cyberspaceking",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "A shit ton of people aren't off on Sundays, especially young people and POC.",
                                            "score": 90,
                                            "author": "kdeaton06",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Those same people won’t be off if it’s a national holiday either",
                                                    "score": 13,
                                                    "author": "Sunburntvampires"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "But it's for sure incredibly more that are off than on Tuesday. Just because there are still people having to work on Sundays, doesn't mean it's not better than a fucking Tuesday.",
                                                    "score": 37,
                                                    "author": "ssjewers",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "We started out with only rich landowners males being able to vote.\n\nWe never left. Why would the rich white males vote to change that? So it needs to be clawed out of them to get even where we are now",
                                                            "score": 19,
                                                            "author": "bobafoott"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "or just use mail in ballots. i’ve never gone to a polling station, i don’t understand why people don’t just mail in their votes as opposed to standing in lines for hours.",
                                    "score": 149,
                                    "author": "starjjong",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah I do this too. But I'm lucky enough to have stable housing.",
                                            "score": 79,
                                            "author": "heavy-metal-goth-gal",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah and a state that does it",
                                                    "score": 70,
                                                    "author": "ZeBridgeIsOut5",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Also this!",
                                                            "score": 19,
                                                            "author": "heavy-metal-goth-gal"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "In Washington you can go to an office and pick up your ballot as well. Hell, you can even print the thing.",
                                                    "score": 7,
                                                    "author": "archzach",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Washington State makes it so easy to vote, they mail you the pamphlet about the people running, then a couple of weeks later the mail in ballot, which you fill out and drop in a mail drop no postage required.",
                                            "score": 55,
                                            "author": "SunshineSeattle",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "This is how it's done in Colorado too, as a result, I have voted in every election I was eligible to vote in. It's just too easy!",
                                                    "score": 25,
                                                    "author": "SoberSethy",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "because if voting is easier, more young people will vote, and the older people making the laws don't want that",
                                            "score": 27,
                                            "author": "whereismymind86",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt;or just use mail in ballots. i’ve never gone to a polling station, i don’t understand why people don’t just mail in their votes as opposed to standing lines for hours.\n\nI like voting in person and getting my confirmation and sticker. It also feels like a sense of community seeing all the neighbors there.",
                                            "score": 6,
                                            "author": "return2ozma",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt; stand in line for hours\n\nI’ve never had to wait in a line at a polling place, you just walk up, say “hi” to your neighbors volunteering, get checked off the list and take your ballot to one of the empty booths.\n\nHaving so few places to vote that you have to stand in line, much less for *hours* feels like a failure of democracy to me.",
                                            "score": 19,
                                            "author": "Warp-n-weft",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "i hear about nightmare lines at polling stations all the time, everyone i know complains about the wait. the wait times make the news quite often. but also, i live in a rural area so there are a lot less locations available to service the population in my area. also, given that i live in a rural area, there are no polling stations within a 30 minute drive of my house. i personally don’t have the time or the patience to drive 30+ minutes and stand in line, so i just mail my vote in and i get tracking texts and a confirmation text that my ballot has been received. it really is a failure of democracy that voting isn’t one of the easiest things for people to do, but…this is America, i don’t expect anything in this country to make sense or be handled with any level of efficiency lol",
                                                    "score": 18,
                                                    "author": "starjjong",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "That’s because it IS. Mail in voting, early voting and same day registration (make it provincial) should all be the norm",
                                                    "score": 15,
                                                    "author": "Blondecanary"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Not every state offers the option, unfortunately. I hope that sometime in my lifetime, vote by mail will be allowed everywhere.",
                                            "score": 7,
                                            "author": "jersharocks"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "A national holiday sounds like a great idea but it doesn't actually solve anything. Low income people will still need to work, much like they do on Thanksgiving, Memorial Day and even Christmas. \n\nYou need all states to have early voting, allow voting my mail, have more voting locations and most importantly remove the stupid need to register to vote. The US is the only country I know of that has that. As a Canadian all we need to do is show we live in the right voting area. Most people will be sent a card with their names on it saying the dates and locations they can vote at. But if you don't get that you can show up with two pieces of ID. If you don't have that because you either just moved or are homeless or whatever reason you can literally have someone vouch for you and you sign a form saying this is truthful.\n\nAfter you have all that, then a national holiday would be useful.",
                                    "score": 30,
                                    "author": "dgapa",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "That will only help people who have jobs that close for federal holidays. Those people likely already have no issue getting to the polls. Expanding mail-in voting and early voting hours would be way more helpful than the largely token effort of making election day a holiday.",
                                    "score": 9,
                                    "author": "Fanraeth",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Federal law prohibits restricting people from taking time to vote. Including the entire work day.\n\nIf this happened to you, lawyer up because that's a fat civil rights violation, and its punitive for the employer. Like USERRA. You'll get compensation.",
                                    "score": 53,
                                    "author": "dashiiznitwastaken",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The issue is that they can’t stop you but also aren’t obligated to pay you. So they can’t tell you that you can’t take the day off to vote but for some people that’s 10-20% of their paycheck just gone from not working that shift.",
                                            "score": 66,
                                            "author": "soulreaverdan",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Even if you know your vote won't matter (state is very red or blue), this is why you need to ALWAYS vote.\n\nYour vote adds to stats that represent your demographic!",
                            "score": 11,
                            "author": "shampoooop"
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 25,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The issue is that voters in the US have the memory capacity of goldfish.\nIf voters actually remembered who screwed them over politically speaking they wouldn’t vote for half of the people.\nEven the old saying “they are hurting the right person” falls flat when so many Republicans keep harming their own voters.\n\nClarification:\nUnless politicians don’t actually acknowledge their past mistakes and work on undoing their mistakes, assume they will continue to cause problems and harm to you as a voter.",
                    "score": 75,
                    "author": "EasterBunnyArt",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "They hate those pesky young browns.",
                    "score": 255,
                    "author": "IrishNinja8082",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Especially the ones that vote.",
                            "score": 4,
                            "author": "Newdeal79"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I’m an old liberal who wants the young people to take this country and make it better. Get out there and vote.",
                    "score": 76,
                    "author": "BerryLanky",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m an old Crunchy Granola mom and I completely agree with you!",
                            "score": 5,
                            "author": "Imarriedafrenchman"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yes! The more younger people vote in midterm,  local, and primary elections the better.",
                    "score": 87,
                    "author": "Maximum-Policy5344",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Vote early so those hillbilly gun totin morons don’t try to intimidate you out of voting on election day",
                    "score": 12,
                    "author": "Deadpool9376",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I was purged and live in one of those Purple states. I have a brown last name, but look white, so I'm pretty sure that's why.",
                    "score": 122,
                    "author": "Memphaestus",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I'm so mad cause my birthday is a few days before Christmas, 2006, I'll be less than two months too young to be able to vote in 2024, and it sucks ass.",
                    "score": 10,
                    "author": "SgtVinBOI",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That was me in 2004. 12/29/86 birthday. I went to the John Kerry rallies in Mass. during my first semester of college but had to watch George fkin Bush win a second presidency and felt like all I could do was watch from the sidelines. Woof.",
                            "score": 6,
                            "author": "TigOleBittiesDotYum"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Well they would they just don't because young people don't vote.\n\nThats like, literally why this post was made. Just saying \" well there's more of us\", just puts other younger people that read your message into complacency and not vote because \"well wouldn't they cater to the majority\"",
                    "score": 18,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "Having to be registered to vote is so crazy to me. I don't understand how the average American just accepts how easily you are disenfranchised. \n\nJust for comparison if you walk into a voting station in Canada with no ID, but you can find someone who has ID and will vouch for you, you can vote.",
                    "score": 102,
                    "author": "autovonbismarck",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I VOTED!!!",
                    "score": 41,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Millenials, yes. Millenial voters, no.",
                    "score": 5,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you want your agenda passed, be reliable. Show up for every election. Outvote those boomers in Florida.",
            "score": 365,
            "author": "Orbitingkittenfarm",
            "replies": [
                {
                    "level": 1,
                    "comment": "If Florida can boot DeSantis to the curb in 2022, his presidential ambitions for 2024 are all but over. Please, Florida, make this happen. Oh, and Senator Val Demings has a nice ring to it.",
                    "score": 147,
                    "author": "SocialDistanceMedia",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Don’t forget though, it’s Florida. Adjust your expectations of rationality accordingly.",
                            "score": 94,
                            "author": "Orbitingkittenfarm",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "\"Florida elects meth gator as governor.\" \n\nMeth Gators first goal in office is to maul a member of his staff because he's a wild animal on speed.",
                                    "score": 64,
                                    "author": "WillyTheHatefulGoat",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Florida governor meth gator *is* what happens when you adjust your expectations rationally.",
                                            "score": 23,
                                            "author": "SirKermit"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "at least it’s an upgrade",
                                            "score": 6,
                                            "author": "ImperialBomber"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "You wrote this like this isn't the best scenario we could hope for",
                                            "score": 7,
                                            "author": "Tyranicross",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Desantis won by such a small margin too. He cheated his way into victory by getting a different candidate to have the same name as the dem lead. There's a shot, we just gotta go out there.",
                    "score": 31,
                    "author": "TheLegendaryTito",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That was a different race",
                            "score": 10,
                            "author": "tazemaster",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Sadly, DeSantis has a double digit lead in the polls. He most likely will win.",
                    "score": 6,
                    "author": "raffman"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Now you all know why Republicans are trying so hard to make it more difficult to vote.",
            "score": 30,
            "author": "speedycat46",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Republicans especially in Texas hit on one policy very effectively, Gerrymandering.",
            "score": 217,
            "author": "armyshawn",
            "replies": [
                {
                    "level": 1,
                    "comment": "Gerrymandering won't hide the fact that there was a huge youth turnout. *Vote anyway.*",
                    "score": 98,
                    "author": "eccol"
                },
                {
                    "level": 1,
                    "comment": "Gerrymandering doesn't affect Senate races or the Governor race",
                    "score": 16,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Apart from that and the migrant plane lift fiasco, GOPs have nothing else to offer for their voters.",
                    "score": 5,
                    "author": "Conscious-One4521",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Let’s get rid of gerrymandering and the electoral college and streamline voter registration so we can actually have a government that represents the electorate please and thank you",
            "score": 2025,
            "author": "Apathetic_Optimist",
            "replies": [
                {
                    "level": 1,
                    "comment": "Every state should be like Colorado. You are automatically registered to vote if you get a driver’s license or state ID and every registered voter gets a mail in ballot.",
                    "score": 1085,
                    "author": "APe28Comococo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yup. Election days should also be a government holiday to allow everyone an opportunity to have their vote tallied if they didn’t get an opportunity to mail in their ballot",
                            "score": 452,
                            "author": "Apathetic_Optimist",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Election day should be a forced national holiday where nearly everything shuts down or half day maximum. Too many don't get any holiday off. There should also be free public transportation to voting areas.  Hell, have the government foot the bill for Ubers.",
                                    "score": 171,
                                    "author": "Gratal",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Or just allow people to vote early and mail in voting which is available in most states. Don’t have to wait until the last day to vote.",
                                            "score": 96,
                                            "author": "MightyMorph",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "This is so wild to me, as a Scandinavian I get my voting bill in the mail weeks in advance and the place to vote is within walking distance. Usually they use schools for this. \n\nAlso our day to vote is always on a Sunday so the majority of people have the day off and the rest can vote in advance.",
                                            "score": 29,
                                            "author": "Vertella",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I live in California now and get my mail ballot way in advance. It's super easy to vote.\n\nBut I came from a red state where you didn't get a ballot, finding the place you need to vote was a convoluted chore, and the actual process was just unpleasant. And I'm a white dude. The amount of fuckery the Republicans try to pull with minority voting has its own word it's so prevalent. Not sure why they're allowed to do it so much.",
                                                    "score": 32,
                                                    "author": "Gratal",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "That's insane, wow. On our ballots it SAYS where I go to vote, address and everything. Can't believe they're allowed to make it so difficult in the US.",
                                                            "score": 9,
                                                            "author": "Vertella",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "A lot of Europeans don’t understand that the US is like the EU. Every state is its own “country” with its own laws and leaders. And the federal government is like the EU which makes national laws. \n\nIt’s like Sweden and Finland having their own laws but both are EU and follow some. \n\nUnfortunately many states have awful, awful leadership (and citizens of that state) so some states are 1000x worse than others. You generally only hear about bad states because talking about good states isn’t as dramatic and fun.",
                                                                    "score": 10,
                                                                    "author": "psycho944",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I would argue there are a lot more similarities between US states then there are similarities between EU countries but otherwise this is very accurate. For example you have several dozen different national languages in the EU where we only have English and occasionally there are translations in things like Spanish.",
                                                                            "score": 5,
                                                                            "author": "TheHeroBrine422",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "But also, just default to vote by mail. It's great, you can vote on your own time, and you don't need to bring in a cheat card for the Ten different ballot initiatives about dialysis.\n\nBut also, make it a national holiday anyway",
                                            "score": 20,
                                            "author": "Scuttling-Claws",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I’m not sure this would actually help office jobs and banks would close for Election Day sure but those are for the most part not the people who have trouble accessing the polls anyway.",
                                    "score": 72,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "If we can take off a day for MLK or Washington’s Birthday or shrove Tuesday or Good Friday or Memorial Day or Juneteenth or Independence Day or Labor Day or Veterans Day or thanksgiving  or Christmas I’m sure it wouldn’t hurt to pencil in one more day to have a representative democracy for more than 300 million people",
                                            "score": 83,
                                            "author": "Apathetic_Optimist",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You think most young and poor voters get those days off?  Do you know what kind of jobs they work?  Thanksgiving and Christmas are the only major holidays that a vast majority of workers have off in the US.",
                                                    "score": 70,
                                                    "author": "letsgetbrickfaced",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "A lot of states have early voting which includes Saturdays. Opening up a month ahead of time in some. Check your Secretary of State website and they will have the details. You can also request mail-out voting in a lot of states. Yes, it sucks voting is made hard but stop using the excuse to not vote at all. However, I've been voting for years as a fulltime worker with early voting or mail-out voting. It is reality and we are to use the system we currently have in place and the one we wish for hasn't happened yet. It sure as hell won't happen with Republicans in office. They will only make it harder to vote.",
                                                            "score": 9,
                                                            "author": "blubirdTN",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Not anyone who works in healthcare, and there are a lot of low level jobs in healthcare.",
                                                            "score": 8,
                                                            "author": "haf_ded_zebra"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "McDonald's never gave me any ine of those days off. That's why it only helps people who don't need it. There's no mandatory time off in the US. \n\nEven in the Postal Service, the oldest US government agency, they'll work new mail carriers 12 hours a day, nine days straight, and then call you on your off day to come in. The benefits? 0 sick days, 0 PTO, 0 holidays off, insurance is only subsidized $150 a month, and you are *allowed* to put earned money in a retirement fund.\n\nWe need labor reform laws, nothing less.",
                                                    "score": 10,
                                                    "author": "Sammy123476",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "The problem is who the \"we\" is.  Sure you might get off Election day, but will the fast food cook, nurse, Walmart checkout worker, Amazon warehouse worker also get off?  They don't get off most of those holidays. The holiday classification would need to be more specific.  For example the employee should either have the day off or something like a shift with at least 3 hours off during voting hours.",
                                                    "score": 42,
                                                    "author": "marquis-mark",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I’m a bartender in New Orleans. Talking to me about not having days off is literally preaching to the choir",
                                                            "score": 17,
                                                            "author": "Apathetic_Optimist",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Which bar? I’d happily get a drink from a fellow redditor that seems to have a decent amount of common sense. (Feel free to DM if you don’t wanna put it out in public if you want)",
                                                                    "score": 6,
                                                                    "author": "shmick019",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I think you vastly underestimate the number of people who don’t vote because of work. It’s not just poor people.",
                                            "score": 31,
                                            "author": "Ocelotofdamage"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Not only do we get a mail in ballot, but we get a book on what we are voting on with statistics and reasonings on what each vote means.",
                            "score": 25,
                            "author": "mumako",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Can you still vote without an ID?",
                            "score": 12,
                            "author": "TheAnswerWithinUs",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes",
                                    "score": 7,
                                    "author": "APe28Comococo",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Connecticut too. Voter registration is a high school graduation requirement",
                            "score": 15,
                            "author": "meehanimal"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Ok well Biden doesn’t have the power to do that.  That would require a supermajority in congress so that means if you want that you should get out and fucking vote.",
                    "score": 26,
                    "author": "cybercuzco",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "How you we do that? ....vote.",
                    "score": 124,
                    "author": "pimp_juice2272",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Register before Oct 11 in California.  Check your state dates.  I vote by mail.  Easier",
                            "score": 22,
                            "author": "Altruistic-Text3481",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Registration deadline is 11/1 in Pennsylvania.",
                                    "score": 9,
                                    "author": "dulcinea8"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That would be awesome but gerrymandering and voter registration in particular are in the hands of states and the supreme court, and it's going to get worse before it gets better. Unfortunately have to be working on all fronts to do what is possible in the short term.",
                    "score": 12,
                    "author": "listenyall",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Gerrymandering is based on statistics. If young voters blew away their turnout numbers, even gerrymandering wouldn't work.",
                            "score": 4,
                            "author": "Daveinatx",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Uncap the House.",
                    "score": 8,
                    "author": "QTheStrongestAvenger"
                },
                {
                    "level": 1,
                    "comment": "To unlock this feature. Vote Democrat.",
                    "score": 160,
                    "author": "drones4thepoor",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "and don't stop. if you stop and the right slips in they're going to continue to dismantle silly things like voting rights",
                            "score": 50,
                            "author": "sevsnapey",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "To get there you have to absolutely vote for the ones with more common sense and not let the Christo-Fascists that can only win with gerrymandering keep control of re-drawing the maps",
                    "score": 60,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "Lobbying can go kick rocks as well",
                    "score": 5,
                    "author": "spottydodgy",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m 50. I use cannabis and my wife JUST paid off her student loans. It ain’t just young people. Get ALL your asses out and vote.\n\nEdit:who keeps makin comments and deleting them? Say it with your chest man.\n\nWhile y’all are here, please check out dry herb cannabis vapes. Not carts, you can vaporize the bud itself. Taste is amazing, no smoke, no cart chemicals.\n\nHere’s the flowerpot in action. Basically the hunk of titanium gets super hot. Air passes thru holes in said hunk and heats the ground herb underneath. Thing of beauty really. \n\nhttps://www.reddit.com/r/vaporents/comments/uuaqjz/friday_mood_time_to_make_cocktails_now_hope_yall/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf",
            "score": 733,
            "author": "BlueCollarGuru",
            "replies": [
                {
                    "level": 1,
                    "comment": "52 here, you and me both. I've been voting for progressive common sense politics since I was 18, not going to stop now.\n\nNow if we can just get them to finally remove cannabis and psychedelics from schedule 1 once and for all, and stop congressional and senate members from playing the market, I'll believe we've really achieved something (notwithstanding the abhorrent abortion ruling and other bullshit conservative dog whistles, which also need to be addressed).",
                    "score": 20,
                    "author": "SlightlyBurntGranola"
                },
                {
                    "level": 1,
                    "comment": "I remember as a kid growing up being told weed is bad and will hurt you and only losers smoked. Then I found out my uncle smoked, I liked my uncle so I was confused as I didn't think he was a loser so that didn't make sense. Then I caught my dad smoking. Then I found out all my older cousins smoked. Then even my grandparents?!? Holy shit ok maybe weed isnt gonna kill you. I am really upset your generation suppressed proper drug education all the while consuming the drugs they were demonizing. Also still doing the same thing with sex education. We need more people in your generation like you, recognizing the failures and working to improve them rather than admit they aren't there. Vote everyone, vote for your fellow citizens. Time to bring common sense to politics.",
                    "score": 128,
                    "author": "Pawn_captures_Queen",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; I remember as a kid growing up being told weed is bad and will hurt you and only losers smoked. \n\nThe War on Drugs rhetoric worked against the goals of the War on Drugs.  They told us all drugs were Bad (*Reefer Madness* anyone?).  So, once we found out weed wasn't so bad some of us figured they'd also lied about LSD, Quaaludes, Heroin, cocaine, and eventually meth.\n\nI don't use, but that is because most jobs in my industry test when you apply.  If I had the money to retire, I'd be buying edibles first thing.",
                            "score": 29,
                            "author": "rock_and_rolo",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Thing is, I was raised in the dare era. I had police at my elementary school in early 80s tellin me weed was gonna be my downfall. So I never tried it til my 40s. \n\nHelps with old injuries, my mood, my outlook on life. Is it a cure all? Hell no, but it works for what I need it to.",
                            "score": 62,
                            "author": "BlueCollarGuru",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I was told weed was a gateway drug, actually it’s not. I quite drinking alcohol because I liked weed better, which actually had many positive health outcomes such as acne clearing up and healthy weight loss. \n\nThat being said weed is really bad for developing brains. Brain development does not stop till 25 for most people, and people who are neuro divergente (such as having ADHD or autism) that age is around 27. For that reason I actually stopped smoking weed, so now I’m weed and alcohol free. Instead of being told weed was a gateway drug the teachers should have told the truth and warned us about the risks of smoking weed during brain development and let us come to our own conclusion.",
                            "score": 14,
                            "author": "GravenSpirit"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This 1000%, let's hit the polls young voters 💪",
            "score": 18,
            "author": "bareince",
            "replies": []
        },
        {
            "level": 0,
            "comment": "For those who aren’t aware, the FCC (under Biden) is also cracking down on robocalls. There are seven phone carriers who have already been blacklisted for not implementing the anti-spoof regulations. Remember how your phone used to ring every eight hours from spam callers? Biden’s FCC put a stop to that. Vote blue and the FCC continues to have claws that fight for the little person. \n\nhttps://www.fcc.gov/document/fcc-remove-companies-robocall-database-non-compliance",
            "score": 16,
            "author": "newusername4oldfart",
            "replies": []
        },
        {
            "level": 0,
            "comment": "What really cracks me up are the people who think we'll believe that this is the first election that they'll be voting Republican.  I'm in Pennsylvania, and idiots think they're going to get people to vote for Doug \"white supremacist\" mastriano or Dr \"I just gave a speech in front of Hitler's car\" oz by saying stupid things like \"I used to vote Democrat, but now I'm voting Republican\"\n\nHow stupid are the Republicans, all you had to do was run middle of the road candidates and you would have swept Congress but instead you brought candidates that show up to photo ops in full confederate soldier gear and literal snake oil salesmen that give speeches in front of Hitler's car.",
            "score": 16,
            "author": "bontakun82",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 12,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Republicans really hate the poor kinda disturbing actually they immediately filed lawsuits to stop the student loan program causing the Ed dept to rescind forgiveness for millions that had Ed loans sold off to private companies",
            "score": 376,
            "author": "thegree2112",
            "replies": [
                {
                    "level": 1,
                    "comment": "Republicans also voted down veteran care packages",
                    "score": 154,
                    "author": "GeneralZaroff1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Republicans also voted against capping insulin prices, which are purposefully jacked up %1000 to line their pockets.\n\nAnyone who votes Republican in this day and age is a fucking moron, (unless they're in the Club.)",
                            "score": 56,
                            "author": "LoganNinefingers32",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Just like healthcare, they block any attempts Democrats make to improve a broken system. When Democrats squeeze out SOMETHING, they put all their efforts into undoing it...\n\nRepublicans and Democrats both claim college and health care is too expensive, but only one of them is actually doing *something*",
                    "score": 78,
                    "author": "Supreme_Mediocrity",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Senate Republicans also blocked a renewal of the very popular free school lunch program for children. Literally hurting children to own the libs - cruelty is the point.",
                    "score": 10,
                    "author": "Swordswoman"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Republicans are actively trying to overturn student loan forgiveness, and one judge said they could collect on forgiven debts with a different president.\n\nRepublican state governments have also said they will refuse to do state pardons for those convicted of marijuana possession. \n\nAll this from the same party that took aim at women’s right to choose, safe sex, and same sex marriage. So much of what we take for granted and what could ostensibly make our lives better are actively trying to be clawed from us by the GOP. Have a little self-respect and stand up for yourself and your best interests: choose blue over christo-corporate fascism.",
            "score": 55,
            "author": "ChaseThoseDreams",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Some of the new comments on here are just wild.  How do you hate Biden so much?",
            "score": 11,
            "author": "StageRepulsive8697",
            "replies": []
        },
        {
            "level": 0,
            "comment": "If results are not shown on this election cycle, you can say goodbye to shit like this in the long run. Especially in the next decade or so. That's if some how someway we survive that long with extremists in control.",
            "score": 60,
            "author": "a2z_123",
            "replies": [
                {
                    "level": 1,
                    "comment": "If repubicans win big in either of the next two elections, I'm convinced they will change things that will make it harder for decades.",
                    "score": 11,
                    "author": "StageRepulsive8697"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'll sure af will be voting",
            "score": 9,
            "author": "Salt_Sherbert5313"
        },
        {
            "level": 0,
            "comment": "Historically, the kids do not help at the ballot box.  Plesase, please, please prove me wrong you, magnificent bastards",
            "score": 65,
            "author": "sten45",
            "replies": []
        },
        {
            "level": 0,
            "comment": "When Fascists vote, to not vote is to be complicit.",
            "score": 36,
            "author": "ABigSoftE",
            "replies": [
                {
                    "level": 1,
                    "comment": "Amen.",
                    "score": 10,
                    "author": "PerniciousPeyton"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My 17 year old gen z kid can't even vote yet but he's committed to volunteering at the polls. It's not an easy task because you have to give up 4 hours on a Saturday just to train. Then commit to 3 days at the voting facility, starting at 7 a. m. til after the polls close. He gave up his time that he could be spending doing teen stuff, so make it worthwhile for volunteers like him and show up to vote!",
            "score": 6,
            "author": "synsa",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I gotta be honest, I don’t like Biden at all but I’m very happy he passed those two policies",
            "score": 44,
            "author": "Ugly-Fat-Whore",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Hey, Brianna Wu. Fuck off",
            "score": 28,
            "author": "Suoclante",
            "replies": [
                {
                    "level": 1,
                    "comment": "It took too long to see someone say this. Honestly she should not be getting any kind of exposure good or bad",
                    "score": 13,
                    "author": "flashtitan",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Everyone needs to vote!  Let’s vote out the Frumpers and vote in common decency and progressive policies.",
            "score": 40,
            "author": "LetItRain919",
            "replies": []
        },
        {
            "level": 0,
            "comment": "She's...actually got a point. Sure, he could have done MORE, but this is still a step forward.",
            "score": 5,
            "author": "balne"
        },
        {
            "level": 0,
            "comment": "Plus the infrastructure bill",
            "score": 4,
            "author": "HerezahTip",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Especially for young women.  You are going to be in a world hurt even more if the Republicans win.",
            "score": 14,
            "author": "dresn231"
        },
        {
            "level": 0,
            "comment": "Please , please do your part gen z. This hopeless gen x/millennial mix is hoping we pull this one off.",
            "score": 72,
            "author": "Matisaro",
            "replies": [
                {
                    "level": 1,
                    "comment": "Politicians respond to one thing: power. \n\nThere are more than 70 million millennials and 26 million cast a ballot in 2018. Conversely there are around 69 million boomers and 44 million of them voted in the same year. \n\nPlease vote. There is no small, individual act that has greater consequences.",
                    "score": 24,
                    "author": "HorlickMinton",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Some people just aren't going to vote.  They would rather bitch in forums about \"boomers\" and \"corporate Dems.\"  That is the extent of their political acumen.  Sometimes I think that they want fascist oversight so they have something to talk about.  If you are one of those people, this is a world-changing election cycle.  If they get the majority between 2022 and 2024 you will get to live the rest of your useful life out in a country that wants to jail you.  Just remember that.  You can be the change you want to see, or to can live the way angry, white conservative, fascist males want you to.",
            "score": 166,
            "author": "artful_todger_502",
            "replies": [
                {
                    "level": 1,
                    "comment": "Exactly. Makes me so mad when people don't vote.",
                    "score": 31,
                    "author": "Super_Goomba64",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Well stated. And maybe some folks will take it to the next level. For example, I'm out door knocking for the local Democratic society this afternoon. (I'm a Boomer) Come join me! As an older person, I'm horrified to see women's rights taken away. Actually, not just horrified--totally  disheartened.",
                    "score": 45,
                    "author": "DollyDinkle",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "First off they have to be told about it because they don't watch the news.",
            "score": 84,
            "author": "Lanky-Detail3380",
            "replies": [
                {
                    "level": 1,
                    "comment": "Does anybody watch the news these days? Besides brainwashed Fox people that think Tucker is news?",
                    "score": 42,
                    "author": "TiradeOfGirth",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Being honest, I don't watch the news, I just read it.",
                            "score": 31,
                            "author": "Lanky-Detail3380",
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}