{
    "id": "zerrma",
    "score": 115875,
    "title": "if you know someone who thoughts of suicide, please reach out, in the end we are all humans",
    "author": "urmomsuckedmeoff",
    "date": 1670386672.0,
    "url": "https://www.reddit.com/r/WhitePeopleTwitter/comments/zerrma",
    "media_urls": [
        "https://i.redd.it/re3343rnje4a1.png"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "She's great, I saw her on television. Ted started to tell a bullshit story and she called him out, said \"daddy that's not true\" and he backed down.  She's walking a hard path.",
            "score": 6247,
            "author": "whaythorn",
            "replies": [
                {
                    "level": 1,
                    "comment": "My favorite is https://www.youtube.com/watch?v=gplpSfaouP8\n\nI always feel bad about it because I have never been able to find a wide angle shot or something further away. I think she's getting carried by the dude next to her at the time so she pretty much had no choice in the matter.",
                    "score": 2182,
                    "author": "mr_potatoface",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wow hadnt seen that before if you didnt know better you wouldn't even think they were related there. Poor girl shes just another prop to him.",
                            "score": 886,
                            "author": "DarthTriplehopped",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yea, no way that jackass is a good parent. More to raising a child than survival.",
                                    "score": 71,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I’m sure he figured his wealth will provide for her to have a secure future, plus be in a protected class of citizens. She’s probably better off having him busy with his “work”.",
                                            "score": 26,
                                            "author": "ppw23",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I **had**seen it before, and had **zero** clue they were related. I feel so awful for her.",
                                    "score": 290,
                                    "author": "Budget_Report_2382",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Imagine going home every night after a hard day of making sure you were deliberately making the world a worse place for your child.\n\nHopefully a speedy recovery and a happier future to your kid, and I sincerely hope you get fucked with a Roto Rooter Ted!",
                                            "score": 304,
                                            "author": "Khaldara",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "For real. Being the reason the nation is so divided and all the hate being spread by Republicans on top of legislating your own child’s rights away. Ted Cruz is such a piece of shit",
                                                    "score": 125,
                                                    "author": "Deadpool6323",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "That “man” is absolutely nothing. Licked the boots of a man that talks down to his wife. Then this. He’s a human failure.",
                                                            "score": 34,
                                                            "author": "Standard_Piglet",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The way she recoils in utter disgust goes beyond teenage angst. Wow.",
                            "score": 1041,
                            "author": "SaggyVP",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Six years ago, so she was 8.",
                                    "score": 623,
                                    "author": "TychaBrahe",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 378,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Think she's 8 there",
                                    "score": 189,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Poor kid. She shouldn't look this tired.",
                                            "score": 183,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Poor girl. I hope she’s ok and gets the help she needs.",
            "score": 9871,
            "author": "Hi_Im_Dadbot",
            "replies": [
                {
                    "level": 1,
                    "comment": "Much as I enjoy dunking on Cruze, his family, specifically his kids have my deepest sympathy. Being a politician's kid has gotta be rough, being Ted Cruze's kid has to be rougher.",
                    "score": 5613,
                    "author": "Mord4k",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Especially with all the anti LGBTQ stuff he spews.  Imagine what his daughter (self reported as bisexual) feels every time he says things like that",
                            "score": 3630,
                            "author": "Temporary_Target4156",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh man, I didn’t know that. Poor kid. I hope she finds the love and support she deserves.",
                                    "score": 709,
                                    "author": "Superb_Nature_2457",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Well... the more you know lol. \n\nUSUALLY this kind of situation has a more positive ending. If you do some digging you can find alllll sorts of stories of children being estranged from their garbage republican family members due to the... you know shitty things they say and do. Sometimes they're even willing to give up the dirt, with actual evidence of just how fucking shitty their parents are. Most recent one in particular that was pretty significant (that I can remember anyway) was a daughter of a GOP strategist who basically designed the entirety of the GOP's gerrymandering plan and ways to push legal boundaries to do it. What/when to do things based on how SCOTUS rules on things. Put all of that on a computer and the daughter turned it over for the world to see. \n\nIt sucks ted cruz's daughter sought suicide. I genuinely hope she can get through this and arrive in a much better place in life. Hopefully far far FAR away from her pathetic and spineless lizard person of a father.\n\nhttps://www.npr.org/2020/01/05/785672201/deceased-gop-strategists-daughter-makes-files-public-that-republicans-wanted-sea story of the daughter mentioned",
                                            "score": 469,
                                            "author": "Mellrish221",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "This sauce was incredible",
                                                    "score": 92,
                                                    "author": "artemisastrea",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Honestly I'm willing to bet it starts with \"your dad voted to take your rights as a woman away\" and just gets worse from there. Hell, being the kid of the guy who ran campaign ads where he cooked bacon with a machine gun is probably bad enough.",
                                    "score": 1728,
                                    "author": "Mord4k",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm sorry he did WHAT with a machine gun? I don't know how I've never seen that stupid shit.",
                                            "score": 502,
                                            "author": "variants",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Conservatives have all kinds of weird commercials with guns to remind you they are pro-gun.\n\nOne that stuck out to me during the recent elections was of a candidate who was performing essentially a SWAT raid. Goes in, clears the house yada yada woo woo. At the end of the commercial he talks about how he loves to go “RINO” hunting.",
                                                    "score": 592,
                                                    "author": "R31nz",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "He was running as my senator. Thankfully he got creamed. Unfortunately he was beat by Eric Schmidt.",
                                                            "score": 266,
                                                            "author": "SilentFoot32",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Hopefully him and Mr. Walker can go take a seat on the losers bench.",
                                                                    "score": 104,
                                                                    "author": "Flutters1013",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Oh no, my heart breaks for her. This is the first thing that came to mind, wondering if she was LGBTQ+ as the suicide rate is so high for kids who don’t have acceptance at home. Reminds of that hateful mega pastor and author Rick Warren who lost his son. But we will never know why his son took his life because his Dad squashed any rumor of him being gay.",
                                    "score": 393,
                                    "author": "juliazale",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I immediately thought of the recent Colorado shooter's dad who was relieved his son wasn't gay live in interview.",
                                            "score": 214,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "imagine your dad blamed you for him being a spineless prick and abandoning everyone during the power grid issues, amongst im sure countless other things. she’s gotta feel like she’s got nowhere to turn:/",
                            "score": 773,
                            "author": "beebog",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "that asshole blame his daughter for the Cancun Vacation debacle while thousands of Texans were freezing without power, no wonder these kids want out ...",
                                    "score": 195,
                                    "author": "GuyLostInTime",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "And then your mom was all \"Sorry, I can't do anything, your dad is the man of the house and I don't believe in divorce. Just suck it up\"",
                                    "score": 533,
                                    "author": "ConsiderationWest587",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "\"I don't believe in visiting/taking care of you in your old age\" -Their kids in 30 years",
                                            "score": 255,
                                            "author": "NotYourClone",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Daughter of two MAGA people who abused me EXTENSIVELY and still do when they can.\n\nI can assure you I won't be touching either of them in their latter years. They left me for dead, so I'll return the favor in time.",
                                                    "score": 24,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "My mom to a T",
                                            "score": 46,
                                            "author": "Myquil-Wylsun",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 80,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "His kids, yes, his wife not so much. She has the agency to divorce him if she wanted to.",
                            "score": 138,
                            "author": "Mental_Medium3988",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "His wife is complacent and sided with him over their children long ago.",
                                    "score": 135,
                                    "author": "Left-Yak-5623",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I remember their family was going through a parade on a float together and both the girls were right up front and *everyone* was booing and screaming profanities at Ted Cruz but the girls were up there having to take it all in too, and I remember the look on their faces, the older one in particular, and I thought wow that must suck for her, well both of them, but she did look pained by it all.\n\nThen someone threw a can at him.\n\nEdit: I just want to be perfectly clear here this is 100% on Ted Cruz. It's his fault for putting his daughter's out there like human shields, using them as political pawns with zero regard for how it will affect them. I do not blame the crowd for booing because Ted Cruz deserves to be booed. I blame Ted Cruz for putting his daughters in that situation with no regard for how it will affect them emotionally and just completely using his family for political gain. \n\nTldr: Ted Cruz's giant piece of shit",
                    "score": 2430,
                    "author": "TrumpsPissSoakedWig",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oof yeah, that's tough for any person, let alone a 14-year-old.",
                            "score": 451,
                            "author": "TheDustOfMen",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm old enough to 'member when Chelsea Clinton was this age and the right was constantly making fun of her appearance. That's a painful and difficult age for anyone, without a bunch of grown men talking shit on national TV because they're politically opposed to your dad.\n\nNone of these kids deserve to be dragged into or exposed to this bullshit, whether it's directed at them or not. One of the few things I respect about Trump is he kept Barron out of the public eye, and I respect that the left didn't go out of their way to trash him either.",
                                    "score": 608,
                                    "author": "JesusChrist-Jr",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Barron Trump. He’s the one that Trump called “my wife’s son”, right?\n\nI’ve always wondered about his name.  Back in the 80s and 90s, “John Barron” was one of the aliases Trump used when he sent mail to members of the media praising himself. His writing style, which we’ve all become familiar with since then, gave him away.",
                                            "score": 150,
                                            "author": "bcarter3",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "The \"right\" loves attacking children. The Obama girls got the same treatment as Chesla. The Bush twins was hella wild(I lived in DC when he was in office and those girls was wild) but no one bashed them.",
                                            "score": 394,
                                            "author": "Feeling-Ad-7131",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Ugh I remember how they did Chelsea. I was an 18 year old insecure girl myself and I remember being so sad for how rotten they were to her and by extension, me. It was a very clear moment where I realized how fucked women are, especially bc they weren’t much kinder about Hillary’s looks either. The message was clear — if you’re a woman and you chose politics (or your parents chose politics) you’re in for a world of hurt. Chelsea did alright though, so I’m glad she mad it out alive. \n\nWith Ted Cruz daughter she doesn’t have the family support that Chelsea had bc her own Dad doubles down on it. Heartbreaking. Truly.",
                                            "score": 113,
                                            "author": "throwawaythedo",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Hunter Biden got dragged through the mud lmao he's still being brought up \n\nHe's so irrelevant to all the politics, and it's not even like he's being caught in the crossfire, it's like they think he's up to something. It'd be like if I conspired that Ted Cruz flew to Cancun during the winter storm because his daughters had secret ulterior Motives and we needed to look into their personal lives. Sigh.... \n\nPolitics aside, I feel like culture in general is shifting in that direction, people like to have that dirt on others and don't really care about impartiality and political correctness as much. Or maybe they care the same amount and we as a society are just becoming aware of how little anyone cares",
                                            "score": 145,
                                            "author": "PlanesOfFame",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The obsession with Hunter is insane coming from a Brit. The recent 'Twitter files' which was Elon and the right claiming Twitter bias was actually Twitter being asked to remove stolen nudes of Hunter.\n\nThen they claimed it was government suppression of free speech when Trump was the government.",
                                                    "score": 25,
                                                    "author": "Jiminyfingers",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Trump kept Barron out of public possibly because of autistic qualities or aloofness that would make him look weak, not because he was a great dad.",
                                            "score": 131,
                                            "author": "kountchockula",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "And because eventually Baron got taller than him. Can’t have that shit in public ey alpha trump.",
                                                    "score": 69,
                                                    "author": "MoonSpankRaw",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "…. I’m convinced this is the real reason. He clearly lies about his height and is ridiculously vain and insecure. Why would he let his teenage son be visibly much taller than him?",
                                                            "score": 45,
                                                            "author": "[deleted]"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Pretty sure it was Melania who kept baron sheltered.",
                                                    "score": 31,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "That’s the first thing that I thought of was her face in that parade when everyone was booing her dad and cursing him. She shouldn’t have been there.",
                            "score": 1177,
                            "author": "SopaPorMiFamilia",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 2862,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I wish his kids hadn't been there, and that the can hit him square in the eye. I also wish he would have stood up for his wife when trump insulted her (for her sake) , but that may be too much to ask.",
                                            "score": 1010,
                                            "author": "Iwasborninafactory_",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Oh and for his kids’ sake.  He showed them -or will when they find out - that their Dad had NO spine.",
                                                    "score": 479,
                                                    "author": "TGIIR",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 408,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "&gt;South America\n\nCancun is in north America.",
                                                                    "score": 104,
                                                                    "author": "craftycontrarian",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[deleted]",
                                                                            "score": 62,
                                                                            "author": "[deleted]",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Don't forget, they left the dog at home to freeze.",
                                                                                    "score": 30,
                                                                                    "author": "Ohnonotagain13",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "They knew he had no spine the minute the cunt fled from Texas during a power outage caused primarily by his backwards political ideology and blamed his actions on his family.",
                                                            "score": 185,
                                                            "author": "Debaser1984",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Can you imagine going back to school after your dad basically blamed you as the reason all her classmates suffered through a power outage during a blizzard? I wouldn’t want to be her either.",
                                                                    "score": 124,
                                                                    "author": "spoildmilk",
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "All our pipes burst and we had to use every scrap of clothing and huddle together under all of our blankets to stay warm and he runs off to warmer climes and blames it on his kids. I feel so badly for those innocent children having to see what a slime he is. I hope he knows that he caused so many ppl pain and I hope she realizes that none of that is her fault and she gets the love and support she needs to move forward with her life. A permanent solution to a temporary problem is what I've tried to tell myself over the years when I get that low. In order to help curb those feelings from continuing I completely stay away from a certain family member who has caused me harm. I feel that her getting away from her father and his negative energy as she gets well should be paramount.",
                                                                    "score": 46,
                                                                    "author": "oldschoolwhitegirl",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "The way Ted Cruz and Lindsey Graham both called out Trump strongly and explicitly early in the primaries, then went on to weld their lips to his ass was just astonishing.",
                                                    "score": 264,
                                                    "author": "acog",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It wasn't just them, it was huge swaths of the GOP establishment. Never forget that Paul Ryan went from violent opponent to meek supporter after a single closed door meeting and then quietly dipped out of politics altogether as soon as he could.",
                                                            "score": 95,
                                                            "author": "animu_manimu",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "fuck paul ryan. he got his and saw the crazy coming (which he very very very very much helped come) and was like \"well i got mine, i'm out this bitch\"",
                                                                    "score": 77,
                                                                    "author": "annies_boobs_feet",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "So many politicians use their families as tools and shields, it's disgusting.",
                                            "score": 133,
                                            "author": "teh_drewski",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Cruz wants privacy for his daughter when she is going through mental health issues, but shares Hunter pics as he’s struggling with his own mental health issues. Hypocrisy!",
                                                    "score": 107,
                                                    "author": "travelingbeagle",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Ted Cruz likes to hide behind his children like a coward.",
                            "score": 152,
                            "author": "Ausgezeichnet87"
                        },
                        {
                            "level": 2,
                            "comment": "maybe he shouldn't subject his family to that, or he could just stop being a piece of shit",
                            "score": 105,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "She’s listed as “ok” but she obviously needs more help to get past this.",
                    "score": 421,
                    "author": "-newlife",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you’ve never experienced suicidal behavior,  just being physically ok is not the end of the road by a long shot.\n\nThe psychological aspect of being in that suicidal headspace is exhausting, and can go on for months before and after an attempt. It simply drains the lifeforce out of you after every suicidal thought.\n\nAnd these suicidal thoughts can be constant; the first thought you have when you wake up, and the last thing you think about before going to sleep. An intrusive, unstoppable thought that can happen every 5 minutes or less for every waking hour.\n\nNot only do you have to deal with the traumas that have led you to being suicidal, but you must now also be burdened with new trauma of living with suicidal thoughts and intent, and the impact it has on your relationships.",
                            "score": 570,
                            "author": "itsnickk",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I have the utmost empathy for this poor girl. I can't imagine having a famous parent, a widely hated one at that, is easy for any child. But you're right, being suicidal is a form of trauma. Especially being suicidal while your brain is developing. It literally changes the physical neural pathways in your brain. And an attempt is also a form of trauma. One of my attempts still impacts me today because of the mental and physical trauma it caused even though it was years ago. To deal with all of that at 14 with the whole country watching... my heart hurts for her. I pray she gets the privacy she deserves right now but I unfortunately don't expect the media to give her that",
                                    "score": 53,
                                    "author": "Rapunzel10",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Yup. Been through that ringer a few times and let me tell you, just experiencing the headspace of 'I am ready to end my life' is....not a thing our brains should experience.",
                                    "score": 187,
                                    "author": "reyballesta",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "A though I had earlier today was this:\n\nI shouldn't have to fight my own mind to stay alive.",
                                            "score": 201,
                                            "author": "flaminghair348",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That’s a fucking good way of saying it.",
                                                    "score": 38,
                                                    "author": "Bubashii"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I loathe Ted Cruz but I hope his daughter gets the help and love that she needs",
            "score": 6804,
            "author": "OverMedicatedTexan",
            "replies": [
                {
                    "level": 1,
                    "comment": "Man, even loathing Ted Cruz as I do. I wouldn't even wish this kind of affliction on him, especially his daughter.",
                    "score": 1914,
                    "author": "LordofKobol99",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, I have to say it’s genuinely never crossed my mind the guy has kids.\n\nI still have some pretty intense fucking feelings towards him, but holy shit imagine that’s your dad. Your dad is one of the most hated politicians in America while you’re at the most vulnerable age of your life.\n\nGod damn. I can’t imagine growing up in that kind of environment.\n\nEdit: I appreciate everyone’s replies, but I’m turning off my notifications on this one. I realized every time I’ve said my personal opinion about him online, it’s far more likely his kids have seen it than him and I should stop. Y’all are making it pretty difficult to keep that same energy, because I keep finding out more and more about him.",
                            "score": 721,
                            "author": "Leaving_The_Oilfield",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "most people remember he has kids cause he threw them under the bus as his main reason for going to Cancun during the life-threatening grid failure in TX",
                                    "score": 412,
                                    "author": "stomach",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Somehow I appear to be the only one who never heard that tidbit.\n\nFucking hell.",
                                            "score": 73,
                                            "author": "Leaving_The_Oilfield",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I'm trying to remember and be respectful, but iirc she is lgbtq, disagrees with her dad's politics, and was Ted's scapegoat for fleeing Texas for Cancun last year.",
                                    "score": 129,
                                    "author": "liqwidmetal",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I told myself I wasn’t going to talk shit about him online just out of respect for his kids because they are more likely to see it than him.\n\nYou’re making it really god damn difficult though.",
                                            "score": 45,
                                            "author": "Leaving_The_Oilfield",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I learned that he had kids during the Texas snowstorm when everyone lost power and the state was in crisis. Ted fled to Cancun and when he was rightfully criticized for it he threw his kids under the bus and said that they wanted to go. Never mind the obvious fact that he could have sent them and his wife away to safety and stayed to address the situation himself and nobody would have been angry because you’re allowed to care about your family in that sort of situation.\n\nBut no, Ted Cruz is a giant piece of trash that not only hates and works against everything decent and kind in the world, he’s a craven little shit who will deflect blame for his own weakness onto children. Imagine being his kid and realizing what an absolute turd your father is.",
                                    "score": 139,
                                    "author": "SessileRaptor",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Exactly, people in Ted Cruz's position earn good money to be given heat by the public, its part of being a politician but leave people's kids out of it. She has no say in what her dad does so anyone who was bullying her for her dad is a piece of shit.",
                            "score": 569,
                            "author": "WhiteyFiskk",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Not trying to be funny but can you blame her? She's bisexual and her father is Ted fucking Cruz. This is a girl who has spent her whole life hearing her father state publicly that he doesn't think she should exist.",
                    "score": 1967,
                    "author": "decoue",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is why I get so mad when people say “I hope you have a gay kid” to bigots. Like I fucking don’t. That won’t change them. I hope Caroline can reach her adulthood and realize there’s a whole world of people who accept and value her for who she is.",
                            "score": 1294,
                            "author": "aflyfacingwinter",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I’m with you. I think people with humanity think that the bigot will learn to love LGBT because they love their own kid but all that (usually) ends up happening is the kid grows up feeling rejected and sad. Don’t wish terrible situations on kids. It’s not fair to them.",
                                    "score": 331,
                                    "author": "toricoon",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yes, I think it is a kind of naive thinking that straight people exclusively have. I’ve never heard a gay person say that. It’s tender hearted of people to think a parent will work to accept their child , but that’s often not the case AT ALL. Kids are still being sent to conversion therapy.",
                                            "score": 91,
                                            "author": "aflyfacingwinter",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I read somewhere that she came out as bi earlier this year. I can’t imagine how difficult it must have been for her to share that in such a conservative household while also knowing her family is in the public eye. I wish her the best and hope that she gets the treatment and support that she needs.",
            "score": 3430,
            "author": "sewer_pickles",
            "replies": [
                {
                    "level": 1,
                    "comment": "If I'm remembering correctly she didn't come out, she was outed which is a pretty massive difference for someone in the public eye",
                    "score": 603,
                    "author": "The-Box_King",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[Best I can find](https://www.forbes.com/sites/petersuciu/2022/01/11/was-ted-cruzs-teenage-daughter-outed-on-social-media/) is that she had \"bi\" written on her TikTok profile. And she did mention she was bisexual in a comment thread.\n\nSo the information was there for people to find. However, it also appears she didn't intend for the information to spread (for example, she mentions she hadn't told her father yet).\n\nI'm not sure if this means she was outed or not. But it's definitely true that the news of her sexuality was spread without her knowledge. And, most importantly, by people doing so entirely to make a political point (on both sides of the isle), which is pretty disgusting.",
                            "score": 179,
                            "author": "xixbia",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That is heartbreaking. I remember being a queer kid reaching out like that on the internet. It's the most natural instinct in the world to look for your people, y'know? It's so awful how that was poisoned for her.",
                                    "score": 43,
                                    "author": "StopThePresses"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This poor girl, she must be living a horribly cruel hell right now, I can't imagine what that monster is doing to her right now, he's probably gaslighting her and trying to pray the gay out of her\n\nIf she's here reading this because she's 14 and it's possible - please hang in there, you're so close to so much freedom and so much acceptance",
                    "score": 179,
                    "author": "ChucksSeedAndFeed",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wow. Poor young lady.  As much as I loathe the man, best wishes for her!  Hope she gets all the help and care she needs!",
            "score": 4213,
            "author": "Darklock2022",
            "replies": [
                {
                    "level": 1,
                    "comment": "I hope it's a fucking wake up call that the WWE bullshit has real life consequences. Stop fucking with people's lives for Twitter clout and take your damn job seriously.",
                    "score": 327,
                    "author": "MicroBadger_",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m no fan of Ted, but this is 100% the correct take.",
            "score": 10623,
            "author": "Electronic-Self3587",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yup. Ted can fellate a satchel of Richards, but his kids don't deserve any of the hate he gets.",
                    "score": 4098,
                    "author": "ElectricJetDonkey",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A haversack of tallywacks",
                            "score": 836,
                            "author": "nonoglorificus",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "A parcel of penii.",
                                    "score": 396,
                                    "author": "Plonsky2",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "a wad of wieners",
                                            "score": 254,
                                            "author": "tatopuig",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 188,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I just read an article about the incident, said that she gets a lot of judgement and hate based on her Dads politics that she often disagrees with him on and that’s just not fair. Ted Cruz deserves all the hate he gets, but his daughter doesn’t, she can’t do anything about it and deserves the chance to form and express her own opinions.",
                            "score": 277,
                            "author": "Ginge00",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Tbh I always got the feeling even his own kids don't like him. Hope she'll be alright, poor kid.",
                            "score": 500,
                            "author": "LoganCaleSalad",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "She definitely doesn’t agree with his politics, and she has been open about that for about a year or so. She is also  lgbtq+",
                                    "score": 591,
                                    "author": "AnonBubblyBowels",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "In that family? Fuck. Poor girl",
                                            "score": 281,
                                            "author": "Princeofbaleen",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Oh fuck. Well we know what was at least a contributing factor in this attempt now don't we. Poor kid, heart breaks for anyone in LGBTQ community whose parent is in conservative politics.",
                                            "score": 370,
                                            "author": "LoganCaleSalad",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Say what you will about dick Chaney but at least he had a change of heart when his daughter came out as lgbtq+.",
                                                    "score": 113,
                                                    "author": "Mental_Medium3988",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Cheney is like most conservatives in that he has zero empathy for a social issue until it lands on their doorstep. If his daughter hadn’t come out, I’m certain he would still be staunchly anti-LGBTQ.",
                                                            "score": 205,
                                                            "author": "DazzleMeAlready",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I literally had a friend who didn’t believe in police violence until her sister got beaten up by an off duty cop who was moonlighting at a bar.\n\nShe started sending us all these articles on police brutality “I can’t believe this is happening! How is no one talking about this?!” \n. We were like dude everyone’s talking about it? We just stopped talking about it with you because your stance is that they should have complied",
                                                                    "score": 121,
                                                                    "author": "Ani_Infijar"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Republicans love to use lines like “as a father of a daughter, I’m 100% against rape (or whatever)”\nLike, it didn’t occur to them to have human decency until it affected someone close to them.",
                                                                    "score": 24,
                                                                    "author": "TammyTermite"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Wasn't she just in a republican parade float? She's 14 or something. \n\nIn my opinion She's being exploited by her father and it comes at a cost to her mental health.",
                                            "score": 121,
                                            "author": "Xenjael",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "One of the cars in the parade for the Astros victory. With basically the entire crowd furiously booing at her dad. That shit had to be rough, poor girl.",
                                                    "score": 84,
                                                    "author": "ScroochDown",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "&gt;Wasn't she just in a republican parade float? She's 14 or something.\nIn my opinion She's being exploited by her father and it comes at a cost to her mental health.\n\n\nYou literally just described why hes not only the worst piece of garbage to represent our state, but his failure as a father as well.",
                                                    "score": 46,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "That piece of shit blamed his daughter for them leaving the state when there was a freeze. Hes fucking scum",
                                    "score": 202,
                                    "author": "fusionlantern",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "\"I like Ted Cruz more than most of my other colleagues like Ted Cruz. And I hate Ted Cruz.\" - Al Franken",
                                    "score": 50,
                                    "author": "Dr-Bison",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "We can be adults about our disdain for Ted. Remember, we don’t like Ted Cruz. His daughter isn’t Ted Cruz. And poor girl. Hugs to her.",
                            "score": 163,
                            "author": "epi_glowworm",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Ted himself deserves *extra* vitriol though, as he’s repeatedly gone out of his way to make life harder for her and people like her.",
                            "score": 65,
                            "author": "djublonskopf",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The correct take is to not publicize a teenager who just tried to commit suicide regardless of her family.",
                    "score": 132,
                    "author": "redkinoko",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "i’ve actually seen some of her tiktok’s and she’s such a strong advicate for human decency, love, and respect and everything her father is so starkly against. she’s fantastic and i hope she recovers. we can’t pick our parents but we can be so much more than them and shine brighter than they ever could. i hope she lives, thrives, and is the change in the world that she hopes to see. 💜",
            "score": 465,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I saw a videos a few weeks back. Cruz and his family were on a parade, in some motorized vehicles. The family was waiving as the crowd booed and flipped the bird at Cruz. You could see the pain on the girl’s expression. The vitriol has not ceased since he left for Cancun while his constituent were freezing. And Ted even blamed his daughter for the trip. \n\nIt’s already hard enough to be a teenage girl, but having to endure constant public humiliation because of who your dad is must be a difficult situation to process. \n\nPoor girl. I hope she recovers well",
            "score": 92,
            "author": "Rocyrino",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This is a mature and appropriate take. Thank you for sharing, /u/urmomsuckedmeoff.",
            "score": 10036,
            "author": "PrimeFission",
            "replies": [
                {
                    "level": 1,
                    "comment": "This story brought a tear to my heart, it reminded of what it was like when I was teenager, when the world was tall and the ones closest to us meant the world, where those relationship could easily build us up or hurt us forever and irrevocably, \nI am praying to whatever God is out there, she recovers",
                    "score": 3091,
                    "author": "urmomsuckedmeoff",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "As someone affected directly by suicide , you said this so perfectly",
                            "score": 646,
                            "author": "The_Nancinator75",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "It warms my heart to know my mom is sucking off such a thoughtful and compassionate person.",
                            "score": 505,
                            "author": "AnExpertInThisField",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Proud of my mom too 🥹",
                                    "score": 43,
                                    "author": "AnonBubblyBowels"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Children can’t choose their parents. Just because her dad is terrible doesn’t mean she is. She’s 14. Suicide is awful and I hope she gets the help she needs.",
                    "score": 1268,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I couldnt imagine. It has to be a ton of stress being the daughter of someone like him.",
                            "score": 262,
                            "author": "Zyvyn",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "It sucks to know that so much of what she might be goin through is because of who her father is. When your parent is so polarizing to so many and then to add teenage yrs finding your identity/sexuality, I can’t even imagine. I really hope no one goes low on this situation, not for Ted’s sake, but for his entire families.",
                            "score": 377,
                            "author": "karavasis",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Saying that, Cruz shouldn't be treated with kids gloves if it turns out that things he supports is partly responsible for his daughter trying to kill herself. For example, if it turns out she's LGBT given Cruz's anti-LGBT stance. He should be reminded that he's a piece of shit and shouldn't be able to rid himself of the harm he willingly chooses to cause.",
                                    "score": 361,
                                    "author": "UnenduredFrost",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "She came out as bi.",
                                            "score": 281,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "A quick Google confirms that's true. So Cruz wants the state to strip his daughter of her rights and make it so she's considered a second class citizen to straight people. *And* he wants the state force her to carry to term the pregnancy of any man who rapes her.\n\nCruz is a piece of shit. His daughter deserves a better father.",
                                                    "score": 442,
                                                    "author": "UnenduredFrost",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Also that time he tried to skip the state to go on vacation in Cancun while the power grid failed and people froze to death…\n\nHe blamed it on his daughter when he got caught. Threw her right under the bus without hesitation.",
                                                            "score": 239,
                                                            "author": "P_A_I_M_O_N",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Or as the GOP probably calls it, Dad of the Year.",
                                                                    "score": 63,
                                                                    "author": "urlach3r",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "He also threw his wife under the bus to suck off Donald.",
                                                                            "score": 32,
                                                                            "author": "OutlawSundown"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Cruz knows he's a piece of shit. The problem is, not only does he not care, he gets off on being the asshole everyone hates. The only thing that gets his lizard dick hard is berating him. That's why he's such a Trump-loving cum bucket.",
                                            "score": 78,
                                            "author": "Conker1985",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "r/rimjobsteve",
                    "score": 348,
                    "author": "Nerevarine91",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wrong rimjob_steve i believe",
                            "score": 97,
                            "author": "PewdsBeastPie",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My first time getting it first and I misspelled it 😭",
                                    "score": 104,
                                    "author": "Nerevarine91",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That is a shame. She isn't responsible for her father.",
            "score": 2249,
            "author": "BelligerentHorticult",
            "replies": [
                {
                    "level": 1,
                    "comment": "She's been quite vocal on TikTok and other media I'm too old to enjoy about how she does not agree with her fathers conservative views at all.\n\nShe's been fighting the good fight... as much as a 14 year old can.",
                    "score": 2519,
                    "author": "PolyZex",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I thought that was her. Poor girl. I hope she recovers.",
                            "score": 827,
                            "author": "BelligerentHorticult",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The police said they encountered a minor with stab wounds to the arms, they also said there were no serious injuries.  So it sounds like she will at least be physically well.",
                                    "score": 119,
                                    "author": "DrSueuss",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm glad to read that, thanks for the update.",
                                            "score": 31,
                                            "author": "BelligerentHorticult"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "To be clear though, I'm not implying her dads politics had anything to do with what happened.  If it did though he had best do some serious reflecting about the real world consequences of his corporate politicking.",
                                    "score": 557,
                                    "author": "PolyZex",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 85,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Think like a Ted Cruz though... 'consider the optics'.  \n\nHe will believe this makes him look vulnerable, especially in the conservative party where if the 'man of the household' can't keep his house in order it's an indication of inadequacy.  A strategist would tell him that showing growth is his best option to dispel that, though he could double down- which in this case I would assume would be if he takes to twitter and blames woke culture.",
                                                    "score": 43,
                                                    "author": "PolyZex",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "They’ll be blaming liberals in no time, they’ve changed the narrative around to republicans being the victims and bullied.",
                                                            "score": 43,
                                                            "author": "cynicalxidealist",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I didn't think you were, and I don't know he's capable of self reflection.",
                                            "score": 297,
                                            "author": "BelligerentHorticult",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "He’s so incapable of self reflection I’d bet a dollar he doesn’t show up in mirrors.",
                                                    "score": 214,
                                                    "author": "jerkmin",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I can't even imagine how hard being a 14 year old girl would be in this age of social media plus being the daughter of an infamous politician.  Growing up in the worst type of fishbowl.  I hope she gets all the help she needs.",
                            "score": 91,
                            "author": "hazeldazeI",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I think she was lowkey outed as bisexual by some people in the media recently.(last year maybe, idk) there was a weird time where pundits were obsessed with the kid and I felt bad because she’s a kid. She can’t help who her parents are.",
                            "score": 70,
                            "author": "Bikinigirlout",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You're right, I had to look it up.  It was from January of THIS year.\n\n “I haven’t told him yet, I’m kinda nervous to tbh,” she said, “but I don’t think he would be mad about it.”",
                                    "score": 55,
                                    "author": "PolyZex",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Poor Kid. \n\nPlus her asshole dad tried to blame her for when they left during the snow storm that hit Texas last year.",
                                            "score": 47,
                                            "author": "Bikinigirlout",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Never too young to fight the good fight, even the smallest hand helps lift the burden.",
                            "score": 28,
                            "author": "SteamKore",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "He's responsible for her though. I wonder how many mental scars he made played a factor in her attempt.",
                    "score": 163,
                    "author": "NoComment002",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He publicly blamed her for his Mexico vacation while his constituents were freezing to death.",
                            "score": 181,
                            "author": "annang",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Yeah, I wonder that too. Too damn many.",
                            "score": 23,
                            "author": "BelligerentHorticult"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "No matter who they are, I wouldn’t wish this on any living soul. I hope she heals.",
            "score": 819,
            "author": "gen_x_24601",
            "replies": [
                {
                    "level": 1,
                    "comment": "As I was reading that I thought he was going to say “nobody likes ted Cruz but that’s no reason to try to kill yourself”.",
                    "score": 156,
                    "author": "MARINE-BOY",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It isn't, but being his daughter could make you more than a little stir-crazy and desperate.",
                            "score": 90,
                            "author": "Unlucky_Role_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The poor girl probably gets a lot of grief because of who her Dad is. And he is a shitstain, but you can’t control who your parents are. Sad story, I legitimately hate to hear it.",
                                    "score": 66,
                                    "author": "wcollins260",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "God, that’s awful. \n\nThere’s so much pressure on teenagers, especially teenaged girls. \n\nI hope she comes through this.",
            "score": 327,
            "author": "ProfPMJ-123",
            "replies": [
                {
                    "level": 1,
                    "comment": "it's not just the every day struggles kids go through. imagine having a father who's in the spotlight on a daily basis, trying to piss people off. I'm sure her friends talk about it constantly. probably gets threats. bullied. gotta be tough for a kid to deal with all that bullshit. \n\nYes, Ted is a pile of shit. hope she gets the help she needs.",
                    "score": 159,
                    "author": "maddenmcfadden",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, I mean a man  calls your mom ugly on national television and your dad is soon working the phones to raise money for him. Your dad takes you on a trip to Cancun during a blizzard and then blames you for it when he's caught.\n\nI never thought about it before but the amount of shit that poor kid must get in school and on social media would be insane.",
                            "score": 59,
                            "author": "Toby_O_Notoby",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "She thinks he’s a POS too, so I wouldn’t imagine that her home life is great. Probably similar to Claudia Conway.",
                            "score": 84,
                            "author": "wanttobegreyhound"
                        },
                        {
                            "level": 2,
                            "comment": "a father who actively legislates and seeks to remove his own daughters rights.",
                            "score": 24,
                            "author": "turikk"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Damn straight. We don’t choose our fathers. If I prayed, I would for her and anybody else hurting themselves or considering ending their life. \n\nBut I don’t, so if some one else wouldn’t mind.",
            "score": 1809,
            "author": "PoorPauly",
            "replies": [
                {
                    "level": 1,
                    "comment": "For some reason your last sentence reads like Ricky Gervais",
                    "score": 228,
                    "author": "TheSilversky64",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I have it on high authority from various holy folk, that benevolent deities don't mind long distance calls from the faithless; apparently it's nice when people who don't need them or believe in them, recognize their core purpose/message by calling on them to help others\n\nI haven't spent a lifetime trying to contemplate the will and desires of a deity, but I trust in and am warmed by the idea that the kind people across the world who have devoted their lives to such, agree that good gods like it when people want other people to be helped",
                    "score": 200,
                    "author": "Swords_and_Words",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This reminds me of all the people in Nepal that spend their days practicing Buddhist worship on behalf of the world. Sometimes I find comfort in knowing that there are people a world away from me, wishing me well and praying for everyone’s wellbeing.",
                            "score": 39,
                            "author": "saviorofworms"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 154,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I loathe Ted. No one should get any mileage out of a 14 yr old girl attempting suicide. I hope she's ok and on a path to better health.",
            "score": 712,
            "author": "Rickylostthatnumber",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Sending love and healing for Caroline. May she get the help she needs.",
            "score": 140,
            "author": "Otherwise-Web3595"
        },
        {
            "level": 0,
            "comment": "Here's your sign, Ted. Go take care of your family, and stop trying to interfere with ours.",
            "score": 1061,
            "author": "She_Dozer",
            "replies": [
                {
                    "level": 1,
                    "comment": "Youre talking about Ted Cruz. Tomorrow there will be a statement:\"Look what radical leftists made my daughter do!\"\n\nPoor girl deserves better.",
                    "score": 561,
                    "author": "Nervarel",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is unfortunately the very likely outcome. People like Cruz are unable to comprehend the negative effects of their actions and are unwilling to accept them when they come to fruition. He’ll deflect and blame everyone but himself because he’s a low-life piece of shit.\n\nI’m not religious but I hope he has a “coming to Jesus” moment, so to speak, and realizes his quest for continued fame and wealth at the detriment to his family and the American people just isn’t worth it.",
                            "score": 215,
                            "author": "FILTER_OUT_T_D",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Oh Jesus, that’s horrible. At 14???",
            "score": 184,
            "author": "Nerevarine91",
            "replies": [
                {
                    "level": 1,
                    "comment": "Happens more often than you think my first attempt was 12 and a girl I was close with was successful at 13. It's a sad world for sure. It's sad that some kids just deal with heavy shit way before they are ready.",
                    "score": 221,
                    "author": "PuppiPappi",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Attempted countless times when i was 8, but stopped at 13, didn't put down the knife til i was 16. 23 now and it's almost been 10 years since my last attempt.",
                            "score": 117,
                            "author": "dhhdhh851",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I know I'm just a stranger on the internet, but for what it's worth, I'm glad you're still here.",
                                    "score": 59,
                                    "author": "ThePsion5"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": ":( How are you now? I hope the best for you.",
                            "score": 24,
                            "author": "doofenshmirtz_sad69",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You know she came out at 13, as bi, and said she hadn't told her dad yet.  This is very common in religious households, for someone who is bi to think something is wrong with them and is one of the most common reasons our youth commit suicide.  They don't want to be different because they were taught their feelings were unnatural.  Glad, she's going to be OK. Hopefully, the family can go to counseling, children need to be loved unconditionally.",
            "score": 342,
            "author": "Simple_Ecstatic",
            "replies": [
                {
                    "level": 1,
                    "comment": "Since he publicly blamed *her* for his Cancun fiasco; you can imagine the contempt he has for her.",
                    "score": 165,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Then dragging her to a parade where a city mocks you because of your father. I feel so bad for her.",
                            "score": 72,
                            "author": "kyoutenshi"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "nobody's going to bash the 14-year-old. what i, and others, will do, however, is bash Ted Cruz. \n\nthis idiot is probably most of the reason for her mental state. unless she goes to some elite private school (or maybe it doesn't matter), she's got to be getting a lot of shit over what daddy dearest is doing to his state and this country.",
            "score": 146,
            "author": "Razzlecat20",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I have to wonder what part her father’s very public, very douchebag antics plays in her struggles. Poor kid.",
            "score": 510,
            "author": "yankinfl",
            "replies": [
                {
                    "level": 1,
                    "comment": "Trust me many are thinking the same.",
                    "score": 151,
                    "author": "m3gzpnw",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sadly, probably not the one who matter’s most",
                            "score": 59,
                            "author": "No-Car541"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You know full well he's going to blame woke liberals for his daughters suicide attempt",
                    "score": 103,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Only website I’ve seen with reference, but no clue if it’s reliable: https://bnonews.com/index.php/2022/12/girl-injured-at-ted-cruz-home/",
            "score": 28,
            "author": "dustin91",
            "replies": [
                {
                    "level": 1,
                    "comment": "[From our local (Houston) news](https://abc13.com/ted-cruzs-daughter-ok-after-hpd-called-to-senators-home-rep-says/12535892/)",
                    "score": 33,
                    "author": "Accomplished-Leg7552",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "14 years old is such a hard age.  I hope this poor girl gets all the help she needs.",
            "score": 29,
            "author": "Glamma1970"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 74,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Texas Paul here with yet another absolutely correct take!",
            "score": 67,
            "author": "Jingurei",
            "replies": []
        },
        {
            "level": 0,
            "comment": "The question is, will Ted Cruz use this horrific incident as a political weapon to blame and attack the left?",
            "score": 242,
            "author": "LookAtThatBacon",
            "replies": [
                {
                    "level": 1,
                    "comment": "Narrator: He will.",
                    "score": 158,
                    "author": "BlackLakeBlueFish",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "How horrifying, to have this personal information plastered everywhere just because of who her father is. \n\nI sincerely hope she gets the love, support, and professional help she needs now and in the future. \n\nTo those who are thinking these thoughts: you are not alone. You matter. And the world still needs you.",
            "score": 65,
            "author": "Ok-Candle-20",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Sad",
            "score": 19,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Idc who her father is, I hate Ted Cruz but sins of the father have no bearing. No 14 years old should want to kill themselves. I'm hoping her environment changes for the better.",
            "score": 17,
            "author": "molotovzav"
        },
        {
            "level": 0,
            "comment": "There is a TikTok video of the entire family on a float in some kind of parade. They were being booed all the way through it and she was in front and she just looked so miserable. \n\nI don’t understand why politician’s families are dragged into things like that. It’s the politician we need to see and know, not their families. I feel so bad for children of politicians. No matter what side. They didn’t get a choice in the matter.",
            "score": 117,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "To be fair, guys like Ted Cruz drag their families into the spotlight. Ron DeSantis does the same thing. Their families are basically political props. And Ted Cruz is one of the most hated politicians in America and he knows it and thrives on it. Even his own freaking co-workers in the Senate hate him.",
                    "score": 86,
                    "author": "Killingmesmalls_2020",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I wonder if it was the Houston Astros World Series parade. I know Ted was on a float for sure. Don't know why the Astros invited him.\n\nMaybe he needs to do the right thing and step out of the spotlight. I doubt he will do it.",
                    "score": 39,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        }
    ]
}