{
    "id": "13yu9js",
    "score": 9,
    "title": "How to value myself outside of relationships?",
    "author": "Fit-Safety-1652",
    "date": 1685750640.0,
    "url": "https://www.reddit.com/r/selfimprovement/comments/13yu9js",
    "media_urls": [],
    "other_urls": [],
    "postText": "To keep it short, I (23F) feel as though I’m only worth something when I’m in a relationship with someone. How do I complete myself instead of needing someone to be that missing piece? How do I love myself as an independent person?\n\nFor context I’ve just gotten out of a pretty serious relationship recently and I now live alone.",
    "comments": [
        {
            "level": 0,
            "comment": "i think you need to step back from relationships and truly work on building a relationship with yourself to the point where you like and value your solitude. it’s corny and redundant but truly work on yourself - nobody is perfect &amp; there’s tons of stuff you can do to work on yourself. set goals for yourself that don’t involve a significant other - and accomplish those goals. accomplish things that YOU do without anyone else by your side",
            "score": 5,
            "author": "taurusbaby444",
            "replies": [
                {
                    "level": 1,
                    "comment": "!remindme 1 week",
                    "score": 1,
                    "author": "imbiandneedmonynow"
                },
                {
                    "level": 1,
                    "comment": "Thank you so much",
                    "score": 1,
                    "author": "Fit-Safety-1652"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I recommend checking out the codependency sub. See if any of that resonates with you. I’m codependent and I have just started my recovery but it’s been life changing.  The self loathing was constant. I’m truly beginning to love myself.",
            "score": 3,
            "author": "shrtnylove"
        },
        {
            "level": 0,
            "comment": "Stable self-esteem needs facts that support you, that are hard to dispute, to rely on so you can believe in yourself when tested with things which would make you doubt yourself. Facts acts as pillars of support for you self-esteem, they are something which can strongly tell you who you are in the face of opposition. Stick to the facts.\n\nOne thing you can do to develop faith in yourself is to learn how to learn better. Learning how to learn better can help anyone; this can bolster self esteem, because once you know you can learn what you need to even if life throws something difficult at you, you'll have a solid fact supporting your self-esteem. So the belief you would be developing is  \"I can learn what I need to when I have to.\" Prove to yourself you can learn; test out your abilities once you learn a method to learn better, by learning something slightly difficult. If it doesn't seem to be working than go back to the drawing board when it comes to the method you learn when it comes to your learning ability.\n\nOne way you can make learning easier is learning how to narrow the scope regarding steps you take towards your goals. Instead of a vague goal clarify your goal by breaking down the steps you need to take to get there. With vague goals you get a vague idea of what to do; there's like a million things you could do, a lot of them look like the right thing to do, so you don't know which one of them is actually effective, making getting closer to your goal difficult when you have a vague goal. Clear goals give you a clear idea of what to do. So let's just say for example if you wanted to write a book instead of saying something vague like \"I want to write a book\" instead say something more specific like this to start with \"I love fantasy novels, I will complete a rough draft of my fantasy novel within 6 months by writing 2,000 words per day\" and than break it down further until your goal becomes clearer.",
            "score": 2,
            "author": "PureLandKingdom"
        },
        {
            "level": 0,
            "comment": "Cultivate a friendship with yourself as though you were another person",
            "score": 2,
            "author": "JCMiller23"
        }
    ]
}