{
    "id": "13z0z96",
    "score": 1,
    "title": "What do you do if nothing is working? How have you kept hope?",
    "author": "frogmethod",
    "date": 1685767255.0,
    "url": "https://www.reddit.com/r/selfimprovement/comments/13z0z96",
    "media_urls": [],
    "other_urls": [],
    "postText": "I dunno man, this is just really a complaining post.\n\nI eat right, I work out three times a day.  \nI do hobbies I enjoy that benefit me, as well as ones that aren't productive but make me happy.  \nI'm good at socializing, my career advances, I have a girlfriend I'm in love with.  \nI'm in therapy and on meds for my bipolar.\n\nAnd yet without fail, every evening, I will get a horrible dread and I stop being able to function, break down and cry and freak out, a bunch of horrible thoughts rush into my mind that I can't stop.\n\nIt is very frustrating to work so hard, to see yourself becoming a better person, and to still be stuck in the same place. It makes me feel very hopeless. I am an optimistic person, but when you've been working at it for such a long time and I still can't stop the compulsions to hurt myself, it's difficult to keep hope up.",
    "comments": [
        {
            "level": 0,
            "comment": "I was really inspired by your post: it sounds like you’re brave and brilliant and keeping going. You are a big success. I have hope for you. \n\nSometimes things just feel off and we all go to that place of dread. I think if you can learn to take the pressure off yourself it will help a bit. If you know you’re going to feel like that, how can you manage it in the best way: could you set up a cosy blanket for the evenings; have an easy-to-watch tv show on in the background; light some candles. Make a safe haven for yourself to sink into and think: this is the time of day when I let that negative energy out. \n\nThings are working. Slowly, slowly. It’s going to be ok.",
            "score": 4,
            "author": "Experienceshared"
        },
        {
            "level": 0,
            "comment": "Sadness and loneliness are not failures. Most of the times we think that self-love and self-improvement should be this happy, positive place full of rainbows and glitters but it's not. It's also accepting yourself on bad days, knowing you will have the tools to get through heavy emotions and eventually be okay. Feelings and emotions are never permanent, it comes and it goes and we just have to learn to sit with them for however long they stay.",
            "score": 2,
            "author": "ethylredds"
        }
    ]
}