{
    "id": "13z9fi1",
    "score": 2,
    "title": "Feel like i lack personhood.",
    "author": "Hamster-Man-808",
    "date": 1685790358.0,
    "url": "https://www.reddit.com/r/selfimprovement/comments/13z9fi1",
    "media_urls": [],
    "other_urls": [],
    "postText": "Im 17 and i basically feel like i am nobody. I have no character. No goals, no hobbies no nothing... I feel like I'm not even a person.\nAll i really have is my dislike of myself. \n\nIs it even possible to become a person of you completely lack personality?\nAnd in that case.. how?",
    "comments": [
        {
            "level": 0,
            "comment": "To paraphrase The Fresh Prince from his magnum opus, _Parents_Just_Don’t_Understand_:\n\n“You’re only seventeen, you don’t have a rep yet.”\n\nI think the fact that you are being introspective is good, and tells me that you have more personality than you are giving yourself credit for.\n\nFor your age, and assuming you are in the US, much of what you believe your character consists of, is externally driven by society and by parents: your goals are educational achievement (graduate high school, graduate college), your hobbies are (and I am absolutely generalizing here) video games and browsing reddit.\n\nIt’s easy to feel that these societal and parental “decisions” on your behalf mean that you lack agency. In other words, because you didn’t make a conscious decision to do these things, that you somehow lack the personality to make those decisions. And thinking about that lack of agency can certainly be depressing. \n\nFortunately, it doesn’t work that way forever. And it’s part of the reason why the trope of “my child went to college and COMPLETELY CHANGED! :( “ still exists.\n\ntl;dr you don’t lack personality, you lack personhood.\n\nInstead of focusing on what has been decided for you in the past and leading up to this moment in your life, focus on the things _you_ want to do in life, and what specific steps you will need to take to get there. It may sound corny, but look up articles on writing a personal mission statement. Putting words to what *your* goals and values are will help you communicate what is important to you to others, and find those other people who share your goals and values.\n\nGood luck!",
            "score": 1,
            "author": "ThatGuy48039",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for your response! \nThing is.. i did consider what i had power to change. I tried to find what i wanted to do.\nBut.. there isn't anything. \nI don't really want to do anything. I don't want to a achieve anything.\nThat is why i feel like i have no personality.",
                    "score": 1,
                    "author": "Hamster-Man-808",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And yet you want to change.\n\nHonestly, I read through some of your previous posts, and it sounds like you have gone past “teenage angst” and on to “mild anxiety and depression”. If you haven’t tried them yet, cognitive behavioral therapy and possibly medication might be a good idea.\n\nAnd before you think I’m trying to pass this off as “easily fixed with talk and pills”, you should know that I didn’t start to think this critically about the circumstances around my life until I was 40, had been on various medications over the past couple of decades, and found a therapist and treatment that clicked with me.\n\nThere is nothing “wrong” with what you are thinking or how you are thinking it, except that you believe that it’s “wrong”. Or perhaps more accurately, because your brain shows it to you as wrong.\n\nCognitive behavioral therapy was beneficial to me because the therapist doesn’t doesn’t just sit there and listen and overlook all of the bullshit. CBT can’t go back and change history, but it can shift the perspective your brain uses to show you those events.\n\nFor example; I got kicked out of an exclusive high school. When I would think about that time, I’d focus on what a failure I felt like at the time, and all the people I felt I had let down, and all the mistakes I had made. CBT cut through the self-depreciating BS and introduced the thought that the high school had let me down by failing to teach me in a way that I could successfully learn from. It didn’t invalidate all of the other things I thought, and certainly didn’t wipe them from my memory, but it refused to let me continue using it as a source of blame and loathing that somehow I brought all of this failure upon myself.\n\nI think change is in your future. The only question is when.",
                            "score": 1,
                            "author": "ThatGuy48039",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah man idk i honestly don't think I'm doing that well....\n\nI'm trying to get a therapist but I'm Scandinavian and we have public healthcare. Wich is good but it's painfully underfunded so its sloooow... \n\nAnd i dont even know if It'll be the right sort of therapist either.\n\nI suppose you can't cognitive behavioral therapy yourself that well?",
                                    "score": 1,
                                    "author": "Hamster-Man-808",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I don’t think so, but you could probably find a grumpy old man who won’t put up with your shit for cheap. According to the movies, they can be found in any coffee shop or run-down farm /s\n\nHang in there, my dude. It sounds like you are doing everything right, you just need to be patient.",
                                            "score": 1,
                                            "author": "ThatGuy48039",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah not really much else you can do hah.\n\nAlso let me clarify, i was asking if you can practice Cognitive behavioral therapy on yourself. Or is the second party necessary?\nI recon they'd help, but when the system fails you and you got no friends, you only got yourself... So it might be worth a shot.\nI don't know hah.",
                                                    "score": 1,
                                                    "author": "Hamster-Man-808",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I mean, it might be worth a shot, but the most helpful thing about CBT is catching when your brain is spinning facts into lies and… well… working as both “unknowing liar” and lie detector is a nearly impossible task.",
                                                            "score": 1,
                                                            "author": "ThatGuy48039",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Yeah sees like that could prove difficult...",
                                                                    "score": 1,
                                                                    "author": "Hamster-Man-808"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}