{
    "id": "1408zrx",
    "score": 1,
    "title": "Being apart of the world",
    "author": "ISkakoVV",
    "date": 1685874939.0,
    "url": "https://www.reddit.com/r/selfimprovement/comments/1408zrx",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’ve just been sitting here, not thinking. I feel like I’ve lived, learned and done everything incorrectly. This is supposed to bother me into taking action but I don’t feel taking action. I do nothing and I wouldn’t say it’s enjoyable, it feels natural to me and I know it shouldn’t be that way. I have a interview at the airport. It’s good. I don’t feel anything and I keep imagining how people would feel if they are in my position. I feel the excitement and joy from their imaginative perspective. Also I told my dad to get lost and I don’t care straight to his face because he’s going to the airport to drop of some family friend. I don’t like my dad and my whole family . He’s abusive and all the other things. I can’t help but feel bad for telling him to get lost. I’m scared to stand up and speak normally. To be myself and that’s the thing I don’t know how to be myself. I keep imagining what they would do and say. I want to be kind to people and not be like my family. Doing so is making me serve a delusion that is causing me to forget me for others. I don’t like to do stuff and act in a way where I become like them even if it causes me to be a coward and not stand up for myself. Even though I’m more socially open I feel lonely. I’ve just made a whole personality to live by than actually have a personality. I haven’t solved anything. All I’ve done is sweep it under the rug and it’s slowly coming out to get me. What do I do and how do I do it.",
    "comments": [
        {
            "level": 0,
            "comment": "Just focus on being a little bit better than yesterday. If you try to change your entire life over night it won’t happen. Install habits into your daily routine that will lead you to become the person you want to be.\n\nThere is no proper way to do anything. Be a little nicer to yourself when thinking about what you are. Try not to compare your experience to others. \n\nIn terms of family, they have a different world view than you, they have different experiences that make them think the way they do, try and love them for who they are, if they are extremely toxic you can cut them out or not associate with them assuming they don’t cover you financially, but at the end of the day no matter their culture or actions those will be some of the only people who want the best for you regardless of what you do in life.\n\nStart taking the monsters swept under the rug and addressing them as best as possible, again this won’t fix itself overnight. This life is a marathon not a sprint. With the right mindset things get better :)\n\nWishing you the best!",
            "score": 2,
            "author": "Jakepalmtree"
        }
    ]
}