{
    "id": "140ph3s",
    "score": 2,
    "title": "What Should I Do?",
    "author": "VirtualTap771",
    "date": 1685910934.0,
    "url": "https://www.reddit.com/r/selfimprovement/comments/140ph3s",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello I’m 13 and I’ve looking for some self improvement advice. I’m very insecure about my bad hairline and big forehead and usually wear a hoodie at school the whole time and I want some advice on what to do about it. Im very young to have this addiction but I’m addicted to P and I just wanna stop.  Some good things I’ve been doing is going biking with my friends and family once in a while but I’m usually at home. I’m looking to improve myself academically as well and if you could give advice for that too. Thanks",
    "comments": [
        {
            "level": 0,
            "comment": "Start by improving little things, drink more water, eat healthier, exercise regularly, do this to improve your fitness and overall health and mood.\nStart studying for a little time each day, find the places where u lack and improve there.\nDoing these changes is not easy i understand, been there, but i think we all agree that the only thing we regret is that we didnt start sooner. You have a lot of time ahead of you fella. Your P addiction might just be from boredom because you have nothing else to do, im sure if u ocuppy yourself with literally anything you will do great, try out new things, take risks, if theres a girl/boy u like try to get with them, dont be insecure about things u cant change(your forehead etc.) I believe in you and if u need any specific help u can always hmu!",
            "score": 1,
            "author": "Worried-Willow-9214",
            "replies": [
                {
                    "level": 1,
                    "comment": "People at school tease me for my big forehead and bad hairline",
                    "score": 1,
                    "author": "VirtualTap771"
                },
                {
                    "level": 1,
                    "comment": "Also can I talk to you privately if that is fine with you?",
                    "score": 1,
                    "author": "VirtualTap771"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey, it's awesome that you're looking for self-improvement advice at a young age! Embrace your unique features and remember that confidence comes from within. As for your addiction, take small steps to break the habit and find healthier activities to engage in. It can be helpful to reach out to an adult for support.\r  \n\r  \nFor academic improvement, set goals, create a study routine, and stay organized. Seek additional resources if needed and remember to take breaks. Keep up the biking with friends and family, as it's a great way to stay active and socialize.\r By the way, have you heard about the Forfeit app? It's a cool tool that helps you stay motivated by making a small commitment and losing money if you don't complete a task. Give it a try and see how it works for you!",
            "score": 1,
            "author": "Far_Pitch_1621",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much. For my bad hairline I also wanna personally improve so what are things that I can do to improve it and my my hair become thicker",
                    "score": 1,
                    "author": "VirtualTap771"
                }
            ]
        }
    ]
}