{
    "id": "140uzvz",
    "score": 20,
    "title": "Get mad at where you are in life",
    "author": "D0vacs",
    "date": 1685922435.0,
    "url": "https://www.reddit.com/r/selfimprovement/comments/140uzvz",
    "media_urls": [],
    "other_urls": [],
    "postText": "You’re living day by day, doing the same unfulfilling activities.\n\nFill your life with something meaningful.\n\nRead, write, workout.\n\nDo something.\n\nWe were put on this earth to create, and yet majority of people consume.\n\nThen wonder why they’re so unhappy, stop falling into this trap, it’ll lead to nothing but negativity.\n\nStart small, read for 10 minutes, journal, do 10 pushups a day.\n\nTrust me, these things compound.\n\nWhat would you say you’re struggling with right now?",
    "comments": [
        {
            "level": 0,
            "comment": "I’m struggling with the thought that I might be too negative based on the top thread today. Don’t know if it’s true but I can always try to defuse based on what it says in the Happiness Trap. I try to give myself positive affirmations like “I’m comfortable in myself” or “I am relaxed”, even though the book said not to do that. Someone I trust said to do it. I think it’s compatible, though I haven’t read the book in a while. I should read the book again.\n\nWhat about you?",
            "score": 4,
            "author": "556595252e",
            "replies": [
                {
                    "level": 1,
                    "comment": "Which book?",
                    "score": 1,
                    "author": "D0vacs",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The Happiness Trap by Dr Russ Harris",
                            "score": 1,
                            "author": "556595252e"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I saw a guy recently with a tattoo of infinity and small delta. I asked if he had a math degree. He said no, his life was going in the toilet and he needed a reminder. The tattoo stood for infinitely small changes.",
            "score": 3,
            "author": "pi1979",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s the goal, small changes overtime.",
                    "score": 1,
                    "author": "D0vacs"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I work out, read and journal, none of that adds meaning to your life when your life itself has no meaning, a movie could be more profound and impactful to someone than  a book, all those habits are meaningless because your whole life is.",
            "score": 2,
            "author": "goldstree",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well, why does your life have no meaning?",
                    "score": 1,
                    "author": "D0vacs"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I struggle with thinking that I'm not good enough for anyone.",
            "score": 2,
            "author": "Jmastab",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s a lie,no one is better, or worse than you.",
                    "score": 3,
                    "author": "D0vacs"
                }
            ]
        },
        {
            "level": 0,
            "comment": "To sort of add to this message:\n\nGet mad, get sad, get excited, get emotionally hurt, get whatevedr pushes, motivates, and disciplines you to move forward.\n\nI've had every single one of these emotions or feelings push me to move forward. Not necessarily all at once, but whichever one happened to fit the context of what was going on through several parts of my life.\n\nIt makes sense that these push people the most. When you're content there's hardly as much incentive. It's through the times of discomfort, emotional pain, anger, sadness, etc... that is the spark to the fuel that ignites the drive.",
            "score": 2,
            "author": "Mikem444"
        },
        {
            "level": 0,
            "comment": "Hate and insecurity can give you a lot of motivation to change, but it’s easy to be consumed by it and lose a sense of gratitude. I’ve been on both ends of it, and finding the balance is the key to fulfillment.",
            "score": 2,
            "author": "NataviVici"
        },
        {
            "level": 0,
            "comment": "My struggle is feeling like i have achieved nothing in life, like you said it feels the same every day. I don't do anything interesting, i'm just consuming and don't actually know what i want. Only thing i'm actually really interested in would be travelling the world, but i have no idea how to achieve it. I'm in school, and work a couple hours a week but that's just it... Maybe i'll catch a movie once a week, but i just know living life like this is so not worth it. Because 3 years ago i was doing the same shit.",
            "score": 1,
            "author": "lavaval"
        },
        {
            "level": 0,
            "comment": "I totally get your message but one thing always bothers me. I work out for 2-3hours daily with 1 or 2 rest days a week, I like doing it but then there are 21-22 more hours in the day, I sleep and eat like shit and still have to go to work. \nI try to watch a movie a day and try to read in my book, but the remaining hours were so killing that I resorted to alcohol and drugs, although I'm seeking professional help (appointment in 8 days). it's hard filling in the gaps of the day. \n\nSure, there are also small ups compared to these downs. I mean I'm really motivated to better myself but at times I want to give up because I'm really tired. \n\nCurrently day 42 without weed, day 2 of no alcohol, drugs and cigarettes. But boy are the days long and boring now unfortunately. \n\nBelieve me I want to improve but it's so hard dealing with all these emotions, and quite honestly I'm scared of failing yet again. All tips are welcome tho!",
            "score": 1,
            "author": "Osedaxiian"
        }
    ]
}