{
    "id": "1412izr",
    "score": 3,
    "title": "I always feel behind my peers.(I am 17M)",
    "author": "catisfigs123",
    "date": 1685940405.0,
    "url": "https://www.reddit.com/r/selfimprovement/comments/1412izr",
    "media_urls": [],
    "other_urls": [],
    "postText": "I decided that I am nothing compared to my peers, they are going to state university, state championships, and having jobs, having great social lives, meanwhile I am there, just existing, nothing more. They generally do not want to talk, try staying away and such, yet despite it, I keep getting told by my family I am kind and such, I do not see it in myself, I always say that I am easily replaceable. I would say \"If I killed myself, go adopt a child and boom, you got another child to replace me.\" If I were to die, I would like to just be thrown in a trash bin and such, rather than an expensive funeral.",
    "comments": [
        {
            "level": 0,
            "comment": "I have a question, what’s stopping you from going to a university and making friends that connect with you?\n\nAlso, then being someone doesn’t detract from your existence, it’s actually a net benefit to you. Any human getting better as a human beings means you can learn from them. This “vast gap” is great with any teacher because they’re able to get you there. \n\nAlso, roles are replaceable but not individuals. You can have many “mother figures” but only one mom. The same way your mom can have many children but only one you. \n\nYou may not realize it but you seeing yourself as disposable is really selfish because you’re telling your family the opposite of how they actually feel. That’s like if I told you you’re not actually bothered by all these things. If someone else tells you you’re not you have no room to argue because that’s how they feel about you. \n\nClearly you don’t like yourself but that doesn’t mean others don’t. How about you spend some time with those people that actually do and see if you can learn why.",
            "score": 2,
            "author": "TemperWearyMember"
        },
        {
            "level": 0,
            "comment": "Hey man, I just want to tell you that I’ve been in a similar position as you’re currently in. I’ve always been behind my peers, to name a few, I’ve see my friends in relationships and going overseas for college meanwhile I’ve never been in a relationship and plus I dropped out of college due to depression. Fast forward 5 years later, I got my diploma, haven’t been in a relationship yet but other things have turned out well for me like being a finalist for a film competition and some other things.\n\nThe point is, look everybody progresses at a different pace, just because your friends have progressed faster than you does not mean you’re a failure, it could mean that you’re sorta of a late bloomer like how I am. For all you know, you may have friends that may think that they’re always behind their peers like you. There’s always going to be someone who wants what you have. \n\nSo just be patient with yourself, try to set some goals, go out there explore the world (as cheesy as that sounds), go try out a new hobby, try it out for a few weeks, if you don’t like it, try something else. Go join a sports club if you like sports. The key is to just do something, you don’t want to be in a position years later and know that you have done nothing.\n\nOh and anything thing, from reading your post, it seems you are comparing your life to your peers which is completely normal, I get it, we all do it. But remember this, life is not fair, some people have been handed things like high sociability, intelligence, being born in the right family, these things we have no control over. Some people have been given a headstart in life without working hard for them, meanwhile other people get fucked in the beginning like being born to an abusive family, or being born with no legs, things like that. The point is, do not compare yourself to anybody, it is literally not fair to compare yourself to others when you guys are given completely different things in the beginning. If both of you were given equal things, then it’s fair to compare, but life isn’t like that, so it’s not fair. Just enjoy your life, remember it doesn’t have to be a perfect life, you can still live a relatively good life, just try to have fun, don’t compare yourself to any fun and don’t take anything too seriously.",
            "score": 2,
            "author": "yellowfellow222"
        },
        {
            "level": 0,
            "comment": "You're not alone in feeling this way. \n\nI had similar thoughts in high school. Hope you get some help",
            "score": 1,
            "author": "Picards-Flute"
        }
    ]
}