{
    "id": "141j9t7",
    "score": 19,
    "title": "What specifically can one do to increase their self-worth?",
    "author": "StillAwake4it",
    "date": 1685981077.0,
    "url": "https://www.reddit.com/r/selfimprovement/comments/141j9t7",
    "media_urls": [],
    "other_urls": [],
    "postText": "As stated, I (39F) have very low self-esteem and low self-worth. I know all the good things about myself but my entire self is wrapped up in the approval of others.\n\nI have a professional management job where I make excellent money. I’m married with two wonderful kids who are thriving. I am fit and athletic and exercise regularly. I run half marathons and hike 12-13 miles in a day sometimes. On the exterior I have done very well.\n\nBut inside I feel worthless. When I feel rejected or criticized I get a wave of anxiety and cry and beat myself up internally. I seek approval from everyone, particularly my beautiful best friend and my parents. I’m “nice” to everyone but only because I want everyone to like me. I can’t stand up for myself in conflict because I get anxious and feel like crying. I think I am ugly. I feel like a bad, failing parent all the time. I cry very easily at the slightest feeling of rejection.\n\nThis seems like a great reason to see a therapist and I plan to, but it’s not in the budget/timeline until fall. What tips do you have to overcome these feelings of self-loathing on what should be a happy, successful, happy woman?",
    "comments": [
        {
            "level": 0,
            "comment": "I've (m) also suffered with many of these issues myself, and I'm so glad I finally overcame them. Things changed dramatically when I decided to 'learn' the skill of self-worth/self-esteem as I would learn how to play a musical instrument. \n\nFirst, I would agree that seeing a therapist is probably a great idea, but I never did myself. What I did is I read, listened to, and watched tons of therapists via audible, podcasts, and youtube. There are tons of professionals talking about how to overcome these feelings. And when I say professionals, I mean that I'm the kind of person that chooses to consume mostly science-based/evidenced-based materials written by licensed therapists or researchers. \n\nYou might start with Feeling Good by  Burns, or Self-Compassion by Neff, or ACT (Acceptance and Commitment Therapy) by various authors. No single resource was a all-in-one solution. Instead, it was the combination of hearing similar ideas from the carious different angles.\n\nThen you need to practice, practice, practice. Right now, your brain's neural pathways are really good at doing 'self-critical.' It will take a good amount of practicing the new way of thinking and seeing yourself before it becomes second nature to you. \n\nGood luck.",
            "score": 12,
            "author": "FunGus2000"
        },
        {
            "level": 0,
            "comment": "You are already inherently worthy, but it sounds like along the way, you received the message that you weren't and ever since have accepted it as true. Perhaps this message came from your parents or your \"friends.\" \n\nI would say it's helpful to surround yourself with people who are supportive of you and don't tear you down. You are under no obligation to maintain a relationship with someone who seeks to destroy your self-esteem if you feel like that in any way. It winds up being toxic to your well-being.\n\nAsk yourself how would you act if you didn't feel any anxiety over confrontation or didn't care what others thought of you? What would that version of yourself look like? What would you do? What changes would you make in your life?",
            "score": 9,
            "author": "Hermit_Light"
        },
        {
            "level": 0,
            "comment": "It really stuck with me to hear katya zamolodchkiva say that self-esteem is created by esteemable acts. So in order to raise myself worth, I have to do things that I personally believe are worthy. Or at least identify consciously how what I am currently doing is worthy. And I think it doesn't hurt at all to find people who are able to celebrate and express genuine admiration because they value the same thing. I have to know my values and live by them, and when I am not feeling great point out to myself how there's overarching values that I have, such as persistent, curiosity, openness to experiencing or trying out different ways to go about things. Because this protects me from feeling perfectionistic and toxic shame and regret. Since you are a manager, you may be aware of this already, but I learned recently there is something called instrumental values which are the values we adopt because we believe it is a means to our terminal values. which I think could be understood maybe that terminal values are equivalent to esteemable acts and instrumental values are things like empathy, calmness, persistence, curiosity which are intended to ensure the esteemable acts can come to pass.",
            "score": 2,
            "author": "HumbleBumble0"
        }
    ]
}