{
    "id": "141m18a",
    "score": 1,
    "title": "Book recommendation for boundary setting?",
    "author": "rmuktader",
    "date": 1685986580.0,
    "url": "https://www.reddit.com/r/selfimprovement/comments/141m18a",
    "media_urls": [],
    "other_urls": [],
    "postText": "Is there a good book/course on setting boundaries with family members? Internet's favorite answer for this question is cut them off. And I found other resources that help you recognize toxic relationships. But, what I am looking for is what to do after boundaries get crossed. And how to communicate with people who don't understand what healthy boundaries are.\n\nI understand from my studies that I should let others love me and at the same time not let them control or have power over me, even when they mean well. But how do I do that???",
    "comments": [
        {
            "level": 0,
            "comment": "I recommend this book about 5 times a day:\n\nEmotional Intelligence by Daniel Goleman\n\nYou won't find a chapter on setting boundaries but becoming emotionally intelligent will give you the tools to set boundaries.\n\nYou'll recognize what's going on in the other person that makes them cross the boundary in the first place.\n\nThen you'll start seeing them as human beings - no better or worse than you.\n\nAnd finally, you'll suddenly realize you have the skills to push back. And once you do it a few times, the other person will learn.\n\n(Unless they are a legit narcissist, at which point the only thing you can do is give them the heave-ho).\n\n\nTrust me on this: over the course of a decade,  I've read books on building social skills, boundary-setting, charisma, assertiveness, etc.\n\nI've followed all sorts of men, trying to get a taste of the recipe.\n\nI've completely given up and started over from scratch multiple times.\n\nThe problems I was trying to solve over that decade disappeared within 18 months of reading Emotional Intelligence.\n\nAnd now that I'm on the other side of it, it makes TOTAL sense.\n\nSocial interactions are governed by emotion. If you're good at emotions, you quickly become good at social situations - even if they were impossibly hard before.",
            "score": 1,
            "author": "Global_Mandemic"
        }
    ]
}