{
    "id": "141oam9",
    "score": 9,
    "title": "Personality traits that you dislike about yourself are actually corrupted versions of good traits",
    "author": "Taxfraud777",
    "date": 1685991263.0,
    "url": "https://www.reddit.com/r/selfimprovement/comments/141oam9",
    "media_urls": [],
    "other_urls": [],
    "postText": "This was one of the core ideas of \"Verslaafd aan liefde\" (Addicted to love) by Jan Geurtz. The writer tells about how from the moment you are able to communicate, you are going to get rejected. He uses a toddler jumping on a white couch with muddy shoes as an example. The parents will get mad at them and it will learn that it's bad to be spontaneous. This is a normal part of growing up and everyone experiences it, it helps you with learning to behave.\n\n&amp;#x200B;\n\nHowever, because rejection is such a common experience to have for humans. You learn to reject certain traits of yourself because you learned they are unnacceptable. Using the example above, the toddler learns it's bad to be spontaneous and reject this part about him. He also doesn't want others to think he is weird so his spontaneous nature gets twisted into becoming a control freak. By acting this way, he keeps rejecting himself and push the trait down. At the same time he might dislike the fact that he can never be spontaneous and let loose. Therefore he rejects his rejection of his true nature.\n\n&amp;#x200B;\n\nAccording to the writer, the best way to be able to truly love and accept yourself is embracing your true nature and seeing how every bad trait about you is a corrupted version of a good trait that you have, but never accepted about yourself. Perfectionism is a corrupted version of dutifulness, arrogance is smartness, weakness is power, laziness is hedonism.\n\n&amp;#x200B;\n\nThe writer also tells that you are naturally drawn to people who have personality traits that you would like to see more in yourself. So if you want to be a more caring person, you're drawn to sweet and kind people. It also works the opposite way. Certain traits that you hate about others might be traits that you have as well, but never accepted about yourself. Though that is not always the case.\n\n&amp;#x200B;\n\nWhat do you think about this theory?",
    "comments": [
        {
            "level": 0,
            "comment": "It makes me think that while my qualities may be negative and drawbacks in some circumstances, in other circumstances this same quality becomes an advantage. And also, that a quality is all in the eye of the beholder and how they're intending to persuade somebody. For example, if somebody wishes me to take out the trash so they don't have to, they may call me lazy in order to provoke an action, and I may internalize this label instead of realizing that they are a bad communicator and should have just asked me directly. If somebody wants to persuade me to not take out the trash and instead relax on the couch, so that they can have a smoke break outside while taking out the trash, then they may call me relaxed or comfortable and say they don't want to disturb me. And then I may internalize that, that I appear relaxed and calm. Even if I'm feeling anxious while sitting there on the couch.\n\nI don't like to use generalized labels on my self or others because behaviors don't mean that that encapsulates all that I am or what I'm capable of. I am not an angelic perfect person, there is a part of me that is kind. I am not an evil trash monster, there's a part of me that is defending.",
            "score": 1,
            "author": "HumbleBumble0"
        }
    ]
}