{
    "id": "141olo0",
    "score": 1,
    "title": "I Can’t Win",
    "author": "TheWrittenM",
    "date": 1685992276.0,
    "url": "https://www.reddit.com/r/selfimprovement/comments/141olo0",
    "media_urls": [],
    "other_urls": [],
    "postText": "I don’t know where to start this post at all. I want to go straight to point and not make it a pity party, but there are some things worth mentioning.\n\nFor whatever reason, I feel like I cannot improve. I have been on self improvement for almost 6 years now. I heard about it since I was a sophomore in high school, I was about 14 years old, I am now 20. Yet, I virtually haven’t made any significant improvements in my life. I am in the exact same place, maybe even worse place, than I was 6 years ago. Whenever I make good progress, it doesn’t last and ends after a month or two if I’m lucky. I can’t seem to get myself to do things that are beneficial to me or productive. \n\nI don’t workout, despite the fact I have a gym membership. I’ve been paying for it for almost a year now but I probably went about 2 months worth of days. Getting in shape has been a main goal of mine for years, yet I have never came close to achieving it.\n\nI struggle to stick to my goals. I struggle to overcome social anxiety and be social. Maybe it has to do with the bullying I’ve faced when I was so young. I remember being the most social and energetic person you would know, until it was all beaten out of me by bullies. They forced me to muzzle myself to avoid attention and potential attacks on me and I haven’t been the same since. The once outgoing kid is now the quietest in the room, fearing any form of attention. I can’t even go outside most days without a friend with me. I want to be social but I can’t. \n\nThe effects of bullying doesn’t stop there, I have been called ugly numerous times and mocked for my appearance, and I am plagued with insecurities. They flood my mind whenever I’m outside and out of my comfort zone. The thoughts don’t leave me. I never feel present. It is exhausting.\n\nI address my past because I believe maybe it has some correlation with how I’m doing now? I can’t win. I have been going nowhere but downhill the past years. I am tired of it, yet I still don’t change. It has gone to the point where I believe something is wrong with me, even though I don’t want that to be true. Am I just being a bitch? If so, then how can I overcome this? Should I just accept my fate of being less than ordinary? Less than average? I don’t want that to be true, after everything I’ve been through. I don’t know. This post is almost my last resort.",
    "comments": [
        {
            "level": 0,
            "comment": "&gt;I remember being the most social and energetic person you would know, until it was all beaten out of me by bullies. They forced me to muzzle myself to avoid attention and potential attacks on me and I haven’t been the same since. The once outgoing kid is now the quietest in the room, fearing any form of attention. I can’t even go outside most days without a friend with me. I want to be social but I can’t. \n\nI can heavily relate to this. I gained a bunch of weight during covid, and when I went back to school I got bullied a lot. It completely destroy me, and I'm not even close to recovering from it. But I have started. I went from being 290lbs, sitting in my room all day only leaving to get snacks or use the bathroom, and doing nothing but playing video games and jerking off. Now I'm almost 100 pounds down, I go outside regularly, and I am focused on catching up on school online. My best piece of advice is to take it one step at a time. Start small and work your way up. For example with losing weight I just started by cutting out pop and chips. I didn't count calories. I didn't workout. I still sat in my room pretty much all day. But I started, and when I was ready I started doing more. Don't rush yourself or you will keep failing. Self-improvement takes time so be patient. If you do fail, don't feel guilty. Forgive yourself, and try again. I failed lots of times when it came to losing weight, but I kept on trying until it worked. And trust me it gets so much easier. My motivation feels infinite after losing 100 pounds. I wake up at 4am to workout first thing in the morning. Last year I was lucky if I even got out of bed lol. \n\nAnyways I'm doing ranting lol. Hope this helps :)",
            "score": 2,
            "author": "Adeezz69"
        }
    ]
}