{
    "id": "142uim4",
    "score": 1,
    "title": "I truly feel lost in my life without a purpose in it at all",
    "author": "The1GabrielDWilliams",
    "date": 1686088446.0,
    "url": "https://www.reddit.com/r/selfimprovement/comments/142uim4",
    "media_urls": [],
    "other_urls": [],
    "postText": "That is all. I feel like I just exist and have no greater part in this world and want some advice on what to do in the next few years. I am currently training in the army for my active duty career, but have a feeling I won't stay in ut for that long, so any advice would be helpful.",
    "comments": [
        {
            "level": 0,
            "comment": "Everyone must define purpose for themselves.\n\nSurely there is someone out there who has done things that you would deem important. Or accomplishments that would make you feel more a part of the world? \n\nSet the goal, and then pursue it. Once you achieve it, set a new one. You do this for your whole life and you will be absolutely astounded at what you can accomplish.\n\nI asked myself the same question a while back. For me I wanted to prove even somebody with no career, education, or savings whatsoever could save real peoples lives. I went and signed up at a local plasma donation center. I found out they pay $500/month for 2 one hour visits a week. \n\nLong story short I ordered a whole box of 200 bug nets for beds and sent them to a poor African village that had been struggling with malaria deaths particularly amongst their children. Less than $500 to save potentially dozens of kids lives. And what did it cost me, 8-10 hours of sitting comfortably in a clean air conditioned environment watching my favorite video media fully entertained, full, safe, and comfortable.\n\nIt's unbelievable how spoiled most of us are.",
            "score": 1,
            "author": "TheWindWarden",
            "replies": [
                {
                    "level": 1,
                    "comment": "That hits hard for me personally. I hope to use this to my advantage and do something bigger than myself. But it has to specifically so with recognition, though I am an introvert to an extent.",
                    "score": 1,
                    "author": "The1GabrielDWilliams",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The recognition would be nice but its tough. I need to start a Youtube or something.",
                            "score": 1,
                            "author": "TheWindWarden"
                        }
                    ]
                }
            ]
        }
    ]
}