{
    "id": "1439ce5",
    "score": 3,
    "title": "I am angry at the reality of life, my life the most. I won't accept some things",
    "author": "pest_throwaw",
    "date": 1686133317.0,
    "url": "https://www.reddit.com/r/selfimprovement/comments/1439ce5",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am a 28 year old man who currently lives ib Germany. I moved here from a South Slavic country. \n\n\nI had a not so pleasant childhood. I grew up in the same house where my dad did, we lived with my grandparents who had my uncle late in their life so he was more like a brother, but what kind... He always stole my toys, used to beat me up, he broke our TV with an ashtray when he was a kid. My mom could not do much because my father was kind of a coward when he needed to face them. I guess it was since they beat him up a lot when he was younger, they were abusers and still he chose to stay there and raise his own kids beside them. My grandma always presented things like they were merry, but it was shit. She first was always jelaous when my mom made anything and took our food without asking, but you could not take theirs. I remember when she died I was kind of glad, even saying you deserve that you fucking bitch for disregarding your own son and being such a bitch to his wife and kids. \n\nI had my own problems, I have dyspraxia, dyscalculia and ADD. I had trouble doing sports, organizing myself and learning something. I was bullied in school because I was quite and physical week, but because I was tall, I was a proving point for smaller, but stronger or tall and strong guys. I just had a nightmare, where I had to face a childhood bully once again and I explode in rage. \n\nI finished high school barely, because I had also trouble there. I was the target and I responded in rage. \n\nWhen I finished I lived with my folks for some time with no prospect of a job, I worked with my dad in construction for a while, did some free courses in the mean time and managed to land a job as a WordPress administrator. Did it in one agency, got fired after a while, went back to construction with my dad. Found a new job in a small IT firm, I was there a generalist, did WordPress, web design and graphic design. I also got fired because I couldn't do all of that perfectly... Then Corona came.\n\nI went to Germany because I had no other option, a family friend told my dad send him here, there are a lot of jobs. But because everything was closed I found a job in a warehouse. Heavy physical job, but I did it. I worked thete about a year and then I found a job in a slot machine club and transfered because higher paying job and not so physical. \n\nThe thing is, I have a lot of health problems too, I have backpain and neckpain. I also don't save enough money. My room is a mess. I am physically and mentally going down from working nights 6 days a week. \n\nI don't see a bright future for me. I can't accept some things like being on pills whole the time with who knows what sife-effects and just trying to cope with a grim reality. I can't be grateful, there are worse things I know, but why should I live if my standard of living is and can't be meet.\n\nI don't care that some people can, I try not to compare. Don't try to suggest logo therapy or Stoicism. I read about both and no logos or Virtue in case of Stoicism is enough to keep me here. I never asked to be born, I don't want to be forced to stay, by society or anything else. \n\nI wanted a simple life, job with a nice wife from some Mediterranean country and a family who I can love and give myself to... It's only a fairy tail...\nBetter plan my life for Belgium or the Netherlands, to use euthanasia ofc... Thank the all mighty void that at least some places let you die.",
    "comments": [
        {
            "level": 0,
            "comment": "Are some pills or side effects really going to be worse than misery and wishing for death? No, of course not. Might as well seek help. It's not like you won't be able to die later.",
            "score": 1,
            "author": "Sanity_LARP"
        },
        {
            "level": 0,
            "comment": "The more you push against life, the more it pushes against you. Let it all crush you. Your life is on fire, let it burn you. You have a fire within, let it burn. You lose the fire when you sit on your phone, give in to immediate/cheap pleasures, and especially when you ejaculate. Your feeling is a compass, let the fire burn, allow these feelings to be the motivator to change your life, so not cope or numb yourself. \n\nWhen you are old and tired you will look back in regret that you didn’t grab your balls and change your life, you have no clue how good it can get.  Im here brother, message me if you need anything.",
            "score": 0,
            "author": "Sevaarts"
        }
    ]
}