{
    "id": "143i7hh",
    "score": 3,
    "title": "Leader",
    "author": "wiseladd4897",
    "date": 1686156136.0,
    "url": "https://www.reddit.com/r/selfimprovement/comments/143i7hh",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am not in any leadership position, but I want to develop strong leadership traits. How can I build this leadership skill from my everyday life?",
    "comments": [
        {
            "level": 0,
            "comment": "You gotta put yourself into leadership positions. If circumstances don't force you into a leadership position then you have to seek the experience out. Join some kind of group, club, or organization. Or try making one. There are even organizations that are based around building leadership skills.",
            "score": 2,
            "author": "Sanity_LARP"
        },
        {
            "level": 0,
            "comment": "What have you identified as leadership traits? Is there a way to develop those traits outside of actually being in a leadership position?",
            "score": 2,
            "author": "AdolfSchmitler"
        },
        {
            "level": 0,
            "comment": "Being in a leadership position doesn’t make you a leader. On top of that, it’s really hard to gauge your own level of leaderships skills. Nobody can say they are a good leader, only others can give us that title.\n\nI’d start with identifying leadership traits you want to improve. These are entirely up you, but some important ones are empathy, communication, selflessness, decisiveness. Some are attributes and some are skills. Once you’ve identified the few you want to work on, look for opportunities to practice them.\n\nLet’s use Decisiveness as an example. Well what is decisiveness? It is making reasonably well-informed decisions in a timely fashion. Opportunities to practice this will occur constantly throughout your day. You need to decide what to wear in the morning. You get an email at work and need to decide the best way to solve a problem. You have to decide whether to do bench press or go for a run at the gym. You can exercise decisiveness by engaging it when these moments come up and asking “how can I be decisive in this moment”.\n\nOthers are more relationship based like empathy, but the same concept applies. When your wife (gf, friend, whatever) comes home in tears, ask yourself “how can I be more empathetic?”. How can I feel what she is feeling instead of just going through the motions of consoling her?\n\nSorry that might be a bit belabored, but I hope it helps. The simple answer is that opportunities are all around you. The issue is just taking an active role in improving those skills. With luck, someone will notice you doing so, and give you a bigger opportunity to be a Leader by name.",
            "score": 2,
            "author": "awsomeman470"
        }
    ]
}