{
    "id": "143n2kn",
    "score": 264,
    "title": "The #1 Habit I wish I started sooner.",
    "author": "Happiness-College",
    "date": 1686167541.0,
    "url": "https://www.reddit.com/r/selfimprovement/comments/143n2kn",
    "media_urls": [],
    "other_urls": [],
    "postText": "If I sold you a pill that gave you complete self control at all times, how much would you pay for it? \n\nWhat if this pill could: \n\n- Help you lose weight.\n- Help you save money. \n- Help you make more money. \n- Make you feel &amp; appear confident.\n\nHow much would you pay to buy it? \n\nWhat if I told you it’s completely free and available to you immediately, all it required was 10 minutes of time for the rest of your life to enjoy the benefits? \n\nThat magic pill? Meditating. \n\nIt wasn’t until I learned what it actually did that I began to meditate consistently. \n\nI thought meditation was a completely bullshit fad hippies did that had no tangible benefits I cared about. \n\nMeditation is literally one of the first 3 things I do in the morning now. \n\nThe reason I hated it was because,\n\nA.I felt like I was bad at it. \nB. I never felt any results. \n\nHere’s how I fixed those two and started living it. \n\n1. To be good at meditation, start with 2 minutes a day for 14 days. \n\nThis will help you get confident in your ability to focus for that long, then after that you can go up to 5 minutes where I personally started seeing benefits. \n\n2. How to start seeing benefits. \n\nThe #1 issue I had was I wasn’t practicing it long enough for them to kick in. \n\nMeditation is like an antidepressant, you need to do it for 30 days before you start feeling it working. \n\nIt’s main benefit? \n\nYou will get cravings for things you know undermine your goals. \nInstead of immediately folding to them though…you’ll acknowledge the desires. Ignore them. \n\nThen keep pursuing your goal. \n\nIf achieving all of your goals in life is worth 10 minutes of your time. \n\nTry meditating for 30 days, you won’t regret it.\n\nHow I meditate:\n\nSet timer for 2 minutes. \n\nFocus on your breathing as long as possible. As you begin to follow thoughts come back to your breathing without yelling at yourself. \n\nEach time you follow one thought then return.\n\nIt’s one rep mentally. \n\nDon’t feel bad if you have trouble at first, as you get more reps you get better and better.\n\nOvertime you learn to view your thoughts but no longer follow them, giving you complete impulse control.",
    "comments": [
        {
            "level": 0,
            "comment": "What you actually mean by meditation? Can you please explain as I found many definition for it?",
            "score": 55,
            "author": "Hydron45",
            "replies": [
                {
                    "level": 1,
                    "comment": "Meditation is focusing on one thing for a prolonged time. You bring your mind back to just thinking about the one thing when your mind starts to wander, that is the exercise of controlling your thoughts so you can have a clearer mind and learn how to stop thinking about negative things for example.\n\nYou can focus on what your body is really feeling, what you're smelling or hearing, which is also called grounding. I believe grounding is a type of meditation and it especially helps with anxiety or stress.",
                    "score": 44,
                    "author": "mylovefortea",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I have to kindly disagree, focusing on one thing at a time is just what we do 24/7. (Mindfulness) meditation is more like being keenly aware of what you're focusing on, and doing exactly that but not more. Not grasping at what shows up in consciousness, just noticing it.\n\nAnd typically one would begin one's meditation sessions with deciding to focus on the breath, and then observe what happens every time we get distracted from that process. Typically, shortly our mind will start to wander, going \"damn that hair cut was expensive. What does it cost to run a hair salon anyway? Traffic was also bad today. I hate traffic. But man the music in the car was nice. Oh shit I'm thinking about stuff now. Stop thinking\" and then we're back to our breath.\n\nAnd this is a key moment. The mind wandered. But it took x seconds to notice it. Noticing it is the key part, and it's funnily enough where people get frustrated at themselves. It's the equivalent of holding a dumbell in your arm for a minute, then you're like \"oh shit I'm supposed to lift this thing! God damn it!\" Then you throw it away and cancel your gym membership.\n\nAfter a while of doing this, certain patterns begin to emerge. One will become intimately aware of the nature of their mind while meditating. We start noticing that when we're stressed out or angry, that focus is going to jump much more frequently to our inner voice, and it'll just be repeating the same stressed/angry thoughts again and again.\n\nAnd here again is a key moment. We're not to grasp at those angry thoughts, or push them away, but simply notice them, and return to the breath (or sound, or feeling of wind, or any sensory input we happen to notice). Our usual automatic state of mind however, would keep the angry inner monologue going for minutes, hours or even days. Not aware (mindful) of this infinite loop, we'd just agree that we have every right to be angry, and keep telling ourselves that.\n\nAfter some time of this pattern, one notices that their focus jumps less and less to the anger they had 5 minutes ago. Suddenly different thoughts emerge. Thoughts of compassion, relief, how we're going to apologize to the person we just insulted, and thoughts of how silly it was to react so explosively.\n\nThis is where the power of meditation lies, because we become aware of the fact that we don't decide what we're going to think next. Thoughts just emerge, seemingly randomly. We're just here to notice them, but until we begin to meditate we think we're the author. With mindfulness, we lose that relationship to thoughts, and begin to see that we're no more authors of our thoughts than we're the authors of what anyone else says. And if this sounds like voodoo hippie dippie bs, I encourage you to test this hypothesis by meditating.\n\nSo suddenly we have a tool for living in the presence, more fully. A tool to embrace, accept (and watch dissipate) negative mindsets like anger. We have a tool for relaxation, self acceptance, focus and discipline. A tool for being content with what we have and what we are. A tool for reacting to difficult situations in the world.\nAnd with the anger example, I can personally say that, hands down, reducing my anger to 10% of what it used be has been immensely valuable to improving my quality of life.\n\nBut all of this comes from actually practicing meditation frequently, so that this state of mindfulness become automatic and ingrained in our habits.\n\nMost of what I wrote I've learned from Sam Harris' many talks and using his app Waking Up. I'd highly recommend a free trial and checking out the introductory course where he teaches these methods and concepts in a ridiculously succinct manner for anyone interested. Good luck",
                            "score": 9,
                            "author": "MENCANHIPTHRUSTTOO",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I will read your response fully but just wanted to comment that what you said in the first section of your comment is what I meant but I just simplified it in my comment.\n\nAlso I am not focusing on just one thing at a time unless I make an effort to! Which is what meditation is to me, I'm a noob but essentially that's it for me.\n\nI never notice the things around me unless I put my focus in that direction, it never happens naturally for me.\n\nEdit: Read everything now, I agree with everything you said. Meditation helps you be more aware of yourself which gives you more control to do what you really should be doing",
                                    "score": 4,
                                    "author": "mylovefortea",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yes, I did suspect that we ultimately did agree with each other. I didn't want to seem pedantic or anything. Glad that you're finding your meditation practice helpful in your life!",
                                            "score": 5,
                                            "author": "MENCANHIPTHRUSTTOO"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "This breakdown is so helpful for me. Thank you",
                                    "score": 2,
                                    "author": "-SleeplessNights-"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "To piggy back, it’s usually a neutral thing to focus on at the beginning like breath or body (for most people) and then over time and practice you can integrate positive and negative things.",
                            "score": 17,
                            "author": "jtal888"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Here's a visualization to help you out:\n\nThink of your inner world as a slow-moving river, with you sitting on the bank.\n\nAs you're relaxing, you notice the occasional log floating past. Each log represents a thought.\n\nYour goal in meditation is to let those logs float out of sight, without giving them a second thought.\n\nIn my experience, it takes about 10 seconds or less for a log to float around the bend and out of sight.\n\nAnd there's always another one coming down the river, even if you don't see it yet. \n\n-------\n\nThe **superpower** that meditation/mindfulness/mind awareness training gives you is that you get better at letting the thoughts float away.\n\nIf you regularly find yourself deep in an undesirable internal dialogue, meditation will give you the conscious option of simply not engaging with that thought to begin with.\n\nIt's very, very useful.",
                    "score": 24,
                    "author": "Global_Mandemic"
                },
                {
                    "level": 1,
                    "comment": "Sitting and breathing. Focus on the feeling of air filling your lungs and the feeling of pushing the air out; it sounds deceptively simple but that’s all there is to it. The book Mindfulness in Plain English by Bhante Gunaratana is, in my opinion, the best introduction to meditation there is. It covers what meditation is as well as how and why to do it. Free PDFs available through a web search of the book title",
                    "score": 5,
                    "author": "SkateBear"
                },
                {
                    "level": 1,
                    "comment": "Not OP, but I think a great definition is “making space to sit silently with yourself - physical sensations, urges, thoughts, emotions, in order to increase one’s capacity for noticing the above while out in the world.”\n\nI also love one of the Buddha’s responses, when asked to describe his teachings in a single sentence: “an appropriate response.” (Caveat that Buddhism and meditation are not a complete overlap.)",
                    "score": 14,
                    "author": "senorbiloba",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I want to additionally add that sitting silently does not mean having a silent mind. It's not about trying to stop thought or have an empty head, it's about watching your thoughts and gently coming back to what ever your chosen focus is, each time you notice your mind wander.",
                            "score": 3,
                            "author": "LadderWonderful2450",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That’s exactly right. Meditation is “doing” several things, but one of the, is training he muscle of noticing that your mind is doing something different than what you intended, and reigning it back in to what you’ve chosen to focus on. Mindfulness is the opposite of mindlessness, or being on autopilot.",
                                    "score": 2,
                                    "author": "senorbiloba"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Focused Attention Meditation, Open Monitoring, and Non-Dual Meditation are all wildly different flavors. Most people mean Mindfulness, which is a type of Open Monitoring.",
                    "score": 3,
                    "author": "kmlaser84"
                },
                {
                    "level": 1,
                    "comment": "Also, big issue with people starting is thinking it's supposed to be silent. You WILL have thoughts, pouring in at first. True meditation is when they basically go in one ear and out the other. If you get stuck on one, and you will, just return back to your breathing",
                    "score": 3,
                    "author": "DeejusIsHere"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Accurate building **tiny habits** ! is very effective",
            "score": 20,
            "author": "LetKay"
        },
        {
            "level": 0,
            "comment": "There is an app called Balance, it’s really helping me with meditation",
            "score": 9,
            "author": "Substantial-Car-3209",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think this app is free for the first year then you have to pay for it.correct me I I'm wrong.",
                    "score": 3,
                    "author": "DharmaSeeker76"
                },
                {
                    "level": 1,
                    "comment": "I second this! balance has helped me finally build a consistent practice",
                    "score": 1,
                    "author": "skyebug"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Are there any guided meditations for beginners you recommend? If not, how do you suggest starting?",
            "score": 3,
            "author": "newtoday1014",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;Are there any guided meditations for beginners you recommend? If not, how do you suggest starting?\n\nThere are four major players in the meditation apps space: Calm, Headspace, Ten Percent Happier, and Waking Up.   \nI have personally used each of these to a significant degree. For those of you who haven’t, here’s a quick recap of each:  \nCalm - Calm is mainly positioned as a tool to help with reducing stress and optimizing sleep. Their main allure is the sheer amount of celebrity guided meditations they offer. Calm isn’t strictly about meditating. It is oriented towards giving tools that help with stress (white noise, sleep stories, etc), and empowers the user to explore whichever tool resonates with them.   \nHeadspace - Headspace is a well known mindfulness and mediation app built by Andy Puddicombe who was inspired by his journey to the Himalayas to study meditation. The app has a very fun, coherent aesthetic and offers a wide variety of content. Curation and delivery of meditation is its strength. Diving deeper into the practice seems less emphasized, perhaps because the app is trying to appeal to everyone.    \nTen Percent Happier - Ten Percent Happier begins to scratch the surface on going beyond simple de-stressing. Dan Harris, the founder of Ten Percent Happier, started a meditation practice after having an on-air panic attack as a journalist in the early 2000s. The app promotes not only meditations and mindfulness activities, but also talks and videos that support the user’s journey in reframing their perception of reality.   \nWaking Up - With Sam Harris’ Waking Up there is certainly a deep emphasis on meditation, but its clear that selflessness and reshaping one’s mind is also a core purpose of the app. In addition, there is a depth of quality talks that are above and beyond other value propositions. Finally, 10% of money Waking Up makes goes to charity. As far as I can tell, this is not something any of the other competitors do.    \nAccording to Sensor Tower, Waking Up is by far the best at retaining its users. Looking at Day 90 retention, which is the percentage of users who come back to the app 90 days after first trying it, we see that Calm retains nearly 2% of users, Headspace nearly 3% of users, and Ten Percent Happier nearly 3.5% of users. Meanwhile, Waking Up is at nearly 6%. This means that Waking Up retains users at a 2-3X rate of it’s competitors. This is a huge delta. Retention is strong proxy for user satisfaction, as no one engages with a product that they do not enjoy nor get value from. Waking Up is doing something different.   \nWhy is Waking Up retaining better?  \nWaking Up appears to be the most powerful laser beam mindfulness learning tool on the market. Why is that? This is where we have to venture into subjective-land. A land of hypotheses rather than finite conclusions.   \nHere are a few hypotheses as to why Waking Up retains its users better than its competitors:   \nMore Depth, Less Repetitive - There’s a sheer volume and variety of content that doesn’t exist elsewhere. This includes talks, conversations, and exercises by Sam but also other great teachers, including over 100 from Alan Watts alone. There’s various meditation and mindfulness styles to explore from a multitude of teachers.  \nSuperior Onboarding - The onboarding progressively teaches you different ways of thinking about yourself and the world. The first 30 days is basically a course, and I would say, subjectively, that it has immense value in and of itself. I’ve repeated Waking Up’s onboarding 3 times now.  \nCommunity Feeling - They do novel, engaging things to foster community. One example is Waking Up’s \"100 days of giving\" where they commit to giving away a million dollars to charity and the way they're distributing it is by randomly selecting one user each day to choose a charity (from a pre-approved list) to receive $10,000. Having a sense of community is a strong driver of long term retention.   \nDeeper Spiritual &amp; Intellectual Tinge - Sam is promoting a different relationship with reality that has a more spiritual and intellectual bend. The other apps seem more about relaxing than about having a deeper experience. Waking Up is more concerned with guiding you toward the \"truth\" of experience. In a way, it treats the user much more like an adult seeking ongoing development. Additionally, I believe Sam’s approach helps our intellectual minds wrap around the mechanics of meditating and mindfulness in a way that other apps don’t. This can be key to establishing a meditation habit.   \nEastern Approach - Calm and Headspace align more with the western take on mindfulness as a tool for destressing and achieving a more peaceful less reactive mental state. Waking Up is a lot closer to the source of this practice which finds its roots in Eastern traditions, particularly some Buddhist schools of thought but not exclusively. It’s more about self-inquiry and exploring the true nature of being. Waking up puts a lot more emphasis on the philosophy behind things, Sam is a big proponent that meditation isn't just a tool for stress relief of anxiety reduction but a means of deep insight.  \nMeditation is a very personal experience so it’s hard to say which of these offerings will resonate with you. If you some of these thoughts and insights resonate with you, I would suggest trying Waking Up.\n\nNote: This is a snippet of an article I've been working on, catered to your question, in case anyone was interested.",
                    "score": 9,
                    "author": "Magic_Gyrodog",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Your analysis of these apps is super insightful! Thanks!",
                            "score": 5,
                            "author": "HumbleBumble0"
                        },
                        {
                            "level": 2,
                            "comment": "So helpful, thank you!",
                            "score": 2,
                            "author": "newtoday1014"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Download insight timer.",
                    "score": 3,
                    "author": "tritium3",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yep insight timer has a ton of free guided meditations. If you end up paying (I used to), then I absolutely recommend David Ji. The man took my meditation to the next level. I don’t use guided meditation anymore, but if I had to recommend anyone it would be him.",
                            "score": 4,
                            "author": "JustGresh"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "How many reps do you get?",
            "score": 2,
            "author": "anon3451",
            "replies": [
                {
                    "level": 1,
                    "comment": "In 10 minutes probably 70 reps",
                    "score": 3,
                    "author": "Happiness-College"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I got tinnitus man, makes it hard.",
            "score": 2,
            "author": "DefiledTarnished",
            "replies": [
                {
                    "level": 1,
                    "comment": "Focus on the tinnitus",
                    "score": 2,
                    "author": "Happiness-College"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I can't mediatate using Breathing.  When I was a little girl, ny Dad kept telling me to,\"L look at my yeye ball because there is something in it\".  It reminded me of a Horror movie. Every  time i think about or see something that has to do with anatomy, such as Breathing, it makes me sick to my stomach. I keep seeing Dad's Eve ball. I know, I'm not six years old, but I have a real phobia.",
            "score": 2,
            "author": "Broad-World-7795",
            "replies": [
                {
                    "level": 1,
                    "comment": "You don't have to meditate using your breathing. Try focusing on the sounds in the background, or an item in your hand. Anything really!",
                    "score": 4,
                    "author": "Docota1117"
                },
                {
                    "level": 1,
                    "comment": "&gt;Broad-World-7795\n\nwhat is a yeye ball",
                    "score": 2,
                    "author": "shotplacement"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is the Calm app worth it?",
            "score": 1,
            "author": "AlbumSixForever",
            "replies": [
                {
                    "level": 1,
                    "comment": "I prefer headspace, and if you want an app on your phone that’s convenient with tons of meditations, reminders, and multiple speakers to choose who you listen to, I think so yeah. Plus it’s less than $100 a year if u pay annually. I use it on average a few times a week, on stressful weeks I’ll use it daily. \n\nEvery once in a while, I’ll still got to YouTube for a specific mediation but headspace is my go-to!",
                    "score": 2,
                    "author": "Low-Conversation3535"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What kind of meditation do you do?",
            "score": 1,
            "author": "hindercloth",
            "replies": [
                {
                    "level": 1,
                    "comment": "Is that not what he explains at the end?",
                    "score": 3,
                    "author": "bolieves",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hey!  Some of us with ADHD skipped the end and came straight to the comments, okay?!",
                            "score": 9,
                            "author": "Long_Educational",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Lol I didn’t read it either 😂 but I read her comment first , scanned , and saw the answer to hers",
                                    "score": 2,
                                    "author": "bolieves"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would hit a wall trying to not control my breathing.",
            "score": 1,
            "author": "shafdaddy"
        },
        {
            "level": 0,
            "comment": "Thanks for this bro. Gonna implement this tonight!!!🔥🔥🔥",
            "score": 1,
            "author": "BecomeMoreNate"
        },
        {
            "level": 0,
            "comment": "Always try &amp; fail. But I think I can start with 2 minutes! Great suggestion!",
            "score": 1,
            "author": "netsilinreverse"
        },
        {
            "level": 0,
            "comment": "One of the good thing that made me accountable is finding the person that you can share your progress and talk about the stuff together.",
            "score": 1,
            "author": "kaikulapp"
        },
        {
            "level": 0,
            "comment": "I’m going to try this. Thank you for sharing your experience and some tips on how to make it a habit 😊",
            "score": 1,
            "author": "LiftingPoppet"
        },
        {
            "level": 0,
            "comment": "Lately I do a reflective journal entry right after meditation.  I try to recall how many of those \"snap back to reality\" moments I have.  It's crazy how distracted the mind can get on its own.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Oh Crap, for a moment I read that as Medication.",
            "score": 1,
            "author": "benswami"
        },
        {
            "level": 0,
            "comment": "That's actually a really practical way to apply meditation techniques to self control.",
            "score": 1,
            "author": "YpsitheFlintsider"
        },
        {
            "level": 0,
            "comment": "I recommend the app Headspace to learn how to meditate.",
            "score": 1,
            "author": "hydrated_purple"
        },
        {
            "level": 0,
            "comment": "Guided meditation videos of Declutter The Mind help me the most.",
            "score": 1,
            "author": "okthatisenough123"
        },
        {
            "level": 0,
            "comment": "thanks for your insights!",
            "score": 1,
            "author": "Quiet_Data3644"
        },
        {
            "level": 0,
            "comment": "I don't see how can this help to build confidence?",
            "score": 1,
            "author": "NeverLetMeGoo",
            "replies": [
                {
                    "level": 1,
                    "comment": "It'll help you examine your mind more closely and why you aren't confident. And why that why doesn't make sense",
                    "score": 1,
                    "author": "LowHangingFrootLoop"
                }
            ]
        },
        {
            "level": 0,
            "comment": "HAve you try the Gateway Experience (Hemi Sync).  I started recently and find it quite interesting....",
            "score": 1,
            "author": "Donka1"
        },
        {
            "level": 0,
            "comment": "I love the way you wrote this!",
            "score": 1,
            "author": "starrywinecup"
        },
        {
            "level": 0,
            "comment": "Do you have any sources to help people get started who are interested?",
            "score": 1,
            "author": "Si2ationCriticl",
            "replies": [
                {
                    "level": 1,
                    "comment": "I highly recommend the Waking Up app by Sam harris\n\nGreat guided meditations, great philosophical discussions, and he goes into insights you can get from meditation that may not come to you without being pointed out\n\nYou can get it free by googling \"Waking up scholarship\"",
                    "score": 2,
                    "author": "LowHangingFrootLoop",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you will for sure check it out.",
                            "score": 1,
                            "author": "Si2ationCriticl"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "So you're basically getting your brain in the habit of refocusing.",
            "score": 1,
            "author": "HaasTheMarques",
            "replies": [
                {
                    "level": 1,
                    "comment": "More or less yeah!",
                    "score": 2,
                    "author": "Happiness-College"
                }
            ]
        },
        {
            "level": 0,
            "comment": "meditation is great for lots of people. i'm not against it and i'm glad you find it helpful. but it's nothing like a magical \"self-control pill\" because you need self control to do it all, let alone regularly -- it's probably more like regular meditation can improve self-control because it is a way to practice self-control.\nALSO -- and this is big -- it isn't for everyone and it can mess you up.\nwhy would anyone assume that ANYTHING is going to be good for literally everybody? especially something that can have powerful results? \nif you're trying meditation in any form and you feel like it's really fucking you up, just stop. maybe try it again in a safe space with experienced practitioner of whatever sort(s) of meditation you are interested in. most people will probably be fine just doing home meditation or whatever but everyone should know it's totally OK if you find that it's not for you.",
            "score": 1,
            "author": "redzinga"
        },
        {
            "level": 0,
            "comment": "In meditation you exercise the mental strength to be mindful, but yet there is no talk about how to actually use mindfulness is everyday situations. Its almost like learning how to fly a plane but still only use autopilot in practice.\n\nIt would be much more efficient if we developed the wisdom regarding how to utilize mindfulness in daily life, and then exercising it will come natural, as we do not create an artificial situation where we focus on for example breath, but where we can both use and exercise it in everyday life.",
            "score": 1,
            "author": "Dhplaz"
        },
        {
            "level": 0,
            "comment": "Saw this post 2 days ago. And just Wow! Thanks for the eye-opening JOLT, I didn't know I needed!! I thought mediation was supposed to be guided and the goal was to fall asleep!? So I hated it. Bcuz it didn't \"motivate\" me  😂",
            "score": 1,
            "author": "Michellenjon_2010"
        }
    ]
}