{
    "id": "143w5s2",
    "score": 11,
    "title": "I make good first impressions with people, but after getting to know them a bit more I get weird and awkward, worrying about what they think about me, then get insecure and push them away. This has led me to not having any friends now........what can I do???",
    "author": "eBhardy",
    "date": 1686189796.0,
    "url": "https://www.reddit.com/r/selfimprovement/comments/143w5s2",
    "media_urls": [],
    "other_urls": [],
    "postText": "I believe that I'm a good person and really fun to hang out with at first. But after a while I get so concious and weird..... especially when I'm with a group of people. The anxiety takes over and I'm just not me.\nThis has been happening for quite a while now and I've made no friends because of this. I just tend to be left out of group plans, and people don't talk to me anymore. \nI really wanna change this because this isn't me! But I'm unable to.Once insecurity/anxiety takes over, i can't make conversations with them and just push the everyone away.\n\nI wanna be the old me again.",
    "comments": [
        {
            "level": 0,
            "comment": "Have you considered that your response might come off as disinterest to other people? It could be possible that the reason you aren’t invited is not because they don’t want to hang out with you but because they think you don’t want to hang out around them. \n\nIt’s possible to get ahead of this by mentioning in an authentic way the sentiment you said here, you have trouble when around other people because you get anxious about their perceptions. \n\nIn a way this is a kind of “selfish projection”. You think about how others see you so often you might have the false understanding that everything thinks about others this much, particularly you. As you can see your views on others only focuses on how others see you, why wouldn’t others be thinking the same thing? \n\nI’d offer that a conversation doesn’t have to be done with words. One thing you might consider is putting a retainer in your mouth and saying you can’t talk with it, from there you can focus on just being with other people. \n\nSteer into the skid. Your anxiety is likely trying to avoid people disliking you but have you ever thought that you actually don’t want to hang out with people who dislike you? \n\nWhat are you making their actions mean? No one had to invite you to stuff so when someone does it is special but someone not inviting you doesn’t make you less special. \n\n“The phone works two ways”, how about you invite people you want to hang with out to eat or to watch a movie. If they aren’t free then ask when they might be.  There are times where both people want to see one another but there are other things going on, it’s not automatically that they dislike you. \n\nThe “like” “dislike” view is too simplistic. Think about your own family, you love them but there are times you do and don’t want to be around them, other people are no different. Often times the reasons we don’t want to be around other people are because we have hang ups, not because of the other person. It’s pretty rare everyone dislikes the same person unless they took an action that was “way out of line” and being awkward is just a quirk. \n\nAlso, “talking to people” is easy when all you do is ask questions. Your focus is so much on yourself and how you’re being seen you might not be curious about the person that’s in front of you and their life. It’s as simple as asking do you want to talk to someone who’s self absorbed? Probably not, you likely want someone who’s curious about you. \n\nYou can do a lot as well like try to practice by working in your friendships with people through text and calls instead. That might give you comfort with some distance. Therapy might also help too.",
            "score": 3,
            "author": "TemperWearyMember"
        },
        {
            "level": 0,
            "comment": "I have this same problem. For me I think it’s because once I make a good impression I have pressure to recreate the same good impression again. So I’m afraid to act in a way that would possibly have people not like me. I think realizing that I have no control over peoples feelings towards me and wanting to be authentic rather than seeking outcomes helps. But also putting less meaning or worth in peoples opinions of me.",
            "score": 3,
            "author": "DJ_Jonga"
        }
    ]
}