{
    "id": "1448pd3",
    "score": 2,
    "title": "Why you should adopt a radical long-term perspective",
    "author": "source_of_wisdom",
    "date": 1686229341.0,
    "url": "https://www.reddit.com/r/selfimprovement/comments/1448pd3",
    "media_urls": [
        "https://www.reddit.com/r/selfimprovement/comments/1448pd3/why_you_should_adopt_a_radical_longterm/"
    ],
    "other_urls": [
        "https://en.wikipedia.org/wiki/Stanford_marshmallow_experiment),"
    ],
    "postText": "*Imagine that you are planting a seed every day. Also every day, you are harvesting the seed you planted a week ago. As it has only been growing for a week, it's not very large. You survive, but life is hard.*\n\n*Imagine instead that you harvest the seeds that you planted a month ago. You are still doing the same work, planting and harvesting every day. But the amount you harvest is larger. Your life is more pleasant and you have the ability to achieve more things.*\n\n*Imagine if your seeds grow for a full year...*\n\n---\n\nThis is a philosophy I've come up with recently that I find can be applied to many things in life. Let's take one more example:\n\nIn the famous [Marshmallow test](https://en.wikipedia.org/wiki/Stanford_marshmallow_experiment), children were given a choice between getting one marshmallow to eat directly, or wait 15 minutes and get two marshmallows. The children who were able to delay the reward did better later in life.\n\nImagine if you were given this choice every day. One marshmallow now, or two marshmallows tomorrow. If you always choose tomorrow, you will also be every day getting the two marshmallows you waited for since yesterday. The choice then effectively becomes getting one marshmallow every day, or getting two every day but skip the first day.\n\n**If you *always* make long-term decisions, you will also be always getting the value of your past long-term decisions.**\n\nThis is the steady state you want to achieve. In this state, life is more pleasant and feels effortless. Waiting months for something you have planned is no longer hard, rather enjoyable. Because during that time you will fulfil earlier plans. Making long-term decisions has become the natural thing to do, it now rewards you also in the short term. The value in your life accumulates, be it relationships, money, health... In this moment, the \"now\" which is the only thing that exists, everything you have around you that you value is the result of your previous actions. Optimize this for your future self that you will soon become.\n\nHow do you wish you had planned 5 years ago? Do that planning now. Are you stuck in a life situation that you are not happy with? Start working towards changing it. Are you stressed about something in life? Something you ought to do? Sort it out now so it stops occupying your thoughts, don't wait. What do you wish you had done yesterday? Do it today, otherwise you will feel the same tomorrow. Do you have unwashed dishes lying in the kitchen? Go and wash them now, you need to do it anyways so do it early to feel better in your clean home. Cook food before you are too hungry.\n\nI hope you can find areas in your life where this is applicable. Treat yourself occasionally, that is also good in the long term.",
    "comments": [
        {
            "level": 0,
            "comment": "I agree with you and thank you for wording it in a great way. I think I stop my long term plans because isolation makes me depressed and low energy. There does have to be a reliable supply of some type of instant gratification or there's not a positive feedback loop that encourages me and says I'm going in the right direction, keep doing what I'm doing long term. I don't know how to manage and be flexible with my supplies of encouragement and positive feedback",
            "score": 2,
            "author": "HumbleBumble0"
        }
    ]
}