{
    "id": "144udls",
    "score": 14,
    "title": "Anybody ever just disappear from the world for a while to work o ln yourselves?",
    "author": "Chill_Kramer",
    "date": 1686282522.0,
    "url": "https://www.reddit.com/r/selfimprovement/comments/144udls",
    "media_urls": [],
    "other_urls": [],
    "postText": "Title.",
    "comments": [
        {
            "level": 0,
            "comment": "I totally get that feeling but sadly life has responsibilities. The best we can do is slowly add in working on ourselves until we completely change for the better \n\nHang in there, you're going to keep improving",
            "score": 10,
            "author": "Quillbert",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks!\n\nI was mainly talking about social situations, like making plans and hanging out with friends.",
                    "score": 2,
                    "author": "Chill_Kramer"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yes, fully. And I emerged two years later and started my own personal development practice. That would have never happened if I didn't take the time I needed to figure things out. Sometimes going into hermit mode allows us to hear our own voice for the first time.",
            "score": 3,
            "author": "ArtFlorentyna"
        },
        {
            "level": 0,
            "comment": "Yea. Deleted a bunch of social media, cut people off, moved 2000 miles away, etc. Best decision ever. Like a literal reset.",
            "score": 4,
            "author": "BotoxWalrus"
        },
        {
            "level": 0,
            "comment": "I literally told all my closest friends and relatives that I was going on a technology cleanse for a specified period of time and if they don't hear from me then that's why.\n\nI think people reached out to me more. They understood the situation - they didn't think I was depressed or something. They just.... didn't \"care\" enough to not talk to me lol.\n\nBasically if you're gonna work on yourself be ok with turning off your electronics or ignoring them. That was my takeaway 😂😂",
            "score": 3,
            "author": "RedditUsrnamesRweird"
        },
        {
            "level": 0,
            "comment": "Walkabout",
            "score": 3,
            "author": "Minute-Mortgage-4259"
        },
        {
            "level": 0,
            "comment": "I'm doing it now.. 3 months traveling in my van rv.. exploring the east coast",
            "score": 2,
            "author": "BodhingJay"
        },
        {
            "level": 0,
            "comment": "Always. I'm usually preoccupied with self-improvement, up to the point many people wonder how I vanished off my socials when communication is mainly based on it nowadays.",
            "score": 2,
            "author": "Baltic_Moon"
        },
        {
            "level": 0,
            "comment": "Yes, absolutely! But I didn't go willingly. I needed to experience debilitating depression, anxiety , panic attacks, and burnout before I let myself take the time I needed to heal old wounds and forge a new path forward. Ultimately, it was a transformative experience that allowed me to make a much needed pivot. I have no regrets.",
            "score": 2,
            "author": "Mind_Apex"
        }
    ]
}