{
    "id": "1457bne",
    "score": 8,
    "title": "How “self improvement” ruined my life",
    "author": "Medium_Board_4336",
    "date": 1686322280.0,
    "url": "https://www.reddit.com/r/selfimprovement/comments/1457bne",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello everyone if you got a few minutes please read my story, I’ll appreciate it. Before we start a little about myself you would probably like to know, i am 18 years old i have been training martial arts and fitness for past few years,i have ocd, never drunk or smoked, healthy lifestyle fan. So let me stop wasting your time and let’s get into the story: The last few months I was watching a lot of “self improvement” youtubers, millionaires etc.. and I’ve been applying their methods in my life such as eating healthy working out 4-5 times per week reading more books, getting more sleep, which all worked great and for sure improved the quality of my life. But one day I came across this “dopamine detox” trend which I must say didn’t work so well for me. As the days and weeks passed by I got into this trend and decided to delete mostly of my social media, very low to no screen time, just training and reading and reading and gaining knowledge, it has also inspired me to become a “ghost” which these self improvement gurus say it’s a crucial step for every masculine man to take in his life. So I stopped hanging out with friends completely(besides school), absolutely no communication with other people, to sum it up with few words, basically I took it so serious i gave my life to self improvement that led me nearly to a mental breakdown yesterday and 1 day after, here I am writing in panic, burning stomach, feeling like my whole body is shaking and shivers and that has been going on for a day now and i can not stop it no matter what I do. I’m scared I will never be the way I was before. I don’t think I’ve ever felt so nervous for no reason before. If you came all the way through here i must say thank you for taking your time and reading my story❤️",
    "comments": [
        {
            "level": 0,
            "comment": "Idk know people commit there entire life to self improvement and convert themselves into an caveman. self improvement does not mean go ghost and work on yourself (this is some BS instagram reels). Self improvement means meet new people, eat healthy, socialize more, buld strong connections, meet 1-2 times your acquaintances, love nature.\n\nWE HUMANS ARE SOCIAL ANIMALS.",
            "score": 20,
            "author": "Life_Draft2307",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ya but the problem is that a lot of conmen online say stuff like “go monkmode” and “sacrifice everything”.",
                    "score": 2,
                    "author": "James59394",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Monkmode is good for you'r inner peace but we can't live without other homo sapiens. I follow Hamza from a long period of time and he aways says make good connections and try to improve you'r social skills with other people and I think that's true because Lone wolf always dies alone.",
                            "score": 1,
                            "author": "Life_Draft2307"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You listened to people who aren’t teachers. \n\nBut now you can go beyond believing people on the internet.\n\nListen to your specific needs and understanding instead.\n\nIf you don’t like the way you feel, does taking care of yourself help?",
            "score": 7,
            "author": "spectrecho"
        },
        {
            "level": 0,
            "comment": "It's 50/50. 50% percent self care, talking to friends etc, 50 % self improvement. \n\nStop watching those YouTubers and just do whatever makes you happy",
            "score": 5,
            "author": "metalheadgamerdude"
        },
        {
            "level": 0,
            "comment": "Why do you let the ppl dictate how to live your life?",
            "score": 4,
            "author": "iiiaaa2022"
        },
        {
            "level": 0,
            "comment": "It sounds like a very all or nothing approach that led to a nervous breakdown due to the imbalance.\n\nIt sounds like you're experiencing panic attacks. Try to breathe through it. They will pass, and you will regain your balance again. This experience has the potential to move you into a better place. It will teach your discernment.\n\nYou should never allow an influencer to replace your own inner guidance system. Always go inward to check if something resonates or not first. This is your power. Even feel free to discard anything I'm saying here if all of it or parts of it don't resonate with you.",
            "score": 3,
            "author": "Hermit_Light",
            "replies": [
                {
                    "level": 1,
                    "comment": "amazing advice here. \n\nI came here to say the exact same things. \n\nDo the things you feel are good - don’t just take advice as gospel. We’re all different and different things work for us all. \n\nI’m 26, but when I was 18 - I experienced many of these confusing moments. My advice to you is to zoom out a little bit. Your life will be fine - probably great. You’re disciplined enough to be fit and healthy, you obviously have a desire to improve. In my 3rd person view - you’re way ahead of where you ‘should’ be at that age. \n\nYou got this brother. \n\n- eren",
                    "score": 2,
                    "author": "4lunar4"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hardly sounds like a ruined life. You got duped and made some mistakes. That's just part of life. Learn from it and move forward and be thankful it didn't take years to realize what happened or that the consequences weren't greater. People are going to try to mislead you your whole life for a few bucks so now you can be aware of that.",
            "score": 2,
            "author": "Sanity_LARP"
        },
        {
            "level": 0,
            "comment": "Title: how self improvement ruined my life.\n\n\nIt should be: how selective self improvement and mainly having zero balance in things ruined my life.",
            "score": 2,
            "author": "seekingnewhorizons"
        },
        {
            "level": 0,
            "comment": "Start off by distracting yourself. Sometimes thinking you’re having a mental breakdown can perpetuate anxiety and panic attacks, you are fine. Before you were obsessed with self improvement, what did you like to do? Did you enjoy watching a movie? Playing a game? Try doing something you used to enjoy, let yourself unwind and don’t allow yourself to feel guilty for it. We have dopamine receptors for a reason, to allow us to enjoy things, dopamine is not bad for you unless you turn something fun into an addiction and start to neglect other aspects of life for it. \n\nI wish I could be of more help, but please remember that self improvement is a small aspect of your life, don’t let it be the be all and end all and it shouldn’t eclipse the things you enjoy at a healthy level.",
            "score": 1,
            "author": "Tomivate"
        },
        {
            "level": 0,
            "comment": "Your first mistake was listening to YouTubers they are grifters.\n\nThere are if you could books for self improvement but those are just the basics the rest is going to be your mindset and how much you want something.\n\nIf anyone says you need to ghost the world is just insane, seem like you were doing fine just doing the basics like martial arts and such.\n\nThere's a Time when people start getting into the self-improvement where basically it's a spiraling black hole.\n\nIt starts to become an addiction and you fold deeper down the rabbit hole, the basics are fine and there's nothing wrong with improving your life.\n\nNow if they said to take a small break and see who you true friends are that would be good you want to eliminate the bad people in your life the toxic but you don't alienate the world. \n\nThat's insanity.\n\nBasically becomes a cult if you go too far a religion, just do the basics don't listen to YouTubers they are all scammers they will have a link to a seminar believe me they don't practice what they preach.\n\nStay away from YouTubers and these gurus same thing for dating and all of the garbage.\n\nNothing wrong with fundamental self-help books, but that's as far as it goes the rest is up to you and who you surround yourself with just make sure it's good people who don't try to bring you down other than that go live your life.\n\nYou seem to have a good head on your shoulders, good health, just don't fall into that trap of this promised great life if you just follow these rules it's all a scam.\n\nGood luck my friend!",
            "score": 1,
            "author": "tubepatsy"
        },
        {
            "level": 0,
            "comment": "Books are the way \n\nYoutubers are junk food",
            "score": 1,
            "author": "mothwizzard"
        },
        {
            "level": 0,
            "comment": "You are 18. Your life hasn't even started yet",
            "score": 1,
            "author": "InventedAcorn"
        },
        {
            "level": 0,
            "comment": "Self improvement didn’t ruin your life bro. What you were doing wasn’t self-improvement. Eat right, sleep a proper amount, work out, all of those things, yeah. You definitely started on the right track, but if you’re taking advice from these crazy internet weirdos who are telling you to cut off all social media and human contact (when they literally make all their money on SM), you’re doing it wrong. \n\nHumans are social creatures, and we all need hobbies and downtime. Any advice that tells you to dedicate yourself 100% to work and completing joyless tasks is wrong. Real self improvement will mean finding balance. Yes, doing more work, eating better, challenging your mind more, but it also means relaxing more and taking more time for self care, finding hobbies you love and that bring you joy, and cultivating relationships with people you care about by spending quality time with your friends and family. Any advice that isn’t telling you how to make all of these things a healthy part of your life is just bad advice. Self-improvement isn’t living like a monk, and anyone who’d try to tell you it is is a grifter. \n\nI hope you take your time to heal and come back from this, and learn to find more reputable sources of life advice in the future!",
            "score": 1,
            "author": "painteddpiixi"
        },
        {
            "level": 0,
            "comment": "I had the same problem. Just give yourself a little bit more time.\nEverything will come together eventually.",
            "score": 1,
            "author": "Prosto6400"
        },
        {
            "level": 0,
            "comment": "You didn't ruin your life, you saved it.   \n\n\nYou started going down a path you thought was good; but was bad. You know why. What are you going to do about it now?  \n\n\nThere's a character in a show called Twin Peaks called Dale Cooper. He says once every day give yourself a present. Don't plan on it, don't expect it. Just let it happen. It doesn't have to be something bad or harmful or glamorous. Just treat yourself with love.  \n\n\nEverything we do is in service of ourselves, our tribe, or our beliefs. If something doesn't serve you; abandon it. Self discipline serves you when it makes you better, but if you chastise yourself to the point of breaking it's no good.  \n\n\nIf you've been poisoned by toxic ideology what part of the ideology was the bad part? Identify it. Once you've recognized the pattern of toxic traits you can avoid spotting them again in the future. Find new beliefs that serve you better.  \n\n\nThe fact is you will never be the way you were before, you can never get back what you've lost. You can gain new things though. You haven't hit your physical or mental prime yet, and even when you do and start going downhill you can still learn new things and change yourself.",
            "score": 1,
            "author": "YoYonpa"
        }
    ]
}