{
    "id": "145iopj",
    "score": 2,
    "title": "A brief disquisition on my disquiteness",
    "author": "Entire_Objective2228",
    "date": 1686349250.0,
    "url": "https://www.reddit.com/r/selfimprovement/comments/145iopj",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello everybody. I’m unsure if this is the best place to express myself but I’ll get straight to the point \n\nI’m in my early 20’s, Anglo-Portuguese and I have aspirations of, beside a multitude of alternative gateways, aspirations of becoming an author. Not just but I’m a voracious reader too, yet, despite having consumed - between thousands of pages - a minimum of 200 books since 2020, I humbly acknowledge that I know what I don’t know (at this point in time, I intend to read at least 500 more books, as part of a personal pet project on the political, economic, sociological and religious attitude of a certain country I won’t specify. I have other ideas I wish to explore in the future). \nBeyond the thirst of knowledge, I concede of not possessing enough life experiences that can truly shape a vivid character. \n\nI’m at university, third year of political science, always opting for the resit exams because the subjects don’t interest me. Some may view this as odd since many of the books I read directly correlate to the content of the teaching material. I truly enjoy learning topics that interest me but I loathe studying; anything that doesn’t light a spark leaves me indifferent. I’m simply not motivated when I don’t like something. \n\nDespite all of this, I can’t help but feeling like an utter failure. Still living at home, the project taking forever. My parents support me but will occasionally complain it’s longevity, unintentionally making me feel even worse. I constantly worry on the prospects of finding a good job with my degree - from my understanding very few actually find something related to political science. I’m frustrated from the subject matter because what is taught is irrelevant towards a greater understanding of the real world, so I have no interest in a masters + for 23 years of age, I already feel old. \n\nBeing an author, while mentally stimulating, spiritually rewarding and perhaps even useful for my portfolio, highlighting my skills of interpretation and investigation - whilst presenting myself as dedicated individual - is not always profitable. \nIt doesn’t help that I reside in the countryside; opportunities are not necessarily scarce but the wages, by European standards, is a disgrace and many live at home into their 30’s. I want to be the exception and still leave fairly early. I cannot work in agriculture, I miss the bustling activities of living in the big city. \n\nI feel despondent, I’ve been proscrastinating this past month even with exams. I plan on finding a summer job in retail or, with luck, as a tour guide once exam season is over. But even over this I have my worries and doubts of getting. \n\nA great concern for me is the fact that I feel that my state of happiness or enjoyment (I’m not sure) takes a nosedive into the abyss once I indulge myself in things I’m not passionate about. I feel the temptations of going on adventures, of having an occupation that excites my mind  and the literary world is one of those possibilities. I’m okay with failing even with the effort I put in, just the opportunity of presenting myself to the world is stimulating. I don’t wish to look arrogant, I’m just being honest but languishing in the unknown, with a menial job frightens me, because I believe in myself and capable of doing great things. Having an independent mind and doing it my way. Maybe I’m emotionally immature and I have these bouts of doubt, anxiety and pessimism. \n\nThank you to all who decide to take the time and read this.",
    "comments": [
        {
            "level": 0,
            "comment": "[removed]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Your submission to /r/selfimprovement was automatically removed because you may not try to get around rule #2 regarding posting links, nor may you violate Rule #3 regarding self-promotion and advertising. \n\nUnfortunately, we've had to add \"DM me\" and other such solicitations of one-to-one communication to this automod condition, as many spammers were trying to use that as a way to get around our no self-promotion rule.  If you were honestly just trying to talk to OP, feel free to just repost the comment without the solicitation, and you're definitely not in trouble. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/selfimprovement) if you have any questions or concerns.*",
                    "score": 1,
                    "author": "AutoModerator",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hey admin,\n\nI’m an aspiring author too. I can relate to your problem.\n\nI’ve worked as an engineer for 3 years and I can tell you right now - it’s difficult to work in something you’re not passionate about.\n\nIt’s taken me a few years of careful self-reflection to work out a principle that’s helped me a lot - so I hope it helps you too.\n\nBasically, things that you aren’t passionate about are soul-sucking - unless you have a reason for doing them.\n\nYou need to find avenues to make your dream of an author come true, and work side-jobs to keep you afloat. Wake up early and work on your authoring career. Those side-jobs will be easy if you know your ‘why’.\n\nAlso, in the age of the internet, your geographical fit isn’t as important.\n\nLook into guys like Tim Denning, Ayodeji Awosika and Dan Koe - they built audiences online who read their work. Why can’t you? You can - I believe in you.\n\nStart writing on websites like medium - you sound like an interesting person. I’d read your work, maybe others will too.\n\n•\t⁠\n\n\nMaybe the answer isn’t so black and white. Maybe it’s to work when you need to while you build your dreams on the side.\n\nHope this helps.\n\n•\t⁠eren",
                            "score": 1,
                            "author": "4lunar4"
                        }
                    ]
                }
            ]
        }
    ]
}