{
    "id": "1462s0t",
    "score": 1,
    "title": "Let's get to it.",
    "author": "Mysterious-Carry3576",
    "date": 1686410072.0,
    "url": "https://www.reddit.com/r/selfimprovement/comments/1462s0t",
    "media_urls": [],
    "other_urls": [],
    "postText": "Lets get to it.\n\nAlright, might be a long convoluted post which will probably not be of use to any of you, I am just doing this to give myself a push.\n\nSo here is the situation, I smoked the last joint I had yesterday before bed. I deleted my dealer's contacts. Ideally this was my last.\n\nIn exactly a month, I am going on a summer camp for 3 weeks. I will be a cook there. (This is not a job, I am going with a youth mouvement that I was a part of for years, all of my best moments were there, as a kid as well as an adult). This is the last time I will ever ne able to go. I'm 25, time to move on. All of my friends there will be gone next year too.\n\nAnyway, at this summer camp, there will be this girl. Its always about a girl, she is THE girl.\n\nI have know her for 3 years now, we are not in contact much. In part because we are both very introverted people. We mostly interact on those summer camps, and we have seen each other a few times this year. However, during those camps, we are very close, (in our own very awkward and often silent way). I developed strong feelings for her last year, and although there was \"some\" reciprocity (she told me herself), she also told me she didn't have enough feelings and did not want to start something.\nShe had agreed to go on a date after the camp last year, but at the end went back on it.\n\nA few weeks ago, I invited this year's summer camp staff to my family place in the country side, they all came (including her) and stayed for 3 days. Since her and I are part of the \"staff\" (we call that the people whose job is something other than watching/entertaining the kids), we did not have much to do with the others during those days. Since it was our first prolonged interaction since the camp, the first day was kinda awkward.\nOn the second day, everything seemed to fall into place, we were close like before and spend the whole day talking just the two of us. \nThat evening we had a small party, she wore such a stunning dress I was speechless.\n\nAnyway, she is THE girl, sometimes when she talks it's like I listen to myself thinking. It's crazy.\n\nI am not an idiot, she already told me she didn't want to be with me. People usually don't their mind about this. HOWEVER, I am consciously choosing her as my motivation to do all things I will HAVE to do this coming month.\n\nThis is for a lot of reasons, some of then have to do with \"Maybe with this I will get the girl\" some of them don't. But at the end, even if I don't get the girl, which is almost certainly what will happen, all of those things I did would still have positive impacts for my life.\n\nSo what do I have to do this month ?\n\n1) NOT. SMOKE.\n\nI never smoke weed on those camps, but I do smoke cigarettes. She never judgedme on this, but I know she doesn't like it.\n\n2) Finish the software deliverable that I was asked to finish weeks ago.\n\nMy client have been very lenient with me these past weeks, were I juste smoked instead of working.\nTo finish this should be approx 10 real hours of work.\n\n3) Find a stable job for next year.\n\nFor the last two years I have hoped from different projects (I always do \"fine\" on those jobs, never put any effort, weed again). But the thing is I actually have a pretty good CV. I will just send dozens of applications around and see what happens.\n\n4) do regular sport.\n\nI actually managed to keep a clean keto diet the past 2 month (despite the weed wtf ??).\nSo I just need to add some regular weight exercises.\n\n5) Clean the fuck out of my place\n\nSelf explanatory, no one should ever know how bad it got.\n\n6) Build an animated Totem.\n\nSo I said I would build a very large, with animated wings, totem. I can't really go back on it now or I will just look like a fool.\nIt will need to be all designed, then 3d printed, with a mechanism that makes the wings expand, hidden LED lights, and small fireworks that shout out of his head. \n\n(Its not a joke, it's to animate a story for the kids)\n\nAlso maybe it will impress her and she will go out with me. (Jk). (Jk ?) It can't suck.\n\n7) All of this, while taking care of grand parent this week, and the third week of June.\n\n\nIf I can do all this, I believe I will arrive at the camp with the best state of mind and confidence I would have had in years.\n\nI know I can do all this.\n\nI. Just. Have. To. Put. In. The. Work.\n\nAnd about the girl, I am not doing all that FOR her. I know it's not likely to amount to anything, I don't think I am delusional or just obsessed (maybe a little bit obsessed) I just know there is a very slight chance of it working. She is a strong source of motivation for me to be better, if not for that, then for what ?\nI just tell myself that to give myself the best chance, then I just need to go and be confident in my look, job, and mental state. I will see how things go. \n\nIf I end up doing all those things, and she still does not want to be with me. I just hope I will recognize all those positive changes I made and continue down this path.",
    "comments": []
}