{
    "id": "1469nfb",
    "score": 13,
    "title": "How to overcome a ruined life?",
    "author": "nawa92",
    "date": 1686427428.0,
    "url": "https://www.reddit.com/r/selfimprovement/comments/1469nfb",
    "media_urls": [],
    "other_urls": [],
    "postText": "\nOver the past five or so years my life has gone to shit. I honestly feel I am cursed.\nSome of the things that have happened to me:\n1) 2019 was diagnosed with an aggressive form of cancer\n2) 2020 started developing chronic pain that is still there\n3) 2021 started developing crippling chronic fatigue\n4) 2022 took the vaccine and was seriously ill and unable to move for 2 months\n5) 2023 just found out my wife’s visa was denied\n\nThere is no way to explain all this and it seems to happen every year. I’m very scared, I had a good life before all this! The last one hurts alot cuse I was planning to have a life with my wife here and now I’m just alone. \n\nMy days are now spent just Bing watching YouTube videos/videogames and sometimes crying as to why it all happened to me. When someone says to apply for my wife again or to start working I feel like what’s the point, since life doesn’t want me to be happy, so why try. Some other shit is probably gonna happen, I try to numb the pain with tv, so that I am not thinking about my pathetic life. I just stay in my room all day!\n\nSometimes I feel a bit positive and start doing stuff that is productive but then I relapse when someone asks me if I applied for my wife again or of my pain flares up! Next thing I know I’m in bed crying, thinking why it all happened to me. Please, what do I do! I need help!",
    "comments": [
        {
            "level": 0,
            "comment": "I am there with you. The hits don’t stop coming. Honestly I’ve just tried doing things I’d never do before cuz I’m in the mindset of “truly it couldn’t get worse, what do I have to lose?” It got me to finally go back to work after a year and a half",
            "score": 6,
            "author": "engineeringisamyth"
        },
        {
            "level": 0,
            "comment": "Same thing with me. It's been years since I felt something positive. Deep down I just want to give all my savings to my little sister and then off myself.",
            "score": 2,
            "author": "toguraum"
        },
        {
            "level": 0,
            "comment": "Id say we could make a club if I wasn't so depressed into inaction.  Whatever, someone else apparently decided I should die, so I'm not mad about it.  Not like I'm the one who did anything wrong.",
            "score": 2,
            "author": "ChapterSpecial6920"
        },
        {
            "level": 0,
            "comment": "What country does the wife live in? Maybe go there?",
            "score": 2,
            "author": "BoppyBoy"
        },
        {
            "level": 0,
            "comment": "to be as blunt as possible:\n\n&gt;There is no way to explain all this\n\nYes, exactly that. The only thing permanent in life is change. Nothing stays the same whether its good or bad. There is absolutely no explanation for the belt of bad happenings that have plagued the last half decade of your life, just as there would be no explanation for if you were to have an abundance of good fortune for the next 40 years of your life. There is no thing called life deciding you shouldn't be happy. There is no trap set for when you next try to knock you back down again.\n\nThe only thing separating someone in an identical (or worse even) situation who might feel optimistic about whats coming up for them and you who feels you have a ruined life with no feasible turnaround in sight is hope. Now not to say \"just have some hope bro\" but\n\n&gt;Please, What do i do! I need help!\n\nYou need to foster some sort of hope for the things you have yet to come, somehow. Because that looks like the only thing youre lacking. After all you're fighting aggressive cancer, chronic fatigue and an abundance of other things that seem to getting in your way - yet you still have your sparks of wanting to be positive and get back up. Drill into your mind that there is no grand game at play that is deciding bad things or good things to happen to you, only things. That your fear of something new being immediately bad is stopping you from experiencing something new that's actually good. From there hopefully you can see every new opportunity not as something \"cursed\" but as something new for you completely exclusive from any other bad thing that has happened to you before. Hopefully with the constant affirmation that there is no \"some other shit\" looming you can maintain your positive upwind into feeling released from this chain of bad events. Doesn't mean everything will be good, but it's all you have. So go and try your heart out lol, because why not? No matter how grave a situation this is the final rationalization I feel like we will all come to after we grief over what we've lost whether it's time, opportunity or someone.\n\n**At the end of all of this your only real \"negative\" that** ***you*** **control in this situation is your outlook.**",
            "score": 3,
            "author": "KyronXLK"
        },
        {
            "level": 0,
            "comment": "Well life has no consciousness to forbid you from being happy so realizing that would be the first step. I kind of know what you may feel because I also have multiple tumors - brain, parathyroid etc., many operations behind me, some failed so I await new tries. Can't have kids, don't have a wife or girlfriend at all. Head and lower body joints hurt all the time, eyesight gets worse every day. Have virtually no stamina to do anything. What do I do? Focus on work and after work just do whatever the f I want. Stoic while working, hedonistic in free time, so video games, fast food etc You must help your wife. Health is fragile and once you lose it's awful. But that can't stop you from fighting. Au contraire. You must fight to stay afloat. Don't give up just yet. Health you can't do nothing. I just sit there and take it whatever the doctors tell me with a straight face - in a stoic manner. You can't be mad because of things you have no control over. No control - why bother with it? On the other hand if there is a problem in which you can act upon you should. Why cry, when I can actually do something about it? Pretty flawless logic. Apply for your wife's visa again. Can you do it? Yes? Roll up your sleeves and do it. I keep my fingers crossed for you.",
            "score": 1,
            "author": "Randomowe_Konto",
            "replies": [
                {
                    "level": 1,
                    "comment": "👆🏻This. It’s time for you to grow.",
                    "score": 1,
                    "author": "Ikem32"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey, it’s gonna be okay. \nSometimes life gets really rough and I’m sorry to hear about your health and your wife. You’ve got this. You’ve made it so far, you didn’t come this far for nothing. You are an incredible human being and you’ve got this",
            "score": 1,
            "author": "hxneysnax"
        },
        {
            "level": 0,
            "comment": "Anyone catch the subtle jab at the jab?",
            "score": 1,
            "author": "LaurieIsNotHisSister"
        },
        {
            "level": 0,
            "comment": "*placeholder for future comment*",
            "score": 1,
            "author": "ChasingYesterday97"
        },
        {
            "level": 0,
            "comment": "I have no idea \n\nI’m sorry bro",
            "score": 0,
            "author": "Unlikely-Fish237"
        },
        {
            "level": 0,
            "comment": "My life fell apart starting with the lockdowns and i've given up all hope of getting it back together, i was trying to, but then i get stomach problems out of nowhere and i've just given up, i haven't enjoyed life for a good few years now.",
            "score": 0,
            "author": "NoCommunication7"
        }
    ]
}