{
    "id": "146c9bm",
    "score": 12,
    "title": "How to stop lying so much?",
    "author": "Acceptable_Twist_353",
    "date": 1686434023.0,
    "url": "https://www.reddit.com/r/selfimprovement/comments/146c9bm",
    "media_urls": [],
    "other_urls": [],
    "postText": "I can't stop lying.",
    "comments": [
        {
            "level": 0,
            "comment": "Compulsive liars seem to be not very good at it. If you lie all the time you're bound to make a mistake and then when you have a reputation for it everyone starts checking everything you say and laughing together at the recent fib. Then that gets old and while entertaining it becomes pathetic and weird and you end up alone.\n\nSo basically, stop because everyone knows and it's making everyone feel awkward.",
            "score": 6,
            "author": "Sanity_LARP"
        },
        {
            "level": 0,
            "comment": "What do you lie about?",
            "score": 6,
            "author": "sobezombie",
            "replies": [
                {
                    "level": 1,
                    "comment": "Actions, feelings, plans, opinions and relationships.",
                    "score": 8,
                    "author": "Acceptable_Twist_353",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It might feel comforting to tell people lies to put them and yourself at ease thinking things are better than they really are, but you will ultimately feel the most relief when you can confront reality and begin taking steps at actually improving these aspects of your life. It takes courage to decide to tell the truth, and when you do, it will be the single greatest thing you will ever do for yourself.",
                            "score": 11,
                            "author": "sobezombie"
                        },
                        {
                            "level": 2,
                            "comment": "The lie detector determined you are telling the truth",
                            "score": 1,
                            "author": "50M3GUY"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The best thing to do is just stop… that sounds overly simplistic, but next time you’re about to tell a lie try to stop yourself and either say something true or maybe avoid saying anything at all.\n\nIt can be tough if everyone in your social circle only knows the “liar you” instead of the real you. I had this problem when I was younger. I hated it… but I decided it wasn’t worth it living like that so I had to change.\n\nI want to give better advice but almost everyone in my life now only knows the “post-lies me”. I basically started a new life, with new people and a new me… I’m finding it hard to articulate anything you might find helpful I’m sorry. You just have to try to stop bringing more lies into the world if you can. You can do it dude… life is better being the real you ❤️",
            "score": 5,
            "author": "blacktickle",
            "replies": [
                {
                    "level": 1,
                    "comment": "I confess I'm curious... \n \nwhy did you feel the need to lie? If you could share (Is it bc you had Low self esteem? ...You wanted to present others a \"polished image\" of yourself? )\n(I had a friend that told everyone he was an entrepreneur.  He was just unemployed. He was depressed as f*ck and couldn't cope with it).\n\nIt's Amazing that you decided to change like that. Kudos!\n\nI'm the opposite I don't lie much but not bc I'm virtuous... just bc it's too much work to remember everything.  And I'm terrible at remembering details. Lol!",
                    "score": 5,
                    "author": "Ambitious_Dish3516",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It was a mix of things\n\n\\- extremely low self esteem\n\n\\- I felt completely unloveable and like the most boring/uninteresting person alive\n\n\\- I felt starved for attention\n\n\\- desperate for praise/validation\n\n&amp;#x200B;\n\nI grew up with two addict parents, my dad was abusive mentally/physically and a mean drunk/other drugs. I never felt safe, I was afraid of my dad, I didn't get much love or affection from my parents, the main thing I remember about my childhood was that I just felt like the biggest piece of shit on earth.\n\nWithout getting into it too much I'll just say I had extremely low self esteem and just wanted to feel loved and accepted but I was given the message that I was not worth anything. So I felt (at that time) my only option was to hide myself and make things up to seem more interesting. This is the short version LOL there's more to it but that's basically what it boils down to.\n\nAlso I was very depressed. Like your friend I did not know how to cope and wanted to appear like I had my shit together even though I was completely falling apart. Too proud or stubborn or afraid to ask for help. I made so many terrible choices when I was on that path and have many regrets... but I'm ok now :)\n\nIt was a hard road for me for sure but I ended up moving a couple of times and the last major move (from NYC to Denver) I just said fuck it with the bullshit and decided to just not make any more shit up!! END RANT",
                            "score": 5,
                            "author": "blacktickle",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Duuuude you are a savage!  That's one hell of a story.\nI got teary eyed. And I'm not using figurative speech.\n\nI'm glad you are ok now!\nStay strong king!",
                                    "score": 3,
                                    "author": "Ambitious_Dish3516"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey there !! I hope your day is going well :D \n So i even struggled with lying all my life til recently ( 25m). Up until last year, I been lying about every little detail, even things I didn't need to lie about.\n I would still go ahead and lie about compulsively, and boy, I am here as your warning. \n\nIf you don't stop lying, you lose everything that you might hold dear to you. In my case, I lost every friend I had, lost the love of my life, lost the respect of my family, and most importantly, i lost sense of myself due to lying. I had to start from scratch, and that alone was very challenging, and I wouldn't wish it for my worst enemy. Lying is a nasty trait that can lead you to loads of other horrible traits like cheating or stealing or even worse. \n\nWhat worked for me was loss, I lost someone who I consider to be the love of my love, and that incident was eye-opening. I couldn't stop lying ,I just couldn't stop spewing a lie after another. I was given wayyyy too many chances to be honest, come clear, and stop lying, but i would stop for a week and then find myself lying unconsciously the next.\n\nMy best advice and what helped me was therapy. Am not sure if you can afford therapy or not, but what therapy helped me understand was why I was lying ( which, in my case, is childhood trauma and sleeping validation) and gave me a better understanding of myself.  Building a better understanding of yourself, I think, would be key to stop lying since you would understand the root cause of your lying. \n\nAm happy to say that I stopped lying for more than a year and more than happy that I did !! My friendships are genuine, and my relationship with myself is more honest and clear. I hope you feel the peace that comes with honesty, dude ❤️. SORRY FOR TAKING SO LONG THIS WAS TOO PERONSAL TO ME LMAO.",
            "score": 3,
            "author": "biploarAstro"
        },
        {
            "level": 0,
            "comment": "I used to be a habitual liar. I catch myself still making sure that I’m telling the truth in a lot of situations even now at 33, and I have been conditioning myself to stop since I was a teenager. Saying that, there is hope!\n\nSomething I learned that really helped me is that habitual lying is a trauma response. Whether you realize it or not, lying is a way to either hide something traumatic going on in your life or a way to try and make a shitty situation better. Mine was a combination of the two. Being raised in a house with constant emotional and verbal abuse, gaslighting, manipulation,  etc… And yet on the surface we seemed like a happy family that had it all together. I also had undiagnosed ADHD until I was 30 so there is trauma that also comes from having to mask in order to survive and after a while not being able to tell the difference between lying and masking.\n\nI was fortunate that I had great friends. They were all also pretty traumatized, neurodivergent, and understanding of what I was going through. But being around them and just realizing that my lying could hurt them made me want to change so I started being honest about stuff. \n\nI would catch myself in conversations at first starting to lie and I would, out loud, say, “Wait, that’s not true” or “That’s not how it happened”. And then, no matter how hard it was to say, even if I stuttered and felt like I might die, I said the truth. Over time it got easier and easier.\n\nIt takes practice. A lot of practice. And it’s not going to change things overnight. However, in the long run, I’m glad that I made the decision to try and be better. There will be up days and down days and sooooo much guilt and self doubt and self torture…. But after it becomes habit to be honest it becomes easier and easier. \n\nThe only thing I can really equate it to is quitting smoking or drinking (which I have done for both). The comfort that lying gives you is an addiction and a habit just like anything else you hold on to that does not serve you in the long run. If your future self would not be proud of your actions, or even regret having done those things, then maybe that means you shouldn’t be doing it.\n\nBest of luck to you. I know you can do it. Just recognizing that you need to change is the first step, and from here on out it’s just a bunch of hard work and toooooons of reward 🙏🏻",
            "score": 2,
            "author": "Charming-Surround525"
        },
        {
            "level": 0,
            "comment": "It’s tough to stop. I don’t doubt that you get a rush from it. It’s an addiction in many cases, but it’s commendable that you want to take the steps to stop. \n\nWhen you are about to say something untruthful, try to take a moment to ask yourself what the future consequences of the lie could be. How would it affect the person you’re lying to if they found out? If you can, redirect yourself to the truth. \n\nIf you cannot help but lie, a good thing to do is try and come clean after you do. Sometimes, it can be tough to flat out tell someone that you lied to them. It may be easier to start with something like, “I got the story wrong, this is actually what happened.” \n\nWishing you all the best. :)",
            "score": 1,
            "author": "Objective_Ad_4098"
        }
    ]
}