{
    "id": "146ep37",
    "score": 1,
    "title": "I hate myself and need help",
    "author": "I_think_ImConcussed",
    "date": 1686440427.0,
    "url": "https://www.reddit.com/r/selfimprovement/comments/146ep37",
    "media_urls": [],
    "other_urls": [],
    "postText": "\nI can't do anything right for anyone, my mom hates me for it, my dad is disappointed, my siblings think they handle everything when I'm the one holding sht together. The minute I leave the house is in shambles and there's sht everywhere, dishes stacked to the ceiling messes everywhere, no spot to sit and it looks like an episode of Hoarders. My mom is borderline mentally abusive but no one believes me, they all think I'm blowing things out of proportion and I'm just a sad rebellious teenager who needs to suck it up. But I'm not. I'm different, I want to do better, I want to be there, I want to help, I want to do sht right! But no one ever sees my trying. No one gives a fck about me. I walk passed my family with tears down my fcking face, fists clenched, wanting to die but no one gives a single fck. I try to tell my mom something important and she doesn't give a f*ck, she doesn't care, I'm just a stupid teenager. I don't have feelings, I don't know anything. I hate myself bc I'm weak, I can't control my emotions, I cry all the time, I yell at everyone, nothings right that I do, I just hate it.\n\nIdk... What do I do?",
    "comments": [
        {
            "level": 0,
            "comment": "Therapy helps. \n\n&gt; CBT from therapy identifies, challenges, and replaces the beliefs and assumptions you manifest with, ideally healthy accuracies.\n\n&gt; You don’t feel good but is it because you are being extremely hard and unfair on yourself?\n\n&gt; Nobody really taught me to take care of myself, more like, other people’s complex imaginary ideas of taking care of myself.\n\n&gt; Get proper sleep, get the proper diet, treat yourself, Challenge what it means to relax: instead of scrolling on your phone, close your eyes and let go— at that time over this time— your thoughts and feelings will disappear of themselves, don’t force them away. At these times sometimes I will fall asleep into a nap, or it as is.\n\n&gt; You’re allowed to take a break.\n\n&gt; You’re allowed to take a break thinking the positive thoughts, negative thoughts, positive feelings, negative feelings.\n\n&gt; You can absolutely take a break.\n\n&gt; Similarly, a similar exercise for a relaxation time is, you can absolutely leverage your imagination to provide you happiness.\n\n&gt; You already know you’re leveraging it the other way: to your displeasure.",
            "score": 1,
            "author": "spectrecho"
        },
        {
            "level": 0,
            "comment": "Just focus on preparing to get out of there.",
            "score": 1,
            "author": "Sanity_LARP",
            "replies": [
                {
                    "level": 1,
                    "comment": "Im getting a job soon, but that's about all I can do... My mom is heavily restrictive and controlive of every decision I make/want to make...",
                    "score": 1,
                    "author": "I_think_ImConcussed"
                }
            ]
        }
    ]
}