{
    "id": "146ht6q",
    "score": 10,
    "title": "Feeling like a failure.",
    "author": "Smooth-Barracuda7026",
    "date": 1686449459.0,
    "url": "https://www.reddit.com/r/selfimprovement/comments/146ht6q",
    "media_urls": [],
    "other_urls": [],
    "postText": "F24. Realizing that I’m a failure in life. I haven’t graduated college, I don’t make a livable income, I’m in almost 7,000 of credit card debt. I don’t know how to budget. I’m morbidly obese with binge eating disorder. I’m mentally weak. There’s so many things wrong with me that I don’t even know where to start. I’ve tried so many times and all I’ve done is failed.",
    "comments": [
        {
            "level": 0,
            "comment": "Well. Actually this is great news because the first step in the process is identifying the goal you’d like to achieve.\n\nCome up with comprehensive strategies for each of those notions. \n\nFor example, every week write down your subscriptions and every week consider what you don’t need and every week aim to cut at least one thing off until you have positive cash flow.\n\nAs for weight, get informed about your eating by counting calories with an app like “Lose it”. You’ll find you’re simply eating too many calories. Drink 2.5 L water a day, substitute foods for bags of carrots and lettuce, conserve your energy, challenge what it means to conserve your energy, all as facets of a strategy you implement for example.",
            "score": 10,
            "author": "spectrecho"
        },
        {
            "level": 0,
            "comment": "Are you getting enough sleep? You need to be rested to tackle life's problems.",
            "score": 4,
            "author": "Zilverschoon"
        },
        {
            "level": 0,
            "comment": "You're not mentally weak.\nIt seems like you're dealing with real issues like addiction because why are you in so much debt and you don't turn obese on a dime.\n\nShopping or food must fill some void within you.\nFind out what that is and you'll change your life in a split second.",
            "score": 3,
            "author": "ChasingYesterday97"
        },
        {
            "level": 0,
            "comment": "I’m 20 and I’ve failed a lot as well. Relationships with people and family, job opportunities, shit I even had to retake some classes in college and I’ve tried a lot of things( YouTube channels anime &amp; manga, basketball) \nfailed. We can’t give up. Even if we were to fail for the rest of our lives we have to keep going so as long we’re alive. \n\nI believe one of the most important things you could learn to do in life is cope in a healthy way. Bad things our bound to happen to us in at least one avenue in life or another for some multiple they can’t catch a break no matter what. \n\nIt’s all about forming better habits and picking up on certain urges like binge eating. This is exactly why you need to focus on your mental health at the moment. Start meditating and journaling. Exercise helps with mental health so try to add that into your life whenever you can a walk or weight lifting whenever you can.\n\nIf you have money seek a mental health professional like a therapist or counselor. And just try to take care of yourself and hopefully things change. No matter what please don’t give up on you. It’s hard out here it really is which is why I sympathize with you and could really feel you. But we got to be there for ourselves as nobody else will. Stay strong you got this. Much love Op🫶🏽💙",
            "score": 2,
            "author": "Many_Line9136"
        },
        {
            "level": 0,
            "comment": "I have never got a job.🥲",
            "score": 1,
            "author": "Timely_Progress3338"
        },
        {
            "level": 0,
            "comment": "Cold shower everyday! Does wonders",
            "score": 0,
            "author": "fomomaster"
        }
    ]
}