{
    "id": "146nxk5",
    "score": 382,
    "title": "Rejection hack!",
    "author": "doomngloom69",
    "date": 1686470134.0,
    "url": "https://www.reddit.com/r/selfimprovement/comments/146nxk5",
    "media_urls": [],
    "other_urls": [],
    "postText": "Rejection. It can be scary and painful. Maybe humiliating. The fact you're putting yourself out there is admiral. \n\nWhen it comes to rejection what I do is embrace it. \n\nWhat does that mean?\n\nEmbrace being rejected. This is how you do it. Before you go out hype yourself pump yourself up. I went dt last weekend and before I left, I told myself I want to be rejected 5 times. That means I talked to 5 different guys. \n\nIf you do get rejected, remember it has nothing to do with you, you're not what they're looking 4. So let it go and try again. \n\nEvery rejection is a redirection.\n\nStay present and don't be too attached to the results\n\nTl,dr: embrace rejection. It means you opened you mouth and talked to more people. Rejection has nothing to do with you and you don't lost value. The person that rejected you is pointing you in a different direction\n\nGood luck, hopefully this can help as someone",
    "comments": [
        {
            "level": 0,
            "comment": "\"Every rejection is a redirection\" - I love it!",
            "score": 123,
            "author": "r3d_stain",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm not ugly, I'm just being redirected my whole life.",
                    "score": 8,
                    "author": "bossver",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Maybe you are, but how can you say that all the people in the world think the same? Tomorrow you might meet someone who thinks differently.",
                            "score": 1,
                            "author": "InfiniteRTX",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "People usually agree on lots of stuff. Show me anyone who does not like chocolate, for instance.",
                                    "score": 1,
                                    "author": "Few-Horror7281"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Literally going in circles.",
                            "score": 1,
                            "author": "Few-Horror7281"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is one of the first things you learn in sales: Learn to love rejection.",
            "score": 31,
            "author": "BeeDub57"
        },
        {
            "level": 0,
            "comment": "I get rejected constantly. I laugh it off. my authenticity is offputting. 😂",
            "score": 48,
            "author": "Cu4urthoughts",
            "replies": [
                {
                    "level": 1,
                    "comment": "Me too! Shrug it off and try someone else",
                    "score": 5,
                    "author": "doomngloom69"
                },
                {
                    "level": 1,
                    "comment": "Entertaining the rejection is the root of the issue. saying some gimmicky phrase to see if you can brainwash yourself is cutting corners and has adverse results.",
                    "score": -4,
                    "author": "FabricatedWords",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Explain. How is my way of thinking detrimental? Should we not go after what we want for the fear of rejection? Is it bad to embrace rejection? I'm not saying be overly enthusiastic. What I'm saying is don't run from it.",
                            "score": 6,
                            "author": "doomngloom69"
                        },
                        {
                            "level": 2,
                            "comment": "you think my phrase is gimmicky 😍🤣 thank you for your opinion. there’s always those people who want to put in their two cents when in reality, you wouldn’t say this to anyone in person, unlike me and the OP, who are like having a conversation as if we would in person. Have a good day.",
                            "score": 4,
                            "author": "Cu4urthoughts"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "As a guy it helped me when I realized that guys who are 9-10s get rejected just as much",
            "score": 14,
            "author": "Ok-Marzipan-9846",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ouuuu. That's a good wisdom. Everyone goes through it. Even hot guys.",
                    "score": 8,
                    "author": "doomngloom69"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I love this. \n\nRelated to one of my other hacks : “maybe the thing you are most afraid of is 100%. What then?” Often, even the worst case scenario is eminently survivable, maybe even tolerable.",
            "score": 11,
            "author": "senorbiloba",
            "replies": [
                {
                    "level": 1,
                    "comment": "Exactly. It might sting and burn. But you're still alive",
                    "score": 5,
                    "author": "doomngloom69"
                },
                {
                    "level": 1,
                    "comment": "But this does not provide any reason to go through.",
                    "score": 1,
                    "author": "Few-Horror7281",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "huh?",
                            "score": 1,
                            "author": "senorbiloba"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I always remember my rejection from a military interview which led me into becoming a very successful software engineer today.\n\nGlad things don't go our ways.",
            "score": 10,
            "author": "mannutech",
            "replies": [
                {
                    "level": 1,
                    "comment": "Every rejection is a redirection. Congratulations man!",
                    "score": 7,
                    "author": "doomngloom69",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Indeed indeed",
                            "score": 1,
                            "author": "mannutech"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Rejection isn't that deep, it's simply someone communicating their preferences in dating or whatever. Not everyone is compatible.",
            "score": 11,
            "author": "Tough_Opinion_9305",
            "replies": [
                {
                    "level": 1,
                    "comment": "Exactly. It has very little to nothing to do with you.",
                    "score": 5,
                    "author": "doomngloom69",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How it is possible? If I am being rejected, there is a clear message being communicated to me. If I do not take it personally, it means that I am not listening.",
                            "score": 1,
                            "author": "Few-Horror7281",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If you're being rejected, that's on her. It really has very little to do with you. You're not what she's looking for and if you try to change yourself for her, it's gonna come off fake and that's a turn off. When I say don't take it personally, take it in stride, it has nothing to do with you and your worth or value isn't dependent of this person likes you. You aren't gonna be compatible with everyone.",
                                    "score": 1,
                                    "author": "doomngloom69"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's actually true. We take it personally if we aren't careful. I've gone on many dates where I wasn't interested in a 2nd date (I'm a man). It doesn't mean there wasn't anything wrong with them. We just weren't on the same vibe",
                    "score": 4,
                    "author": "OG_Shadynasty"
                },
                {
                    "level": 1,
                    "comment": "Therefore I do not understand why it is not personal. It is a clear statement about me - I am not enough.",
                    "score": 1,
                    "author": "Few-Horror7281",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "\"I am not enough\"\n\nLemme finish that for you..\"for her\"\n\nYou are and will be enough for the right person. Keep on working on your self and your goals. Time is gonna pass anyway you might as well set yourself up for future success",
                            "score": 1,
                            "author": "doomngloom69",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well, while there is some variety in people's tastes, there is some baseline decency level everyone will agree on. And that baseline is someting I am totally unable to reach.",
                                    "score": 1,
                                    "author": "Few-Horror7281",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "So what's the \"baseline\" you say you can't reach.",
                                            "score": 1,
                                            "author": "doomngloom69",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "So apart from the comments you have seen from me (what could be taken as accirate estimate of my social and interpersonal skills) in  this post it is basically everything - hygiene, health, mental stability, manners, appearance, self care, intelligence (especially emotional and social)\nI am worst at everything - anything you can imagine.",
                                                    "score": 1,
                                                    "author": "Few-Horror7281",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Oh bruh. Lemme say this. Any insecurities you have now will be exposed in a relationship. There's no where to hide. Your insecurities, your demons will come out. I want you to trust me on this. I'm speaking from personal experience.\n\nYou have to build yourself up. How old are you?",
                                                            "score": 1,
                                                            "author": "doomngloom69",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "These are not insecurities, these are objective and simply verifiable fact (such as my BMI). Realtionship is out of question as no one can think of being in my vicinity, much less of voluntary decision. While some flaws can be fixed through consistent effort, I am failing in every single aspect, especially when willpower and effort is involved.\n\nIt sounds so much mote pathetic given I am *34* and long past my prime. Immature, yet broken and given up.",
                                                                    "score": 1,
                                                                    "author": "Few-Horror7281"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Not to be blunt but that sounds like a self-worth problem, everyone faces this in dating but you eventually realise it's not always personal unless you're already in a committed relationship with someone. You have to think about factors in seduction: health concerns (including sexual), cultural differences, boundaries (including time, because people have jobs and stuff) and commitments etc.. That's why I think it's really not personal 98% of the time. The other 2% would be if she doesn't like you out of discrimination - which has happened to me before.",
                            "score": 1,
                            "author": "Tough_Opinion_9305"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Nice outlook 😀",
            "score": 6,
            "author": "toguraum"
        },
        {
            "level": 0,
            "comment": "“I want to be rejected 5 times” Life changing goal setting advice, thank you so much",
            "score": 5,
            "author": "LogicalAstronomer790",
            "replies": [
                {
                    "level": 1,
                    "comment": "The more rejections=the more people you talked to. It's a numbers game.",
                    "score": 4,
                    "author": "doomngloom69"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Did you manage to talk to 5 people?",
            "score": 4,
            "author": "anon3451",
            "replies": [
                {
                    "level": 1,
                    "comment": "I got rejected by 3 different guys before I got the number of the 4th guy. We actually went out and had a real nice time yesterday.",
                    "score": 14,
                    "author": "doomngloom69"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’ve been rejected a lot too and it made me grow thicker skin. It’s always good not to be too attached to any outcome in life.  \n\nIt just means you’ll find the right person sooner. The faster someone tells me “no,” the faster I can move on to find someone who is a good fit for me.\n\nEasier said than done, but I’d rather be hurting about it now than later down the line. I’m getting too old to be strung along. I’d rather either stay single or find a really great fit.",
            "score": 3,
            "author": "GR33N4L1F3",
            "replies": [
                {
                    "level": 1,
                    "comment": "\"the faster someone tells me no, the faster I can move on\"\n\n\n😮. That is such a good wisdom! Can I borrow this and stick it in my back pocket?",
                    "score": 2,
                    "author": "doomngloom69",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sure thing! Lol. I learned it early in life because I hate the anxiety of not knowing if someone is into me or not. I drove myself nuts wondering if someone liked me back or not. Once I know, I calm wayyyyy TF down lol. And I can either move on or see what happens next.",
                            "score": 2,
                            "author": "GR33N4L1F3"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt; The faster someone tells me “no,” the faster I can move on (...)\n\nIf no one is a good fit for me (means - I am not a good fit for anyone) then the eternity does not get any shorter.",
                    "score": 1,
                    "author": "Few-Horror7281",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I have no idea what you mean",
                            "score": 1,
                            "author": "GR33N4L1F3",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My experience is the opposite - I do not get thicker skin, I only grow tired of getting the same outcome every time, regardless of what I try.\n\nSo the conclusion is that I am the problem and if I do not click with anyone I met, the chance of finding some match is getting thinner only; thinking otherwise is merely a manifestation of gambler's fallacy.",
                                    "score": 1,
                                    "author": "Few-Horror7281",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "This sounds like you need to focus on the good things about yourself and accepting yourself so that it’s easier to let it roll off so that you don’t take it personally. Be comfortable with your own company. I’ve been in a dark place before about feeling unwanted, etc. it’s horrible, but it can change. We can change it within ourselves. \n\nJust because there are many people that aren’t meant for us or vice versa, does not mean that there isn’t someone good for us out there. \n\nThere are soooo many people in the world and we are so unique. I’m glad if someone turns me down in the long run because it wouldn’t have worked with them anyway. I want something real, not fake.",
                                            "score": 1,
                                            "author": "GR33N4L1F3",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The thing is that there is really nothing good about me. This is not a matter of perception, rather pure facts. I cannot fix basic stuff that is easy to identify and simple to rectify (e.g. stench). I may be unique, but only as far as  filth is concerned. We are not equal, some of us are worse than others.\nSo there is nothing I can offer to others if I cannot do the very few steps towards myself.",
                                                    "score": 1,
                                                    "author": "Few-Horror7281"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I used to face rejection by girls almost daily. I was a huge nerd, but I learned not to converse or approach girls unless they seem comfortable with the conversation. I am fine making small talk when I go shopping or out to eat. Manners and politeness go a long way. Most of the ladies I see on a weekly basis are okay with me. If you're looking for more, try pursuing your hobbies and interests. I guarantee you'll meet someone who won't reject you!",
            "score": 10,
            "author": "robertroquemore",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's a good wisdom! I definitely will push myself this week to try something different I'm into. I might be rejected, but at least I went after it",
                    "score": 3,
                    "author": "doomngloom69"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thanks for this. I was actually digging deep into why I get so anxious around people today and came to the conclusion that it was due to my fear of rejection. Even the thought of platonic rejection gives me horrible anxiety so I usually just keep to myself everywhere I go. I want to change this since the lack of a social life has really been getting to me lately. I must have read 10 different reddit posts on how to get over that fear today alone and then I get a notification just now on my phone about this post. \n\nYa, thank you. This was really perspective changing.",
            "score": 3,
            "author": "jayrezzz",
            "replies": [
                {
                    "level": 1,
                    "comment": "Please let me know how you're doing with this. I seriously wanna know. Good luck!",
                    "score": 1,
                    "author": "doomngloom69"
                }
            ]
        },
        {
            "level": 0,
            "comment": "A great way of looking at it. Changing the way I interpret negative experiences has really helped me recently.",
            "score": 3,
            "author": "AdolfSchicklgruber69"
        },
        {
            "level": 0,
            "comment": "*Starts playing Aaron Neville’s* “Everybody plays the fool”",
            "score": 3,
            "author": "No_Shop1166",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's the leg up.",
                    "score": 1,
                    "author": "PullTabOffaSchlitz"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I needed this, thank you!",
            "score": 2,
            "author": "holldawg_",
            "replies": [
                {
                    "level": 1,
                    "comment": "Glad to help share wisdoms",
                    "score": 1,
                    "author": "doomngloom69"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Rejected by the prom queen, redirected to marry my amazing wife.",
            "score": 2,
            "author": "Spiritual_Friend5188",
            "replies": [
                {
                    "level": 1,
                    "comment": "Awh! Ya love to see it!\n\nI'm still waiting on my prince. Kissed a lotta toads tho 🤣🤣",
                    "score": 1,
                    "author": "doomngloom69",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sometimes you'll even realize you're meant to be alone and find that the person you're most comfortable with is the best version of you alone.\n\nI eventually found out I'm happier single and alone. I rejected many and many rejected me...lost interest in the whole dating process and am thriving solo accomplishing way more. Wish I knew then what I know now.",
                            "score": 1,
                            "author": "BlackCatSkullCrusher",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Eyyyy we love a single status queen! \n\nI understand tho. I like dating and I like meeting people, but as to get into a relationship? Nah. I like hanging out by myself 7/10 times. \n\nStay focused on your goals and be your best self living your best life. Good luck!",
                                    "score": 1,
                                    "author": "doomngloom69"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "👍🗿",
            "score": 3,
            "author": "souravghoshh"
        },
        {
            "level": 0,
            "comment": "u go take 5 rejections as a women simply means u are rejecting 5 times",
            "score": 4,
            "author": "stopthepot",
            "replies": [
                {
                    "level": 1,
                    "comment": "Women get rejected too. I'm a man, but it happens to women too. You don't really hear about it cuz them men do all the approaching",
                    "score": 4,
                    "author": "doomngloom69",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You are absolutely right, plenty of women definitely get rejected and lots of women actually do approach men and get rejected for a variety of reasons. No one is immune to it.\n\nWhat helps me is reading about super successful people who auditioned for years or tried to pitch their product/idea only to be turned down repeatedly but then one day.....someone gives them a chance and they shoot to success and sometimes even change the world",
                            "score": 9,
                            "author": "BlackCatSkullCrusher",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Let us not forget JK Rowling. Love her or hate her, her story from rags to riches is inspirational. Rejection from nearly every publisher. Had she given up so soon, we wouldn't have Harry Potter, the story that has been a part of my life since I was in grade school.",
                                    "score": 5,
                                    "author": "doomngloom69",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I failed at 6 different businesses before I found one that paid my bills full time. Resiliency is our biggest asset for growth. \n\nEdit. Just wanted to add I almost gave up several times. Also learning when to walk away is equally as important. I spent too much time on the businesses that failed",
                                            "score": 3,
                                            "author": "OG_Shadynasty",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Question: what made you realize you needed to walk away? I'm having trouble with my business and am not sure to drop it or keep going. BTW it's a service based business, no products. It can be done online but most prefer in person, which has been the biggest problem. The business had just started to pick up before covid hit but then crashed. It's never been the same since.",
                                                    "score": 3,
                                                    "author": "PersephonePoem",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Well I'll give you a long answer, and hopefully something is helpful to your situation.\n\nMy first business was sandblasting. I used my dad's auto garage. He had most of the equipment. Two years in, it wasn't growing. I had spent hundreds on materials and equipment, but didn't profit. I didn't particularly enjoy it. It's dirty ect but I had experience. I broke even minus my time. \n\nMy next business was giving guitar lessons. I'm not an amazing player, but competent. I had 15 years experience playing. About a year in, it wasn't growing past a few students. Partly due to being in a rural area. I decided to find greener pastures.\n\nMy business after that was working as a shade tree mechanic. I had tons of experience, and had been employed at several auto shops, and a shop that worked on transport trucks. I wasn't licensed but shops hired me to work as a mechanic under the guise of being an apprentice (zero oversight. Yeah super illegal lol).\nI did it mainly after work and on weekends (I was working as a mechanic during the day).\n\nI did that full time for two years. It was juuust enough to pay my bills. I kind of got tired of the direction the industry was heading in, and I decided I turned a passion into a job, and didn't love it anymore.\n\nI met my ex girlfriend (was current during these events) and I used some of that shade tree mechanic money to rent a garage. Nobody wanted to rent to a mechanic, so I started auto detailing.\n\nAfter a year I had put my competitor out of business by aggressively promoting and undercutting. I couldn't afford my apartment anymore and became what I call \"entrepen-homeless\". I moved into the tiny 6 ft x 12 foot room upstairs with my girlfriend and two large dogs. It sucked. Tiny room, big enough for a bed and a ghetto kitchen.\n\nAnyways by the time year 2 rolled around I was pulling $12k+ a month, and I never looked back. I'm 4 years in, still live in the shop, and still pull 10K a month.\n\nNow to address some of what you mentioned. My biz boomed before covid. Like a month before. When it hit I thought I was done for. Biz kept going strong.\n\nNow this year I notice a slump. I'm still busy. But I'm not booked out 2 months in advance. Instead booked out two weeks. I notice customers are more sensitive to price, and usually just want the inside done now (I was able to sell $100 exterior wash and waxes easily two years ago, this year I'm pitching the $40 wash and wax.\n\nI noticed the recessionary theme last fall, and downsized from 2 shops and 4 employees to myself in one shop and a part time helper. This cut my costs, boosted my margins, and allowed me to not raise prices (customers are feeling the crunch too).\n\nBasically right now Word of mouth has been keeping me going. I marketed aggressively on Facebook and Instagram (organic not paid) for the first two years. And haven't advertised at all for the last two. I haven't even posted to either social platform in that time. I've coasted off the momentum I had built.\n\nThat being said I'm insane and work 12+ hour days 6 days a week, and have pulled many 36 hour shifts as well.\n\nSorry for the novel. If you have any specific questions feel free to ask and I'll try to respond to it. But that's the story of how I made my first 100k+ a year. Been hitting that consistent for 3 years now. I reinvest much of my profit to make my job easier and make my shop more \"professional\"\n\nBasically I gave it a year or two. I wish I cut the cord sooner on the first few businesses .\n\nI've been able to afford an apartment for 3 years but still live in my shop. I expanded upstairs and now it's 15x15, and it's quite comfortable for one person and a dog",
                                                            "score": 2,
                                                            "author": "OG_Shadynasty",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[removed]",
                                                                    "score": 1,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Your submission to /r/selfimprovement was automatically removed because you may not try to get around rule #2 regarding posting links, nor may you violate Rule #3 regarding self-promotion and advertising. \n\nUnfortunately, we've had to add \"DM me\" and other such solicitations of one-to-one communication to this automod condition, as many spammers were trying to use that as a way to get around our no self-promotion rule.  If you were honestly just trying to talk to OP, feel free to just repost the comment without the solicitation, and you're definitely not in trouble. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/selfimprovement) if you have any questions or concerns.*",
                                                                            "score": 0,
                                                                            "author": "AutoModerator"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "All my businesses have been service based. It never hurts to tell customers referrals keep your doors open.  I'm even as bold as to tell people playfully \"if you want to be able to get your car done next year please let your friends know I'm here, or i might not be\". I say it in a joking way, but I'm actually serious lol. \n\nLike my current business is flat rate on what I estimate the time is. Usually I can do two clients a day easily, and that's $500 minimum. Do that 6 days a week, and your doing 12k. \n\nAlso another tip. I burned myself out in my 2nd year pushing to make 200K. My best month ever was 18K, but I've never been so fking miserable in my life, so don't just chase big numbers. Keep some small semblance of work life balance. But also be prepared to skip alot of time wasting stuff people do, like socialize, party with friends or whatever. I was I ln 100% grind mode for 3 years. Year 4 I'm chilling doing closer to 50+ hours a week instead of like 80. But I'm much happier and it still keeps my pockets fat.\n\nI hope something was helpful here for you friend",
                                                            "score": 1,
                                                            "author": "OG_Shadynasty"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Your reply got deleted by auto mod, so I sent you a message.",
                                                            "score": 1,
                                                            "author": "OG_Shadynasty"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 1,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Your submission to /r/selfimprovement was automatically removed because you may not try to get around rule #2 regarding posting links, nor may you violate Rule #3 regarding self-promotion and advertising. \n\nUnfortunately, we've had to add \"DM me\" and other such solicitations of one-to-one communication to this automod condition, as many spammers were trying to use that as a way to get around our no self-promotion rule.  If you were honestly just trying to talk to OP, feel free to just repost the comment without the solicitation, and you're definitely not in trouble. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/selfimprovement) if you have any questions or concerns.*",
                                                            "score": 1,
                                                            "author": "AutoModerator"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "women just needs to be non-picky and they can get laid 100% of them time almost",
                                    "score": 1,
                                    "author": "stopthepot",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Umm getting laid is not the goal for everyone. \n\nI can see that's only what YOU value but some people actually want more than sex.\n\nGetting laid by some you're not even attracted to is not the win you think it is.",
                                            "score": 2,
                                            "author": "BlackCatSkullCrusher",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Exactly. Right now I'm looking for companionship. Someone to go do shit with on weekends. I don't even think about sex. If it happens good for me I guess but I'm more interested in you, not what I can get from you",
                                                    "score": 1,
                                                    "author": "doomngloom69"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is good advice lol take it yall even tho I don't do it haha but it's for personal reasons only",
            "score": 1,
            "author": "Jorpn"
        },
        {
            "level": 0,
            "comment": "I love this!!!",
            "score": 1,
            "author": "Grace2098"
        },
        {
            "level": 0,
            "comment": "Love it!",
            "score": 1,
            "author": "FindingTheAllSpark"
        },
        {
            "level": 0,
            "comment": "Is it the biography of sweets 😏",
            "score": 1,
            "author": "Grouchy_Addendum_988"
        },
        {
            "level": 0,
            "comment": "Beautiful",
            "score": 1,
            "author": "Mabymandigo"
        },
        {
            "level": 0,
            "comment": "But the real question is - why should I even attempt if I get rejected every time and cannot improve anything?",
            "score": 1,
            "author": "Few-Horror7281",
            "replies": [
                {
                    "level": 1,
                    "comment": "You have to keep trying. It's hard, it can be demoralizing, it could shake your confidence.\n\nBut in spite of all that, you must keep at it. In time the sting of rejection will hurt less and less.\n\nWithout knowing you or your situation I can't offer advice. But, if you keep getting rejected one place, go another place. Then another.\n\nMaybe the bar scene isn't for you, clubs and sports are a great way to connect with others. I'm friends with the people I play rugby with.\n\nI get it. It sucks, but try not to be too concerned with the outcome. It'll make you nuts. It did for me. Once I stopped thinking of the end goal (sex, relationship etc) and just stayed in the moment you can start to see the other person open up. Plus it takes pressure off of you",
                    "score": 1,
                    "author": "doomngloom69",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "As someone who has nothing to offer, there is hardly any advice for me. Changing places does not help, because at every place there is still me, being a nuisance in every imaginable situation. The other people, the circumstances, the topics, nothing is really a problem, but me.",
                            "score": 1,
                            "author": "Few-Horror7281",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "So what makes you think you're the problem?",
                                    "score": 1,
                                    "author": "doomngloom69",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Basically everything. No one likes being around me. There is no reason anyway as I have no good traits, nothing of worth.",
                                            "score": 1,
                                            "author": "Few-Horror7281",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I can understand why you get rejected talking like that. How can you expect people to like you when you don't like yourself?\n\nYou say you don't have good traits, what does that mean? nothing of worth? Explain fully.\n\nWhat is your end goal? Friends, dates, relationships?",
                                                    "score": 1,
                                                    "author": "doomngloom69",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "There is absolutely nothing likeable about me. Apart from being an insufferable assh**e with no self control or discipline, I cannot maintain basic hygiene or human posture. Imagine a stinky obese hunchback, but even worse on the inner side.\nAnd don't forget I am selfish and entitled.\n\nThere is not even an intermediate goal. There is not a goal so small and easy that I can achieve twice without luck.",
                                                            "score": 1,
                                                            "author": "Few-Horror7281",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "How old are you",
                                                                    "score": 1,
                                                                    "author": "doomngloom69"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}