{
    "id": "146puxw",
    "score": 2,
    "title": "How do I act less childish?",
    "author": "KhenSiapco",
    "date": 1686477149.0,
    "url": "https://www.reddit.com/r/selfimprovement/comments/146puxw",
    "media_urls": [],
    "other_urls": [],
    "postText": "I (16M) realize that I have a (comparatively) mature mindset but that I act way less mature than I should be.\n\nWhen I don’t get what I want, I usually shut down and just go cold or try my hardest to get their attention by nagging, shouting, guilt tripping or a mix of any.\n\nWhen I’m stressed or feel threatened, I detach and remove myself completely and my brain keeps telling me its their fault.\n\nMy first instinct is to be heard and i’m incredibly impulsive. I act not caring about the opinions of others but I realize that it makes me act like a 9 year old becoming independent for the first time. \n\nI don’t know how many of these initial responses are actually because of immaturity or if it’s a different issue (like self-centeredness) but whatever it is, I’d like advice and I’d like to change. \n\nAnything would be greatly appreciated.",
    "comments": [
        {
            "level": 0,
            "comment": "Start paying attention during the day of when these situations come up, then later in the day choose 1 or 2 of them and spend some time thinking about what caused it, what were the circumstances, how you responded, and how you wish you would have responded.\n\nWhat you're doing is figuring how to identify these situations, and how to respond in a better way to these situations.  The ultimate goal is to be able to recognize them and respond appropriately in real-time as it happens, but a good starting point is to work through it after the fact in the evening.  \n\nBefore long you'll start to see things develop and recognize them as they are happening, and that will cue you to pay attention to how you respond using the ideas you developed previously.\n\nIt's a process so it will take some time and you won't always get it right, so be patient but stick with it, and before too long you'll begin to see improvements.",
            "score": 3,
            "author": "rubber-dinghy",
            "replies": [
                {
                    "level": 1,
                    "comment": "would this work with analyzing events in the past too or would it be too inaccurate? Anyways I love the advice and thank youu",
                    "score": 2,
                    "author": "KhenSiapco",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Definitely you could take a look at things in the past.",
                            "score": 2,
                            "author": "rubber-dinghy"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Don't bother, be a kid, you've got you're whole life to be an adult",
            "score": 2,
            "author": "Consistent-Fly-9522",
            "replies": [
                {
                    "level": 1,
                    "comment": "You kinda have a point but I also realize that I’m alienating my friends (at best) and hurting them (at worst) because they’re the ones who people complain about (or beg them to “help” or avoid me) when I do something wrong. I want to change because I love my friends more than I love my current self.",
                    "score": 1,
                    "author": "KhenSiapco"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I (M17) faced the same problem a year ago, so I can understand this question very well. I had to think about what I was doing to solve the problem and concluded that surrounding myself with maturity and distancing myself from immature things helped me the most.\r  \n\r  \n\r  \nI put people on a pedestal and thought I wasn't good enough for them. It might sound harsh, but what helped me was to distance myself from them and improve to the point where I can realistically see how good I can really get. It may seem like this has nothing to do with being childish, but it has boosted my self-esteem tremendously, which is perhaps the main reason I can no longer behave childishly.\r  \n\r  \nThis isn't necessarily for you, but I've seen a lot of Hamza's videos and I can't put into words how much he's helped me. He got me into fitness and helped me with so many different things.\r  \nI definitely recommend his YouTube channel.\r  \n\r  \n\r  \nI've been on the self improvement journey for almost a year now and have improved A LOT, but I'm still nowhere near where I want to be. Just compare yourself to who you were yesterday. It will take a while but it will be worth it.\r  \n\r  \nPS: Don't expect the people around you (like in your class) to see you differently. I've tried acting sad or angry in class but they don't seem to care or even notice. Just focus on yourself.\r  \nAnd often it is said: \"Don't lose your inner child!\". Being mature as an adult is far more important than making sure you don't lose your inner child. And I don't even think you can really lose your inner child.\r  \n\r  \nI hope this helps you...",
            "score": 2,
            "author": "Just_A_Wooden_Chair",
            "replies": [
                {
                    "level": 1,
                    "comment": "you’ve hit the nail in the coffin especially in that second part. I never considered the correlation between self esteem and maturity but that makes sense. I’ll definitely check the channel out, too.\n\nThanks a lot!",
                    "score": 1,
                    "author": "KhenSiapco",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Glad I could help!",
                            "score": 1,
                            "author": "Just_A_Wooden_Chair"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "16 is a pretty traditional age to have self-absorbed behavior. Having a \"stiff upper lip\" about setbacks and small things that don't affect your health, the roof over your head, the nourishment you need to survive, and educational opportunities. \nSometimes, getting what you want is really disheartening. You talk all this big story about how great things will be when you get it, and then nothing changes or you don't like it. \nAs you get older you start to realize more clearly what's worth fussing over. But trying to be respectful to your parents and not show annoyance is a good discipline. You'll need that at work.",
            "score": 2,
            "author": "JardinSurLeToit"
        }
    ]
}