{
    "id": "14734ip",
    "score": 287,
    "title": "How to stop your mind from going into the past and wondering what could have been.",
    "author": "metalheadgamerdude",
    "date": 1686512358.0,
    "url": "https://www.reddit.com/r/selfimprovement/comments/14734ip",
    "media_urls": [],
    "other_urls": [],
    "postText": "When I was 21 years old, I was a fit dude. In high school, one of my friends urged me to join the wrestling team. I was the fittest, most upbeat dude ever. I was very skinny, I had long  blonde hair, glasses very young looking, and since I was so young I could literally do anything with my life. \n\nYet, I was really confused. The moment I graduated high school, my brother went straight to university and majored in mechanical engineering. I was just fucking alone with my mom. I was so sad that my brother left me. In high school we were becoming besties. I didn't know what the hell I wanted in life. I would always go on social media and see all of my high school friends having fun. That's what I truly wanted in life was to just be that college frat boy. Or that dude that hangs out with his colleagues and stuff. \n\nI had no career or life guidance. My mom was studying her ass off to become a nurse and paid very little attention to me. I had to make myself food and whatnot. If I even said hi to her she would scream at me because she had to study. I took all of the education classes in community college. English, history, science, etc. My mom told me to take it slow, only take 3 classes at a time. I basically just took wrestling and swimming because I wanted to explore my hobbies. Then, I took the basic classes. \n\nThe thing was is at the time, I loved video games too much and I hardly ever studied. Skyrim was such a hit back then. I barely passed some of my classes mainly because I kept talking to this one girl on the phone from high school and such.\n\nI just remember how much potential I could have had with a family that could have motivated me to be something in life. I never had that. No one ever really cared. I just wish I had that small nudge of bit guidance somewhere. Because when I was 21 I was a good fit looking dude with a great personality. \n\nIf I can just talk to my younger self, I would've told him to work at Trader Joe's. I love working at TJs currently but being nearly 30 years of age makes me self conscious. With enough effort at 21 years of age, I easily could've got my first job there. I would've made some friends and got that work experience at a young age. Those were the things I actually valued at the time in my life. I remember constantly watching that Linkin Park music video numb. That was how I felt at the time. Working at Trader Joe's would've filled that gap and I would make friends who had these suggestions for what they did in college.\n\nInstead I wasted so many years in college. I studied programming (computer science), dropped out because I couldn't pass calculus 2, then studied psychology. Considering over the pandemic I was so isolated, I just feel like there have been so many wasted years.  A psychology degree won't get you anywhere in life I fear.",
    "comments": [
        {
            "level": 0,
            "comment": "The best way to stop looking behind you is to find something to look forward too. Think about what you want your life to look like in 15 years and start taking steps to get there. If that feels like too much, I usually have a finance goal and a fitness/physical goal that I’m working towards.",
            "score": 83,
            "author": "eharder47",
            "replies": [
                {
                    "level": 1,
                    "comment": "Was about to say the same thing. Worked really well for me.",
                    "score": 3,
                    "author": "menosgrande14"
                },
                {
                    "level": 1,
                    "comment": "This is great advice.",
                    "score": 1,
                    "author": "JackClutches"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Bro you are just 30. You have still like 45/50 years to live. Dont stress about it, just look where you are now and start from there. You have to just work Day by day with full effort for the life you always wanted.",
            "score": 124,
            "author": "iambored_2",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm not 30, but it always feels like being great in your life young is the best way to enjoy success. I can't just get out of that mentality.",
                    "score": 2,
                    "author": "Doctor_Dad_Enraged"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I've been through this. It's intoxicating to think of all the things you could have done differently, but this is an illusion. The energy you spend with these daydreams is the energy you lack to do what you need to do right now: to focus on the present, to try to do something for yourself. I know that feeling, when you simple get tired from trying and failing and start to think how much better things could have been.\n\nBut that's a trap of your mind. Don't fall for it.",
            "score": 41,
            "author": "weakwilledfool"
        },
        {
            "level": 0,
            "comment": "“Start where you are, use what you have, do what you can”",
            "score": 43,
            "author": "Chigziii"
        },
        {
            "level": 0,
            "comment": "The number one piece of advice I have is to focus on the present and live in the present. Having goals for the future will help, but even focusing purely on the future will prevent you from taking advantage of the present moment. I promise that the more good you do for yourself in the present moment, the better your future will be. If you love wrestling and have the money, go to a wrestling/mma gym. Start taking little steps to get into better shape, whether that be running, weight lifting, or even just walking. Whatever you do, push yourself to improve every week or every month. Start putting money aside for a financial goal that you'd like. Try learning something new, and stick with it even though it's hard. In addition to this, don't be so hard on yourself. You've been fighting and moving forward, so you know you can do difficult things. Be proud of that! You will be okay.",
            "score": 15,
            "author": "tallahassee009"
        },
        {
            "level": 0,
            "comment": "It's not too late to re-write the ending.",
            "score": 10,
            "author": "Exploren"
        },
        {
            "level": 0,
            "comment": "Oh man I’m there with you. Hope you get better. Don’t worry, I’m nearing 30 as well and am a complete loser…but I’ve found a passion (mathematics &amp; computer science) and have been teaching myself this over the years. Until I get to an adequate amount of knowledge, then maybe I might go back to college since “fuck all”. I don’t want to be in my 30s knowing that since I can’t even be a normal person, I didn’t discipline myself enough to pursue something I love knowing that’s it too hard. I’m a college dropout too, but I’m not going to let that stop me from pursuing college for a 4th and final time to achieve my dreams",
            "score": 10,
            "author": "Saucy_Tuna"
        },
        {
            "level": 0,
            "comment": "You can make the best of psychology, you just need to see where it fits.",
            "score": 10,
            "author": "ChampNovas"
        },
        {
            "level": 0,
            "comment": "Living in the past is a disservice to yourself because it doesn’t honor the person you are today and the growth you have gone through to get to this point. You are a different person than you used to be. Embrace this person and enlist them to create the life you see for yourself.",
            "score": 8,
            "author": "travkroeks"
        },
        {
            "level": 0,
            "comment": "What's stopping you from being a good fit looking successful dude with a great personality at 33?\n\nI hope that gives you something to work towards.",
            "score": 7,
            "author": "LuxLoovs"
        },
        {
            "level": 0,
            "comment": "Hello, perhaps it starts with forgiving yourself. Be kind and graceful to yourself despite your lapses and misjudgment.  Then, you could shift your perspective to what you can do now. It's never to late to pick up pieces of yourself and putting them back together again. As much as we want life to be perfect and smooth, it almost never is. There is great beauty in the noble endeavour of standing up despite being beaten down, brother.  In the end, the choice is yours to make: let your disappointments and regrets consume your life or paralyse you to inaction... or allow these things to edify you and prune you to become the best version of yourself. You're alive, and you very much have that choice. \n\n~ fellow psych degree holder",
            "score": 17,
            "author": "Kindly-Put"
        },
        {
            "level": 0,
            "comment": "Dude, you don't need calculus to write code. If you've still got the foundations in your mind, hit up YouTube for a bit, then:\n\njust\nstart\nmaking\nstuff.\n\nMake stuff. Add hardware if you want. Make more stuff, then push your way into a job. I'm degree trained and unless you *want* the rest of comp sci, I don't recommend uni to **anyone**, for programming.",
            "score": 4,
            "author": "never-never-again_"
        },
        {
            "level": 0,
            "comment": "You will always wonder about the road not taken, and people that claim to live without regrets are simply lying or completely incapable of introspection and learning from their mistakes.  The only way you can avoid being haunted by the past is by learning from it and living the best life you can going forward.",
            "score": 3,
            "author": "PM_me_your_mcm"
        },
        {
            "level": 0,
            "comment": "I‘m not sure what advise to give, but I suggest to look into stoicism.",
            "score": 3,
            "author": "Ikem32"
        },
        {
            "level": 0,
            "comment": "I failed Calc II as well! I believe it's the most failed course in existence. It sucks",
            "score": 3,
            "author": "EtuMeke"
        },
        {
            "level": 0,
            "comment": "The best way I found for myself is to remind myself no matter how much I fantasize about how different my life could have been if I stuck to my habits and  quit my addictions earlier, I will never get that time back no matter how long I spend. \n\nHowever, thinking about “what if I didnt” only wastes the precious time that I have in front of me and depletes me of my energy. Thinking without taking action is procrastination. What are you avoiding? What are you scared of and what can you change? Start with just one thing",
            "score": 3,
            "author": "Sharpie-Productions"
        },
        {
            "level": 0,
            "comment": "Something I had to tell myself through my 30s. Credit to Oprah (circa 2003) -  her context was weight/body image. \n“Let go of the past because the past let go of you.” \n\nAnother wise (para)phrase - Steve Harvey. \nThere’s a reason why the rear view mirror is small and the windshield is huge. You’re not going that way (back). It’s just there to remind you what you passed by and to keep you safe from something hitting you from behind. \nYou have to spend most of the time looking through the windshield and where you’re going. \n(His vid is best but I I don’t have the energy to find the link at 4:50am). \n\nMy professional success didn’t really start until I was late 30s. I’m 47 now and still have 40 years of life to go. My parents were also just trying to stay above water and weren’t good at guidance. \n\nYou’re not too late :)",
            "score": 3,
            "author": "i_amwildhairdontcare"
        },
        {
            "level": 0,
            "comment": "Thanks, I'll try not to stress and enjoy my midlife crisis in 15-20 years instead.",
            "score": 5,
            "author": "Puzzleheaded_Bet6934"
        },
        {
            "level": 0,
            "comment": "Wtf . I'm 54 and back in college. Never give up, never grow up, and never stop learning.",
            "score": 2,
            "author": "mizmiatortilla"
        },
        {
            "level": 0,
            "comment": "I resonate so much with your piece. What helped in my high school and university was that I always found myself to be associating with nerds and somehow serious individuals. That had a positive influence on my personality. I always blame my parents for not giving me that push and guidance. I don’t anymore. I am not doing badly right now but I could have been better definitely.",
            "score": 2,
            "author": "BlaqQuofi"
        },
        {
            "level": 0,
            "comment": "Stop looking in the rear view mirror. You aren’t going that way. \n\nIt isn’t your family’s fault you are where you are - it’s yours. You wasted time playing video games and whatnot. You were an adult, people have families, nurse parents on their deathbed, have children by 21, or been to war. Stop blaming everyone else. \n\nMake a plan to move forward, what’s done is done. Your friends will have stalls along the way as well, don’t compare yourself to others.",
            "score": 2,
            "author": "Beneficial-Serve-204"
        },
        {
            "level": 0,
            "comment": "Bro I turned 30 yesterday. From 19-28 I was a straight up heroin addict. Tattooed my face, went to prison, I’m a felon. I just got laid off from a really great job a couple months ago. You aren’t alone. I look back and think holy shit, how could I fuck up my life so bad. But then I remember, I’m clean, I’m sober, I have a loving family. Idk what to do with my life, but I know that i can’t change the past 🤷‍♂️",
            "score": 2,
            "author": "dudesweettt"
        },
        {
            "level": 0,
            "comment": "Talk out loud about something else.\n\nI yell \"no\" or I repeat \"this is temporary\"",
            "score": 1,
            "author": "Healthierpoet"
        },
        {
            "level": 0,
            "comment": "Don’t look back look forward. What possible good comes from feeling you wasted anything?  If you aren’t happy figure out what you want and go do it. It’s not too late. And it’s not anyone else’s fault btw.",
            "score": 1,
            "author": "sasanessa"
        },
        {
            "level": 0,
            "comment": "You’re not old. I’m 32 in a week I’m not old either. You have so much time. Don’t think about the past negatively. Think about it as a starting point. Everyone is different starting points. I’m much like you where I feel I was way stunted in my late teens early twenties by my life situation. I have only just now found a “adult” job that pays me decently. I say that in quotes because dude you can do anything. If you like Trader Joe’s then work your way up at Trader Joe’s. That’s a totally acceptable career path. I tried to go the retail route (because as a kid I thought I’d I didn’t go to college well what else is there besides retail? I wish I knew…I wish someone told me all the other areas I could’ve started entry level in, but again that’s not something I learned until just a few years ago). \n\nTry to use that disappointment in your early life to spur on more growth now. There’s nothing you can do for the past except learn from it and try to do better now. Use it to get you excited. This is where I started and gos damnit this is where I will end up. I will be better than I was then. You can do it. It’s a hard path but there is a path there.",
            "score": 1,
            "author": "DazeyHelpMe"
        },
        {
            "level": 0,
            "comment": "Plenty of people start really getting serious about goals at your age. Just start now as if you were 21. You’re only a few years older than that.",
            "score": 1,
            "author": "RoboCat23"
        },
        {
            "level": 0,
            "comment": "Well to be honest i dropped out of a psycho degree at 21 and now forever regret it. Keep up with it its good money if you also like the domain it can really become a passion. but i feel you, it seems at some point i got left out just because i did not had the same conscience then some young people or discipline or else. I wish my parents would’ve been WAY more severe. I would’ve understood why, now. But some will say we cant blame it all on them and it’s true when i see so many successful 25yro and else.. it only makes me feel even more shitty and behind everyone else. And at some point it seems the spiral of negative talk become infernal and you just don’t know who you are, what you’re good at or what you want anymore, especially if you never had a big call for a passion or a special talent or skills. I strongly envy the people who just did a degree, kept the job and are now thriving in their mid thirties while im here asking myself what school course i should get into debt and struggle for and IF one would ever be paying me enough to live in todays world with my lateness to the career market … short… is sigh im tired",
            "score": 1,
            "author": "yssac1809"
        },
        {
            "level": 0,
            "comment": "Aw. First of all I think you’re being too hard on yourself. No one has it figured out at 21 lol. I sure didn’t. I am highly educated and I still don’t know wtf I’m doing. I got fat and lazy. Anyway, I digress. \n\nDefinitely focus on the present. How can you be your best self today? What steps can you make to be the best version of yourself? We are always learning. Learn how to make yourself happy. Focus on what you can change instead of what you can’t. If you do that, the past will just be a different version of yourself that you can look back on and think “wow I don’t even recognize my past self” and that’s ok! You’ve got this 🙃",
            "score": 1,
            "author": "dothackroots"
        },
        {
            "level": 0,
            "comment": "I struggle with this a lot myself. I have to keep looking forward and keep myself busy. Keep chasing ambitions whether career, hobby, sports, etc. IMO this is a lot like getting over a toxic/bad relationship or forgetting people who have wronged you. It’s never easy but eventually you start to pass time focusing on things that matter to you in the present/future.",
            "score": 1,
            "author": "JackClutches"
        },
        {
            "level": 0,
            "comment": "Mindfulness.",
            "score": 1,
            "author": "notroberto23"
        },
        {
            "level": 0,
            "comment": "The Vietnamese language has no subjunctives. Just imagine that.",
            "score": -1,
            "author": "Aggressive-Carpet489"
        },
        {
            "level": 0,
            "comment": "Wild idea for the psychology degree use. Start looking ways you could add AI or to add into AI. Maybe start develop a program with someone that uses AI for answers but gives correct psychological answers and not just random or false info",
            "score": 0,
            "author": "Tulired"
        }
    ]
}