{
    "id": "147lpks",
    "score": 829,
    "title": "Today I am 15 days sober and 4 days off cigarettes.",
    "author": "SoberAndSad99",
    "date": 1686569097.0,
    "url": "https://www.reddit.com/r/selfimprovement/comments/147lpks",
    "media_urls": [],
    "other_urls": [],
    "postText": "Super proud of myself and just wanted to share. It hasn't been easy but it was defiantly worth it. I've built up a proper daily routine that I'm sticking to, going to NA meetings everyday, watching what I eat/eating at the same times every day and I've cut down on drinking fizzy drinks, I was drinking 2L of pepsi per day now I'm down to one 330ml can. Quitting smoking messed with my head big time but I think I'm through the worst of it now I feel somewhat normal again with minimal cravings.",
    "comments": [
        {
            "level": 0,
            "comment": "I hope you're saving the money you used to spend on cigarettes right?",
            "score": 31,
            "author": "frogmicky",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am, planning on spending it on something nice for myself when I hit 4 weeks smoke free.",
                    "score": 41,
                    "author": "SoberAndSad99",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Took me about 6mo to have days when I would not think about smoking at all for the whole day. Every month is a lot easier than the first! Good luck!",
                            "score": 22,
                            "author": "No_Telephone_9619",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks, Glad to hear it gets easier!",
                                    "score": 11,
                                    "author": "SoberAndSad99",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Congratulations",
                                            "score": 1,
                                            "author": "Suspicious_Box_2140"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "How long did you smoke for? How long have you been off?",
                                    "score": 1,
                                    "author": "SurgicalInstallment",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Smoked for 3 years. Off for 10 now.",
                                            "score": 2,
                                            "author": "No_Telephone_9619",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "and how is it now? is almost everyday a day where u dont think about smoking?\n\nwhat if you smell or are in vicinity of someone smoking? do you still get the urge after 10years?",
                                                    "score": 1,
                                                    "author": "SurgicalInstallment",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yeah I think about smoking maybe a few times per year now. I don't like the smell of smoke anymore.",
                                                            "score": 2,
                                                            "author": "No_Telephone_9619",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "If I can chime in, I quit smoking with the help of the patch…… did the dumbest thing maube 2 years later, after a particularly nice time with a woman I saw a Marlboro sign on the side of the freeway :/ so dumb of me",
                                                                    "score": 1,
                                                                    "author": "multitaskgod"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "That's what I did too.",
                            "score": 3,
                            "author": "frogmicky"
                        },
                        {
                            "level": 2,
                            "comment": "There's this bit I got from \"Atomic Habits\" where you get yourself rewards in the direction of your new identity. Whatever it is you are creating for yourself, make your reward affirm that :)",
                            "score": 2,
                            "author": "meisterbrendan",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I like that idea, thanks!",
                                    "score": 1,
                                    "author": "SoberAndSad99"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Let us know what that would be",
                            "score": 2,
                            "author": "Time_Technician_2339",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Probably some new shoes/clothes!",
                                    "score": 2,
                                    "author": "SoberAndSad99"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Good on you. That's badass. Stopped booze 23 years ago. Best decision I made for myself.",
                    "score": 2,
                    "author": "billycmd"
                },
                {
                    "level": 1,
                    "comment": "Or investing in something worthwhile. Nothing intrinsically wrong with either.",
                    "score": 0,
                    "author": "CryostasisK"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I've never heard a sober person say they regret it! Keep it up.",
            "score": 7,
            "author": "GrayLightGo"
        },
        {
            "level": 0,
            "comment": "That’s great, congratulations!\n\nI just quit drinking about 3 weeks ago (I wasn’t an alcoholic), I was just a fairly regular drink, man oh man can I feel the benefits in nearly every aspect of my life. \n\nI wish you the best of luck.",
            "score": 13,
            "author": "straightnoturns",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah it’s crazy how much better I felt after just 2 weeks sober so I get what you mean. Wishing you the best as well dude.",
                    "score": 8,
                    "author": "SoberAndSad99"
                },
                {
                    "level": 1,
                    "comment": "What are the benefits?",
                    "score": 2,
                    "author": "ThouShallWin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Clearer thought, better sleep, more energy, more enthusiasm, increased libido, making better food choices, more money, lost a bit of weight and not skipping exercise because of one too many the night before.",
                            "score": 11,
                            "author": "straightnoturns",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "good enough for me lol",
                                    "score": 3,
                                    "author": "ThouShallWin"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Congrats! I'm currently 1,5 years sober and beginning of next month will be exactly 1 year smoke free for me! Being sober sucks at first (and sometimes even nowdays tbh) but it's so worth it! I wish you all the best!",
            "score": 4,
            "author": "momo-motchii",
            "replies": [
                {
                    "level": 1,
                    "comment": "Congratulations on 1.5 years clean time, that’s an amazing accomplishment! I hope to be there one day myself. Wishing you all the best too!",
                    "score": 0,
                    "author": "SoberAndSad99"
                }
            ]
        },
        {
            "level": 0,
            "comment": "3.5 years no booze, nearly 3 years no cigs \n\nI don't miss them AT ALL \n\nAnd for 13 years I couldn't reign it in, tried again and again\n\nTake this break and run with it, don't mess with it",
            "score": 8,
            "author": "Unhappy_Nothing_5882",
            "replies": [
                {
                    "level": 1,
                    "comment": "Congrats! Just hit 9 years without a cig and about to achieve 6 without drinking. After years and years of trying, finally broke free.",
                    "score": 6,
                    "author": "TrueSay"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Keep going you lovely person.",
            "score": 3,
            "author": "Eskwire"
        },
        {
            "level": 0,
            "comment": "Chewing gum helped me when I quit. I became a gum addict for a while. They have a little bit of sugar so that helped. Plus, instead of my regular cigarette breaks, during work, I took 5 minute walks around the block.\n\nIf you are drinking cola, perhaps switch to a diet version? They are not as tasty, but they do help with the cravings of something fizzy.",
            "score": 3,
            "author": "WalidNewaz",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah I’ve found gum super helpful too! Trying to take one every time I get the urge to smoke. Yeah switching to diet cola is probably a good step forward.",
                    "score": 1,
                    "author": "SoberAndSad99"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Congratulations!! 🎉 Today I am 1 day sober after a month long relapse &amp; hope to be happier &amp; healthier again :)",
            "score": 3,
            "author": "psychmonkies",
            "replies": [
                {
                    "level": 1,
                    "comment": "Congratulations to you too! The first few days are the hardest but it gets better.",
                    "score": 1,
                    "author": "SoberAndSad99"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That huge congrats keep it up",
            "score": 3,
            "author": "AdventurousRecipe696"
        },
        {
            "level": 0,
            "comment": "Amazing job! That is definitely something to be very very proud of!!",
            "score": 3,
            "author": "just_aisha_"
        },
        {
            "level": 0,
            "comment": "Congrats, I like how you didn't go to the extreme with something which isn't necessarily bad for you in moderation (i.e. fizzy drinks). Very sensible approach to eventually cutting it out (I assume).",
            "score": 2,
            "author": "CryostasisK",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you! And yeah I didn’t want to overwhelm myself and give up everything all at once, I thought cutting the fizzy drinks down first would be a good stepping stone until I cut it out completely.",
                    "score": 1,
                    "author": "SoberAndSad99"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Kick ass bruh",
            "score": 2,
            "author": "plasticbots"
        },
        {
            "level": 0,
            "comment": "That is amazing! You will not regret quitting. I’ve never met someone that did. It does wonders for your health, confidence, and hygiene all in one. And if you can quit such a strong addiction, you can do almost anything! Keep it up. Routine is important, you seem to be on a great track. Also a big plus with quitting the soda. Keep kicking ass.",
            "score": 2,
            "author": "JackClutches"
        },
        {
            "level": 0,
            "comment": "You need to be careful of friend that smoke else I don't know",
            "score": 2,
            "author": "United-Aerie2582"
        },
        {
            "level": 0,
            "comment": "I'm a year and nineteen days free from alcohol and cigarettes. I crave both badly sometimes but I simply couldn't go back to them. I've been exercising and I feel a whole lot better and healthier now.",
            "score": 2,
            "author": "caesarnwamama",
            "replies": [
                {
                    "level": 1,
                    "comment": "Congratulations on being 1+ year off booze and cigarettes. That’s awesome dude!",
                    "score": 2,
                    "author": "SoberAndSad99",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks. One love.",
                            "score": 2,
                            "author": "caesarnwamama"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I know for a FACT that you can do it. Because if an ex-crackhead like myself can get 23 years clean, it's possible for you.",
            "score": 2,
            "author": "OtakuLoy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you ❤️ and congrats on 23 years clean that’s amazing!",
                    "score": 1,
                    "author": "SoberAndSad99"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Very proud of you bro! I quit cigarettes too recently, it's been 2 weeks for me now. Keep it up, you got this!",
            "score": 2,
            "author": "AlexImHi"
        },
        {
            "level": 0,
            "comment": "It's all about consistency bro, despite how hard it may seem you got this, stay strong and if you want take up a nice active hobby like basketball 😎",
            "score": 2,
            "author": "JayusMakesMeSmile"
        },
        {
            "level": 0,
            "comment": "congrats on this man! it’s something you should be very proud of, im happy for u",
            "score": 2,
            "author": "alexandriarchives"
        },
        {
            "level": 0,
            "comment": "Fantastic, congrats!",
            "score": 2,
            "author": "Teri102563"
        },
        {
            "level": 0,
            "comment": "I’m so glad for you. the Mind is a powerful tool, once is’t put into action. I’m trying to have my wife quit smoking and drink Alcohol.  But only see uphill battles.",
            "score": 2,
            "author": "Bogota2LAX"
        },
        {
            "level": 0,
            "comment": "Im not going to lie. If you can afford the time I would suggest getting a second job. Having two jobs really keeps your discipline in check once you're used to it. Also it feels more worth it once the checks start rolling in and you become more appreciative of your first job. Thats just in my experience though. \nI have an incredibly addictive personality type, but you'd be surprised what you can achieve when you fill your time with productive things.",
            "score": 2,
            "author": "brownsugargingerr"
        },
        {
            "level": 0,
            "comment": "Congratulations! Wishing you luck, happiness, and peace as you move forward with this. (:",
            "score": 2,
            "author": "IntelligentBusyBee",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks! :)",
                    "score": 2,
                    "author": "SoberAndSad99"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Well done brother, keep it up👌",
            "score": 2,
            "author": "Salvaaah01"
        },
        {
            "level": 0,
            "comment": "That's awesome, keep it up! I'm proud of you too.",
            "score": 2,
            "author": "Apprehensive_Grass85"
        },
        {
            "level": 0,
            "comment": "Yep, my piggy bank is starting to look like an ATM machine!",
            "score": 2,
            "author": "Frequent-Ad5752"
        },
        {
            "level": 0,
            "comment": "Great job! Keep it up! Indeed save however much you'd have been spending on cigarettes to buy yourself something nice.",
            "score": 2,
            "author": "Sophistar77"
        },
        {
            "level": 0,
            "comment": "Congrats! Keep it up, if your body had a mind to think and a mouth to speak of its own, it would be very thankful to you. Take care of yourselves everyone.",
            "score": 2,
            "author": "miwitch-"
        },
        {
            "level": 0,
            "comment": "I am proud of you! Keep going, OP!",
            "score": 2,
            "author": "chubbypomeranian"
        },
        {
            "level": 0,
            "comment": "Fabulous! Keep up the great work. You got this",
            "score": 2,
            "author": "Advanced-Classic-151"
        },
        {
            "level": 0,
            "comment": "Keep us posted! The first 2 weeks are toughest when it comes to nicotine addiction after that it gets better.\n\nWork on finding new healthier habits to replace your old ones and hang out with healthy friends.",
            "score": 2,
            "author": "Sophistar77"
        },
        {
            "level": 0,
            "comment": "Incredible good for you! Sometimes it can get harder before it gets easier, so persevere and defy the odds my friend. - 133 days alcohol free. 99 days cigarettes free.",
            "score": 2,
            "author": "Upper-Recover9684",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much for the kind words! And big congrats on 130+ days clean and 99 days off cigarettes dude! No easy task!",
                    "score": 1,
                    "author": "SoberAndSad99",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you so much! I’m 2 days into quitting weed now, so here comes the insomnia, night sweats, and irritability all over again lol. You can do anything you set your mind to my friend! After 4 months of quitting alcohol, I’ve decided to go back to college (27F), I get to buy myself new clothes and shoes with my extra money. I’m excited for the new opportunities that you will be presented with. When one door closes another opens. Enjoy 😉",
                            "score": 1,
                            "author": "Upper-Recover9684"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Right on man but change your nick! How can you be sad, you’ll never black out and lose your wallet again if you just don’t put psychoactive substances in your body! I’m still using some drugs but I quit drinking and it took me a LLONG time to realize that all the terrible shit that happened to me was due to my drinking. I’ve been to jail, so many times, caught like 8 violations of a court order to abstain from drugs and alcohol in the last year. Went to rehab, had everuthing dismissed, came home and drank, bought $800 worth of adderall, Xanax and booze and was\nBack in jail 4 days later….. then my fiancé dumped me because I guess while I was blacked out I kicked her out at 3am…… that’s about when it all clicked. I’ve got a bit over 2 weeks without alcohol and while im doing some shit most people think is way worse, I can tell you alcohol is the only thing that’s been so hard to quit, left me clinically dead for 20min, caused 6 seizurses from withdrawals and ruined my relationship with the girl I was so sure I’d marry. Life truly was unmanageable!",
            "score": 2,
            "author": "multitaskgod"
        },
        {
            "level": 0,
            "comment": "Good for you! I don't think I've ever met someone that regretted their decision to quit smoking or get sober.",
            "score": 4,
            "author": "Pairaboxical"
        },
        {
            "level": 0,
            "comment": "Wow!! Congratulations !!!",
            "score": 2,
            "author": "VeryEarnest"
        },
        {
            "level": 0,
            "comment": "Well done! Highly recommend reading Allen Carrs Easy Way to Quit Smoking if you are struggling or slip up again. I was at a pack a day and quit easily after listening to the audiobook. Over 9 months smoke free now",
            "score": 2,
            "author": "DontBruhMeBrah",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’ve heard good things about that book will definitely keep that in mind thanks",
                    "score": 1,
                    "author": "SoberAndSad99"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Bro that's amazing.\n\nYou managed to make it through most of the withdrawals\n\nI take my hat off to you that must have taken some will power",
            "score": 2,
            "author": "Tubegamerpro12",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks dude! And yeah the first 3 days were really tough but I managed to get through them, I just kept reminding myself of why I wanted to quit in the first place, hoping it gets easier from here.",
                    "score": 2,
                    "author": "SoberAndSad99",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah bro it will\n\nJust don't rellapse now",
                            "score": 2,
                            "author": "Tubegamerpro12"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Two things.\n\nAll this is aligned with who you wanna be, that being said, one action or lack there of is not who you are as a person. \n\nYou might ask what you’re “actually” craving. People will say they “need a smoke” but what they actually want is for a feeling to go away or “to relax” and when we see it that way we notice how many other options there are to taking care of that.",
            "score": 1,
            "author": "TemperWearyMember"
        },
        {
            "level": 0,
            "comment": "You've given up smoking and you're better off for it. Gratz!",
            "score": 1,
            "author": "Arrathir"
        },
        {
            "level": 0,
            "comment": "Proud of you. Sounds like you are doing everything right! Going to meetings, filler activities, avoiding other beverages. Its super cool to see how your lungs rehabilitate after not smoking!\n\n![gif](giphy|3o6fIUZTTDl0IDjbZS)",
            "score": 1,
            "author": "eyes_of_brownies",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you, I really appreciate the support!",
                    "score": 1,
                    "author": "SoberAndSad99"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Nice! Well done!",
            "score": 1,
            "author": "AcanthocephalaNo9441",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you!",
                    "score": 1,
                    "author": "SoberAndSad99"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Congratulations!!",
            "score": 1,
            "author": "sooper_dooperest",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks!",
                    "score": 1,
                    "author": "SoberAndSad99"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Proud of and happy for you. Keep it up!",
            "score": 1,
            "author": "DepthTrick3620"
        },
        {
            "level": 0,
            "comment": "Congrats! Well done.. 😃",
            "score": 1,
            "author": "67Leobaby1"
        },
        {
            "level": 0,
            "comment": "Congratulations man!!! Just hit 2 and a half years no alcohol on 6/1 - once the ball gets rolling it gets easier. \n\nHave a good journey my friend",
            "score": 1,
            "author": "Broad-Ad-4705"
        },
        {
            "level": 0,
            "comment": "Well done! Yesterday I reached 3 months of not drinking. I feel great! All aspects of my life have improved.",
            "score": 1,
            "author": "dansandiego"
        },
        {
            "level": 0,
            "comment": "Your amazing man. I'm slowly trying to myself. The first 2 days I feel like I'm in hell. The 3rd day is when things start to mellow out. By the 4th and 5th day is when I feel the real battle comes. I don't wish addiction on anybody. Maybe my enemies yes lol. It's a horrible thing to go through. Keep it up man your awesome.",
            "score": 1,
            "author": "oabrego28"
        },
        {
            "level": 0,
            "comment": "Congratulations man!!! Just hit 2 and a half years no alcohol on 6/1 - once the ball gets rolling it gets easier. \n\nHave a good journey my friend",
            "score": 1,
            "author": "Broad-Ad-4705"
        },
        {
            "level": 0,
            "comment": "Congratulations!",
            "score": 1,
            "author": "Green_Guitar"
        },
        {
            "level": 0,
            "comment": "Stay strong man. Thank you for sharing",
            "score": 1,
            "author": "CarpenterJaded2923"
        },
        {
            "level": 0,
            "comment": "I've been drinking everyday since the past year and smoking since 3 now, trying to find D-day but i fail everyday",
            "score": 1,
            "author": "CuntTheSiddhesh"
        },
        {
            "level": 0,
            "comment": "Congratulations!",
            "score": 1,
            "author": "Bodicea7"
        },
        {
            "level": 0,
            "comment": "Congratulations \nKeep on rocking",
            "score": 1,
            "author": "Cryptic_Hunter"
        },
        {
            "level": 0,
            "comment": "Legend! Absolutely SMASHING life!",
            "score": 1,
            "author": "Monnrz"
        },
        {
            "level": 0,
            "comment": "Hell Yeah !!!",
            "score": 1,
            "author": "GuitarFreak82"
        },
        {
            "level": 0,
            "comment": "Congrats man!",
            "score": 1,
            "author": "Accomplished-Edge171"
        },
        {
            "level": 0,
            "comment": "Congrats! That’s no small feat!",
            "score": 1,
            "author": "Good4gaby"
        },
        {
            "level": 0,
            "comment": "Avoid cans. They’re estrogenic.",
            "score": 1,
            "author": "Brian_Ou"
        },
        {
            "level": 0,
            "comment": "Keep up the amazing work! 🫶🏻👏🏻",
            "score": 1,
            "author": "1mytearsricochet3"
        },
        {
            "level": 0,
            "comment": "That's awesome keep up the good work! Remember one day at a time!",
            "score": 1,
            "author": "Nirvana-Rose"
        },
        {
            "level": 0,
            "comment": "Good shit man think of how much money you’ll save",
            "score": 1,
            "author": "curatingFDs"
        },
        {
            "level": 0,
            "comment": "Well, this effort deserves a nice jog and heavy sweat. \n\nYou will feel even better!\n\nPurge baby Purge!",
            "score": 1,
            "author": "spoonmanknows"
        },
        {
            "level": 0,
            "comment": "Congratulations! As a former smoker, I can tell you that the first five days are the hardest. If you’ve made it this far, you can absolutely stay quit. You’ve got this.",
            "score": 1,
            "author": "DieHardAmerican95"
        },
        {
            "level": 0,
            "comment": "Congratulations man!!! Just hit 2 and a half years no alcohol on 6/1 - once the ball gets rolling it gets easier. \n\nHave a good journey my friend",
            "score": 0,
            "author": "Broad-Ad-4705"
        },
        {
            "level": 0,
            "comment": "Congratulations man!!! Just hit 2 and a half years no alcohol on 6/1 - once the ball gets rolling it gets easier. \n\nHave a good journey my friend",
            "score": 0,
            "author": "Broad-Ad-4705"
        }
    ]
}