{
    "id": "147made",
    "score": 34,
    "title": "This is it.",
    "author": "eerie_fondness",
    "date": 1686570991.0,
    "url": "https://www.reddit.com/r/selfimprovement/comments/147made",
    "media_urls": [],
    "other_urls": [],
    "postText": "21F. I’m going to work at a camp in another town 6 hours away from my house. I’ll be living there for 18 days away from my parents and home. I have anxiety and agoraphobia but I want to do this step. I want to have fun and try to be with myself and discover my strength. I know I will be anxious but I’m sure it will worth it and I’ll feel great after that and who knows I might stay longer.",
    "comments": [
        {
            "level": 0,
            "comment": "Good luck!",
            "score": 2,
            "author": "Dingleator",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you mate!",
                    "score": 1,
                    "author": "eerie_fondness"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You are brave! Good luck!",
            "score": 1,
            "author": "Capable-Particular77"
        },
        {
            "level": 0,
            "comment": "Goodluck!",
            "score": 1,
            "author": "BeginningTrainer6350",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks ^^",
                    "score": 1,
                    "author": "eerie_fondness"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Cool!  Sounds outgoing and adventurous.  Hope it goes well for ya.",
            "score": 1,
            "author": "QuinnCrux",
            "replies": [
                {
                    "level": 1,
                    "comment": "It does sound! I hope that too!",
                    "score": 1,
                    "author": "eerie_fondness"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I live in Illinois, but after 2 years of surgical and medical issues i decided to leave and work for a while in California, doing a job that I had no experience in. It was the best experience I could've hoped for, and served as a \"reset\" of my entire life. I hope you have a similar experience.",
            "score": 1,
            "author": "MadBadger87",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s what I’m aiming for",
                    "score": 2,
                    "author": "eerie_fondness"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My anxiety kicks in when I'm on a bridge or somewhere high up or in a situation where I could die, other than that I don't get much anxiety from anything else.  I work at a pet store and pretty much everyone has social anxiety except for me, it's a 10 person crew.  I'm a 40m, Leo, raised by good parents that are still married, I have 3 sisters and no brothers and I've moved around a bit.  I think these things factor into why I don't have social anxiety.  I've been working with my coworkers for about 4-5 years and they all still have social anxiety and the same triggers.  I talk to them about it a lot and I challenge them to get out of their comfort zone.  I don't know how a person overcomes their anxiety and the things that trigger their anxiety???  I believe that challenging yourself and trying to overcome your fears can help.  Then again my fear of heights has never gone away.  If someone has suggestions or ideas on how to overcome your anxiety then I'm all ears.",
            "score": 1,
            "author": "xsplisick",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don’t think anxiety ever goes away. There are just period when it’s better and then worse. You can learn how to handle anxiety attacks. What you said in the end goes for me too. No matter how many times I go somewhere (even every day) I still I’m in the verge of having a panic attack. I’m not sure if it will ever go away but lately I developed a mindset that goes as: “it’s there okay, let it be there I don’t give a fuck anymore” and it kinda helped",
                    "score": 2,
                    "author": "eerie_fondness"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Regardless of how well it goes, just making this decision and going through with it shows your courage and strength already! \nYou have such a good outlook on the situation right now that I have no doubt you will come back feeling so much stronger no matter what happens.\n\nHope you have fun and good luck!\nProud of you, stranger.",
            "score": 1,
            "author": "ChewMatta",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you, this comment put a smile on my face! I see it as a new experience to learn for this. I hope it will inspire me for my book as well!!",
                    "score": 1,
                    "author": "eerie_fondness"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Great initiative!\n\nPeople forget to spend time with themselves.\n\nYou are just a marvelous reminder.",
            "score": 1,
            "author": "mannutech",
            "replies": [
                {
                    "level": 1,
                    "comment": "I love this comment ^^",
                    "score": 1,
                    "author": "eerie_fondness"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is an amazing opportunity! Remember you may stumble and have hiccups along the way but the true strength is not throwing it all in and carrying on when things arent 100% perfect and the way you imagined. Be super kind to yourself along the way. You got this OP.",
            "score": 1,
            "author": "Fontaines_DC"
        },
        {
            "level": 0,
            "comment": "Make sure to enjoy every moment and have fun! Don't focus on the slightest issue, that way you will always be unbothered.",
            "score": 1,
            "author": "IoannesTheMajestic"
        }
    ]
}