{
    "id": "147n1xt",
    "score": 7,
    "title": "Got invited to my 10th year high school reunion but don’t want to go because I’ve achieved nothing",
    "author": "little_scarlett",
    "date": 1686573350.0,
    "url": "https://www.reddit.com/r/selfimprovement/comments/147n1xt",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey everyone!\n\nAs my title says I’ve been invited to my 10th year high school reunion but it makes me really anxious because these parts 10 years haven’t been great. I’ve dealt with mental health issues, recently gotten out of an abusive relationship, my finances are horrendous, I’m only working a casual job and don’t have a career, I coasted through most of the past 10 years and barely have anything to show for it. I know lots of people I went to school with are married, have kids, are working as doctors and lawyers, have travelled all around the world. High school wasn’t particularly fun for me, I was a bit of an outcast.\n\nWhat could I do in the next 5 months to turn my life around and feel like I’ve achieved something? Do I bother going at all?\n\nThank you",
    "comments": [
        {
            "level": 0,
            "comment": "If high school wasn’t amazing for you, and you don’t have friends you want to catch up with at the event, you don’t have to go. What’s the purpose of attending? If that purpose doesn’t mean something to you, no need to even worry about it.\n\nYou can always set goals for yourself to align your life more closely with what you want it to be, but it doesn’t have to be a for a high school reunion. Six months from now, you can look back and be proud of the goals you’ve met so far, for yourself.",
            "score": 6,
            "author": "StitchandReuben"
        },
        {
            "level": 0,
            "comment": "Hey I know it's tempting to compare yourself to other people, but don't. Everyone's journey is on their time line nothing else. You've defeated every bad day so far. You've faced challenges and disappointment and you're still here. You are valid merely for existing. If you decide to go, just have fun. Fuck what others think.",
            "score": 3,
            "author": "Derpasaurus_Rekts"
        },
        {
            "level": 0,
            "comment": "Your classmates are 27-28 years old. They’ve accomplished nothing either.",
            "score": 1,
            "author": "lostkarma4anonymity"
        },
        {
            "level": 0,
            "comment": "Can’t believe people still do these",
            "score": 1,
            "author": "rcadephantom",
            "replies": [
                {
                    "level": 1,
                    "comment": "They so dumb imo 😂",
                    "score": 1,
                    "author": "CanadiannBoy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Nobody is forcing you to go. Most people don’t give a fuck about hs 10 years after graduation.",
            "score": 1,
            "author": "lexmarkblenderbottle"
        },
        {
            "level": 0,
            "comment": "You don’t need to achieve things to be worthy of love and respect",
            "score": 0,
            "author": "rcadephantom"
        }
    ]
}