{
    "id": "147pwku",
    "score": 0,
    "title": "I want to be happier",
    "author": "frndly_neighbour_nay",
    "date": 1686584083.0,
    "url": "https://www.reddit.com/r/selfimprovement/comments/147pwku",
    "media_urls": [],
    "other_urls": [],
    "postText": "I (20F) have recently been going through more depressive episodes than usual. Whilst it is not unusual for me, it is becoming a lot more prominent and is starting to become a problem in my daily life and in my relationship. I want to find ways to unpack my insecurities and learn how to be more content in myself to be a happier person and a better person. I can't afford therapy as I am reliant on my parents. Any recommendations for books or youtube channels would be appreciated.",
    "comments": [
        {
            "level": 0,
            "comment": "Set a physique goal: work towards it for three months. Other things are secondary. Get back to me with the results after three months.   Books/YouTube? Search for Friedrich Nietzsche.  \n\nI can tell you that u lack a purpose. What are your long-term end goals? Quit social media like Instagram, at least reduce. The global prevalence of depression in young girls is rising reported by the UN. This is no surprise that you are one of them. \n\nI can tell you boredom and suffering are all normal. Don't be so hard on yourself. Even happiness is fleeting. You don't have to be in a perpetual state of bliss. Embrace those happy, spontaneous moments. \n\nAccept that you are bored, unhappy, and depressed. So what? Life goes on, the economy goes on, and nature goes on. The Universal doesn't care; people around you only care about themselves and think about themselves most of the time. U need to take action for yourself and do better for yourself. Prolonged action will stick u in the deeper state of your depression. Start now! \n\nFind the root cause of the problem and address the issue. U don't know where? Maybe the solution is to use envy as a tool; you envy that successful banker girl? Good, that's your personalised custom instinct that hints u work toward that goal. What about that time you envy that body goal of yours you always want to achieve? That top student in your class always gets u in tiptoe. Good then. Surely u envy those people who must only be cos you want to be like that person. Now work towards then. \n\nGood luck. \n(Rmb, suffering is normal. There is no growth without suffering. Learn to rest on a side road and luxuriate yourself at times or necessary and get back to the main road when ur ready. Repeat the process)",
            "score": 1,
            "author": "xxkrxx07"
        }
    ]
}