{
    "id": "147uyvb",
    "score": 0,
    "title": "How do I get over this guilt?",
    "author": "saintgeorgette",
    "date": 1686597023.0,
    "url": "https://www.reddit.com/r/selfimprovement/comments/147uyvb",
    "media_urls": [],
    "other_urls": [],
    "postText": "I was a straight A student. But I was diagnosed at 11 with bipolar and at seventeen with Schuermann’s Disease, a painful disease that starts in your spine and essentially twists your bones so they break. I have epilepsy and have hardly any warning before having a seizure, which happen at least once a week. I take 23 prescribed pills a day, along with OTC pills as needed when I need extra pain relief or heartburn from the amount of meds or whatever. I’ve been disabled since I was a child. There was never a plan for me to go to any university besides community college, even though I had high SAT and ACT scores and received academic awards from my private high school. My dad abandoned the family when it got hard, so I live with my mom full time, and I know it’s draining on her, even though I do all the chores my disability allows and cook 1/2 the time. We have it set up that when my mom dies, we will build an in-law unit on my sister’s property for her to keep an eye on me and make sure she can take care of me. \nMy IQ is genius high. But my body prohibits me from doing a lot, and all of my psychiatric diagnoses…. Basically I’m stuck at the maturity of a 16 or 17 year old. Someone will have to take care of me the rest of my life. My mom set up a trust so my sister will have the money to take care of me and be able to pay my sister some money each month for taking care of me too. \nBut how do I get over the guilt that I can’t go out and get a job and take care of myself and not be a burden to my family? Because that’s what I feel like. A burden and an obligation. No way would my sister have me live on her land unless my mom had the trust and built the house for me, and was able to pay her via the trust. My sister and I were close as little girls, but kinda went our own ways in high school. I easily exasperate her by asking questions when I don’t understand simple concepts. And my mental health will only decline the older I get. \nHow do I get over the guilt that I’m a family obligation to be taken care of? How do I cope with the fact I’m a burden to anyone I live with? My single biggest fear is being alone. How do I translate this into something positive?",
    "comments": [
        {
            "level": 0,
            "comment": "1. This isn't your fault.  Keep telling yourself that over and over. So you can try to jettison the guilt.\n\n\n2. Look into what you options on government disability.  Seems like many people qualify for much less. See how it's impacted by employment\n\n\n3. There are help wanted signs everywhere in the US at least. Go get a job, if it doesnt kill your government benefits. Any job. It'll make you feel better.  Then, assess from there if it's right or not.",
            "score": 2,
            "author": "TVsDeanCain"
        },
        {
            "level": 0,
            "comment": "Bipolar at 11?",
            "score": 1,
            "author": "MinuteAssistance1800"
        },
        {
            "level": 0,
            "comment": "Write or do creative things. In that situation I'd do a lot of art. And maybe you'd make money off it eventually.",
            "score": 1,
            "author": "Sanity_LARP"
        },
        {
            "level": 0,
            "comment": "I also have Scheurmann’s kyphosis, likely not as progressed as yours from the sound of it but I understand that feeling at least. It fucking sucks seeing everyone around you be physically able to do simple things that would cause you unbearable pain. But we didn’t ask for this. As someone said above; it’s not your fault. You aren’t a burden to the people who love and care about you, even though that’s what your brain is saying. You are not a “family obligation to take care of”, you’re a human being who deserves love and happiness just as much as anybody else. These are things I have to remind myself of constantly, as I’m in a similar situation (24, still living with parents, job pays absolute dogshit). I can’t imagine how it feels having epilepsy and bipolar on top of that, but I’ve fought through years of anxiety, depression, and likely some undiagnosed ASD or ADHD. I know the mental health struggles make it even harder to help counteract the physical strain, but the more you try to keep yourself up and moving, the less pain you’ll be in from the Scheurmann’s. I just recently started doing physical therapy and I’ve already noticed a difference in my range of motion and posture, which in turn has helped boost my confidence. I hope you’re able to find something that can help you in the same way.\n\nIf your disabilites have been officially diagnosed, maybe try applying for a job that doesn’t require much bending, twisting and lifting. I worked in security for a few years without much issue, though some posts will require walking, standing or sitting for prolonged periods of time. A lot of the people I worked with were elderly, had physical disabilites, or both. Just be honest while applying and they will work around whatever restrictions you have. The bigger companies like Securitas will literally hire anybody with a pulse, and if you’re smarter than the average 5th grader you can easily work your way up to a supervisor position making $15+ an hour.",
            "score": 1,
            "author": "brainrot_haver"
        }
    ]
}