{
    "id": "148127o",
    "score": 1,
    "title": "I have done my managing of my time based outside of habit rather than schedule and it has worked.",
    "author": "InfinityAero910A",
    "date": 1686613389.0,
    "url": "https://www.reddit.com/r/selfimprovement/comments/148127o",
    "media_urls": [],
    "other_urls": [],
    "postText": "About 2 months in and it has worked. Albeit I have less food, I have been more productive than I have been in the past 6 years. Exercise is the same with slight gains as I have done the past month with 50 reps in push ups, sit ups, arm curls, and about 150 squats. Also less days having been done working out which is due to a tightness while working out. Regardless, making work on this and intend to increase build further once I manage to get a better income so I can buy more and better quality food. \n\nFor studying, I have picked up reading and studying outside of schooling for the first time since my freshman year of high school. A near full 10 years. It is rather difficult in concentrating, but I am retaining what I pick out of it. With this in mind, I will indeed make my way back into university to get my degrees and better paying work with those degrees.  \n\nFor finances, I almost have some credibility to get a car, but not there as of yet. As of now, still saving up money from where I work at while looking to other work. I have also been introduced to stocks and currently sitting on investing into specific technology stocks like computer chips and AI. If any of you professionals want to say, you can tell me which area of technology is most worth into investing right now. \n\nI have to say, I have learned so much about myself and about other people from these past 6 years and especially this pandemic. I have learned a lot of messed up and also beautiful things about all of this. Learning about how I had been instilled into just copying those and always going along with whatever else people say around me. Even with rights and wrongs being different. This being pushed further with the pandemic. Also seeing that I had taken a personality that I had never even actually wanted to really begin with which went against my own real gender identity as well.\n\nI am frankly angry with the way so many people are treated just for wanting to be better and I am intent on making changes to it. Specifically, this entire normalizing mindset where people demonize everything that isn't \"normal\", this \"realistic\" mindset where people sacrifice trying anything worthwhile just for what they think is assured, and only focusing on fixing the youth. It has made me blood boiling angry for the past 7 months since I started working again. I took these mindsets along with a version of these mindsets while applying them to what are supposed to be alternative mindsets. \n\nI will also say I do not regret being where I am at. Being here let's me have a chance of success that stands as true success rather than the fake success of people in so many other places. You people look at these people who get amazing jobs with what people describe as beautiful girlfriends and more while not showing that they probably have arguments over ridiculous things right before they post them. Not looking to see that the money many of these people got were attained through connections and poor financial stability that can go down any point in time. Popular people who mostly have fake connections and even with the #metoo movement, having women coming forward to expose a lot of manipulation and immoral behaviors. Even in school with cheating on exams and getting away with it. \n\nAll of which also often try to sell the point of being the same. I say I refuse to do so. People have been acting the same long enough and this toxic social cohesion needs to come to an end. People have always evolved and in this case, people need to evolve more. I intend to take the group that will experience such evolution and not only have more meaningful success, but success that exceeds what these commonly depicted successful people have. Will make progress on this for month 3. ",
    "comments": []
}