{
    "id": "14826ge",
    "score": 1,
    "title": "Testosterone levels as a 13 year old with about 1 1/2 Testicles",
    "author": "RemarkableRaisin99",
    "date": 1686616822.0,
    "url": "https://www.reddit.com/r/selfimprovement/comments/14826ge",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m a 13 year old boy who was born with an undescended testicle. My left one descended correctly, however the right one had to be placed into the scrotum surgically when I was 3. I have noticed that the left one is rapidly growing while my right one has barely increased in size. My growth does not seem to be affected, as I have developed hair in those places, however I am not able to get a testosterone test and I really want to know if the rest of my life, gains in the gym and my ambition in life will be hindered from low testosterone.",
    "comments": [
        {
            "level": 0,
            "comment": "Go to the doctor get your hormones checked and let them know of your concerns. It’s good that your conscious about this at an early age. A lot of people don’t realize how important developing properly through puberty is. Btw (something that may not be so obvious) but one testicle tends to hang lower in the scrotum than the other one.",
            "score": 4,
            "author": "CosbysSpecialSauce"
        },
        {
            "level": 0,
            "comment": "One have mine has always been 1.5 times the size of the other.  No issues",
            "score": 2,
            "author": "TheHelpfulDad"
        },
        {
            "level": 0,
            "comment": "You need to go to the doctor",
            "score": 1,
            "author": "RandomNumbers42069"
        },
        {
            "level": 0,
            "comment": "Both of mine had to be surgically lowered when I was 8, and I found out when I was 17 that my testosterone was ~200ng/dl which is very low. Why can you not get a testosterone test?",
            "score": 1,
            "author": "gangstabunniez",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don’t know how I would bring that up to my parents… was puberty/growth affected for you in any way?",
                    "score": 1,
                    "author": "RemarkableRaisin99",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You can bring it up to your doctor the next time you go in. I *think* it may have affected growth, I had a tough time putting on any muscle in highschool and I never had a \"growth spurt\" like a lot of people do (I'm 5'5\").",
                            "score": 1,
                            "author": "gangstabunniez"
                        }
                    ]
                }
            ]
        }
    ]
}