{
    "id": "lkfuhh",
    "score": 2040,
    "title": "Last year I was suicidal. This year I got myself a sixpack",
    "author": "Dascha_o",
    "date": 1613402838.0,
    "url": "https://www.reddit.com/r/selfimprovement/comments/lkfuhh",
    "media_urls": [],
    "other_urls": [],
    "postText": "Not the beer one. I’m slowly progressing forwards. College might take a while, but I’m doing small steps. \n\n\nEveryone struggling right now: it will end. You will get out of there. You don’t need the perfect body. Learn to love yourself, it takes a while. I’m proud that you are holding the stand right now!\n\nEdit: Also my Post blew up, so I got that going for me, which is nice.\n\nThank you all! You are amazing!",
    "comments": [
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 139,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "20.0 kg is 44.05 lbs",
                    "score": 107,
                    "author": "converter-bot",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Good bot",
                            "score": 81,
                            "author": "Dascha_o"
                        },
                        {
                            "level": 2,
                            "comment": "I love you",
                            "score": 35,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I love you both",
                                    "score": 36,
                                    "author": "agree-with-you",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "r/wholesome and r/usernamechecksout",
                                            "score": 21,
                                            "author": "NoFapAcctForMe"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My friend said to me: it’s about being healthy, not looks. I’m glad you are working so hard! I hope you are proud of yourself. Watch out for your joints, don’t overstress your Body :)",
                    "score": 33,
                    "author": "Dascha_o",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What if my only motivation to be healthy is looking good?",
                            "score": 14,
                            "author": "SoBitterAboutButtons",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 8,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "There's the rub. It's hard to love myself. But I'm working on it everyday. Much love and good luck.",
                                            "score": 7,
                                            "author": "SoBitterAboutButtons"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Good advice. My joints are all beat up from hero- lifting when I was younger",
                            "score": 5,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m doing similar things, good luck with everyone who’s doing self improvement",
            "score": 37,
            "author": "Broken_Keyboard0081",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s so hard sometimes, especially with a lot of selfimprovement videos showing „how to be perfect, charismatic,...“ \n\nIt’s not about comparing, just slowly progressing and a whole lot of self acceptance!",
                    "score": 24,
                    "author": "Dascha_o",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Great advice I once read on Reddit: don’t compare yourself with others, but with yourself.\n\nTake a look at the progress you made. If you made progress, great! A reason to be proud and keep going. If you didn’t make progress, great! A reason to start right now.\n\nKeep a positive mindset, don’t bring yourself down by comparing yourself to other people who might have a totally different position than you do in life.",
                            "score": 9,
                            "author": "Abollix"
                        },
                        {
                            "level": 2,
                            "comment": "Couldn’t agree more",
                            "score": 3,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "Once you're hot and can get laid anytime.. Youll be naturally confident..",
                            "score": 3,
                            "author": "vampirejessica",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think I am kinda attractive, but my field of fucks is barren.  I dunno, the whole dating thing is exhausting.",
                                    "score": 4,
                                    "author": "Dascha_o",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I’m betting you know what’s great advice and what should be ignored. I’ll leave it at that.",
                                            "score": 4,
                                            "author": "[deleted]"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Don't date.. Just fuck.. Heh.. I dont even chat much.. Just hey.. Talk a bit.. Wanna grab a drink.. Then fuck\n\nEdit; workout.. Find your style in talking chill and confident.... People will fuck u",
                                            "score": -8,
                                            "author": "vampirejessica",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "We get it, you fuck women. r/ihavesex",
                                                    "score": 6,
                                                    "author": "ilovepineapplepizza7"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 2,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Illiterate huh? Sure thing bro...  Im an architect my friend.. And im very much literate and knowledgeabke.. But keep yo head up yo ass.. Its easier than to think  and make cognitive effort",
                                                            "score": -3,
                                                            "author": "vampirejessica"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "So now you're suicidal with a sixpack?",
            "score": 14,
            "author": "Silvershot767",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hehe. I feel down sometimes, still, yes. That’s the psychological side of it. Sloooowly changing your thoughts.",
                    "score": 12,
                    "author": "Dascha_o"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What workout do you do? I'm having really hard time to lose weight, I know I just whatever I want, but does it really punihmy progress if I just eat cake or ice crram once in a while?",
            "score": 10,
            "author": "Band1c0t",
            "replies": [
                {
                    "level": 1,
                    "comment": "Losing weight really comes down to your diet.\n\nFigure out your TDEE with online calculators. This will estimate about how many calories you need a day. Then eat 300-600 LESS than your TDEE.\n\nAlso, you should set up your macro nutrients (protein, fat, carb). Lots of info online to do that.\n\nAlso, you should lift weights. Will ensure you lose fat, not muscle.",
                    "score": 12,
                    "author": "Sagebeing"
                },
                {
                    "level": 1,
                    "comment": "I read that having a cheat day ones in a while isn’t bad. You are human after all and it’s okay to enjoy good. \n\nBuuuuuut: I only drink tea, water and coffee (unsweetened). That way I can count my calorie intake much better. I try to avoid sugar, because it Leads too insulin highs making you hungry again.\nAlso bigger meals in the morning and midday, less in the evening (so you burn over day and don’t get new fat while sleeping). \n\nIt comes down to calorie intake, activity is a huge factor in this. But diet can do more for you. I suggest food that keeps you full for a long time (very dark bread, stuff like that) that avoids insulin highs, gives you energy for your day (keeping you sane) and is transformed slowly. I mix milk sugars (lactose) with carbohydrates. Milk sugar is free after 30min, carbohydrates after two hours. \n\nAlso cardio cardio cardio! If you don’t have much muscles, Build some first so you have a tool to burn fat more efficient. Then: long walks, riding the bike, jogging. You don’t have to be fast, you don’t have to be good looking, you only have to be consistent. \nStart slowly, so your joints and tendons have a chance to adapt to the new stress, you wanna keep that shit healthy and functional more than having new muscles.\n\nAlso: there are reasons you are how you are right now. And that is fine. Everybody has a upbringing we can’t control and a lot of behaviour from that sticks. While you are perfect the way you are now, a masterpiece of a Human adaptating to circumstances, you can slowly change yourself now. It takes time.",
                    "score": 13,
                    "author": "Dascha_o"
                },
                {
                    "level": 1,
                    "comment": "Eating it once in a while is fine.",
                    "score": 2,
                    "author": "ilovepineapplepizza7"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I wish i could see an end. I used to think i was sad because i had no money, then i got 2 raises and cashed out my crypto. Still unhappy. Then i thought well it’s probably loneliness. Then i got a girlfriend. Still unhappy. It’s an awful feeling of being unhappy for an unknown reason.",
            "score": 11,
            "author": "zbf",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’d suggest therapy. It helped me so much. Medication if needed as well, it can greatly reduce anxiety/depression. Always paired with therapy though. \nSometimes it’s about learning to think realistic (hence more optimistic) about the world again.",
                    "score": 7,
                    "author": "Dascha_o"
                },
                {
                    "level": 1,
                    "comment": "You need to go to therapy. To find out what’s going on deep down inside. Hope you find happiness soon",
                    "score": 3,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "I’m sorry. Hope you find the cause. Though, another person is never the answer to loneliness. You can be surrounded by people and still feel lonely. The real way to know if it isn’t loneliness, is to gauge how you are when you’re alone. Some people can’t spend time alone without feeling lonely:- So they constantly distract themselves with entertainment or with other people. If you can spend time with yourself without distractions or without another human and not feel lonely, then you can go “Ok the issue is not loneliness”. Getting a gf doesn’t eliminate loneliness as the cause. My humble opinion.",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I honestly disagree. A loving relationship, especially one with a foundation on unconditional love can do wonders to mental health. It also helps against loneliness, which can be a depression starter. \n\nYou do make a good point in the sense of functionality of relationships though. It’s important to have a good partner. Not just going into dysfunctional relationships.",
                            "score": 1,
                            "author": "Dascha_o",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I love your disagreement. Lol Yes a loving relationship can definitely help your mental health but your motivation for doing is just as important as the action. If the motivation behind going into the relationship was; I want to give this person unconditional love as opposed to “I don’t want to be lonely”. That makes a whole lot of difference to your mental health. With one, you’re not looking for the cause of your loneliness and instead dealing with the symptom. With the other reason, healing from loneliness comes as a byproduct of love.\n\nAlso how do you give someone unconditional love if you can’t give that to yourself?",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I love you both",
                                            "score": 2,
                                            "author": "agree-with-you"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I see your point! It’s right to care for and to be in good terms with yourself. That is important for a relationship, while it goes the other way around as well. Multiple times now I saw friends of mine, who struggled with themselves (depression, burn out, bulimia) who profited hugely from their new relationships back then. You never really know if a relationship will be good and I find it kind of illogical to stay out of one just to build yourself up. I think it’s much more easy to give unconditional love to other people than to yourself, since we as humans tend to be more okay with the flaws of others and less with our own.\n\nI also saw cases of people going into relationship just because they can’t be alone, turning out dysfunctional but keeping it up never the less. \n\nMaybe it comes down to self reflection? Why do I want to be with that person? Because I’m lonely? Or because I love this person?\n\nThat’s my thought process so far, maybe you can take some out of it, or maybe you disagree. Don’t hesitate to, I’d like to hear your opinion on this!",
                                            "score": 2,
                                            "author": "Dascha_o",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Ahh I get your point of view. And yes I’m focused on the motivation for getting into a relationship. \n\nYou don’t have to stay out of one to build yourself up. But it’s a disservice to you and to the other person to get into one AND stay in it with the motivation of “not being lonely”.\n\nAnd I believe you can’t give what you don’t have.     The whole point of loving unconditionally means that love is not dependent on whoever is receiving the love. It solely depends on who is giving the love. And you can only give to the extent you have or have built inside of you, well unless you borrow love from someone. Lol bad joke. Hahaha I’m so funny...Not. 😂\n\nOk back to being serious.\nSometimes we see the expressions of love and confuse it for love. Let me explain. Someone can only be infatuated with you and express affection, care, go the extra mile for you, sacrifice for you etc. But it’s possible that, inside, those actions don’t stem from a place of unconditional love, there might be other motivations behind those actions. But those are all expressions of love aren’t they? To care , sacrifice, show affection etc. So it’s easy to see these expressions and easily assume that they are from a place of unconditional love (or from the extent of love that person makes you believe they have for you) meanwhile the real motivation is just infatuation or fear of being alone etc. \n\nAnd lastly, I believe love is not a destination to get to. It’s a perspective you walk by every day, something you receive and learn from others, make conscious decisions to grow into it and then make choices to reflect that. So you can be at any point in your journey and give someone the extent of the love you have and then keep\nlearning to grow in unconditional love. It’s like a river that flows, as Opposed to a pond that stays still. And as you grow in unconditional love, I mean really grow, you’ll find yourself receiving (from yourself)what you have built inside of you and like that river flow, it goes to other people.\n\nYou can be depressed, lonely, all these things and still have love in you and are building unconditional love but “building love” pretty much is...learning every day to grow the ‘unconditionality’ of the love in you. \n\nAnd I believe an expression of love is; examining the reason why you’re in a relationship. Is it out of fear of being lonely? Or because you truly love? Or a bit of both? There’s always an opportunity to learn and grow the love in you to be more unconditional.\n\nPeople express love in different ways but it’s about the heart behind why you do the things you do. And no I don’t think you can give someone what you don’t have in you. \n\nThis is a whole book haha but I like our conversation. So tell me what you think.",
                                                    "score": 2,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Good shit! I was suicidal a couple months ago but I’ve gotten over it",
            "score": 15,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "That‘s such a huge step! I’m glad you are able to handle it now!",
                    "score": 2,
                    "author": "Dascha_o"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That's great bro. I'm happy for you",
            "score": 25,
            "author": "sunenjoy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you man!",
                    "score": 7,
                    "author": "Dascha_o"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 5,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Good! I listen to slipknot when I’m not in the mood for activity. Afterwards I am.",
                    "score": 4,
                    "author": "Dascha_o"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I am happy for you",
            "score": 5,
            "author": "SalvadorCastellanos"
        },
        {
            "level": 0,
            "comment": "you're doing amazing my guy",
            "score": 4,
            "author": "mlted_strawbrries24"
        },
        {
            "level": 0,
            "comment": "That’s so great, I’m so happy for you! Not a small feat",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Amazing. I’m a firm believer that the gym is life’s natural antidepressant.\n\nMusic blasting, muscles pumping, blood flowing.. feels good.",
            "score": 3,
            "author": "Sagebeing",
            "replies": [
                {
                    "level": 1,
                    "comment": "It definitely helps! As long as you don’t wanna overachieve it’s a great balancer.",
                    "score": 2,
                    "author": "Dascha_o"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Dude everyone thought you meant the beer one.",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Awesome dude, never got suicidal, but gym work and taking care of your body and self helps a lot to beat any dark intrusive thought. \n\nAlso I lost mine in 2020, but in 2021 gonna get it back\n\nEdit: to give sense cos I am on mobile",
            "score": 3,
            "author": "disignore"
        },
        {
            "level": 0,
            "comment": "happy for you!  I'm trying the same thing this year, and right now I'm having the best consistency I've had in years.  It feels good.  I know there is greatness underneath, I just need to keep digging.  Keep at it!",
            "score": 3,
            "author": "johnnie4563"
        },
        {
            "level": 0,
            "comment": "Amazing job!!!. I’m still working on the six pack i never had lol..",
            "score": 3,
            "author": "ineedavacation4"
        },
        {
            "level": 0,
            "comment": "I'm on my way to getting a six pack too. I'm already noticing my gains. I'm dedicated now.",
            "score": 3,
            "author": "ilovepineapplepizza7"
        },
        {
            "level": 0,
            "comment": "Im proud of you man!",
            "score": 3,
            "author": "yaboijimbo123",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well and I wish you a happy cake day man!",
                    "score": 2,
                    "author": "Dascha_o",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "10q dud",
                            "score": 2,
                            "author": "yaboijimbo123"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm suicidal sometimes and already have a six pack. No way out for me then",
            "score": 4,
            "author": "Feeling-Sail9886",
            "replies": [
                {
                    "level": 1,
                    "comment": "Inner and outer world are different things, right? I find activity very helpful, but it’s just one thing that helps me. Therapy did a lot for me as well. And the lockdown somehow does too. No outer world stress. I could stare at my wall for hours and call it a productive day afterwards. I somehow enjoy it.",
                    "score": 2,
                    "author": "Dascha_o"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Got my self a keg instead 😏",
            "score": 2,
            "author": "Artistic_Tradition50",
            "replies": [
                {
                    "level": 1,
                    "comment": "You go Man! I hope you pet it on a regular basis. It deserves love as well.",
                    "score": 1,
                    "author": "Dascha_o"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Well done mate",
            "score": 2,
            "author": "__data_science__"
        },
        {
            "level": 0,
            "comment": "I don’t know who you are but am so proud of you man :)",
            "score": 2,
            "author": "ss170"
        },
        {
            "level": 0,
            "comment": "Based, you dropped this 👑",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Thanks for sharing",
            "score": 2,
            "author": "Embarrassed_Track388"
        },
        {
            "level": 0,
            "comment": "badass",
            "score": 2,
            "author": "capralis_"
        },
        {
            "level": 0,
            "comment": "Absolute unit 💪\n\nWell done!",
            "score": 2,
            "author": "Captain_Braincell"
        },
        {
            "level": 0,
            "comment": "Thanks so much for the encouragement, and awesome progress! If I may ask, what do your workouts look like?",
            "score": 2,
            "author": "Ruffled_Ferret",
            "replies": [
                {
                    "level": 1,
                    "comment": "I do a lot of push-ups ( on fists so my elbows are close to my chest—&gt; healthier for your shoulders), just began a workout plan to get to 100 push ups in a single go.\nAlso pull-ups with legs in front. A lot of planking as well.  And crunches (not sit ups! —&gt; better for your lower back).\nI made the maximum of each. After that I halved the numbers and try to reach it 4 times in a row (4sets), with the last set going into maximum numbers again. \nNot su much for the legs atm, because my ankle is doing weird noises from overstressing last year.",
                    "score": 1,
                    "author": "Dascha_o"
                }
            ]
        },
        {
            "level": 0,
            "comment": "❤️",
            "score": 2,
            "author": "Curious-cactus3"
        },
        {
            "level": 0,
            "comment": "👑",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Last year I was suicidal, this year I wish I had never been born, baby steps!",
            "score": 2,
            "author": "gravitydood",
            "replies": [
                {
                    "level": 1,
                    "comment": "Been there, done that. You know, holding this thoughts out is such a massive task. You are doing good, even if you feel miserable. That’s much more work than going to the gym a couple of times.",
                    "score": 1,
                    "author": "Dascha_o"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Well done man!",
            "score": 2,
            "author": "HeavyAssist"
        },
        {
            "level": 0,
            "comment": "I'm doing pretty much the same thing. Starting community college soon. A long ways off from a 6pack but I'm healthier than I've been in years. \nCONGRATS ON THE PROGRESS DUDE!! Thanks for the inspiration",
            "score": 2,
            "author": "Rdc1987",
            "replies": [
                {
                    "level": 1,
                    "comment": "No one needs a sixpack. My female flatmate looked at me and said: Nahh man, that’s not important for me. \nCool woman.\n\nCongrats on starting community college!",
                    "score": 2,
                    "author": "Dascha_o"
                }
            ]
        },
        {
            "level": 0,
            "comment": "A 6-pack might not solve all your problems, but it does signify some progress worth celebrating!!!! Best wishes on your journey, OP! You’re doing great!",
            "score": 2,
            "author": "SometimesIEatDonuts"
        },
        {
            "level": 0,
            "comment": "You are right man - you don't need a perfect body, just get in shape for yourself and feel better about yourself that's all that matters.  Striving for the perfect body can have negative side effects.",
            "score": 2,
            "author": "mdog111"
        },
        {
            "level": 0,
            "comment": "I’m a skinny mother fucker. 2-3 years ago I was an extra skinny mother fucker. I gained 27 pounds since then, and I’m now hitting the gym and seeing the results. I honestly can’t wait to see what I’ll look like after 3-6 more months. \n\nSo much stress from the low confidence and low self esteem I had built up from feeling like I wasn’t wanted by women, let alone the disrespect I would get from people has motivated me to turn my hatred towards something good. I was suicidal too at some point. I got therapy and ended up coming out of it. \n\nNowadays, not even being infatuated over a girl gets me down anymore. I guess because I’ll know my worth soon enough? Who knows. But thanks for this post man! Gives me hope.",
            "score": 2,
            "author": "metrosuccessor2033",
            "replies": [
                {
                    "level": 1,
                    "comment": "That cuts close to the bone. I was underweight. 67kg with 1.81. skinny af. I’m now around 74/75. since I wanted to primaraly gain muscles, it took a long time to get the weight on. Around two years with the biggest gains in year one. Stick to it and eat. Carbohydrates work like MAD for this.  I don’t eat meat, plain vegetarian, which seems to be good for muscle growth as well. (Unsure about this, but the documentary ‚game breaker’ on Netflix was highly informative on it)",
                    "score": 1,
                    "author": "Dascha_o"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What exercises helped you lose weight and gain defined abs?",
            "score": 2,
            "author": "Drunkoffhenny",
            "replies": [
                {
                    "level": 1,
                    "comment": "Crunches mostly. Planking also. I should also state that I climb/Boulder on a regular basis. A great sport for your arms,shoulders and core.",
                    "score": 3,
                    "author": "Dascha_o"
                }
            ]
        },
        {
            "level": 0,
            "comment": "my first thought when I saw this was 'FUCK YES!!!!!\" \n\nI'm so proud of you!",
            "score": 2,
            "author": "Potential-Flounder-1"
        },
        {
            "level": 0,
            "comment": "that’s so good to read, congrats!!! wish i can be like you someday. i can’t go to the gym bc the idea of getting healthier to me gives me panic since it means i’ll live longer (in my head) and i don’t want it.",
            "score": 2,
            "author": "tulippuff",
            "replies": [
                {
                    "level": 1,
                    "comment": "You could get cardiac arrest by working out though. Possible loop hole?\nYou don’t necessarily live longer. Statistics say so, but you aren’t a statistic. It will greatly improve your later years though. \nMaybe start with something funny. I climb/Boulder a lot in my free time. It’s fun as hell. Same loophole here. :D",
                    "score": 3,
                    "author": "Dascha_o",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "i really need to find myself in some activity it would be awesome. thanks for the tip :))",
                            "score": 2,
                            "author": "tulippuff"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "happy for you",
            "score": 2,
            "author": "basketballcross"
        },
        {
            "level": 0,
            "comment": "Man, you must be very tough from inside.",
            "score": 2,
            "author": "Savings_Push_5824",
            "replies": [
                {
                    "level": 1,
                    "comment": "I dunno. I’m not a resilient type. But I try do be honest. I’m gonna be an elementary teacher, let’s see how things will work out.",
                    "score": 2,
                    "author": "Dascha_o",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "All the best.",
                            "score": 2,
                            "author": "Savings_Push_5824"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Great!\n\nYou literally can do ANYTHING you want if you just decide to solve for yes.",
            "score": 2,
            "author": "Impossible_Swing_304"
        },
        {
            "level": 0,
            "comment": "YAAAAAAAAAS!",
            "score": 2,
            "author": "ChangeMe2021"
        },
        {
            "level": 0,
            "comment": "Very happy to hear this. I’m in my second lowest point in life, last time was 5-6 years ago. In the last year I’ve came out of a relationship, and lived alone through lockdown for the majority of 12 months almost. Today I took a big step and moved back to my Dads for a while to clear my head and have some company. \n\n\nI feel very up in my head at present, generally unhappy and wanting to regain some of my former self...but then aren’t we all?\n\nI’m trying to stay positive, started medication and mindful journaling so hopefully that will be the beginning of a positive change, I really hope so. \n\nThank you for sharing your positive news, well done.",
            "score": 1,
            "author": "BoostedBenji"
        },
        {
            "level": 0,
            "comment": "Sounds like a bad sales pitch.",
            "score": 1,
            "author": "BlunderMeister",
            "replies": [
                {
                    "level": 1,
                    "comment": "Try Pabst Blue Ribbon. 🤟🏾",
                    "score": 3,
                    "author": "Dascha_o"
                }
            ]
        }
    ]
}