{
    "id": "lnm27l",
    "score": 2151,
    "title": "We attract what we believe we are worthy of instead of what we actually deserve.",
    "author": "erinpanzarella",
    "date": 1613757273.0,
    "url": "https://www.reddit.com/r/selfimprovement/comments/lnm27l",
    "media_urls": [],
    "other_urls": [],
    "postText": "I used to think that if I was a good person, things should work out for me. I spent a lot of times doing things that were “good”. I put others over myself and thought that meant good things would happen to me, and well, that didn’t work out as I had expected. I did everything I was supposed to do and ended up sick, tired, and miserable because my underlying beliefs were that I needed to do / be something other than what I was in order to be worthy. \n\nI used to be a perfectionist. I used to be so tough on myself. I never believed I was worthy of good things. My outer life reflected that. I was addicted to adderall, nicotine, anorexic or stuck in disordered eating, over-caffeinated, sleep-deprived, constantly in toxic relationships, and in crippling debt. I thought poorly of myself based on old stories I clung onto. \n\nI’ve healed so much over the last few years but recently I realized that I never stopped to look around to where it got me. I never basked in the glory of this moment. And I still felt badly about myself. \n\nI decided to learn different healing modalities and just tune into myself daily. Instead of thinking of it as work, or something to change, I now know it’s something to do to understand my own beautiful uniqueness and capabilities. \n\nA few weeks ago I had a huge shift. I know it’s because of all of the things I’ve done over the last few years, and because I’ve finally accepted the fact that I am worthy and fully believe it. That feeling hasn’t wavered for weeks, and I don’t see it happening but maybe it will. I have tools to help. \n\nMy life today is beautiful and I feel very grateful. I’ve got everything I need and many things I want. I have a stable job, many things I’m passionate about, and am building a business in addition to my full-time job. \n\nTwo days ago, I had made a mistake. A simple one, but historically, no matter the size of the error, it would send me into a spiral: “I’m an idiot!” “What’s wrong with me?” And ruin my whole day about it. But two days ago, I literally sang, as if I was a kid, “I made a mistake, and that’s OK! Everyone makes mistakes!” Immediately after, I smiled so big because that was showing something deep down inside of me has shifted immensely. \n\nI just received some praise at work yesterday and I was fully open and knew I was deserving of it. It was a big moment as many important people were there to hear it, and I was singled out by name. I didn’t shy away or downplay it, I said thank you, proudly!\n\nThings are falling together because I finally know that I am worthy. \n\nI just wanted to let you know that really wonderful things can happen once you focus your energy on you. We can’t change what we did in the past. I spent so much years in shame over things I did when I didn’t know better. Beating yourself up today does nothing but ruin this moment. \n\nI wanted to share some affirmations as a practice if anyone is interested. They have really helped me on my journey. \n\nI am worthy.  \nMy past doesn’t define me.  \nEvery day I can choose a different way of showing up.  \nI deserve the life I want.  \n\n_\nTL;DR\n\naffirmations:  \n\nI am worthy.  \nMy past doesn’t define me.  \nEvery day I can choose a different way of showing up.  \nI deserve the life I want.\n\nEdit:\nThank you all for the support. I’m so glad so many of you resonate. I have a podcast called Everyday Perspectives where I unpack topics like this, shifting mindset from victim to co-creator with life. It’s available on all major podcast platforms if you’re interested &lt;3",
    "comments": [
        {
            "level": 0,
            "comment": "Very touching! This is the type of life we should all aspire to live.",
            "score": 98,
            "author": "notme1420",
            "replies": [
                {
                    "level": 1,
                    "comment": "Aw that’s so sweet &lt;3",
                    "score": 20,
                    "author": "erinpanzarella"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m feeling miserable today for the exact same reasons of beating myself up over the past and i think this is just what I needed to read. I’m doing better but I still have those days where I feel like shit.",
            "score": 62,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s called a pity party and sometimes we need to do it . Cry, cuddle up and eat carbs. Lol Then dust ourselves off and say “Ok I am smarter now because of what I went through” so let’s try and not do that again. You are perfectly imperfect! You are human and you are amazing!",
                    "score": 18,
                    "author": "Chosemyownlifepath"
                },
                {
                    "level": 1,
                    "comment": "Give yourself grace, life is tough sometimes. But you’re not what you’ve done, and the fact you’re feeling guilt means you’ve evolved into someone who would do better if they could right now &lt;3 sending you all the love",
                    "score": 29,
                    "author": "erinpanzarella"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is beautiful, and I'm so happy for you!",
            "score": 12,
            "author": "OkChocolate7617",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so so much &lt;3",
                    "score": 7,
                    "author": "erinpanzarella"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Seems like you’re on the right track! Don’t stop and if it gets hard again reread what you just wrote and keep on trying! Those words of affirmation are so helpful!",
            "score": 11,
            "author": "Questioning_all777",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks so much! All of what I write are reminders to myself for sure, but also paying it forward in hopes someone may feel better reading the words too. Glad you like the affirmations",
                    "score": 3,
                    "author": "erinpanzarella"
                }
            ]
        },
        {
            "level": 0,
            "comment": "An amazing story :) so happy and proud for you to come to these realizations! It's so powerful when it comes from yourself ❤",
            "score": 8,
            "author": "mushmush_55",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks so much. And yes, it is so powerful when you finally realize what kind people have told you is true. &lt;3",
                    "score": 5,
                    "author": "erinpanzarella"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Oooof. Who knew I needed to work on something so badly. Thanks for this! I fight a constant battle of feeling I am worthy of so little and have no value. It’s great to see that I can change that mentality and attract the life I know I deserve.",
            "score": 6,
            "author": "hippie_go_lucky",
            "replies": [
                {
                    "level": 1,
                    "comment": "I would suggest inner child / shadow work &lt;3 healing is hard at times but dealing with the consequences of what’s unhealed is definitely harder! I am positive that if I can change, anyone can my friend! I am starting to offer energy healing sessions, and to get my feet wet will be offering some for free. If you’re into that sort of thing or interested send me a message!",
                    "score": 5,
                    "author": "erinpanzarella",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Erin I am definitely interested",
                            "score": 1,
                            "author": "handerson5505"
                        },
                        {
                            "level": 2,
                            "comment": "Yes same here, i sent you a pm",
                            "score": 1,
                            "author": "THEREALKEVINSANE"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is beautiful. I 100% relate in terms of learning that you’re worthy exactly as you are.\n\nFor me, it stemmed from a belief that if I didn’t completely abandon myself and prioritize others I was an evil person. Meanwhile, I was being abused by literally every person who claimed to love me.. *isn’t the trauma brain wild*?",
            "score": 6,
            "author": "BabyGothQ",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m so glad you can relate. Such a beautiful feeling to finally wake up 💕 \n\nIt stemmed from a few things for me, early abandonment issues were pretty solidly formed in a few different instances. \n\nYea, the trauma brain, ooooof. Soooo fascinating and detrimental if you’re not aware of it (+ sometimes even if you are).",
                    "score": 4,
                    "author": "erinpanzarella",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "lmao like they say, awareness is only the first step.",
                            "score": 3,
                            "author": "BabyGothQ",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "LOL I remember thinking being aware was all I needed. Just the first (big) step indeed.",
                                    "score": 5,
                                    "author": "erinpanzarella"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This was a good read. I hope to be like you someday.",
            "score": 6,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s so possible my friend &lt;3",
                    "score": 5,
                    "author": "erinpanzarella"
                }
            ]
        },
        {
            "level": 0,
            "comment": "i love this!!! needed to read this today thank you",
            "score": 4,
            "author": "Cheap-Wishbone1748",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m so glad it resonated &lt;3!",
                    "score": 3,
                    "author": "erinpanzarella"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I love this bc I know I can relate to this so much. This just shows me that if you can focus on you, I can try and do the same",
            "score": 3,
            "author": "pnkin",
            "replies": [
                {
                    "level": 1,
                    "comment": "This comment literally is the reason I share these kinds of posts. I am CERTAIN that if I can finally love myself after the negative mindsets I used to subscribe to (so much self-hatred and sabotage) anyone can &lt;3",
                    "score": 6,
                    "author": "erinpanzarella"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Beatiful &lt;3",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks so much&lt;3",
                    "score": 2,
                    "author": "erinpanzarella"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Love this 💗",
            "score": 3,
            "author": "lau-lau-lau",
            "replies": [
                {
                    "level": 1,
                    "comment": "So glad 💕!",
                    "score": 2,
                    "author": "erinpanzarella"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Very inspiring ! thanks for sharing!",
            "score": 3,
            "author": "kuntorcunt",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for reading!! Glad it resonated",
                    "score": 3,
                    "author": "erinpanzarella"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wonderful words and so inspiring. Thank you!",
            "score": 3,
            "author": "Gruffstone",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m so glad it resonated. Thanks for reading!",
                    "score": 3,
                    "author": "erinpanzarella"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thank you!! I really needed this today.",
            "score": 3,
            "author": "bitoffit"
        },
        {
            "level": 0,
            "comment": "What was it that made the difference for you? What was the turning point?",
            "score": 3,
            "author": "abcdef_godthaab",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Your submission to /r/selfimprovement was automatically removed for including a photo, link, or video in violation of Rule #2. Please read the rules and post accordingly. Thank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/selfimprovement) if you have any questions or concerns.*",
                            "score": 1,
                            "author": "AutoModerator"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wow what a story. I grew up with nothing and am starting a podcast on this very thing. You did not make a mistake! It is a life lesson. Look at how much inspiration you gave to others through your life history. What you went through made you the person you are today. Perfectly imperfect. As long as you learn from what you did it was meant to be. And if not ... don’t worry you will repeat the opportunity to learn that lesson again. Lots of love to you and welcome to the perfectly imperfect club. Lol",
            "score": 3,
            "author": "Chosemyownlifepath",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes!!!! Just yes to everything you said! I actually have a podcast all about my perspective shifts called everyday perspectives :) welcome to the podcast club!!! It’s a wonderful journey.",
                    "score": 1,
                    "author": "erinpanzarella",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "All I need is some listeners lol. I want to keep it private from my family circle so I can speak freely and not worry about aftermath of hurt feelings. I am being honest of course but certain narcissists in my life like to play the victim game and not take responsibility. So I am trying to figure out how to promote it.  Any suggestions would be appreciated. I literally grew up pooping in a bucket to now living in a 2200 square foot house ( not that size matters compared to a persons humanity). I married my high school sweetheart ( that I still like ) and have 2 boys that are nice people.  I seriously changed my life path. I appreciate your kind words .",
                            "score": 2,
                            "author": "Chosemyownlifepath"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "To quote my man Paul Rudd\n\n\n“We accept the love we think we deserve.”",
            "score": 2,
            "author": "chocolatebone45"
        },
        {
            "level": 0,
            "comment": "Love that connection to source energy. Love and light",
            "score": 2,
            "author": "JediKrys"
        },
        {
            "level": 0,
            "comment": "It has been a few years since I had come out of that hole I unfortunately fell into. No longer can I keep masking my emotions. I now speak the truth and it frees me up to be who I really am, nurture my child with honesty. Furthermore, as more love floods into my life I feel things like joy, peace, and generosity are emerging as new ways of seeing in the world. I don’t need to control everything. What I desperately needed was to shed the heaviness, the self-disapproval, the shame I used to beat myself into a prolonged coma. I don’t keep paging through my old journals again and again wondering what the story was from the beginning, looking for nail-marks and reading my own horrid thoughts of how it should be. I no longer hide behind the fear and the illusions and the lower-grade mental illnesses: fear of commitment, fear of success, fear of being seen and the terror of your own power and control. Today's heart felt experience is we are all worthy of love, even though there are so many who feel unworthy. Instead of wasting time on how they should be different than they are, or how they should get help, I invite you to look deeply at the parts of you that feels this way. What do you believe about yourself? Playfully ask others what they believe about you. I know that at different times, different things will come up for different people. For some it will be happiness, for others, even depression. Nonetheless, stop and listen. gifts such as love are endless and priceless and can come from their magic. Isn't it time we stopped condemning ourselves? This isn’t about fixing or changing ourselves. This is about allowing ourselves to come to the realization that we arrived at this point in life without all of those nasty things. Some of us took many years to arrive here. Others, unfortunately took just one momentary act, before they crashed in the abyss of self-hatred. The key is to recall moments of self-worth, moments of lights-in, light out moments of feeling safe and secure. Do you feel you don’t deserve any joy because of the past? Has your history been so tough on your discouragement, simple as uncomfortable or ugly? Are you imprisoned by the need to maintain that image of yourself? As you sincerely ask for help, be kind with yourself. Come out of denial and help someone. It is a given possibility that you are disguised as a victim in times of challenge. Even the self-assured, powerful and good people can have a tendency to overlook their own strength, capabilities and inner worth. This is because of the pressure to take care of others, no matter the sacrifice. But you are not and now you understand that you are worthy of anything good, large or small. You can walk out of that shadow and finally be free to be the human you were meant to be. Finding your own way will allow your joy and appreciation to return in ways that you were not able to do before. Remember that you are worthy of love and that unconditional acceptance. You also deserve to be happy. You can walk out of that shadow and get rid of the eyesore of hopelessness and insecurity.",
            "score": 2,
            "author": "Jon_biddle_author"
        },
        {
            "level": 0,
            "comment": "Thank you for sharing, a lot of what you have said resonates with me and the journey I have been on over the past few years.\n\nIt's good to know others go down a similar road and come out the other side!",
            "score": 2,
            "author": "mi55fortun3"
        },
        {
            "level": 0,
            "comment": "Saved this post because it resonated with me deeply and I’m waiting for my date to show up so gotta remember this stuff lmao. Thanks!",
            "score": 2,
            "author": "Lvl99Cheerio"
        },
        {
            "level": 0,
            "comment": "Thank you for sharing. I have recently found myself down this negative road since becoming a parent. Although I know I have to change my negative habitual thinking and self talk, positive path and self care seems so difficult. \nIt really is comforting and uplifting to know it can be done.",
            "score": 2,
            "author": "Sure_Tie_3896"
        },
        {
            "level": 0,
            "comment": "I love this so much. I am an AA goer with 7 years booze-free, and the biggest thing I’ve learned (besides not to be a drunk moron) is the concept of acceptance. Which, in a roundabout way, is what you described.",
            "score": 2,
            "author": "FeedbackRadiant8429",
            "replies": [
                {
                    "level": 1,
                    "comment": "Congrats on 7 years!! Raised by two long-timer sober parents &amp; forever grateful for that. the serenity prayer was hung on all of our walls, and is the prayer on my dad’s mass card 💕 it’s my favorite prayer.",
                    "score": 2,
                    "author": "erinpanzarella"
                }
            ]
        },
        {
            "level": 0,
            "comment": "When you realize the truth, that you're worthy and deserve the best, life gives it to you by law. Very happy for you, I believe you've experienced resurrection.",
            "score": 1,
            "author": "Top-Juggernaut7721"
        },
        {
            "level": 0,
            "comment": "Wow, I'm so happy for you and thank you because this inspires me, hope to get there one day too.  💖",
            "score": 1,
            "author": "thru_glass"
        },
        {
            "level": 0,
            "comment": "Have we met? This feels like me. It gets better all the time though. Getting married soon, bought a house last year and finally got a career that pays what im worth.",
            "score": 1,
            "author": "LoudLayer2519"
        },
        {
            "level": 0,
            "comment": "Needed to see this thank you",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Amen...thank you for sharing your message I'm sure it's touching many people that needs to hear it in uncertain times",
            "score": 1,
            "author": "mattchu1991"
        },
        {
            "level": 0,
            "comment": "I relate to this very much. Good for you!",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "This is exactly what I needed, it feels like a letter from my future self. Thank you.",
            "score": 1,
            "author": "Brengle2"
        },
        {
            "level": 0,
            "comment": "Tim Ferris said something similar, \"We rise to the level of or expectations, we fall to the level of our training\". Bloody good quote.",
            "score": 1,
            "author": "UrAverageDegenerate"
        },
        {
            "level": 0,
            "comment": "This is the way!",
            "score": 1,
            "author": "Liljinxyyyismanamee"
        },
        {
            "level": 0,
            "comment": "Just put the work in until u see results. Living in our head is doodoo",
            "score": 1,
            "author": "CobyCarrington"
        },
        {
            "level": 0,
            "comment": "How do I genuinely believe myself worthy of anything good when all the feedback I get from those around me is garbage? Treated like shit by customers, ignored and ghosted by anyone I've pursued for the past 2 years, and really most of my life. Can't even get girls I see out and about to even look at me nevermind engage in any kind of conversation. The world looks down on me at every turn and I'm a very logical person so I can't help but think it's me, so I look down on myself.\n\nThe thing is I don't actually think I'm that bad. I know my flaws and I know I'm not a 10/10 but apparently I'm the only one who doesn't think I'm an ugly piece of shit so why should I disagree with them lol ugh.",
            "score": 1,
            "author": "CitizenSnipsYY"
        },
        {
            "level": 0,
            "comment": "Are you me?",
            "score": 1,
            "author": "sunshine242"
        },
        {
            "level": 0,
            "comment": "This feels like a whole ass revelation to me- thank you!",
            "score": 1,
            "author": "iwannaBtheverybest_"
        },
        {
            "level": 0,
            "comment": "Thank you so much for sharing this. It is so helpful.",
            "score": 1,
            "author": "SourceExtension"
        },
        {
            "level": 0,
            "comment": "Saving this for later",
            "score": 1,
            "author": "hulkhat"
        },
        {
            "level": 0,
            "comment": "Exact same journey here but I'm having some relapse type experiences that are hard to shake. \n\n1. Falling back into cocaine use - I've sworn it off forever now as it is just the simulation of worthiness, not worthiness in and of itself\n2. I made 100k on the GME fiasco a few weeks ago but I did not sell my shares (they were not allowing you to buy back in so I just hung on) - and now I'm wondering if that was a symptom of feeling unworthy that caused me not to hit the sell button... But on the other hand the reason I didn't is because I thought/knew it was going to go higher, and it would have if not for the meddling by the brokers.\n\nAs someone who's gone through a similar journey as me in the past 3 years I'm interested to hear your thoughts.",
            "score": 1,
            "author": "theAliasOfAlias"
        },
        {
            "level": 0,
            "comment": "Wow thanks for posting this. Lately I've been feeling not worthy of success and love in my life. I've avoided working on myself because I only thought of it as work and dreaded the idea of it tbh but you describing it as a way to understand myself better makes me more interested in doing it rather than just being glued to my phone all day to drown out my feelings of shame and guilt. I've been in a better place in life in the past, I know I can get back and become a better version of myself.\n\nI'm so glad to hear that you're in a good place in your life, thanks for sharing because your post has been helpful to me ❤️",
            "score": 1,
            "author": "Ayy-Lamao"
        },
        {
            "level": 0,
            "comment": "Can someone please explain what's the difference between feeling that we're 'worthy of something' verses that 'we deservve something'?",
            "score": 1,
            "author": "this-soul"
        },
        {
            "level": 0,
            "comment": "I'm glad that you are able to free yourself  step by step from the feeling of not being competent or capable enough. You seem to be in the right direction and it is very thoughtful of you to share your experience.",
            "score": 1,
            "author": "so_soulDR"
        },
        {
            "level": 0,
            "comment": "Thanks for this. Good on you!!! 😊",
            "score": 1,
            "author": "carnage_X03"
        },
        {
            "level": 0,
            "comment": "This is 100% what I'm working on rn. It feels like honestly future me wrote this. Thanks for sharing.",
            "score": 1,
            "author": "paperbackbaker"
        },
        {
            "level": 0,
            "comment": "The best post I have ever encountered today!",
            "score": 1,
            "author": "Humid_fire99"
        },
        {
            "level": 0,
            "comment": "The art of wording at its peak.\n\nIsnt the title just :\n\"We attract what we think we deserve instead of what we actually deserve.\"\n\nIn that case, isnt it you who set \"what we actually deserve\" too ? \n\n\"We attract what we think we deserve instead of what we think we deserve after thinking about it a bit\"\n\nThe words deserve and worth are tumors for humans.",
            "score": 1,
            "author": "rbak19i",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, words are limited but I think we are all deserving of happiness, fulfillment, love, and joy (in addition to every other human emotion that is part of this journey). That was the context I was speaking in :)! Appreciate the dialogue and your perspective though!",
                    "score": 2,
                    "author": "erinpanzarella"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thank you for sharing. You know, I too have a past, as we all have. I did things that today I will not do it again because I prefer my new myself. One thing though is regarding “my past doesn’t define me...” yes defines you and that’s thanks to our pasts that today we have a certain wisdom that others can’t have. It’s not a matter of better or worse it’s just a fact. I have and thanks to it I can look at myself in the mirror and congratulate me. I’m proud of my journey because made me who I am! Thank you Once again for sharing your story!",
            "score": 1,
            "author": "pindarico"
        },
        {
            "level": 0,
            "comment": "Definitely not true. I dont deserve my current bf at all but here he is.",
            "score": 1,
            "author": "ArachWitch"
        },
        {
            "level": 0,
            "comment": "I had to screenshot some of this post so I can come back and read it when I’m feeling down on myself.  Thankyou!",
            "score": 1,
            "author": "RBear69"
        }
    ]
}