{
    "id": "n15tne",
    "score": 3261,
    "title": "Just a quick reminder: Get on your shit, stay on your shit, stay OUT of shit, and don’t tell people shit. Boss up in silence and shock everyone. You can do this❣️",
    "author": "Beachflower5",
    "date": 1619707255.0,
    "url": "https://www.reddit.com/r/selfimprovement/comments/n15tne",
    "media_urls": [],
    "other_urls": [],
    "postText": "This may seem like a lot but think about it, if you do this you can lose all the weight, get back on track with school/work, finally feel healthy and happy. Do it for the smile on your face when you see yourself. Do it so you can let go of your insecurities, stress, and anxiety. Do it so you can stop existing and start living, and so that you can finally be yourself fully and unapologetically. Do it so that you can finally respect yourself and set proper boundaries. Whatever it is you’ve been putting off, don’t think about it, just start. Do it.",
    "comments": [
        {
            "level": 0,
            "comment": "Hell yeah! About to live my life unapologetically and do what’s best for my growth.",
            "score": 157,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": ":) Yes! I love your attitude! 💕Believe you can and you’re halfway there",
                    "score": 38,
                    "author": "Beachflower5"
                },
                {
                    "level": 1,
                    "comment": "I love this!!!",
                    "score": 15,
                    "author": "RachelD5",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "💕💞",
                            "score": 8,
                            "author": "Beachflower5"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I've had a bad habit in the past of announcing my goals then not living up to them, and feeling less and less motivated due to the shame of not doing what I told people I was going to do (ie quit smoking, working towards a raise, etc). I've found it MUCH more rewarding and motivating to drop those successes on people unexpectedly, vs preemptively. The congratulations from telling people I *already got* a promotion made me work even harder to get another one, instead of feeling depressed and useless after not getting one that I had announced I was working towards.  \n\nHustle in silence. Success will often speak for itself.",
            "score": 161,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "exactly! ive had a similar experience. having so many goals and dreams but not bringing myself to do anything to make it happen. sometimes like you said it’s better to hustle in silence. i hope this post was helpful :) you can do this! believing you can is half the journey 💕",
                    "score": 29,
                    "author": "Beachflower5"
                },
                {
                    "level": 1,
                    "comment": "In the same way a pain shared is a pain halved, so to are dreams halved. Sharing a dream prematurely takes away its power.",
                    "score": 15,
                    "author": "brain_damaged666"
                },
                {
                    "level": 1,
                    "comment": "Hide your capabilities and bide your time",
                    "score": 7,
                    "author": "TammyAnand"
                },
                {
                    "level": 1,
                    "comment": "from a spiritual and mental view, eye feel as if we sort of \"live out\" the goal a little by speaking on it like that. It's a way we have of bringing the goal to life before it's truly materialized",
                    "score": 1,
                    "author": "fashowdat"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I can't stop thinking about this I love the positive energy I'm getting from this is a daily reminder I need every day please someone anyone sends me the vibes I need I love this I need positive people in my life. Because I hate my life so much right now. Please, someone, send me the power to change the power to get myself up and make the changes I need to change my life. I'm in school I even made the leadership and success chapter of my school I am smart I have proof but it's me that has to believe it.",
            "score": 38,
            "author": "RachelD5",
            "replies": [
                {
                    "level": 1,
                    "comment": "coming from someone who does the same, it sounds like you might be someone who absorbs the emotions of those around you, please correct me if i’m wrong. try to stay away from negativity and surround yourself with people who motivate you to be better. little things like changing the people you follow on social media or simply practicing mindfulness can make a big difference. i know it sounds so cliche but yoga and mediation really do help. i hope you figure things out and that this journey is one of love and healing for you 💞",
                    "score": 11,
                    "author": "Beachflower5"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don't have sources, but there was a psychological study regarding talking about goals vs staying silent about them. \nPeople who talked about their goals to their friends were less likely to accomplish them compared to the people who didn't talk about them at all. \nThis is due to our brain's reward response system. When we talk about something we would like to accomplish, we get an endorphin boost. \nThis causes us subconsciously to believe that we are closer to our goal, without any action. I've been losing a lot of weight recently, and knowing this has helped me a lot. \nI think people talk about their goals because they want encouragement or guidance, which is fine in itself, but detrimental if done too much. Grinding in silence is tough, but worthwhile. \nLet the results speak for themselves.",
            "score": 26,
            "author": "AsleepQuestion",
            "replies": [
                {
                    "level": 1,
                    "comment": "i completely agree! i’m glad that strategy has been helpful to your journey :) sometimes hustling in silence is better. i find that, like you said, sometimes talking about my goals makes me less likely to accomplish them. thank you for sharing this 💗",
                    "score": 7,
                    "author": "Beachflower5",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah totally, I'm glad you found it helpful :)",
                            "score": 3,
                            "author": "AsleepQuestion"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This makes so much sense. I feel like I’m learning so so much from this thread. Thank you 🙏🏽",
                    "score": 4,
                    "author": "namastetyson",
                    "replies": [
                        {
                            "level": 2,
                            "comment": ":) awh, im so glad! 💗",
                            "score": 2,
                            "author": "Beachflower5"
                        },
                        {
                            "level": 2,
                            "comment": "No problem :)",
                            "score": 2,
                            "author": "AsleepQuestion"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "i needed this!!",
            "score": 11,
            "author": "atalp_",
            "replies": [
                {
                    "level": 1,
                    "comment": "💕i hope it helped :)",
                    "score": 2,
                    "author": "Beachflower5"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That's fucken right I can do this no matter what people say stay on my shit matter of fact I'm printing this out and putting this in my office!!!",
            "score": 12,
            "author": "RachelD5",
            "replies": [
                {
                    "level": 1,
                    "comment": ":) yes! incredible attitude! you can do this! get on it and stay on it. most importantly always believe in yourself. you’re halfway there 💗",
                    "score": 4,
                    "author": "Beachflower5"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Absolutely trying to live this! Imagining going ghost for a couple years then coming back being fit, successful, and with a changed mindset is my task.",
            "score": 11,
            "author": "theifornot",
            "replies": [
                {
                    "level": 1,
                    "comment": "you can absolutely reach those goals! success is what you make it! it already sounds like you’re very open to changing for the better so i have no doubt you are well on your way there. i hope your journey is one of love and healing 💕",
                    "score": 2,
                    "author": "Beachflower5"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Daily Inspiration. HECK YEAH",
            "score": 21,
            "author": "AmusedBlue",
            "replies": [
                {
                    "level": 1,
                    "comment": "yep, gotta stay motivated :)",
                    "score": 5,
                    "author": "Beachflower5"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That you so much for listening to me it's so hard to deal with my emotions I have one negative person around me who says he loves me but I clearly see that he doesn't believe I can do anything. He doesn't want me to succeed in anything that I do. He puts me down. I'm in school and he tells me that I study way too much. But to keep my GPA at 4.0, I need to be on top of my studies. I can't and won't allow myself to fail. Not at this. My self-esteem is so low from my childhood of everyone telling me I'm going to end up a loser like my real mom it just hurts. I wear my emotions on my sleeve. But I'm going to take your advice on yoga I've tried once and boy it felt so nice. And meditation it does work but finding the right meditation is hard can you recommend any for me please get back to me.",
            "score": 6,
            "author": "RachelD5",
            "replies": [
                {
                    "level": 1,
                    "comment": "Investigate manually triggering the parasympathetic response to aid your distress tolerance and emotional regulation throughout the day. \n\nIt goes deeper than just deep breathing, there's plenty you can do. Try yawning when your anxious, try reverse ratio breath work; 1 part inhale, 2-3 parts exhale. Learn about \"interocepting\" and calmly investigating body cues without further panicking.\n\nResources over at r/ResponsibleRecovery are just fantastic. You can cope better with strategies and practice, you can empower yourself to overcome your childhood trauma.\n\nI had 2 emotional flashbacks today and miraculously pulled through by really accepting my immense pain and by allowing myself to re-experience it. You can reduce intensity and duration of symptoms by actively participating in re-engineering thought and feeling. Forget \"what's wrong with me?!\" Try \"this is happening, I'm scared, thats ok\", and show compassion to your inner child through the pain, reassure them that it will be ok.",
                    "score": 6,
                    "author": "cosmicdissonance1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "woah! i had no idea about this. i’m sorry you had to experience something so painful but i’m glad you were able to pull through. i’ll be trying this, thank you so much for sharing! 💕",
                            "score": 1,
                            "author": "Beachflower5"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "oh no, i’m sorry you’ve had to deal with that. as hard as it may be, you should remove that negative person from your life. keep studying but remember to take care of yourself too. school is important but your health is first. i understand the self esteem issues due to childhood trauma, i experience the same. i think sometimes we just have to remember that the opinions of others shouldn’t matter at all, they don’t know enough about your situation to form educated thoughts about you. i would definitely recommend trying yoga again :) about meditation, i couldn’t agree more. it’s quite difficult to find the right one. i still am looking for one that works better for me so i cant be of much help with that. i recommend maybe going on youtube for some free options and just browse until you find something that you like. i know this is a very controversial topic but maybe you could try therapy. it sounds like you have a lot of unresolved emotions from your childhood",
                    "score": 3,
                    "author": "Beachflower5"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Totally agree , quiet desperation is a very powerful things. When your mindset changes from I don’t know how to accomplish my goal to I can’t live another day without pursuing my dreams and aspirations things go from being hard to do to being hard to not do. You deserve everything in life you want, put in the work to try to achieve it . Also talking about goals your working on releases a bit of dopamine as if you have achieved it so  it can also take away motivation.",
            "score": 6,
            "author": "pwnfaced",
            "replies": [
                {
                    "level": 1,
                    "comment": "couldn’t agree more! 💯💞",
                    "score": 3,
                    "author": "Beachflower5"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Matter of fact I'm going to go make myself a smoothie!! Damn it. Get off my ass and take a break from studies",
            "score": 4,
            "author": "RachelD5",
            "replies": [
                {
                    "level": 1,
                    "comment": "yes! love this! we all need a break here and then. make sure to keep studying but don’t work yourself to the bone. a smoothie sounds wonderful :) i’m glad to see this post helped. i hope things go well for you and if you ever need to talk, feel free to message me 💕",
                    "score": 2,
                    "author": "Beachflower5"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Definitely needed this.!",
            "score": 5,
            "author": "Strangelove05",
            "replies": [
                {
                    "level": 1,
                    "comment": ":) i’m glad you came across this 💗",
                    "score": 2,
                    "author": "Beachflower5"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I am in therapy. That does help. I appreciate the help. My name is Rachel. I'm just having a rough day. Normally I'm pretty much easy going but sometimes I just get in these moods. I know I can do it. I love Reddit I'm so glad I found this and I actually found this sight through school. There was this interview I had to evaluate and I just kept looking around and I found all of you. All of you I now consider my friends we all need to stick together and help each grown into a positive woman and the hell with the negativity in the world. I need to get rid of the boyfriend, that's what I need to do. He's is what is driving my self-esteem to a drastic low. But I honestly do feel so much better so thank you from the bottom of my heart!!!",
            "score": 3,
            "author": "RachelD5",
            "replies": [
                {
                    "level": 1,
                    "comment": "it’s been nice talking to you Rachel. i’m sorry you’ve been having a rough day, i hope it gets better :) i’m glad therapy is helping and i’m glad you’ve found a supportive community on here. i hope you figure out what the best thing to do is in your situation but sadly it does seem like ending the relationship would be ideal. i wish you all the best, i’m so glad this helped. stay positive! this is temporary, things will get better in time 💕",
                    "score": 2,
                    "author": "Beachflower5"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I really needed this today. Thanks for the reminder, OP!",
            "score": 3,
            "author": "MonaLisaSap",
            "replies": [
                {
                    "level": 1,
                    "comment": ":) awh, im glad it helped. don’t give up! whatever is going wrong is temporary. things really do get better 💕",
                    "score": 3,
                    "author": "Beachflower5"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I just have to believe in myself I know I can do this I live that I found this site I'm never going back on Facebook!!!",
            "score": 3,
            "author": "RachelD5"
        },
        {
            "level": 0,
            "comment": "Shit, dude this is spot on.  Nice.\n\nTrust the process.  For me I gave up the idea of needing to know ‘why’ as it pertained to shit.\n\nTurns out I didn’t know shit.",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "things aren’t always the way they seem. trusting the process is key💯",
                    "score": 2,
                    "author": "Beachflower5",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Boop, there it is.",
                            "score": 1,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You definitely helped me. I'm studying finance right now and boy it's a bitch.",
            "score": 3,
            "author": "RachelD5",
            "replies": [
                {
                    "level": 1,
                    "comment": "ohh yikes, i can’t even begin to imagine the stress that brings. i’m so glad this helped. hang in there, and remember to take care of yourself. i’m sending you a virtual hug and lots of happy wishes 💗",
                    "score": 1,
                    "author": "Beachflower5"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thank you for this.",
            "score": 3,
            "author": "max40Wses",
            "replies": [
                {
                    "level": 1,
                    "comment": ":) glad to help 💕",
                    "score": 1,
                    "author": "Beachflower5"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Currently in the process. 25 male here, bouta be getting my first car real soon and ain't telling a single soul besides my dad n pap case they're the ones helping me. Ain't telling anyone shit from now on. Even bought a bench press and upgraded barbells 💪💪💪",
            "score": 3,
            "author": "redrum0666",
            "replies": [
                {
                    "level": 1,
                    "comment": ":) way to go! that’s exciting! i’m proud of you, keep at it💕",
                    "score": 1,
                    "author": "Beachflower5"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I agree. Actions speak louder than words. Best to stfu and just do it.",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "success speaks for itself 💕",
                    "score": 1,
                    "author": "Beachflower5"
                }
            ]
        },
        {
            "level": 0,
            "comment": "right now I'm 8 1/2 months pregnant.. I look forward to getting back in shape after he is born ! Thanks for the motivational words... :)",
            "score": 3,
            "author": "Mission_Definition_1",
            "replies": [
                {
                    "level": 1,
                    "comment": ":) im sure you’re doing great, just a bit more time to go! i wish you a safe and smooth delivery. may good health envelop you and may you be blessed with a quick recovery. best wishes 💗",
                    "score": 2,
                    "author": "Beachflower5",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "thank you so much ! xoxo",
                            "score": 2,
                            "author": "Mission_Definition_1"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What I‘ve learned is that when I start something and tell people about I instantly loose interest. \nAnd it is worse when I do something my way and then other people comment on that. Like if I play a fame my way and then end up not being that fast or learning an instrument but someone else is better.\n\nIf you do something do it for yourself. Other people just destroy your interests and ambitions.\n\nEveryone has an opinion on things and even if you think that you want to share your hobby or anything with friends and family stop and just don‘t do it.\nYou expect a reaction and some people are plain asshole thinking it‘s constructive to tell you that what you‘re doing is shit.\n\nKeep it to yourself and one day you may show it but until then just enjoy",
            "score": 3,
            "author": "LemonsRage",
            "replies": [
                {
                    "level": 1,
                    "comment": "yeah, sometimes it’s better to keep things to yourself for a while. like you said, i also find that after telling people about a goal, i tend to work for it with less ambition. this definitely is not something that works for everyone but i’m glad it is helpful to your journey💕",
                    "score": 2,
                    "author": "Beachflower5"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The best advice I ever got was to stop talking about my projects and just do them - it was revolutionary. I had put off writing my ebook for months, and then once I stopped talking about it, finished it within two. Same things goes for starting a youtube channel.\n\nIf you talk about your goals all the time, you trick your brain into thinking you've already accomplished them. Don't talk, just shut up and do.",
            "score": 3,
            "author": "evanrtw",
            "replies": [
                {
                    "level": 1,
                    "comment": ":) couldn’t have said it better. and i’m glad things worked out with your ebook! congrats on that! 🎊",
                    "score": 1,
                    "author": "Beachflower5",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "thank you very much! :D",
                            "score": 2,
                            "author": "evanrtw"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Solid. Advice.",
            "score": 2,
            "author": "HOOP435",
            "replies": [
                {
                    "level": 1,
                    "comment": "thank you 💯💞",
                    "score": 2,
                    "author": "Beachflower5"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That shit is true!",
            "score": 2,
            "author": "CH02020",
            "replies": [
                {
                    "level": 1,
                    "comment": "💯💗",
                    "score": 1,
                    "author": "Beachflower5"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I needed this! Been on my shit since the year started and I’m making some progress. Slowly but I’m sure I’ll get there eventually. Thanks for this! 💕",
            "score": 2,
            "author": "donut-panda",
            "replies": [
                {
                    "level": 1,
                    "comment": "im so proud of you! any progress is still progress! i love your attitude, you will get there in due time. im glad this helped 💗",
                    "score": 2,
                    "author": "Beachflower5"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So true.",
            "score": 2,
            "author": "Bangbanggarcia",
            "replies": [
                {
                    "level": 1,
                    "comment": "💯💕",
                    "score": 1,
                    "author": "Beachflower5"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thanks friend. Today was a downer.",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "im sorry to hear that. i hope things get better for you! and i hope the post was helpful. if you ever need a positive reminder or just need someone to talk to, message me. have a lovely weekend 💞",
                    "score": 1,
                    "author": "Beachflower5"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Will succeeds wish fails.. Alabhya Singh.",
            "score": 2,
            "author": "saddur99",
            "replies": [
                {
                    "level": 1,
                    "comment": "love this 💞",
                    "score": 1,
                    "author": "Beachflower5"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I love this mantra so much! Thanks for this!",
            "score": 2,
            "author": "SoftBoiledPotatoChip",
            "replies": [
                {
                    "level": 1,
                    "comment": "💗",
                    "score": 1,
                    "author": "Beachflower5"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Agghhhhh THANK YOU",
            "score": 2,
            "author": "LunaxMielx",
            "replies": [
                {
                    "level": 1,
                    "comment": "im glad this helped 💕☺️",
                    "score": 1,
                    "author": "Beachflower5"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thank you so much for this",
            "score": 2,
            "author": "Bubbly_Rosey",
            "replies": [
                {
                    "level": 1,
                    "comment": ":) i’m so glad this helped! if you ever need a positive reminder or just need someone to talk to, feel free to message me 💗",
                    "score": 1,
                    "author": "Beachflower5"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Commenting to see in the future",
            "score": 2,
            "author": "whereisfrank"
        },
        {
            "level": 0,
            "comment": "I want this headline on a t-shirt or hoodie. What everyone needs to read.",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "i don’t know that i would feel comfortable with that just because i found inspiration to make this post elsewhere. the headline is mostly from inspiration and the text below is my writing. but then i edited some of it based off suggestions in the comments. i feel like i would be taking credit for something that isn’t fully mine. but it’s definitely a cool idea, i like the way you think :)",
                    "score": 2,
                    "author": "Beachflower5"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yessssss  🙌🏼",
            "score": 2,
            "author": "MakePeaceTogether"
        },
        {
            "level": 0,
            "comment": "This just made me immune to stepping in dog poo",
            "score": 2,
            "author": "D0D0Metro",
            "replies": [
                {
                    "level": 1,
                    "comment": "😂",
                    "score": 1,
                    "author": "Beachflower5"
                }
            ]
        },
        {
            "level": 0,
            "comment": "i like it",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Love it 🤙🏻 have a great day!!",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": ":) you too! 💕",
                    "score": 2,
                    "author": "Beachflower5"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Needed this. Ill let my work speak",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "💯💞",
                    "score": 2,
                    "author": "Beachflower5"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wow ❤️🙏🏽\nThank you so much. This is one of the most powerful things I have read. I have saved this and I will read it every day, several times a day. I truly feel blessed reading this at this exact time. \nYou are a gift. Thank you ❤️🙏🏽",
            "score": 2,
            "author": "namastetyson",
            "replies": [
                {
                    "level": 1,
                    "comment": ":) awh, that’s so sweet! i’m glad this post was helpful. knowing that this motivated so many people is a blessing. have a lovely day💕",
                    "score": 2,
                    "author": "Beachflower5"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I love the English language sometimes! 3 different meanings for the word \"shit\" and none of them are about actual shit 😁",
            "score": 2,
            "author": "DigitSubversion",
            "replies": [
                {
                    "level": 1,
                    "comment": "i think there are more than 3 😂",
                    "score": 1,
                    "author": "Beachflower5"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I LOVE THIS !!\n\nGot me all fired up!! :-D &lt;3",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "💞💗",
                    "score": 2,
                    "author": "Beachflower5"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thank you, just the pep talk I needed this lovely morn! ❤",
            "score": 2,
            "author": "hakoditty",
            "replies": [
                {
                    "level": 1,
                    "comment": "💞",
                    "score": 2,
                    "author": "Beachflower5"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thank you",
            "score": 2,
            "author": "53697661",
            "replies": [
                {
                    "level": 1,
                    "comment": "💗",
                    "score": 2,
                    "author": "Beachflower5"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wow thank you for this today",
            "score": 2,
            "author": "leadsinlight1",
            "replies": [
                {
                    "level": 1,
                    "comment": "💕",
                    "score": 1,
                    "author": "Beachflower5"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I definitely needed to hear this. I have really been working on self improvement recently and doing what makes me happy. Goodluck to everyone out there.",
            "score": 2,
            "author": "dreadathonmeh"
        },
        {
            "level": 0,
            "comment": "I just want you to know this post is great. I love the title. I am having a bad hour (tinder rejection type garbage) and re-reading what you wrote helps.",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": ":( sorry to hear about the tinder situation, but i’m glad this post was helpful. if you ever need someone to talk to, feel free to message me. have a lovely day 💞",
                    "score": 2,
                    "author": "Beachflower5"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is very inspirational, in all aspects,",
            "score": 2,
            "author": "J0912"
        },
        {
            "level": 0,
            "comment": "\"Don't start no shit, won't be no shit.\"",
            "score": 2,
            "author": "Void_Creator"
        },
        {
            "level": 0,
            "comment": "I’m 24days late but thank you",
            "score": 2,
            "author": "Significant-Week-444",
            "replies": [
                {
                    "level": 1,
                    "comment": "💗💞",
                    "score": 2,
                    "author": "Beachflower5"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thaaaaaaank yoooouuuuu!!!",
            "score": 2,
            "author": "kudrasan2"
        },
        {
            "level": 0,
            "comment": "I’m gonna have to go ahead and disagree with this one tbh. Humans are social creatures, we can’t just do things alone and most people would find it more beneficial to have a support system to help them reach their goals. There’s nothing prideful in trying to bottle everything in, that’s easy to do because it’s the default, it takes more discipline and confidence sometimes to be able to reach out to other people though",
            "score": 3,
            "author": "thebiffdog",
            "replies": [
                {
                    "level": 1,
                    "comment": "i’m not suggesting anyone bottle things in, but sometimes it’s best to just do things. i posted this to motivate people so that they don’t feel like they need outside validation to reach their goals. i’m sorry it came across in a negative way :(",
                    "score": 2,
                    "author": "Beachflower5",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No worries, no reason to apologize! I’m sorry if I came across too judgy, that’s was just my gut opinion and of course different approaches work best for different people! ❤️",
                            "score": 2,
                            "author": "thebiffdog"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is THE BEST Comment I have ever read!",
            "score": 2,
            "author": "Beautiful-Check-9049",
            "replies": [
                {
                    "level": 1,
                    "comment": ":) awh, thank you! i’m glad 💕i hope it helped",
                    "score": 1,
                    "author": "Beachflower5"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I like everything you said except the \"So you can finally love yourself.\"  I think you should learn to love yourself regardless of any specific outcome or circumstance in your life.  Perhaps instead of \"love\" you can say \"so you can finally respect yourself.\"  :)\n\nJust my two cents.",
            "score": 1,
            "author": "GamerCoachGG",
            "replies": [
                {
                    "level": 1,
                    "comment": "i appreciate hearing from different perspectives. i’ll change it now, thank you :)",
                    "score": 1,
                    "author": "Beachflower5"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yes i have be doing this long time and I think today is the day that I earned my reward ☺",
            "score": 1,
            "author": "Dhanoooo"
        },
        {
            "level": 0,
            "comment": "!RemindMe in 30 hours",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Your submission to /r/selfimprovement was automatically removed for including a photo, link, or video in violation of Rule #2. Please read the rules and post accordingly. Thank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/selfimprovement) if you have any questions or concerns.*",
                            "score": 1,
                            "author": "AutoModerator"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "!",
            "score": 1,
            "author": "111shepherd"
        },
        {
            "level": 0,
            "comment": "Well, I do tell my Mom. My Mom knows everything 😂💞",
            "score": 1,
            "author": "LilaDuter"
        },
        {
            "level": 0,
            "comment": "Demais",
            "score": 1,
            "author": "Fit_Temperature_9772"
        },
        {
            "level": 0,
            "comment": "Thank you so much for your words. I'm stressfull these days because of my procrastination in university. I'm thinking and anxious so much while I'm doing nothing. Your reminder is my mood today. Deep in studying immediately.",
            "score": 1,
            "author": "Artistic-Stranger590"
        }
    ]
}