{
    "id": "xbzxuh",
    "score": 2184,
    "title": "Today I realized that no one cares and I have to save myself.",
    "author": "rubbyred2",
    "date": 1662946922.0,
    "url": "https://www.reddit.com/r/selfimprovement/comments/xbzxuh",
    "media_urls": [],
    "other_urls": [],
    "postText": "I hit rock bottom and it’s the loneliest place ever. I wouldn’t wish it upon anyone.\n\nBut today I had to pull myself up. I’m choosing not to suffer anymore. The only one who can save me is myself. It’s going to be a long journey but I will come back on top. I will find new friends and create my own chosen family. I will be successful financially and in my career. I will get the love I deserve and the family that I always wanted one day. \n\nI’m fighting for myself to win. I’m fighting to be happy again.",
    "comments": [
        {
            "level": 0,
            "comment": "Just to help you and let you know you’re not alone in the struggle bro. First my wife of 12 years; the only woman I’ve been with, told me she’s leaving me a few days ago. She is also taking our two cats with her and I love them. I also pushed all my friends and family out of my life while being with her so I have no one. Word to the wise and whoever is reading this! Don’t push friends and family out of your life for a relationship it will bite you in the ass one day. But yeah…. I was suicidal and almost went through with it. But a miracle happened and now I’m reading everyday, been working out everyday, eating healthy, talking to as many potential friends as I can… we can do this bro! We will survive and have what we deserve at the end of this! Keep hustling and remember to smile everyday and list off why you should be thankful every morning! We have a lot to be thankful for everyday just living in USA and having some freedom.",
            "score": 382,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m right there with you. I pushed all my life long friends out for a relationship that I thought was life long. In my heart I knew something wasn’t right and it wasn’t (she also took my our shared dogs) Now I’m back at good ol’ mom and dads In my 30’s finding out who my real people are. Loneliness comes with self realization. Im starting to really really figure out who I want to be, who I am, and who I want to be with—when that day comes. It’s kind of awesome.",
                    "score": 68,
                    "author": "butttabooo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Right there with you. Moved to a new city and my ex left me for some fucking cowboy. Most lonely I have ever been and I almost moved back in with my parents. But it is also the best thing that could have happened. Now we are being FORCED to examine ourselves and our lives and understand who our highest selves are. The only way is up",
                            "score": 14,
                            "author": "humblenarcissist112"
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 4,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 2,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Same dude I had the best house I loved it so much she’s in it now and I literally said today I hope it burns down lmao move onwards and upwards ! We can do this!",
                                            "score": 2,
                                            "author": "butttabooo"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Let me guess, she pushed your friends and family out because they were not nice to her? This is a classical example of a partner not defending or standing up for the spouse /partner, and the partner imagines that this will continue without any problems. There’s always 2 sides to a relationship. When someone starts blaming one party and tries to paint them as abuser I can very clearly state that this is a case of being in delusion. It’s good that you are exploring and coming out of it, but don’t say things that make you feel you are right and take away your responsibility in the situations that you co-created. You will never change and learn if you do so. Choice is yours. I have seen these discussions like a hundred times now and that’s why I am suggesting this. The classic ‘that person was my abuser’. There is nothing like that. Your victim mentality originates from something from your childhood and she was just a trigger. Since you are now with your parents, it’s time to dig into what they did to you to make you feel that way. It always comes back to childhood",
                            "score": 0,
                            "author": "harshtruth44",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I don’t for a second think I’m a victim I think I’m an asshole. I lost who I was for someone else and I won’t ever do that again, because trying to figure out who you are without a support system is very difficult.",
                                    "score": 16,
                                    "author": "butttabooo",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I am on your side and just trying to present the facts to you to help. 😀 to know yourself, you need to go within. Others around you, specially your family and friends that have been around you forever will not help you find who you really are. In fact they come in the way mostly. That’s why every hero had to take a journey away from people they knew to know they self, be it Jesus, be it Buddha, or any other being. Just saying that the story you are telling yourself might not be true, and maybe there is more to this. Just trying to help buddy",
                                            "score": -5,
                                            "author": "harshtruth44"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Yeah honestly, your comment is unwarranted. There are two sides to every story, but the fact that you think you nailed it on your first try after reading a single paragraph on OP's situation is a testament to your ignorance. My ex was incredibly emotionally abusive, but that doesn't mean that there is no responsibility for me to take. You can call out someone else while remaining humble enough to recognize your own contributions to a failed relationship. Some people treat others horribly, and that is just the reality.",
                                    "score": 8,
                                    "author": "humblenarcissist112"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;I also pushed all my friends and family out of my life while being with her so I have no one\n\nQuick note... this is a classic isolation tactic used by abusive spouses. By extricating you from your friends and family; it (a) removes your support network, making you more dependent on them, and (b) reduces potential criticism of their actions, and you have no one to discuss things with.\n\nThis is often accompanied with Gaslighting, and other forms of insidious mental abuse.",
                    "score": 28,
                    "author": "just-plain-wrong"
                },
                {
                    "level": 1,
                    "comment": "I’m actually a girl lol, but thanks for sharing your story! I broke up with my ex of 6 years and I was spiralling down afterwards.. I was also isolated from my friends and family and never realized how alone I was.. I waited so long for a miracle but it never came.. So I have to create my own miracle now and get out of this. I’m happy to hear that you’re doing better!",
                    "score": 55,
                    "author": "rubbyred2",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": -34,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Love this man, good vibes your way. I can't imagine the pain you are going through, but you are on a good path. For you to be able to respond this way to this situation. THAT is strength",
                    "score": 2,
                    "author": "humblenarcissist112",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I appreciate the love from one humble narcissist to the other ;) I wish only good things for you too! Let’s keep working and make this world a better place. ( cause the people running it now are doing a good job trashing it) but I digress.",
                            "score": 2,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I’m confused.. you said she made the choice to leave just a few days ago but you have gone through suicidal tendencies, and started doing all these healthy lifestyle habits “everyday” but it’s only been a few days at most?",
                    "score": 1,
                    "author": "vocaltalentz",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes that’s the story! i’m not trying to say I’ve been doing all these good habits for years because of that I have just started. But even this streak is longer than I ever have done and I 100% know it will stick this time. Do you know how you do something and you just know you’ll be back…? That’s how I feel with all these habits because my other option was depression and suicide and I don’t want to go back to that place.",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hmm maybe. Tbh I feel like the times I’ve had those life changing moments, they would stick for a little bit but never long term so I don’t trust that feeling of “I know I’ll succeed this time.” In fact, I find them harmful for my actual success. The times I have succeeded were not as dramatic, but did stick forever. I feel like when you’re going through something major, it’s easy to lie to yourself and feel like you’re all better (and the adrenaline from that makes it feel like things have changed) but the truth is it takes so long for change to take place. A few days won’t change anything.. not even a few months. It’s a long, long journey. I’m only speaking for myself and people I know.. you may as well be able to change overnight and have it stay. Just make sure you are honest with yourself too, because if you’re not it can cause more issues down the line",
                                    "score": 1,
                                    "author": "vocaltalentz",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Well I was an alcoholic for 15 years which led to pancreatitis and almost dying. Forced to get sober then after getting sober I was smacked in the face with this relationship bullshit heartache and something broke in my soul that lead to suicide and rock bottom. Then  a switch was turned back on from a higher power or something  and these things I could never do or things I never thought I’d do have been coming easy and actually enjoyable. Can’t explain it.. you’d have to have been there in my soul to understand. I appreciate your realism and concern for my potential failing but a higher power has got me and since I’ve fought that my entire life  I’m not anymore and things seem to be working finally 🤷‍♂️",
                                            "score": 1,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "How were you able to do those things and be consistent? Kudos to you brother!",
                    "score": 1,
                    "author": "chimpanzelle",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s was easy because I only had two choices. “Kill myself from depression” or get up and finally make a change. Choices in life get really easy when you only have two and one of them is a brick wall.",
                            "score": 2,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Suicide Hotline Numbers If you or anyone you know are struggling, please, PLEASE reach out for help. You are worthy, you are loved and you will always be able to find assistance.\n\nArgentina: +5402234930430\n\nAustralia: 131114\n\nAustria: 017133374\n\nBelgium: 106\n\nBosnia &amp; Herzegovina: 080 05 03 05\n\nBotswana: 3911270\n\nBrazil: 212339191\n\nBulgaria: 0035 9249 17 223\n\nCanada: 5147234000 (Montreal); 18662773553 (outside Montreal)\n\nCroatia: 014833888\n\nDenmark: +4570201201\n\nEgypt: 7621602\n\nFinland: 010 195 202\n\nFrance: 0145394000\n\nGermany: 08001810771\n\nHong Kong: +852 2382 0000\n\nHungary: 116123\n\nIceland: 1717\n\nIndia: 8888817666\n\nIreland: +4408457909090\n\nItaly: 800860022\n\nJapan: +810352869090\n\nMexico: 5255102550\n\nNew Zealand: 0508828865\n\nThe Netherlands: 113\n\nNorway: +4781533300\n\nPhilippines: 028969191\n\nPoland: 5270000\n\nRussia: 0078202577577\n\nSpain: 914590050\n\nSouth Africa: 0514445691\n\nSweden: 46317112400\n\nSwitzerland: 143\n\nUnited Kingdom: 08006895652\n\nUSA: 18002738255\n\nYou are not alone. Please reach out.\n*****\nI am a bot, and this action was performed automatically.",
                                    "score": 2,
                                    "author": "eazeaze",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Good bot",
                                            "score": 1,
                                            "author": "DirtyEtzio"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Let me guess, she pushed your friends and family out because they were not nice to her? This is a classical example of a partner not defending or standing up for the spouse /partner, and the partner imagines that this will continue without any problems. There’s always 2 sides to a relationship. When someone starts blaming one party and tries to paint them as abuser I can very clearly state that this is a case of being in delusion. It’s good that you are exploring and coming out of it, but don’t say things that make you feel you are right and take away your responsibility in the situations that you co-created. You will never change and learn if you do so. Choice is yours. I have seen these discussions like a hundred times now and that’s why I am suggesting this. The classic ‘that person was my abuser’. There is nothing like that. Your victim mentality originates from something from your childhood and she was just a trigger. Since you are now with your parents, it’s time to dig into what they did to you to make you feel that way. It always comes back to childhood",
                    "score": -2,
                    "author": "harshtruth44",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I pushed all my family and friends away… not her. I did it because I dumped all my time and effort into the relationship. There was no abuse going on. And I’m not back at my parents unfortunately, I’m struggling to pay rent and bills and take care of my mental health like the rest of us.",
                            "score": 2,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Then maybe you should come off the internet and stop picking fights with strangers you scumbag",
                                    "score": 1,
                                    "author": "ParanoiaWarrior",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Wow that’s pretty loser of you to go through other sub reddits and deep comment threads to talk more shit to me…. Ahahahahaha that’s a new low even for you. Idk why you have so much free time but sir… you better go fill it up with something more constructive. I haven’t cared ONE bit about all your insults but I obviously struck a few cords with you because you are following me on the internet and talking shit. Lol no matter what is happening in my life at least it’s not you and your life so I’m happy again! Thanks!",
                                            "score": 1,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "What part of this post indicated that they are from the USA?",
                    "score": 0,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "People do care. But as a lady in one hospital I was at said many times. \" You are your own best advocate\" because you are the one who knows explicitly what you need. Work on yourself to be your own best you, work on yourself so when other people come into your life you already have what you need. \"Your vibe attracts your tribe\" is some a yoga teacher said frequently. Be the type of person you want to hang around. Best of luck in your journey",
            "score": 54,
            "author": "CommercialWorried319",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks!",
                    "score": 2,
                    "author": "kep_x124"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This! Sometimes we can only go up when we really hit the lowest of the low. There's no other way but up as they say. Good luck to all of us and I hope we all find the happiness we deserve and want!",
            "score": 33,
            "author": "PenFirm9045",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes! It is really hard though… For me it will take at least 3 months to get through this. But I won’t give up!",
                    "score": 9,
                    "author": "rubbyred2",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It really is a hard patch to go through. I'm in a new situation where I'll have to force myself out there in the world to give myself the chance to be known and to be finally seen after constantly hiding away like a coward. And this time, I won't have anyone to rely on but myself since I'm moving out too. BUT WE'LL GET THROUGH THIS!!! \n\nAn awesome life is waiting for us as long as we'll continue being brave and persevere. You got this op! We got this!",
                            "score": 6,
                            "author": "PenFirm9045",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you! And yes we will! Wishing you the best 💛",
                                    "score": 2,
                                    "author": "rubbyred2"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is the first step of ascending.\n\nBeing able to pull your own weight and carrying yourself with the idea of no one else having your back is MONUMENTAL when it comes to SELF-improvement and flourishing. \n\nHere's something you already know. If you have hit rock bottom then understand the only direction to go from there is UP.\n\nI believe in you, you're stronger than you can possibly imagine. \nLETS GOOOOOOOOOOO STAY VIGILANT AND GODSPEED",
            "score": 20,
            "author": "Odd-Use328",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks 😇 sometimes it feels like there is no light at the end of the tunnel… However there’s no other option but to keep going!",
                    "score": 5,
                    "author": "rubbyred2",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "As long as you're moving you aren't hopeless. As long as you are doing SOMETHING. I can't promise you it'll get better, but I can promise you that you become more tolerable to ur situation",
                            "score": 2,
                            "author": "Odd-Use328"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yes. People rarely care &amp; if some do, they rarely stay for long. Eventually, you only have to take command of your life. \n\nI just experienced this thing a few days ago when one of my friends told me that she doesn't want to discuss our issues anymore. Although, we had already stopped talking about our daily, tiny things some months ago but we were still friends as before. But that day, I realized that even on telling how lonely, distracted I had been feeling from some days, she didn't open up fully to discuss that. She told that she has been trying to solve her issues alone as no one would actually understand the concerns of others. I knew she is a bit hesitant type of girl who sometimes don't want to express herself much, but that day it was the first time when I realized she has really changed.",
            "score": 16,
            "author": "FrostyCampaign4670"
        },
        {
            "level": 0,
            "comment": "You're absolutely correct, and it is likely going to be one of the most challenging and empowering experiences of your life.  \n\nIn 2018 I lost everything because of a mental health crisis. My friends, family, home, beloved pets and everything I had been working for in my life. I was entirely on my own having to figure out how to navigate homelessness, an emotional crisis triggered by yet another sa and being all alone for the first time without the codependent relationship of my mom. It was terrifying and liberating. It forced me to put all of what I had to give into my survival and rebuilding of my life. I was challenged in ways that pushed past limits I never imaged I'd be forced to push past. I had to advocate for myself and find the voice thatd always been robbed of me in regards to how I managed my mental health and how I was going to dictate my road to recovery. It was hard and I would not change a thing. I proved to my self that I can take care of myself. I can advocate for myself. I can speak for myself. I don't need to rely on my mom or depend on friends who were never there for me anyway. It was uncomfortable at times, it was scary and unsafe. But I showed myself what I'm capable of and I'll never doubt myself again.\n\nAnd I rebuilt my life into something better than I could have imagined before I tore it all down. It was worth it  in every way.",
            "score": 6,
            "author": "Salty-Office7835"
        },
        {
            "level": 0,
            "comment": "When you realise that everyone in this world is lonely, you will be okay, the way out is how to find peace when you are alone",
            "score": 4,
            "author": "TheRevolutionaryArmy"
        },
        {
            "level": 0,
            "comment": "Good Luck and positive vibes to you. \n\nI think that some people do care but have there own battles and troubles. I learnt that I needed to be my saviour a long time ago and prioritising myself was inevitable of the best decisions I've made evn if sometimes I still get it wrong. Everyday is a school day. Hope you find what your looking for in life.",
            "score": 4,
            "author": "DangerousDetail9096"
        },
        {
            "level": 0,
            "comment": "In the end the only person you can 100% rely on is yourself. This entire situation sucks but you're right, you will make new friends, you will find love, you will have a good life. \nIf you put in all the hard work now you'll have done it and can completely enjoy the happiness you've worked hard for. \n\nBest of luck on your journey! You're going to crush it 🙂",
            "score": 4,
            "author": "DigestedDiamond"
        },
        {
            "level": 0,
            "comment": "One of my favorite quotes in the dark knight trilogy is\n\n\"Why do we fall? \n\nSo we can learn to pick ourselves up\"\n\nIt's not much but it gave me some motivation to keep going. I hope it helps. Good luck on your journey",
            "score": 4,
            "author": "Minimum_Bar5835"
        },
        {
            "level": 0,
            "comment": "Honestly view this in a positive way: no one gives a shit, so step up and do what you want with your life without the fear of being judged by others. Think people will make fun of you for going to the gym and lifting light weights? Fuck it, who cares. You know what your goals are so that’s the only thing that matters \n\nTaking initiative will also help you become a stronger individual, so view this in a positive light. Those who are coddled throughout their life into adulthood will struggle to ever do things on their own",
            "score": 3,
            "author": "swerve408"
        },
        {
            "level": 0,
            "comment": "That’s awesome!",
            "score": 2,
            "author": "Xvboondocker"
        },
        {
            "level": 0,
            "comment": "Good plan OP. Sounds like you've made a decision! Brilliant. I am right there with you. I'm about to claw my way to some meaningful change...I hope.\nDo or die is my motto these days ✌",
            "score": 2,
            "author": "onedemtwodem",
            "replies": [
                {
                    "level": 1,
                    "comment": "Do or die literally! Good luck to you too!",
                    "score": 1,
                    "author": "rubbyred2"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Let’s go king 👑",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Queen *** 👸",
                    "score": 16,
                    "author": "rubbyred2"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You will get all that you deserve!\n\nYou are your superhero, #1 cheerleader and top priority. \n\nDon’t ever give up! Keep up the good work!",
            "score": 2,
            "author": "Melexpressions"
        },
        {
            "level": 0,
            "comment": "I'm in the same place and I am so cynical that I don't know if I can make it out",
            "score": 2,
            "author": "MauPow"
        },
        {
            "level": 0,
            "comment": "You have to love yourself. Hardest thing in the world. You’re in the right track.",
            "score": 2,
            "author": "svadhyaya7"
        },
        {
            "level": 0,
            "comment": "Powerful epiphany.",
            "score": 2,
            "author": "ColossalFuckboy"
        },
        {
            "level": 0,
            "comment": "Love this post and every persons comments, I feel connected with every person even if we never know each others names. \nBooks really helped me through my downs  . I have to mention  a couple\nUntethered soul- michael singer\nLiving in the light- shakti gawain \n4 agreements-don miguel Ruiz\nSeat of the soul- gary Zukov\nThese are 4 of my favorites off top of my head but really the list Is so much longer...saved me so many times..all of them are paradigm shifting , earth shattering, life changing , straight up.",
            "score": 2,
            "author": "In10shunsMatter"
        },
        {
            "level": 0,
            "comment": "The moment you change from life's victim, to champion of your own life is when it all starts to change, the challenges don't disappear but you face them in a whole new way.",
            "score": 2,
            "author": "CivilProfit"
        },
        {
            "level": 0,
            "comment": "It's creeping me out how I got the notif for this post when I just finished having a breakdown. Salute to all of us. We will take over.",
            "score": 2,
            "author": "leivynyanwifey"
        },
        {
            "level": 0,
            "comment": "You're not alone, friend\n\nAnd you are already worthy of your own love, you always were",
            "score": 2,
            "author": "BodhingJay"
        },
        {
            "level": 0,
            "comment": "I saw something yesterday that said something like, \"God doesn't expect you to lean on a shovel and pray for a hole\". No one can propel you forward if you aren't even willing to invest in yourself. Once YOU give yourself value, it allows others to do so as well. Even if others do care, they can't create your life for you. We always have the ultimate responsibility for ourselves. Kudos and well wishes to everyone who is willing to step up and take their wheel.",
            "score": 2,
            "author": "edgepatrol"
        },
        {
            "level": 0,
            "comment": "Radical acceptance of everything you see as a projection of your own mind will really REALLY change your whole world. Everything is just a reflection, mirrors bb. Enjoy the ride. Welcome home. I BELIVE IN YOU.",
            "score": 2,
            "author": "x4nd3l2"
        },
        {
            "level": 0,
            "comment": "To all those who feel alone, sad, pained…I love you. I wish I could be your friend. I’ve seen how lonely life can get. I’m not very responsive on Reddit or other social media so it’s hard for me to say reach out but truly, honestly, I really love you and I wish you the very best life has to offer. Open your heart to the endless possibilities. Life can change quickly when you look for it.",
            "score": 2,
            "author": "Hollyroller390"
        },
        {
            "level": 0,
            "comment": "I’m sure many care, but you are your only real help. My favorite quote is, “I am my problem and I am my solution.” You got this!",
            "score": 2,
            "author": "According-Cap7409"
        },
        {
            "level": 0,
            "comment": "This was also me when I was at my lowest. I said to myself that if I couldn't save and pull myself up, no one would be able to do that for me. If I want to be better then I have to do it myself.",
            "score": 2,
            "author": "cheesecakerr"
        },
        {
            "level": 0,
            "comment": "Tsss, i can relate sis. I'm rooting for the both of us",
            "score": 1,
            "author": "RavDLC"
        },
        {
            "level": 0,
            "comment": "And they say philosophers, psychiatrists, mothers, dear, friends, mentors, etc. but that’s when they all start caring ….. no when we care for ourselves",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I'm with you bro. LFG",
            "score": 1,
            "author": "23gnaixuy"
        },
        {
            "level": 0,
            "comment": "This is what awakening is. \nYes we all go through our mental phases, but no one can and will save us. We have the choice to change for the better. Well done Rubbyred2!",
            "score": 1,
            "author": "SparkCentric"
        },
        {
            "level": 0,
            "comment": "No one is coming to save you. Become strong so you can be a pillar to your friends and family.",
            "score": 1,
            "author": "heyhihowyahdurn"
        },
        {
            "level": 0,
            "comment": "I am in the same boat \nJust keep sailing bro life will go on no matter what \nTime won't stop for anyone so just pick yourself up and start working for yourself \nNo one can save us 🫰",
            "score": 1,
            "author": "Own_Business_8128"
        },
        {
            "level": 0,
            "comment": "Realization that no one else can save you is the great start! Once we do that, it's when the real work starts and it just gets better! Good luck!",
            "score": 1,
            "author": "be_kind_to_yourself_"
        },
        {
            "level": 0,
            "comment": "I saw this when I was spiraling.  Thank you for the life jacket.",
            "score": 1,
            "author": "lemonlollipop"
        },
        {
            "level": 0,
            "comment": "And NOW your life will change. \nHold on and enjoy the ride.",
            "score": 1,
            "author": "annloves2cook"
        },
        {
            "level": 0,
            "comment": "You are strong my buddy! Bless you. You inspire me to not give up and work my way up. Good luck in your journey, wish you success.",
            "score": 1,
            "author": "Any_Lead3"
        },
        {
            "level": 0,
            "comment": "I realized that too, and it's so liberating to feel like you're taking back control of your life.",
            "score": 1,
            "author": "Catarster0n"
        },
        {
            "level": 0,
            "comment": "I feel you man, my rock bottoms have only gotten less worse. Things are turning my way but I have a ways to go honestly.",
            "score": 1,
            "author": "PentatonicScaIe"
        },
        {
            "level": 0,
            "comment": "I was in a dark place for a long time. Going to the gym helped a lot and starting to enjoy life again, I also have someone that helps but we can’t fully be together. So I know the pain.",
            "score": 1,
            "author": "AquaStardust"
        },
        {
            "level": 0,
            "comment": "Stay strong brothers , one breath at a time.",
            "score": 1,
            "author": "ry3er"
        },
        {
            "level": 0,
            "comment": "You gotta learn to love yourself! Congrats!",
            "score": 1,
            "author": "likeomfgreally"
        },
        {
            "level": 0,
            "comment": "Im feeling like im stuck in this dark place, i dont know what will really help me or is just a stupid hobby i can do to pass time, i dont know where i want to be in the next 4 years, i feel overwhelmed all the time with the fact im not sure what would make my life better and everything i think of is not real or just bullshit and i cant make myself think of anything else besides this depressive state",
            "score": 1,
            "author": "Dread_of_bed"
        },
        {
            "level": 0,
            "comment": "You will be unstoppable And you will do it. Keep it moving. Celebrate the small wins and dont forget.",
            "score": 1,
            "author": "Automatic_Green_4479"
        },
        {
            "level": 0,
            "comment": "Preach!",
            "score": 1,
            "author": "Pus_Gurner"
        },
        {
            "level": 0,
            "comment": "Love this! I was definitely in a similar situation as you but then I decided I wanted to be happier. Some days I still feel a bit lonely but I’m definitely at a better spot in my life than before. I’m rooting for you and the new life you chose :)",
            "score": 1,
            "author": "trluxn"
        },
        {
            "level": 0,
            "comment": "Good luck. Maybe it'll happen, maybe not.",
            "score": 1,
            "author": "_BeefJerk"
        },
        {
            "level": 0,
            "comment": "Wishing you all the best in life!",
            "score": 1,
            "author": "SpreadLoveInYourLife"
        },
        {
            "level": 0,
            "comment": "Was there a little less than  2 years ago. Existence  was awful. But I was persistent and my life has dramatically changed for the better. It is possible, just use baby steps and keep persistent. Life can really only get better for you now. Good luck stay persistent.",
            "score": 1,
            "author": "OstrichPandaCat"
        },
        {
            "level": 0,
            "comment": "Bout time.  Carry on.",
            "score": 1,
            "author": "New-Emphasis-5810"
        },
        {
            "level": 0,
            "comment": "This is precisely the mindset that's required to reassert sovereign control. (A stark dividing line between what was and what's to come :)",
            "score": 1,
            "author": "harmoniousmonday"
        },
        {
            "level": 0,
            "comment": "You can’t have branched that scratch the heavens if you don’t have roots that reach to hell. Pulling yourself from the lowest of lows is when you find what you’re made of, it’s when you find yourself, and give yourself everything you had been waiting for the world to give. Slowly but surely you fill your heart and life with things that bring you joy and contentment. Then you realize people that truly love, value and honor you start sitting beside you. You’re taking the first step and that is so very brave of you. Never stop fighting for yourself. You deserve it ♥️",
            "score": 1,
            "author": "ExpensiveIncident739"
        },
        {
            "level": 0,
            "comment": "YOU ARE WINNING ALREADY MY FRIEND!! KEEP GOING!! ❤️❤️❤️",
            "score": 1,
            "author": "Responsible_Foot4494"
        },
        {
            "level": 0,
            "comment": "I was there, I am kind of still there, but that’s the first thing you have to realize, it’s you for you. \n\nFriends and “Family” (yes, a chosen one for many of us) will follow. \n\nOnce you are where you want to be, need to be, everything else just starts happening. I’ve been at rock bottom a few times in life due to things out of my hand, but it gets easier. Not always, but many times. You’ll be proud of everything you earned and worked for. You’ll be proud of the safety you’ve created, because nobody can take away what you gave yourself. Stand strong and let the good people find you. Yes, you only have yourself to help you out. Yes, it’s lonely and frightening and sad, but guess what? You’ll know what you’re capable of, you’ll gain more self-confidence and for me it also taught me to finally put boundaries in place. Respect myself more. We only get one chance, who cares about others then? My life, lets go, make it great.",
            "score": 1,
            "author": "dosabby1"
        },
        {
            "level": 0,
            "comment": "I cared for someone for a couple of years. He was struggling a lot. I stayd even tho I got daily psychological pressure. I dont love you.. I need to find another one. I never like you for all this years. Etc . But at the end. He said that he was all alone and noone is there for him. So sometimes you guys struggling doesnt understand that there is someone so open your eyes and allow others to help you. \n\nAt the end I left. I cant put myself in the same struggle if person doesnt want the help. Enough is enough.",
            "score": 1,
            "author": "Demiarl"
        },
        {
            "level": 0,
            "comment": "It’s all you bro. This is the mentality you need. Good luck",
            "score": 1,
            "author": "Sniffrrlite"
        },
        {
            "level": 0,
            "comment": "It starts with a ‘Will To Be’ brother/sister.\n\nI wish you well. Mind over matter.",
            "score": 1,
            "author": "swaliepapa"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Your submission to /r/selfimprovement was automatically removed because you may not try to get around rule #2 regarding posting links, nor may you violate Rule #3 regarding self-promotion and advertising. \n\nUnfortunately, we've had to add \"DM me\" and other such solicitations of one-to-one communication to this automod condition, as many spammers were trying to use that as a way to get around our no self-promotion rule.  If you were honestly just trying to talk to OP, feel free to just repost the comment without the solicitation, and you're definitely not in trouble. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/selfimprovement) if you have any questions or concerns.*",
                    "score": 1,
                    "author": "AutoModerator"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That’s the spirit we all need.",
            "score": 1,
            "author": "NoBodySpecial51"
        },
        {
            "level": 0,
            "comment": "Why is the tagged vent!!! You are lifting spirits of many!! Keep up the fight bro! The war is still onnnnnn",
            "score": 1,
            "author": "value_counts"
        },
        {
            "level": 0,
            "comment": "We can fucking do this!!!!",
            "score": 1,
            "author": "Bsr1171"
        },
        {
            "level": 0,
            "comment": "It took me awhile to realize this as well.",
            "score": 1,
            "author": "Ill_Mathematician158"
        },
        {
            "level": 0,
            "comment": "Proud of you ❤️",
            "score": 1,
            "author": "ghostfacekilla98"
        },
        {
            "level": 0,
            "comment": "YESSSSS HELL YEAH YOU WILL.",
            "score": 1,
            "author": "Even_Pizza185"
        },
        {
            "level": 0,
            "comment": "Cause most of them are fighting, their own battles. \n\nBeen trying to live by the saying. \"Expect to self-rescue, no help is coming.\"\n\n I don't even expect my wife be there anymore. Long story. \n\nBe safe.",
            "score": 1,
            "author": "medicwhat"
        },
        {
            "level": 0,
            "comment": "You got this man",
            "score": 1,
            "author": "Tuttirunken"
        },
        {
            "level": 0,
            "comment": "Wishing you the best of luck! :)",
            "score": 1,
            "author": "No_Organization_768"
        },
        {
            "level": 0,
            "comment": "Out of all the self improvement posts I've seen, this is the way to approach it. Yes, life sucksssssss sometimes. If it didn't we wouldn't be able to cherish the good moments. And this applies to EVERYONE. The energy we put out returns to us, so just by you CHOOSING, man, life is going to get better for you. It's like the universe asks us to choose daily how things are gonna go. I'm proud of you for taking this step. You're awesome.",
            "score": 1,
            "author": "librajay369"
        },
        {
            "level": 0,
            "comment": "I think that, once you come out the other side, you'll be happier and stronger and more confident because you didn't wait around for someone else to save you. You did it yourself. There's a lot of satisfaction in that.\n\nHold on, girl. Even when it's hard and you think you can't. Just hold on. You got this.",
            "score": 1,
            "author": "missfelonymayhem"
        },
        {
            "level": 0,
            "comment": "Glad to see more posts not just requesting pity.",
            "score": 1,
            "author": "On_Mt_Vesuvius"
        },
        {
            "level": 0,
            "comment": "wow this hits so close to home bro im going through the same thing and said these same words to myself yesterday i tried hard today taking small steps and got hit with problems left &amp; right but i wont give up rock bottom is hard &amp; lonely which is why im fighting so hard this pain is worth it bc feeling pain &amp; misery everyday any longer is something i cant take anymore im sending u love and STRENGTH KEEP PUSHING!",
            "score": 1,
            "author": "RealistO444"
        },
        {
            "level": 0,
            "comment": "\"we live as we dream, alone\" \n\nIt means that in this life you are alone no matter what you might like to believe. It depends on you, how your life is going. \n\nToo often our whole lives depend on how other people treat us and how life circumstances arrange themselves around us. \n\nKnowing that you alone are the master of how you experience these outside forces is a source of strength and not, what many use to think, a pitiable and tragic human fault.\n\nYou got this, wish you all the best Buddy! ✨",
            "score": 1,
            "author": "EazyG0ing"
        },
        {
            "level": 0,
            "comment": "I’m glad you decided to make that decision, it’s really easy to keep falling and never even think about how to get out of it.",
            "score": 1,
            "author": "Alyssaine"
        },
        {
            "level": 0,
            "comment": "Amen sister. I can feel your struggle, although the details of it may be different the aim is the same - come out on the other side STRONGER and BETTER then before\n\nGood luck ( :",
            "score": 1,
            "author": "Apprehensive-Home564"
        },
        {
            "level": 0,
            "comment": "I needed to hear this - life is a battle that you can only win yourself :)",
            "score": 1,
            "author": "Wish-Tricky"
        },
        {
            "level": 0,
            "comment": "Congratulations. Surrendering / Letting Go is the first step to healing.",
            "score": 1,
            "author": "Nooties"
        },
        {
            "level": 0,
            "comment": "I wish you the best okay? And hope you’ll feel better soon, I know that feeling and it’s the worst",
            "score": 1,
            "author": "marilie_prevost"
        },
        {
            "level": 0,
            "comment": "You got this my friend, you really got this. I do believe in you and you deserve it.",
            "score": 1,
            "author": "davidcodinglab"
        },
        {
            "level": 0,
            "comment": "That is a very adult realization, I wish you the absolute best on your journey.",
            "score": 1,
            "author": "bdog181"
        },
        {
            "level": 0,
            "comment": "King you got this… the fact your able and willing to share your story is a start. I haven’t had the strength lately after losing my family it’s been hard to get up everyday cause that’s what I lived for. People tell me know I should live more but they don’t understand.",
            "score": 1,
            "author": "Puzzleheaded_Set2956"
        },
        {
            "level": 0,
            "comment": "well said, and true",
            "score": 1,
            "author": "DBCoopTrain"
        },
        {
            "level": 0,
            "comment": "Kinda in the same place as you bro, hope we both make it in the end",
            "score": 1,
            "author": "CryptidCamper"
        },
        {
            "level": 0,
            "comment": "First step is acknowledgment, and you got it !!! I'm so proud of you for thinking this way",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "No one is coming to save you the only person who cares about you is you!",
            "score": 0,
            "author": "snaurr"
        }
    ]
}