{
    "id": "11p3az6",
    "score": 2,
    "title": "online single subject teaching credential asynchronous?",
    "author": "fractaldesigner",
    "date": 1678589763.0,
    "url": "https://www.reddit.com/r/CSUEB/comments/11p3az6",
    "media_urls": [],
    "other_urls": [],
    "postText": "Main concern is over whether to work full-time while attending. Thanks",
    "comments": [
        {
            "level": 0,
            "comment": "I know of a local district near Hayward that has a residency program if you’re enrolled at CSUEB. You’re not the teacher of record, but you get a stipend and you’re in the mentor teacher’s classroom all year half time. You’re then required to work 3 years in the district or you have to pay it back. The amount you pay varies on how long you’ve worked. Comment or message me if you’re interested. They’re still looking for applicants.",
            "score": 2,
            "author": "NewbieSubEducator"
        },
        {
            "level": 0,
            "comment": "If you have applied for the summer program, have you heard back from admissions?",
            "score": 1,
            "author": "Academic-Strain8402",
            "replies": [
                {
                    "level": 1,
                    "comment": " No. Have you applied for the same?",
                    "score": 1,
                    "author": "fractaldesigner",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes! I applied under the priority dates, and I had my interview, but nothing back yet",
                            "score": 1,
                            "author": "Academic-Strain8402",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Good luck to you! I'll try to remember to update my status here. May I ask what you're doing in the mean time/long term goals?",
                                    "score": 1,
                                    "author": "fractaldesigner",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thank you! I am subbing currently. I would love to teach social science at the high school level. How about you?",
                                            "score": 1,
                                            "author": "Academic-Strain8402",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Me too! Keep in contact!",
                                                    "score": 1,
                                                    "author": "fractaldesigner"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I know of a local district near Hayward who has a residency program if you’re enrolled at CSUEB. You’re not the teacher of record, but you get a stipend and you’re in the classroom all year half time. You’re then required to work 3 years in the district or you have to pay it back. The amount you pay varies on how long you’ve worked.",
                                                    "score": 1,
                                                    "author": "NewbieSubEducator"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Just stumbled on this comment, and I’m also applying to the online credential. Curious if you were able to activate your net ID?",
                    "score": 1,
                    "author": "purethought09",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was able to. After you submit the university part of the application you should get an email about setting it up",
                            "score": 1,
                            "author": "Academic-Strain8402",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks! Turns out I was issued a deleted NetID 😭\nGot it fixed a few weeks ago and just waiting to hear back.",
                                    "score": 1,
                                    "author": "purethought09"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I know of a local district near Hayward who has a residency program if you’re enrolled at CSUEB. You’re not the teacher of record, but you get a stipend and you’re in the classroom all year half time. You’re then required to work 3 years in the district or you have to pay it back. The amount you pay varies on how long you’ve worked.",
                            "score": 1,
                            "author": "NewbieSubEducator"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You can work full time but you’ll need to find a full time teaching position to do that or you won’t get your required teaching hours to graduate. It’s not as easy to do as it sounds. I mean unless you are a math major.",
            "score": 1,
            "author": "Its_the_tism",
            "replies": [
                {
                    "level": 1,
                    "comment": "Some teaching positions are online, as well, correct?",
                    "score": 1,
                    "author": "fractaldesigner",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not anymore. Good luck trying to find one of those, it’s hard enough finding an in person job. It took me almost a full year",
                            "score": 1,
                            "author": "Its_the_tism",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Even in high priority (economically disadvantaged) districts? I see teachers trying to escape those.",
                                    "score": 1,
                                    "author": "fractaldesigner",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It just depends on your area and what your program allows. My program wouldn’t let me get an online position even if I found one. I couldn’t find one anyway",
                                            "score": 1,
                                            "author": "Its_the_tism"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "East bay told me to find an in person. Now could you negotiate if that was the only paid position you found? I dont know, maybe.",
                                            "score": 1,
                                            "author": "Its_the_tism"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Question, the summer courses that are listed 10:30/11am-5pm, are we actually in class for that entire time? I was still hoping to keep my online paraprofessional job if possible over the summer.",
                    "score": 1,
                    "author": "dovah9",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you are doing the online program there’s no class times at all.",
                            "score": 1,
                            "author": "Its_the_tism",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you for the reply! When they sent out the admissions checklist, it had a sample schedule for the online program with class times on it and I was so confused",
                                    "score": 1,
                                    "author": "dovah9"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I know of a local district near Hayward who has a residency program if you’re enrolled at CSUEB. You’re not the teacher of record, but you get a stipend and you’re in the classroom all year half time. You’re then required to work 3 years in the district or you have to pay it back. The amount you pay varies on how long you’ve worked.",
                            "score": 1,
                            "author": "NewbieSubEducator"
                        }
                    ]
                }
            ]
        }
    ]
}