{
    "id": "12b0iae",
    "score": 4,
    "title": "Accepted into MSW at CSU East Bay?",
    "author": "jane_duvall",
    "date": 1680561493.0,
    "url": "https://www.reddit.com/r/CSUEB/comments/12b0iae",
    "media_urls": [],
    "other_urls": [],
    "postText": "I applied to the Fall 2023 MSW program, but just found out my application was never considered due to CSU administrative error (my transcripts were received but not marked as received in the system).  Unfortunately, I can't get in touch with the MSW office because they're closed this week, and decision deadlines are coming up for other schools.  Freaking out a bit: this was my top choice school and they never even read my application. \n\nCan any current or prospective students help me find more info?\n\n**1) When did you hear about admission offers?  Were you given a deadline to accept the offer?**  Trying to get a sense of timeline to see if they might still consider my application for fall 2023.\n\n**2) Is the MSW program being offered part time / online?**  They mentioned this option in info sessions, and I marked a preference for it on my application, but they said it was pending funding and I never heard any follow up.\n\n&amp;#x200B;\n\nCan anyone offer info or advice?  I'm kind of in the dark right now and panicked.  Thanks.",
    "comments": [
        {
            "level": 0,
            "comment": "Stressful! I haven’t heard back about my MFT application either. How did you find out about the administrative error?",
            "score": 2,
            "author": "karriariella",
            "replies": [
                {
                    "level": 1,
                    "comment": "I hope you hear back soon!    \nI was wondering why the decision took so long, decided to log into MyCSUEB with my Net ID.  It was hard to find, buried a little bit, but there was a \"to do list\" somewhere that said my transcripts were still outstanding.  Called grad admissions office who confirmed the error.  \n\n\nI would definitely confirm your application was received and completed.  If so, nothing to do but wait.  Fingers crossed for you!",
                    "score": 2,
                    "author": "jane_duvall",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "CSUEB made two errors on my application, which left a really bad taste in my mouth. I accepted an offer elsewhere and did not dare wait for CSUEB although it was originally my first choice. The program I accepted is very organized, responsive, and thoughtful. I am not sure what is happening at East Bay, but I had previously sent two emails to the program coordinator that were simple answers and I never got a response. It makes me wonder if their grad programs are as disorganized and mediocre. I still have not heard back on my application and I anticipate it still will take a while. Goodluck!",
                            "score": 1,
                            "author": "NeuroNerd1906",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Interesting.... I had emailed my grad dept earlier in the year asking for an update about whether they would offer online and never heard back.  Could be a red flag, could just be some long time admin staff who don't care (having worked at a university myself, I get it).  \n\nI'm glad you accepted another offer.  Thank you so much for the intel!",
                                    "score": 1,
                                    "author": "jane_duvall"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Any word back on your MFT application?",
                    "score": 2,
                    "author": "NeuroNerd1906",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No! You?",
                            "score": 1,
                            "author": "karriariella"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Does anyone know when decisions will be sent out?? I called and they said no later than March and then April came around and they said no later than April and it’s the 30th today 🙃",
            "score": 2,
            "author": "Bearyoat",
            "replies": [
                {
                    "level": 1,
                    "comment": "decisions are on a rolling basis so i think they're reviewing applications submitted in March now. so hopefully we should hear back within the next week or two!",
                    "score": 1,
                    "author": "llamalion0",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I actually heard back today around 11 AM. Hopefully everyone else hears back soon as well.",
                            "score": 1,
                            "author": "Bearyoat",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "did you already interview? and do you mind sharing when you submitted your application?",
                                    "score": 1,
                                    "author": "llamalion0",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Wait so sorry, are you talking about the MSW or MFT program?",
                                            "score": 1,
                                            "author": "Bearyoat",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "oh my bad, i was asking for MFT",
                                                    "score": 1,
                                                    "author": "llamalion0"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Congratulations! Curiously, did you receive a call or email?",
                                    "score": 1,
                                    "author": "jackytothemoon",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I applied to the MSW and they sent an email :)",
                                            "score": 2,
                                            "author": "Bearyoat"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thank you so much! And congratulations again!",
            "score": 1,
            "author": "jackytothemoon"
        },
        {
            "level": 0,
            "comment": "Do you guys know if they pay u for the field work internship ? I’m struggling to figure out what to do for work during the program",
            "score": 1,
            "author": "Bearyoat"
        }
    ]
}