{
    "id": "1p06a2",
    "score": 1,
    "title": "Question About Commuting / Share your Stories!",
    "author": "HeyHosh",
    "date": 1382477318.0,
    "url": "https://www.reddit.com/r/CSUEB/comments/1p06a2",
    "media_urls": [],
    "other_urls": [],
    "postText": "So I'm considering living in Berkeley or SF and commuting to CSUEB. I like CSUEB, but the surrounding area sucks. So is this doable or not worth it? Even if you don't live in Berkeley or SF, feel free to share (or even complain about) your commute! I'm totally unfamiliar with the Bay Area so any information/experience would be great! ",
    "comments": [
        {
            "level": 0,
            "comment": "Hey. Live in Pleasant Hill and BART to school. The biggest hassle is the amount of time you have to put into getting places. I have to leave about 2 hours before I need to get there to compensate for late trains and shuttles and such. However so far it is much cheaper than living nearby. Plus I can watch movies and read on the train so there's that. As well as the random performers on the cars trying to make a little money. Lately there has been a Bay Area dance group doing routines on the cars asking for money. Once I got a guy playing his accordion.\n\nThen again there are the random people asking you for money for their \"friend\" or \"wife\" so they can get off the station. I never have any cash on me (you know, college and no job) but it's still a downside of Public transportation...\n\nTl:DR; Maybe?\n\nIt all depends on how much you value your time.",
            "score": 1,
            "author": "BobtheNinjaMan",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh seriously. When people come up to me I'm always like dude I'm a broke college student, you're definitely asking the wrong person lol\n\nAnd I've never heard of Pleasant Hill, but I just googled it, and it seems a little too far out. I'm from Santa Maria so idk. If it's too suburban or inland, then I'm not all interested no offense lol\n\nAnd what's TI:DR? Lol",
                    "score": 2,
                    "author": "HeyHosh",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Too Long: Didn't Read",
                            "score": 1,
                            "author": "BobtheNinjaMan",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh wow I'm not hip at all lol",
                                    "score": 1,
                                    "author": "HeyHosh"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I live in El Cerrito (next to Berkeley) and commute. It's not too bad. The BART ride is about 40 minutes, the shuttle takes 10, usually I don't have to wait more then 10 minutes for a shuttle but I'm not commuting at the most popular hours so I've heard from others that sometimes they have to wait for a second shuttle when the first one fills up. I think it's worth it though. You can entertain yourself pretty easily on the train and I find the time passes pretty fast. If you drive, the drive from the berkeley area wouldn't be too bad either if you're not commuting during rush hour.",
            "score": 1,
            "author": "donanobis",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh damn. That's not bad at all. And I keep forgetting that there's BART up there. I hate driving with a passion lol. Like I'd rather get up an hour earlier than have to commute haha",
                    "score": 1,
                    "author": "HeyHosh"
                }
            ]
        }
    ]
}