{
    "id": "fgp2hm",
    "score": 16,
    "title": "So ... classes are cancelled until Monday?",
    "author": "Facelans",
    "date": 1583889999.0,
    "url": "https://www.reddit.com/r/CSUEB/comments/fgp2hm",
    "media_urls": [
        "https://i.redd.it/qhmly0an4yl41.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "From what I understand they’re gonna use this week for the professors to prepare their online material. You’ll have your regular schedule classes starting next Monday but online. Seems like labs and studios will continue to meet on campus though.",
            "score": 9,
            "author": "IcDimsum",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have an exam next Tuesday. Does that mean it’ll be online? Or will it be postponed? My professor didn’t discuss it yet",
                    "score": 5,
                    "author": "Facelans",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m pretty sure all of our professors will be emailing us details soon. Good luck on your exam!",
                            "score": 6,
                            "author": "IcDimsum"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Labs will be moved online.",
                    "score": 1,
                    "author": "MellifluousCacophony",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Are you sure? Or maybe it just differs per lab? Because at least for me there hasn't been any confirmation that my labs are canceled.",
                            "score": 2,
                            "author": "3DSlime",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My entire dept cancelled labs. Sure, some decided to stick around and give lab exams but they are the exception to my knowledge. It is best that all courses be moved online ASAP. According to Univ communication, all courses were suspended for the remainder of this week. Is your lab still meeting?",
                                    "score": 1,
                                    "author": "MellifluousCacophony",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I got an update, for me my lab (CHEM 111) has been moved to online. Same goes for my COMM 100 class as well.",
                                            "score": 2,
                                            "author": "3DSlime"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m pissed off at my professor, she gives a quiz every week and when she found out about this news she basically said she has to increase the difficulty of her quizzes. The best part is, is that her quizzes already are so hard the entire class bombed the last one.",
            "score": 7,
            "author": "AskinggAlesana"
        },
        {
            "level": 0,
            "comment": "I’m in the MBA program and this is our finals week since that program is still in the quarter system. Both of my classes had group presentations, we shall see what the professor says now. Our next quarter starts on Monday.",
            "score": 4,
            "author": "KirchoffRegime"
        },
        {
            "level": 0,
            "comment": "Seems like that's what they're saying for lecture classes.",
            "score": 1,
            "author": "MACh518"
        },
        {
            "level": 0,
            "comment": "Excellent",
            "score": 1,
            "author": "Complete-River",
            "replies": [
                {
                    "level": 1,
                    "comment": "My sentiments exactly!\nYou, sir? , are a man of proper sense!",
                    "score": 1,
                    "author": "mtmag_dev52"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Woohoo?",
            "score": 1,
            "author": "mtmag_dev52"
        }
    ]
}