{
    "id": "fqxjkl",
    "score": 10,
    "title": "Fellow seniors how do you feel?",
    "author": "Not__Kanye_West__",
    "date": 1585446837.0,
    "url": "https://www.reddit.com/r/CSUEB/comments/fqxjkl",
    "media_urls": [],
    "other_urls": [],
    "postText": "How do you guys feel about the online classes instead of in-person? How do you guys feel about not have a ceremony?  \n\nTransitioning from in-person to online for some professors , I feel like they’re having a hard time. It sucks that for one class I can’t get a zoom meeting it’s prerecorded. Kinda shitty not to have a ceremony but oh well. Hopefully they let us take summer classes all online instead of in person so we can work internships and not waste another semester if you need to finish a class or two to graduate. Anyways just wanted to pick peoples brains see what y’all feel about this whole situation. Just rambling lol",
    "comments": [
        {
            "level": 0,
            "comment": "Pretty sad. I just started making friends this semester and I miss them. I made plans to go out to dinner with them at the end of the sem, but who knows if I’ll see them by May. I’m super distracted at home, if I’m not required to do something, I will put it off. I feel sad because graduation is a social construct that I feel I’m being “robbed of.” Lol. But maybe we’ll have a ceremony in the summer, idk. \nI hope you’re doing ok though, we will get thru this semester :c",
            "score": 8,
            "author": "icouldneverr",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you , I'm doing well. Same, I can't concentrate at home. I started to take my laptop into my car and just work from inside my passenger seat. Helps with distractions. I hope you're doing well. \n For sure, I started to network this year with fellow students but oh well I feel your pain.",
                    "score": 4,
                    "author": "Not__Kanye_West__"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm just heated that I signed up for in person classes now I'm forced to do online. I dont learn well online. Just gimme the damn A and let me get outta here.",
            "score": 6,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I feel you.",
                    "score": 3,
                    "author": "Not__Kanye_West__"
                },
                {
                    "level": 1,
                    "comment": "Same.  That's the only reason I never take online classes",
                    "score": 4,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "Have you guys seen this?\n\n\nhttps://www.change.org/p/chancellor-timothy-p-white-change-csu-east-bay-s-spring-2020-grades-to-as-for-all?utm_content=cl_sharecopy_21212273_en-US%3Av3&amp;recruiter=1048658415&amp;recruited_by_id=07c12460-633b-11ea-a7a4-2b0d96bc33b9&amp;utm_source=share_petition&amp;utm_medium=copylink&amp;utm_campaign=psf_combo_share_abi&amp;utm_term=psf_combo_share_initial",
                    "score": 3,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I finished my last semester of coursework in the fall and moved back home to LA at the start of 2020. I was excited to go back and visit in May, so I'm sad about that. It's still an accomplishment though. I'm going to buy all the crap even though we might not get to walk...",
            "score": 3,
            "author": "PwnerifficOne",
            "replies": [
                {
                    "level": 1,
                    "comment": "Dang, I keep reading LA is hardest hit than in the Bay Area with all the virus stuff. I want all the 2020 stuff as well lol. Stay safe",
                    "score": 2,
                    "author": "Not__Kanye_West__"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s horrible for me, ended up taking one of my hardest classes to date this semester and the online isn’t cutting it with the professor who’s already lowly rated. To make matters worse even though the whole class bombed the last quiz because of how hard it was, she said and has made every following quiz that’s online twice as hard. I might fail this class now.",
            "score": 1,
            "author": "AskinggAlesana",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m sorry 😐 What class is it?",
                    "score": 1,
                    "author": "Not__Kanye_West__",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "History and Systems of psychology.",
                            "score": 1,
                            "author": "AskinggAlesana",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah I don’t know anything about systems of psychology . Maybe try the online tutoring that is offered. Sorry good luck",
                                    "score": 1,
                                    "author": "Not__Kanye_West__"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}