{
    "id": "ghh9fb",
    "score": 2,
    "title": "Questions about the online BSBA program",
    "author": "iPinoy",
    "date": 1589173568.0,
    "url": "https://www.reddit.com/r/CSUEB/comments/ghh9fb",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello,\nI wasn't able to get a clear answer from emailing so I've come to ask questions here.\nI'm currently at my CC looking to complete my Business Admin ADT in the summer and transfer for Spring 2021. My question(s) is,\n\nHow is the online BSBA program in general?\n\nIs it more rigorous online than on-campus?\n\nDo I need to take a Business Calculus class for the upper divisions, even though my ADT doesn't require it? \n\nCan I still enter &amp; graduate from the program without the calculus course? \n\nThanks",
    "comments": [
        {
            "level": 0,
            "comment": "Hi there, \n\nI transferred from DeAnza with my ADT degree into the BSBA online program last fall. To answer your questions:\n\nI honestly feel like the classes are way easier than some of the classes I’ve taken online at a CC. With that being said there aren’t a lot of options in terms of variety of professors teaching the same courses. You’ll get offered one or maybe two different professors teaching the course. \n\nAs for business calculus, I completed my class at CC in person. I highly recommend taking this class in person at a CC. I found the class challenging even with a good teacher. Also it’ll save you some $$. Costs run at about ~$1100-1200 per/class because tuition is slightly higher for the online program. \n\nIf you have any other questions feel free to PM me.",
            "score": 1,
            "author": "errccccb",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hi, thanks for answering. At the moment I have the intention of going into the ITM option. I've yet to complete the Business Calc class required for transfer, I'm in a weird situation and I'm trying to clear it up. I may come back to this post and ask questions at random times if that's ok with you.",
                    "score": 1,
                    "author": "iPinoy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": " No problem. Happy to help!",
                            "score": 1,
                            "author": "errccccb",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hi again, this subject kind of popped up randomly.\n\nHow many classes do you think is manageable considering the difficulty of each class? At first, I was thinking of taking 3 courses per semester, and 1 in the summer, but I was wondering if taking 4 courses at a time would be too much, I'm not too bright of a student and like to take things slower, I'm barely getting by my lower divisions at my CC, and I imagine that I probably wouldn't fare too well in the upper-divs if I took too many courses at a time.",
                                    "score": 1,
                                    "author": "iPinoy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Hi there,\n\nI took 2 during my first semester, then upped it to 3 classes the next semester. I work a full time job and 3 is probably the max I can manage while maintaining good grades. I was never a good student through community college, however I do find upper-divs class a little easier than classes in CC. Also, now that I’m paying for school I don’t want to waste money on a work load that I know I can’t manage. \n\nP.s.- Don’t sweat about taking your time go at your own pace. No matter what other people may think. \n\n“It’s not the destination it’s the journey...” -K. Bryant",
                                            "score": 1,
                                            "author": "errccccb"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Howdy u/errccccb\n\nI am also a deanza alumnus set to trabafer to East bay in the fall.\n\nWould like to know if could get in touch with you about campus and how business program at east bay is going for yiu so far.\n\nFeel free to dm or reply back when you can\n\nHonored to make your acquaintance. \nMtmag",
                    "score": 1,
                    "author": "mtmag_dev52"
                },
                {
                    "level": 1,
                    "comment": "For the upper GE courses, were they the same unit price of $433 like the online business program?",
                    "score": 1,
                    "author": "keekyfreaky",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes the unit prices are the same for upper GE courses.",
                            "score": 1,
                            "author": "errccccb",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks for replying!",
                                    "score": 1,
                                    "author": "keekyfreaky"
                                },
                                {
                                    "level": 3,
                                    "comment": "Sorry one more question, on assist.org it say Business Finite Mathematics will suffice, but does that mean I will still have to take Business Calculus at East Bay eventually to graduate?",
                                    "score": 1,
                                    "author": "keekyfreaky"
                                },
                                {
                                    "level": 3,
                                    "comment": "so sorry this is so random but for financial aid, does cal grant &amp; pell grant get disbursed for online? i cant find anything abt it anywhere, or do they only cover the amount that you actually need? did u ever have any left over if u got it? thank you 😭",
                                    "score": 1,
                                    "author": "madscats",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yes they’re disbursed for the online program and they give you the max amount you’re qualified for based off your FAFSA. Once the funds are disbursed by CSUEB they deduct what you owe in tuition and student fees and you’re refunded the remaining money.",
                                            "score": 1,
                                            "author": "errccccb",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "omg thank u ur a lifesaver",
                                                    "score": 2,
                                                    "author": "madscats"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}