{
    "id": "heu1gz",
    "score": 4,
    "title": "Help out if you are interested",
    "author": "CBMentorship",
    "date": 1592972037.0,
    "url": "https://www.reddit.com/r/CSUEB/comments/heu1gz",
    "media_urls": [
        "https://www.reddit.com/r/CSUEB/comments/heu1gz/help_out_if_you_are_interested/"
    ],
    "other_urls": [
        "https://forms.gle/6rApEeUh8BescMta9](https://forms.gle/6rApEeUh8BescMta9)"
    ],
    "postText": "Not sure if its allowed to post here but….\n\nHello everyone,\n\nI am a college student and I know the feeling that high schoolers get when they are seniors. High school seniors feel overwhelmed and anxious about the college process. From deciding what schools to apply, starting the applications, and deciding what school to go to. I always wanted to start a mentorship program to help seniors through that process. My goal and plan is to create College Bound Mentorship and help around 50 seniors by pairing them up with a college student. The pairing will allow seniors to start connections with college students as well as to have someone who they will be able to  seek when they have questions. I know that my idea is still up in the air but It  wouldn't  be possible  to start it if I do not have Mentors to help out. Please fill out this google form if you are interested in helping out.\n\nThanks!\n\n[https://forms.gle/6rApEeUh8BescMta9](https://forms.gle/6rApEeUh8BescMta9)",
    "comments": [
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was trying to figure that out as the program would be for for college students to help high school seniors. Yet I was thinking that potentially some alumni could be a mentor to a mentor. If you are interested in something like that message me",
                    "score": 1,
                    "author": "CBMentorship"
                }
            ]
        }
    ]
}