{
    "id": "hqaeva",
    "score": 1,
    "title": "Mathew Hubbard",
    "author": "cabinetBrush",
    "date": 1594622509.0,
    "url": "https://www.reddit.com/r/CSUEB/comments/hqaeva",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm just finding out that professor Hubbard was kicked out of the college for making an offensive statement. I was planning to take him for the upcoming semester cause I heard he was a chill guy. I wonder who is going to replace him. I really hope it's a good teacher and not a random curriculum nazi. If you have any information on the replacement or updates on if he'll be allowed back please let me know.",
    "comments": [
        {
            "level": 0,
            "comment": "I hope he's not allowed back, he sounds like an absolute fucking asshole. They'll tell you at graduation that CSUEB is the most ethnically diverse university in the US. He doesn't sound fit to teach the students at this or any university if he's going to be like that.",
            "score": 6,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I could not agree more. CSUEB needs to also diversify their staff.",
                    "score": 5,
                    "author": "cabinetBrush"
                },
                {
                    "level": 1,
                    "comment": "You realize he was fired because he told a student their name sounded like profanity and was probably concerned or not comfortable saying it. How is that racist.",
                    "score": -1,
                    "author": "Gizshot"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Had to be something more. There is a professor in the engineering major that has said way worst stuff with terrible year end reviews by everyone and they’re still there, I’m guessing cuz ya know tenured.",
            "score": 1,
            "author": "soleeflyy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oo spill the tea. who's the proffesor?\n\nI think it also as to do part with the university trying to maintain it's reputation. As it is the most diverse school in the country. Any news like that especially during this time only hurts the college. I can't imagine the freshman enrolling this year would be too excited to go to a school where a proffesor like Hubbard works. The enrollment is going to be way lower.",
                    "score": 1,
                    "author": "cabinetBrush",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I had Hubbard as a differential equations professor he always came off a little weird to me but I didn’t have any issues with him it’s different for everyone. I won’t name names just because this is the internet and I would hate for it to get back to me but if you really wanna know feel free to message me. But for the sake of the post, something along the lines of “...this isn’t Africa” was said and tbh I don’t even think they are truly racist just ignorant.",
                            "score": 2,
                            "author": "soleeflyy"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hes a great fucking teacher though peoples personal views as long as not shown at work shouldnt matter. This is why company's block people from wearing political and other oppinion based stuff to work.\n\nHe was fired cause he wasnt comfortable saying someones name seems kinda bullshit to me.",
            "score": 0,
            "author": "Gizshot"
        }
    ]
}