{
    "id": "zvxfdw",
    "score": 3,
    "title": "Cs 311 with Yang",
    "author": "RandomBullshitGo__",
    "date": 1672090124.0,
    "url": "https://www.reddit.com/r/CSUEB/comments/zvxfdw",
    "media_urls": [],
    "other_urls": [],
    "postText": "I hear this professor is tough. Anyone have some advice on getting through his classes? All the other professors have so many people on their waitlists. \n\nAlso if anyone had a syllabus from cs 311 I’d appreciate if you can send it to me.",
    "comments": [
        {
            "level": 0,
            "comment": "If someone sends it to you can you share with me? I have him this spring",
            "score": 3,
            "author": "hashtaters",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah i’ll share. Lmk if you find anyone that has it.",
                    "score": 3,
                    "author": "RandomBullshitGo__"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m also taking yang this spring for cs 401 and cs 311. I’m hearing not so good things about him so I’m scared as well",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah i’m def scared. If you and u/hashtaters wanna keep in contact and work together this semester let me know\n\nAdd me on https://discord.com/ so we can talk! My username is Dqueezy923#9545.",
                    "score": 2,
                    "author": "RandomBullshitGo__",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah sure bro. Hella appreciate it!",
                            "score": 2,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "For CS 401 find yourself some solid classmates who CAN CODE (kinda rare at EB)!!\n\nYou’re going to enjoy the project much more, and if you make a good UI for it, you could showcase that on your portfolio.\n\nAlso, the lectures are going to be boring and will suck if you have ever used basic tools like git before. See my other comment. Labs will be just exercises with the TA supervision (could be done at home IMO as homework).",
                    "score": 2,
                    "author": "screamuchx"
                }
            ]
        },
        {
            "level": 0,
            "comment": "David Yang? A few years ago I used to come, eat lunch and take an afternoon nap in his cs 401. Guy was teaching some outdated Java stuff. Don’t even get me started on the lab, although the TA was reasonable.",
            "score": 3,
            "author": "screamuchx"
        }
    ]
}