{
    "id": "101yzu4",
    "score": 3803,
    "title": "Bolivian police set their own motorcycles on fire to blame the population for \"rioting\"",
    "author": "UberPancake88",
    "date": 1672722809.0,
    "url": "https://www.reddit.com/r/iamatotalpieceofshit/comments/101yzu4",
    "media_urls": [
        "https://v.redd.it/5uk8kc66ir9a1"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\nPlease note that we will ban you if a post or comment breaks any of our rules. **Be especially mindful of the following**:\n\n**Rule 1: Do not post or ask for identifying information, including first and last names and social media usernames.** Public figures are **not** exempt. We remove all external links to prevent accidental posting of identifying information.\n\n**Rule 2: Do not post violent comments, and do not glorify violence, per TOS.** We can't take responsibility for how angry a post makes you, you need to do that. Telling us \"it was a joke bro\" is not an excuse.\n\n**Rule 7: Do not link to or post screenshots of reddit posts, reddit comments, reddit personal messages, reddit profiles, etc.** We cannot allow you to use this subreddit to harass other people on reddit. \n\n**Rule 8: No bigotry, no racism or race baiting.** It is hard to believe that we even need a rule like this. \n\n**Our rules are zero tolerance. You will be banned for breaking them.**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/iamatotalpieceofshit) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Ah yes, the old \"throw my phone on the ground so daddy buys m a new one\" trick",
            "score": 152,
            "author": "framer146",
            "replies": [
                {
                    "level": 1,
                    "comment": "But double that to a more expensive thing like a motorcycle",
                    "score": 2,
                    "author": "Slight-Document-7664",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I don’t know, man. Have you seen the prices on phones these days?",
                            "score": 1,
                            "author": "iownlotsofdoors",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "no I never buy phones till the one I'm using breaks",
                                    "score": 1,
                                    "author": "Slight-Document-7664"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "So what is happening in bolivia right now?\n\nThe federal government arrested the governor of Santa cruz and send him to the national super max prison in a gap of 12 hours to await trial for at least 4 months. Santa cruz is the state/region that most strongly opposes the ruling party and the population felt that the arrest (they ram his car, put a hood in his head, drove him to the airport and lifted him away in a chopper) was not done well.\nThe governments response to peaceful protests has been to go heavy on the protestors and have the police create damage so it looks like rioters are doing the damage and police are keeping things in check with their brutality.",
            "score": 239,
            "author": "OrpheusCamba",
            "replies": [
                {
                    "level": 1,
                    "comment": "Tried and tested",
                    "score": 49,
                    "author": "Mookius",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lets remember during BLM and the covid protests where law enforcement would leave trucks of bricks around and monitored to arrest citizens by pushing them and providing them the tools to be violent.",
                            "score": 48,
                            "author": "Zorbie",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Sounds like that big agency that starts with a C",
                                    "score": 19,
                                    "author": "SqammerFN"
                                },
                                {
                                    "level": 3,
                                    "comment": "In Boston that happened. In Seattle they torched 2 police SUVs with no help from anyone. Either way you shouldn't be doing those things.",
                                    "score": 2,
                                    "author": "applemanib"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "There's not \"federal\". Bolivia has a unitary government.",
                    "score": 1,
                    "author": "RakoonGamer2001"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Age-old technique…",
            "score": 33,
            "author": "badhanganesh",
            "replies": [
                {
                    "level": 1,
                    "comment": "Want a problem to go away escalate the problem",
                    "score": 9,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "record the police",
            "score": 26,
            "author": "247emerg"
        },
        {
            "level": 0,
            "comment": "All I see is city employees making sure their budget is increased next year.... wait that not LA",
            "score": 13,
            "author": "Suspicious_Ad7384"
        },
        {
            "level": 0,
            "comment": "Taking tips from America I see",
            "score": 9,
            "author": "BigDickDyl69",
            "replies": [
                {
                    "level": 1,
                    "comment": "\"Everything is America's fault\" 🤡🤡🤡",
                    "score": 1,
                    "author": "RakoonGamer2001",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m referencing the video of the police in Boston who were grabbing bricks from their truck. Also the picture of an unmarked van with a person in police uniform dropping off plastic totes of broken concrete.",
                            "score": 4,
                            "author": "BigDickDyl69"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Cops are so comfortable lying and not just as a interrogation tactic to trick a person into self snitching. The narcissistic ego on the people who become cops make it easy to play the victim and demand respect while expecting to be held as heros. Coupled with qualified immunity and the most powerful union supporting their actions it's no surprise they murder well over 1000 citizens in the US each year.",
            "score": 32,
            "author": "Valuable-Ad5039",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, though I'm optimistic because AI will soon do the job instead of shitty humans (not all ofcourse, some)",
                    "score": 3,
                    "author": "Twinkies100",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's even more terrifying in all reality. Void of human emotions completely....",
                            "score": 1,
                            "author": "Valuable-Ad5039"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "No quiero motorbikey, quiero nuevo papi.",
            "score": 2,
            "author": "10-10-2022"
        },
        {
            "level": 0,
            "comment": "I thought false flags were conspiracy theories lol",
            "score": 2,
            "author": "chickenandbroccoli7"
        },
        {
            "level": 0,
            "comment": "Trashy people exist everywhere, unfortunately....",
            "score": 2,
            "author": "xxxkarmaxxxx",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well yeah every country has a police force.",
                    "score": 18,
                    "author": "n3lswn"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Reminds me of when there were anti-police protests in Ferguson, Missouri. Cops were filmed busting store windows and then arresting protestors for \"destruction of property\".",
            "score": 3,
            "author": "SuperCrappyFuntime"
        },
        {
            "level": 0,
            "comment": "Well, that’s one way to get that new motorbike he’s been wanting.",
            "score": 1,
            "author": "FreudoBaggage"
        },
        {
            "level": 0,
            "comment": "That's some good police work, boys",
            "score": 1,
            "author": "No_Presentation_209"
        },
        {
            "level": 0,
            "comment": "Like the cops on January 6",
            "score": 1,
            "author": "PaulJames333",
            "replies": [
                {
                    "level": 1,
                    "comment": "There is video of January 6 showing the protestors killing cops.  If jan 6 had been like this then there would be video of it.",
                    "score": 2,
                    "author": "UberPancake88",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There's no video showing protesters killing cops. Five cops died \"days and weeks\" after January 6 according to NYTimes.\n\nThere is however video showing cops smashing a window and telling protesters not to go inside, which they did.",
                            "score": 2,
                            "author": "PaulJames333",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There is video of a cop being dragged out and then the protestors beating him.",
                                    "score": 2,
                                    "author": "UberPancake88"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This happened in India, but no one cared what thw truth was.\n\nThe people here want genocide because the media keeps calling for one.\n\nImagine all the major news channels demonising a specific religion day-in day-out.",
            "score": 1,
            "author": "Proud_Bookkeeper_248"
        },
        {
            "level": 0,
            "comment": "They have been learning from the GOP.",
            "score": -3,
            "author": "Euphoriffic"
        },
        {
            "level": 0,
            "comment": "Typical. This is the type of bullshit they did, aided by the US State Department ofc, to oust Evo Morales, the former socialist leader of Bolivia.",
            "score": -1,
            "author": "bored_and_scrolling",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;US State Department ofc\n\n\"muh socialism didn't work because of America and not because socialism is an inherently failed ideology\" 🤡🤡🤡🌎🌎🌎",
                    "score": 2,
                    "author": "RakoonGamer2001",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Are you actually about to deny that Evo Morales was couped out of office with the help of the Bolivian right wing oligarchy, the police whose corruption was ceased by Morales, and the US? Maybe do an ounce of research pal. In fact find ONE example of a 3rd world socialist government failing simply in a vacuum and not because they were under direct pressure from both internal right wing factions AND the US state breathing down their necks through coups, regime change operations, sanctions, etc",
                            "score": 1,
                            "author": "bored_and_scrolling",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;Maybe do an ounce of research pal\n\nI was born in Bolivia, and I know first-hand how the Morales regime has damaged the country, divided the people, messed with the education system, etc.\n\n&gt;Bolivian right wing oligarchy\n\nHahahahaha!! C'mon, Bolivia is an economically hostile country, the taxes are too high and local entrepreneurship is discouraged.\n\nAlso, Bolivia is an autocracy disguised as democracy.\n\n&gt;direct pressure from both internal right wing factions AND the US state breathing\n\nBut, but \"muh right-wing bad\" 🤡🤡🤡.\n\nEvo regime failed because he's a dictator, America has nothing to do with it. He and his ilk did election fraud multiple times with impunity.",
                                    "score": 2,
                                    "author": "RakoonGamer2001"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "He clearly supports their cause and doing this in solidarity. /s",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "This is why you don't peacefully protest you have a coup",
            "score": 1,
            "author": "Wild-Engineering7579"
        },
        {
            "level": 0,
            "comment": "Literally wildlands.",
            "score": 1,
            "author": "RockyfishGaming"
        },
        {
            "level": 0,
            "comment": "Send in the ghosts.",
            "score": 1,
            "author": "DEADxBYxDAWN"
        },
        {
            "level": 0,
            "comment": "Reminds me of the American cops in ‘20 that were caught on camera busting out windows and cutting tires to blame protestors for it.",
            "score": 1,
            "author": "PrincessPicklebricks"
        },
        {
            "level": 0,
            "comment": "The state of the country after Morales stepped down is rapidly declining.",
            "score": 1,
            "author": "owoLLENNowo",
            "replies": [
                {
                    "level": 1,
                    "comment": "the country was not doing great under morales either, buddy.  It did well because it exported gas and oil and the prices of that were super high during some of his presidency.",
                    "score": 1,
                    "author": "UberPancake88",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm not saying it was doing great. But it wasn't a total dumpster fire.",
                            "score": 1,
                            "author": "owoLLENNowo"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "South America not looking good this year, Peru, Brazil and now Bolivia",
            "score": 1,
            "author": "Happy_Ad_5111"
        },
        {
            "level": 0,
            "comment": "look to me a police who didn't want to partake so burning the government issued bike",
            "score": -10,
            "author": "dawhim1",
            "replies": [
                {
                    "level": 1,
                    "comment": "He was ordered to burn the bike. There are also videos of the police starting fires in parks and destroying windows. They are trying to create the narrative that the protestors are violent and that is why they need to be so heavy handed.",
                    "score": 2,
                    "author": "UberPancake88",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Agent provocateurs",
                            "score": 1,
                            "author": "PaulJames333"
                        }
                    ]
                }
            ]
        }
    ]
}