{
    "id": "101y1pk",
    "score": 1046,
    "title": "Charlie Kirk is blaming Damar Hamlin's emergency on the covid vaccine.",
    "author": "NCSUGrad2012",
    "date": 1672719994.0,
    "url": "https://www.reddit.com/r/iamatotalpieceofshit/comments/101y1pk",
    "media_urls": [
        "https://i.redd.it/tm4kq0co9r9a1.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\nPlease note that we will ban you if a post or comment breaks any of our rules. **Be especially mindful of the following**:\n\n**Rule 1: Do not post or ask for identifying information, including first and last names and social media usernames.** Public figures are **not** exempt. We remove all external links to prevent accidental posting of identifying information.\n\n**Rule 2: Do not post violent comments, and do not glorify violence, per TOS.** We can't take responsibility for how angry a post makes you, you need to do that. Telling us \"it was a joke bro\" is not an excuse.\n\n**Rule 7: Do not link to or post screenshots of reddit posts, reddit comments, reddit personal messages, reddit profiles, etc.** We cannot allow you to use this subreddit to harass other people on reddit. \n\n**Rule 8: No bigotry, no racism or race baiting.** It is hard to believe that we even need a rule like this. \n\n**Our rules are zero tolerance. You will be banned for breaking them.**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/iamatotalpieceofshit) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "must have been other tweets about it because I am too far ignorant to see how any of these words relates to covid or vaccines",
            "score": 291,
            "author": "myrichiehaynes",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s a mess on twitter rn. Damars injury and the death of Uche Nwaneri (a 38 year old former NFL player), died of heart failure \n\nTheir names are even used as hashtags talking about the vaccine",
                    "score": 80,
                    "author": "0zymand1as-"
                },
                {
                    "level": 1,
                    "comment": "That's his goal. On its own the tweet looks innocuous but based on his other tweets it's a dog whistle.",
                    "score": 34,
                    "author": "JReg99",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Bingo. It seems to be working, unfortunately.",
                            "score": -4,
                            "author": "privatepoodle"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "No one on Twitter has heard of the five finger death punch?? \n\nSlackers",
            "score": 11,
            "author": "kevlar_76",
            "replies": [
                {
                    "level": 1,
                    "comment": "Kill Bill reference aside, it seems that hit was the equivalent of taking a 8-pound sledge hammer to the chest.  That can stop a heart, or tear the aorta.",
                    "score": 1,
                    "author": "Go_Gators_4Ever",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why is his face so tiny",
            "score": 73,
            "author": "Gobby_Boy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Probably a side effect of the COVID vaccine",
                    "score": 59,
                    "author": "StarDatAssinum"
                },
                {
                    "level": 1,
                    "comment": "It's a Photoshop. In real life it's even smaller.",
                    "score": 5,
                    "author": "yaosio"
                },
                {
                    "level": 1,
                    "comment": "He's what the Hellbenders characters are based on.",
                    "score": 5,
                    "author": "Quaintly__Coyote_"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My brother stopped playing football in Hs because some kid died in practice like 10 years ago in Sacramento. Are you telling me that kid was secretly Vaccinated?",
            "score": 22,
            "author": "nematoad22",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I seem to remember a certain player dying on the field decades ago before the dreaded Covid Vaccine Of Dooooom!",
            "score": 46,
            "author": "Puzzleheaded-Bee-838",
            "replies": [
                {
                    "level": 1,
                    "comment": "In the NFL? Name one.",
                    "score": -61,
                    "author": "YourMomsUnderwear",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Charles Frederick Hughes (March 2, 1943 – October 24, 1971) was an American football player, a wide receiver in the National Football League from 1967 to 1971. He is, to date, the only NFL player to die on the field during a game.[1]\n\n\nYou're welcome",
                            "score": 74,
                            "author": "Puzzleheaded-Bee-838",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You proved me wrong, thanks.",
                                    "score": 48,
                                    "author": "YourMomsUnderwear",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Google makes people look smarter than they are. Like me.",
                                            "score": 19,
                                            "author": "SlipperyGypsy12",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Actually Charlie was talking about it because of this same post I think.",
                                                    "score": 1,
                                                    "author": "Puzzleheaded-Bee-838"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Not everything is a global conspiracy.",
                                            "score": 5,
                                            "author": "LycanHD",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I never said it was, I just didn’t ever recall a time something like has happened in the league. From a statically standpoint it’s incredibly rare.",
                                                    "score": 5,
                                                    "author": "YourMomsUnderwear",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "This has been happening in all sports, even in High Schools.",
                                                            "score": 1,
                                                            "author": "LycanHD"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Should start looking up the statistics of people dropping dead that have been attending church regularly. Probably praying to the wrong God and he's smiting them. \n\nI mean that's all the evidence we need right? 1 small correlation with little to no verifiable proof should suffice.\n\nBetter yet I bet they all have ingested some Dihydrogen monoxide in the last 24hrs better start investigating the producers and banning the ingestion and sale of it right away",
            "score": 15,
            "author": "Kronictopic"
        },
        {
            "level": 0,
            "comment": "Young athletes dying after a hit isn't new.",
            "score": 5,
            "author": "LycanHD"
        },
        {
            "level": 0,
            "comment": "Impact energies of at least 50 joules (37 foot-pounds force) are estimated to be required to cause cardiac arrest, when applied at the right time and spot of the precordium of an adult.",
            "score": 5,
            "author": "LycanHD"
        },
        {
            "level": 0,
            "comment": "In the \"newsbreak\" app I have, one of the articles was about how Jerimiah Green (drummer for modest mouse) died suddenly after being diagnosed with stage 4 cancer. They blamed it on the vaccine in the comments, of course. I was angry they used his death for \"political gain\" (in their eyes); can't imagine how the family feels. First they say, \"they are calling any death covid-related!!\", and now they are trying to say any death is causes by vaccines.",
            "score": 22,
            "author": "nuts4k9s"
        },
        {
            "level": 0,
            "comment": "Wasn't he just hit really hard in the chest? It sounded to me that his chest was pushed inwards enough to pinch the vagus nerve. Kinda like a dim mak.",
            "score": 47,
            "author": "onlypinhead2000",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nothing to do with the vagus nerve.",
                    "score": 8,
                    "author": "Robie_John"
                },
                {
                    "level": 1,
                    "comment": "But, he wasn't hit that hard. Even the announcers were shocked he went down, after such a \"routine hit\".",
                    "score": 41,
                    "author": "TaibhseSD",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If anything strikes the area above your heart with enough force at the exact time of a beat it will stop. It’s a real and unfortunate physiological feature/ issue that happens all the time. Baseball players have been hit in the chest and killed by a ball that wouldn’t otherwise leave more than a bruise if it hit somewhere else on you\n\nEdit: the hit doesn’t even have to be hard enough to break a rib or anything",
                            "score": 46,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They have padding in that area for protection",
                                    "score": 4,
                                    "author": "pauly-dang7",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You can still die in a car crash even if the airbags work.",
                                            "score": 6,
                                            "author": "reddertuzer"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "True, this can happen. That is just one of a myriad of things that could explain what happened. \n\nThe vaccine is also one of the things that COULD have caused this. I'm not saying it did, I'm just saying it could have. \n\nThe truth is, we don't know what happened. Hell, we might not ever know what happened. It could have been the hit; the vaccine; an underlying health condition; the fact that he once smoked a cigarette as a kid. Who knows?\n\nIt's never a bad thing to question things, to ask \"what happened?\" It's also not a bad thing to question what others have to say in response to those questions.",
                                    "score": -30,
                                    "author": "TaibhseSD",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "But it also could be a small meteor from space that hit him in the chest that no one saw too… I’m not saying it did, but it COULD have…",
                                            "score": 4,
                                            "author": "damnumalone"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "A ton of sports medicine doctors are all saying it’s very likely commotio cordis. He was hit in the perfect spot in the chest very hard right before standing up and collapsing. It would be a super weird coincidence that he just got hit in the chest before collapsing for any other reason other than commotio cordis.",
                                            "score": 27,
                                            "author": "Huggens",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "There are also several medical experts who say that the vaccine could possibly cause cardiac episodes. \n\nI guess it comes down to which source you choose to blindly listen to.",
                                                    "score": -32,
                                                    "author": "TaibhseSD",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "there are no reputable medical experts saying the vaccine caused this.",
                                                            "score": 18,
                                                            "author": "retroracer33",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "So, you're saying that certain State's Surgeon General's aren't \"reputable\"? \n\nThat's rather bold of you, don't you think?",
                                                                    "score": -16,
                                                                    "author": "TaibhseSD",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "yes, Joseph Ladapo is a fucking clown.",
                                                                            "score": 9,
                                                                            "author": "retroracer33",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Yet, he IS the Surgeon General of one of our states, is he not? Care to share YOUR educational background that disputes what he has to say?",
                                                                                    "score": 3,
                                                                                    "author": "TaibhseSD",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Not to mention, the term \"very likely\" is not definitive. It leaves open the fact that something else, however great or small, could be the cause.",
                                                    "score": -2,
                                                    "author": "TaibhseSD",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yeah, it could be little gremlins that live inside his body. It could be a magical curse that a witch cast on him. It could even be a glitch in the matrix. \n\nBy the way, when you start speculating on a subject you know nothing about and create disinformation that could potentially be harmful, that *is* bad. \n\nHow about we listen to all the medical professionals who all have come to the same consensus rather than say “oh there’s a a minuscule possibility it could be ‘something else’ so I’m going to go with that and also speculate what that ‘something else’ could be on top of it!” \n\nLiterally not a single medical doctor out there has listed a vaccine reaction as a possibility. They all agree it has to do with the direct helmet impact to his chest right before his heart stopped beating. Just stop it.",
                                                            "score": 11,
                                                            "author": "Huggens",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "\"Literally not a single medical doctor out there has listed a vaccine reaction as a possibility\"...\n\nCare to wager your child, your spouse, or your own life on that? \n\nI bet you a million dollars, I'd win that bet.",
                                                                    "score": -1,
                                                                    "author": "TaibhseSD",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Please find me the medical doctor who has stated a vaccine reaction is the cause. \n\nI already linked at least 10 medical doctors in another response who have said it is commotio cordis and there’s tons more out there who all say the same thing. I could link you tons of articles, videos, interviews, and other opinions from medical doctors who all say this. \n\nI’d like to see you find me one medical doctor who is saying the cause is a vaccine reaction.\n\nAlso, your wager doesn’t make sense. You want me to wager a family member or my life… and then you want to wager a million dollars on the wager itself?",
                                                                            "score": 12,
                                                                            "author": "Huggens"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "“Very likely” means something completely different to medical professionals than it does to armchair MD’s. “Very likely” means we’re as reasonably sure as medical science allows us to be. There’s a time and place to play devils advocate but it’s not here or now",
                                                            "score": 2,
                                                            "author": "WorseThanItSeems",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "It hasn't even been a day since it happened. How could you or anyone else possibly have any clue what happened? What can you even question when the only info out there is that he suffered a cardiac arrest, and is in critical condition?\n\nDon't be fooled into thinking people like Charlie Kirk have any idea what's happening. They're using this incident to push their narrative of COVID vaccines being bad for you.",
                                            "score": 8,
                                            "author": "StarDatAssinum"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "So could magic fairies. Until such time as you have evidence we don’t care. Stop couching your pushing non Backed up garbage in “im just asking questions”",
                                            "score": 2,
                                            "author": "fitnessnerdomniman",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Go watch some rugby videos... they hit far harder with no pads and I've never heard of this.",
                                    "score": -25,
                                    "author": "SlipperyGypsy12",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "it's just a freak accident. jesus how do you people live day to day thinking every fucking thing is part of some vast conspiracy.",
                                            "score": 12,
                                            "author": "retroracer33",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Just a big ol coincidence!",
                                                    "score": 1,
                                                    "author": "areed018"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Haha you haven’t played that much rugby if you’ve never heard of this mate",
                                            "score": 3,
                                            "author": "damnumalone"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yep, also Dale Earnhardt crashed and didn't look that bad.",
                            "score": 3,
                            "author": "Pockets262"
                        },
                        {
                            "level": 2,
                            "comment": "must have been the vaccine then!",
                            "score": 4,
                            "author": "martymoran",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I never said that. Speaking in \"absolutes\", sans evidence supporting it, is never a good thing. My whole argument all along has been that the vaccine MIGHT have been a contributing factor.",
                                    "score": 3,
                                    "author": "TaibhseSD",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That’s a dumb argument. What’s your evidence that it could possibly have anything to do with a vaccine?\n\nMy whole argument all along has been that cheddar cheese might have been a contributing factor.",
                                            "score": 2,
                                            "author": "ShesMyPublicist",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "A \"routine\" hit to the chest?",
                            "score": -10,
                            "author": "onlypinhead2000",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "A “routine” hit in football. If healthy players dropped to the ground with heart attacks every other game we wouldn’t play it.",
                                    "score": 13,
                                    "author": "Chowda_Report",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It doesn’t genuinely happen in football because of padding. If you watch the video, he got a ~~shoulder~~ helmet (even worse) directly in the perfect spot in the chest which also has to be at the exact millisecond for commotio cordis to occur. It’s not likely, but it can happen. It’s more common in other sports without padding e.g. baseball.",
                                            "score": 11,
                                            "author": "Huggens",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "This right here is the answer it is a very real thing it’s just rare as it needs to be very precise to occur.",
                                                    "score": 5,
                                                    "author": "Wereking2"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yes, anyone who was watching the game saw the replay multiple times, Damar was attempting to tackle the ball carrier, took a shoulder directly to the chest, he stood up, took two steps and fell straight back, the impact from the hit somehow disrupted his heart rhythm to the point of where it stopped beating…this incident has nothing to do with covid or the vaccine side effects",
                    "score": 6,
                    "author": "FireSlayer30"
                },
                {
                    "level": 1,
                    "comment": "Nah man, you don’t get it. The COVID vax weakened his innards and caused him to almost die. Had he been a pure blood he would’ve been ok.  /s",
                    "score": 5,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don’t see him saying that in this tweet at all",
            "score": 27,
            "author": "pauly-dang7",
            "replies": [
                {
                    "level": 1,
                    "comment": "Bruh, wut? \n\nThat’s literally the only inference that can be made here.",
                    "score": 6,
                    "author": "803guapboi",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "It's heavily implied based on other noise around twitter",
                    "score": 5,
                    "author": "s00perball",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sounds like a conspiracy",
                            "score": 1,
                            "author": "areed018"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Well you never know unless you do the science your own self!\n\nRemember someone pays for clinical trials and A LOT of the time it's the manufactures or another entity with interests in getting a particular \"answer\" from studies.",
            "score": 14,
            "author": "No-Information-89",
            "replies": [
                {
                    "level": 1,
                    "comment": "True, but unfortunately elite athletes have been dying from heart issues long before any  Covid vaccine. It happened semi regularly growing up.",
                    "score": 12,
                    "author": "ped009"
                }
            ]
        },
        {
            "level": 0,
            "comment": "But what if it was.",
            "score": 2,
            "author": "Routine_Current3412"
        },
        {
            "level": 0,
            "comment": "Sry, I don’t know this guy and without any context it has nothing to do with vaccines",
            "score": 10,
            "author": "Numerous-Departure92",
            "replies": [
                {
                    "level": 1,
                    "comment": "CK's posting history contains multiple times he has attempted to corelate miscellaneous reports of people of various ages dying at some point after being vaxxed;  this is just his latest '*wink wink'* reference for his followers...",
                    "score": 2,
                    "author": "nellie_1017"
                }
            ]
        },
        {
            "level": 0,
            "comment": "i’m all for conspiracy but i think it’s obvious that this isn’t the case here",
            "score": 4,
            "author": "LynchABitch"
        },
        {
            "level": 0,
            "comment": "he got hit hard enough to make him go into cardiac arrest. people like Kirk don’t look at the full situation, and just use tragedy to push their narrative.",
            "score": 9,
            "author": "UniqueNobo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Commotio Cardis, someone said it was in another thread.",
                    "score": 14,
                    "author": "SomePenguin85"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This guy’s IQ is what’s dropping suddenly.",
            "score": 4,
            "author": "Hipcheck16"
        },
        {
            "level": 0,
            "comment": "This guy’s dumber than a sack of hammers!!",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Eventually the vaccine should be questioned, there used to be a decent discourse about any subject; what changed?",
            "score": 0,
            "author": "mattwayne1209",
            "replies": [
                {
                    "level": 1,
                    "comment": "The problem is its all being questioned with wild conspiracy theories  that are politically biased instead of actual experiments and data",
                    "score": 10,
                    "author": "dakipsta",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Can't say that's correct either when politicians control the experiments and data. Civil discourse is warranted and as neighbors we need to get back into our own assumptions, nothing else can be trusted and that much is obvious.\n\n Free speech is the first amendment for exactly this purpose",
                            "score": 6,
                            "author": "mattwayne1209",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There you go, \"politicians control the data\"\nThankyou ×10 for demonstrating my point for me.",
                                    "score": 7,
                                    "author": "dakipsta"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "They came out of the woodwork last night. Every death nowadays is related to the jab with these people.",
            "score": -2,
            "author": "Rocky_Coast"
        },
        {
            "level": 0,
            "comment": "For all the talk about young athletes, as well as other otherwise healthy young people, suddenly dying, the only correlation is the vaccine. It's not an unfair assumption to think the vaccine, that has already been proven to have caused a lot of harm, to be responsible for these deaths. I'm not saying it IS the reason, but that it COULD be. There's just too much here to be mere coincidence.",
            "score": -17,
            "author": "TaibhseSD",
            "replies": [
                {
                    "level": 1,
                    "comment": "Everyone who says this never take in account that young people died unexpectedly before this.    \n\n\nI had one teammate/friend die in high school from cardiac arrest playing football and another who came close due to what ended up being asthma in middle school playing basketball.     Keep in mind this was the late 80s and early 90s.\n\nMy other problem is that people who are willing to freely contribute death to the vaccine tend to be the same ones who dismissed deaths related to Covid.",
                    "score": 18,
                    "author": "GadgetGod1906",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Even so, there seems to be an uptick in young people having cardiac episodes. Simple research will show you that more and more atheltes, as well as other young, otherwise healthy individuals, are experiencing cardiac episodes. When these spikes happen around the same time as this state mandated vaccine, we would be foolish not to see the pattern, or to even question whether or not this vaccine is the root cause.",
                            "score": -7,
                            "author": "TaibhseSD",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Gove actual stats and do you know if all of these young people were vaccinated.  \n\nDo you have trending data that shows there has been an uptick?   Are there pre existing conditions for these peple(that was the go to with Covid)\n\nMy understanding that everyone in the NFL was required to get vaccinated.   Why have not more died if the vaccine is the issue?  What about players in other sports who had mandated vax requirements.    \n\nThe first time I saw someone die in a sport was Hank Gathers while playing basketball.   That was in 90 0r 91.\n\nWhat I have learned is everyone wants to be a scientist or a doctor on the internet for political purposes without bothering to get the education.",
                                    "score": 19,
                                    "author": "GadgetGod1906"
                                },
                                {
                                    "level": 3,
                                    "comment": "You know what they can confirm is causing cardiac issues, having had COVID. I know 2 people who got COVID before the vaccines were available who were previously healthy and now have cardiac issues, they are suffering from long COVID, 1 of them had to have a pacemaker put in because of it.",
                                    "score": 12,
                                    "author": "Use_this_1",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "My personal experience: I had COVID beginning of 2021. No vaccine yet. 2 months later I was still experiencing symptoms, especially cardiac things. I was 35. No previous illness. I had several exams done on me, which proved I had tachycardia and arritmia caused by COVID. I was vaccinated in August of 2021. Still having the episodes. Second time having COVID in January 2022. Still having the cardiac problem. Double boosted by now and pregnant because COVID also messed with my hormonal system and rendered my birth control almost useless (working at 15% according to my Dr). I'm being monitored all the time because of the cardiac things being overexerted by the effort of pregnancy. Long COVID was my diagnosis: smell and taste only came back a few months ago and not fully. Today I felt cinnamon flavour for the first time in two years.",
                                            "score": 8,
                                            "author": "SomePenguin85"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "That's confirmation bias. You are *noticing* more sudden deaths/collapses, that doesn't mean that there are actually more. Unless your 'simple research' involves actual statistics to compare the number of such episodes pre and post Covid vaccine?",
                                    "score": 4,
                                    "author": "Estrellathestarfish",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "There have already been studies to prove this. You just have to look. I can sit here and give all kinds of sources backing what I'm saying. But, I guarantee no one is going to trust some random guy on the internet. Nor should they. \n\nDo the research yourself. And, after having gone through all of the evidence, make up your own mind. \n\nOr, simply go with \"it could NEVER be the vaccine! The news told us it was safe!\"\n\nEither way, it's your call.",
                                            "score": 2,
                                            "author": "TaibhseSD",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "If your sources are reliable and peer reviewed it doesn't matter that you are a random on the internet. If they aren't reliable then it's understandable that you don't want to share your sources and instead expect others to do your research to back up your claims.",
                                                    "score": 5,
                                                    "author": "Estrellathestarfish"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 17,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Anti science guys like the person you are responding to isn’t interested in dialogue. These people never argue in good faith",
                            "score": 3,
                            "author": "AtomicBlastCandy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Whoever said I was \"anti-science\"? I'm simply keeping an open mind. The vaccine COULD be the determining factor here. I'm not saying it necessarily IS, but that it COULD be. \n\nIt very well could be something else.\n\nEdit: Unless you were responding to someone else. My apologies, if so. It's kind of difficult to tell, sometimes.",
                                    "score": -2,
                                    "author": "TaibhseSD",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You’re the classic “just asking questions” poster. You’re not acting in good faith and it’s obvious where your opinions lie so just stop pretending dude.",
                                            "score": 6,
                                            "author": "Hockeythree_0"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": -1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 4,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Not off the top of my head, no. But, why would you trust some random stranger anyway? \n\nFeel free to research it on your own. \n\nAnd I didn't say it definitely WAS the vaccine. I simply said it COULD be one of the factors.",
                                            "score": 2,
                                            "author": "TaibhseSD",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "No source?",
                                                    "score": 5,
                                                    "author": "Mattermaker7005and8"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "\"There is proof I ust wont give it to you\"\n\n&amp;#x200B;\n\ngod what a clown.",
                                                    "score": 5,
                                                    "author": "retroracer33",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "So, you've done your own research then? \n\nTell me, where did your research land?",
                                                            "score": 1,
                                                            "author": "TaibhseSD"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "YOU made the ridiculous claim, the burden of proof is on YOU to back up what you say with sources. \n\nWhy should anyone care about your questions or take you seriously if you're just throwing random, unverified information out there? You COULD be full of it.",
                                                    "score": 2,
                                                    "author": "StarDatAssinum"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yare yare daze*",
                            "score": 1,
                            "author": "Mattermaker7005and8"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I’m JuSt AsKiNg QuEsTiOnS",
                    "score": 10,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And what's wrong with asking questions? What's wrong with attempting to find the truth? \n\nUnless you just want to blindly believe everything you read online, or hear on the news. I choose to think for myself. How about you?",
                            "score": 8,
                            "author": "TaibhseSD",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 5,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm not reading a medical journal. You're right. Those things are scary complicated!! \n\nI AM, however, listening to the myriad of medical professionals who CAN interpret these journals. Many of whom have stated just what I've said: The vaccine can cause cardiac episodes in otherwise healthy individuals. \n\nOf course, you're not going to hear their voices on CNN, Fox News, MSN, etc. \n\nFeel free to do the research on your own, rather than trust a random stranger on the internet. \n\nOr don't. \n\nYour call.",
                                            "score": 4,
                                            "author": "TaibhseSD",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Literally not a single person alive on planet earth has presented that theory with any sort of valid evidence linking the heart attack to the vaccine. People get heart attacks. Healthy people get heart attacks. You seem genuinely stupid and incapable of processing logical thought if you think that links anything to the vaccines.\n\nIts amazing how the illogical, ignorant, uninformed, and always incorrect conspiracy theorist morons always claim to \"do their own research\" with a smug arrogance. All while completely oblivious to the fact that they're embarrassing themselves with each attempt to validate their nonsense. You intentionally turn a blind eye to reputable sources and instead follow the dumbest most unsubstantiated nonsense you can find that fits your narrative. Just another misinformation spreader.",
                                                    "score": 2,
                                                    "author": "Gibiati",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "The vast majority of whom, think your fringe minority of “health professionals” are wrong. \n\nYou are choosing to believe a minority. That is your choice.",
                                                    "score": 1,
                                                    "author": "lolemgninnabpots",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Well, hundreds of years ago, the \"vast majority\" of scientists felt that technology could no longer be improved upon. \n\nJust because the \"vast majorty\" believes something, doesn't make it right.",
                                                            "score": 3,
                                                            "author": "TaibhseSD",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "\"The only correlation is the vaccine\" The fact that you're even capable of typing that idiotic nonsense with any sort of confidence just sums up how laughably flawed and incomplete your scientific process is. Its people like you capable of believing any connection drawn between two unrelated facts that make it so easy for the people who profit off conspiracies to keep making them up.\n\nThat is one of the most embarrassingly idiotic logical leaps I've ever seen. Athletes drive their heart to extremes constantly. Healthy athletes having heart attack is not new at all and hasn't occurred more frequently since Covid at all. It simply happened on TV one time so now all the overdramatics ensue. When you push your heart 10x beyond what a normal human ever will in their lifetime, and do it daily for years, you're taking risks that normal people don't take.",
                                                                    "score": 2,
                                                                    "author": "Gibiati",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It also COULD be microscopic aliens got into his blood stream and stopped his heart. Just asking questions!",
                    "score": 3,
                    "author": "HoldUntilImOld",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Of those 2, aliens or the vaccine, which do you suppose is more likely?\n\nThere has never been a single incident that can be attributed to \"microscopic aliens\". However, there HAS been several instances that have been attributed to the virus.",
                            "score": 1,
                            "author": "TaibhseSD",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Likeliness means nothing, I provided just as much evidence as you did. \nBaseless speculation to any degree is harmful for everyone involved. If you think it was the vaccine then bring some evidence, until then, might as well stick with the tiny alien theory",
                                    "score": 3,
                                    "author": "HoldUntilImOld"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;the vaccine\n\nWhich vaccine. What's your source.",
                    "score": 1,
                    "author": "RolandTwitter"
                },
                {
                    "level": 1,
                    "comment": "Can we immortalize this? It really is one of the dumbest posts I've ever read on reddit, and it checks nearly every single right wing whackjob conspiracy theorist box. Copy and paste this folks. It deserves more spotlight.",
                    "score": 1,
                    "author": "Gibiati",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I consider myself fairly athletic. I have had 2 boosters of the ”Fauci ouchie”. I have yet to fall dead of heart failure…",
            "score": -3,
            "author": "drj4130"
        },
        {
            "level": 0,
            "comment": "Because we witnessed all teams drop like flies during the World Cup.",
            "score": 0,
            "author": "DANleDINOSAUR"
        },
        {
            "level": 0,
            "comment": "He’s doing that cowardly “get close to just saying it would actually saying it so I can squirm out if I need to” thing. Right up there with Just Asking Questions and the beloved People Are Saying.\n\nRemember folks, hyper-conservatism is a business model and many of you are bankrolling it.",
            "score": -9,
            "author": "slappyandhappy"
        },
        {
            "level": 0,
            "comment": "op we’re gonna need context brother bc this isn’t it",
            "score": 1,
            "author": "ashley_mando_",
            "replies": [
                {
                    "level": 1,
                    "comment": "\"Died suddenly\" is the dog whistle term they've established to say it's from the vaccine",
                    "score": 8,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yeah it’s obviously climate change causing all these young and healthy people dying…",
            "score": 1,
            "author": "Just_another_bot76"
        },
        {
            "level": 0,
            "comment": "The man is dog sh\\*t.",
            "score": -12,
            "author": "rabbitkrolik"
        },
        {
            "level": 0,
            "comment": "Just because you thought \"covid vaccine\" when you read it doesn't mean he wrote it.  He is correct.  Regardless of what the cause is, isn't it concerning?",
            "score": 1,
            "author": "william-t-power"
        },
        {
            "level": 0,
            "comment": "Does not say that here. And if said, no evidence provided to disprove the statement.",
            "score": 0,
            "author": "Lupo1369"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -22,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s a FACT - 100% of vaccinated people will die",
                    "score": 9,
                    "author": "Aggressive_Oven_896",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Fact. Those who didn’t get the jab will not be included in the new earth of 2023. We all got handouts.",
                            "score": 2,
                            "author": "ChimoCharlie"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Your anecdotal evidence based on one person's reaction absolutely changed my mind on vaccines /s",
                    "score": 0,
                    "author": "StarDatAssinum",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I just saw a comment using only anecdotal evidence for the vaccine with 15 upvotes. Oh yeah I forgot anecdotes are only valid when they're on the Redditors' side.",
                            "score": -2,
                            "author": "Default520"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": -13,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My friend knows a friend who knows a friend who also knows a friend who died from the vaccine.",
                            "score": 2,
                            "author": "Hot_Mathematician357"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "He's on about the congenital heart problems in Athletes recently, he doesnt even mention the vaccine.",
            "score": -10,
            "author": "MyAssIsNotYourToy"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": -16,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m definitely not a bot and the person on Twitter is unfortunately a real person.",
                    "score": 6,
                    "author": "NCSUGrad2012"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s entirely plausible.",
            "score": -7,
            "author": "Successful-Split-886"
        },
        {
            "level": 0,
            "comment": "I don’t even know if he took any of the vaccines but I’m not going to go straight to that for the cause",
            "score": -5,
            "author": "BellamyRFC54"
        },
        {
            "level": 0,
            "comment": "Stop making stupid people famous.",
            "score": -7,
            "author": "edogfu"
        },
        {
            "level": 0,
            "comment": "I’m proud to say I have no clue who this person is.",
            "score": 1,
            "author": "oifvetxcheese"
        },
        {
            "level": 0,
            "comment": "I guess I am blind",
            "score": 1,
            "author": "AerieThink5695"
        },
        {
            "level": 0,
            "comment": "He does have a lot of perspective being an athlete and all",
            "score": 1,
            "author": "DoodMonkey"
        },
        {
            "level": 0,
            "comment": "Charlie Kirk is a Cuk🤡",
            "score": 1,
            "author": "Ok-Hovercraft6372"
        },
        {
            "level": 0,
            "comment": "Where does it mention vaccine?",
            "score": 1,
            "author": "skyler8703"
        },
        {
            "level": 0,
            "comment": "Of course he is...zero class..trailer park to the end",
            "score": 1,
            "author": "fyrekiller"
        }
    ]
}