{
    "id": "10aip53",
    "score": 35623,
    "title": "The same man is behind multiple road rage incidents in California",
    "author": "PlenitudeOpulence",
    "date": 1673577241.0,
    "url": "https://www.reddit.com/r/iamatotalpieceofshit/comments/10aip53",
    "media_urls": [
        "https://v.redd.it/ccml8ihbkrba1"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\nPlease note that we will ban you if a post or comment breaks any of our rules. **Be especially mindful of the following**:\n\n**Rule 1: Do not post or ask for identifying information, including first and last names and social media usernames.** Public figures are **not** exempt. We remove all external links to prevent accidental posting of identifying information.\n\n**Rule 2: Do not post violent comments, and do not glorify violence, per TOS.** We can't take responsibility for how angry a post makes you, you need to do that. Telling us \"it was a joke bro\" is not an excuse.\n\n**Rule 7: Do not link to or post screenshots of reddit posts, reddit comments, reddit personal messages, reddit profiles, etc.** We cannot allow you to use this subreddit to harass other people on reddit. \n\n**Rule 8: No bigotry, no racism or race baiting.** It is hard to believe that we even need a rule like this. \n\n**Our rules are zero tolerance. You will be banned for breaking them.**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/iamatotalpieceofshit) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "The last guy gets it. Dude gets out with a pipe, and I’m rolling out and over.",
            "score": 5234,
            "author": "Serviceprovider27",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think I would have tried to take his door off, tbh.",
                    "score": 2501,
                    "author": "arycka927",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I wonder if insurance would find me at fault if I did.",
                            "score": 227,
                            "author": "ThrowingChicken",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think that man who got out of his car with a pipe would be found at fault.  I'd love to see an insurance company try and argue otherwise.",
                                    "score": 485,
                                    "author": "Just_Lirkin",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Especially if you have video.\n\nDamn, I need a dashcam.",
                                            "score": 293,
                                            "author": "greenroom628",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 141,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "If you can't afford a dash cam you can't afford not to have a dash cam",
                                                            "score": 122,
                                                            "author": "trustnoone764523",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Such deep insight.... this man dashes",
                                                                    "score": 48,
                                                                    "author": "Aaangel1",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I just got a late model 1080 cam at walmart for 24 dollars.  It's a pretty decent Yada.",
                                                            "score": 29,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "100% worth it. $235 on Amazon will get you a Viofo A129 pro and a 256gb micro sd card.\n\nGot me out of a lot of issues recently when a punk kid decided ramming my vehicle in road rage was the correct response to supposedly cutting him off. Note, I didn't. Dashcams proved that too.",
                                                    "score": 46,
                                                    "author": "Ropya",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yeah, for lots of people $235 is a lot of money, but ABSOLUTELY worth it. Consider that cost against a $500 deductible and it already pays for itself. I have the Viofo A129 on my car and got one for my parents since they’re getting older.",
                                                            "score": 29,
                                                            "author": "hand_me_your_bitcoin",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Buy a dashcam right now. Even a cheap one is better than nothing.",
                                                    "score": 36,
                                                    "author": "ncsubowen",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "\"oops I was fearing for my life\"",
                            "score": 942,
                            "author": "tntblowsinurface",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That’s not even sarcastic. If a masked man hopes out and starts breaking my windows you truly are at fear for your life.",
                                    "score": 1016,
                                    "author": "satansheat",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "In addition, it’s much more responsible to bend his door hinge all the way back than to even make contact with his person.. better safe than sorry, I’m taking that door all the way off",
                                            "score": 399,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I'm not gonna lie, it would be pretty gratifying to destroy this dumb bully's property in making an escape.  You just know he's the type of guy to treat his little car as a penis substitute too, so I'm sure he'd take it VERY personally.",
                                                    "score": 406,
                                                    "author": "bangojuice",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Note the illegally dark tint and the illegal polarized license plate cover. \n\nDude is a massive douche.",
                                                            "score": 315,
                                                            "author": "matjam",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "thats what caught my eye. like bumper to bumper and it cant be read",
                                                                    "score": 100,
                                                                    "author": "EasyPanicButton",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "The fact the whole car is murdered out makes it easily identifiable all by itself. Dude took it too far.",
                                                                            "score": 44,
                                                                            "author": "leeharrison1984",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Plus he didn't change his shirt once lmfao",
                                                                                    "score": 25,
                                                                                    "author": "DR_DONTRESPECT",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "If you don't disable the person or the vehicle, he's probably going to chase you after you damage his car. Safest option is still to just drive over him.",
                                                            "score": 254,
                                                            "author": "psuedophilosopher",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Fine. Ill hit him, back up over him, and then hit his door",
                                                                    "score": 180,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Don't forget the other 3 doors !!",
                                                                            "score": 37,
                                                                            "author": "ycnctloswyhiyp",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Driving over him another 6 times seems excessive.",
                                                                                    "score": 27,
                                                                                    "author": "Old_Love4244",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Makes it easier for the cops to find him too. \n\n“Yes officer I feared for my life and his driver’s side door is all fucked up now.”",
                                                    "score": 29,
                                                    "author": "Megmca",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Or. Just run his ass over. Cops can easily find him that way too \n\n\"Yes, officer. I feared for my life. Just look for the giant meat crayon on the interstate.\"",
                                                            "score": 9,
                                                            "author": "Opening_Success",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I also feel like that would make it substantially easier to identify/find this driver as it'd be \"the black car with the masked driver holding a pipe and the door falling off.\"",
                                                    "score": 22,
                                                    "author": "TNTorch"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "This actually happened to a friend and I years ago and we did drive straight through the door and bent it off. The psycho got back in his car and chased us like a maniac until the cops showed up. The cops were so pissed that they even had to come out they told everyone to go home and did nothing. This was probably 2006 in NJ",
                                                    "score": 15,
                                                    "author": "martyworm"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "The damage might help the cops find the guy, too.",
                                                    "score": 9,
                                                    "author": "QuirksNFeatures"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I’d have not felt safe if I avoided the threat. I would’ve plowed through the threat.",
                                                    "score": 26,
                                                    "author": "MunchaesenByTiktok",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Legitimately yes.\n\nIf he breaks the window, I have no confidence he will stop swinging that pipe at the contents of the car aka me.",
                                    "score": 82,
                                    "author": "takatori"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 16,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Highjacking the top comment for a tip: If you're in a situation like this or a hit and run, and have a dashcam with audio, just start reading the license plate out loud and then go back through the recording.",
                    "score": 205,
                    "author": "Bioslack",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Doesn't help in this situation, he doesn't have a back license plate",
                            "score": 105,
                            "author": "howmanychickens",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Another commenter suggested that there was a filter over the plates, so possibly you would be able to read the plates, but cameras can’t see through the filter. No idea - I’m just parroting…",
                                    "score": 130,
                                    "author": "skipperseven",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "She was like, “Nope.”",
                    "score": 36,
                    "author": "LazyLamont92"
                },
                {
                    "level": 1,
                    "comment": "We have a piper down, I repeat, a piper is down!",
                    "score": 80,
                    "author": "RoyceRedd",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Harriet. Sweet Harriet.",
                            "score": 33,
                            "author": "Some-Resist-5813",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hard-hearted harbinger of haggis.",
                                    "score": 28,
                                    "author": "MurkNurk",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 20,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The least this guy could do is wear a fake moustache or glasses for each one. Did he really pick out his green road rage shirt each morning!?",
                    "score": 62,
                    "author": "BeesonTheBeeson",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lol, I was thinking the same thing. Looked like the same outfit in every video… Maybe he was so mad bc earlier that morning his *washer &amp; dryer* broke down…?? ;)",
                            "score": 25,
                            "author": "Blah-squared",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Like 20 years ago I worked with some kid and we were out for lunch, Someone pulled something very similar. Got out of the car with a baseball bat. Kid starts pulling over to the side of the road. I remember screaming go! Some people's brains just shut off.",
                    "score": 12,
                    "author": "Tired4dounuts"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Someone is going to give him what he's looking for!",
            "score": 2778,
            "author": "AdventurousOne965",
            "replies": [
                {
                    "level": 1,
                    "comment": "Some better gear and a new melee weapon?",
                    "score": 576,
                    "author": "Tips_Fedora_4_MiLady",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Just needs a better loadout before dropping in",
                            "score": 140,
                            "author": "EducatedJooner",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Where's the good guy with a pipe",
                    "score": 190,
                    "author": "Oaknot",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He’s fixing my bathroom right now but he said he’ll be looking for this douche when he’s done.",
                            "score": 101,
                            "author": "Ashuit",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Does he only have one set of clothes?",
            "score": 3110,
            "author": "chammdawg78",
            "replies": [
                {
                    "level": 1,
                    "comment": "He's like a cartoon character irl",
                    "score": 939,
                    "author": "mr_jenkins_says",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "GTA background character",
                            "score": 60,
                            "author": "ScarletteDemonia",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "He’s got the doug funny closet",
                            "score": 134,
                            "author": "Arson-Welles",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "This comment has me crying lmao",
                            "score": 23,
                            "author": "kittywithkitty"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Wearing the same underwear for a year will make anyone grumpy",
                    "score": 382,
                    "author": "urnewstepdaddy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m not grumpy. I’m just self aware.",
                            "score": 18,
                            "author": "Luci_Noir",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That is his super villain outfit",
                    "score": 107,
                    "author": "Kaligula785",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Some military dudes are like this, he even has the haircut. When they get off duty, they just take the top and pants off and put on jeans and civilian shoes. Between the particular ugly shade of plain green shirt and the haircut, my bet is military.",
                    "score": 230,
                    "author": "Crom_Committee",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wouldn't he be driving a high interest Camaro/Dodge or Mustang tho?",
                            "score": 125,
                            "author": "Djackso",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "tesla same thing lol",
                                    "score": 96,
                                    "author": "Losangelesdave",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Pretty much any car at 19% interest.",
                                            "score": 25,
                                            "author": "Zandt88",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "He’s literally out there playing gta irl",
                    "score": 115,
                    "author": "EyeDueDruggs",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think he's just a GTA side mission. Everyone he's attacked so far are NPCs, he just needs to attack the main character before a real road battle can start.",
                            "score": 12,
                            "author": "nodnodwinkwink",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Probably some militia member who owns 5 pairs of identical clothing.",
                    "score": 57,
                    "author": "PurpleSailor",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Honestly, all of this screams cop to me",
                            "score": 23,
                            "author": "SilentQuality"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's only a matter of time until he brings a pipe to a gun fight, then shits going to get real.",
            "score": 4102,
            "author": "BofffaDs",
            "replies": [
                {
                    "level": 1,
                    "comment": "Or a pipe to a car fight. Anyone who flees and accidentally runs him over would be cleared since he is attacking them with a deadly weapon.",
                    "score": 1118,
                    "author": "satansheat",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If that would happen you would still have stressful time when they will be determining if you could simply flee and instead you run him over.",
                            "score": 270,
                            "author": "CSI_Tech_Dept",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "California does not have a \"duty to retreat\" stipulation in their self defense laws.",
                                    "score": 215,
                                    "author": "worsedoughnut",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "its funny you have to google these things while being assaulted with a deadly weapon just to be sure you don’t end up in jail",
                                            "score": 182,
                                            "author": "jerkularcirc",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Right? In the moment, I'm just gonna do whatever my lizard brain decides keeps me alive.",
                                                    "score": 144,
                                                    "author": "worsedoughnut",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "\n&gt;Right? In the moment, I'm just gonna do whatever my lizard brain decides keeps me alive.\n\nWhether you want to or not.  That's exactly what the lizard brain is for.  To keep you safe durring a stressful, possibly deadly, encounter.  If your normal rational brain wrere in charge then you might just lock up over too many choices.",
                                                            "score": 101,
                                                            "author": "pauly13771377",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "The double r’s you put in during has me rolling them when I say it. I’ll probably say it like this for the rest of my life.",
                                                                    "score": 21,
                                                                    "author": "ahabthecrusader",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Y’all forget about juries? No jury is gonna send you to jail if you bail out and this guy gets hurt. Just don’t reverse over him.",
                                                    "score": 22,
                                                    "author": "ls1234567",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Honestly this clip is enough evidence. He has a repeated pattern of behavior and that will make it easy to get you off the hook",
                                    "score": 21,
                                    "author": "Quelcris_Falconer13",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Exactly this. This dude will never get the benefit of the doubt in any traffic crime that goes to court. If/when somebody ends up running him over, his only chance in court is to prevent all these videos from being used as evidence.",
                                            "score": 12,
                                            "author": "John_T_Conover"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "In that case you get to run over everyone in the courtroom",
                                    "score": 16,
                                    "author": "gearabuser",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "He does it in Atwater and Pasadena. I want to see him do that on the 110 south near century.",
                    "score": 465,
                    "author": "CASSIROLE84",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm not from the area; what's up with the 110 south near Century?",
                            "score": 124,
                            "author": "ManbadFerrara",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It’s where the police don’t come to save you. You are on your own.",
                                    "score": 266,
                                    "author": "ParkerBeach",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It’s where the sheriffs are the rival gang.",
                                            "score": 233,
                                            "author": "CASSIROLE84",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It’s where you don’t generally stop too long at stop lights after sun down.",
                                                    "score": 90,
                                                    "author": "ted_cruzs_micr0pen15",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It's where the Applebee's has iron bars in the windows.",
                                                            "score": 101,
                                                            "author": "MysticSisters",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "It’s where people eat nails for breakfast… without any milk.",
                                                                    "score": 24,
                                                                    "author": "UrMomThinksImCoo",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "My dad always told me to never stop at a light perfectly even with another car, just stop behind them and out of eyeline.",
                                                            "score": 33,
                                                            "author": "ContentKeanu",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[deleted]",
                                                                    "score": 21,
                                                                    "author": "[deleted]",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 103,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Man… did you play that game recently? I don’t even remember what area he lived in. In my save game he has a nice lil home on top of the hill.",
                                            "score": 20,
                                            "author": "Shadowofenigma",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I believe that's after her bossed up and moved out of his aunts house",
                                                    "score": 34,
                                                    "author": "BLADIBERD"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "He had to kill a lot of people to get that house.",
                                                    "score": 8,
                                                    "author": "jamieliddellthepoet"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Vermont vista, it’s the hood.",
                                    "score": 61,
                                    "author": "CASSIROLE84"
                                },
                                {
                                    "level": 3,
                                    "comment": "My guess would be maybe gang members?",
                                    "score": 37,
                                    "author": "arycka927",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Your guess is right",
                                            "score": 22,
                                            "author": "Hipster_Mouse"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Yep, he would get a healthy dose of Lead if he tried it there",
                                            "score": 19,
                                            "author": "Easports42069",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Precisely why the coward terrorizes the nicer areas. \n\nIf he pulled that in the area where I'm from (Baltimore, MD, USA) or even where I lived for years in Ohio, he'd be lucky as hell to leave with his life. \n\nAlso why I'm glad I carry a side arm. Hope I never encounter someone like him.",
                                                    "score": 36,
                                                    "author": "DanielleDrs88",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Please let that happen.",
                    "score": 17,
                    "author": "idontwantgum"
                },
                {
                    "level": 1,
                    "comment": "Fr, I think your fully in your right to draw a gun if this mf approaches your drivers side with a pipe",
                    "score": 62,
                    "author": "TryingToBeReallyCool",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Or run him over. Or at least take off his door as you drive away.",
                            "score": 44,
                            "author": "Lavender-Jenkins",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah that second to last lady made me happy ahaha. Ran straight through him.",
                                    "score": 24,
                                    "author": "Davidclabarr"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I live in a small, pretty safe mountain town, but because of the mountain thing, I do have bear spray and I wouldn't hesitate for one second to blast this fucker in the face.  I'm a tiny, older woman, and since he's such a coward, that's who he targets. God, I want to bear spray him so bad rn, lol",
                            "score": 48,
                            "author": "ttaptt",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What a menace to society.",
            "score": 632,
            "author": "Nasty13121",
            "replies": [
                {
                    "level": 1,
                    "comment": "Menace was the exact word that came to mind when watching this video. This dude is absolutely a menace",
                    "score": 138,
                    "author": "NickH211",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Has he been arrested yet?",
            "score": 549,
            "author": "The_Heck_Reaction",
            "replies": [
                {
                    "level": 1,
                    "comment": "He has not been arrested yet.",
                    "score": 245,
                    "author": "yourcool",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How about now?",
                            "score": 481,
                            "author": "clkou",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I would also like to know",
                                    "score": 127,
                                    "author": "harperwilliame",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I just checked and he still hasn't been arrested",
                                            "score": 98,
                                            "author": "-iamai-",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "what about now?",
                                                    "score": 69,
                                                    "author": "lazespud2",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Just checked and the answer is still no, but that was a few seconds ago, so has he been arrested yet?",
                                                            "score": 85,
                                                            "author": "Count_Sack_McGee",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I didn't check but I'll assume he still hasn't been arrested yet.",
                                                                    "score": 12,
                                                                    "author": "ButtDoctorLLC",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "What about now",
                                                                            "score": 12,
                                                                            "author": "Butterter",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "No just checked",
                                                                                    "score": 7,
                                                                                    "author": "sebasshaytaa",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 185,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 133,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Value would literally be gained",
                            "score": 37,
                            "author": "GRK--"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This mf is clearly a super villain, wears the same costume and uses a pipe for his nefarious deeds. What would his super villain name be?",
            "score": 1801,
            "author": "Kaligula785",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lane Rhodes, He'd go by Rhode Rage. Not realizing that using his real name for fame and clout would also criminalize him.",
                    "score": 573,
                    "author": "mannoncan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Misread it as Lana Rhoades lol.",
                            "score": 180,
                            "author": "honeypinn",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This guy only had one pole while she's usually known for taking two",
                                    "score": 46,
                                    "author": "FilthDropz",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "PipeFace! He really looks up to TazerFace!",
                    "score": 135,
                    "author": "DrunkenDuck727",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Angry Pipe Mask",
                    "score": 55,
                    "author": "TunaFaceMelt",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "given how short he is, Napoleon Bonapipe",
                    "score": 33,
                    "author": "XRotNRollX",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wow. What a lunatic",
            "score": 391,
            "author": "Normal-Park-6407",
            "replies": [
                {
                    "level": 1,
                    "comment": "Crazy that he's a grown ass person who can afford a car. That means this psycho has a job somewhere",
                    "score": 125,
                    "author": "FuriousTarts",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s not a cheap car, either. Tesla Model X\n\nEdit: or Model Y, can’t quite tell",
                            "score": 30,
                            "author": "baldude69",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Probably a trust fund kid. They tend to be unhinged with short tempers due to an inferiority complex from not being able to make it on their own without daddy's money, and their family's wealth makes them think they can do whatever they like with zero consequences. Makes me think back to the now-infamous guy who headbutted a waiter over nothing, and then obviously rapist Brock Turner.",
                            "score": 46,
                            "author": "SB_90s",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;  rapist Brock Turner.\n\nDo you mean Brock Turner the rapist who is reportedly now going by \"Allen Turner\"?",
                                    "score": 32,
                                    "author": "SQLDave",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 121,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Last one almost had the good idea, just didn't commit lol",
                    "score": 53,
                    "author": "Billy1138",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I woulda busted that door as I drove off",
                            "score": 21,
                            "author": "adobostyles",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "How has he not been found? He should be getting pulled over daily with that license plate cover.",
            "score": 495,
            "author": "Bobafetacheeses",
            "replies": [
                {
                    "level": 1,
                    "comment": "There was a police report when he attacked the woman at the storage facility- surely those places have cameras up? Did he access his unit? If so, should be pretty easy to figure out who’s renting it..",
                    "score": 281,
                    "author": "CandidIndication",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They said there was a warrant out for his arrest. You can't issue a warrant for an unknown person. They know who he is.",
                            "score": 244,
                            "author": "jk_throway",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You got me curious, so I got to googling. \nApparently there can be a “John doe warrant” : An outstanding warrant is for someone known to the police, whereas a John Doe Warrant is for someone who is not known to the police but is still a suspect in a criminal act. John Doe Warrants are not valid in every state in the US. Additionally, the federal government does not allow nor recognize this type of warrant. A few states allow John Doe Warrants due to the fact that the warrant still provides a sufficient description of a suspect in a crime. \n\nI don’t know if they’re valid in California. \nAre warrants public record? Tbh if the warrant had his name on it, I feel the news/police would be sharing the name with public",
                                    "score": 83,
                                    "author": "CandidIndication",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Alaska has that for subpoenas, for anything but murder or shooting at a house they can take your picture and give you an order to appear before the grand jury, and for those other things they can take fingerprints, but aren't allowed to enter them into a database and then order you to appear before a grand jury. (but only if neither would detain you for very long)",
                                            "score": 7,
                                            "author": "ThellraAK"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Prob a cop.",
                                    "score": 131,
                                    "author": "kevan0317",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "his haircut is definitely giving me law enforcement or military. could also be a wannabe but likely a cop",
                                            "score": 103,
                                            "author": "yummylumpylumpia",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Dude is a cop or a Marine.",
                                                    "score": 50,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "yeah I saw that shitty haircut and immediately thought Marine\n\nsource: was in the Marines",
                                                            "score": 27,
                                                            "author": "asst3rblasster",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Saw the haircut, the instant aggressive rage, Pendleton personality.",
                                                                    "score": 20,
                                                                    "author": "[deleted]",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt;  If so, should be pretty easy to figure out who’s renting it..\n\nThat would require police to pull their finger out and do some real work.",
                            "score": 25,
                            "author": "rgb255469236",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The LAPD is corrupt at every level, they aren't really into \"protecting\" or \"serving\".",
                    "score": 126,
                    "author": "AbigailLilac",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He also kind of has an LA cop vibe to him.",
                            "score": 126,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He must have gotten tired of beating his wife and kids and knew his coworkers were all busy protesting non-existent budget cuts.",
                                    "score": 64,
                                    "author": "SeasonPositive6771"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 59,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The videos just kept coming! What a lunatic.",
            "score": 88,
            "author": "Shoddy_Ad259",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Really surprised he hasn't been shot yet by someone with a concealed carry.",
            "score": 736,
            "author": "Distantlandssup",
            "replies": [
                {
                    "level": 1,
                    "comment": "Or just ran over",
                    "score": 125,
                    "author": "Twingemios",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "California. CCW is basically impossible to get in some areas.",
                    "score": 287,
                    "author": "Histoireguy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Until you find out that San Jose's ex Sheriff was selling them illegally and yet somehow she's not in jail.",
                            "score": 93,
                            "author": "rW0HgFyxoJhYka",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Somehow? You just explained why they arent",
                                    "score": 18,
                                    "author": "Kitchen_Music1302"
                                },
                                {
                                    "level": 3,
                                    "comment": "You mean Santa Clara County.",
                                    "score": 8,
                                    "author": "Zeke_Malvo"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Is open carry as well?",
                            "score": 30,
                            "author": "RealSteele",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Open carry isn’t a thing in CA except for LEOs I believe. CCWs are signed off by individual county sheriffs. I know a few people with them.",
                                    "score": 94,
                                    "author": "[deleted]",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Texas salivating. Come here little angry man. We have a lot of bad drivers here.",
                                    "score": 33,
                                    "author": "binger5",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I hope he gets what he deserves.",
            "score": 493,
            "author": "Mock333",
            "replies": []
        },
        {
            "level": 0,
            "comment": "People like this should just be airdropped into the nearest volcano. Sorry dude, you lost at society, better luck the next time your atoms assemble into a thinking creature.",
            "score": 78,
            "author": "devjj",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Does anyone see the cop just drive by? It’s literally when the girls ramming him with her car. It’s pretty obvious what was going on at that point",
            "score": 647,
            "author": "PIKEEEEE",
            "replies": [
                {
                    "level": 1,
                    "comment": "In the audio, you can hear her honking her horn frantically trying to get that officer's attention. \n\nShe forgot something very important though. They don't care.",
                    "score": 91,
                    "author": "Manburpig",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "\"First responders\" with no legal requirement to respond.",
                            "score": 29,
                            "author": "Breaklance"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "He was probably on his phone",
                    "score": 338,
                    "author": "GlassFantast",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Playing angry birds but he purposely loses to avoid hitting the pigs",
                            "score": 372,
                            "author": "PIKEEEEE",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "24 carat comment",
                                    "score": 41,
                                    "author": "JustSomeGuyOnTheSt",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 96,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 32,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "This guy *definitely* has a body count racking up in the woods somewhere.\n\nDavid Berkowitz was an arsonist. Dennis Rader would harass his neighbors.",
            "score": 510,
            "author": "Gloomy__Revenue",
            "replies": [
                {
                    "level": 1,
                    "comment": "At very least he Tates women in one way or another.",
                    "score": 109,
                    "author": "tomdarch",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh hell yeah, we're verbing Tate's name now? I am so fuckin here for it.",
                            "score": 80,
                            "author": "LaDivina77",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I should throw my pizza boxes away, but I've been tating behind on my chores",
                                    "score": 10,
                                    "author": "Imesseduponmyname",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Idk that haircut military or cop maybe?",
            "score": 194,
            "author": "Tricky-Sympathy",
            "replies": [
                {
                    "level": 1,
                    "comment": "probably a cop if he hasn't been pulled over for the hidden license plate yet. otherwise he'd be sporting veteran plates.",
                    "score": 130,
                    "author": "anustart001",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Probably an Army national guardsman who's upset that he was not thanked for his service. Also, you guys think he shittin' kittens now that his face is on TV?",
                    "score": 78,
                    "author": "CoffeeTwoSplenda",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would’ve drove off and bent his door so he couldn’t close it.",
            "score": 108,
            "author": "Just_Cap_9338",
            "replies": [
                {
                    "level": 1,
                    "comment": "That wouldve been so satisfying to see.",
                    "score": 22,
                    "author": "refused26"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That last one can’t be the same guy, he’s wearing a different shirt.\n\n/s",
            "score": 35,
            "author": "emonsta23",
            "replies": []
        },
        {
            "level": 0,
            "comment": "oooh he's an *angry* elf",
            "score": 101,
            "author": "zodar",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Imagine all the incidents that weren't caught in dashcam",
            "score": 91,
            "author": "k2theablam",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Seems like a well adjusted individual",
            "score": 28,
            "author": "mranonymous902",
            "replies": []
        },
        {
            "level": 0,
            "comment": "He's going to murder someone soon or already has.",
            "score": 26,
            "author": "WildWook",
            "replies": []
        },
        {
            "level": 0,
            "comment": "1:15 handled it almost perfectly.\n\nI'd have gotten him and his door a bit better, but we are not super human and I'm sure the driver had a few seconds of WTF before they reacted.\n\nBut oh did they react well",
            "score": 77,
            "author": "M8K2R7A6",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Wouldn’t it be worthwhile to go down the list of Model X owners that are registered in California?  This looks to be a pre-2018 model which means there are less than 30k of them in the entire US.  Narrow that number down by how many are in California and how many fit the grey exterior and I think you could sift through that list in about a week’s time.",
            "score": 99,
            "author": "DocPhilMcGraw",
            "replies": [
                {
                    "level": 1,
                    "comment": "When he attacked the woman at the storage facility there was a police report- surely those places have monitoring cameras? Did he access a unit while there? If so it should be easy to figure out who’s renting it",
                    "score": 61,
                    "author": "CandidIndication",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "He is like a GTA NPC wearing same clothes but the twat-o-meter dialed up to 100.",
            "score": 17,
            "author": "soboi12345",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I saw more coverage on the news. This guy seems to pick on mostly women.\n\nEdit: First male victim came forward on another news channel. And police brought someone in.",
            "score": 110,
            "author": "Marketing_Analcyst",
            "replies": [
                {
                    "level": 1,
                    "comment": "what a loser lmao",
                    "score": 20,
                    "author": "idthrowawaypassword"
                },
                {
                    "level": 1,
                    "comment": "We've got a Tater!",
                    "score": 35,
                    "author": "obtuse_buffoon",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Heard the \"bangs\" and thought the driver was packing and resolved the situation... disappointed.",
            "score": 72,
            "author": "Netskimmer"
        },
        {
            "level": 0,
            "comment": "I’m getting strong marine with mental illness vibes",
            "score": 92,
            "author": "rwjetlife",
            "replies": [
                {
                    "level": 1,
                    "comment": "Exactly what I was thinking. That high and tight, sense of entitlement, unreasonable rage. As a former Marine myself, I knew people like this, and if he is enlisted I hope his command sees this and gets him out of the public. Guy is a danger to himself and others.",
                    "score": 20,
                    "author": "Godmadius"
                },
                {
                    "level": 1,
                    "comment": "Not enough armed forces decals",
                    "score": 24,
                    "author": "ExplosiveDiarrhetic",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Literally had an AR15 decal and friends bumper sticker vet road rage encounter at a drive thru last night lol.\n\nI was behind him in the drive thru and this dude was just flipping me off, I had no idea what the hell I was doing wrong.\n\nHe gets his food and actually gets out of his car and comes stomping up to my window to tell me “ITS COMMON COURTESY TO TURN YOUR LIGHTS OFF IN A DRIVE THRU”",
                            "score": 11,
                            "author": "87broseidon",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "jfc, this guy going away for a while once they catch him",
            "score": 40,
            "author": "abstracted-away",
            "replies": [
                {
                    "level": 1,
                    "comment": "if he stops a wrong person, he might be gone forever",
                    "score": 25,
                    "author": "CSI_Tech_Dept",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Geez, does he think this is real life GTA?? How many stars till the heli gets on your ass?",
            "score": 12,
            "author": "SuperShineeCoinToss7",
            "replies": []
        },
        {
            "level": 0,
            "comment": "It’s a Tesla. He is recording all his crimes as well",
            "score": 12,
            "author": "ResearcherFew1273",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Calm down little fella, we allllll know how tough and scary you are",
            "score": 9,
            "author": "heresyourhatandcoat"
        },
        {
            "level": 0,
            "comment": "Is this the guy Russel Crowe was acting out in that road rage movie? Haha",
            "score": 8,
            "author": "GetErDoneEh",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 7,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Are Tesla drivers the new BMW drivers?",
            "score": 92,
            "author": "DevManTim",
            "replies": []
        }
    ]
}