{
    "id": "10cilrs",
    "score": 8447,
    "title": "Guy rides his bike onto a woman, doesn't apologies and gets angry when he gets confronted.",
    "author": "Daan_Theuwis",
    "date": 1673785469.0,
    "url": "https://www.reddit.com/r/iamatotalpieceofshit/comments/10cilrs",
    "media_urls": [
        "https://v.redd.it/vko3112a37ca1"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\nPlease note that we will ban you if a post or comment breaks any of our rules. **Be especially mindful of the following**:\n\n**Rule 1: Do not post or ask for identifying information, including first and last names and social media usernames.** Public figures are **not** exempt. We remove all external links to prevent accidental posting of identifying information.\n\n**Rule 2: Do not post violent comments, and do not glorify violence, per TOS.** We can't take responsibility for how angry a post makes you, you need to do that. Telling us \"it was a joke bro\" is not an excuse.\n\n**Rule 7: Do not link to or post screenshots of reddit posts, reddit comments, reddit personal messages, reddit profiles, etc.** We cannot allow you to use this subreddit to harass other people on reddit. \n\n**Rule 8: No bigotry, no racism or race baiting.** It is hard to believe that we even need a rule like this. \n\n**Our rules are zero tolerance. You will be banned for breaking them.**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/iamatotalpieceofshit) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "\"stay in your skill level\" you dont recover from that.",
            "score": 2767,
            "author": "808ocd",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not with his skill level",
                    "score": 304,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Kind of Unskilled.",
                            "score": 90,
                            "author": "Yakatsumi_Wiezzel",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yea, that’s the point.",
                                    "score": 14,
                                    "author": "Drillakilla6four"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Was an absolutely brilliant off-the-cuff response. \n\nThe type of thing you think about saying 2 mins later and kick yourself for not being quicker off the mark at the time.",
                    "score": 126,
                    "author": "blakezero",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "He’s about to Kaetlyn Osmand her ass.",
                    "score": 5,
                    "author": "The_perfect_Melody"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Did he fr ask the other guy what was wrong with *him*",
            "score": 871,
            "author": "thatsmelly_guy",
            "replies": [
                {
                    "level": 1,
                    "comment": "love to see someone wheelie right onto his back and then ask him \"tf is you doing\" and just laugh right back at him",
                    "score": 221,
                    "author": "idontneedjug"
                },
                {
                    "level": 1,
                    "comment": "Who knows? The guy taking the video can barely speak english from the sound of it",
                    "score": 28,
                    "author": "Skoodge42"
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"Stay in your skill level\" boom roasted",
            "score": 2278,
            "author": "Either-Carrot5567",
            "replies": [
                {
                    "level": 1,
                    "comment": "That was the best thing he could have said.  Guy filming sounds like a fool.",
                    "score": 733,
                    "author": "Blackmercury4ub",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "“Watch your mouth stop playin with me”",
                            "score": 58,
                            "author": "DevelopmentFree3975",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Watch your bike",
                                    "score": 2,
                                    "author": "ScotchSinclair"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "He do be a fool.",
                            "score": 46,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Even posted himself getting roasted lol",
                    "score": 198,
                    "author": "xomns13"
                },
                {
                    "level": 1,
                    "comment": "Damn. I wish I could use that one on my students. Such a good roast.",
                    "score": 36,
                    "author": "kashuntr188",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m not sure what you’re talking about but if you are some kind of teacher why would you ever want to roast your students? (especially for their skill level)",
                            "score": 6,
                            "author": "AirAcademy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What if it's first day of class and you're inheriting morons that are already acting up? Of course I'm not serious, but it's also not because of your poor teaching.",
                                    "score": 2,
                                    "author": "relationship_tom",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Terrible pay leads to terrible people filling the positions.",
                                    "score": 1,
                                    "author": "bottomdasher"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "His friend at the end: “it was an accident” \n\nOkay so maybe say sorry for smacking you in the back with my big ass tire and laughing about it. What a loser",
            "score": 1288,
            "author": "Guapiqueno",
            "replies": [
                {
                    "level": 1,
                    "comment": "Exactly. Didn’t look intentional, but man just say sorry. He still plowed into her.",
                    "score": 218,
                    "author": "K_Pumpkin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I live in the Netherlands and see bikes everyday and (small) accidents are common.\n\nThis is not an accident. You don't accidentally lift up your wheelie even further before smacking right into someone. That's not how accidents work.",
                            "score": 30,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think the pulling up was knee jerk reaction. Because if he goes further, he hits her. He was distracted and doing a trick and didn’t notice people ahead of him stopped. He should have apologized and been more aware of his surroundings.",
                                    "score": -1,
                                    "author": "Siktrikshot"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "As a cyclist and by looking at his bike. It’s intentional, dudes a jerk. These types of bikes have damn good breaks, you pull on it for the rear and it pretty much stops on a dime. If he wanted to stop, he could of.\n\nEdit: it has shocks, too, this is definitely a good quality mountain bike, which do have excellent brakes. Plus after watching it a few times, he raises up the wheel almost twice as high as he approaches the lady.",
                            "score": 136,
                            "author": "HelloAttila",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You can even see him tap his buddy at the very beginning. It seems like a hey watch this type of tap.",
                                    "score": 44,
                                    "author": "Chadg2018",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Have, he could have...",
                                    "score": 15,
                                    "author": "Lopsided-Income-4742",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "THANK YOU.",
                                            "score": 5,
                                            "author": "Morbins"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Didn’t look intentional?   You never rode a bike maybe?",
                            "score": 24,
                            "author": "somedood567",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Right.  The guy literally wheelies right into her.",
                                    "score": 31,
                                    "author": "anonyeemoose",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I literally don't understand people who will not take accountability for their actions just because it was an \"accident\".",
                    "score": 11,
                    "author": "Background_Crew7827",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They spent their entire youth and adolescence watching their parents never take accountability for their actions, so it's normalized for them.",
                            "score": 6,
                            "author": "bottomdasher",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "“it was *a* accident”",
                    "score": 5,
                    "author": "DarraghDaraDaire"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is what happens when mommy &amp; daddy never tell you “no”.",
            "score": 918,
            "author": "JeremyJaLa",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 252,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You mean grandma.",
                            "score": 161,
                            "author": "driftking428",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You mean great grandma and her sister",
                                    "score": 19,
                                    "author": "anonyeemoose"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Hah! Right!",
                            "score": 37,
                            "author": "JeremyJaLa"
                        },
                        {
                            "level": 2,
                            "comment": "Is this racially charged?",
                            "score": -150,
                            "author": "botas-",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes, very racist. They’re implying that because he’s black he was likely raised by only his mother or grandmother. They find this funny for some reason. I don’t find it funny considering the fact that black men have been over-policed, imprisoned and killed by the “justice system” since the “abolition” of slavery. Black boys and men are also the main cogs in the prison industrial complex which I’m sure many of those laughing at black fatherlessness directly profit from. \n\nOh, and you’re being downvoted because you’re calling them out on their racism. Welcome to Reddit.",
                                    "score": 1,
                                    "author": "thesixthjackson",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah that’s what I figured. Of course Reddit is glorifying racism. Why am I not surprised",
                                            "score": 0,
                                            "author": "botas-"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "“What’s a daddy?”\n\n- low skill level guy",
                    "score": 30,
                    "author": "FackinJerq"
                },
                {
                    "level": 1,
                    "comment": "But they did say no to grammar lessons.",
                    "score": 20,
                    "author": "tdkat"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don't think that was an accident at all. I think he did it to be \"funny\" and that's why he got pissed when someone told him to chill out",
            "score": 817,
            "author": "Iwilllieawake",
            "replies": [
                {
                    "level": 1,
                    "comment": "Agree. He got clear footage of it because that’s what he was trying to do.",
                    "score": 227,
                    "author": "alcormsu",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Meh, he's got a helmet cam and was looking the other way before he ran into her. Guys a dick, and needs to stay at his skill level. But let's not run with what his intentions were",
                            "score": 1,
                            "author": "cutlis"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Exactly, he just didn't like being called out about it.",
                    "score": 39,
                    "author": "Master_Cupcake7115"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is being completely careless really an accident?",
            "score": 348,
            "author": "Schlutes3273",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s why in the ER they don’t call them motor vehicle accidents, but collisions. Most of the time not an accident the person caused a crash",
                    "score": 52,
                    "author": "ryanmuller1089",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s listed as MVA or motor vehicle accident in pretty much all the physician notes I’ve ever read though.",
                            "score": 10,
                            "author": "voodoo_chile_please",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "So would that make this a PVA, pedaled vehicle accident?\n\nI'll see myself out",
                                    "score": 2,
                                    "author": "not_sick_not_well"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "And how is anyone in the ER even remotely qualified in determining that a car accident was in fact not an accident?",
                            "score": 1,
                            "author": "JMochs23",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "We think this was on accident?",
                    "score": 10,
                    "author": "LurkJerk55"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Even if it was an accident, nothing prevented him from apologizing except for his bad manners showing he was raised by shitty parents. What a tool.",
            "score": 305,
            "author": "Wintersmight",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 43,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ah true…",
                            "score": 21,
                            "author": "Wintersmight"
                        },
                        {
                            "level": 2,
                            "comment": "Bold of you to assume he doesn’t. Could be he was raised without a mother. Or two shitty parents. Or none. Bottom line is he’s an adult who needs to take responsibility for his own actions",
                            "score": 13,
                            "author": "HangOnVoltaire"
                        },
                        {
                            "level": 2,
                            "comment": "why the racism?",
                            "score": -23,
                            "author": "DMENShON",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm white and I grew up without a dad. My mom just taught me manners. It's not a race thing bro.",
                                    "score": 16,
                                    "author": "Handy_Clams",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "that comment is 100% without a doubt racist regardless of how many dads you have",
                                            "score": -19,
                                            "author": "DMENShON",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 4,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Because this subs full of racists",
                                    "score": -18,
                                    "author": "MurrmorMeerkat",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "the downvotes prove it lmao",
                                            "score": -14,
                                            "author": "DMENShON"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Throw a stick in his spokes.",
            "score": 64,
            "author": "Jasonclark2",
            "replies": [
                {
                    "level": 1,
                    "comment": "Throw his bike at him",
                    "score": 15,
                    "author": "UFumbDuckGaming",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Accidentally wheely into his mid-back when he’s a middle aged woman.",
                    "score": 5,
                    "author": "blakezero"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That's not how I would have called him out, but good job checking him.",
            "score": 56,
            "author": "InnerPick3208",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah same, but overall that’s how these people want you to react - so they and their 7 boys can get some action and feel big about messing up one guy on his own.",
                    "score": 8,
                    "author": "db1000c"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Complete trashhhhh lol",
            "score": 52,
            "author": "T3L3Frogg3r",
            "replies": [
                {
                    "level": 1,
                    "comment": "Calling that bastard trash is an insult to trash",
                    "score": 13,
                    "author": "UFumbDuckGaming"
                }
            ]
        },
        {
            "level": 0,
            "comment": "“Stay at your skill level” was honestly the perfect response",
            "score": 43,
            "author": "Chopper313"
        },
        {
            "level": 0,
            "comment": "Simply \"sorry\" or even the half ass \"my bad\" could of gone so much more chill",
            "score": 35,
            "author": "jay-zigg",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah but in this case it would be so disingenuous that it would actually be worse. With him clearly doing it on purpose and then his snotty, entitled demeanor after, the way it played out was sadly likely the best possible outcome.\n\nThat's not to say someone cracking him in the face wouldn't be a better outcome, just that this outcome from his end was best the way it was",
                    "score": 2,
                    "author": "JMochs23"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Small dick energy",
            "score": 29,
            "author": "WOTCollector"
        },
        {
            "level": 0,
            "comment": "Wish someone had just come along and casually knocked him off his bike.",
            "score": 28,
            "author": "Boredpanda31",
            "replies": []
        },
        {
            "level": 0,
            "comment": "\"What is you doing?\"",
            "score": 152,
            "author": "TheBitterAtheist",
            "replies": [
                {
                    "level": 1,
                    "comment": "Cringe vernacular",
                    "score": 85,
                    "author": "Sad_Progress4388",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Invent a name for it and BOOM now it's \"correct\"",
                            "score": -26,
                            "author": "DaleGribble312"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Bad grammar overload.",
                    "score": 23,
                    "author": "Horkporkler28",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What you say about my grammar? She's 92, have some respect.",
                            "score": 21,
                            "author": "labpadre-lurker",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Linguo IS dead.",
                                    "score": 5,
                                    "author": "Horkporkler28"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I love how ironic when the person who records the video is the pos I mean what do they expect to happen when they post videos of themselves being dickheads on the internet",
            "score": 23,
            "author": "No-Argument3922",
            "replies": [
                {
                    "level": 1,
                    "comment": "They expect likes from their tribe, and not to be held accountable accept for a little public shaming that is outside their bubble.",
                    "score": 14,
                    "author": "TruthToStupidText"
                }
            ]
        },
        {
            "level": 0,
            "comment": "And then he posted it. Man got roasted to 500F",
            "score": 75,
            "author": "GrantedPermission",
            "replies": [
                {
                    "level": 1,
                    "comment": "Link plz",
                    "score": 3,
                    "author": "Darssssyyyyyyy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You’re literally watching it rn",
                            "score": 27,
                            "author": "GrantedPermission",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I thought you were talking about the comments on the original post hence why I asked for a link lol",
                                    "score": 12,
                                    "author": "Darssssyyyyyyy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ohh haha my b. I bet someone has the link",
                                            "score": 11,
                                            "author": "GrantedPermission"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That was no accident",
            "score": 14,
            "author": "Browneyedgirl63"
        },
        {
            "level": 0,
            "comment": "Tase him in the nutsack",
            "score": 46,
            "author": "Confused_4292",
            "replies": [
                {
                    "level": 1,
                    "comment": "What it Iz you be tasing???\n\n\n...nutsack",
                    "score": 8,
                    "author": "Ironh11de"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That man was waaaay too nice",
            "score": 45,
            "author": "Warmheavy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nah he said it perfectly.",
                    "score": 4,
                    "author": "NoiceMango"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Shove a branch in his tire",
            "score": 12,
            "author": "yeet-my-existence"
        },
        {
            "level": 0,
            "comment": "I once got hit while snowboarding and told the guy to “stay in control”. He then yelled at me, my brother, and two of my friends. Some people just aren’t the brightest",
            "score": 14,
            "author": "WelpAtLeastITriedz"
        },
        {
            "level": 0,
            "comment": "\"What is you doing\". Send him to jail. Immediately.",
            "score": 12,
            "author": "rand0d3v"
        },
        {
            "level": 0,
            "comment": "He did that on purpose. I hate how they just get away with it under the pretense that it was an accident. Clearly intentional but no one can see that.",
            "score": 37,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "And biker posted this video why?",
            "score": 10,
            "author": "Garcia-Hotspure",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Instant respect for the dude who stepped in",
            "score": 10,
            "author": "BigDickDyl69"
        },
        {
            "level": 0,
            "comment": "Need to find his SM so I can roast him some more with the “Stay in Your Skill Level” burn",
            "score": 25,
            "author": "GMEbankrupt"
        },
        {
            "level": 0,
            "comment": "The bike douche of all bike douches",
            "score": 8,
            "author": "subtleonion17"
        },
        {
            "level": 0,
            "comment": "Stay in your skill level.. I know that hurt his feelings hahaha",
            "score": 7,
            "author": "SidTheStoner"
        },
        {
            "level": 0,
            "comment": "So this clown posted it himself. Track his IP and fling this POS into prison.\n\nGet him for assault. Keep the roads clear of people like this.",
            "score": 85,
            "author": "Alone-Day1429",
            "replies": []
        },
        {
            "level": 0,
            "comment": "“What is you doin’?”\n\nHe’s asking you to, “…stay in your skill level”, which translates to:\n\nPlease pay attention to your surroundings and avoid crashing into folks casually riding their bikes…you know…be responsible.",
            "score": 6,
            "author": "HeldDownTooLong"
        },
        {
            "level": 0,
            "comment": "You know, every now and then I see a cyclist and get some intrusive thoughts, like wanting to shove a stick through the spokes and watch them flip. This is one time I would allow the intrusive thoughts to win, just for this guy, cause he looks like he needs it in his life",
            "score": 3,
            "author": "MoistBluejay2071"
        },
        {
            "level": 0,
            "comment": "Smoothest roast",
            "score": 6,
            "author": "T_in_Lousiana"
        },
        {
            "level": 0,
            "comment": "What a FUCKING IDIOT",
            "score": 6,
            "author": "LovesTitsnASSn69"
        },
        {
            "level": 0,
            "comment": "Another video recorded by an entitled idiot who sees nothing wrong with their actions so they post it. Need to ask himself “What is your doin? “",
            "score": 4,
            "author": "TruthToStupidText"
        },
        {
            "level": 0,
            "comment": "Doesnt even apologize and gets angry when someone calls him out what a POS",
            "score": 4,
            "author": "sticksnstones456"
        },
        {
            "level": 0,
            "comment": "No I'm sorry no my bad gets mad when he gets corrected straight animal right here throw him in a cage",
            "score": 14,
            "author": "deadmankw",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I love when people tell me to watch my mouth. It’s how you know you won cuz they’re so goddamn triggered they can’t even handle the fact you’re speaking truth",
            "score": 6,
            "author": "stasismachine"
        },
        {
            "level": 0,
            "comment": "The “…what IS you doin’?…” comment explains everything.",
            "score": 7,
            "author": "PoolBoyBryGuy"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 37,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Ghetto trash. Of course he didn’t apologize. I bet he and his friends wheelie in front of cars for the thrill",
            "score": 15,
            "author": "User_Anon_0001"
        },
        {
            "level": 0,
            "comment": "I prey every day that one of them comes at my car head on because I’m not moving.  My car will win",
            "score": 3,
            "author": "Prestigious_Shape648",
            "replies": []
        },
        {
            "level": 0,
            "comment": "We’re all stealing that verbal assault right?\n\nNonwhite biker is a childish maniac. White guy was solid.",
            "score": 33,
            "author": "prisoneroftheracewar",
            "replies": []
        },
        {
            "level": 0,
            "comment": "The guys a fucking sociopath.  I spot it so quickly now.  I just avoid those people like the plague.  As soon as I deem you a sociopath I walk away and never speak to you again.",
            "score": 11,
            "author": "Thediamondhandedlad",
            "replies": [
                {
                    "level": 1,
                    "comment": "I see and agree with what you're saying, but the way you worded this makes me also believe you might over use the label sociopath",
                    "score": 6,
                    "author": "MatthewChad",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, you’re probably right, it’s a trauma response from growing up with a sociopathic narcissistic Mother.  I need therapy 🤣",
                            "score": 3,
                            "author": "Thediamondhandedlad",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That will do it",
                                    "score": 2,
                                    "author": "MatthewChad"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Bro sounds and behaves just like Odell pitching a fit on that flight a week or so ago. Stay classy, foo'. 😂",
            "score": 12,
            "author": "EdnaKraboppoly"
        },
        {
            "level": 0,
            "comment": "Needs life in prison.",
            "score": 26,
            "author": "Tough-Comfortable880",
            "replies": [
                {
                    "level": 1,
                    "comment": "Big Bob's Cock meat sammich will change his attitude right away",
                    "score": 2,
                    "author": "UFumbDuckGaming"
                }
            ]
        },
        {
            "level": 0,
            "comment": "With chew?",
            "score": 5,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "\"Wuh izyoo doowih? Fuggiz rowng wichoo\" - a real mvp",
            "score": 17,
            "author": "blastification",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hes learnted",
                    "score": 4,
                    "author": "TedNebula"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why do I feel like it wasn't an \"accident\".",
            "score": 5,
            "author": "thesmartone1125"
        },
        {
            "level": 0,
            "comment": "We saw a red dodge ram that could pay him back if he likes karma",
            "score": 2,
            "author": "MEM1911"
        },
        {
            "level": 0,
            "comment": "Source? I wanna see his social get roasted",
            "score": 2,
            "author": "CJohnstone90"
        },
        {
            "level": 0,
            "comment": "What a tiny brained child he is.",
            "score": 2,
            "author": "Less-Raspberry-6222"
        },
        {
            "level": 0,
            "comment": "I wouldn’t have been upset if someone had stopped and kicked the back wheel out from under this dude, what a pos",
            "score": 2,
            "author": "Crocodiddle22"
        },
        {
            "level": 0,
            "comment": "Damn…I actually really like Virtual Insanity. Great song.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "What kind of evil is he? Plz hit by a truck",
            "score": 2,
            "author": "roxwell75"
        },
        {
            "level": 0,
            "comment": "Would he just shrug it off if HE got smacked in the back of the head?",
            "score": 2,
            "author": "gargtyrion"
        },
        {
            "level": 0,
            "comment": "If it was an accident why didn't you apologize or show concern for the person you hit.",
            "score": 2,
            "author": "SillySade"
        },
        {
            "level": 0,
            "comment": "How am I not suppose to want people like this to meet a violent death?",
            "score": 5,
            "author": "Intrepid_Look_5725"
        },
        {
            "level": 0,
            "comment": "They way he talk sounded like theres a lot of cells thats work minimum wage in his brain.",
            "score": 6,
            "author": "Shepok"
        },
        {
            "level": 0,
            "comment": "\"stay at your skill level\" such a good insult and that pos definitely deserves to hear that.",
            "score": 3,
            "author": "Yakatsumi_Wiezzel"
        },
        {
            "level": 0,
            "comment": "What a punk",
            "score": 2,
            "author": "uncl3_Fest3R"
        },
        {
            "level": 0,
            "comment": "Wuts wrong wit chu? Everything right there.",
            "score": 2,
            "author": "AnthonyElevenBravo"
        },
        {
            "level": 0,
            "comment": "mad respect for the guy that confronted him, i would NOT have been that calm if it were me",
            "score": 2,
            "author": "Biktop-76"
        },
        {
            "level": 0,
            "comment": "Dude...he was listening to virtual insanity by jamiroquai. She was lucky all she got was a bike to the head, ive seen the world shift into madness because of that song! Couches moving independent of force! Random crows flying indoors! Large fuzzy top hats!\n\nEdit: downvotes? Why? Im not saying she deserved to get hit in the face, it was obviously a joke about the virtual insanity music video which apparently all the zoomers on reddit havent seen because they werent born yet. Way to go, this is why nobody respects your generation. No critical thinking, just outrage at everything.",
            "score": -1,
            "author": "Shenanigans7348"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -13,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "***NO RACISM/HATE SPEECH/BIGOTRY/IDIOTIC RACE BAITING***\n*************\nNo racism, homophobia, transphobia, or other bigotry. If they're a piece of shit, you don't need to bring their whole demographic into it.",
                    "score": -2,
                    "author": "iamatotalpieceofshit-ModTeam"
                },
                {
                    "level": 1,
                    "comment": "I Know you're a racist scumbag",
                    "score": -18,
                    "author": "Ellanasss",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Guaranteed the POS who hit the girl is more racist than me🤣 he purposely hit her for laughs and then plays the classic your white it doesn’t matter if anything my front tire is the real victim here 🤣how can u defend him at all",
                            "score": 17,
                            "author": "Vegetable_Ask_3735"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "And that’s relevant how? I think you should just take this down.",
                    "score": -15,
                    "author": "Rastaferrari829",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "More relevant than the BLM movement",
                            "score": -20,
                            "author": "Vegetable_Ask_3735",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think we can all see where you clearly stand…",
                                    "score": 3,
                                    "author": "Rastaferrari829",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "and u think he is in the minority of thought??!!... defund the police and see how fast we take out the trash.",
                                            "score": -25,
                                            "author": "1credible_cow",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Confused how this turned political so fast over a dude hitting a woman with his bike. Everyone needs to give the internet a rest.",
                                                    "score": 16,
                                                    "author": "Rastaferrari829"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "“Defund the police” gives me bingo on my Reddit comment section bingo card (was double for the anti police and unnecessary political comment). I’ve just won a fidget spinner thanks to your predictable comment!",
                                                    "score": -6,
                                                    "author": "Mo622"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I know what you're getting at, and not that it matters at all, but that guy is white.",
                    "score": -17,
                    "author": "shmiddleedee",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Gonna need to see some proof chief",
                            "score": 4,
                            "author": "Vegetable_Ask_3735"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Pop the fucker's tires.",
            "score": 1,
            "author": "princeofddr"
        },
        {
            "level": 0,
            "comment": "What happens when you’re raised wrong",
            "score": 1,
            "author": "Pretty_Grapefruit719"
        },
        {
            "level": 0,
            "comment": "Dude is an assclown, trying to assert his “privilege”!",
            "score": 1,
            "author": "Lucentlackey"
        },
        {
            "level": 0,
            "comment": "that’s how you get a stick in between your spokes",
            "score": 1,
            "author": "otxjt"
        },
        {
            "level": 0,
            "comment": "He sounds very uneducated",
            "score": 1,
            "author": "The-6ix",
            "replies": []
        },
        {
            "level": 0,
            "comment": "What is you doing?",
            "score": 1,
            "author": "Somewhat-Useful"
        },
        {
            "level": 0,
            "comment": "If he was respectful and said “hey could you apologize to her please” I’m sure the dude would’ve said sorry but since dork in the suit wanted to say some smart comment than bro shot it right back, lol. Accidents happen at all skill levels and especially skill that require an uncontrolled environment.",
            "score": -7,
            "author": "Notrilldirtlife",
            "replies": [
                {
                    "level": 1,
                    "comment": "You’re fucking brain dead",
                    "score": 2,
                    "author": "Hermanas_"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is that the guy from Dave?",
            "score": 1,
            "author": "Garcia-Hotspure"
        },
        {
            "level": 0,
            "comment": "These fools give SE bikes a bad wrap",
            "score": 1,
            "author": "GrayFox916",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Amateur who can't ride a bike in crowded conditions. Do urself a favor amateur....never drive a car\n\nI know what you say to yourself when you attempt to ride your bike....me me me me me me me me me me",
            "score": 1,
            "author": "bigwiggs2008"
        }
    ]
}