{
    "id": "10guuiu",
    "score": 9345,
    "title": "Why, what did the kid do?",
    "author": "Upset-Biscotti-1598",
    "date": 1674214905.0,
    "url": "https://www.reddit.com/r/iamatotalpieceofshit/comments/10guuiu",
    "media_urls": [
        "https://v.redd.it/iquozqeh88da1"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\nPlease note that we will ban you if a post or comment breaks any of our rules. **Be especially mindful of the following**:\n\n**Rule 1: Do not post or ask for identifying information, including first and last names and social media usernames.** Public figures are **not** exempt. We remove all external links to prevent accidental posting of identifying information.\n\n**Rule 2: Do not post violent comments, and do not glorify violence, per TOS.** We can't take responsibility for how angry a post makes you, you need to do that. Telling us \"it was a joke bro\" is not an excuse.\n\n**Rule 7: Do not link to or post screenshots of reddit posts, reddit comments, reddit personal messages, reddit profiles, etc.** We cannot allow you to use this subreddit to harass other people on reddit. \n\n**Rule 8: No bigotry, no racism or race baiting.** It is hard to believe that we even need a rule like this. \n\n**Our rules are zero tolerance. You will be banned for breaking them.**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/iamatotalpieceofshit) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "I have no idea what happened but I remember being a dirt poor kid with the occasional toy. And I had this situation happen to me. It’s devastating.",
            "score": 3637,
            "author": "ex-big_bag_of_dicks",
            "replies": [
                {
                    "level": 1,
                    "comment": "Never got toys or anything outside of Christmas. Once mom comes home to a Go Bot for  me. An hour later a friend comes over, breaks off the arms, stomps off the wings.\n\nStill haven't gotten over that.",
                    "score": 1452,
                    "author": "Flailing_Aimlessly",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "\"You have a Go Bot and not a Transformer? Wow, you suck. I'm going to destroy your Go Bot because you suck.\"",
                            "score": 604,
                            "author": "shf500",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Little did Timmy know, go bots were the inspiration for transformers",
                                    "score": 239,
                                    "author": "Punymwg07",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "My parents told me Playmobil was the inspiration for Lego… which really means “we can’t afford Lego.”",
                                            "score": 140,
                                            "author": "SMc4941931",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Lego are massively overpriced for little pieces of plastic.",
                                                    "score": 125,
                                                    "author": "Thunderzap",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "The amount of quality control and precision those pieces of plastic boast, they're actually quite cheap.",
                                                            "score": 83,
                                                            "author": "rocket-engifar",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "There’s a reason that the lego is the number one cause of pain and death",
                                                                    "score": 46,
                                                                    "author": "Looney_Swoons",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "They just taste so darn good I can’t help myself",
                                                                            "score": 29,
                                                                            "author": "Micheal_Kibitsuji",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Crayons are a much better snack.",
                                                                                    "score": 3,
                                                                                    "author": "Ok-Criticism6872",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "They are certainly a class above any other plastic building blocks in quality, but they're still overpriced. The amount they've gone up just in the last 10-15 years alone is pretty crazy.",
                                                                    "score": 22,
                                                                    "author": "Niccin"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Plastic injection molding is not some advanced technology and has been around for over 100 years. Sure Lego has good quality control but that still doesn't excuse the prices they charge.",
                                                                    "score": 14,
                                                                    "author": "Thunderzap",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "It's not the moulding that gives it the high cost. Most of my company's QC/QA  department would kill to have a process quality control like Lego. And we build fucking rocket engines. Take a minute to think on how world class their QC is that a rocket engine manufacturer is envious. \n\nThey make millions of parts a day that adhere to a strict tolerance. Have you ever heard of a part not fitting in any bought Lego kit?",
                                                                            "score": 10,
                                                                            "author": "rocket-engifar"
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "The fact that you can use a Lego from 20 years ago and it work with one made today is extremely impressive",
                                                                    "score": 60,
                                                                    "author": "TurtleIIX"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "*WarHammer has entered the chat*",
                                                            "score": 7,
                                                            "author": "DickEd209"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I got made fun of at school for having Go Bots instead of Transformers.",
                                    "score": 27,
                                    "author": "wetwater",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm sure your parents gave you Go Bots and they said \"Go Bots are just as good as Transformers!\" or \"Go Bots are *better* than Transformers!\"",
                                            "score": 15,
                                            "author": "shf500",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Not really, and getting made fun of about it didn't particularly bother be because the ones I had were pretty much the same size as my Matchbox and Hot Wheels cars, which I had a whole bunch of.  I also had the command center, or whatever it was called.  That got repurposed for my GI Joe and Star Wars action figures.",
                                                    "score": 16,
                                                    "author": "wetwater"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "yup i had some go bots and and kids were always like uh thats not a transformer. Fast forward to when I was a young adult. Went into the toy store and bought nearly every transformer they had and gave them out as presents.",
                                            "score": 16,
                                            "author": "Jackie_Daytona-Human"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "A friend did that?  WTF kind of friends did you have?",
                            "score": 23,
                            "author": "Earth_Normal",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I mean, I was 6. Most of my friends were just kids my mom was the friend of the mom of.",
                                    "score": 19,
                                    "author": "Flailing_Aimlessly",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Do you remember how your mom reacted when it happened? Did you ever get a new one?",
                                            "score": 5,
                                            "author": "bishcalledwanda",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I got Megatron for Christmas.  I had it maybe two hours before my shithead cousin broke the barrel off of it and he thought that was hilarious.",
                            "score": 19,
                            "author": "wetwater"
                        },
                        {
                            "level": 2,
                            "comment": "I just got a mad case of Deja-vu... I've read this comment exchange before.",
                            "score": 8,
                            "author": "RenegadeBS",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Might have been my old account.\n\nI had to burn my main account last year when local media wanted to ask me questions and local police wanted to drunkenly intimidate me.",
                                    "score": 7,
                                    "author": "Flailing_Aimlessly",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That took a turn.",
                                            "score": 9,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Everyone’s talking about how they had go bots instead of transformers, bro I didn’t have either I got a train set that could be put together into a robot like a Megazord from a train museum. It was honestly pretty cool though!",
                            "score": 8,
                            "author": "_Indofreddy_112",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "“ you break my Go Bot I break your spine mother fu- “ for real though I feel really bad about that",
                            "score": 4,
                            "author": "Micheal_Kibitsuji",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "We did end up fighting the next time my mom watched him. He demanded my second hand Mego spiderman and I refused, so he hit me in the arm with roller skate he swung by the laces. My whole bicep was purple for a few days. I punched him DIRECTLY in the eye and he had a black eye for a few days. His mom, even after seeing my bruise, lectured me.",
                                    "score": 5,
                                    "author": "Flailing_Aimlessly",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "you had Christmas?",
                            "score": 9,
                            "author": "Forgot_Password_Dude",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I did. I would get some toys, but usually shirts and underwear from my aunts.",
                                    "score": 8,
                                    "author": "Flailing_Aimlessly",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "cool.  many people, especially immigrants, dont get any 🎄 🎁 at all until adults",
                                            "score": 3,
                                            "author": "Forgot_Password_Dude",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "sounds like a great friend",
                            "score": 3,
                            "author": "mrcheaptimes"
                        },
                        {
                            "level": 2,
                            "comment": "Sorry to hear that. I have one of those friends like yours",
                            "score": 4,
                            "author": "aimpau",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I stopped having those friends at about 14. Once I realized when mom walked in with a kid saying \"look who came over to play\" and I could say to the kid \"Go home, don't come over here again.\" I started doing that.",
                                    "score": 5,
                                    "author": "Flailing_Aimlessly"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I would go back to the past only to destroy all the kid who did this’ toys too",
                            "score": 2,
                            "author": "ThatOneWeirdo66"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I was dirt poor, my mom scrimped and saved until my sister and I could afford a Nintendo DS. that thing was my life. \n\nmy younger brother (2 at the time) believed he knew how games worked, so he stuck a quarter in the game card slot. stuck it in there hard before I could get it back from him. I got the quarter out, but it was bricked. according to my vidya-restoring SO, it probably knocked some ribbon loose. \n\nit sucked for me. that was the first time I had a game I could play with my friends that wasn't handed down or thrifted. \n\nwhat *really* sucked was seeing my mom. she doesn't get angry, and for the first time in my life she was mad. \n\nI told her it was okay. I didn't want to see her or my brother upset, and then I just didn't care about the games. \n\n\npoor kids have to grow up really fast.",
                    "score": 237,
                    "author": "melancholanie",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "just be poor enough that your brother doesnt have a quarter\n\nfor real though, that really sucks. \n\ni still have my ds lite, and it still slaps. its right in the perfect age range that games for it are dirt cheap. if you can, i recommend picking one up. plus it can play gba games, which are going up in price but still cheap. you can also load a ds and gba game at the same time, so you can have two games on the go without worrying about losing a tiny card.",
                            "score": 63,
                            "author": "Firewolf06",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "oh man I recall! my SO actually got a refurbished/upgraded one a while back, and I got a fancy schmancy upgraded GBA myself. we both have emulator carts so we can just play whatever classics we want on the go!",
                                    "score": 28,
                                    "author": "melancholanie",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "This comment almost takes the sting out of reading your first one.",
                                            "score": 19,
                                            "author": "Girth_rulez",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I'm glad! of course, this happened a long time ago. I've become all grown up as it were, and I guess you can call it a happy ending. I'm still kinda poor, but I have the ability to get myself cool stuff every once in a while! \n\nheck, I guess the epilogue is: about a year or two later (this was over a decade ago, time is fuzzy!) I believe I got another ds lite for Christmas, which started a chain of trading up for the new handheld. I eventually traded my new3dsxl for a switch lite and (after stick drift set in) traded up for a big girl switch. \n\nI'm a lil high and reminiscing, sorry for the novella.",
                                                    "score": 15,
                                                    "author": "melancholanie",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt;I'm a lil high and reminiscing, sorry for the novella.\n\nIt's all good. I love it.",
                                                            "score": 11,
                                                            "author": "Girth_rulez"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "also high, and grew up on nintendo, and still game hard today. Fun read. I saved up all of my money forever to buy a gameboy advanced when it came out. it was my first game boy. I always played pokemon on my n64 at home. I used the game pak to play pokemon red and yellow on my tv. My parents didn't get me a gameboy ever. So when I heard about GBA I started saving birthday and lawn mowing money. I was hooked on that thing.",
                                                            "score": 3,
                                                            "author": "adanceparty"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I'm glad she didn't try to sweep it under the rug, I'm glad she was upset for you. I know a lot of parents who wouldn't care if their sibling ruined something of theirs",
                            "score": 13,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Terrible thing to do to a kid. \n\nI remember my parents being so poor that I’d get hand me down toys. I remember my dad telling me, real men play with Barbie’s lol\n\nOr, affording one banana once a month because it was an exotic fruit for us. \n\nOr, how blue jeans would cost over two months salary. \n\nI was born in the Soviet Union.",
                    "score": 78,
                    "author": "lalaland323",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I hope your life is so much better now. Thank you for sharing",
                            "score": 20,
                            "author": "Jifkolinka",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hopefully he is not in Russia.",
                                    "score": 9,
                                    "author": "Mission_Strength9218",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It's a banana. What could it cost?",
                            "score": 25,
                            "author": "FapplePie85",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I see your Arrested Development reference. \"... 10 dollars?\"",
                                    "score": 18,
                                    "author": "erakattack",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Unsurprisingly, I was downvoted to heck by people who I guess just thought I was being a dick to a poor kid. \n\nLol.",
                                            "score": 13,
                                            "author": "FapplePie85",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Go see a star war.",
                                                    "score": 2,
                                                    "author": "karatebullfightr"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You don't know how lucky you are, boy ...",
                            "score": 2,
                            "author": "mohishunder"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I had something similar happen recently. A family member of mine accidentally destroyed an item with great emotional value. I was absolutely crushed and needed to sit down for a bit. I don't cry easily, but this was hard on me.",
                    "score": 14,
                    "author": "MEsyas",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sorry that happened.",
                            "score": 3,
                            "author": "ex-big_bag_of_dicks"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I didn’t have cable when I was younger, so I would watch the same Sailor Moon (&amp; something else, I forgot, maybe DBZ or Pokémon?) VHS tapes over &amp; over. I had a bunch of them. \n\nMy grandparents raised me so it was weird when one day my mom comes home then rushes me to Food Depot. My parents didn’t really do that because they were always working when it was time for my granny to go grocery shopping. \n\nMy mom bought me chips to eat while she shopped &amp; when we came home, my VHS tapes were piled like a mountain. To the side was a hammer. They were all smashed by my dad. Every single one of them. I looked through the pile to see if anything was untouched, nope. All destroyed. I don’t think I cried. I think I was just shocked. To this day, I still have no idea why my dad did that because I don’t recall him being angry *at me* before I left with my mom.",
                    "score": 15,
                    "author": "iBeFloe",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So fucked up. Sorry that happened.",
                            "score": 5,
                            "author": "ex-big_bag_of_dicks"
                        },
                        {
                            "level": 2,
                            "comment": "I’m sorry that happened. :( \nIf I ever see him I’ll kick him in the penis for you.",
                            "score": 3,
                            "author": "BeginningSprinkles49"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Same here, it shut me down like crazy, I don’t know how we survived that",
                    "score": 56,
                    "author": "jigglypants6897",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Yep. Guess my mom was cheating on my first stepdad with my soon to be second stepdad. They apparently got into a fight one night (long story) and destroyed the playroom.  I used to zone out my parents abuse and school bus bullies with a portable CD player that was among the damage. I was upset when I found it but got in trouble for “whining” about it because it “wasn’t my moms fault.” 🙄",
                    "score": 47,
                    "author": "evil-rick"
                },
                {
                    "level": 1,
                    "comment": "I’d I could find this kid if get him a replacement",
                    "score": 4,
                    "author": "Moshxpotato"
                },
                {
                    "level": 1,
                    "comment": "These things are impractically expensive.  Getting one as a kid is a dream",
                    "score": 3,
                    "author": "koreamax"
                },
                {
                    "level": 1,
                    "comment": "If the parent breaks a kid's toy, people assume the kid did something to warrant that, like talking back to the parent (includes situations where the kid is trying to explain something in a calm way).",
                    "score": 24,
                    "author": "shf500",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm not saying you're advocating for that stuff but destroying a kids toy is terrible parenting. \n\n\nIt sets the example for them that destruction of property is an acceptable way to handle anger, disappointment, or retribution. \n\n\nClearly there's a lot more going on there but that kid didn't learn anything good. Even if it does bring his behavior back in line he's not going to trust that parent as much and he's going to resent them and fear them.",
                            "score": 42,
                            "author": "small3687",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "One of my earliest memories is of my father smashing one of my favorite toy cars because I bent a curtain rod.  I was devastated over that.",
                                    "score": 12,
                                    "author": "wetwater",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I am so sorry that happened to you. Generational pain can feel like an insurmountable thing to overcome. For what it is worth you didn't deserve that. No child does. It's an unfair burden to bear.",
                                            "score": 7,
                                            "author": "small3687"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I just turned to my husband and asked if his parents ever destroyed their toys in anger and he looked at me like I was crazy and said not once. My mom did that semi-regularly, I thought it was pretty normal.\n\nThats some fun new information to unpack while on vacation.",
                                    "score": 11,
                                    "author": "MissAcedia",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Internalized pain and assuming everyone suffered in the same way growing up is a powerful defense mechanism. Don't feel bad about what you experienced or that your normal is different than your partners normal. In many cases were all unpacking things. Love yourself and let the hurt others caused you be a reflection of their pain, not your character.",
                                            "score": 4,
                                            "author": "small3687"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "With no context, I'm not going to assume anything. But if the kid was told repeatedly don't aim/shoot anyone with that in the face, then he does it and laughs about it, I could see this as possibly justified.",
                            "score": 11,
                            "author": "CrazyTillItHurts"
                        },
                        {
                            "level": 2,
                            "comment": "Nothing warrants being destructive… My dad destroyed all my VHS tapes (no cable) when I was younger &amp; I literally don’t remember him being mad at me, I think it was actually my mom. I had nothing to watch anymore after that. I was an only kid who was being raised by my grandparents who did t really play with me &amp; I had very little toys.",
                            "score": 4,
                            "author": "iBeFloe"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Poor parents weaponizing toys they bought you. Fucking sucks.",
                    "score": 13,
                    "author": "Pancakez9",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well, it is a toy gun.",
                            "score": 6,
                            "author": "admins69kids"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This was me but with OCD which made it worse",
                    "score": 6,
                    "author": "the-other-car"
                },
                {
                    "level": 1,
                    "comment": "I would have bought him a new one 🥺 Dat was fucked up!",
                    "score": 4,
                    "author": "Mission_Strength9218"
                },
                {
                    "level": 1,
                    "comment": "What happen, did you deserve your toy being destroyed or something else?",
                    "score": 2,
                    "author": "MDragonAce2",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was too young to have any of this justified. I don't remember what I Was doing.",
                            "score": 2,
                            "author": "ex-big_bag_of_dicks"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I hear you about being dirt poor and toys.\n\nIf you were like me, you made a lot of your own. Cardboard, tape, paper towel rolls, crayons, pens, papers, wire coat hangers, etc. That's what I made my toys with.",
                    "score": 2,
                    "author": "Commercial-Ad-852",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I read and drew. I got really good at both.",
                            "score": 3,
                            "author": "ex-big_bag_of_dicks"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Man poor kid makes me wanna give him a new one",
            "score": 445,
            "author": "moldyshrimp",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same, but potentially wouldn't be allowed to keep it. Who knows if that was his Mom/Step Mom?",
                    "score": 108,
                    "author": "CosmicGlitterCake",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Idk it’s not going to happen but I wish I could. I remember when I was a kid this person saw my ripstick on the side of the road, and purposely swerved over to run over it. Man it’s just a shitty feeling when you love something as a kid and it’s destroyed in front of your eyes. Even if he does get another one this could have been his favorite one or such.",
                            "score": 53,
                            "author": "moldyshrimp"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I don’t agree with this style of parenting (smashing things to scare) but the child might have been using it to hurt or intimidate a younger child and that is why she smashed it. She should of donated it.",
                    "score": 3,
                    "author": "PreciousPeridotNight"
                }
            ]
        },
        {
            "level": 0,
            "comment": "that makes me so sad. Brought me back to when I owned nerf guns at his age, or any toy for the matter. The act itself would've broken me, even if it's replaceable",
            "score": 1264,
            "author": "Berinchtein3663",
            "replies": [
                {
                    "level": 1,
                    "comment": "She hit him with “emotional damage”",
                    "score": 135,
                    "author": "PlayfulConference732",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s super effective!",
                            "score": 36,
                            "author": "DemonInPinkk",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Almost worse then physical , because you remember long after the pain",
                                    "score": 22,
                                    "author": "PlayfulConference732",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "low Sp. Def",
                                            "score": 10,
                                            "author": "DemonInPinkk"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Theres a lot going on here, like whats the context lol",
            "score": 684,
            "author": "LoungeChair98",
            "replies": [
                {
                    "level": 1,
                    "comment": "Exactly .\nAll I can see is someone slamming the kids toy down ,probably out of a temper tantrum.\nHell if I know 😂😂.",
                    "score": 330,
                    "author": "SnooPineapples5719",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think the parents were arguing and one took it out on the kid",
                            "score": 120,
                            "author": "Gold_Duckzilla"
                        },
                        {
                            "level": 2,
                            "comment": "Who's temper tantrum here?",
                            "score": 20,
                            "author": "Uberrancel"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Uncivilised people doing uncivilised things is the context im understanding",
                    "score": 20,
                    "author": "hailovenchicken8",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Why are you being downvoted ???? To be honest your actually being polite I mean what else would you call grown adults fighting and not to mention a grown women breaking a child’s toy wtf ???!!",
                            "score": 12,
                            "author": "IndependentDoor6065",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No clue, but I've clearly hurt some feelings",
                                    "score": 8,
                                    "author": "hailovenchicken8"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "In an alcohol-fuelled fit of rage over some stupid bullshit, my father threw my Nintendo DS against the wall less than a month after I bought it. It didn't break so he stomped it repeatedly. I had the same reaction as this boy. I had saved for months and sold other games to buy it. It's just one of the many reasons he's dead to me.",
            "score": 57,
            "author": "TheFlamingoid",
            "replies": [
                {
                    "level": 1,
                    "comment": "what were the other many reasons?",
                    "score": 13,
                    "author": "chuckiebanned26",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He was a drunk, used to beat me up, spent the money my mother saved for my sister and I to study in university, etc. Eventually, he ran away with a woman who was also married. Later he shamelessly came back to me and asked me for cash. At the time I was super broke as I had to work part time at KFC while doing my B.A. The man has no dignity.",
                            "score": 33,
                            "author": "TheFlamingoid",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Did you at least punch the guy in the chin?",
                                    "score": 5,
                                    "author": "Olivia_Richards"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s ~~nerf or~~ nothing",
            "score": 304,
            "author": "RichEvans4Ever",
            "replies": [
                {
                    "level": 1,
                    "comment": "```\nif(its != \"Nerf\"){\n its = null\n};\n```",
                    "score": 205,
                    "author": "driftking428",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Take my fucking upvote.",
                            "score": 22,
                            "author": "cringebed"
                        },
                        {
                            "level": 2,
                            "comment": "Imagine writing `;` after if statements but not after the usual statements",
                            "score": 7,
                            "author": "KotoWhiskas",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm not entirely sure, but I think it's valid in rust (at least the `};` part)",
                                    "score": 5,
                                    "author": "TheBomber808",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "its not about being valid, its about being predictable... ^/s ^but ^not ^really",
                                            "score": 2,
                                            "author": "TecDeveloper"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The song in the background is the most repulsive song I have ever heard.",
            "score": 684,
            "author": "MightyIsBestMCPE",
            "replies": [
                {
                    "level": 1,
                    "comment": "How are they not sick of that song after all these years...",
                    "score": 256,
                    "author": "SofiaOfEverRealm",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I ask myself that with every new tik tok i see with this soundbite in 2023",
                            "score": 96,
                            "author": "Peterthecoll"
                        },
                        {
                            "level": 2,
                            "comment": "The song caused this hateful situation",
                            "score": 58,
                            "author": "murunbuchstansangur"
                        },
                        {
                            "level": 2,
                            "comment": "Low IQ. There are studies that people with low IQ like repetition due to a severe lack of creativity. That's why you see videos of trashy people shouting the same insults over and over again in their stupid rage.",
                            "score": 75,
                            "author": "TheOnlyPun",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "IQ scores are a pseudoscience that has very little credibility over how people behave or what they like",
                                    "score": -14,
                                    "author": "LORD_KILLFUCK",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I actually agree but my comment still stands.",
                                            "score": 25,
                                            "author": "TheOnlyPun",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "This is so incredibly false. It’s the #1 predictor of work success, it’s also a predictor of life expectancy, life and school success through healthy behaviors, etc. What’s more, the effects of IQ on the trajectory of a persons life is becoming more profound as the wages and demand for low skilled labor stagnate and decline. \n\nThis is not meant to shame low IQ people by the way. But to ignore the very well-researched links between IQ and life outcomes actually hurts those with low IQ more because it causes people to believe that we don’t have to do anything to help and support them. \n\nBeing flagrantly wrong in this case is actually harmful to the very people you’re probably intending on protecting.",
                                            "score": 7,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Alvin and the Chipmunks",
                            "score": 15,
                            "author": "bogvapor"
                        },
                        {
                            "level": 2,
                            "comment": "Most people on that shitty app are kids. Kids dont care.",
                            "score": 5,
                            "author": "Tipsy_Corgi"
                        },
                        {
                            "level": 2,
                            "comment": "I am old. I can't parse out the song amongst the commotion. Which song is it?",
                            "score": 5,
                            "author": "st_elmo_theconfessor",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "tiktok song that's on every video",
                                    "score": 7,
                                    "author": "GodsIWasStrongg"
                                },
                                {
                                    "level": 3,
                                    "comment": "Originally, it's \"Remember\" by the Shangri La's. It's been completely butchered.",
                                    "score": 3,
                                    "author": "solsticefaerie"
                                },
                                {
                                    "level": 3,
                                    "comment": "Is it possible to learn this power?",
                                    "score": 2,
                                    "author": "SofiaOfEverRealm"
                                },
                                {
                                    "level": 3,
                                    "comment": "Some garbage. I'm old too; we're better off without it.",
                                    "score": 2,
                                    "author": "Help_An_Irishman"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Didn’t even have to unmute to know exactly which song you were talking about.",
                    "score": 20,
                    "author": "schnitzel_envy"
                },
                {
                    "level": 1,
                    "comment": "It's that one isn't it",
                    "score": 11,
                    "author": "Anakronistick"
                },
                {
                    "level": 1,
                    "comment": "Its like they are mocking the poor kid for having a toy he loved destroyed by using that song.",
                    "score": 6,
                    "author": "Zorbie"
                },
                {
                    "level": 1,
                    "comment": "It's even worse than the one that redditor fucked to the rythm of",
                    "score": 4,
                    "author": "NihilFR",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah... if you could provide some context to that, that'd be great.",
                            "score": 1,
                            "author": "DominionGhost",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This song sucks balls",
            "score": 194,
            "author": "Volume-Huge",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's whatever if only it wasn't shoved down our throats for the 6 billionth video.  It didn't bother me the first 100-1000 times, but now I want to go back in time to murder the artist.",
                    "score": 38,
                    "author": "GodsIWasStrongg",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Kids learn from their surroundings. So….",
            "score": 124,
            "author": "T_in_Lousiana"
        },
        {
            "level": 0,
            "comment": "TikTok ban can’t come soon enough.",
            "score": 80,
            "author": "fractal-phoenix",
            "replies": [
                {
                    "level": 1,
                    "comment": "That will unfortunately never happen.  It’s too big in the us",
                    "score": 5,
                    "author": "effinx",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "people dont need tiktok to be shitty",
                    "score": 5,
                    "author": "dogtoes101"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Downvote for song",
            "score": 83,
            "author": "SmartestMonkeyAlive"
        },
        {
            "level": 0,
            "comment": "Some people just need to live in chaos.",
            "score": 32,
            "author": "Weekend_Squire"
        },
        {
            "level": 0,
            "comment": "He started a turf war, obviously",
            "score": 91,
            "author": "Tiyath",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nerf* War",
                    "score": 44,
                    "author": "HaventSleptin8Days",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Damn, it was *right there*",
                            "score": 23,
                            "author": "Tiyath",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You shouldn't have said anything. It's nerf or nothing",
                                    "score": 6,
                                    "author": "FearlessHamster4486"
                                },
                                {
                                    "level": 3,
                                    "comment": "I had to read it twice to make sure you hadn't screwed the pooch but yep, you done fucked up.",
                                    "score": 6,
                                    "author": "Tinfoilhatmaker"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Growing up poor I treasured anything that was bought for me like that, to have it destroyed would been devastating.",
            "score": 7,
            "author": "clayb57"
        },
        {
            "level": 0,
            "comment": "I feel this kid's pain. I wasn't allowed toys, while my younger siblings got whatever they wanted, so I was over the moon when I got a stuffed animal for my birthday one year. But then a few days later, it had been taken from my room, and I found it with its head torn off. I was devastated. I know this all sounds terrible, but I appreciate everything I have, while my siblings appreciate nothing, so I'm grateful for my experiences.",
            "score": 7,
            "author": "UnkhamunTutan"
        },
        {
            "level": 0,
            "comment": "I would like to, again, call for a sub for videos, usually pointlessly, still using the awful \"nonononono\" song after literally years and a good amount of people hating every second of it",
            "score": 51,
            "author": "BillyBabushka",
            "replies": [
                {
                    "level": 1,
                    "comment": "I watch TikTok on mute, only turn the sound on if something looks interesting. I also mute porn.",
                    "score": 6,
                    "author": "OpheliaMorningwood",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Kids can't buy new toys as they have no financial independence... this was cruel",
            "score": 97,
            "author": "orcaniums",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Dad made me a sword out of wood, was really my only toy for a while. One of my better off \"friends\" called it cheap a snapped it. Cried for a bit over that.",
            "score": 20,
            "author": "IndividualEnd3830"
        },
        {
            "level": 0,
            "comment": "I fucking HATE that song! I hate everything about that and I hate how it is used! People be like: \"oh yeah that is a good song to use\" but IT IS NOT YOU FUCKING [I don't want to get banned]! There is no reason for it to fucking exists and I will reather commit [I don't want to get banned] so my ears don't have to feel the horrible Vibrations of this FUCKING STUPID SONG anymore!",
            "score": 112,
            "author": "Regainio",
            "replies": [
                {
                    "level": 1,
                    "comment": "I hear you. I am sooOOoo tired of this song.",
                    "score": 23,
                    "author": "KrankySilverFox"
                },
                {
                    "level": 1,
                    "comment": "I think thought I was the only one. Thank God I'm not",
                    "score": 8,
                    "author": "Racer13l"
                },
                {
                    "level": 1,
                    "comment": "Why would you “get banned”?",
                    "score": 3,
                    "author": "HanYoloswagalicious",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Hey, it’s okay man. Everything else alright?",
                    "score": 22,
                    "author": "Audderpop373",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yep, thank you for asking😀",
                            "score": 9,
                            "author": "Regainio"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I watched this muted at first, then turned on the sound, hoping to get some context for the situation… only to hear that stupid song instead.",
                    "score": 2,
                    "author": "theseedbeader"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Idk why but I can hear the half life suit life line beeping when he fell over",
            "score": 15,
            "author": "ChezBe"
        },
        {
            "level": 0,
            "comment": "How many times will this be reposted. Each time encrusted with more and more TikTok cancer.",
            "score": 11,
            "author": "fractal-phoenix"
        },
        {
            "level": 0,
            "comment": "Why did the woman come out of the car with her tiddies out lmao",
            "score": 8,
            "author": "SlippyBoy41"
        },
        {
            "level": 0,
            "comment": "That kid is doomed",
            "score": 11,
            "author": "Was_going_2_say_that"
        },
        {
            "level": 0,
            "comment": "What a complete effin B!!    \nThis just breaks my heart, poor little guy.   \n\n\nRegardless of what he's done, her reaction is unacceptable.    \nTake it away, sure.  But don't smash the thing.",
            "score": 18,
            "author": "L3xusLuth3r"
        },
        {
            "level": 0,
            "comment": "I usually hate this song, but somehow you completely topped my hatred of the use of this song. \n\nIt literally makes no sense in this context and warrants an immediate downvote from me. Sorry bud. Better luck next time.",
            "score": 16,
            "author": "Stargatemaster",
            "replies": [
                {
                    "level": 1,
                    "comment": "Please forgive me for father I have sinned",
                    "score": 1,
                    "author": "Upset-Biscotti-1598",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Straight to jail",
                            "score": 3,
                            "author": "Stargatemaster"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "He was raised with unhinged people?",
            "score": 5,
            "author": "1dumho",
            "replies": [
                {
                    "level": 1,
                    "comment": "And who do you think those unhinged people were raised by? It’s an inescapable cycle that’s taken hold in America.",
                    "score": 5,
                    "author": "fractal-phoenix",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "People don't know how to use this stupid song do they",
            "score": 8,
            "author": "dr_jock123"
        },
        {
            "level": 0,
            "comment": "I don't care what the kid did, this is fucked up",
            "score": 8,
            "author": "Brontolope11",
            "replies": []
        },
        {
            "level": 0,
            "comment": "He’ll be back with a real one in a few years give or take",
            "score": 4,
            "author": "veritas_rex"
        },
        {
            "level": 0,
            "comment": "Ew god damnit this video makes me nauseous",
            "score": 2,
            "author": "ODB-77"
        },
        {
            "level": 0,
            "comment": "I would assume people would’ve stopped using this horrid tik tok sound, after witnessing the maimed bodies of their peers. Looks like I’m owed another pound of flesh. Matters not to me where on your anatomy it is withdrawn from.",
            "score": 2,
            "author": "nardwar_"
        },
        {
            "level": 0,
            "comment": "Get used to it kid. Don’t let women see you happy, this is exactly what happens.",
            "score": 2,
            "author": "Notorious_nico2020"
        },
        {
            "level": 0,
            "comment": "Can tiktok mfs leave the most annoying song ever created out of a video for five fucking seconds",
            "score": 2,
            "author": "Earthbender32"
        },
        {
            "level": 0,
            "comment": "He was born into that environment, poor kid doesn’t have a chance when he’s around those fools.",
            "score": 2,
            "author": "Jojododo8"
        },
        {
            "level": 0,
            "comment": "Born into unfortunate circumstances is what happened to the poor kid",
            "score": 2,
            "author": "Chance_McM95"
        },
        {
            "level": 0,
            "comment": "Down vote because of that fucking song.",
            "score": 4,
            "author": "DoctorWH0877"
        },
        {
            "level": 0,
            "comment": "$45 down the drain :(",
            "score": 6,
            "author": "JarlWheezer",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Bad parenting. Confiscate the toy, no need to break it. You spent hard earned money on that. However, she was clearly enraged, and was probably not in the right state of mind. Probably needs a Snickers.",
            "score": 9,
            "author": "DevoutWorshipper"
        },
        {
            "level": 0,
            "comment": "That memory will live with that kid for life, had something like that happen to me with airsoft gun, 14 years on I still remember it.",
            "score": 4,
            "author": "TheGrandEzz"
        },
        {
            "level": 0,
            "comment": "Kid, learn to do everything opposite of your community or get used to disappointment.",
            "score": 8,
            "author": "Substantial_Ad_6311"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 8,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "A meanie",
                    "score": 6,
                    "author": "brin_shut",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s this type of behavior directed at children (of any race) that turns them into criminals. Love your children, so not disrespect children like that.",
            "score": 3,
            "author": "Bakedpotato46"
        },
        {
            "level": 0,
            "comment": "Lots to unpick here.",
            "score": 2,
            "author": "Electronic-Trip8775"
        },
        {
            "level": 0,
            "comment": "The internet needs to ban that sound",
            "score": 2,
            "author": "_Harpic"
        },
        {
            "level": 0,
            "comment": "Caught in the crossfire of trashy adults.",
            "score": 2,
            "author": "Muny30"
        },
        {
            "level": 0,
            "comment": "Issa fckn wrap for everyone who’s of age in the vid. Throw the whole group tf away. The kids have already been failed. Hard. I can only hope that for a few of them, they cross paths with someone who can be a mentor",
            "score": 2,
            "author": "KhloesOriginalFace"
        },
        {
            "level": 0,
            "comment": "Casualty of war",
            "score": 2,
            "author": "Orange-laddy"
        },
        {
            "level": 0,
            "comment": "Wasn't a cool way to go about it.  But I remember having to go close fire hydrants that were illegally opened and kids shooting at me with super soakers and at people driving by with open windows.  Maybe something like that happened here.",
            "score": 3,
            "author": "ZappaZoo"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "***NO RACISM/HATE SPEECH/BIGOTRY/IDIOTIC RACE BAITING***\n*************\nNo racism, homophobia, transphobia, or other bigotry. If they're a piece of shit, you don't need to bring their whole demographic into it.",
                    "score": 5,
                    "author": "iamatotalpieceofshit-ModTeam"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That poor baby. This kills me. What a total b¡tch she is.",
            "score": 2,
            "author": "Skullmonkey11"
        },
        {
            "level": 0,
            "comment": "Reject humanity, return to tribe.",
            "score": 0,
            "author": "SolarFusion90"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -8,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Probably just gonna give him a real one now",
            "score": -13,
            "author": "dizzy_nixx",
            "replies": []
        },
        {
            "level": 0,
            "comment": "When you bring a nerf gun to a real gun fight.",
            "score": 1,
            "author": "FreakyTongue35"
        },
        {
            "level": 0,
            "comment": "Facinating behavior.",
            "score": 1,
            "author": "AegisOfTheCrusade",
            "replies": [
                {
                    "level": 1,
                    "comment": "nerdy ass why you gotta say that 😭",
                    "score": 2,
                    "author": "Kaiser1478"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Maybe he pissed in the super soaker",
            "score": -4,
            "author": "Traveledbore",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I wish I could relate to these experiences personally but man this must be devastating",
            "score": 1,
            "author": "Talerthegamer"
        },
        {
            "level": 0,
            "comment": "It's a rule in my family that if you point a toy gun at someone it gets taken away. My dad used to actually get his broken in half when he was little.",
            "score": 1,
            "author": "CovidLvr69"
        },
        {
            "level": 0,
            "comment": "Who else expected him to take his revenge",
            "score": 1,
            "author": "MaxGamer07"
        }
    ]
}