{
    "id": "10rjax2",
    "score": 1764,
    "title": "Driver hits cyclist, then assaults him",
    "author": "gcz1214",
    "date": 1675320507.0,
    "url": "https://www.reddit.com/r/iamatotalpieceofshit/comments/10rjax2",
    "media_urls": [
        "https://i.redd.it/h7l4s290krfa1.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\nPlease note that we will ban you if a post or comment breaks any of our rules. **Be especially mindful of the following**:\n\n**Rule 1: Do not post or ask for identifying information, including first and last names and social media usernames.** Public figures are **not** exempt. We remove all external links to prevent accidental posting of identifying information.\n\n**Rule 2: Do not post violent comments, and do not glorify violence, per TOS.** We can't take responsibility for how angry a post makes you, you need to do that. Telling us \"it was a joke bro\" is not an excuse.\n\n**Rule 7: Do not link to or post screenshots of reddit posts, reddit comments, reddit personal messages, reddit profiles, etc.** We cannot allow you to use this subreddit to harass other people on reddit. \n\n**Rule 8: No bigotry, no racism or race baiting.** It is hard to believe that we even need a rule like this. \n\n**Our rules are zero tolerance. You will be banned for breaking them.**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/iamatotalpieceofshit) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Soooo… murder",
            "score": 174,
            "author": "eherqo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Seems like it, well if the car didn't finished the job, he took the matter into his own hands with a knife apparently. The world we live in...  :smh.",
                    "score": 36,
                    "author": "zaplayer20",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah that’s my thinking",
                            "score": 11,
                            "author": "eherqo"
                        },
                        {
                            "level": 2,
                            "comment": "This is why I believe that there are not a lot of good people out there, there are so many bad people in the world that it’s almost impossible to find a good person.",
                            "score": 2,
                            "author": "MDragonAce2",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think there are a lot of good people, it's just that you won't find the perfect person. I also know that there is trial and error process on entrusting your faith into one, without trying, you won't be able to see if that person is good or wrong.",
                                    "score": 2,
                                    "author": "zaplayer20"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "He wasn't just \"assaulted\" he was stabbed!",
            "score": 127,
            "author": "Cynical_Satire",
            "replies": [
                {
                    "level": 1,
                    "comment": "Isn't that just a form of being assaulted?",
                    "score": 8,
                    "author": "Gus_Harrington",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You mean like \"assault\" with a deadly weapon?  Because that crime becomes murder when they die.",
                            "score": 16,
                            "author": "Subject_Journalist",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not really. It could be manslaughter.",
                                    "score": -13,
                                    "author": "Gus_Harrington",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "manslaughter means kind of like an accident, and that's out the window when you stab someone.",
                                            "score": 21,
                                            "author": "Subject_Journalist",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yes,ma'am you are correct! So you would have to prove that the driver intended to kill the cyclist. They may have just meant to cause bodily harm.",
                                                    "score": -5,
                                                    "author": "Gus_Harrington",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "That would bump it back up to murder 2\n\nMalice aforethought\n\nEdit: spelling",
                                                            "score": 4,
                                                            "author": "someguyinvirginia",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "So fucking stupid. Malice aforethought was done away with in the 19th century and is a British colonial term.\n\nMens Rea you goon. \n\nThere’s no way to prove anything you are saying based off of anything in this video or new report. You’re guessing.",
                                                                    "score": -2,
                                                                    "author": "scottygoesfar"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Guess again lady.",
                                                                    "score": -1,
                                                                    "author": "Gus_Harrington",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Lmfao.... Such weak energy",
                                                                            "score": 1,
                                                                            "author": "someguyinvirginia",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Say what?",
                                                                                    "score": 0,
                                                                                    "author": "Gus_Harrington",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Pretty sure hitting someone with a car and then stabbing them rules out any intention of harming. The moment you use anything other than your fists, and ESPECIALLY something that can stab a person who is more than likely incapacitated if not already at death's door, there is borderline 0 chance there was only intent of physical harm, or they would have stopped at the car. The moment you actively push beyond reasonable limitations of survival, you are actively causing another person to die. Whether or not you meant to stop within an inch of their life or not, you put their life, with full intent, to the brink. There is no accident or question of doubt that the amount done here had a high likelihood of causing death, and that would either classify as attempted or successful murder",
                                                            "score": 1,
                                                            "author": "Rojibeans",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "You are making a few assumptions here eh? How do you know that the cyclist was incapacitated? How do you know the cyclist didn't get lippy or aggressive after being struck? Where did the cyclist get stabbed? \n\nBy no means am I siding with the driver all I am saying is a murder conviction would be unlikely and it would probably come down to manslaughter.",
                                                                    "score": 1,
                                                                    "author": "Gus_Harrington",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Play devil's advocate with a situation you actually have a chance of proving your stance right\n\nIf you hit someone and they are understandably upset, the most dumbshit unreasonable thing to do is stab them. Anyone who reacts that way was never sane to begin with",
                                                                            "score": 1,
                                                                            "author": "Rojibeans",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "&gt;the most dumbshit unreasonable thing to do is stab them\n\nBut what if it is in self-defense? \n\nThe question of sanity is irrelevant. The question is would it be murder?",
                                                                                    "score": 1,
                                                                                    "author": "Gus_Harrington",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "BRO whats so hard to understand about STABBING SOMEONE.",
                                            "score": 4,
                                            "author": "ListenHereIvan",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Nothing, funny question to ask.",
                                                    "score": -4,
                                                    "author": "Gus_Harrington"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "He was peppered with stab wounds. Not a salt.",
                            "score": 13,
                            "author": "HRzNightmare"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That is ‘aggravated assault’.",
                    "score": 2,
                    "author": "scottygoesfar",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Except they died. So murder",
                            "score": 6,
                            "author": "NightmareKingGrimm",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not how a murder charge works.",
                                    "score": -9,
                                    "author": "scottygoesfar",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Then what is it. The legal definition of aggravated assault applies to cases where the victim doesn’t die.",
                                            "score": 6,
                                            "author": "NightmareKingGrimm",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It could be homicide or manslaughter. Murder usually requires premeditation(not just intent in the moment)",
                                                    "score": 1,
                                                    "author": "maz-o",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Second degree murder does not not require premeditation,  just intent to kill",
                                                            "score": 1,
                                                            "author": "Komischaffe"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "They could have died from the car accident…..\n\nIn which case, they didn’t die from being stabbed. Murder is charged depending on intent. You can read the requirements yourself.",
                                                    "score": -13,
                                                    "author": "scottygoesfar",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "But he was stabbed, meaning the intent was there.",
                                                            "score": 6,
                                                            "author": "HeroponOfTheNoponis",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "That’s not how intent is qualified.",
                                                                    "score": -2,
                                                                    "author": "scottygoesfar",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "The driver rammed him, got out of the vehicle, then proceeded to stab the cyclist to death. I don’t know how that doesn’t show intent to murder.",
                                                                            "score": 3,
                                                                            "author": "antlered-fox",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "I mean, you could just look up what intent to murder requires…. Then you would know verse just guessing what you think it is. \n\nImagine that… effort. \n\nYou’re also assuming facts not in any video or news report. \n\nYou can’t say he was stabbed to death because you don’t know.",
                                                                                    "score": -3,
                                                                                    "author": "scottygoesfar",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Once again, opposite of correct",
                                                                            "score": 2,
                                                                            "author": "someguyinvirginia",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "And yet, you haven’t provided anything to the contrary..",
                                                                                    "score": -2,
                                                                                    "author": "scottygoesfar",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "You are exactly wrong",
                                            "score": 2,
                                            "author": "someguyinvirginia",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You are exactly stupid.",
                                                    "score": 0,
                                                    "author": "scottygoesfar"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Cyclist dies after being murdered by driver",
            "score": 235,
            "author": "i_am_the_soulman",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was going to say that the headline was an odd way to say murdered",
                    "score": 54,
                    "author": "Thats_what_im_saiyan"
                },
                {
                    "level": 1,
                    "comment": "Calling somebody a murderer in print before they've even had a trial is a great way to get sued if they beat the case or get the charge downgraded to manslaughter",
                    "score": 18,
                    "author": "Kuntecky",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "you don't get manslaughter for stabbing and killing someone",
                            "score": 3,
                            "author": "-__--_------",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ok Mr. Reddit Judge",
                                    "score": 3,
                                    "author": "Kuntecky",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "when has someone ever stabbed someone to death and gotten manslaughter? If he had killed the person with their car then maybe you have a case for it... but there is a whole category of homicide dedicated to in the moment killings, its called 2nd degree murder. The defence will claim that he didn't mean to kill the person and that the defendant 'lost control', but they stabbed them with a deadly weapon after already hitting them with their car, and that will always qualify as intentional.",
                                            "score": 2,
                                            "author": "-__--_------"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wow, doubled down and gonna spend a lot of time in the clink for it, wonder if it was worth it…",
            "score": 21,
            "author": "ElefantPharts"
        },
        {
            "level": 0,
            "comment": "So the driver hit the cyclist while he was stopped at a red light. He then got out and stabbed him. Not known yet if a road rage incident or if the 2 were known to each other.",
            "score": 22,
            "author": "nms_Rozz"
        },
        {
            "level": 0,
            "comment": "So basically the man went to jail for vehicular murder?",
            "score": 18,
            "author": "C__Driveerror1",
            "replies": [
                {
                    "level": 1,
                    "comment": "No, the murder was with a knife.",
                    "score": 9,
                    "author": "pilesofcleanlaundry",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No it was Witherspoon.",
                            "score": 9,
                            "author": "DOLCICUS",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Want some Reese with that?",
                                    "score": 3,
                                    "author": "SweetRandomID"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "No, I don't know if that actually exists.",
                    "score": 0,
                    "author": "Gus_Harrington"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What a soft way to title this story about a cyclist being murdered with a vehicle and a knife",
            "score": 43,
            "author": "Borp5150",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s so the publication doesn’t get sued before it goes to court",
                    "score": 5,
                    "author": "Garry_the_idiot",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Is that a thing? Damn. \n\nStill, weird use of passive / active language. “Car hits cyclist, proceeds to assault him” would convey the story better imo",
                            "score": 1,
                            "author": "TheKgbWillWaitForNo1"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This was racially motivated according to what witnesses are saying. Tragic loss of an MD who would have probably tried to save the life is someone stabbed the suspect. RIP",
            "score": 12,
            "author": "bbmedore"
        },
        {
            "level": 0,
            "comment": "My god…that’s horrible",
            "score": 8,
            "author": "2005CrownVicP71"
        },
        {
            "level": 0,
            "comment": "if you ride a bike, you quickly learn how many drivers not only hate you but will *actively try to kill you* for daring to ride a bike on the road",
            "score": 7,
            "author": "flannyo"
        },
        {
            "level": 0,
            "comment": "Poor person.",
            "score": 3,
            "author": "Giggingurl",
            "replies": [
                {
                    "level": 1,
                    "comment": "No poor joke…",
                    "score": 0,
                    "author": "Analytical-BrainiaC",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What are you referring to?",
                            "score": 1,
                            "author": "Giggingurl"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Did anybody else click on the play button?",
            "score": 3,
            "author": "Gus_Harrington"
        },
        {
            "level": 0,
            "comment": "Let's not forget about the hate crime.",
            "score": 3,
            "author": "MrEmptyGlass1"
        },
        {
            "level": 0,
            "comment": "Routine traffic stop?",
            "score": 6,
            "author": "nostracannibus"
        },
        {
            "level": 0,
            "comment": "Investigators learned that Mammone had been riding his bicycle northbound on the scenic Pacific Coast Highway when he was hit from behind by a vehicle. The driver -- identified as 39-year-old Vanroy Evan Smith, of Long Beach -- then got out of the car and \"assaulted Mammone with a knife,\" the sheriff's department said.\n\nThe moment of impact was captured on video by a Ring doorbell camera mounted in front of a nearby home, KABC reported.\n\nWhen deputies arrived on scene, Smith was being detained by bystanders. He was subsequently taken into custody and booked into the Orange County Jail on suspicion of murder, according to the sheriff's department.\n\nA cyclist died on Thursday, Feb. 2, 2023, after being struck by a car in Dana Point, Calif., and then stabbed to death by the driver, authorities said.KABC\n\nA knife believed to be used in the alleged assault was recovered from the scene, the sheriff's department said. The incident is being investigated by the Orange County Sheriff's Department Homicide Detail.\n\n\"At this time, there is no known connection between the suspect and the victim,\" the sheriff's department added. \"Investigators will work to determine what led to this incident.\"",
            "score": 2,
            "author": "Richard_Ansley"
        },
        {
            "level": 0,
            "comment": "When are we ready to start holding mandatory or somewhat of a requirement, for proof of a physician and a psychiatrist/psychologist evaluation every so often to minimize totally unstable and insane ppl who are accountable and away from harming others in all forms of violence. Accident or not I’m bummed to see ppl just go to jail for devastating actions ruining ppls lives and the ones left here to deal with what a complete stranger committed against there loved ones!!\n\nSomething has to happen this is insane. With wealthy/successful doctors jumping there Tesla off a cliff in broad daylight, filled with there children and wife hoping to kill everyone cause there so mentally unwell can possibly be prevented if some type of accountability system is implemented soon!! Forget ppls rights if your a solid loving human like I hope most of us then there is nothing to hide and we should be more than willing to be evaluated and provide proof or proper documentation that we are within the mental parameters to be apart of this society and ok to operate literally a big metal block that weighs 1500 lbs -10k pounds, which is also moving at a high velocity rate of unnatural speed around other dangerous blocks of metal like NBD!! \n\nWe’re witnessing some dark times with horrible events that the media and others have purposely normalized detrimental situations daily without no remorse or care in the world. As long as they can stay and increase there own personal financial gain….. the list goes on and on. We want to live peacefully and lovingly here on earth. Help keep good ppl safe and cared for.",
            "score": 1,
            "author": "DigitvlBvth"
        },
        {
            "level": 0,
            "comment": "Poor cyclist, I hope the driver was arrested. I just don't understand why he would go out of his way and assault him on top of what he did.\n\nDid anyone else try to click play on the vid?",
            "score": -13,
            "author": "explosivetampon",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 8,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That doesn't mean when you first see it you can't click play. It is just a reaction.",
                            "score": 2,
                            "author": "Gus_Harrington"
                        },
                        {
                            "level": 2,
                            "comment": "I'm sorry I didn't know it was a screenshot at first, it only took me a few seconds to figure it out.",
                            "score": -17,
                            "author": "explosivetampon"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I totally tried to click play",
                    "score": 2,
                    "author": "Ok_Kaleidoscope2076"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Zombie Land Rule #2",
            "score": 1,
            "author": "xxTHExxG3RMANxx"
        },
        {
            "level": 0,
            "comment": "So you ran someone over…..and your immediate response is to stop and beat the remaining life out of them for denting the car…….why do so many people kill for petty reasons?",
            "score": 1,
            "author": "Redditgreninja"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -24,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "can't wait to see the post on this sub dedicated to you, scumbag",
                    "score": 15,
                    "author": "HelicopterCrashScene",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Stay on the bike path nerd",
                            "score": -25,
                            "author": "mogreen57",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "you mean just like the guy in the article above that \"had it coming\"?\n\ngo take a walk",
                                    "score": 10,
                                    "author": "HelicopterCrashScene"
                                },
                                {
                                    "level": 3,
                                    "comment": "I know eh?",
                                    "score": -4,
                                    "author": "Gus_Harrington"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "He had being murdered coming, just because he rode a bike on the road? \n\nWhat a sane reasonable thing to think. You're obviously very well-adjusted.",
                    "score": 5,
                    "author": "BurpingHamBirmingham",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Dis why i bicycle armed.... Won't hesitate to use the hole puncher 9000",
                            "score": 1,
                            "author": "someguyinvirginia"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I know eh?",
                    "score": -4,
                    "author": "Gus_Harrington"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Rumor is that it was a drug deal in a nearby parking lot that the car driver didn’t like how went down and then ran him over after.",
            "score": -1,
            "author": "G8oraid",
            "replies": [
                {
                    "level": 1,
                    "comment": "Where is this rumor coming from? This is the only place I've heard this. I know it's hard to believe, but many drivers are one bad moment away from entering into a manic road rage incident. Some people are on edge, and having any little incident inconvenience their moment of calm within their metal box is enough to set them off. These unprovoked incidents happen.",
                    "score": 2,
                    "author": "shagyubeef",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah..... I have ridden a bicycle in traffic.... Definitely doesn't need to be anything else going on here",
                            "score": 1,
                            "author": "someguyinvirginia"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Obviously the man committed murder.  Have any of you ever driven around this area on the west coast?  Their a hell of a lot of cyclist on the roads.  The law states they are allowed to use those road.  However, they are supposed to abide by laws too and often they don’t by riding side by side.  Cops try to ticket them, but many of them are doctors and lawyers and just skirt the law.  Causing traffic jams and just generally kissing people off.  The cities and the state have failed to upgrade the roads to better account for increased bicycle traffic.  This is no surprise to me.  I’m surprised it doesn’t happen more often actually.",
            "score": -1,
            "author": "[deleted]"
        }
    ]
}