{
    "id": "10svgbq",
    "score": 5584,
    "title": "Norridgewock, ME: Evidently, it's OK for dogs to spend -20°F/-50°F wind chill out like this. Coincidentally, Maine Animal Welfare's not been answering its phones this week. (They hung up on reports when this happened last year.)",
    "author": "archilchimes",
    "date": 1675458820.0,
    "url": "https://www.reddit.com/r/iamatotalpieceofshit/comments/10svgbq",
    "media_urls": [
        "https://v.redd.it/a670q8m9g1ga1"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\nPlease note that we will ban you if a post or comment breaks any of our rules. **Be especially mindful of the following**:\n\n**Rule 1: Do not post or ask for identifying information, including first and last names and social media usernames.** Public figures are **not** exempt. We remove all external links to prevent accidental posting of identifying information.\n\n**Rule 2: Do not post violent comments, and do not glorify violence, per TOS.** We can't take responsibility for how angry a post makes you, you need to do that. Telling us \"it was a joke bro\" is not an excuse.\n\n**Rule 7: Do not link to or post screenshots of reddit posts, reddit comments, reddit personal messages, reddit profiles, etc.** We cannot allow you to use this subreddit to harass other people on reddit. \n\n**Rule 8: No bigotry, no racism or race baiting.** It is hard to believe that we even need a rule like this. \n\n**Our rules are zero tolerance. You will be banned for breaking them.**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/iamatotalpieceofshit) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "My landlord here in Uzbekistan said he would kick me to the streets if my dogs came inside. The electricity and gas went out when it was - 23 celcius. Ofcourse the dogs are coming Inside.",
            "score": 780,
            "author": "SnooStrawberries1910",
            "replies": [
                {
                    "level": 1,
                    "comment": "Tell him dog creates heat and you need it to live since no power.",
                    "score": 260,
                    "author": "Ghost_In_A_Jars",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Most of the people here do not care about animals. We will always let our dogs live inside.",
                            "score": 137,
                            "author": "SnooStrawberries1910",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Who took over running Uzbekistan after karimov died? Wasn’t his daughter exiled by him before? What’s the gov like there now? Also what brought a South African to Tashkent? Sounds like an interesting change of location?!! 🙂\n\nEdit: Question open to all Uzbeki inhabitants!!",
                                    "score": 12,
                                    "author": "Greyeye5"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Fake, no one lives in uzbekistan",
                    "score": 175,
                    "author": "molestedbyapareot",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes, it is an unpopulated piece of land.",
                            "score": 80,
                            "author": "SnooStrawberries1910",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It’s a made up place in fantasy Europe",
                                    "score": 24,
                                    "author": "AoFAltair",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It’s in Central Asia. It used to be part of the Soviet Republic but was formally recognized as an independent nation in 1991. They’re a member of the UN.",
                                            "score": 6,
                                            "author": "schwarzeKatzen",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "No, just like Ireland— it doesn’t exist.",
                                                    "score": 13,
                                                    "author": "onestubbornlass",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Don’t forget Australia",
                                                            "score": 3,
                                                            "author": "Dont_punch_me_again2",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That makes me so mad! There’s not just one poor dog being subjected to that but looks like quite a lot of dogs. \nIn Australia you can lose your dog by leaving it in a car because of the heat here, so why is it okay to leave dogs out in freezing temperatures?!",
            "score": 356,
            "author": "HelloMikkii",
            "replies": [
                {
                    "level": 1,
                    "comment": "Apparently, it's OK if you have friends in town government and the Animal Welfare department is a bunch of lazy crapsacks.",
                    "score": 204,
                    "author": "archilchimes",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s so fucked up. So fucked. And of course if you intervened you’d be the bad one.",
                            "score": 31,
                            "author": "HelloMikkii"
                        },
                        {
                            "level": 2,
                            "comment": "What’s the story here? Norridgewock is 30 minutes from my house.",
                            "score": 35,
                            "author": "Kineo207",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The story is that the guy's in town government and is being covered by friends in town government, a spineless ACO, and Maine Animal Welfare, which hangs up on all reports on the facility and wasn't answering its phones this week, when we knew this cold was coming.  (No actual response to emails was given, either.)",
                                    "score": 60,
                                    "author": "archilchimes",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Contact the media. They eat this kind of stuff up.",
                                            "score": 19,
                                            "author": "mcrib"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Umm can we all maybe know where to send angry emails too? Maybe also hit up your local news? Enough people and they can't ignore it. This should be sent to your local press. Dude doesn't have friends everywhere",
                                            "score": 14,
                                            "author": "JerodsSuperCool"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Can you please post the public info and legal contact info of these people? This is egregious enough to warrant more attention and could easily make msm by tomorrow.",
                                            "score": 17,
                                            "author": "wythawhy",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Thanks for the info. Hopefully word continues to get out…my dog went out for all of two minutes this morning before literally limping back onto the deck from the cold. I hope they have some hay or some other sort of insulating padding in the dog houses.",
                                            "score": 12,
                                            "author": "Kineo207"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "So this is Maine animal welfare? The one on Kennebunk?",
                                            "score": 3,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Maine Animal Welfare is a state office, headquartered in Augusta.",
                                                    "score": 3,
                                                    "author": "archilchimes"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Same here I live in Corinna, this weather is nuts. Can't imagine the poor animals",
                                    "score": 17,
                                    "author": "Ok-Faithlessness-610"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "This is how it is in Colorado as well. It’s pretty infuriating.",
                            "score": 7,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "\"crapsack\"\n\nHaha I like it.",
                            "score": 2,
                            "author": "echochamber4liberals"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m going to PM you, but an organization such as this is absolutely subject to USDA AWA/APHIS laws. They are required to have a USDA license if they ship dogs out of state sight unseen which I am guessing they do.\n\nI am a hedgehog breeder and have this license (exotics require it regardless of shipping), with it comes the phone number and ear of my local inspector. I can walk you through the process of getting this facility reported to the USDA, and I can get you the name or a contact of who to send this video to. Not providing water and adequate shelter are both violations.\n\nI cannot say that they will DO anything other than show up repeatedly, and write negative reports, and MAYBE revoke their license. But that is who is in charge above the state folks who aren’t doing what they should be doing.",
            "score": 32,
            "author": "Tygress23",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you; please PM me the name of your contact, if you feel comfortable with it.  I will say that I have contacted the USDA in the past and it didn't work out, though I can't recall exactly why at the moment; I \\*think\\* it had something to do with their license status or (possibly; this might be wrong) that they rely on Animal Welfare, which, as you said, is an arm of the USDA here.  But I would definitely like to speak with your contact, if they're willing.",
                    "score": 26,
                    "author": "archilchimes"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Anyone notice there’s chained dog carcasses 💀",
            "score": 401,
            "author": "jsunteam",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 54,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 23,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "And the drinking water buckets for them are frozen solid",
                    "score": 149,
                    "author": "skitz_shit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, about that: when I told Animal Welfare about that and cited a passage in Maine law that states \"snow or ice is not an adequate water source,\" the guy at Animal Welfare said he'd need 24-hour surveillance footage of the place before he'd act.  He had no problem with the frozen water sources.  Then he hung up, as he always does with reports on the property.",
                            "score": 115,
                            "author": "archilchimes",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Can you  send this to the local news",
                                    "score": 22,
                                    "author": "GoPeeOutside",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Or maybe go to the ASPCA. This is just sickening to see!",
                                            "score": 9,
                                            "author": "Purple_Station7030",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I was going to say to OP, submit footage to ASPCA. GET MORE footage if you can.",
                                                    "score": 3,
                                                    "author": "Mazakeen74"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yes. I counted two before I couldn't watch anymore.",
                    "score": 91,
                    "author": "plantpowered22",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Those are just scraps tossed out as food or for them to chew on. That's the back/spine portion which is a pretty common piece to toss out whole during home butchering without a commercial saw.",
                            "score": 23,
                            "author": "bendover912",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm pretty sure I saw a chain connected to one but I really hope you are right.",
                                    "score": 16,
                                    "author": "plantpowered22",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Think the chain was connected underneath it, not to it. At least I hope so",
                                            "score": 8,
                                            "author": "chrisplaysgam",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Chain is the same one connected to the alive dogs. They just put the meat on top of the post holding the chain for some reason.",
                                                    "score": 2,
                                                    "author": "ronniewhitedx"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "The chain was connected to the living dog and went back to near where the carcass was, chaining dogs together wouldn’t be useful so I don’t think it was another dog on the other end of the chain that just happened to die…",
                                    "score": 3,
                                    "author": "Dreldan"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I’m not justifying any of this, just want to make that clear first.\nBut I don’t think those are dog carcasses, if you mean the remains of spines and ribs? They’re too big and it looks like it’s been cut with a tool, it’s a very clean cut. It’s probably what they feed the dogs.",
                    "score": 52,
                    "author": "hrimthursa"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yeah some of those dogs might be ok, others are just not built for the weather. No effort to provide windbreaks, some of the openings pointing straight into the wind. No drinkable water, would wager no food either bc it’s too cold for someone who cares so little to go outside to feed them. I wonder if the good folk here would join me in emailing the sommerset county officials- sherrif/ aspca/ anything, to see if action can get taken. Op, have you contacted local media? Someone hungry for a piece might bite",
            "score": 261,
            "author": "Actaeon_II",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you very much for your willingness to help.  Mediawise, I can't talk about everything, but, again, if there's anyone you think should hear about this, feel free to point them my way.\n\n(Also, Actaeon, it's particularly magnaminous for you to help after that whole thing with the stag and your own hounds.  I appreciate it.)",
                    "score": 119,
                    "author": "archilchimes",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Side note-props for you, I’ve been using this handle online for almost 30 years and you are the first to get the reference.",
                            "score": 39,
                            "author": "Actaeon_II",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Hey OP, do you have an address for this place? Have you already called the sheriff’s department?",
                            "score": 24,
                            "author": "_Silvestris_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Depot St. Norridgewock Me.",
                                    "score": 16,
                                    "author": "RAP1958",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The house right beside the New Balance plant.",
                                            "score": 6,
                                            "author": "RAP1958"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Dogs in trouble, this trumps all. Have sent your video to the county sheriff, had to go to state chapter of aspca, couldn’t really find anywhere else that might help. The media is all you tho op, every area has one news channel more likely to take a story like this and I don’t know your area.\n\nEdit- found an email contact for mesp and linked them as well. Honestly don’t know who else to try.",
                            "score": 65,
                            "author": "Actaeon_II",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm at it.  Thank you for your help; I really do appreciate it.",
                                    "score": 12,
                                    "author": "archilchimes"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Just curious- is it possible the residents are dead or incapacitated? People die during this weather too, and this is so fucked up it’s hard to imagine the owner would let it happen regardless.\n\nIf you’re not sure maybe the sheriff will do a welfare check.",
                            "score": 15,
                            "author": "inspectoroverthemine",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No, they're not incapacitated; they just don't care about their animals and are sheltered by the town government, an ACO who doesn't care, and Maine Animal Welfare, which hangs up on all calls about the property.  Their brains, hearts, and moral capacity are certainly dead, though.",
                                    "score": 16,
                                    "author": "archilchimes",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Any chance you can post or tag this to your neighbors social media?  They’re government friends might look the other way, but not everyone will.",
                                            "score": 2,
                                            "author": "redjellyfish"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "OP said this was an issue last year too, so they’ve been doing this for a while. :/",
                                    "score": 2,
                                    "author": "camimiele"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Is there a petition or something that us, the general public can do to help?   \n\nAs I look at my dog, who's currently laying on the couch, I wish that every dog could have the life he has!  This video breaks my heart and infuriates me!!   \n\nI want to help and I'm sure others would too!  If there's ANYTHING we can do, please let us know!!",
                            "score": 11,
                            "author": "punchygirl-1381",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Can we get local info to help op? Emails for local gov and the local press organizations? Please",
                            "score": 3,
                            "author": "JerodsSuperCool",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The mods have said no direct emails, I'm afraid—there's an early comment addressing this.  For looking stuff up, the town is Norridgewock, ME, and sharing the incident does help.",
                                    "score": 2,
                                    "author": "archilchimes",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "I looked up what county the town was in, somerset, and from there refined search for aspca/sheriffs office. Then looked up state police tip line and mn state office for aspca and sent the video to all asking for help. It’s a little legwork since we can’t post emails.",
                                    "score": 2,
                                    "author": "Actaeon_II"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My Dad had 20 something dogs he kept like this while I was growing up. It was my responsibility to feed and water all of them each day. I felt bad for them almost year round, but specifically in winter. Their water would be frozen solid for portions of the day because I was in school at the time.\n\nI wish I would have done something more, but I did my best to make them comfy. I would put straw in their dog houses often and would make them hot food at night so they always had a warm meal.\n\nThese days I only have one dog who stays inside with me and is way too spoiled.",
                    "score": 27,
                    "author": "QuickNature",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "When I was a kid there were a number of hunting dogs, hounds. They stayed outside in the winter but they had a large insulated shelter with fresh food and water twice a day. I still felt bad for them when it got cold but I knew they would be ok. These poor dogs, smh, it’s killing me that there is only so much I can do, and that may be of zero help, or too late, for them",
                            "score": 17,
                            "author": "Actaeon_II",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I appreciate what you are doing, and—well, we're doing what we can do here.  I'm grateful for everyone's efforts.",
                                    "score": 8,
                                    "author": "archilchimes"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Thank you for all you did for your dad's dogs and your own dog.  You're a caring person, and I'm sure the dogs in your life were and are glad to have you.",
                            "score": 6,
                            "author": "archilchimes"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why own a dog just to chain it to a box in your backyard? I hate when people see dogs or any animal for that matter as an accessory or property. They should be treated like  family, or at the very least a living creature.",
            "score": 545,
            "author": "rawrlycan",
            "replies": [
                {
                    "level": 1,
                    "comment": "An old neighbor of mine had a huge pit bull like that. It apparently belonged to his ill brother and he chained the the dog up, gave it a shitty little hut to sleep in and told everyone the dog “was vicious” and would attack. \n\nWhen we had to access the yard, I sat with the dog and he laid his whole body on me to get attention and lick me. It was heartbreaking.",
                    "score": 287,
                    "author": "Current-Ordinary-419",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "We had a couple pit bulls like that in our neighborhood, that would try to lick you to death.",
                            "score": 5,
                            "author": "linuxgeekmama"
                        },
                        {
                            "level": 2,
                            "comment": "Pitt Bulls get a bad rep. They are the number one most abused and neglected breed by a wide margin. That's not even going into how a ton of people get them to specifically be mistreated or trained to be aggressive, attack, or bite. The fact they also have the highest rates of violent incidents is largely tied to this, and is no coincidence. But they're pretty damn affectionate, gentle, needy, and cuddly.",
                            "score": 27,
                            "author": "SecretOfficerNeko",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They can be just as sweet as any other breed. But be careful when you say that here, reddit has a small yet very loud sect of people with a hate boner for them",
                                    "score": 15,
                                    "author": "vladi_l",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Because they're \"bred to fight\". Like sure Jan, so are Mastiffs, Bulldogs, and Akita but I don't see you trying to ban those or portraying those as dangerous. \"But they're bred to kill\", and so are Terriers and most hounds but I don't see you complaining about those either. Even quite a few Shepharding and livestock dogs are bred to kill in order to protect livestock. There's very few breeds other than lap dogs these people's criticism wouldn't apply to. \n\nPitties do engage in the most violent incidents but people would rather say it's genetics than widespread abuse, training, maltreatment. It's a less scary idea, and also a simpler idea so it's appealing to those ignorant of the issues. If it's genetic you can just ban the dog and move on. If it's from treatment then it's only a matter of time before a new dog takes it's place when the shitty humans want a new breed to fight, guard, and abuse.",
                                            "score": 6,
                                            "author": "SecretOfficerNeko",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 15,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "They’re the sweetest dogs honestly and yet I get a bunch of downvotes whenever I say that on Reddit",
                                            "score": 4,
                                            "author": "SpiritAvenue",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Also, I dunno if it's the mods or some automated part of Reddit, but almost always when I'm involved in this topic, I get ghost notifications for comments that I can't see under whatever I say\n\n Just now, someone sent something about how over exaggerated the issue is, and how the sub is swarmed with anti pit stuff regularly, but when I opened the notification, there was nothing here",
                                                    "score": 9,
                                                    "author": "vladi_l",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It's people posting a comment then deleting it really quick typically. People use it to try and avoid being replied to or reported. People use it for harassment a lot. It's a very common experience among the communities I'm a part of too. Specifically paganism and the lgbt community.",
                                                            "score": 1,
                                                            "author": "SecretOfficerNeko"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Pitbulls are the worst. You are part of the problem\n\nI guess pitbulls are the single breed where genetics don’t matter",
                                    "score": 1,
                                    "author": "Newoikkinn"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Under the law dogs are considered property. Until that changes, people will neglect them to their hearts content.",
                    "score": 87,
                    "author": "Jesta83",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well, there are laws governing their treatment.  The problem in this case is that those laws are not being enforced.",
                            "score": 99,
                            "author": "archilchimes",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Call the local news or post online alot face book tiktok ista whate ver you can if enough people know the authorities can't ignore it hopefully",
                                    "score": 48,
                                    "author": "chipmunck688",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yea my friends dog got hit by a WAYMO.  And they said the dog was considered property",
                            "score": 8,
                            "author": "BecauseJimmy",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "The only thing that could land me in jail I feel is someone taking or hurting my dog. I had an incident where some guys hoped out a vehicle and were going to take my dog.  They followed me from a gas station and went around the block to turn their lights off and try and creep up.",
                            "score": 8,
                            "author": "milkyvapes"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Some people hoard animals like newspapers or some other thing they perceive as valuable enough to not toss, but still as objects.",
                    "score": 4,
                    "author": "RecoveringGrocer"
                },
                {
                    "level": 1,
                    "comment": "Mine sleep inside every day in their crate with a weighted blanket. Get treats every day for no reason other than being there. Fresh water daily, walks with a harness and no collar so they can breathe, and the best food out there. These aren't my pets, they're my family.",
                    "score": 3,
                    "author": "j5alive85",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you for taking good care of your dogs.",
                            "score": 2,
                            "author": "archilchimes"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Agree 100%. Until the effort is made to change the laws, though, unfortunately dogs and cats under current laws almost everywhere in the United States are \"property\"👎🏻",
                    "score": 2,
                    "author": "TruthKCMO"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I live in a part of Maine that's due to go down to -20°F/-45° to -50°F wind chill tonight.  We have a puppy mill that usually keeps out about four dozen dogs on 1/3 of an acre.  The dogs are out in all weather, and there have been reports of all sorts of problems: tethers not legal length, houses not built to standard, problems with water provision, problems for the community w/ barking &amp; urine odor.  It's a mess.  Of course, the dogs are out today, too.\n   \nThe video was taken this morning, when it was a relatively balmy 7°F, wind already howling.  ([This video](https://old.reddit.com/user/archilchimes/comments/10iqi3c/montage/) shows what the place is usually like; snow's obscuring stuff now.) \n  \nLast year, the dogs were out in -22°F weather—not with today's wind chill, but still.  At the time, I tried phoning Maine's Animal Welfare department.  The officer answering hung up all three times, refusing to take any report about the property.  This is Animal Welfare's standard procedure; they've hung up on any and all reports I and others attempted to file.\n   \nThe local animal control officer is no better; he typically won't answer his phone and has actively covered for the place before.  We've gotten excuses from the authorities like:\n    \n* These are show dogs!  Animal welfare law doesn't apply to them.\n  \n* We need you to submit 24/7 surveillance footage of the property before we'll investigate.  (This in response to the dogs' water sources being frozen solid.)\n  \n* The owner's knowledge of animal welfare law is so encyclopedic, he'd know better what was legal than \\*we\\* would!  (So the owner's allowed to determine whether he's breaking the law, apparently.)\n  \n* Our officer says his feelings were hurt by you calling, so we don't feel like investigating.  (For the last -22°F incident. Phone guy lied that I had called him names during the call, which his superior used to justify not taking a report.  I sent a recording of the call proving otherwise.  I never heard back.)\n  \n* We allegedly investigated the puppy mill once, so we're not going to investigate any more complaints about this property, no matter the evidence.\n  \n* Oh, that video is outdated!  The property's actually been \\*completely\\* renovated to eliminate any code violations.  Anything you see showing otherwise is a lie.\n  \n* Any video of conditions at the mill was deepfaked by criminals.  (Yes, seriously.)\n    \nIt's such a goddamn clown show, and it's gone from ignoring the situation into outright covering for the place.  Trying to get others involved is no better; everyone defers to the word of either the ACO or Animal Welfare, whatever excuse they give, and that seems to be the end of it.\n   \nGiven the publicity for the cold snap, we did finally get in touch with an animal welfare org that actually got the authorities to get an inspection of the place today instead of the usual hang up/ignore routine. However, the inspection team apparently includes a) one of the owner's friends from government and b) the ACO who's scared shitless of the owner.  I'm not convinced they'll find anything wrong.  \n  \nI will say that the baffles are actually new.  (Previously, they didn't have them, even though the law requires \"a baffle or other means of keeping wind and precipitation out of the interior.\")  A step like this is the equivalent of the moon landing for the owner.  \n   \nStill: even if the animals can make it through in these conditions, I can't see an argument for it being humane.",
            "score": 180,
            "author": "archilchimes",
            "replies": [
                {
                    "level": 1,
                    "comment": "So the owner has friends and/or really weak enemies in high places?",
                    "score": 81,
                    "author": "Ability-To-Can",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He has friends in local government and people who are either negligent or just really, really don't want to do their jobs at the state level.  The local favoritism seems specific to him; the state stuff has been evidently repeated with other cases, though perhaps not to this degree of aggressive refusal to enforce/making excuses.",
                            "score": 75,
                            "author": "archilchimes",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "So blow it up. Make it bigger than the local orgs and gov - send it to various news networks, post it to every social media outlet you can get your hands on, tag various regional organizations, etc. Eventually, someone’s bound to notice at that point.",
                                    "score": 63,
                                    "author": "Septemily",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That's kind of why I posted.",
                                            "score": 61,
                                            "author": "archilchimes",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Keep it going! Hopefully you’ll eventually reach someone who is able to do something about it.",
                                                    "score": 29,
                                                    "author": "Septemily"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah op, in addition to contacting local media (this is exactly why they exist!! To expose when government is failing to do their job!!), I would post this to Twitter and Facebook and tag local news stations, ASPCA, and whatever state agencies you've been talking to. Make this very public. Thank you so much for sharing this.\n\nETA: sorry, I see I'm repeating a lot of the advice you've been getting here and in your last posts. But I do think social media is a great place for this (this post is case in point but Twitter and Facebook would be even more effective for actually naming people/agencies for their inaction) and to reiterate, thank you for all you've done to help these dogs op. ❤️",
                                                    "score": 17,
                                                    "author": "eli-jo",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Oh, don't worry about repeating advice.  I'm grateful for the support and help.",
                                                            "score": 6,
                                                            "author": "archilchimes"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Have you reported it to Aaron Frey’s office?",
                                                    "score": 6,
                                                    "author": "FreudoBaggage",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I've been tagging someone in his office that initially helped get the head of Animal Welfare to respond (albeit only in a CYA way), but perhaps I should tag someone higher in the office.",
                                                            "score": 2,
                                                            "author": "archilchimes",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "You may have done all you can from the official side of things. The only thing you probably have left is publicly outing the neighbors AND (especially) the public officials who aren’t doing anything about it. Like a Facebook page dedicated to documenting this atrocity or whatever government forums are accessible to you. I also suspect this will not end well. Your neighbors appear to be the kind of people who would probably euthanize the dogs if it comes to it. I wish you every success in rescuing them though, this cannot be easy to watch happen.",
                                                                    "score": 2,
                                                                    "author": "FreudoBaggage"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Try your US Senators and Congressmen. Have you reached out to the SPCA, HSUS, and other large animal rescue organizations in Maine and perhaps Vermont and New Hampshire? Any of these groups will have media contacts as well.",
                                    "score": 27,
                                    "author": "foolmeoncex3",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "SPCA and the Humane Society have both claimed to me that their job is housing animals after rescue, not dealing with the rescue itself.  (The SPCA contact was national; the Humane Society, local.)  U.S. Congressional reps have not proven fruitful; in general, contacting government, if they follow up, just gets them to get in touch with Animal Welfare or the ACO—the authorities officially in charge of animal welfare—who then spin whatever bullshit story to deflect further investigation.  Government reps in general seem just to trust the opinions of the ACO/Maine Animal Welfare because that's their alleged area of expertise, and the reps are too busy with their own business to do any investigating themselves.  That's part of why the attitudes here are so pernicious.",
                                            "score": 27,
                                            "author": "archilchimes",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Thank you for your efforts and continuing to pursue every possible outlet. I admire you.",
                                                    "score": 5,
                                                    "author": "foolmeoncex3",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Thank you for your support.  I appreciate it, and I'll keep at it.",
                                                            "score": 3,
                                                            "author": "archilchimes",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Call your local news station and let them investigate",
                    "score": 25,
                    "author": "HotWash544",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is what I was going to suggest. Collect any and all evidence you have to do with interactions to do with these people and make it known publicly how your status animal welfare doesn't do their job!",
                            "score": 9,
                            "author": "coopatroopa11",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Are the owners Amish? I’m asking because Amish have a different thought on dogs. I think the only way to stop this is to hurt the owners in their pockets. They only care about the money they get from the puppy mill.",
                    "score": 5,
                    "author": "wheretheroadtakesyou",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "What is the agency you called. Horrible if you accidentally gave reddit the number and a lot of calls ensue...",
                    "score": 3,
                    "author": "Dieseljimmy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The agency that's supposed to address this but won't pick up is Maine Animal Welfare in Augusta, ME.",
                            "score": 2,
                            "author": "archilchimes"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm not the most reddit savvy but maybe post this to more subreddits so it gets more exposure.",
            "score": 45,
            "author": "domakethinkspeak",
            "replies": [
                {
                    "level": 1,
                    "comment": "I posted elsewhere for a previous, less-serious-only-in-the-scheme-of-things-for-this-place matter (the dogs having their water sources frozen solid), and I was informed this was the better subreddit for these matters.  Given the name, I'd have to agree.",
                    "score": 30,
                    "author": "archilchimes"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 228,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "There are four dozen dogs.",
                    "score": 126,
                    "author": "archilchimes",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hire someone with large armpits",
                            "score": 183,
                            "author": "Dressedclover56",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This made me actually snort laughter. Thank you.",
                                    "score": 34,
                                    "author": "kidneycat"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I live in Southern NH, honestly I'll rent a trailer and come up tomorrow if you're down to show me where they are. If the cops won't acknowledge that it's a problem let's make it one.\n\nEdit: You're only two hours away.",
                            "score": 44,
                            "author": "wythawhy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "lmk if you need gas money. I'm sure others will donate too",
                                    "score": 6,
                                    "author": "qyka1210",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Op never got back to me and lots of other users are bombarding local authorities. The offer stands but I figured it'd be best not to be pushing it.",
                                            "score": 5,
                                            "author": "wythawhy"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Are they sled dogs? Why so many?",
                            "score": 4,
                            "author": "redwetting",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They are hounds",
                                    "score": 6,
                                    "author": "aCandaK"
                                },
                                {
                                    "level": 3,
                                    "comment": "It's a puppy mill; they're breeders, though you can see dogs of breeds that don't fit the profile, so I imagine their might be a hoarding element, too.  He's on the town government, is friends with the town manager, the ACO's too scared of him, and Maine Animal Welfare doesn't want to do its job, so he's covered by his friends for having to comply with the law.",
                                    "score": 3,
                                    "author": "archilchimes"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Get a truck and drive them all to the shelter.",
                            "score": 9,
                            "author": "SuperiorSteelman2004",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They would be put down so fast that way. Shelters are so underfunded I've seen (second hand) dogs get dropped off and if they're over 4 or 5 years old put down in a matter of days. (Brother worked with a dog shelter as a vet)",
                                    "score": 12,
                                    "author": "ConReese",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you’re on tik tok,  upload this and tag thatdaneshguy or tizzyent.  These 2 usually spread awareness on all types of topics.  Gets viral quick.\n\nBeen pretty successful catching calling out bad people etc.",
            "score": 11,
            "author": "BecauseJimmy",
            "replies": [
                {
                    "level": 1,
                    "comment": "This needs more upvotes",
                    "score": 2,
                    "author": "Haxial_XXIV",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "We need OP to get this on the other platforms.  I hope OP does it 👍👍.  So sad to see these dogs like this.",
                            "score": 2,
                            "author": "BecauseJimmy"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "sometimes it’s okay to steal..",
            "score": 10,
            "author": "omlwhyme"
        },
        {
            "level": 0,
            "comment": "Wow this is so sad. So sorry no is willing to do anything about it. I hope this goes viral so that maybe the right person can take action! Wish I lived in Maine, so I could volunteer to snatch at least a few of them! 2 dozen dogs that’s so unbelievably heartbreaking 💔",
            "score": 37,
            "author": "Delicious-Ad-1229",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you; I appreciate your concern.",
                    "score": 10,
                    "author": "archilchimes"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What kinda hell hole is this",
            "score": 24,
            "author": "RastaSl0th"
        },
        {
            "level": 0,
            "comment": "This is unacceptable. If you own a dog and do this they should be taken away, fined  and sentenced for animal abuse never to own another animal.",
            "score": 8,
            "author": "Giggingurl"
        },
        {
            "level": 0,
            "comment": "That’s awful what can we do to help?",
            "score": 56,
            "author": "mild-hot-fire",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 75,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Have you tried contacting ARLGP for guidance? I know they've been instrumental in a number of large seizures, wonder if they could approach it from a different angle.",
                            "score": 21,
                            "author": "turtlechica91",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I can say that the ARLGP is aware of the place and has been helpful.  More I cannot say, but I appreciate the nudge.",
                                    "score": 25,
                                    "author": "archilchimes"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I’m from Maine, I would really like to help you get these dogs some help. I have gotten a rescue to save several dogs once and they have all since found loving homes. I have successfully corresponded with the Welfare League via email, though it wasn’t easy and they weren’t all too helpful. I practically handed them proof and location of an unethical/cruel breeder and they never responded after I gave them the address.",
                            "score": 15,
                            "author": "holvt",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'd welcome any help you feel comfortable giving.  That's not the first time I've heard such a report; I'm in fact impressed you were able to get any degree of email response from them.",
                                    "score": 14,
                                    "author": "archilchimes",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Going to post your post to FB and make it public. Let’s make some noise.",
                                            "score": 13,
                                            "author": "holvt"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You should try contacting some local reporters/news outlets. Where I am there's a woman who does a whole segment that just focuses on things like this where they can't get people to respond.",
                            "score": 18,
                            "author": "soylamulatta",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Media's a tricky topic, and we're again going near stuff where I can't say everything.  That said: if there's someone you think should hear about this story, feel free to share.",
                                    "score": 13,
                                    "author": "archilchimes",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "1) buy burner phone\n\n2) record\n\n3) make copies of recordings \n\n4) send to every local and statewide news station (anonymously of course)",
                                            "score": 17,
                                            "author": "BarnesWorthy",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "As per the post, recordings have been made and other steps taken.  Thank you for the advice, though.",
                                                    "score": 19,
                                                    "author": "archilchimes",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "My b, only read the bit about LE/local “authorities” inaction. I’m way the hell out in CA (and a “nobody”) but I’d be glad to share the story. Do you have any links to archives of complaints filed against the property/owners over the years?",
                                                            "score": 4,
                                                            "author": "BarnesWorthy",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Why don’t you post the phone number of both the kennel and the local animal control so we can start getting a rally behind it. Just posting videos week after week of these poor pups isn’t doing them any good unless you tell us how to help. Sounds like you’ve tried everything in your power. Time to let the masses flood them with phone calls.",
                            "score": 9,
                            "author": "rob71788",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;\tWhy don’t you post the phone number of both the kennel and the local animal control \n\nRead the subreddit rules.",
                                    "score": 3,
                                    "author": "Guygan"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I wish I lived 2 hours closer. :(",
            "score": 6,
            "author": "yarkboolin14"
        },
        {
            "level": 0,
            "comment": "If it were me, id take matters into my own hands if authorities wanted beat around it. Although thats not ideal or smart advice to confront owner or steal dogs. and i dont advise anyone to do so,but if you did... id be on your side. and i have a feeling it wouldnt be hard to compile a case against the authorities and the owner.",
            "score": 5,
            "author": "baxy67"
        },
        {
            "level": 0,
            "comment": "God I want to chain the “owners” to a pole cemented into the icy fucking ground",
            "score": 4,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "That’s SUCH a sweet little pointer :(",
            "score": 4,
            "author": "Itchy_Ad_5193"
        },
        {
            "level": 0,
            "comment": "I hate this happens more than anyone realizes. I have 2 dogs. They're inside and outside. I have 4 acres. My dogs go out every 2 hours to do their thing. If it's cold, they hurry. My neighbors on both sides have dogs as well. They are outside 365 days. I have to hear them cry at night because it's freezing temps. We had an ice storm come through this week and they didnt even bring them in. Animal control here is a joke. Unless the dog bites, they cant do anything. BS Oklahoma. People who do this shouldn't be allowed to own any pets. Would you leave a child outside with weather gear? No so why a dog w barely any protection? Unless those dog houses are stuffed w straw, they don't stand a chance.",
            "score": 5,
            "author": "Particular_Clue_4074",
            "replies": [
                {
                    "level": 1,
                    "comment": "Can confirm. I live in the middle of GA, where it rarely if ever snowed, but my parents had beagles that weren’t fixed and obviously the puppies were left outside too. I had the job of taking them inside and giving them a bath when people would come to buy them. The adult dogs we had outside were never bathed, were left outside in 100 degree weather, and my older brother and I had the duty of burying a lot of our old friends’ bodies after having to be the ones to find them in their houses.",
                    "score": 2,
                    "author": "MarionberryIll5030"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Send clips to local news stations and newspapers. Post on Facebook and other social media platforms. Many people love dogs and would be outraged about this. Hopefully it'll go viral and people will be forced to do something.",
            "score": 6,
            "author": "kleetor1",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Have the dogs been eating dead dogs? There's bones attached to chains ffs. This is shocking!",
            "score": 3,
            "author": "Ok-Silver6583"
        },
        {
            "level": 0,
            "comment": "What about private rescue organizations?",
            "score": 3,
            "author": "Dependent-Job1773",
            "replies": [
                {
                    "level": 1,
                    "comment": "I've contacted private animal welfare orgs, though if you have any suggestions, I'm open to them.",
                    "score": 9,
                    "author": "archilchimes",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I just googled local ones and 3-4 came up.  I’m willing to call them but it may take the air out since I’m not in Maine. May be better for you to do it",
                            "score": 2,
                            "author": "Dependent-Job1773",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I kind of did that sort of Googling when this issue first came up.  I thought from your comment that you might have had suggestions on orgs I with whom I could speak that I might have overlooked.",
                                    "score": 3,
                                    "author": "archilchimes",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If animal welfare routes are coming up as dead ends (based on what your comments explain) is it possible to approach from another angle? City code or zoning violations (number of animals on property)? Breeding license (or lack thereof) if required in ME? Just ideas, and you may have already exhausted these and I haven't found that explanation in the comments. I'm thinking if the people in the standard channels are afraid of this person or wedged in their back pocket, maybe finding the right person under a different violation could help put an end to it.",
            "score": 3,
            "author": "existentiallysingle",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This is so incredibly heartbreaking. And that OP has been tirelessly trying to help for so long. Apart from jail breaking those poor doggos, and raising visibility (media, social media), what else can we do? It doesn’t sound like the channels available (local and state animal welfare) are going to do anything. \n\nDoes anyone have a relationship with State Reps, Senators, or the governor? Something has to change.",
            "score": 3,
            "author": "somevelvetmorning",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's extremely frustrating, how covered this guy is.  Part of the problem seems to be that everyone—people in other state government offices; some in the media—defer to the judgment of the local ACO or Maine Animal Welfare, due to the fact that they're busy in their own jobs and trust the ACO/Animal Welfare to have done theirs.  They'll just gulp down whatever story they're selling, no matter how ridiculous (like the \"they're show dogs!!!\" excuse), even when confronted with video/audio evidence to the direct contrary.  \n\nI am involved with other ongoing efforts, but in the meantime, the only thing is to keep raising awareness that this is happening.",
                    "score": 3,
                    "author": "archilchimes"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Call your local news station and get it on tv",
            "score": 3,
            "author": "HotWash544"
        },
        {
            "level": 0,
            "comment": "That is immediate arrest and seizure of the animals here.",
            "score": 3,
            "author": "Raven-Mark"
        },
        {
            "level": 0,
            "comment": "The problem here goes beyond just the cold weather. Nobody should have that many dogs on 24 inch chains in a shitpile backyard. I don't even understand what the point of having them is when they just spend the whole lives in a 12 square foot area like that with 10 other dogs.",
            "score": 3,
            "author": "erosmoker",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Post this on the dog subreddit. It’s upsetting but a lot of those people over there seriously care and will try and help you.",
            "score": 3,
            "author": "4evertired",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Are these hounds used for hunting? Most hunters just treat the hounds like a replaceable tool they can just use and throw away.",
            "score": 3,
            "author": "Haunting-Gur-202",
            "replies": []
        },
        {
            "level": 0,
            "comment": "plz talk to your local news channel. this guy has to be held accountable for this",
            "score": 3,
            "author": "Grand-Palpitation",
            "replies": []
        },
        {
            "level": 0,
            "comment": "It’s like the gulag but for dogs",
            "score": 3,
            "author": "WeekendPizzas"
        },
        {
            "level": 0,
            "comment": "its like a pupper concentration camp :\\*(",
            "score": 3,
            "author": "SinDanudes"
        },
        {
            "level": 0,
            "comment": "I just shared this on my FB. I live in central Maine and everyone knows how cold it is right now. Hopefully some of my friends know people who can help.",
            "score": 3,
            "author": "miamimo8",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Makes me feel sick",
            "score": 4,
            "author": "Nooo-Dont-Do-It"
        },
        {
            "level": 0,
            "comment": "Maybe if they were one of those mountain dogs that sleep under the snow? Forgot what they are called but starts with a BER for sure. Build them a heated structure in that big back yard.",
            "score": 2,
            "author": "milkyvapes"
        },
        {
            "level": 0,
            "comment": "I’m DMing you OP; take a look when you can please",
            "score": 2,
            "author": "UpAllNight617420"
        },
        {
            "level": 0,
            "comment": "Best thing you can do is everything to make the owners life more uncomfortable. Take to social media, find your local towns Facebook page, make petitions, get animal rights organisations involved like PETA, hold a picket line outside the owners property demanding action be taken.",
            "score": 2,
            "author": "Extra-Rain"
        },
        {
            "level": 0,
            "comment": "Anything short of a husky should not really be outside in this weather.",
            "score": 2,
            "author": "Good-Ad6352"
        },
        {
            "level": 0,
            "comment": "What a fucking joke. 4 dozen dogs, a breed that isn’t built for harsh weather, and a barn literally right there you could house them in for the storm but they care so little not even that is possible for them.\n\n\n\n\n\n\n\n\n\nAnd of course the authorities don’t care, they almost never do.",
            "score": 2,
            "author": "Hutch25",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Contact the ASPCA.",
            "score": 2,
            "author": "4evertired",
            "replies": [
                {
                    "level": 1,
                    "comment": "I actually did write them with a bunch of evidence, as I'd been giving monthly to the ASPCA for years, and they never contacted me back.  When I called up, they informed me that they don't get involved in rescues; they only take care of dogs *after* rescue.  They didn't even refer me to anyone else.  \n\nSome many of the organizations you thing would intervene in cases like this just fall down in actually helping out.  The Humane Society was similarly hands-off.",
                    "score": 2,
                    "author": "archilchimes"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Take some pictures of the front of the house, what it looks like from the street, and maybe a shot of the perp.   And what car they drive.  Expose them and where they live…so locals know what’s going on in their backyard….and if any redditors want to find the house and drive by and yell nasty things at them.",
            "score": 2,
            "author": "shes-sonit",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Can you call the police? My goodness please help them",
            "score": 2,
            "author": "No_Caregiver1890",
            "replies": [
                {
                    "level": 1,
                    "comment": "They tried, read the comment they made.",
                    "score": 2,
                    "author": "SeawolfGaming",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Is there a name for animal control we can call or send messages on Facebook?",
                            "score": 2,
                            "author": "No_Caregiver1890",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Mods have asked that info not to be posted here.  Maine does have a directory of animal welfare officers, though.  (The kennel is in the town of Norridgewock.)  The state agency that's been neglectful is Maine Animal Welfare.",
                                    "score": 2,
                                    "author": "archilchimes"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Who in their right mind could ever do this:( the frozen water dishes broke my heart. Poor little guys can’t even get a drink. Screw this person. \n\nThey shouldn’t just have their dogs taken away, they should be arrested.",
            "score": 2,
            "author": "fatherofallthings"
        },
        {
            "level": 0,
            "comment": "Does the local news have any interest in stories like this/ the power to shed light on corruption?",
            "score": 2,
            "author": "ratedarf"
        },
        {
            "level": 0,
            "comment": "This is terrible, Do you have a local government representative in your area.\n\nShow them the video",
            "score": 2,
            "author": "Mongaloiddummy",
            "replies": []
        },
        {
            "level": 0,
            "comment": "i think i remember you posting about this last year. you could see them in google satellite view.",
            "score": 2,
            "author": "pifumd",
            "replies": []
        },
        {
            "level": 0,
            "comment": "it'd be nice if new balance would throw some weight behind it, seeing as how this is in their 'back yard'.",
            "score": 2,
            "author": "pifumd"
        },
        {
            "level": 0,
            "comment": "Oh noooooo. Until the first dog popped out I was hoping they would be huskies. Still too cold for them without fresh snow to make burrows in for warmth. But potentially within the range of what they could handle safely. Then that short-haired baby popped out and my heart sank.",
            "score": 2,
            "author": "SuppleSuplicant"
        },
        {
            "level": 0,
            "comment": "Put it on Facebook. And put a hashtag. And I’ll find you and share it",
            "score": 2,
            "author": "bjmo1111",
            "replies": []
        },
        {
            "level": 0,
            "comment": "What hell is this?",
            "score": 2,
            "author": "Ringo_1956"
        },
        {
            "level": 0,
            "comment": "This animal torture is heartbreaking!",
            "score": 2,
            "author": "Psych100011"
        },
        {
            "level": 0,
            "comment": "WTF!!!! Thank you for posting this. Hopefully it blows up, &amp; something gets done.  Skeletons of dogs?",
            "score": 2,
            "author": "MurphyCaper"
        },
        {
            "level": 0,
            "comment": "I can’t even stand outside for 5 seconds without my fingers feeling numb. Someone better “borrow” those dogs and bring them somewhere warm asap.",
            "score": 2,
            "author": "saturn-ium"
        },
        {
            "level": 0,
            "comment": "Those chains break my heart.",
            "score": 2,
            "author": "gagsy10",
            "replies": []
        },
        {
            "level": 0,
            "comment": "If the dogs were cold weather dogs, that would be a different thing! But these are short hair breeds! Someone needs to go tie the owner up in his tank top next to one of the dog houses!",
            "score": 2,
            "author": "ShadNuke"
        },
        {
            "level": 0,
            "comment": "People are shite",
            "score": 2,
            "author": "Danisii"
        },
        {
            "level": 0,
            "comment": "Same here in Colorado. They only care if it’s a dog with a home that’s running on the streets or if the police call them.",
            "score": 2,
            "author": "imnotdressedforthat"
        },
        {
            "level": 0,
            "comment": "Everyone.  Message the town of Norridgewok. They have a fb page.",
            "score": 2,
            "author": "Mazakeen74"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 2,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I’d be out there stealing those dogs",
            "score": 2,
            "author": "luvdab3achx0x0"
        },
        {
            "level": 0,
            "comment": "Owners like this need to just die.  I really believe that.  No way you can be a good person while demonstrating this level of neglect to an animal.",
            "score": 2,
            "author": "Dependent-Job1773"
        }
    ]
}