{
    "id": "10w5s98",
    "score": 1519,
    "title": "Several schools in Michigan are getting fake calls of school shootings",
    "author": "Four_N_Six",
    "date": 1675786611.0,
    "url": "https://www.reddit.com/r/iamatotalpieceofshit/comments/10w5s98",
    "media_urls": [
        "https://i.redd.it/w8vwkvuy1uga1.png"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\nPlease note that we will ban you if a post or comment breaks any of our rules. **Be especially mindful of the following**:\n\n**Rule 1: Do not post or ask for identifying information, including first and last names and social media usernames.** Public figures are **not** exempt. We remove all external links to prevent accidental posting of identifying information.\n\n**Rule 2: Do not post violent comments, and do not glorify violence, per TOS.** We can't take responsibility for how angry a post makes you, you need to do that. Telling us \"it was a joke bro\" is not an excuse.\n\n**Rule 7: Do not link to or post screenshots of reddit posts, reddit comments, reddit personal messages, reddit profiles, etc.** We cannot allow you to use this subreddit to harass other people on reddit. \n\n**Rule 8: No bigotry, no racism or race baiting.** It is hard to believe that we even need a rule like this. \n\n**Our rules are zero tolerance. You will be banned for breaking them.**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/iamatotalpieceofshit) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "This is some straight bullshit. I hope they find these mother fuckers and they get time in jail and have to pay thousands of dollars in compensation to the city",
            "score": 95,
            "author": "Jawwaad127",
            "replies": [
                {
                    "level": 1,
                    "comment": "They’re probably 12",
                    "score": 41,
                    "author": "Jared_pop21",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So that's their parents's fault",
                            "score": 25,
                            "author": "1CobraS"
                        },
                        {
                            "level": 2,
                            "comment": "yea lol...honestly, im surprised this hasn't happened more.",
                            "score": 10,
                            "author": "Riddlz10",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It’s has been",
                                    "score": 5,
                                    "author": "Mamaj12469"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My son goes to school in Michigan according to the principle some kids were caught and could face terrorism charges.",
                    "score": 5,
                    "author": "PoisonousNokia"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I hate swatters so much, SWATTING for context is making false threats pretending to be someone else to invoke a police response. Multiple people have died because of this, cops come in assuming bomb or hostage situation especially in districts without the proper training for these situations and mistakes happen, mistakes that cost lives. my bet is some kids think it's the funniest thing in the world OR an actually cry for help from some deeply disturbed individuals.",
            "score": 55,
            "author": "UpbeatLizard641",
            "replies": [
                {
                    "level": 1,
                    "comment": "Tbh, the fact that school shootings are so bad that poorly trained cops are getting civilians \"caught in the cross fire\", seems more of the problem. And, as an Australian, calling for people to be strung up for manslaughter, as a 'boy who cried wolf' message to society, seems counterproductive considering who is the wolf, and who is getting shot by wolves. It's children being blamed for adults murdering children...",
                    "score": 7,
                    "author": "Mindless-Read8607"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My kid’s school (not in Michigan) went through the same thing last year. The moment I got the message from school, I froze and almost broke down, I could never forget that moment. It was later determined that’s a hoax, someone made a prank call. \n\n\nThen yesterday there’s another threat, in the middle school right next to my son’s school. apparently a student posted on FB saying he/she would shoot the school on Wednesday. The school acted fast thankfully, immediately had police went over to investigate, police force were around, consults were provided. Last night, school said they made sure the student doesn’t have access to weapons and talked to the parents. Still it’s scary af.",
            "score": 7,
            "author": "take7pieces"
        },
        {
            "level": 0,
            "comment": "My first thought is that this is a distraction so other crimes can be committed elsewhere\n\nAlso want to add that recently in a school near me a child was arrested for taking a gun to school. Such sad times we live in",
            "score": 26,
            "author": "cryobots",
            "replies": [
                {
                    "level": 1,
                    "comment": "Okemos?  Unlikely. I'm betting it's some spoiled wealthy teen boys.",
                    "score": 5,
                    "author": "2punornot2pun"
                },
                {
                    "level": 1,
                    "comment": "These have been happening all across the country for months. Doubt it’s even someone local making the call. To me it sounds more organized, but I don’t know their ultimate goal other than to just terrorize.",
                    "score": 2,
                    "author": "Ace-Of-Mace"
                },
                {
                    "level": 1,
                    "comment": "Definitely fam. It’s like every week now we’re hearing a young ass kid having a gun. Sad",
                    "score": 3,
                    "author": "Jawwaad127",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Maybe if their parents stopped buying them M rated games\n\nEdit: direct reply to OP, he posted something about this saying ratings are bullshit and that he buys his kids M rated games and let’s other people’s kids play them even though their parents don allow them to do so",
                            "score": -35,
                            "author": "Phastic",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "video games do not correlate to violence.",
                                    "score": 11,
                                    "author": "tactical_nekofemboi"
                                },
                                {
                                    "level": 3,
                                    "comment": "This has been proven, video game violence does not, in any way, correlate to real world acts of violence.",
                                    "score": 2,
                                    "author": "storeydustin"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If it was Texas then they would have shown up for the first one and stood around outside for 45min and waited for everyone to die.",
            "score": 39,
            "author": "thearss1",
            "replies": [
                {
                    "level": 1,
                    "comment": "The only reason I was contemplating grabbing a rifle and heading to my wife's school yesterday. Locked down for a supposed active shooter at a nearby school. \n\nI have a bunch of friends in law enforcement here and I found out through them pretty quickly it was a hoax.",
                    "score": 2,
                    "author": "Deep_North_South"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The school in the town next to mine got a false bomb threat last week",
            "score": 5,
            "author": "Primarch_Nomad",
            "replies": [
                {
                    "level": 1,
                    "comment": "Okay so genuine question:\n\nI’m 31, and when I was in middle school/high school we had like…3ish bomb threats per year. Was that atypical for that time period (2000s)? \n\nI see a lot of stuff about shooting and bomb threats now on big news stations and they obviously never made the news when I was a kid, so I’m trying to figure out if my school was a fluke or if everyone is taking threats more seriously since Sandy Hook/other recent shootings.",
                    "score": 1,
                    "author": "diegrauedame",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Probably taking it more seriously now due to an uptick in this stuff in recent years",
                            "score": 2,
                            "author": "Primarch_Nomad"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Grew up in West Michigan.  I’m sure this of course can happen anywhere but we had two fake school shooting threats and one bomb threat",
            "score": 3,
            "author": "JIGonzalez13",
            "replies": [
                {
                    "level": 1,
                    "comment": "I grew up in Kentwood and had a fake bomb threat my freshman year of hs now compared to then it seem like this stuff is happening on a regular basis",
                    "score": 2,
                    "author": "Living_Original329",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lived in Kalamazoo for 30 years and the first week of high school for my youngest, they went on lockdown for a Bomb threat. She was so scared she didn’t want to return.  Scary times",
                            "score": 1,
                            "author": "Mamaj12469"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sadly  this has happened to at least 10 states that I know of..",
            "score": 3,
            "author": "rob691369"
        },
        {
            "level": 0,
            "comment": "Dangerous for both police and innocents. People who do this should be jailed. Although in most cases police identify themselves, imagine the scenario that they don’t. Great way to get shot on both sides.",
            "score": 2,
            "author": "Nut_Chorizo"
        },
        {
            "level": 0,
            "comment": "My school got a few bomb threats before school shootings and such were popular",
            "score": 2,
            "author": "ifuckinghateschooll"
        },
        {
            "level": 0,
            "comment": "Happened to my school every other week for several months. Some were obviously fake, others the people were flashing guns on their snapchat stories while making the threat. Nooo thank youuu",
            "score": 2,
            "author": "deputy_Nico"
        },
        {
            "level": 0,
            "comment": "This just happened in my city as well. San Bernardino police responded to an active school shooter and nothing was found.",
            "score": 2,
            "author": "MVRK_3",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not just SB but at least 6 other schools in the IE this morning.",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was in Rancho Cucamonga this morning and saw 6 deputies and an ambulance rushing somewhere. The helicopter was heading that way was well.",
                            "score": 1,
                            "author": "MVRK_3",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah I read about Monrovia all the way to Highland with 4 others in between",
                                    "score": 2,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ban finger guns!!1!!1",
            "score": 1,
            "author": "Dutchbaked"
        },
        {
            "level": 0,
            "comment": "Stop wasting my tax money",
            "score": 1,
            "author": "no_economics14022"
        },
        {
            "level": 0,
            "comment": "The high school down the street from us here in Florida has had 4 bomb threats since the start of February",
            "score": 1,
            "author": "Mamaj12469"
        },
        {
            "level": 0,
            "comment": "This is news? My school district has gotten a bomb threat every year for the past 5 years.",
            "score": 1,
            "author": "Loganbogan9"
        },
        {
            "level": 0,
            "comment": "The only shootings they’re capable of preventing.",
            "score": 1,
            "author": "Johnm50"
        },
        {
            "level": 0,
            "comment": "In Arizona last year around October, there was a report about an active school shooter only for police to come and find no one. There were 3 different theories going around.\n1. A guy wanted a hat that another guy wanted so he called the cops from HIS phone. \n2. A daring contest between to idiots (not my words)\n3. Someone who wanted attention or “clout”. \nThis was at my school.",
            "score": 1,
            "author": "Tw1st3d_Rabbit18"
        },
        {
            "level": 0,
            "comment": "This is happening in Vermont this morning too \nSmdh",
            "score": 1,
            "author": "Hipko75"
        },
        {
            "level": 0,
            "comment": "Wife is an elementary school teacher who was locked down for an \"active shooter\" at a nearby school for a few hours. I have a bunch of police friends so I found out pretty quick it was seemingly a hoax.",
            "score": 1,
            "author": "Deep_North_South"
        },
        {
            "level": 0,
            "comment": "The MLive article on it said that the calls were all similar. A heavily accented person called and stated they were a teacher and just witnesses a student shoot another student, so def sounds like it was at the least a single person or a coordinated effort.",
            "score": 1,
            "author": "jexmex"
        },
        {
            "level": 0,
            "comment": "Same thing happened in Southern Maine a few months ago",
            "score": 1,
            "author": "ma_ma66"
        },
        {
            "level": 0,
            "comment": "This happened in Rancho Cucamonga, CA yesterday. SWAT teams running across high schools, and cop units come screaming up into parking lots.",
            "score": 1,
            "author": "rawysocki"
        },
        {
            "level": 0,
            "comment": "After the Oxford school shooting here, almost every school in our area were getting threats for mass shootings, it got to the point where they just shut everything down for the week. On my drive to college I passed a high school with people running out in terror because someone called in a fake threat",
            "score": 1,
            "author": "theshazzamster"
        },
        {
            "level": 0,
            "comment": "So is this just regular stupid or is it a malicious attempt to start a cry-wolf scenario to slow police response to an actual shooting later?",
            "score": 1,
            "author": "xervir-445"
        },
        {
            "level": 0,
            "comment": "We didn't have school shootings so common 20+ years ago. There may or may not have been a bomb threat called in to get out of a test. That was actually more than 30 years ago so I'm sure any statute of limitations has gone into effect and my friend is in the clear",
            "score": 1,
            "author": "ratadeacero"
        },
        {
            "level": 0,
            "comment": "In 4th grade, we had a few bomb threats. They were found in one of the girls’ bathrooms. It never even crossed my mind that the school environment would ever come to the point it’s at today. 9yo me was just marveling at the exciting adventures evacuating, going home early, etc. I must have been slow lol",
            "score": 1,
            "author": "luvdab3achx0x0"
        },
        {
            "level": 0,
            "comment": "we just got one the other day in Oregob",
            "score": 1,
            "author": "cigarette_ahegaoo"
        },
        {
            "level": 0,
            "comment": "This is happening where I live at the school I go to and it’s genuinely scary hearing how detailed they were whilst making the fake police report, exact rooms and everything.",
            "score": 1,
            "author": "Imayhaveeatenthedog"
        },
        {
            "level": 0,
            "comment": "This did not age well",
            "score": 1,
            "author": "nma_05"
        },
        {
            "level": 0,
            "comment": "Had an incident very similar to this. Someone had graffitied BOMB on one of our bathroom doors and we had to go into lockdown and parent pick up. This was during our schools PSSA. (Standardized Test for PA) But it was fake of course.",
            "score": 1,
            "author": "HeestoTheColf"
        },
        {
            "level": 0,
            "comment": "New Hampshire has been getting some fake threats recently. My good friend who lives up there has had to leave school 8 different times this past January, and apparently it’s not only his school that is receiving the threats. Given the community’s history, im almost 100% sure it’s just some kids who don’t want to go to school so they send a threatening email and call the police.",
            "score": 1,
            "author": "Feral-pigeon"
        },
        {
            "level": 0,
            "comment": "my school went into lockdown earlier this (school) year because someone called and said there was a school shooting. caller id was traced to minnesota, we’re in SoCal; next day someone made a distasteful joke about having a gun and we went into another lockdown",
            "score": 1,
            "author": "prawn7490"
        },
        {
            "level": 0,
            "comment": "Have people never heard of the Boy who cries wolf….like seriously",
            "score": 1,
            "author": "Daemon_Knight23"
        },
        {
            "level": 0,
            "comment": "I mean, at least they're THERE",
            "score": 1,
            "author": "MrOsmio7"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": -16,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh ok, that make it totally fine then.",
                    "score": 9,
                    "author": "MVRK_3"
                },
                {
                    "level": 1,
                    "comment": "“It’s fine if I burn down this hospital, because there’s nobody currently in it”",
                    "score": 0,
                    "author": "LampshadesAndCutlery"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So how are the gun laws working for you over there? 😂😂",
            "score": 0,
            "author": "brrrapbrrrapguy"
        }
    ]
}