{
    "id": "113tvd7",
    "score": 626,
    "title": "\"your state voted a certain way so the disaster is deserved.\"",
    "author": "Doomer1996",
    "date": 1676563061.0,
    "url": "https://www.reddit.com/r/iamatotalpieceofshit/comments/113tvd7",
    "media_urls": [
        "https://i.redd.it/21hqac9r6mia1.png"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\nPlease note that we will ban you if a post or comment breaks any of our rules. **Be especially mindful of the following**:\n\n**Rule 1: Do not post or ask for identifying information, including first and last names and social media usernames.** Public figures are **not** exempt. We remove all external links to prevent accidental posting of identifying information.\n\n**Rule 2: Do not post violent comments, and do not glorify violence, per TOS.** We can't take responsibility for how angry a post makes you, you need to do that. Telling us \"it was a joke bro\" is not an excuse.\n\n**Rule 7: Do not link to or post screenshots of reddit posts, reddit comments, reddit personal messages, reddit profiles, etc.** We cannot allow you to use this subreddit to harass other people on reddit. \n\n**Rule 8: No bigotry, no racism or race baiting.** It is hard to believe that we even need a rule like this. \n\n**Our rules are zero tolerance. You will be banned for breaking them.**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/iamatotalpieceofshit) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "It's not saying they deserved it, it's saying that the chemical spill is a logical consequence of removing safety measures and regulations, which it is. And that Ohio is a red state that consistently votes for politicians that remove those measures, which it is.",
            "score": 209,
            "author": "Ccaves0127",
            "replies": [
                {
                    "level": 1,
                    "comment": "Except this one had nothing to do with removed safety measures, and if you're referring to the brake requirement for certain trains, the repeal process for that started in 2015.  Under Obama.",
                    "score": 9,
                    "author": "Boo155",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Doesnt matter, the Red states fight safety measures like this to keep profits up. The electronic brakes were repealed because of the cost benefit. If we had less push back on things that actually prevent things we would all benefit not just the politicians",
                            "score": 1,
                            "author": "Beautiful_Ad_3402"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "\\*Some horrifying event\\*  \n\n\n\"Gee that's too bad\"  \n\n\n\\*People jump to defend\\*",
                    "score": 2,
                    "author": "Carpycarp44"
                },
                {
                    "level": 1,
                    "comment": "An yet look how smugly he typed this tweet.",
                    "score": -36,
                    "author": "Doomer1996",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "By not getting snow tires on my car this year I’m saving money but I’m risking the safety of my system, so when I go sliding on black ice during a dry day and no snow on the road and end up with a breathing tube, it wasn’t necessarily something I deserved but it was a direct result of the risk I was taking, Ohio cut a few key regulations surrounding the issue at hand supposedly to save money",
                            "score": 23,
                            "author": "jdawg4444444"
                        },
                        {
                            "level": 2,
                            "comment": "I like how every comment here is pretty much “well you don’t deserve this but you voted for it so it’s kinda your fault” Reddit is filled with such scum.",
                            "score": 4,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Good to know that I, an Ohio resident, must suffer the consequences of other people's bad decisions!",
                    "score": 1,
                    "author": "human_peeler"
                },
                {
                    "level": 1,
                    "comment": "I.E.: You are saying that they deserved it",
                    "score": -14,
                    "author": "GamerJuiceDrinker",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Or just that their own actions caused it. They might not deserve it, but they’re responsible for it.",
                            "score": 19,
                            "author": "Wealthier_nasty",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You do not realize how this is immoral, you only know that certain people voted a certain way, so what about the other people who did not vote in a certain way or those who didn't or cannot vote?",
                                    "score": -6,
                                    "author": "GamerJuiceDrinker",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I don’t think you understand what immoral means. If the majority of people voted against their own interests, and as a result they had to face the consequences of that choice, pointing out that fact isn’t immoral. I’m not celebrating that it happened, simply pointing out that it happened because they chose leaders who put corporate profit over safety. They’re paying the price for that choice, as sad as it is.",
                                            "score": 11,
                                            "author": "Wealthier_nasty",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Well this is wrong on many levels, this is why I call immoral also, because it doesn't coincide with what is moral in such situation.\n\nYou argue that because the majority of people have voted this way: this is not true; because most people either voted for the other guy or didn't vote at all, as I said before. What you are doing here, is not a good argument as to why they indeed deserved it, you are making a good argument against democracy.\n\nYou may not gloat at what is happening, but you are just a tiny bit less worse than those who do, who likely are of your same opinions most of the time, because who would gloat at what is happening in Ohio?\n\nWith that said, I hope you will enlighten yourself on what morality actually means, better, to actually act morally.",
                                                    "score": -3,
                                                    "author": "GamerJuiceDrinker"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "They literally asked for it but okay…",
                            "score": 6,
                            "author": "Mission_Mark4869",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "man, you're really making me dislike democracy, not Ohioans who voted in a certain way",
                                    "score": 0,
                                    "author": "GamerJuiceDrinker",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "there are many thinge to dislike about democracy. but in an outocratic state you would most likely have it worse, and get murdred if you spoke out against it.",
                                            "score": 1,
                                            "author": "azader"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The cause is under investigation but we have to trust the experts of Reddit and Twitter when they blame the voters",
                    "score": -1,
                    "author": "Cancerism"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That's not the implication of that tweet. His point is.pretty reasonable and grounded in truth. The congressman representing the district including East Palestine is literally one of the primary architects of deregulation of the railroads. He, and his electorate hold some blame. A lot of it is also.corruption lf the system, for which democracy is not a useful remedial tool.",
            "score": 20,
            "author": "SERGIOtheDUDE"
        },
        {
            "level": 0,
            "comment": "Gov DeWine refused federal assistance..all you need to know",
            "score": 49,
            "author": "jayzr1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, but the people of Ohio don’t deserve suffering for dewine’s actions",
                    "score": 9,
                    "author": "Justyouraveragestark"
                },
                {
                    "level": 1,
                    "comment": "But he didn't? FEMA deemed the spill not bad enough to give assistance, which is bullshit. FEMA doesn't have the budget, and Washington doesn't care.",
                    "score": 3,
                    "author": "Striking-Loquat1403",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "FEMA isn't allowed, by law, to provide aid unless a state of disaster is declared. \n\nWhich DeWine refuses to do.",
                            "score": 40,
                            "author": "EightandaHalf-Tails"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not deserved. But if it isn't the consequences of your own ( my own, though it's not my state, ik my country's representatives are ALL trash) decisions.",
            "score": 99,
            "author": "IIsikson",
            "replies": [
                {
                    "level": 1,
                    "comment": "Generally speaking political representatives try to hide and downplay their removal of things like safety measures so even those who did vote for them may not be aware of this behaviour, and that doesn't account for those who are too young to vote, can't vote for some other reason or voted for the other party and lost. In general most people in the state would not be aware of their government doing this and if they were, they weren't aware of the true risks associated. Its very narrow minded to think that because the state voted a certain way they deserve what happened to them. Victim blaming is something the left tends to frown upon so its surprising to see so much of it here.",
                    "score": 3,
                    "author": "BlacksmithNo6559",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "\"Its very narrow minded to think that because the state voted a certain way they deserve what happened to them.\". . ?!?! Smfh homie what is the literal first words in my comment?? Look no one deserves to have their car stolen, but if you leave your car with the windows down and keys in the ignition and go to bed you're not exactly helping the situation.",
                            "score": 9,
                            "author": "IIsikson",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Just like how women who wear revealing clothing \"arent helping the situation\" when they get raped right? This is victim blaming because its easier than having to care about the victim.",
                                    "score": 1,
                                    "author": "BlacksmithNo6559",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 5,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "So you are saying that they deserved it, but you are too much of a coward to say so directly.",
                    "score": -17,
                    "author": "GamerJuiceDrinker"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm glad I live in Toledo Ohio for once. Super far north from this runoff bullshit",
            "score": 18,
            "author": "AnimalChubs",
            "replies": [
                {
                    "level": 1,
                    "comment": "Toledo is great! It's my favorite Ohio city for whatever that's worth",
                    "score": 2,
                    "author": "GovernmentDoingStuff",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "TIL Toledo exists",
                            "score": 7,
                            "author": "Helpimabanana",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Do you know why Toledo doesn’t have a professional NFL team? \n\nBecause then Cleveland would want one!",
                                    "score": 0,
                                    "author": "cophotoguy99"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "But if you lived further South.... gee thats too bad.",
                    "score": 1,
                    "author": "Carpycarp44"
                },
                {
                    "level": 1,
                    "comment": "*cries in Dayton*",
                    "score": 1,
                    "author": "human_peeler"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yea, this rando on twitter is the real villain here.",
            "score": 44,
            "author": "KatBoySlim"
        },
        {
            "level": 0,
            "comment": "Tf did people who can't vote do to deserve this?",
            "score": 25,
            "author": "TheHeadbuds",
            "replies": [
                {
                    "level": 1,
                    "comment": "Be born in Ohio",
                    "score": 24,
                    "author": "sloretactician"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Show me where in this text there is even an implication of them saying they deserved it (you can't).",
            "score": 9,
            "author": "Sacagawesus"
        },
        {
            "level": 0,
            "comment": "Yeah they're uneducated single-issue voters who blindly follow politicians who vocally support deregulation and profit maximization. And yeah it turned around to bite them in the ass, first the train crashed and then instead of paying a large sum to clean it up they decided to BURN the chemicals...",
            "score": 25,
            "author": "Kpt1NSANO",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's not why they burned it.\n\nThey burned it because all those pressurized chemicals were at risk of creating a catastrophic explosion that likely would've done kinetic damage on par with a small tactical nuke if they didn't do a controlled release \n\nSteam explosions from tanks that large are no joke",
                    "score": 12,
                    "author": "CyptidProductions"
                },
                {
                    "level": 1,
                    "comment": "The train derailed on the Pennsylvanian side of the Ohio an Pennsylvania border so it was Pennsylvanians that were making the decisions don't forget that Pennsylvania is a blue state. \n\nSo the whole \"well maybe if the red state voted for the correct people this wouldn't of happened\" argument doesn't really work since it was a blue state that caused all this.",
                    "score": -18,
                    "author": "Doomer1996",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "As a Pennsylvanian, the only reason we are blue is because of Philly and Pittsburgh. The rest is almost entirely red. \n\nAlso, I don't think you're listening to what anyone is saying. The reason why this happened can be followed back to changes that were made with poor insight.",
                            "score": 14,
                            "author": "DarkAeonX7"
                        },
                        {
                            "level": 2,
                            "comment": "No it didn’t. The train derailed in Ohio, close to the border with PA.",
                            "score": 19,
                            "author": "vexillographer7717",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Nope try again it was the PA side I actually live here bozo.",
                                    "score": -17,
                                    "author": "Doomer1996",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Why you gotta call me a bozo? Totally unnecessary. You seem like a miserable person though. Nonetheless I hope you don’t get harmed by this toxic spill.",
                                            "score": 26,
                                            "author": "vexillographer7717"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yeah, because the citizens of Ohio can definitely control the elections and not get screwed over by the government in any way, shape, or form!",
            "score": 10,
            "author": "IzErrAzI",
            "replies": [
                {
                    "level": 1,
                    "comment": "Pennsylvanians were the ones who made all the decisions while Ohioans suffer the consequences but ig since Ohio turned into a red state in 2020 this guy an Reddit both agree we deserve to suffer. 🙄",
                    "score": 0,
                    "author": "Doomer1996"
                }
            ]
        },
        {
            "level": 0,
            "comment": "These people who reduce everything down to politics are fucking tiresomingly one dimensional.",
            "score": 47,
            "author": "philosophunc",
            "replies": [
                {
                    "level": 1,
                    "comment": "Stop talking about politics, let’s talk about our favorite type of cheese. I’ll go first!\n\n\nMozzarella is my favorite type of cheese cause it’s good",
                    "score": 5,
                    "author": "Redavatar101",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What about harvati, muenster, and pepper jack? Parmesan?",
                            "score": 2,
                            "author": "human_peeler"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah except this is a political issue...",
                    "score": 19,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, I don’t think this guy really know how we got to this point",
                            "score": 9,
                            "author": "Marc_J92"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That's what a liberal would say. ^^^/s",
                    "score": 14,
                    "author": "ApprehensiveAd6476",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wait till they discover everyone's blood is red.",
                            "score": 10,
                            "author": "philosophunc",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Wait until you realize that’s only when it’s outside the body and exposed to oxygen, which is blue",
                                    "score": 4,
                                    "author": "Helpimabanana",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Surely you jest. Your blood is red. And its already oxygenated so exactly how is oxygen outside your body any different then the oxygen that’s already in your blood?",
                                            "score": 7,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "True.\n I think the poster is poorly referring to a train safety measure related to brakes,  that was voided by a politician. It may have prevented this disaster.\n\nIts a fact worth knowing.. but explaining the situation might make dude seem like less of a tool. Instead of \"ha ha..\"",
            "score": 14,
            "author": "xptx"
        },
        {
            "level": 0,
            "comment": "they’re right. you get what you ask for, and this is what they asked for.",
            "score": 10,
            "author": "LightOfADeadStar"
        },
        {
            "level": 0,
            "comment": "Is this what you want to focus on?  This is how the two party system works to keep you begging and happy with the scraps. This has worked so well we are the richest country on the planet in all of written history. Does anyone reading this right now feel rich? Someone said something that besmirched my political party so now I want to invest energy in righting this wrong. \n\nThe Railroad companies successfully had the safety standards lowered that enabled this to happen. The public was kept in the dark for a week and half. We all saw the ONE reporter get arrested....why only one reporter? Has the President acknowledged this yet?",
            "score": 11,
            "author": "monet108",
            "replies": [
                {
                    "level": 1,
                    "comment": "Dude is practically jerking it to the misfortune of others because they didn't vote like him that's why he's a pos.",
                    "score": -5,
                    "author": "Doomer1996",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "who fucking cares. You are practically jerking it off to this guys point of view. When we have a failing of our government body to both prevent this level of disaster and to report and protect all of the citizens that will be effected by this event. But sure instead of the focusing on things that might get the us real change let us jump into the quagmire of useless political grandstanding that will never amount to anything.\n\nI sure hope the karma points are worth it.",
                            "score": 22,
                            "author": "monet108",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Goddammit, I think I love you.",
                                    "score": 11,
                                    "author": "RagingRedHerpes"
                                },
                                {
                                    "level": 3,
                                    "comment": "An yet here you are grandstanding on Reddit perhaps you should practice what you preach.",
                                    "score": -3,
                                    "author": "Doomer1996",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You’re literally grandstanding on his grandstanding lmfao!!",
                                            "score": 9,
                                            "author": "desizombi3"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Op posts on IATPOS calls people bozos",
            "score": 5,
            "author": "threeeyesthreeminds"
        },
        {
            "level": 0,
            "comment": "No loss",
            "score": 2,
            "author": "AlbertaChuck",
            "replies": [
                {
                    "level": 1,
                    "comment": "Get Canadian healthcare",
                    "score": -7,
                    "author": "Doomer1996"
                }
            ]
        },
        {
            "level": 0,
            "comment": "These comments are being just as vile as the original tweet. It's like when any natural disaster happens in the south, they see that state rescue efforts are subpar, then take the high horse of saying \"those ignorant southerners got what's coming, shouldn't have voted red 🙄.\" It's inhumane and only pushes those who vote further from your side due the lack of basic humanity you possess. Good post, OP.",
            "score": 3,
            "author": "Igneoramous",
            "replies": [
                {
                    "level": 1,
                    "comment": "“Lack of basic humanity” Like when Covid first hit and wasn’t taken seriously because it was mostly appearing in blue states? Spare me.",
                    "score": 10,
                    "author": "Resident_Bid7529",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ah yes the \"people were shitty so now Im going to be shitty\" defense. \n\nYou do realize a eye for an eye leaves the world blind right?",
                            "score": 2,
                            "author": "Doomer1996"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wow that guy is a dick",
            "score": 4,
            "author": "Beautiful_Gate3184",
            "replies": [
                {
                    "level": 1,
                    "comment": "Apparently not since majority of redditors commenting on this post agree with the guy. 🙄",
                    "score": 11,
                    "author": "Doomer1996",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You’re allowed to acknowledge that he’s technically correct while being an insufferable dick about it. Those two things aren’t mutually exclusive.",
                            "score": 10,
                            "author": "Chairman_Me",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He's not even right on a technical level since it was a Pennsylvanian train on Pennsylvanian tracks and it was Pennsylvanians who decided to burn the chemicals so they can rush to get the tracks opened back up asap thus fucking over Ohioans. \n\nSo to summarize a train in a blue state derails an so the blue state poisons the air, water, and soil of the neighboring red state just so they can get their tracks opened up sooner rather than later an this guy is going haha red state deserved it they should of voted blue.",
                                    "score": 6,
                                    "author": "Doomer1996",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The main issue here is capitalism and the harm it does. We will never overcome this type of destruction we do to the environment and our health without taking profit motives out of the picture. Plain and simple.",
                                            "score": 6,
                                            "author": "Sanchez_U-SOB"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "As a queer woman liberal in Florida, please please please do not think like this.",
            "score": 0,
            "author": "BethyW"
        },
        {
            "level": 0,
            "comment": "Kinda has a point but there’s also plenty of people that didn’t vote a certain way suffering too",
            "score": 1,
            "author": "Hunterxmike"
        },
        {
            "level": 0,
            "comment": "…*hangs head in shame because I have had similar thoughts*",
            "score": -2,
            "author": "PaigeRiley89"
        },
        {
            "level": 0,
            "comment": "Water doesn't flow uphill",
            "score": 1,
            "author": "essentialrobert"
        },
        {
            "level": 0,
            "comment": "So can I not drink my tap water?",
            "score": 1,
            "author": "LumisFumishiki",
            "replies": [
                {
                    "level": 1,
                    "comment": "Im not better safe than sorry but that's up to you if you wanna risk it.",
                    "score": 0,
                    "author": "Doomer1996"
                }
            ]
        },
        {
            "level": 0,
            "comment": "only in ohio",
            "score": 1,
            "author": "justletmeh"
        },
        {
            "level": 0,
            "comment": "I live in Pittsburgh. We don't vote against ourselves here but still we're stuck with the consequences.",
            "score": 1,
            "author": "weedRgogoodwithpizza"
        },
        {
            "level": 0,
            "comment": "oh my god i live in that area im terrified",
            "score": 1,
            "author": "hunkypickle59"
        },
        {
            "level": 0,
            "comment": "Nobody hates Americans as much as other Americans do.",
            "score": 1,
            "author": "Aggressivehippy30"
        }
    ]
}