{
    "id": "117dxx9",
    "score": 16539,
    "title": "You dont have rights.",
    "author": "twelveatnite",
    "date": 1676912640.0,
    "url": "https://www.reddit.com/r/iamatotalpieceofshit/comments/117dxx9",
    "media_urls": [
        "https://v.redd.it/772l3ktu1fja1"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\nPlease note that we will ban you if a post or comment breaks any of our rules. **Be especially mindful of the following**:\n\n**Rule 1: Do not post or ask for identifying information, including first and last names and social media usernames.** Public figures are **not** exempt. We remove all external links to prevent accidental posting of identifying information.\n\n**Rule 2: Do not post violent comments, and do not glorify violence, per TOS.** We can't take responsibility for how angry a post makes you, you need to do that. Telling us \"it was a joke bro\" is not an excuse.\n\n**Rule 7: Do not link to or post screenshots of reddit posts, reddit comments, reddit personal messages, reddit profiles, etc.** We cannot allow you to use this subreddit to harass other people on reddit. \n\n**Rule 8: No bigotry, no racism or race baiting.** It is hard to believe that we even need a rule like this. \n\n**Our rules are zero tolerance. You will be banned for breaking them.**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/iamatotalpieceofshit) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Despite that the guy isn’t even who they are looking for, committed no crime, was complying, not armed or dangerous, never told to put his hands behind his back before, wasn’t detained, and the list goes on…How does someone put their hands behind their back when being bear hugged from behind by a LEO… any reasonable person would freak out, shut down, or atleast take a good bit of time to process what’s going on.",
            "score": 4059,
            "author": "scottygoesfar",
            "replies": [
                {
                    "level": 1,
                    "comment": "Did you see the cop's face? Completely devoid of emotion. Zero humanity. They hate anyone who remotely seems as if they're being disrespectful or uncooperative. When the other officers witness this behavior, they just braindeadly go along with it. They don't care. At all. The lawsuit won't effect their jobs or their money. We, the **victims**, are required to foot the bill.",
                    "score": 2144,
                    "author": "xReshi92",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There is a certain despair in the fact that we have to pay for our own oppression.",
                            "score": 708,
                            "author": "ThomasTServo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That’s a feature, not a bug.",
                                    "score": 239,
                                    "author": "New-Understanding930"
                                },
                                {
                                    "level": 3,
                                    "comment": "We don't *have to*.\n\nEventually they are going to push too much. Then they will see extreme blowback by whatever group they end up attacking. \n\nIt has happened numerous times in history. \n\nEveryone forgets that the FIRST thing the founding fathers thought about after freedom of speech/religion and the right to bear arms was the anti-cop/military No Billeting amendment.",
                                    "score": 73,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I’ve been feeling like that time is now for awhile now. They rule through fear and people need to stop being content with this.",
                                            "score": 11,
                                            "author": "Loriali95"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "We are the visigoths 😉",
                                            "score": 5,
                                            "author": "CumSlut1972"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "r/aBoringDystopia",
                                    "score": 39,
                                    "author": "Xendarq",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Despair shall feed the bear, and the bear shall take over the world, in the single most tragic event in all of human history.\n\nI wish this were a joke.",
                                    "score": 11,
                                    "author": "Terra_throwaway"
                                },
                                {
                                    "level": 3,
                                    "comment": "America is a fucking blazing cesspit, couldn’t pay me to live there.\n\nWell… maybe a million dollars a month, I might consider it for that.",
                                    "score": 47,
                                    "author": "mostly-reposts",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You might be able to afford a home here on that salary!",
                                            "score": 38,
                                            "author": "DrThunder66",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "When the first cop tells him that they got the guy with the warrant you can see on the officer's face to the left of the video (the one who slammed him) that he realized he fucked up.",
                            "score": 317,
                            "author": "anna_lynn_fection",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The realization you'll have to spend paid time off at home with the wife \"1000 yard\" stare...",
                                    "score": 212,
                                    "author": "DrothReloaded",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "And his arms are all tired already from body slamming innocent people, so his favorite activity with his wife just sounds exhausting right now",
                                            "score": 44,
                                            "author": "Key-Lime-8851"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "And getting a promotion to Lt. from what I read. But at least the guy got a settlement from the city.",
                                            "score": 12,
                                            "author": "GZ-Onan"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 80,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It’s not regret, it’s fear of consequences.",
                                            "score": 39,
                                            "author": "ConstructionOther686",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "What consequences? 2 weeks paid vacation and and internal investigation clearing them of wrongdoing?",
                                                    "score": 38,
                                                    "author": "NerdyToc",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It gets worse than that. Might have to move to another county.",
                                                            "score": 14,
                                                            "author": "rhynoplaz",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Good point, moving to a tropical country with a lifetime medical pension for PTSD from shooting suspects in the back would be rough",
                                                                    "score": 20,
                                                                    "author": "NerdyToc",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "County*, not country",
                                                                            "score": 3,
                                                                            "author": "CmdrWinters"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I noticed how they all go silent after that",
                                    "score": 4,
                                    "author": "Ambitious-Pin8396"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Friend was taught in the police academy that anyone who doesn’t follow directions 100% is a threat. \n\nHe didn’t put his hands behind his back! Bear hug doesn’t count as a reason. /s",
                            "score": 131,
                            "author": "designgoddess",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Which is why they intentionally give conflicting commands. They do everything they can to book you for resisting arrest. No crime even needs to be committed in the first place for them to get to that point. They just have to start assaulting you.",
                                    "score": 134,
                                    "author": "xReshi92",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Its called chipping, its purpose is to get any emotionally frustrated response take it as an escalation, and go straight to making getting beat out of a gang seem nice.\n\nRemember you have to be perfectly calm and composed or they can execute you sumarrily because you not being zen calm is a threat to them.\n\nThey however can act like a dramatical emotional child and murder you out of fear for any sound or tiny movement you make, even those they told you to.",
                                            "score": 129,
                                            "author": "Eaywen",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "They did this in that hotel where the police murdered an innocent guy with a world's most deadly and confusing game of simon says.",
                                                    "score": 74,
                                                    "author": "trash-_-boat",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "His name was Daniel Shaver. He was on his hands and knees, tears were running down his face as he begged for his life and the murderer put 5 bullets in him because he wanted to murder him",
                                                            "score": 89,
                                                            "author": "myfaceaplaceforwomen",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "And then in 2019 the department rehired him so he could medically retire (suffers PTSD) taking advantage of a $31,000/year pension. Fucked up. Should have swapped to his taser once the ‘suspect’ was on all 4s and looking at the ground.",
                                                                    "score": 56,
                                                                    "author": "Ml2323",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "But then he wouldn't have been able to murder him and put another notch on his gun",
                                                                            "score": 46,
                                                                            "author": "myfaceaplaceforwomen",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "You mean the gun that said \"You're Fucked\" on the inside of the dust cover? That the judge wouldn't allow the jury to see because it was \"too prejudicial\"?",
                                                                                    "score": 8,
                                                                                    "author": "Proof_Bathroom_3902",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "No he should have told the guy to continue laying hands on his head while one cop stays back gun drawn, the other moves down the opposite wall while he too can even keep his gun up. Once he reaches the guy holster the weapon and cuff him because your buddy down the hall still has you covered if he tries anything. I have zero tactical training and it’s that obvious to me.",
                                                                            "score": 10,
                                                                            "author": "DiscoMagicParty"
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Dont forget his gun literally said \"GET FUCKED\". \n\nHe wasnt going there to arrest anyone.",
                                                                    "score": 16,
                                                                    "author": "iownaxult",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Did you see the dude legally carrying being told to take the gun out of his holster and throw it on the ground.  He has his hands straight up screaming no because they're going to shoot him.  He slowly complied only to be shot as soon as he touched it.\n\n\nBest part, the department's lawyer said his initial reaction to not reach for his gun showed non compliance and is what lead to his death.",
                                                            "score": 47,
                                                            "author": "Nandom07",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "The system works.\n\nMy favorite part is that the 2A crowd are all but completely silent about cops shooting people for the mere act of being armed, despite the fact that you can be shot for appearing armed cementing the fact that the right to bear arms doesn't exist unless the government wants you armed.",
                                                                    "score": 24,
                                                                    "author": "NerdyToc",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "That brings up a good point. Cops should not be that ducking terrified of someone carrying a gun in the US. So many fucking people have guns and these guys have all grown up knowing that. The fact that someone’s armed shouldn’t immediately trigger them into a fucking frenzy.",
                                                                            "score": 14,
                                                                            "author": "DiscoMagicParty",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "It’s yet another example of how these guys seem to think they’re in a war zone without any ability to actually survive in one and fucking up even harder than people that actually do fight in war zones.",
                                                                                    "score": 8,
                                                                                    "author": "BunnyOppai",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I support 2a and despise cops like this.",
                                                                            "score": 11,
                                                                            "author": "Ok-Funny5552",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Straight out of Bill Hicks jack palance bit",
                                                                    "score": 4,
                                                                    "author": "IanSavage23",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I used to work in community mental health. Cops love to beat people in mental health crisis.",
                                            "score": 20,
                                            "author": "Blynn025",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I had a GF that was an EMT and they had a homeless person break into a bar and the responding officers decided he wanted to treat dude like speed bag with no protective equipment. Punching and breaking skin on HIV positive person maybe not something you want to do . Think before you tyrant",
                                                    "score": 13,
                                                    "author": "MrPlatonicPanda"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 8,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "There is about no reason left to call the cops.  Need to get your dog or you kids shot?  Call the cops.  If you are the victim of a crime.... both time I called they were insanely useless and very clearly said they were not going to investigate or look for who done it.  Even AFTER i had found my stuff back on a Craigslist type site and could prove the stuff was mine.  Dangerous, useless at best.",
                                                            "score": 5,
                                                            "author": "Goat_tits79"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Also done intentionally.",
                                            "score": 5,
                                            "author": "designgoddess"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I just saw a post about characterizing the brains of psychopaths by scans. \n\nWould be interesting to run those scans on the police force vs randomly selected civilians",
                            "score": 23,
                            "author": "justwalkingalonghere"
                        },
                        {
                            "level": 2,
                            "comment": "&gt; They hate anyone who remotely seems as if they're being disrespectful or uncooperative\n\nI would go even further to say this is demonstrative of a police department - Yes, with that many officers there this is a training issue, not an individual issue - that is both incapable of admitting fault and unwilling to do proper investigation.",
                            "score": 7,
                            "author": "MediocreDungeonMastr",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "All Cops Are Bastards.",
                            "score": 16,
                            "author": "Cochise1977"
                        },
                        {
                            "level": 2,
                            "comment": "It's  aldosta GA, these guys will be heros on the force. So sick of police immunity. Thstoney shouldn't come from tax payers. It needs to come from their pensions. If thst were to happen a lot ore cops would be good.",
                            "score": 15,
                            "author": "Belyal",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Exactly, if your actions threaten my pension, I’m calling you out. Shouldn’t have to be that way but here we are. Cop recording was being civil &amp; talking to this man &amp; his co worker comes up &amp; f’n body slams the guy right in front of him…",
                                    "score": 15,
                                    "author": "smallzy007"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I call them sociopaths.",
                            "score": 5,
                            "author": "vagueblur901"
                        },
                        {
                            "level": 2,
                            "comment": "That’s because he’s a psychopath and the profession in America breeds psychopaths.",
                            "score": 3,
                            "author": "Correct_Campaign5432"
                        },
                        {
                            "level": 2,
                            "comment": "Yep and no one cares, just keeps happening.",
                            "score": 6,
                            "author": "Dear-Unit1666"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "“How does someone put their hands behind their back when being bear hugged from behind…”\n\nThat’s the point of that move. It then gives the officer the ability to say “he wasn’t complying.” It’s fucked up. They teach these things to cops in order to “help” them stay out of trouble. Like yelling “stop resisting” while they have someone on the ground. \n\nGives them more opportunities to be rough and awful while having plausible deniability. It’s disgusting",
                    "score": 217,
                    "author": "The_Mighty_Bird",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Even worse, if you are being bear hugged from behind and go to put your hands back, you are moving them right to the officer's equipment belt.\n\n\"He was reaching for my gun\"",
                            "score": 88,
                            "author": "64557175",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Yeah it's actually really sick and twisted if you think about it. All these techniques they come up with to literally abuse people.",
                            "score": 31,
                            "author": "Fridsade"
                        },
                        {
                            "level": 2,
                            "comment": "When I was in high school, one of my church youth leaders was a cop and he gave us a whole presentation on how they handled people they were arresting and he showed us all the ways they would surreptitiously hurt people while holding them to make them squirm and “resist” so they could add resisting arrest to the charge. It was wild.",
                            "score": 112,
                            "author": "Fe1onious_Monk",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Sounds like a godly man to mentor youth too.",
                                    "score": 76,
                                    "author": "Always_0421"
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt;one of my church youth leaders \n\nDid anyone there ask him if he felt that was a Christian way to act...?",
                                    "score": 59,
                                    "author": "StiltonG",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Probably not.  They don't like questions that call out their bullshit.   \n\n\nYes, I refer to both the church and the police.",
                                            "score": 31,
                                            "author": "toTheNewLife"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Sound perfectly christian to me. Only thing missing is the diddling kids part.",
                                            "score": 15,
                                            "author": "ScotchIsAss"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Thank goodness we have such strong men leading the Christian youth 😇 /s",
                                    "score": 22,
                                    "author": "The_Mighty_Bird"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I saw a report with research that they literally tell “stop resisting!” or things of that nature specifically so that witnesses can hear and implicit bias takes over because months later in a courtroom, those witnesses are more likely to remember hearing the cop shout those directions than anything visual they might have seen.",
                            "score": 15,
                            "author": "Shit_Apple"
                        },
                        {
                            "level": 2,
                            "comment": "He either tries to put his hands behind his back, and is resisting, or doesn't put his hands behind his back... And is resisting...",
                            "score": 6,
                            "author": "nennerb15"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Nothing will change until cops have to carry malpractice insurance just like doctors. Until they're actually responsible, which is hilariously ironic for the \"take responsibility for your actions\" crowd that fox news loves to parrot.",
                    "score": 75,
                    "author": "BeingRightAmbassador",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Nothing will change until police departments stop covering this people and other officers doing even worst things, like killing people, being fired and then being hired again after a few months.",
                            "score": 5,
                            "author": "HumaDracobane"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "And if he does manage to put his hands behind his back \"he's reaching for my gun!\"...",
                    "score": 20,
                    "author": "CollectionStriking"
                },
                {
                    "level": 1,
                    "comment": "&gt;How does someone put their hands behind their back when being bear hugged from behind…\n\nFor real.  This was my first thought.  The arriving officer is holding the guy's arms at his side and is aggressively spooning him so hard that his dick is practically in the man's ass.  How the hell is he suppose to put his hands behind his back?  Where?  There is no space left to put his arms into.\n\nAlso, even if the man had space to move his arms into, I wouldn't blame him for freaking out and being non-compliant.  The way the arriving officer grabbed a hold and pressed into him was so suddenly and oddly sexual, I half expected him to start whispering seductively into the man's ear and for the Hub's logo to show up in the corner.",
                    "score": 19,
                    "author": "ThrowAway233223",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Not that youre saying otherwise but I wanna piggy  back on your comment to add that even had he been who they were looking for, even had he commited a crime, even had he been not complying, this was entirely uneceassary and reckless.",
                    "score": 39,
                    "author": "Kenevin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Absolutely. Why would ANYONE trust these people, ever.",
                            "score": 7,
                            "author": "scottygoesfar",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It is almost like a game they play. Two different cops shouting different orders at you. Or one (or more) cop(s) holding you in some way while another (others) shout orders at you that you can't comply with.\n\nThis means they get to use pain compliance to get you to do what they want. Pain compliance is just a fancy phrase for kicking the shit out of someone.\n\nThis is bullshit. In America we aren't presumed innocent unless we are in the top 1%. We have no rights, because if a cop can beat the shit out of you or kill you for no reason then you have no rights. And most often these cops are not only able to get away with this abuse with no negative consequences. They are also promoted.",
                    "score": 11,
                    "author": "notTumescentPie"
                },
                {
                    "level": 1,
                    "comment": "There's a reason ACAB is 100% true and all LEO in America should be replaced immediately. The entire institution is completely corrupt from the highest point, down.",
                    "score": 7,
                    "author": "ApologizingCanadian"
                },
                {
                    "level": 1,
                    "comment": "Just to add onto this, he also didn’t resist when he got bear hugged and still got body slammed",
                    "score": 6,
                    "author": "StichedSnake"
                },
                {
                    "level": 1,
                    "comment": "Not to mention, putting his hands behind his back in that situation could be interpreted as reaching for the officers weapon, it's a loose loose situation, as intended.",
                    "score": 3,
                    "author": "NerdyToc"
                },
                {
                    "level": 1,
                    "comment": "Also note that one cop knew nothing was wrong, but just went along with it. \n\nBecause that's the culture. That's what they think they're supposed to do. \n\nThey're chickenshits at war with the people.",
                    "score": 3,
                    "author": "stzmp"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Cops while hand cuffing somebody after breaking their bones/injuring them: just relax and stop struggling 🥺",
            "score": 1987,
            "author": "Fish_Fucker2136",
            "replies": [
                {
                    "level": 1,
                    "comment": "“PUT YOUR ARMS BEHIND YOUR BACK” -as he holds his arms from being able to move-",
                    "score": 292,
                    "author": "NewDadInNashville"
                },
                {
                    "level": 1,
                    "comment": "Or when the fat ass cop is sitting on their back demanding their hands when their hands are pinned by the lard ass cop sitting on them.",
                    "score": 399,
                    "author": "Just_Another_Scott",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And then they eventually show their hands and the cop fears for their life and shoots them thinking a gun a gun is somehow there",
                            "score": 109,
                            "author": "DANleDINOSAUR"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What are we to take from this other than cops enjoy hurting people? That man was not resisting and posed no threat to the cops or anyone.",
            "score": 880,
            "author": "ststeveg",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s easier to explain away their shitty behavior when IF they got the right guy",
                    "score": 139,
                    "author": "State_Conscious",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Victim blaming is their default MO. My favorite is when they attacked the nurse who refused to allow cops to try and victim blame someone they hurt.",
                            "score": 88,
                            "author": "Thengine",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 23,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The charisma bit seems rather lacking",
                            "score": 4,
                            "author": "newfor2023",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Absolute pigs",
            "score": 268,
            "author": "vegancryptolord",
            "replies": [
                {
                    "level": 1,
                    "comment": "I feel that's a disservice for pigs. Pigs are cute, friendly, intelligent and serve a purpose in society.",
                    "score": 41,
                    "author": "PrinceCheddar"
                },
                {
                    "level": 1,
                    "comment": "And they wonder why pigs is synonymous with police",
                    "score": 21,
                    "author": "SnooBooks1701"
                }
            ]
        },
        {
            "level": 0,
            "comment": "And cops don't understand why most folks don't care for them",
            "score": 1243,
            "author": "Ogre730",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m sure they all have matching tattoos on their chests that say some BS like, “The sheep don’t like the wolves.” And that’s all the thought they’ll put into it.\n\nEdit: a letter",
                    "score": 299,
                    "author": "Andysue28",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's worse, it's \"to a sheep, a sheepdog looks like a wolf\". They really think victimizing this man is protecting the rest of the dainty population.",
                            "score": 110,
                            "author": "Praescribo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; to a sheep, a sheepdog looks like a wolf\n\nAnd this just doesn't even make any sense. Any one who's been around sheep and sheep dogs know that the dogs get integrated into the herd early in their lives.\n\nSheep definitely do not think sheep dogs look like wolves.\n\nGuess what? Wolves look like wolves, you bastards.\n\nACAB",
                                    "score": 52,
                                    "author": "RustWallet",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Even Ol' Yeller got put down after getting rabies. And all these cops are frothing at the mouth to put their hands on someone...",
                                            "score": 9,
                                            "author": "chaos_nebula"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Pigs also think that everyone is a perp. They just haven't been caught yet.",
                                    "score": 17,
                                    "author": "toTheNewLife",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I know people who keep pig farms. Those bastards will eat literally anything you put in front of their faces, even pork",
                                            "score": 4,
                                            "author": "Praescribo"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Also forgetting the basic logic of that analogy. If a workdog bites the hand of the owner, it is considered a wolf, and not a member of the pack and they're taken out and shot. So these cops are comparing themselves to the sheepdog but that's where the analogy ends.",
                                    "score": 3,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I bet they know.",
                    "score": 61,
                    "author": "nuckle",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "“Don’t care for them” ??\nHate* \nwish they’d get shot* \nWant to watch them die slowly*",
                    "score": 5,
                    "author": "State_Conscious"
                },
                {
                    "level": 1,
                    "comment": "And are literally terrified of police interactions.\n\nThis makes me sick.",
                    "score": 2,
                    "author": "miquesadilla"
                },
                {
                    "level": 1,
                    "comment": "Has something to do with all cops being bastards",
                    "score": 20,
                    "author": "madafaku"
                }
            ]
        },
        {
            "level": 0,
            "comment": "They knew they fucked up",
            "score": 72,
            "author": "kagein12",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I fucking love body cameras",
            "score": 186,
            "author": "BullBearAlliance",
            "replies": [
                {
                    "level": 1,
                    "comment": "Looking for this.   \n\nI'm not about watching cops kill people but these should be mandatory everywhere.  I'm not all about big brother and it's sad that the police need such a leash shoved up their ass but damn I'd they would just do their jobs properly and not fuckin injuring  and execute mfers constantly they probley wouldn't need it.  Also do they just forget that those things are on like for really real?",
                    "score": 38,
                    "author": "ChartMysterious9610",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There literally had to be laws put in place punishing them severely for turning it off to keep them from turning it off... Then there had to be laws development punishing them for \"losing\" the footage for them to stop \"losing\" the footage. Then there had to be laws put in place severely punishing them to keep them from tampering with the vehicle cams...\n\nBut once they've been there for a while, yes, people tend to fail to remember that cameras are there until they have a reminder.",
                            "score": 13,
                            "author": "mndyerfuckinbusiness"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Was there a major case or an incident or something that made it mandatory for cops to wear body cameras?   \nSorry, just genuinely curious.",
                    "score": 11,
                    "author": "txrant",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "*Points at the vast pile of incidents*",
                            "score": 8,
                            "author": "Zantrap"
                        },
                        {
                            "level": 2,
                            "comment": "Possibly one you can point to was when they were experimenting with body cameras, and the cop was caught planting evidence. That video still makes the rounds to this day. It’s discernible by the grainy quality of the video. You’ll know when you see it.",
                            "score": 12,
                            "author": "BullBearAlliance"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The city settled for $350,000, and charged the taxpayers - who continue to vote in a manner that supports this behavior from their police department and proceeds to blame anyone but those responsible for their new tax liability.",
            "score": 830,
            "author": "EatSleepJeep",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m shocked it settled. With film like this, I’d laugh at a settlement.",
                    "score": 82,
                    "author": "Spicywolff",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The reason most people settle is because if you take this to a jury trial and they award you less you get nothing, so would you like to gamble $350,000 with the chance to end up with nothing",
                            "score": 54,
                            "author": "lukewwilson",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I’m shocked that going to jury tries would even have the risk of less $$. Clearly this is wrong on LEO in many forms. I’d think this a cut and dry case",
                                    "score": 24,
                                    "author": "Spicywolff",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah a jury can say they were guilty, that's not the issue, if the jury sides with you but awards you less money then you were offered, you get nothing. The jury wouldn't know what you were offered. Not every state is that way, but his night be",
                                            "score": 17,
                                            "author": "lukewwilson",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Also, the judge often has the power to reduce the money you're awarded, or states will have caps on payouts in lawsuits but there's no caps on settlements",
                                                    "score": 7,
                                                    "author": "SnooBooks1701",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Juries are composed of people. \n\nPeople are,  commonly,  not very bright",
                                            "score": 4,
                                            "author": "__Snafu__"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "\"I'll not settle for less than $5,000,000 if the officer who broke my arm isn't placed in prison for several years. The added trauma it would cause me to know he's free to further assault me is almost too much to bare.\"",
                    "score": 103,
                    "author": "ColeSloth"
                },
                {
                    "level": 1,
                    "comment": "Typical Georgia behavior. I mean, they elected Marjorie Trailer Queen.",
                    "score": 150,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I found out that Margie Taylor Green went uncontested that's how she got in office.",
                            "score": 51,
                            "author": "mrastronomyiss",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 53,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thank you for that clarification. 🙂",
                                            "score": 6,
                                            "author": "mrastronomyiss"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "2020 - Georgians aren't that stupid, she won uncontested.\n\n2022- \"hold our beer\" - Georgians.",
                                            "score": 39,
                                            "author": "jesus_had_a_vagina",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "...because she and her goons ran her opponent out of town with threats.",
                                    "score": 6,
                                    "author": "RuinedEye"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Her district is less than 800k out of almost 11 million people who live in Georgia so acting like she represents all of Georgia is a little silly",
                            "score": 7,
                            "author": "scullys_alien_baby",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You should see how small jim Jordans district is",
                                    "score": 8,
                                    "author": "autosdafe",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "All districts are less than 800k.\n\nThat's how they're divided.  The average district size nationwide is 761,169 people.\n\nAll representatives are voted into office from a pool of that size.\n\nThe problem with Georgia is it has been gerrymandered to hell by right wing state legislature that every district pretty much is made up of an at times overpowering rural vote to dilute Atlanta.  So, if you look at it by district, it pretty much does resemble every other district in Georgia.",
                                    "score": 5,
                                    "author": "MjrLeeStoned"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 20,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Aggravated Assault. That's exactly what this is. Aside from being the wrong guy, he was being cooperative before and after the escalated and they didn't do their own due diligence, directly leading to the mistake. Just an awful job all around leading to the Aggravated Assault of an innocent citizen. Suing and pressing charges is 1000% the right call.",
            "score": 46,
            "author": "Danger_Dave_"
        },
        {
            "level": 0,
            "comment": "After a certain age, a broken wrist won't ever get back to a prior level of functioning even with the best surgeon and dedicated physical therapy.",
            "score": 35,
            "author": "ThomasTServo"
        },
        {
            "level": 0,
            "comment": "These cops should be investigated by internal affairs.",
            "score": 298,
            "author": "TheRealDaddyPency",
            "replies": [
                {
                    "level": 1,
                    "comment": "They will be, and will be found to have done nothing wrong. This is not going to change until them getting sued for this comes out of their own pensions.",
                    "score": 221,
                    "author": "cityshepherd",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;This is not going to change until them getting sued for this comes out of their own pensions.\n\n\\+1 Yes!  Not enough people are talking about this. The reason these abuses of civil liberties keep happening is that the cops don't get punished, the taxpayers do. The city settles, pays the victim, but the taxpayers pay it. So it's no cost at all the the A-holes in the PD who are doing all of this crap.  The Police union has always had the upper hand, but this has to stop. \n\nThe copy who bear hugged and body slammed this guy should have been fired, lost his pension, and should actually have been charged with assault.",
                            "score": 51,
                            "author": "StiltonG",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not to be that guy, but the moment you make cops responsible, then they won't do their jobs at all. The ~~mob~~ cops will then sit back and let crime happen unless it's a slam dunk bust.",
                                    "score": 9,
                                    "author": "LowSkyOrbit",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's ok to bring up that perspective.  It's never as simple a situation as any of us make it sound when we're commenting on a subject like this.  For the record, I'm not one of those advocating to abolish the police.  I recognize we need police. But I truly don't think it's right that police generally don't face consequences for depriving citizens of their civil liberties as in this particular case. The cop who body slammed the guy for nor reason at all I do believe should be fired and he should suffer a significant financial penalty (at least part of his pension should be used to pay the victim).  It's not fair that the taxpayers have to pay for his inexcusable actions.  If other police officers don't like that, they are free to quit.  If they stop working altogether and do nothing to help prevent crime, then they should be fired and replaced with people willing to work.",
                                            "score": 10,
                                            "author": "StiltonG",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Wow you are....entirely too reasonable a human being for reddit.",
                                                    "score": 5,
                                                    "author": "GrevilleApo"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt;\tthe moment you make cops responsible, then they won’t do their jobs at all.\n\nHow much of their jobs do you think cops like this do in the first place?",
                                            "score": 4,
                                            "author": "Reddituser0346",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "There is video of them being criminals, they should be fired, arrested and charged with hates crimes.",
                    "score": 53,
                    "author": "Use_this_1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The problem is in the words \"They did nothing wrong\".  99.99% of us watching the video know they did something wrong, but that's not where the burden is.  The burden is whether or not they broke Department Policies.  If there's no policy that says you can't do that, the officer simply says \"There's no policy against it\" and they get off with zero liability.  There are way too many shields for these idiots to hide behind.",
                            "score": 8,
                            "author": "ZestycloseRepeat3904",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Seems like that’s an abuse of cruel and unusual punishment resulting in humiliation of the subject in question. I mean if we’re going to white wash this matter why not strip this man of everything that makes him human. Why not strive for a better tomorrow by doing what we’re all capable of. People forget that “we the people,” hold the power in this nation. We can fight back, not through violence, but through peaceful demonstration(s). If they fight peace with violence, our leaders (that we vote in) will surely stop the violence, and if they don’t, we will retake our government through any means necessary.",
                                    "score": 3,
                                    "author": "TheRealDaddyPency"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Or an actual criminal court, in front of a jury of their peers, like the rest of the population would be.",
                    "score": 11,
                    "author": "CainRedfield"
                },
                {
                    "level": 1,
                    "comment": "I think the investigation board should be done by civilians, lawyers and maybe one useless cop to explain why they're doing what they're doing.",
                    "score": 3,
                    "author": "Professional-Bat4635"
                },
                {
                    "level": 1,
                    "comment": "Nah, the world needs more Chris Dorners.",
                    "score": 2,
                    "author": "ShirosMissingArm"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What I want to know is why the original cop does nothing to stop it. There’s no way in hell he didn’t see that walrus coming up behind the guy. Couldn’t he just wave the other cops off to show he was in no danger?",
            "score": 74,
            "author": "Advantage_Loud",
            "replies": [
                {
                    "level": 1,
                    "comment": "How some other officers have been treated after interfering with/calling out/reporting the abuse being carried out by their fellow officers may have something to do with that.",
                    "score": 18,
                    "author": "ThrowAway233223",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That makes sense",
                            "score": 3,
                            "author": "Advantage_Loud"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "because acab",
                    "score": 45,
                    "author": "yelo_canu",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Just another reminder to never trust cops",
                            "score": 22,
                            "author": "ElonMuskIsAPedophiIe"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Cops that try to stop abuse get murdered, there was one in LA last year who reported a fellow officer for SA and then he was killed by his fellow officers",
                    "score": 5,
                    "author": "SnooBooks1701",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Why would he stop it? Cops enjoy hurting people. The profession doesn't attract normal people, it attracts sociopaths who condone this behavior. \n\nEvery single cop in this video thought that breaking a man's wrist was the right way to handle this situation.",
                    "score": 9,
                    "author": "deikobol",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "The city settled. I’m seriously tired of tax payers paying for government mistakes. If a city goes bankrupt then they go bankrupt. Let a new government come in. At the very least everyone working for the city gets fired or layed off and gets replaced",
            "score": 20,
            "author": "barelycriminal"
        },
        {
            "level": 0,
            "comment": "The more I see these videos: the more I think that the American Police System need a major reform.",
            "score": 128,
            "author": "OscarTeeVee",
            "replies": [
                {
                    "level": 1,
                    "comment": "bro it's been a broken record decades ago",
                    "score": 22,
                    "author": "dotcomslashwhatever"
                },
                {
                    "level": 1,
                    "comment": "Oh yea some of these guys seem like real jerks",
                    "score": 14,
                    "author": "MuayJacked",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s putting it nice and lightly! Stronger words come to my mind",
                            "score": 6,
                            "author": "bentheruler"
                        },
                        {
                            "level": 2,
                            "comment": "Real knuckleheads",
                            "score": 2,
                            "author": "mattyag"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Abolition. You can't reform this level of authoritarianism.",
                    "score": 4,
                    "author": "burnhaze4days",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Excessive force? ✅\n\nViolation of this man’s civil rights? ✅\n\nHope this gentleman is paid WELL by the City of Valdosta, GA",
            "score": 13,
            "author": "too_rolling_stoned",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Thank god our brave officers body slammed this THREAT! /s",
            "score": 111,
            "author": "AuthenticCM",
            "replies": [
                {
                    "level": 1,
                    "comment": "The only things this poor guy was guilty of was being black and having the audacity to think he has rights as an American.",
                    "score": 24,
                    "author": "margotgo"
                },
                {
                    "level": 1,
                    "comment": "JuSt CoMpLy!",
                    "score": 18,
                    "author": "The_Mighty_Bird"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Horrible have you ever thought of  before body cams and smart phones  how many innocent citizens were severely injured and murdered then covered up by the so called blue wall over say the last 100 years? I wonder has to be hundreds of thousands.",
            "score": 35,
            "author": "PJleo48",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was thinking this the other day. When did bodycam really become a thing throughout the US? Mid 2000s? Imagine all the years before that.",
                    "score": 13,
                    "author": "NobodyWins22"
                },
                {
                    "level": 1,
                    "comment": "The NYPD and various NYC DA's have lost entire warehouses full of evidence to fires after the Innocence Project started up and began investigating previous convictions. \n\nSo yeah, a lot of people who 'looked good for it' had their lives absolutely shattered due to people like these police officers.",
                    "score": 11,
                    "author": "socialcommentary2000",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I did not know that extremely interesting info. One big cover up.",
                            "score": 4,
                            "author": "PJleo48"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What the heck, he throws him down from behind with no warning. That walk up behind him just got so menacing as we see his intent to just arrest him.",
            "score": 56,
            "author": "DineAndWineHours",
            "replies": [
                {
                    "level": 1,
                    "comment": "Pins arms to side, \"put your hands behind your back!\"",
                    "score": 28,
                    "author": "lebastss"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Perhaps one could use common sense and listen to how this guy was speaking to understand he wasn't a threat. I understand anyone can potentially be, but come on, you don't need to be a \"seasoned vet\" to see this guy was not that whatsoever. Fucking cops without training and/or natural common sense.\n\nNow this poor man has been traumatized for life and more hatred towards cops will be coming. Genuine officers need to step up and condemn the hell out of these no-thought cops who have small, fragile egos and absolutely zero professionalism.",
            "score": 6,
            "author": "MSK84"
        },
        {
            "level": 0,
            "comment": "We need to continually sue these police stations and police officers. It's far passed time police have accountability.",
            "score": 8,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "It’s hard to fathom there are still cops out there that remain so fucking stupid?!!",
            "score": 34,
            "author": "Plantiacaholic",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s not a job for the best and brightest, just for the aggressive, racist and easily scared.",
                    "score": 16,
                    "author": "State_Conscious",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hear me out. What if cops thought about something before just doing it.. I guess that would take some critical thinking.. I may be asking too much of them",
            "score": 21,
            "author": "ALegendaryShrimp",
            "replies": []
        },
        {
            "level": 0,
            "comment": "We dOnT haVe ThE fULll cOnTeXt my funny cop boys would NEVER do this 😭😭 /s",
            "score": 91,
            "author": "HarmenSmith",
            "replies": [
                {
                    "level": 1,
                    "comment": "Just bad apples!",
                    "score": 20,
                    "author": "The_Mighty_Bird",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "People make the mistake of thinking that they can just talk to cops as if they’re just like any other reasonable people in the community. But they aren’t. They are uncivilized power-tripping demons. Their insatiable need for your submission overwhelms any chance for discourse.",
            "score": 12,
            "author": "bishpa",
            "replies": []
        },
        {
            "level": 0,
            "comment": "\"We are deeply apologetic about our precincts unprecedented behavior of violence. Due to this coming to our attention, the officers involved will be taking the week off and paid, of course. Doing so will allow them to reflect on their actions. We are sorry to say we won't be accepting questions at this time...\"- Their chief probably",
            "score": 18,
            "author": "Ashamed-Bluebird-940",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This could not happen, if training takes years instead of weekend",
            "score": 36,
            "author": "Twosliceofbread",
            "replies": [
                {
                    "level": 1,
                    "comment": "It is pretty incredible how minimal training is for police.  It should be like getting an associates degree at least.",
                    "score": 3,
                    "author": "RealRqti"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Poor guy ***crying out in pain*** and all the cop can say is, “Relax!” \n\nEven after the ‘fourth’ policeman explains they have the wrong guy and have already arrested the ‘bad’ guy, instead of apologizing like a moral, conscientious human being, they genuinely look disappointed…not for what they’ve done (IMO) but because they cannot further ‘punish’ him (again, IMO).",
            "score": 12,
            "author": "HeldDownTooLong"
        },
        {
            "level": 0,
            "comment": "I hope this dude got paid. That’s some BS",
            "score": 4,
            "author": "Soup5665",
            "replies": [
                {
                    "level": 1,
                    "comment": "Settled for $350k\n\nHowever, on the taxpayers dime.",
                    "score": 3,
                    "author": "IdoMusicForTheDrugs"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Mr. Brown deserves every dime he gets from the lawsuit and hopefully every one of those cops should be doing any other job.",
            "score": 4,
            "author": "The_pen_ismightier"
        },
        {
            "level": 0,
            "comment": "Relax, it will make killing you so much easier, for us. /s. \n\nFucking pigs.",
            "score": 42,
            "author": "Use_this_1"
        },
        {
            "level": 0,
            "comment": "Did he actually break his wrist??",
            "score": 3,
            "author": "Aggressive-Engine562"
        },
        {
            "level": 0,
            "comment": "Can someone tell me what happens in the video? Reddit is not playing it as per usual",
            "score": 14,
            "author": "Cherry_Crystals",
            "replies": [
                {
                    "level": 1,
                    "comment": "Cop approaches unarmed black man (Smith) for an apparent warrant he thinks Smith has. His buddy cop comes up behind Smith, bear hugs him then slams Smith to the ground, breaking Smith's wrist in the process, then another cop shows up and tells them the guy with actual warrant was at a different location where other cops had him and that he had already cleared Smith. Smith is now suing the cops, chief and mayor for damages and excessive force.",
                    "score": 53,
                    "author": "LuMo096",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wtf? What a horrible abuse of power by the scumbag police. I really hope Smith wins and gets a lot of money from them",
                            "score": 21,
                            "author": "Cherry_Crystals",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Add extra: Smith showed zero defiance or anger. He told the cop with the cam to call somebody, and at the same time, a cop sneaks up behind, bear hug from behind while both of the cops starts yapping \"hands behind your back\", while the cop is still bear hugging him(!). Smith barely gets to respond to the several \"hands behind your back\" before bear hugging cop decides to throw Smith to the ground.\nProfoundly disgusting.",
                                    "score": 29,
                                    "author": "alysonimlost",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "No way. That is pure racism at this point. Video still isn't playing so I'll take your word for it. I feel bad for Smith. That must have been a traumatising experience. This racism has to stop. All cops need to have bigger punishments. We can't have another George Floyd situation",
                                            "score": 8,
                                            "author": "Cherry_Crystals",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Also, they broke his wrist.",
                                                    "score": 10,
                                                    "author": "Strike_Thanatos",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "They were that rough? Even if he did resist, breaking someone's wrist like that is definitely too much. Do police in America go to jail over something like this?",
                                                            "score": 3,
                                                            "author": "Cherry_Crystals",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Police never go to jail unless it’s something they cannot cover up",
                                                                    "score": 5,
                                                                    "author": "JohnDarkEnergy99",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "ACAB. Yes all.",
            "score": 15,
            "author": "A_Evergreen"
        },
        {
            "level": 0,
            "comment": "ACAB. every fucking last one of these sick fucks living off our labor through taxes. scumbags.",
            "score": 15,
            "author": "proletariatwoodcutta"
        },
        {
            "level": 0,
            "comment": "theres no such thing as a good cop.",
            "score": 7,
            "author": "Dunkman83",
            "replies": []
        },
        {
            "level": 0,
            "comment": "FYI\n\n&gt;Lawsuits to settle allegations of misconduct by more than 7,600 officers from around the country have amounted to more than $3.2 billion over the past decade, reports the Washington Post. The  alleged misconduct  led to nearly 40,000 payouts to resolve lawsuits and claims of wrongdoing at 25 of the nation’s largest police and sheriff’s departments between 2010 and 2020.  **More than 1,200 officers in the departments surveyed had been the subject of at least five payments; more than 200 had 10 or more.**\n\n*My bold*",
            "score": 5,
            "author": "Hans_Delbruck",
            "replies": []
        },
        {
            "level": 0,
            "comment": "These fucking animals.",
            "score": 18,
            "author": "ToiletGrenade"
        },
        {
            "level": 0,
            "comment": "And cops wonder why everyone gets nervous and scared around them 🙄",
            "score": 12,
            "author": "spinning9plates",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don't think they wonder that. They want you to be nervous, so they can use it as reasonable suspicion to accost you",
                    "score": 4,
                    "author": "trev815"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I take it immediate body slams at being asked why or within a secomd of a command is just SOP now.\n\nACAB.",
            "score": 10,
            "author": "Eaywen"
        },
        {
            "level": 0,
            "comment": "*sigh* ACAB",
            "score": 27,
            "author": "Noplacelikehome990",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Most cops are pigs!",
            "score": 28,
            "author": "ZogNowak",
            "replies": [
                {
                    "level": 1,
                    "comment": "*All* cops are pigs\nFTFY",
                    "score": 38,
                    "author": "Action_Nad",
                    "replies": []
                }
            ]
        }
    ]
}