{
    "id": "1183b3t",
    "score": 17912,
    "title": "An Alabama man, who was being held after a mental health wellness check, died with a body temperature of 72 F after Alabama officers chained him naked to a chair inside a freezer and left him there for hours. Here they’re seen dumping his body in the back of a police SUV.",
    "author": "Artane_33",
    "date": 1676985737.0,
    "url": "https://www.reddit.com/r/iamatotalpieceofshit/comments/1183b3t",
    "media_urls": [
        "https://v.redd.it/7kfkbl7l3lja1"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\nPlease note that we will ban you if a post or comment breaks any of our rules. **Be especially mindful of the following**:\n\n**Rule 1: Do not post or ask for identifying information, including first and last names and social media usernames.** Public figures are **not** exempt. We remove all external links to prevent accidental posting of identifying information.\n\n**Rule 2: Do not post violent comments, and do not glorify violence, per TOS.** We can't take responsibility for how angry a post makes you, you need to do that. Telling us \"it was a joke bro\" is not an excuse.\n\n**Rule 7: Do not link to or post screenshots of reddit posts, reddit comments, reddit personal messages, reddit profiles, etc.** We cannot allow you to use this subreddit to harass other people on reddit. \n\n**Rule 8: No bigotry, no racism or race baiting.** It is hard to believe that we even need a rule like this. \n\n**Our rules are zero tolerance. You will be banned for breaking them.**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/iamatotalpieceofshit) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Yikes that’s a murder and coverup \n\nThey didn’t think to “lose” the camera footage?",
            "score": 4982,
            "author": "Speedhabit",
            "replies": [
                {
                    "level": 1,
                    "comment": "I saw this story yesterday, it said that another cop 'told on them' and released the footage and story of what happened. It also said she was fired as well. Not sure how much of that is true",
                    "score": 2766,
                    "author": "MeowNugget",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah she was fired for releasing the footage and is now trying to fight for wrongful termination. It says she wasn’t at the jail during the time of the man’s stay and removal, but that she looked through the footage and found this clip and shared it.",
                            "score": 2166,
                            "author": "Catrox1211",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well good for her!! The best thing that happened is that she was fired! She should win a case no problem! Also, why would anyone want to work there?!!!",
                                    "score": 1294,
                                    "author": "RoyGBiv333",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I just hope she wasn't too attached to Alabama because it might behoove her to move.",
                                            "score": 261,
                                            "author": "sheeeeeez",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Fucking no one is that attached to Alabama....",
                                                    "score": 56,
                                                    "author": "ClydeDanger",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Depends on how open you want to be with your racism",
                                                            "score": 21,
                                                            "author": "infiniZii",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "It’s Alabama, why would she be attached. Just move to Georgia it’s practically the same state",
                                                    "score": 4,
                                                    "author": "marino1310"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 219,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "She just put 5 dudes in a murder trial, more likely she'll be the one that won't make it to trial than the 5 of them. But she doesn't need to be there because the evidence isn't her as a witness, they can get rid of her and no one will ever know if she doesn't have someone to post it on social media, because they can probably keep the local papers from printing it too",
                                                    "score": 149,
                                                    "author": "fiealthyCulture",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yeah, honestly, inasmuch as I would want her back on the job because she has a moral compass, and despite the reality that she probably won't get paid as well at whatever her new job is for a bit... If I were her, I'd be hesitant to accept the mitigation damages of \"and you're hired back\" because you know damn well nobody on that payroll has her back anymore and is going to purposely delay responding to any distress signal she puts out",
                                                            "score": 84,
                                                            "author": "erdtirdmans",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "If I were her, I'd move out of state ASAP.\n\nComing back as a witness, I'd never drive myself anywhere; only Ubers.",
                                                            "score": 57,
                                                            "author": "Anleme",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Yep, releasing the video was the only safe option, she saw they were already willing and able to toss bodies and say nothing. There would be no reason for those guys to let her live.\n\nNow with the video existing on the internet killing her doesn't destroy the evidence. Doesn't meant it won't happen, but it was the only option where her death does not directly benefit them.",
                                                            "score": 40,
                                                            "author": "DuntadaMan",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 41,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "She’s in hiding and safe with her son last I heard due to information her lawyer released when folks were asking about her. That county is a long history of messed up. There’s a podcast that covers few from area on how missing folks and the insane crap going on. I’m glad she’s safe and in hiding though.",
                                                            "score": 5,
                                                            "author": "MeganDanielle01",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "If all the people with integrity just leave then what do you have left?",
                                            "score": 155,
                                            "author": "TerminalHighGuard",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "And this is exactly the principle that All Cops Are Bastards is founded on. You can't be a good cop, because the system either weeds out good people, or corrupts them.",
                                                    "score": 296,
                                                    "author": "linesinaconversation",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I mean look at how easily they fired her yet how hard it is to get cops fired for far more egregious acts\n\nIt's all about keeping the blue wall of silence",
                                                            "score": 160,
                                                            "author": "LukaCola",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Its all about cupping those shriveled blue balls of violence",
                                                                    "score": 13,
                                                                    "author": "mcglammo"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "It's a sad state of affairs when this woman has to seriously considered getting into witness protection because of other cops.",
                                                            "score": 95,
                                                            "author": "TehSvenn",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Adrian Schoolcraft was committed by the NYPD for speaking to internal affairs.",
                                                                    "score": 20,
                                                                    "author": "chakrablocker"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Why is it that surprising? They are a private security force employed by corporations conducting commerce.  It is state sanctioned organized crime.",
                                                                    "score": 5,
                                                                    "author": "mcglammo"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Alabama. That’s what you have left.",
                                                    "score": 7,
                                                    "author": "Ace-Ventura1934",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "One big family.",
                                                    "score": 5,
                                                    "author": "vangospanky"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "And aren't there whistleblower protections in general? Like at the federal level? Or am I wrong?",
                                            "score": 9,
                                            "author": "nmyron3983",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You aren't wrong but they aren't as expansive as they should be. She will probably get hit with not using the proper channels or obstructing an active investigation. Something stupid like that. They always seem to get stuck with something.",
                                                    "score": 13,
                                                    "author": "r_lovelace"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "This. This is why people berate the U.S. indeed good for her. It's a pity she has to take it up with the police. Hopefully there is a decent DA",
                                            "score": 9,
                                            "author": "pLeThOrAx"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Great benefits, no real work, and it’s nearly impossible to get fired.",
                                            "score": 31,
                                            "author": "BurtDickinson"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "She's lucky to only get fired, there was on in Cali (LA iirc) who got fucking murdered by his colleagues for reporting a crime by a colleague",
                                    "score": 262,
                                    "author": "SnooBooks1701",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's not too late for that yet. They might very well try doing so.",
                                            "score": 93,
                                            "author": "MysticScribbles",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The only thing that will save her is that this footage exists. She's not a witness so they might do it in revenge, but it's this footage that could help to convict. The Los Angeles guy was a witness who could testify.",
                                                    "score": 20,
                                                    "author": "bettinafairchild",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "She should stay away from freezers for awhile",
                                                    "score": 17,
                                                    "author": "VoreMaster42069",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I'm surprised that cop isn't already dead.",
                            "score": 185,
                            "author": "_DirtyYoungMan_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Dude, that was my first thought too. I hope that cop leaves the whole state for their safety.",
                                    "score": 126,
                                    "author": "spazmousie",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "She is in protective custody and was a corrections officer IIRC.\n\nSource: I live in this shithole",
                                            "score": 160,
                                            "author": "slonk_ma_dink",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Protective custody, but nobody thinks that's an issue that other police officers might try to kill her like it's actually an expectation? Not really any other line of work where snitching on somebody gets you an automatic ticket into protective custody. \n\nMaybe they need to reevaluate the police entirely",
                                                    "score": 54,
                                                    "author": "Girafferage",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt;but nobody thinks that's an issue that other police officers might try to kill her like it's actually an expectation?\n\nbro where have you been the last 10 years?",
                                                            "score": 11,
                                                            "author": "Yabebiri"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It was an officer named Karen Kelly that heard about the death, reviewed the tapes, recorded on her phone, then exposed them for trying to cover it up. They said the man walked to the car and was fine. She was fired.\n\n*Edited* cuz spelling is hard/for info",
                            "score": 117,
                            "author": "awkwardlyappropriate",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Jesus she should be called a hero in the circumstance.",
                                    "score": 66,
                                    "author": "PsychologicalGain298",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "And they’re all accessories to murder",
                                            "score": 4,
                                            "author": "morels4ever"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Is there any way we can figure out a way to support her and give this woman praise? We need to go above and beyond to reward good behavior as well as punish bad behavior. This reward/punishment is one of the first microsteps of change.",
                                    "score": 56,
                                    "author": "charmwashere"
                                },
                                {
                                    "level": 3,
                                    "comment": "I'll not make Karen joke for a month in get honor",
                                    "score": 19,
                                    "author": "SpaceDrifter9"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Are they gonna go to jail for murder or....?",
                            "score": 37,
                            "author": "Rip_ManaPot",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ofcourse not... the state has a monopoly on violence.\nEdit: need to be a nicer guy.",
                                    "score": 32,
                                    "author": "lakasumbudey",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "At most they'll be fired. (And then maybe re-hired in the next county over.)",
                                            "score": 13,
                                            "author": "pm0me0yiff",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Paid administrative leave during the investigation, which will find them innocent, then medical discharge for PTSD with full pension.",
                                    "score": 12,
                                    "author": "cmhamm"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "If that's true at least one of them had a conscious.",
                            "score": 213,
                            "author": "JediGuyB",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "A conscious conscience.  That’s rare in law enforcement.",
                                    "score": 131,
                                    "author": "ProfessorBackdraft",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's rare because the ones that rat out other cops are often fired. There's a reason people say ACAB and it's not because cops can't do good, it's because the good ones don't last.",
                                            "score": 124,
                                            "author": "Chaxle",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Its rare because if those cops get convicted hes gonna end up dead",
                                                    "score": 23,
                                                    "author": "graphitewolf",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Even if they aren't fired immediately, they are sometimes demoted even after many years of service, experience and climbing the ladder, or have themselves and/or their families threatened and harassed or maybe even find themselves in a dangerous situation and get laughter in response to a call for backup. All of these things ha e been reported as happening to cops who have \"tattled\" on other cops. \n\nWhen I've heard of these things happening (which isn't often because these occurrences are usually kept even more quiet for fear of retaliation) I can't help but think there's a lot of people who would think twice or stay quiet if it was their kids and spouse being threatened with bodily harm, regardless of how righteous they believe themselves to be. It's one thing to say you'd do the right thing but it's another entirely when it's real and it's you and your family.",
                                                    "score": 49,
                                                    "author": "mommy2libras",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Then they shouldn't be cops. If you know you won't be able to do the right thing, even for a reason that's not within your control, that's not an excuse to do the wrong thing. Especially in a privileged position of power. All cops are subject to that pressure, and regardless of intentions, if you give into it, you are no different from the rest.",
                                                            "score": 4,
                                                            "author": "ultramegacreative"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Yeah it's rare, he got fired for it, cops dont want a good guy, they want more goons",
                                            "score": 59,
                                            "author": "minister-of-farts",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "She* got fired for it.",
                                                    "score": 17,
                                                    "author": "robywar"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Well, seeing as as soon as they do the right thing they're fired it guarantees there are no good cops. ACAB in effect here.",
                                            "score": 8,
                                            "author": "missbteh"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "This is why there are no good cops, all the good cops get fired.",
                            "score": 28,
                            "author": "Turksarama",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "This is what happens to the “good cops” they are either killed by their fellow cops or fired",
                            "score": 19,
                            "author": "p0cketplatypus5"
                        },
                        {
                            "level": 2,
                            "comment": "And that ladies and gentlemen is what people mean when they say there are no good cops. The system always weeds them out while protecting the bad ones",
                            "score": 36,
                            "author": "Twodotsknowhy"
                        },
                        {
                            "level": 2,
                            "comment": "that’s exactly why ACAB",
                            "score": 26,
                            "author": "caspershomie"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Torture, murder and cover up.",
                    "score": 51,
                    "author": "DrMorry"
                },
                {
                    "level": 1,
                    "comment": "And didn’t think to call an ambulance?",
                    "score": 17,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So they murdered a man and tried to pass it off as his just dying for no reason?  Being that I'm not a police officer, I would get 25-life if I did that.  Since police officers are sworn to uphold the law, every officer involved should get a mandatory minimum of life in prison.  Every cop who murders someone should get the same life sentence.",
            "score": 1083,
            "author": "TheSquishiestMitten",
            "replies": [
                {
                    "level": 1,
                    "comment": "“This guy happened to die of natural causes after we locked him in this freezer”",
                    "score": 372,
                    "author": "HoldenAJohnson",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It really cold there, so it just natural that he die",
                            "score": 129,
                            "author": "shadollosiris",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He should have packed a coat.",
                                    "score": 12,
                                    "author": "bouchard"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Gotta end qualified immunity first",
                    "score": 12,
                    "author": "MelatoninJunkie",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "We did a welness check, and determend he should not be well.",
            "score": 2764,
            "author": "1singleduck",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is called murder.",
                    "score": 433,
                    "author": "Playful_Moose6293",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "yeh if the cops get away with it we can assume the whole system is rotten to its core and revolution is the only path to justice...",
                            "score": 177,
                            "author": "UcDat",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "He should chill until he was completely chilled.",
                    "score": 194,
                    "author": "Memory_Less",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Cold comment",
                    "score": 17,
                    "author": "MunchieOverlord",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "We are so lucky this time the footage didn't go \"missing\".",
            "score": 1675,
            "author": "ToastyBob27",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is leaked footage and the lady who leaked it got fired.",
                    "score": 788,
                    "author": "gonetowar_ffb",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "She got fired for leaking the video but these officers who murdered this inmate didn’t? She lost her job for blowing the whistle. Wow.",
                            "score": 411,
                            "author": "RepulsivePurchase6",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's the status quo. Hence, ACAB (all cops are bastards) because good cops don't stay in the force. They are pushed out immediately.\n\nThere is nothing that a cop fears more than being held accountable to the same laws that they enforce.",
                                    "score": 251,
                                    "author": "Thengine",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "This is America.",
                                    "score": 33,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Don’t catch you slipping now",
                                            "score": 8,
                                            "author": "kazsvk"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "She will get paid in a lawsuit though.",
                            "score": 112,
                            "author": "Fineous4",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And the tax payers will pay for it.",
                                    "score": 104,
                                    "author": "Oggel",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "At least it's going to her for this instead of a family of a murdered citizen.",
                                            "score": 22,
                                            "author": "xero_peace",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "She deserves compo, but are you saying that the family of a murdered citizen doesn't? What if they were dependants?\n\nShould come out of the cop's pensions, and not taxpayers though.",
                                                    "score": 26,
                                                    "author": "Strawberry_Left",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I'm like 110% sure guy was making a joke.",
                                                            "score": 21,
                                                            "author": "Fumpledinkbenderman"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "She will get paid by US not even the police. That is unless she has some sort of accident ya know.",
                                    "score": 4,
                                    "author": "StardewStunner"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Why lucky? Nothing will happen, nothing will change?",
                    "score": 193,
                    "author": "Ravenlunatic0413",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "These officers are so calm looking as they have all abetted a murder!",
                            "score": 61,
                            "author": "the_TAOest",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Guessing it ain't their first rodeo.",
                                    "score": 26,
                                    "author": "_DirtyYoungMan_"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Oh well, if nothing changes by showing the public this video, we might as well ignore it and keep letting cops get away with murder. Yknow, because nothing will change and all...",
                            "score": 123,
                            "author": "crashcar22",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If showing it to the public worked I’d be right there sharing away. Nobody should be treated like this and nobody should get away with it. But the truth is they will protect each other and they ain’t scared of the public finding out.",
                                    "score": 44,
                                    "author": "Ravenlunatic0413",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Keep showing it until people get tired enough of seeing it, then maybe something will get done about it. It's not like people are going, \"Oh those pesky cops killed another one,\" Eventually, one of these videos will be the last straw.",
                                            "score": 29,
                                            "author": "crashcar22",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I hope you are right",
                                                    "score": 17,
                                                    "author": "littlepaperboat"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "At the state our country is in you'd think that cops would want to try to be a good influence...",
                                    "score": 3,
                                    "author": "ThatOneGamer72"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I've seen this post before. The previous one explained that the guy who recorded the footage was fired. No consequences otherwise. Not sure if it true",
                    "score": 52,
                    "author": "yagonnawanna",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "So this is straight up murder correct?",
            "score": 592,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "And kidnapping, torture, and false imprisonment",
                    "score": 220,
                    "author": "PlayShtupidGames",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Cruel &amp; unusual punishment.",
                            "score": 54,
                            "author": "therapeutic_Cum"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Technically yes. In reality the cops are unlikely to be punished as if it were.",
                    "score": 188,
                    "author": "Aphreyst",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Did they put clothes back onto a dead body?",
            "score": 1025,
            "author": "DaveinOakland",
            "replies": [
                {
                    "level": 1,
                    "comment": "Exactly. Bc the dead body looks stiff. And where did they take him?",
                    "score": 516,
                    "author": "hhtran16",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "To the ER. \n\nBody temp of 72 last unread. Insanely low.",
                            "score": 370,
                            "author": "PrimeBrisky",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You’re not dead until you’re warm and dead",
                                    "score": 187,
                                    "author": "TheMikeGolf",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I just listened to a podcast about that.  Sysk?",
                                            "score": 30,
                                            "author": "timechuck",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yes it was! But also it’s my wife saying. She is an ED nurse.",
                                                    "score": 43,
                                                    "author": "TheMikeGolf",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "They have nurses for that now?",
                                                            "score": 36,
                                                            "author": "MrwangJr",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Yeah, mostly they just pass you viagra",
                                                                    "score": 15,
                                                                    "author": "TheMikeGolf"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "This was after allowing him to \"thaw\" for 5 hours.  My guess is they were hoping to say his low temp was from not being able to be transported for that time post mortem.  Acab",
                                    "score": 59,
                                    "author": "seeebiscuit",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "They also said he was conscious when he left his cell and was taken to the hospital. I’m guessing they didn’t think the video would be seen or they planned to erase it.",
                            "score": 127,
                            "author": "ravynmaxx",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They didn't expect one of their brethren to have morals and violate their thin blue line bullshit by leaking the video. So they fired them.",
                                    "score": 96,
                                    "author": "spazmousie",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yep and what’s crazy is she got like corrections officer of the year last year, I can’t remember exactly what award it was. But as soon as she went against them, they fired her. She’s literally in hiding right now because that’s how corrupt this county is and she would probably wind up mysteriously dead if they knew where she was. I hope the FBI gets involved.",
                                            "score": 76,
                                            "author": "ravynmaxx",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I'm honestly worried she's gonna end up killed. I hope she can leave the state.",
                                                    "score": 39,
                                                    "author": "spazmousie",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I worry too, but her attorney has said she is safe. But all it takes is one single person who sees her, sees her attorney, sees someone she knows and they can find her. The county is small and everyone knows everyone. All it takes is one person. It’s so fucking sad but IF she does wind up dead, I think that will cause even more of a shitstorm that they won’t be able to handle/control so I’m hoping it won’t happen.",
                                                            "score": 44,
                                                            "author": "ravynmaxx",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I'm so happy I moved out of that shithole into a slightly better shithole.",
                                                                    "score": 8,
                                                                    "author": "NotTheMarmot"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "they took him to a hospital where he was pronounced dead",
                            "score": 78,
                            "author": "Ok-Ad-5404",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "After 3+ hours of attempts to resuscitate him.",
                                    "score": 46,
                                    "author": "boosting1bar",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "“you’re not dead until you’re warm and dead” is true for hypothermic patients. you have to try to warm them to normal body temperature to see if you can re-perfuse the body. that’s likely what they were doing during those 3 hours…however, you’re not coming back from being 72°. 😶\n\n\nsource: me (icu nurse)",
                                            "score": 123,
                                            "author": "Ok-Ad-5404",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The record for lowest survived body temperature was 57°. That was a woman in Sweden who got swept into a frozen lake and trapped under the ice. After an eight-hour resuscitation and months in ICU, she eventually made a full recovery. \n\nBut she was in freezing water, which cooled her body down much faster than air, and she was rescued quickly by medical personnel. It's not much like this situation. I agree that by the time this poor guy was brought to ED, there really wasn't any chance.",
                                                    "score": 24,
                                                    "author": "auraseer"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I’m aware\n\nSource: me (icu doctor, right there with you!☺️)",
                                                    "score": 58,
                                                    "author": "boosting1bar",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "icu team 👏🏽🫶🏽 always trying to educate!",
                                                            "score": 46,
                                                            "author": "Ok-Ad-5404",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Random guy who just woke up-- ***invading your conversation***",
                                                                    "score": 19,
                                                                    "author": "minister-of-farts",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "welcome, minister 💨💨💨💨",
                                                                            "score": 9,
                                                                            "author": "Ok-Ad-5404",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I know too \n\nSource: I went through a 45 hour EMR class and am very unqualified to comment",
                                                            "score": 8,
                                                            "author": "Crying_Reaper"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Yes, exactly. There is a method to intentionally lowering body temperature to prevent organ damage from a heart attack(clarification needed) or similar health emergency.",
                                                    "score": 6,
                                                    "author": "Memory_Less"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I live in Alabama and it’s astounding how corrupt these small towns are. Walker county is probably one of the most corrupt. They deserve all the hell they’re going to get. I hope they fire every mf in there, the correction officers, the sheriff, the nurses. Everyone who failed this man and so many others like him.",
                            "score": 37,
                            "author": "ravynmaxx",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You’re not kidding.  As one who briefly moved from the northeast to the Deep South of Louisiana (and then Alabama), I dealt with this firsthand.  It’s scary.",
                                    "score": 7,
                                    "author": "apatheticwondering",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I’ve been SO lucky to not have to deal with it, but I’ve lived in more populated counties so I think that’s why I’ve gotten lucky so far. But now I live in a very small town/county with the same reputation as Walker county so I just hope I continue to stay lucky.",
                                            "score": 6,
                                            "author": "ravynmaxx"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If there was a medical emergency with an inmate, wouldn't it be proper protocol for the cops to call an ambulance? This is unbelievable. He's definitely dead already.",
            "score": 72,
            "author": "mlrny32",
            "replies": [
                {
                    "level": 1,
                    "comment": "They claimed he was conscious and alert when they put him in the vehicle. I assume they didn't call for an ambulance so they could make those claims.",
                    "score": 49,
                    "author": "bigbrotherbeane",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "It should be. Sadly it doesn't work out thay way. And if anyone complains about it the \"tough-on-crime\" asshats will all shriek that it's \"coddling\" prisoners to give them edible food or medical care.",
                    "score": 8,
                    "author": "Aphreyst"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Never call the cops to perform a wellness check for someone you love.",
            "score": 1248,
            "author": "Onlyroad4adrifter",
            "replies": [
                {
                    "level": 1,
                    "comment": "Call them to do a wellness check on your enemy.",
                    "score": 543,
                    "author": "1singleduck",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "some 4d chess right here. Although as they say, \"modern problems require modern solutions\"",
                            "score": 143,
                            "author": "Sektis420"
                        },
                        {
                            "level": 2,
                            "comment": "That sounds like SWATing but for the elderly.",
                            "score": 72,
                            "author": "baphosam",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "\"Agnes has been in my tomatoes. Again. Well, I guess it's time to call in that wellness check on her.\"",
                                    "score": 56,
                                    "author": "HPTM2008"
                                },
                                {
                                    "level": 3,
                                    "comment": "Gam Gam bounced one too many birthday checks.",
                                    "score": 11,
                                    "author": "spicybuttholenachos"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Never *ever.*\n\nI see people comment, \"Call for a wellness check!\" whenever someone expresses concern about an ill loved one, and I want to rip my hair out every time. I'll just copy-paste a link to this post next time.\n\nCall for social workers instead. Call for paramedics if you know that they won't send cops along with them. But do not call the police. Why they send cops to manage mental *health* crises is truly beyond me.",
                    "score": 101,
                    "author": "myimmortalstan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I don't understand why police are *allowed* to respond to a wellness check. Why should that be within their juristiction? What benefit is there to bringing guns to such a situation(other than so cops can shoot people for \"getting so scared they *had* to shoot)?\n\nI know people both love to hate on cops and simp for them, but really, why don't we have any official government services that have their own authority outside of police to handle matters that *don't require* guns and violence? I don't know why cops would *want* to be responsible for wellness checks other than that they want to have authority over all civilians or they *want* to kill people like that.",
                            "score": 38,
                            "author": "kyle2143",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ideally, police are available to “protect and serve” the community, so they should be able to handle multiple situations. But here we are…",
                                    "score": 6,
                                    "author": "HeyHiyaHowAreYa",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Having lived overseas, that’s how it works in other countries sometimes, but those countries tend to require much more training and education for their cops as opposed to a system that prefers high school bullies and actively pushes away people that are deemed too intelligent or decent/honorable.\n\nWhen all you look for is dumb violent types that couldn’t make it past the physical required to enter the military, it’s no surprise our forces are the way they are, sadly.",
                                            "score": 6,
                                            "author": "Tyr808"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The answer as to why they call cops for mental health problems is “Reagan”.   He defunded social programs and blew the money giving it to the rich. \n\nThis is Reagan’s America, we’re soaking in it.",
                            "score": 16,
                            "author": "fatuous_sobriquet",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Sucks though. Where I live if you call ambulance an officer shows up with them so...yeah.",
                    "score": 20,
                    "author": "Wind_Responsible",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "This is how like half of true crime stories find the victim though...",
                    "score": 9,
                    "author": "dj_chai_wallah",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "i guess the only time it’d be okay to call and get a wellness check for someone is when you’re 90% sure they’re already dead so the cops wont be able to kill them.",
                            "score": 12,
                            "author": "caspershomie"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "So they murdered him. He didn’t die, he was murdered. Can we stop trying to sidestep the obvious headline with cops?",
            "score": 131,
            "author": "Xboarder84"
        },
        {
            "level": 0,
            "comment": "\"Alabama officers murdered an innocent man after torturing him using methods that the Geneva Convention defines as Crimes Against Humanity.\" -Fixed it.",
            "score": 697,
            "author": "Dhlesq",
            "replies": [
                {
                    "level": 1,
                    "comment": "Geneva Convention doesn't apply here. He is not a POW. If the Geneva Convention was used to regulate internal police force it would ban tear gas and much more.",
                    "score": 112,
                    "author": "SpiritedYam464",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How about just the law of the land?  The phrases \"cruel and unusual punishment,\" \"innocent until proven guilty,\" etc.\n\nI think the point about the Geneva convention was that this would be considered a war crime.  Not that it is a war crime.  Murdering your foe is sanctioned in a theater of war.  Unless it's unnecessary cruel, prolonged, wholesale, etc.  For the police to have done this is not a war crime, no.  It's premeditated, conspired murder &amp; a cover up.  Every second, every degree of that man's body temperature that slipped away they had the opportunity to stop.",
                            "score": 73,
                            "author": "SeeSickCrocodile",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "More to the point, it's ***worse*** than a war crime. \n\nThis was torture of an American citizen during detainment but prior to any conviction, trial, or any semblance of justice. \n\nThis was an extrajudicial kidnapping, torture, and murder, **as well as coverup attempt**.",
                                    "score": 34,
                                    "author": "PlayShtupidGames"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "They never claimed they committed war crimes, only that their detainee ops would violate the GC",
                            "score": 8,
                            "author": "PlayShtupidGames"
                        },
                        {
                            "level": 2,
                            "comment": "It may not apply but OP’s statement isn’t technically wrong.",
                            "score": 7,
                            "author": "Enumeration"
                        },
                        {
                            "level": 2,
                            "comment": "to be honest, that sounds like an argument FOR applying the Geneva Convention to the police force",
                            "score": 9,
                            "author": "wafflesthewonderhurs"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It would be nice if the police would just stop killing people.",
            "score": 36,
            "author": "Hamthrax",
            "replies": []
        },
        {
            "level": 0,
            "comment": "What's the difference between these guys and a bunch of mobsters stuffing someone into a trunk after a hit?\n\nAnswer: One group is protected by the government and the supreme court has determined that they have no duty to protect you despite \"to protect and serve\" being written all over their cop cars.",
            "score": 480,
            "author": "fope_as_duck",
            "replies": [
                {
                    "level": 1,
                    "comment": "Cops serve the government, who in turn robs you and serves themselves. At least with the mafia you might get something worth while when you pay them.",
                    "score": 92,
                    "author": "Makkapakka777",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "At this point, being arrested by the FBI or CIA or the Marshall's or even freaking IRS is safer than state or local cops. Hell the safest person to arrest you is an MP, they at least have a code of conduct that has to be followed unlike the local ones who at this point, don't work for the government at all and just work for themselves.",
                            "score": 48,
                            "author": "Makenchi45",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "all across the board too, not just at certain levels or units",
                                    "score": 10,
                                    "author": "babyseal95"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Answer : sometimes the mobsters go to jail at least for a little while \n\n\nAnswer : the mobsters don't make excuses for their actions and claim moral superiority\n\n\nI could think of a couple more",
                    "score": 20,
                    "author": "RetardAndPoors",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "“To protect and serve. To protect and serve. To protect and …”\n\nI’m sure it’ll start sounding true if deleted enough times eventually.  Poor guy tho man.",
            "score": 182,
            "author": "Neat-Sun-7999",
            "replies": [
                {
                    "level": 1,
                    "comment": "That was a PR slogan that LAPD used first....",
                    "score": 27,
                    "author": "scriptmonkey420"
                },
                {
                    "level": 1,
                    "comment": "They are there to protect and serve. The issue is, it's not us lowly plebs they are protecting and serving. Protect the status quo and serve the wealthy.",
                    "score": 17,
                    "author": "SookHe"
                }
            ]
        },
        {
            "level": 0,
            "comment": "For reference, 98.6 is normal, anything below 95f is hypothermia, n anything below 82 is severe (you're about to die) hypothermia.",
            "score": 183,
            "author": "RaRaRasputinRussias",
            "replies": [
                {
                    "level": 1,
                    "comment": "And for anyone that doesn't use freedom units, 37°c is normal, anything under 35°c is hypothermia and anything under 28°c is severe hypothermia.\n\nHe was found at 22°c",
                    "score": 163,
                    "author": "JamisonDouglas",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "that's ambient temperature. that's the temperature you'd find a body at, if it had been dead for a day in normal circumstances.",
                            "score": 39,
                            "author": "69cop3rnico42O"
                        },
                        {
                            "level": 2,
                            "comment": "Thankyou for converting it to normal units, freedom units are ridiculous.",
                            "score": 49,
                            "author": "Greedy-Farm-5917",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Murder cover up, promotions on the way.",
            "score": 129,
            "author": "b05501"
        },
        {
            "level": 0,
            "comment": "Thank goodness for surveillance cameras, otherwise we might never have know about this and other horrendous acts that have happened by law enforcement.",
            "score": 113,
            "author": "AndyJack86",
            "replies": [
                {
                    "level": 1,
                    "comment": "They fired the officer who released the footage",
                    "score": 65,
                    "author": "TutonicKnight",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "We need whistleblower protection on cops. Shit like this can’t keep happening, and if they are protected maybe we will finally start cutting out the rot.",
                            "score": 38,
                            "author": "Xboarder84",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Need more than that at this point. Lets give 100K bounties if tips lead to felony convictions of cops. You'd probably save money compared to all the lawsuits.",
                                    "score": 6,
                                    "author": "Feisty_Machete"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This.  immediately after the death, the Sheriffs department released a statement claiming he was alert and conscious when he left the facility.\n\nEven without the video showing that was untrue, even if he had a normal body temp and died seconds after getting in the squad car, his body temp would not be that low by they time they arrived to the hospital.",
                    "score": 76,
                    "author": "Highlander198116",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So the entire department is complicit in murdering someone and subsequently covering it up. I wonder how much paid vacation time they're going to serve for this heinous crime.",
                            "score": 21,
                            "author": "twentyafterfour"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is leaked video and the lady who leaked it got fired.",
                    "score": 12,
                    "author": "gonetowar_ffb"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sounds like this wasn’t the first person put in the freezer. I’m guessing it was a form of punishment for “trouble makers”.",
            "score": 20,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "They will investigate and determine that this is SOP.",
                    "score": 7,
                    "author": "Ihavenousefora"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Don’t worry, the local citizens will pay the family for their loss.",
            "score": 18,
            "author": "Peglegsteve265",
            "replies": []
        },
        {
            "level": 0,
            "comment": "And somehow wanting law enforcement held accountable for their actions makes YOU the bad guy.",
            "score": 17,
            "author": "andsendunits"
        },
        {
            "level": 0,
            "comment": "It's ok guys, the police department did an investigation on this matter and found no wrong-doing by their officers.",
            "score": 73,
            "author": "Poopy_Pants0o0",
            "replies": [
                {
                    "level": 1,
                    "comment": "\\*\\* Except the (Female) whistleblower who was fired and I'm sure is now hiding out for her own safety.",
                    "score": 8,
                    "author": "PuzzledStreet"
                },
                {
                    "level": 1,
                    "comment": "pheww😮‍💨🫡I'm glad I heard this news!",
                    "score": 28,
                    "author": "terredez"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So what their punishment for straight-up **murder**?  Two months' paid administrative leave at taxpayer expense?",
            "score": 14,
            "author": "MagicSPA"
        },
        {
            "level": 0,
            "comment": "I can almost hear them yelling \"stop resisting!\"",
            "score": 37,
            "author": "Dirk_Z_Duggitz",
            "replies": [
                {
                    "level": 1,
                    "comment": "Right? I'm surprised they didn't beat on his corpse on the way into the back seat! \n\nACAB",
                    "score": 16,
                    "author": "greatlakeswhiteboy",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I am so happy we actually have well trained police in my country",
            "score": 9,
            "author": "boitheboi101",
            "replies": []
        },
        {
            "level": 0,
            "comment": "The way American police officers treat mentally ill and disabled people should be classified as genocide.",
            "score": 9,
            "author": "alien236"
        },
        {
            "level": 0,
            "comment": "God I love my state. Run by the party who thinks life is so important*\n\n\n\n\n*exclusions may apply",
            "score": 8,
            "author": "Not_Fritz_the_Cat"
        },
        {
            "level": 0,
            "comment": "At an internal core temperature of 72, he was likely unresponsive for HOURS before they learned of his death/unresponsiveness \n\nHOURS",
            "score": 8,
            "author": "Sammyterry13"
        },
        {
            "level": 0,
            "comment": "This is fucking insanity. Everyone one of these cops needs to be dead that is literally the only way for any kind of \"Justice\" to be served. All of them involved, everyone, even down to the driver.",
            "score": 8,
            "author": "StardewStunner"
        },
        {
            "level": 0,
            "comment": "Why do they have a freezer big enough for this?",
            "score": 44,
            "author": "kanbirdsswim",
            "replies": [
                {
                    "level": 1,
                    "comment": "I saw somewhere that it was a walk-in freezer for the jail kitchen.",
                    "score": 20,
                    "author": "BubbaRogowski"
                },
                {
                    "level": 1,
                    "comment": "probably for forensic evidence or smt?? though that would probably be in a lab",
                    "score": 19,
                    "author": "arepagal"
                },
                {
                    "level": 1,
                    "comment": "It's a jail.  They have an industrial kitchen.  They probably have a walk-in",
                    "score": 5,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "And bootlickers will STILL find a way to defend these people and their evil actions. If the Western media reported this to happen in another country.. they would call it a humanitarian crisis.",
            "score": 5,
            "author": "RetroKat88"
        },
        {
            "level": 0,
            "comment": "What is that by the wheel? Doesn't look like it was there when they opened the door.",
            "score": 17,
            "author": "WillDisappointYou",
            "replies": []
        },
        {
            "level": 0,
            "comment": "\"We FoUnD oUr oFfICeRs foLlOWed aPpROpIate PrOtocol anD AT tHIS mOMent all 5 oFFIcERS are TaKing A pAID lEaVE.\"",
            "score": 41,
            "author": "landingpagedudes"
        },
        {
            "level": 0,
            "comment": "It’s ok! The police will investigate and get to the bottom of it. I’m sure there is at least a 2 page report coming explaining how nobody did anything wrong but…policy changes will need to be made.",
            "score": 4,
            "author": "Ravenlunatic0413"
        },
        {
            "level": 0,
            "comment": "Sometimes I feel like some Police are just criminals with a uniform…another poor soul lost because of these bastards.",
            "score": 3,
            "author": "Therapist-god562"
        },
        {
            "level": 0,
            "comment": "* And where are all the “Good Apples” that should be arresting these murders?\n* And where is the “Good Apple” Sherif/Police Cheif nailing these murderers to the wall?\n* And where are all the “Good Apple” prosecutors filing warrants for their arrest, indicting these murders?\n* And where are all the “Good Apple” police unions condemning these murders?\n* And where is the “Good Apple” mayor that should be terminating the employment of the Sherif/Police Cheif for fostering an environment that would allow this to happen?\n* And where are the “Good Apple” States Attorneys that should be filing indictments and arrest warrants for every local official that did squat?",
            "score": 18,
            "author": "MeButNotMeToo"
        },
        {
            "level": 0,
            "comment": "Are you telling me he's frozen?? OMG look at the color of his feet. Holy cow",
            "score": 9,
            "author": "Alert-Layer6273",
            "replies": [
                {
                    "level": 1,
                    "comment": "First thing I noticed too.",
                    "score": 5,
                    "author": "spazmousie",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Well........\"at least they aren't racist\"\n\n/sarcasm alert",
            "score": 11,
            "author": "Professional-Pass487"
        }
    ]
}