{
    "id": "11fugwu",
    "score": 4956,
    "title": "POS",
    "author": "unit_50",
    "date": 1677735980.0,
    "url": "https://www.reddit.com/r/iamatotalpieceofshit/comments/11fugwu",
    "media_urls": [
        "https://i.redd.it/jzrvbawuk9la1.png"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\nPlease note that we will ban you if a post or comment breaks any of our rules. **Be especially mindful of the following**:\n\n**Rule 1: Do not post or ask for identifying information, including first and last names and social media usernames.** Public figures are **not** exempt. We remove all external links to prevent accidental posting of identifying information.\n\n**Rule 2: Do not post violent comments, and do not glorify violence, per TOS.** We can't take responsibility for how angry a post makes you, you need to do that. Telling us \"it was a joke bro\" is not an excuse.\n\n**Rule 7: Do not link to or post screenshots of reddit posts, reddit comments, reddit personal messages, reddit profiles, etc.** We cannot allow you to use this subreddit to harass other people on reddit. \n\n**Rule 8: No bigotry, no racism or race baiting.** It is hard to believe that we even need a rule like this. \n\n**Our rules are zero tolerance. You will be banned for breaking them.**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/iamatotalpieceofshit) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "That quote kinda pushes this into the realm of absurdity",
            "score": 1140,
            "author": "PM_ME_FUNFAX",
            "replies": [
                {
                    "level": 1,
                    "comment": "Like when people come in to the shelter to adopt a kitten/cat... \n\nAre you going to keep it indoors (unless it has a specific history of being outdoors)? Yes? Thats what you said last time when you were here 2 weeks ago. You're obviously just letting your new cat(s) outside where they're being eaten by coyotes, so no you cannot adopt any more cats here. And we've forwarded your info to all the local shelters. \n\nMind boggling the amount of people I had to blacklist for things like that when I worked at a shelter.",
                    "score": 377,
                    "author": "cityshepherd",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So these poor animals end up in a shelter in the first place just to be neglected.\n\nThat's insane.",
                            "score": 128,
                            "author": "shabbyshot",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Wait til you hear about the American foster system...",
                                    "score": 105,
                                    "author": "Zahille7",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Working as an animal adoption counselor and seeing people just lie through their teeth and try to BS me when they were obviously full of bologna was so frustrating. Not going to lie, it frequently made me think about how challenging and complicated the process must be for adopting actual children. My wife and I are hoping to get involved with fostering a couple more years down the road.",
                                            "score": 43,
                                            "author": "cityshepherd"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "That's one of those things that if I keep in mind too much I might unalive myself, but I am aware. \n\nBecause this is reddit: in all reality I won't hurt myself or worse, but I can't think of a better way to articulate how disgusting the whole situation is.  I am not in a position to take on another child and even then the whole thing is just revolting.",
                                            "score": 8,
                                            "author": "shabbyshot",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Hell maybe I'm wrong since you seem to have experienced it first hand",
                            "score": 13,
                            "author": "PM_ME_FUNFAX"
                        },
                        {
                            "level": 2,
                            "comment": "Not only that, it cost a decent amount of money to adopt - $50 - 100 per cat at my local shelter. Feeder mice &amp; rats would be significantly less expensive. I don't know why you'd adopt to feed another pet. There is literally zero upside from a pragmatic perspective.",
                            "score": 20,
                            "author": "Meems04",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Might be looking online like craigslist or hoobly.",
                                    "score": 13,
                                    "author": "At-hamalalAlem",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Now this makes sense. He's using the word \"adopt\" to make the comment more horrific for shock value.",
                                            "score": 10,
                                            "author": "Meems04",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I only know it's a thing because when I was breeding and selling ducklings I had someone ask me to drop off live ducklings so they could feed them to their snakes despite the fact my ad said pet homes only and were not for free. Another wanted some for his dogs.",
                                                    "score": 11,
                                                    "author": "At-hamalalAlem",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Some volunteers from the shelter make an effort to shut down free animals on those sites in the area for this exact reason. There's always more than pop up, but it's the best we can do for now. We've had bait animals come through the shelter  (animals that were used to bait fighting dogs) &amp; it rips your heart out every time.",
                                                            "score": 14,
                                                            "author": "Meems04"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Damn, my cat was either $5 or $10 to adopt. Half off cause he had a upper respiratory infection so I had to give him meds for three days then take him in for shots and snips within 90 days, all still paid for by the city. Still pretty expensive compared to a feeder rat or something though.",
                                    "score": 12,
                                    "author": "ExtraSpicyGingerBeer",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "We do run discounts for sickly cats or wave adoption fees for older cats sometimes. We also have big discounts for rough times of the year, like January/February, since people don't often adopt right after Christmas. \n\nThe cost also includes the required vet check-up and the cost to have them fixed (also required for city regs). Pure adoption cost would be closer to 15-25 bucks, but all together still more than feeder mammals.\n\nI just can't picture any reputable shelter or pound doling out kittens like that without raising concerns. But I suppose there is shady places in every industry.",
                                            "score": 9,
                                            "author": "Meems04"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Don't your dare point out that an unhoused cat will be a destructive element to native ecologies. The cat lovers hate to acknowledge that cats kill songbirds,  lizards and other beautiful wild animals. Often for sport not for food.",
                            "score": 2,
                            "author": "brycyclecrash"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'm simultaneously disgusted, appalled, and amused that I possibly live in a more comical world than I previously thought five minutes ago.",
                    "score": 62,
                    "author": "SimplisticPinky",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sounds a edgy teen who gets no love from his parents so he acts out for attention. Words cannot describe what should be done to this filth",
                            "score": 32,
                            "author": "smurb15",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Chop em up, mash em, put em in a stew!",
                                    "score": 18,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Too easy.",
                                            "score": 1,
                                            "author": "shabbyshot",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "But it's so edgy it feels fake",
                                    "score": 5,
                                    "author": "PM_ME_FUNFAX"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Those are words of a man getting off on it. Seriously. He was saying that to make himself hard.",
                    "score": 10,
                    "author": "Seligas",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "It’s ridiculously edgy was just trying to offend people with that but just sounds stupid.",
                    "score": 2,
                    "author": "menir10",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Netizens already found him and he pulled the victim card. \n\n&gt;In the police report, [redacted] admitted that he had replied to a Twitter post saying that he owned a snake and that he looked for cats or rabbits to feed his pet snake. However, he claimed in the report that the tweet was nothing more than a joke. After finding out that his LinkedIn and Instagram accounts had gone viral, he decided to lodge a police report to explain that what he posted was just a joke.",
            "score": 542,
            "author": "GMEbankrupt",
            "replies": [
                {
                    "level": 1,
                    "comment": "Has no one learned that the internet does not take kindly to animal abuse and goes to great lengths to find the perpetrators? It’s happened before.",
                    "score": 383,
                    "author": "FuzzballLogic",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "there's a whole ass netflix documentary",
                            "score": 150,
                            "author": "Vereronun2312",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'd really appreciate the name of this documentary, if you know it?",
                                    "score": 51,
                                    "author": "ajay_ac",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "\"Don't F**k With Cats\"\n\nSwear on my life, that's really the name of it.",
                                            "score": 124,
                                            "author": "_TheShapeOfColor_",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Thank you!",
                                                    "score": 26,
                                                    "author": "ajay_ac",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It's a little rough",
                                                            "score": 19,
                                                            "author": "homesickpluto",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "It’s very, very rough.",
                                                                    "score": 20,
                                                                    "author": "GMEbankrupt",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I've been interested in watching this but does it show animal abuse?\n\nIf so, that's a hard pass for me",
                                                                            "score": 4,
                                                                            "author": "WhiteTrashNightmare",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Nothing explicit. Your mind fills in the blanks",
                                                                                    "score": 5,
                                                                                    "author": "homesickpluto",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "It's excellent! Check it out.",
                                                            "score": 3,
                                                            "author": "ThatsRobToYou"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Good thing they didn’t mention fish or I’d be in some trouble",
                                                    "score": 4,
                                                    "author": "Fish_Fucker2136"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "It’s called “Don’t F**k with Cats: Hunting an Internet Killer”",
                                            "score": 19,
                                            "author": "Apprehensive_Cat_289"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "It's somewhere along the lines of \"Don't F**k with cats\" if I remember correctly",
                                            "score": 6,
                                            "author": "Neko_Shogun"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Even in prison, from what I can tell, some people *really* care about vulnerable groups like animals and children.",
                            "score": 39,
                            "author": "NotActuallyGus",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Isn’t that a threat they use to coerce people to cooperate? “If you work with us we will give you a safe cell and promise not to accidentally tell the other inmates what you did”",
                                    "score": 10,
                                    "author": "FuzzballLogic"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Humans literally put more effort into stopping animal abuse than child abuse. It’s nuts",
                            "score": 11,
                            "author": "baybaycaykes"
                        },
                        {
                            "level": 2,
                            "comment": "Serious question, but why are cats being fed to a snake animal abuse, but a mouse or rat isn't? If a snake is in the wild and a cat crosses it's path, then naturally it will probably be eaten.",
                            "score": 3,
                            "author": "OG_Chatterbait",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The main difference is that I'd reckon almost no one would let you adopt a kitten from them if they knew you'd be feeding it to a snake.\n\nCats are also, for the most parts, not part of the natural diet of snakes. Feeding cat babies that can't yet defend themselves, and in nature would extremely rarely be eaten by a snake, has a different feel to it than feeding adult mice (who tend to be prey). I doubt a lot of people feed snakes living mouse babies.\n\nBesides that, I'd reckon most people would deem the feeding of living prey a form of animal abuse.",
                                    "score": 20,
                                    "author": "csppr",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "This, exactly. Buy a bag of mice to feed your snake? That makes us a little uncomfortable, but okay. Do the same with cats? You're an unforgivable monster.",
                                    "score": 6,
                                    "author": "diggitygiggitycee"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "If someone says they feed cats to their snake, believe them and immediately report them.\n\nHard enough dodging those scaly fucks in the wild...",
                    "score": 124,
                    "author": "AngryCartoonSquirrel",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "That's what they all say.",
                    "score": 5,
                    "author": "sethryan44"
                },
                {
                    "level": 1,
                    "comment": "Wait can you not feed rabbits to a snake?",
                    "score": 11,
                    "author": "arctic-apis",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes you can. That's fine. Along with mice and rats which plenty of other people keep as pets. \n\nFunny how these things work sometimes.",
                            "score": 21,
                            "author": "PrimeBrisky",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'll speculate it comes down to what the majority sees as cute and cuddly instead of food for another animal. However, it's his \"enjoyment\" of it that crosses the line. Had he said something like \"I can't afford feeder animals right now\", maybe it wouldn't be so bad? I don't know, pure speculation...",
                                    "score": 23,
                                    "author": "EZ_2_Amuse"
                                },
                                {
                                    "level": 3,
                                    "comment": "The big difference is the method and the suffering. As far as I know, most snakes are fed dead mice. We buy them frozen, keep them in the freezer, and give them 1 a week. So we're not causing any excess fear or suffering to the mouse.",
                                    "score": 11,
                                    "author": "CainRedfield",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "My grandpa used to have some snakes and they would not eat dead animals. we tried to feed them dead mice and though we did manage to get one of the snakes to eat a dead mouse they typically would not and it was too high risk to try to dangle dead mice around venomous snakes trying to get them to bite. so live mice and rats and birds were the food of choice for the rattlers and since we were already live trapping food for them we also fed the boa the same.",
                                            "score": 4,
                                            "author": "arctic-apis"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "The big difference is that it's a kitten instead of a cat. Nobody cares about the welfare of mice.",
                                            "score": 4,
                                            "author": "HopeRepresentative29"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Moreover... Isn't it actually more ethical to feed them cats considering how much of a menace cats are to birds and other local wildlife?\n\nI mean don't get me wrong I don't love the idea of killing kittens.. but I also am fond of rats, mice, and birds",
                            "score": -22,
                            "author": "wolfgeist",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I mean, you could also say that it's ethical to throw a bag of kittens into a river and drown them, or leave them outside in freezing cold temperatures. Some snakes will not eat live prey. Some snakes die or are killed by the thing they are trying to eat. I mean, why would you want something to suffer an awful, painful death like that?",
                                    "score": 13,
                                    "author": "TwoCagedBirds",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "By that comment, can I recommend yourself to the snake? It would be more ethical since we are a menace to local wildlife.",
                                    "score": 4,
                                    "author": "Arithik"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Totally not a future serial killer",
            "score": 472,
            "author": "TimelyFortune",
            "replies": [
                {
                    "level": 1,
                    "comment": "Isn't it very, **very** common for serial killers to have experimented/killed/tortured/etc. animals before moving onto humans?",
                    "score": 271,
                    "author": "Moppy_the_mop",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yep. Famous serial killers like Jeffrey Dahmer, Ted Bundy, and John Wayne Gacy abused animals in their childhood. Lack of remorse or empathy is another common trait found in childhood",
                            "score": 159,
                            "author": "mischiefandtricks",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Put the narcissist Luka Magnotta on that list too",
                                    "score": 53,
                                    "author": "Cc_Produxion",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The Macdonald triad\n\nBed wetting in and past teenage years\n\nArson\n\nTorturing animals",
                            "score": 25,
                            "author": "RodMunch85",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Some kids DO grow out of it, but I'm not sure at what rate/frequency.",
                                    "score": 12,
                                    "author": "ActivityEquivalent69",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yes. It doesnt mean you are a serial killer if you tick one, two or even all three boxes but there is a correlation",
                                            "score": 13,
                                            "author": "RodMunch85"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Sadly most of them put a mask of normalcy on to hide their narcissist persona, which is probably absent/not learnt in their childhood initial days",
                                            "score": 8,
                                            "author": "13rokendreamer"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "wait, why bed wetting",
                                    "score": 3,
                                    "author": "YippeeCreature666",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yes. It's pretty much how all of them start out.",
                            "score": 15,
                            "author": "embiors"
                        },
                        {
                            "level": 2,
                            "comment": "Yes.  If he was also a bed wetter it's almost a lock.",
                            "score": 52,
                            "author": "Adventurous_Gap_2092"
                        },
                        {
                            "level": 2,
                            "comment": "Me: gulping slowly as I think back at the countless number of delicious cows and lambs I've consumed in my lifetime...",
                            "score": -3,
                            "author": "Plot-twist-time",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Did you happen to kill them yourself while torturing and/or experimenting on them? Did you take enjoyment in their suffering?",
                                    "score": 5,
                                    "author": "Moppy_the_mop",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "BOMBSHELL.  He is one.",
                    "score": 4,
                    "author": "mick_ricky29"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Rarely does a post make me want to kill",
            "score": 41,
            "author": "BabyYodaIsGod42069",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Don't make me advocate for violence.",
            "score": 294,
            "author": "Niajall",
            "replies": [
                {
                    "level": 1,
                    "comment": "I will do it on your behalf",
                    "score": 77,
                    "author": "Catatonic27",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you, much appreciated.",
                            "score": 30,
                            "author": "Niajall"
                        },
                        {
                            "level": 2,
                            "comment": "And I will do the violence",
                            "score": 24,
                            "author": "MemerGuy_"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Just mail me to his address, put some holes in the box. I will do the rest.",
                    "score": 17,
                    "author": "a-snakey"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Give me his address, I just want to hear his bones snap when I hug him.",
            "score": 40,
            "author": "a-snakey"
        },
        {
            "level": 0,
            "comment": "_Oh yes, we love kittens at my home. They will be together with my other pet, who also loves kittens. They'll share a nice and warm space together. I always hear the meows and think \"oh such happiness and joy!\"._",
            "score": 199,
            "author": "DutchTinCan"
        },
        {
            "level": 0,
            "comment": "Too bad his snake can't eat him... Yet.",
            "score": 147,
            "author": "Adventurous_Gap_2092",
            "replies": [
                {
                    "level": 1,
                    "comment": "The kittens are practice before the snake finally eats it’s owner.",
                    "score": 33,
                    "author": "EllasASmella",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'd hate to see the next step up. Probably piglets. This psycho might go puppies then children.",
                            "score": 19,
                            "author": "Adventurous_Gap_2092",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My knowledge of snakes is not complete, but a kitten is pretty big for a snake, I can't think of many snakes that would be kept as a pet that would be able to eat a  kitten.\n\nI had a ball python and he/she only ate mice, typically a snake only eats something that is around the same size as their body. You generally only feed your snake things that are dead so as to minimize the risk your snake gets bit, but if it refuses to eat dead you can go with live.\n\nEven then a kitten is pretty large so unless this guy owns one massive motherfucker of a snake, I could see this being a bad attempt at trolling that went viral.",
                                    "score": 10,
                                    "author": "MalevolentFather",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Earned it either way.\n\nI'd rather report a \"joke\" than ignore a potentially real scenario, and this was *plenty* believable.",
                                            "score": 10,
                                            "author": "AngryCartoonSquirrel",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Plus, who thinks this is a funny joke? If you even come up with such an idea and post it and it’s not obvious satire, there’s something wrong with you.",
                                                    "score": 2,
                                                    "author": "FuzzballLogic"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "There are some really big snakes available pretty commonly if you know where to look. If I had the money I could go downtown and grab an albino Burmese python like... probably tomorrow. I could find an alligator too. It's amazing what you can find.",
                                            "score": 4,
                                            "author": "ActivityEquivalent69"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Puppies might be cheaper than piglets... :( I made myself sad.",
                                    "score": 2,
                                    "author": "ActivityEquivalent69"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Don't make me crack his bones",
            "score": 10,
            "author": "ertychess"
        },
        {
            "level": 0,
            "comment": "This is why I can never be given the power of a god\n\nThe absolutely horrible things I would do to people who abuse animals…",
            "score": 78,
            "author": "JudgeJed100",
            "replies": [
                {
                    "level": 1,
                    "comment": "but wouldn't it be also abusive if he stops feeding his snake? i mean what do you think a snake in the wild eats? burger king?",
                    "score": 12,
                    "author": "kabutze",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Feed it rats. Problem solved.\n\nEdit: as a squirrel, I can safely say rats are utter \"chei cheė chĕe chẹee.\"\n\nThere is no proper human translation.",
                            "score": 18,
                            "author": "AngryCartoonSquirrel",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Domesticated mice and rats are a bit different from regular mice and rats. They can be quite caring. Owning a snake is one thing I could never do because it has to eat something fresh.",
                                    "score": 9,
                                    "author": "Chaosdirge",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Uhhh, no it doesn't? Most snake owners, including myself feed it frozen thawed mice and rats.",
                                            "score": 6,
                                            "author": "McCreeIsMine",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Some snakes will start rejecting frozen from what I've heard.",
                                                    "score": -2,
                                                    "author": "Chaosdirge",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "My boy was fed live before I got him. Took me two weeks to switch him over to frozen. Of course, there's always exceptions, but those exceptions are not the majority. Most snakes are absolutely the dumbest things on this planet. If it is warm, smells like food, and wiggles, then they will strike it. That's why you should wash your hands before handling a snake(that and diseases of course)",
                                                            "score": 4,
                                                            "author": "McCreeIsMine",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Some snakes will eat pre-killed things.\n\nJust a matter of verifying as much from the seller, who will most likely have experienced feeding it both ways.",
                                            "score": 2,
                                            "author": "AngryCartoonSquirrel",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Most snakes will, but what does it matter when they are killed? Asphyxiation is about as easy a death as an animal can have.",
                                                    "score": 3,
                                                    "author": "BBQasaurus"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Also, stray cats are an ecological terror and absolutely ravish local wildlife.",
                                            "score": 1,
                                            "author": "wolfgeist",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;The absolutely horrible things I would do to people who abuse animals…\n\nHow about farmers",
                    "score": -13,
                    "author": "cashmakessmiles",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Depends on what you mean?\n\nNot every farmer treats their animals badly, or are you one of those who are just against  all farmers?",
                            "score": 14,
                            "author": "JudgeJed100",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What a coward, loser. Yes, his snake has to eat, but feeding it a live companion animal is absurdly cruel. If he can do that to a helpless animal, he's not fit for civilized society.",
            "score": 10,
            "author": "PerroMadrex4"
        },
        {
            "level": 0,
            "comment": "Hel has a special place for this bastard",
            "score": 80,
            "author": "ComedyOfARock",
            "replies": [
                {
                    "level": 1,
                    "comment": "I mean snakes gotta eat right? Why feed it mice or something when you can spend probably 100x more on kittens AND go out of your way to justify it",
                    "score": 21,
                    "author": "ConReese",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Don’t they sell snake food in pet stores?",
                            "score": 19,
                            "author": "ComedyOfARock",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah kittens, it's what the post is about",
                                    "score": 37,
                                    "author": "ConReese",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Dammit, I was drinking! It is everywhere... Oh jeeze...",
                                            "score": 1,
                                            "author": "KaisarDragon"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Snakes have to eat real animals. Pet stores sell dead frozen animals, but some snakes refuse to eat that. In that case, you have to offer live food. If the snake is big, mice aren't big enough as food and you have to offer bigger food, like rabbits or, in this case, kittens.\n\nEdit: Sorry if I wasn't clear about it, I did not say I want snakes to eat cats. This person 'rescuing' kittens and feeding them to their snake is disgusting. Giving kittens to snakes can give a lot of problems, don't do that. But pythons, for example, can eat animals the size of rabbits if they are grown up. Pythons are not that uncommon as pet snakes. \n\nWhat I meant with my comment was that there is no such thing as kibble for snakes.",
                                    "score": -13,
                                    "author": "falkordragon233",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Most Pet stores also sell live feeder mice for snakes that won't eat pre killed or frozen.\n\nThey also sell rats which are significantly larger then mice for large breed snakes.",
                                            "score": 18,
                                            "author": "AIlien7"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "That doesn’t sound right to me. I’ve known plenty of people who have owned snakes and large ones at that and not once has any of them ever fed their snakes rabbits. Only live mice.",
                                            "score": 8,
                                            "author": "TheNapQueen123",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Kittens / rabbits are well outside of the size range of most traditional pet snakes. The general rule of thumb is food that is roughly the same size as the snakes body. Most snakes never stop eating mice, they start on pinkies and eventually settle on large adult mice.\n\nI think some snakes do eat rats, but where I live I never found feeder rats for sale, most pet stores found it inhumane because rats are much smarter than mice and can be kept as traditional pets.\n\nI've never known a snake owner who's had a snake large enough to consider eating something like a guinea pig, let alone a kitten or a rabbit.",
                                                    "score": 5,
                                                    "author": "MalevolentFather",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I've been to places that sell frozen 3/4 grown rabbits for very large reptiles. They're hard to find tho.",
                                                    "score": 1,
                                                    "author": "ActivityEquivalent69",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Still doesn’t justify feeding live kittens to a snake, thats just fucking cruel",
                                            "score": 10,
                                            "author": "TheMeltingDevil",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "But feeding it mice is not cruel? Or a human eating a cow, or a very smart pig is not cruel? Or a dog eating a pig?",
                                                    "score": 4,
                                                    "author": "nick-jagger",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "One it’s needlessly expensive, two mice and rats are not complex creatures and they breed like crazy whereas non of the animals you mentioned don’t, three it’s mostly advised that you train your snakes to eat frozen/thawed mice or rats that are ethically killed so there’s no pain involved, four snakes gotta eat too",
                                                            "score": -5,
                                                            "author": "Jalen3501",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Rats are extremely intelligent - probably smarter than Cats. They have emotional range, can problem solve and can understand human commands. Pigs are smarter than dogs.",
                                                                    "score": 5,
                                                                    "author": "nick-jagger",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I did not try to justify it, it is indeed fucking cruel. I just said that snakes have to eat food and that they don't accept kibble, they need to eat the real thing. But seriously, I myself could not own a snake that does not accept dead mice.",
                                                    "score": 1,
                                                    "author": "falkordragon233"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Well that quote almost made me throw up my lunch",
            "score": 5,
            "author": "FeedMyDopenose",
            "replies": []
        },
        {
            "level": 0,
            "comment": "We need to make the femur breaker a real thing",
            "score": 8,
            "author": "DariusRoyale"
        },
        {
            "level": 0,
            "comment": "Honestly, likely a troll. Unless he's feeding neonate kittens, they can do a lot of damage to the snake. Kittens still have teeth and claws. Even feeding live mice and rats to reptiles isnt advisable since they can harm the snake. Feed frozen or dethawed and warmed up. So either troll or incredibly stupid and willing to put his snake at risk.",
            "score": 44,
            "author": "ILackACleverPun",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's probably a \"joke\", but like... You still have to wonder what's wrong with the sort of person that would think that's a good joke. \n\n\"I use one of my pets to torture kittens to death and find their suffering to be *hilarious!* Just kidding! You all laughed though, right?\" 🐍",
                    "score": 23,
                    "author": "Frozen_Esper"
                },
                {
                    "level": 1,
                    "comment": "Yes, this. But if it is real, i get the feeling anyone getting that much glee out of killing (feeding? feel like thats a dubious word here) kittens probably wouldnt care too much about the snakes safety so im 50/50",
                    "score": 11,
                    "author": "FreedomSpirited140"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I shouldnt have read that. Wtf.",
            "score": 6,
            "author": "Jefe710"
        },
        {
            "level": 0,
            "comment": "Disgusting human being",
            "score": 12,
            "author": "KitchenBag2164"
        },
        {
            "level": 0,
            "comment": "That’s a serial killer in the making.",
            "score": 10,
            "author": "Abyss_Renzo"
        },
        {
            "level": 0,
            "comment": "Reads like an teenage edgelord",
            "score": 3,
            "author": "ETC3000"
        },
        {
            "level": 0,
            "comment": "snake's gotta eat but like what a fucking monster",
            "score": 4,
            "author": "reincharnation"
        },
        {
            "level": 0,
            "comment": "Reminds me of a fucked up story I heard one time: \n\nDude who was an outside contractor at my last job was talking about gator hunting. He’d work part of the year on turnarounds and shut downs, the other part of the year hit the swamps for giant aquatic lizards. He talked about how he’d bait areas for gators and the best method he found would be to hit up Facebook Market place for people giving kittens away to “good homes” and he’d take the whole lot. He’d string one up off a branch and the meowing would draw gators in. \n\nYeah…nope.",
            "score": 10,
            "author": "vulcan1358"
        },
        {
            "level": 0,
            "comment": "This seems very fake",
            "score": 30,
            "author": "Iceygamingrulez",
            "replies": [
                {
                    "level": 1,
                    "comment": "Happened in malaysia\n\nHe posted it on twitter and got attacked",
                    "score": 32,
                    "author": "BLAST_83",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So is the only source twitter?",
                            "score": 7,
                            "author": "Iceygamingrulez",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There are many articles about it,\n\nBut the dude that did it post himself talking about it on twitter",
                                    "score": 8,
                                    "author": "BLAST_83"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I read the title I was like okay it's not that bad, but the quote, holy",
            "score": 21,
            "author": "gloomygl"
        },
        {
            "level": 0,
            "comment": "There's enough rats and mice out there that he can catch that nobody would bat an eye if he feeds them to his snake.\n\nAnd being a snake that may not eat frequently , he doesn't even have to catch them all that frequently  either",
            "score": 6,
            "author": "kevin_r13",
            "replies": [
                {
                    "level": 1,
                    "comment": "Please don’t feed your snakes caught rats and mice. Best to get them from breeders or you risk making your snake ill.\n\nEdit: Downvote me all you want, but if you own a snake, you shouldn’t do it all the same.",
                    "score": 5,
                    "author": "CthulhuMadness"
                }
            ]
        },
        {
            "level": 0,
            "comment": "These people give large snake owners like myself a bad reputation and I hate them .",
            "score": 7,
            "author": "CthulhuMadness"
        },
        {
            "level": 0,
            "comment": "I hope that snake bites his pecker off",
            "score": 7,
            "author": "boboelmonkey",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I now wanna hit something. F this guy",
            "score": 3,
            "author": "CatCactus007"
        },
        {
            "level": 0,
            "comment": "I am going to commit a crime.",
            "score": 3,
            "author": "Sergietor756"
        },
        {
            "level": 0,
            "comment": "If this is true, I genuinely wish this man dead.",
            "score": 3,
            "author": "Celestiicaa"
        },
        {
            "level": 0,
            "comment": "I wish I hadn’t read this today",
            "score": 3,
            "author": "NecessaryAd4587"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Except kittens are more valued than snakes. Snakes mainly stay in the wildlife outdoors, kittens do not. Disgusting comment.",
                    "score": 1,
                    "author": "alidreamx",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Heeey, snakes gotta eat too!",
            "score": 3,
            "author": "K0MR4D"
        },
        {
            "level": 0,
            "comment": "They literally sell snake food, this is obscene and unnecessary.",
            "score": 3,
            "author": "birdlass"
        },
        {
            "level": 0,
            "comment": "A snake of that size, could it still be fed with enough rats or mice?",
            "score": 2,
            "author": "NoNameBrandJunk"
        },
        {
            "level": 0,
            "comment": "There is literally no way this is true. The chef's kiss thing is obviously a really gross joke.",
            "score": 2,
            "author": "Ham_Kitten"
        },
        {
            "level": 0,
            "comment": "Omg! I had a bunch of kittens from a ferral in my backyard a few years back and we put an add in Gregslist for them. The calls got weirder and weirder and I had situations like this my mind. We canceled the add and brought them to the local humane society. \nI learned never ever offer kittens for free.",
            "score": 2,
            "author": "humbugonastick"
        },
        {
            "level": 0,
            "comment": "That quote was the last thing i needed to read today…….",
            "score": 2,
            "author": "TabbyCat1993"
        },
        {
            "level": 0,
            "comment": "How do yall think nature works...",
            "score": 2,
            "author": "slightlyabrasive"
        },
        {
            "level": 0,
            "comment": "These usually don’t surprise me but this one made me cover my mouth. Jesus fucking Christ.",
            "score": 2,
            "author": "SweetComparisons"
        },
        {
            "level": 0,
            "comment": "I hope his snake eats him too.",
            "score": 2,
            "author": "KingoKings365"
        },
        {
            "level": 0,
            "comment": "Not a fan of cats, but...\n\nJesus wept, and Budha ain't happy either,",
            "score": 2,
            "author": "raptorrat"
        },
        {
            "level": 0,
            "comment": "This is actually the reason my local shelter charges for kittens. The adoption fee isn’t anywhere near enough to cover all the expenses of caring for a kitten (food, vet care, medicine, vaccines, spay/neuter, microchip, and labor) but it keeps POS like this from getting their hands on thrm",
            "score": 2,
            "author": "SquareThings"
        },
        {
            "level": 0,
            "comment": "I don't care about what specie of animal he's using to feed the snake, but using animals intended for adoption as pets must be a crime",
            "score": 2,
            "author": "Born-Diamond8029"
        },
        {
            "level": 0,
            "comment": "I hope this is considered animal abuse",
            "score": 2,
            "author": "oyMarcel"
        },
        {
            "level": 0,
            "comment": "**loads shotgun** I just wanna talk to him",
            "score": 2,
            "author": "DaKartMonkey"
        },
        {
            "level": 0,
            "comment": "I just want to talk to him. I just want to talk",
            "score": 2,
            "author": "CagedPoopv2"
        },
        {
            "level": 0,
            "comment": "I have quite the zoo at my home: 2 cats, 3 turtles, a boa constrictor, betta fish and 5 snails. Yeah. Years ago, I inquired about a cat at a local shelter, and was very honest about all of the animals I have, snake included. They refused to even do a home visit because of my snake and at the time I really didn't understand why. I later learned it's because a lot of people actually adopt cats and dogs from shelters to feed to large snakes, and buy live rodents from pet stores for the same purpose.\n\nThe situation still hurt my feelings though, because I would never do something so disgusting like that. If they had done the home visit, they would have seen the LOCK on Sophie's terrarium and seen how small she is and how it's physically impossible for her to eat a cat. They also would have seen my other cats.\n\nI love my pets and don't regret them at all, but when I talk to people about them, I always get comments about how crazy I am or that there's something wrong with me for having reptiles. Some people really view reptiles as the scum of the Earth and it sucks.",
            "score": 2,
            "author": "spleef35"
        },
        {
            "level": 0,
            "comment": "As a cat owner, THIS PISSES ME OFF",
            "score": 5,
            "author": "evilnemesis3131"
        },
        {
            "level": 0,
            "comment": "The title is strange but not unethical compared to the “live feeding” that people do with rats sometimes. The problem is the quote",
            "score": 5,
            "author": "thejoesterrr",
            "replies": [
                {
                    "level": 1,
                    "comment": "I agree with you in that live feeding is wrong no matter what you feed. \n\nBut what bothers me is that people keep using the term \"ethical\" in this thread, but I yet have to see someone develop an actual ethical argument. Plenty deontological approaches would deem it unethical to feed kittens but not mice; and I'd wager it'll be very difficult to make a utilitarian argument that ends with \"kittens and mice are both wrong\", rather than \"you shouldn't have a snake that needs live feeding\".",
                    "score": 3,
                    "author": "csppr",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I agree with you 100%, I just mean the rats and kitten are more or less the same",
                            "score": 3,
                            "author": "thejoesterrr"
                        },
                        {
                            "level": 2,
                            "comment": "wouldn't the utilitarian argument just be that feeding anything to another animal and causing it to suffer is wrong because we're directly causing pain to it and ending it's life?",
                            "score": 2,
                            "author": "task_scheme_not",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s interesting people find this disturbing. People have been feeding baby animals to their pet snakes for a long time but I guess humans have emotions attached with cats that makes it specifically not ok to use them as snake food",
            "score": 3,
            "author": "Qorazon",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's hilarious how the majority of people upset at this eat meat every day.",
                    "score": 2,
                    "author": "Rewmoo2"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's funny how similar sympathy is not offered to mice",
            "score": 4,
            "author": "ShareTurbulent7392",
            "replies": [
                {
                    "level": 1,
                    "comment": "I had pet mice and rats, and this is why I can't get a snake, the guilt would eat away at me.",
                    "score": 32,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "Honestly if he had gone to someone who invested time, love and money into rescuing mice, pretended to adopt them, and then enjoyed seeing said mice getting killed and eaten I would still be horrified.\nBtw this guys has the makings of a serial killer.",
                    "score": 23,
                    "author": "Reynhardt07",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ah, so your local petting zoo then.",
                            "score": 4,
                            "author": "Vincevw"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Or rabbits, seen as super cute and cuddly pets, but also at the same time pretty normalized as food.",
                    "score": 2,
                    "author": "Momomoaning"
                },
                {
                    "level": 1,
                    "comment": "It's also funny how you got downvoted for making this very fair point lol",
                    "score": 11,
                    "author": "helpme_imburning"
                },
                {
                    "level": 1,
                    "comment": "Try reading the quote below the headline",
                    "score": 1,
                    "author": "erno_tn"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I once found a channel on YouTube of a guy who feeds his frog with other small animals like hamsters, frogs and spiders. Really discussing stuff.",
            "score": 2,
            "author": "LickMyPudding"
        },
        {
            "level": 0,
            "comment": "I mean, is it all that different than feeding your snake rats or mice?",
            "score": 2,
            "author": "IlitterateAuthor",
            "replies": [
                {
                    "level": 1,
                    "comment": "Most people feed snakes frozen prey, since it is generally seen as more humane.",
                    "score": 4,
                    "author": "csppr"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Perplexing to me that some people find it acceptable to feed live mice to a pet snake, while being against other forms of animals being fed. Snakes will eat any small mammal in the wild. Every animal's life is valuable, yes, though obviously less valuable than a human life. That's basically where I stand. I appreciate and love all animals,  and of course I understand that pet animals hold a special place ones heart, and that emotional connection is real and valid, but I can't comprehend why anyone would have an issue with feeding a Pet snake live animals *in general*. They prefer to eat their prey alive. It's akin to caging a Lion in a zoo and feeding it steaks, it'll literally have nothing to live for.\n\nI get that it's weird this guy is getting off on it, but feeding your pet snake isn't something easily done *humanely*, as I mentioned they prefer live prey. It's concerning if someone takes pleasure in the pain and suffering of animals they feed their pet snake such as in this case. Yet, if the same person described feeding mice to their pet snake in the exact same manner, it wouldn't be a nearly as much an issue for most people.\n\nJust goes to show that people only care about Animal cruelty when it's got a cute fuzzy face. Like how Vegans who claim to care about animals but will still willingly ingest monocrop agriculture products that have resulted in the deaths of billions of Animals (because they don't count insects as animals?) Don't gimmie crap about how a cat and mice aren't the same because of culture separates the two creatures, some cultures it's taboo to eat Beef or Pork (sometimes both) and yet we in the West have zero qualms about scoffing them down, while simultaneously being disgusted when certain cultures eat Dogs. We in the West also are disgusted when some cultures eat bugs, and yet crustaceans which are literally bottom feeding giant bugs are considered  luxury cuisine.\n\nIt's all so bizarre to me the lengths people go to to disguise their obvious  bias towards certain animals, when I literally see them all as exactly the same thing. Animals, they are living things which possess varying degrees of agency, but have never met the criteria for sentience.",
            "score": 2,
            "author": "SteveAllure"
        },
        {
            "level": 0,
            "comment": "So to sum up: man buys/gets an invasive species and feeds it to pet.  \nHow is this worse than a human eating veal? Or what a snake does in the wild? Oh bUt iTS cUtE sO iTs dIfFeReNt",
            "score": -6,
            "author": "Thatguyj5",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think most people have a problem with his enjoyment of the kitten's pain and death, and the fact he gets kittens specifically for that purpose rather than just giving frozen mice for the sole purpose of feeding the snake. The difference is in the intentional cruelty and sadism. I don't speak for everybody obviously so that's my POV.",
                    "score": 7,
                    "author": "helpme_imburning"
                },
                {
                    "level": 1,
                    "comment": "veal is also wrong, and slightly less wrong because the calves are usually put down more humanely, we don't eat them alive",
                    "score": 5,
                    "author": "ClockworkSalmon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "i think the slightly less wrong is balanced out by snakes needing to eat mice/rats etc, but we don't need to eat veal in any capacity",
                            "score": 3,
                            "author": "Sweetxie"
                        },
                        {
                            "level": 2,
                            "comment": "So just all snakes always are evil?",
                            "score": 0,
                            "author": "Thatguyj5",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No, because they're doing what they need to survive, in nature, and if they catch a prey, say a mouse, that's nature, the mouse failed to survive, the remaining mice were better adapted and will have more food left for them, and more time to produce offspring.\n\nYou don't need to feed your pet snake live kittens for it to survive, the kitten wasn't given a chance to survive, the snake didn't earn its prey. There are more ethical options to feed your pet snake.",
                                    "score": 8,
                                    "author": "ClockworkSalmon"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Unless if you’re vegetarian/vegan you can’t get upset at this",
            "score": -5,
            "author": "PaladiiN",
            "replies": [
                {
                    "level": 1,
                    "comment": "Eh, I'm not upset and I'm a vegetarian and a cat owner. I mean he sounds kind of mental with the enjoying of the cracking noise part, but a snake eats meat, a cat is meat, and there are way too many cats anyway.",
                    "score": -4,
                    "author": "ThisFakeCut",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "are u defending feeding kittens alive to a snake?",
                            "score": 6,
                            "author": "okkkkkkkkj",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Why is that different to killing any animal to eat it’s meat? Besides it’s only what snakes are doing in the wild",
                                    "score": 2,
                                    "author": "PaladiiN",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Whats the diference between a cat and a mouse?",
                                    "score": 2,
                                    "author": "ThisFakeCut"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just like use mouses or something snakes eat those right",
            "score": -5,
            "author": "SpaceCube00",
            "replies": [
                {
                    "level": 1,
                    "comment": "You only value kitten lives over mice because you're hard-wired to see them as cute/cuddly where mice are varmin... but they are both living creatures who experience fear in the presence of death.",
                    "score": 14,
                    "author": "Shotta614",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah i'm not really seeing a diffrence with people who feed live mice to their snakes.",
                            "score": 8,
                            "author": "ShadyShamaster",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "While I've never fed a live mice to my snake, I have seen it done. Feeder mice are born and bread with the intention of that... being food to a snake. It's really no different than the slaughter of animals for human consumption.\n\nKittens are bread to be pets, so not really the same thing.",
                                    "score": 2,
                                    "author": "MalevolentFather",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Their \"purpose\" (that we have given them) doesn't change the fear they feel when they're about to die, or how they want to live though. So yes, they practically are the same",
                                            "score": 5,
                                            "author": "Sweetxie",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "After reading the title, I thought man was getting free food for his pet. What difference does it make if its kittens or mice, but dear lord, why would you say that last part?",
            "score": -44,
            "author": "FraFra12",
            "replies": [
                {
                    "level": 1,
                    "comment": "so, from an animal care perspective (please bare in mind that live-feeding snakes is illegal where i am) - you have to be really careful when live-feeding snakes to make sure that their prey doesn’t actually injure them. kittens are definitely more dangerous than mice in this regard.\n\nfrom a normal person perspective - this man is clearly not just doing this to feed his snakes. he’s doing it because he enjoys making the animals suffer. this is why it’s bad",
                    "score": 71,
                    "author": "lawerless",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;this is why it’s bad\n\nSo you agree with me? I didn't know that about live feeding snakes so thank you but the second half is pretty much my point",
                            "score": 9,
                            "author": "FraFra12",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "oh i agree! sorry, i misunderstood your comment :)",
                                    "score": 2,
                                    "author": "lawerless"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I mean... \nFeeding them to a snake is more eco-friendly thing you can do with a cat.",
            "score": 0,
            "author": "Entire-Development16"
        },
        {
            "level": 0,
            "comment": "i genuinely got a tear in my eye from this.\n\nthat’s not physically fucking possible. i’m going to find this person and feed them to a tiger piece by fucking piece until their cries of pain and fear fade into lifelessness.",
            "score": -8,
            "author": "tactical_nekofemboi",
            "replies": [
                {
                    "level": 1,
                    "comment": "No you're not",
                    "score": 9,
                    "author": "UstarobinHood",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Ok, so what are you going to do to the ones who kill mice to feed their snake! :O \n\n*Mice lives matter too!!!*",
                    "score": 7,
                    "author": "Shotta614",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "If adopting a cat is free, that just makes good fiscal sense.  Rabbits add up.",
            "score": -3,
            "author": "GorillaGrip38",
            "replies": []
        }
    ]
}