{
    "id": "11rl4zg",
    "score": 2183,
    "title": "Just couldn't wait",
    "author": "iatetoomuchchicken",
    "date": 1678851910.0,
    "url": "https://www.reddit.com/r/iamatotalpieceofshit/comments/11rl4zg",
    "media_urls": [
        "https://v.redd.it/m8xvhrk5rtna1"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\nPlease note that we will ban you if a post or comment breaks any of our rules. **Be especially mindful of the following**:\n\n**Rule 1: Do not post or ask for identifying information, including first and last names and social media usernames.** Public figures are **not** exempt. We remove all external links to prevent accidental posting of identifying information.\n\n**Rule 2: Do not post violent comments, and do not glorify violence, per TOS.** We can't take responsibility for how angry a post makes you, you need to do that. Telling us \"it was a joke bro\" is not an excuse.\n\n**Rule 7: Do not link to or post screenshots of reddit posts, reddit comments, reddit personal messages, reddit profiles, etc.** We cannot allow you to use this subreddit to harass other people on reddit. \n\n**Rule 8: No bigotry, no racism or race baiting.** It is hard to believe that we even need a rule like this. \n\n**Our rules are zero tolerance. You will be banned for breaking them.**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/iamatotalpieceofshit) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "I'm amazed that broke so easily for an item put in a subway. Was expected something more than that, still an idiot.",
            "score": 281,
            "author": "Beebwife",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not america. Those lights would have been broken the first day and never replaced here.",
                    "score": 65,
                    "author": "MiddleWelcome671",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ya, the moment I saw it was real glass and not 1/2 inch thick acrylic or perspex I knew it wasn't america. If anything it'd have a cone next to it and a hand written warning sign.",
                            "score": 27,
                            "author": "cmfppl"
                        },
                        {
                            "level": 2,
                            "comment": "That looks like the Moscow subway.",
                            "score": 4,
                            "author": "Hegemony-Cricket"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah for real that is a hazard. I could totally see people just touching randomly smacking them as they go down.\n\nThings should absolutely be built for the public. Not that the guy isn't at fault or anything just still.",
                    "score": 11,
                    "author": "ScorpioLaw"
                },
                {
                    "level": 1,
                    "comment": "Lemme guess. America or India ?",
                    "score": 2,
                    "author": "arenotthatguypal",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Definitely not America. Eastern Europe looks like to me",
                            "score": 31,
                            "author": "I-smelled-it-first",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Was going to say, not that I've been in every subway but have been in Chicago's and NYC and haven't seen these types of escalator centers.",
                                    "score": 5,
                                    "author": "Beebwife",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Now you know good damn well that is not in New York",
                                            "score": 7,
                                            "author": "Ok-Sprinkles-4490"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I was asking if that's where you're from. We can't have fragile things without watchful eyes in the us.\nAnd India doesn't have the nicest railways in terms of luxury.",
                                    "score": -2,
                                    "author": "arenotthatguypal",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I don't see where I'm from as a pertinent point. There are idiots everywhere and if you are designing a subway you should know people do this stuff. I've seen plenty of videos from the UK and elsewhere of people sliding down the center of these things. People are like 4yo olds.. don't put this breakable of items within reach bcs of Murphy's law.",
                                            "score": 1,
                                            "author": "Beebwife",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "He doesn’t think like engineer, glad you do.",
                                                    "score": 4,
                                                    "author": "Constant_Emphasis_22"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "To me it sounds like someone at the start is saying \"hé, jól vagy?\" in Hungarian, asking if the dude is alright in the head for climbing up. I might be wrong but it sounds like that",
                                    "score": 1,
                                    "author": "CptBlackBird2"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Moscow underground",
                            "score": 6,
                            "author": "DawnCubed",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yup, just saw a YouTube video about a week ago of a British guy touring around Russia.",
                                    "score": 2,
                                    "author": "woahbrad35",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah, saw the same video. The whole no advertisements and those specific lights are what rung that bell for me.",
                                            "score": 2,
                                            "author": "DawnCubed"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Russia. Probably St.petersburg. At least there definitely are lights like this there.",
                            "score": 2,
                            "author": "cyclingalex"
                        },
                        {
                            "level": 2,
                            "comment": "Why did you pair those two? Not even in the shittiest places of America would something like this be installed lol",
                            "score": 1,
                            "author": "fl135790135790"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Man of steel talking on the phone doesn't give any shits",
            "score": 83,
            "author": "ThisWorldIsABadJoke",
            "replies": [
                {
                    "level": 1,
                    "comment": "russians. that’s why people think they are crazy. just hard to surprise or disturb really",
                    "score": 11,
                    "author": "Mysterious-Fan-5101"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Raining glass yay",
            "score": 48,
            "author": "Practical_War716"
        },
        {
            "level": 0,
            "comment": "Stone cold has entered the ring",
            "score": 19,
            "author": "winkywally"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 99,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Redditor try not to advocate for violence challenge",
                    "score": 3,
                    "author": "ChekadosDeslazados",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I don’t do challenges.",
                            "score": 5,
                            "author": "GrizzlyGuru42",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Bro failed the challenge 💀",
                                    "score": 1,
                                    "author": "ChekadosDeslazados"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What kinda stupid escalator design is that anyways, i mean it’s stupid to do what he did but what’s with the crappy design",
            "score": 59,
            "author": "ThatJackaboy",
            "replies": [
                {
                    "level": 1,
                    "comment": "What's stupid about the design?",
                    "score": 7,
                    "author": "comicmuse1982",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Probably just the fragility of those glass lamps in a space where people are normally in a rush and bumping into their surroundings.\n\nGotta make those spaces idiot proof.",
                            "score": 21,
                            "author": "Norader",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You can hear how hug those glass pieces are.\n\nIf it was cheap glass it would have a higher pitch sound instead of the deep clanging you hear",
                                    "score": 5,
                                    "author": "iLoveLootBoxes"
                                },
                                {
                                    "level": 3,
                                    "comment": "I don't think they are that fragile, 70kg man ran into them in space that isn't for people. They wouldn't break if someone's arm hit into them, which also would be a completely unnecessary movement.\n\nYou don't bump into them by being in a rush.\n\nThere is only so much you can do to plan for stupidity.",
                                    "score": 3,
                                    "author": "comicmuse1982",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I feel like if someone commuting with a backpack full of stuff were to turn and swing their backpack, it would’ve broken it. Dudes definitely a muppet though.",
                                            "score": 4,
                                            "author": "Norader"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": -1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Why would a suitcase be up there?",
                                    "score": 1,
                                    "author": "comicmuse1982",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Seriously? People take mass transit to the airport all the time. They bring luggage with them when they do, and it’s more than likely people will rest things there as they’re descending. \n\nThere’s a difference between something like that breaking because it was deliberately targeted … vs breaking because it was inadvertently hit. A light cover like that needs to be able to stand up to being hit in various ways on a daily basis.",
                                            "score": -1,
                                            "author": "Clairquilt",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Why would you lift a heavy case onto a high, stationary surface instead of leaving it on the moving step by your feet?\n\nThose glass lights are glass and not plastic because they predate mass produced plastics. They've lasted a 100 years and millions of passing passengers.\n\nYou can stick your dick in an exhaust pipe, but it doesn't make it bad design if you burn your cock.",
                                                    "score": 2,
                                                    "author": "comicmuse1982",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "He just failed to understand that engineers back then didn't design it while keeping modern day idiots such as the one in the vid above in mind. Every year and generation had stupid people, but ig back then they weren't stupid to this extent.",
                                                            "score": 1,
                                                            "author": "Reaper_Rose_YT"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Design is arguably fine, since no one would accidentally (emphasis on \"accidentally\") even make contact with lamps as they are positioned far enough to ensure that. Those lamps are in fact quite old, which is itself good enough proof that design is fine. \nThat is, unless you are a clinical cretin, like the one in the video. \n\nThat's probably one of rather good examples of Western vs Eastern approach: while establishments of the former tend to protect idiots from themselves, as otherwise they will be held liable and sued, resulting in beefy compensation payout and other problems – the latter would actually sue the one who caused the havoc to cover all the inconvenience and expenses, as it was done intentionally.\n\nThe only point I would agree on is that idiots' actions could lead to harm to other people, which is not okay at all. But then again, the idiot in question and not the establishment would be held guilty of that, and I believe this is correct thing to do. Overprotection of stupid people does not make any good, it only results in then finding new ways to do even more stupid things.",
                                    "score": 1,
                                    "author": "Mugi4ok"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Maybe a gigantic glass bulb shouldn’t shatter into ten million pieces at the smallest touch.",
                            "score": 0,
                            "author": "TerbiumInside"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Moscow. the top of money pyramid. budget more than New York! stupid amounts, stupid spending, the mayor is the same - stupid, decorations and decisions - are stupid. lot’s of stupid in your country when it’s taken hostage by wannabe mafia кgb old pos crooks 🤷🏻‍♂️",
                    "score": 2,
                    "author": "Mysterious-Fan-5101"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Too scared to say excuse me to the guy in front of him but not too scared to make a fool of himself",
            "score": 6,
            "author": "canarow"
        },
        {
            "level": 0,
            "comment": "The guy on the phone didn’t even flinch…",
            "score": 7,
            "author": "Kuchbhhi"
        },
        {
            "level": 0,
            "comment": "i like to rewatch the video and pretend he’s going up instead of down",
            "score": 3,
            "author": "Chance-World1086",
            "replies": [
                {
                    "level": 1,
                    "comment": "Can't unsee it now",
                    "score": 3,
                    "author": "iLoveLootBoxes"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The glass falling soothed my headache for some reason 😊",
            "score": 3,
            "author": "OctopusStoner"
        },
        {
            "level": 0,
            "comment": "This dude just trying to finish his phone call",
            "score": 2,
            "author": "S4m_06"
        },
        {
            "level": 0,
            "comment": "Worst light design. There should not be any object between  rails or near these stairs.",
            "score": 0,
            "author": "Twosliceofbread",
            "replies": [
                {
                    "level": 1,
                    "comment": "There absolutely should be. Otherwise it would give idiots an idea to slide on these spaces between stairs, leading to even more severe consequences, probably not only for them but for others as well. \nIn fact, such objects are installed on purpose for this exact cause. \n\nAlso, as the other guy said, those undergrounds are old enough and were designed back when being stupid was not considered as something normal.",
                    "score": 2,
                    "author": "Mugi4ok"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The intrusive thoughts were too strong",
            "score": 1,
            "author": "food-is-gud"
        },
        {
            "level": 0,
            "comment": "Guy on phone is an NPC",
            "score": 1,
            "author": "icweiners69"
        },
        {
            "level": 0,
            "comment": "It wasn't about \"not waiting\", it was about making a scene and being a dick.\n\nNothing wrong with the design or system.",
            "score": 1,
            "author": "comicmuse1982"
        },
        {
            "level": 0,
            "comment": "If he was in a rush he’d have just passed on the left. This was just about being a dick.",
            "score": 1,
            "author": "know-your-onions"
        },
        {
            "level": 0,
            "comment": "Just couldnt wait..... or say excuse me.    \nBut then we wouldnt have this cinematic masterpiece. \n\nThe lead sucks, the director sucks, the cameraman sucks.   \nMay that broken glass symbolize their entertainment dreams.",
            "score": 1,
            "author": "loves_blunts"
        },
        {
            "level": 0,
            "comment": "Legends say the glass is still sliding down",
            "score": 1,
            "author": "Mysterious_Mind_420"
        },
        {
            "level": 0,
            "comment": "He did not need to cause all that chaos he could have used the f****** stairs some people are just so fill in the blank",
            "score": 1,
            "author": "Ok-Sprinkles-4490"
        },
        {
            "level": 0,
            "comment": "Isn’t it normal to stay on one side if you’re not walking down so others can pass?",
            "score": 1,
            "author": "tousag"
        },
        {
            "level": 0,
            "comment": "Congratulations you fucking idiot you did all that to save 1second\n\nIt's like people in traffic doing all sorts of bullshit just to stop in the same red light as you",
            "score": 1,
            "author": "Random_Name_7"
        },
        {
            "level": 0,
            "comment": "Ah yes, minecraft glass breaking noises.",
            "score": 1,
            "author": "Useful_Citizen"
        },
        {
            "level": 0,
            "comment": "…what was his plan? Fr? Like.. did he think he’d be able to jump over the lights? What was the end goal?",
            "score": 1,
            "author": "Zyereri"
        },
        {
            "level": 0,
            "comment": "You can tell by the little anime scuttle he was trying to do that he thought we was being super cool and agile...",
            "score": 1,
            "author": "a_burdie_from_hell"
        },
        {
            "level": 0,
            "comment": "Wow you're so radical dude 🙄",
            "score": 1,
            "author": "G14DomLoliFurryTrapX"
        },
        {
            "level": 0,
            "comment": "at least the tumbling glass noise was nice!",
            "score": 1,
            "author": "Ether_The_Wolf"
        },
        {
            "level": 0,
            "comment": "That's why we only use vandalism resistent lights in new Trainstations in Austria",
            "score": 1,
            "author": "jericho881"
        },
        {
            "level": 0,
            "comment": "There was room to walk too. What a muppet",
            "score": 1,
            "author": "QuotingThanos"
        }
    ]
}