{
    "id": "11twzfg",
    "score": 8834,
    "title": "The girl's father initially claimed the baby was his and had been dropped off on their porch by an ex-girlfriend.",
    "author": "[deleted]",
    "date": 1679072634.0,
    "url": "https://www.reddit.com/r/iamatotalpieceofshit/comments/11twzfg",
    "media_urls": [
        "https://i.redd.it/3lzseua0hdoa1.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\nPlease note that we will ban you if a post or comment breaks any of our rules. **Be especially mindful of the following**:\n\n**Rule 1: Do not post or ask for identifying information, including first and last names and social media usernames.** Public figures are **not** exempt. We remove all external links to prevent accidental posting of identifying information.\n\n**Rule 2: Do not post violent comments, and do not glorify violence, per TOS.** We can't take responsibility for how angry a post makes you, you need to do that. Telling us \"it was a joke bro\" is not an excuse.\n\n**Rule 7: Do not link to or post screenshots of reddit posts, reddit comments, reddit personal messages, reddit profiles, etc.** We cannot allow you to use this subreddit to harass other people on reddit. \n\n**Rule 8: No bigotry, no racism or race baiting.** It is hard to believe that we even need a rule like this. \n\n**Our rules are zero tolerance. You will be banned for breaking them.**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/iamatotalpieceofshit) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Is this the one where the parents refused to allow the 11 year old child any medical help during and after the birth of her baby?  Because, frankly, that poor girl needs to become an orphan and given to a decent family to help her deal with her trauma.",
            "score": 490,
            "author": "Ohif0n1y",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yup. The poor child birthed her rapist's child by herself in the bathtub.",
                    "score": 190,
                    "author": "MiaD89",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Absolutely despicable. I can only imagine the pain she feels",
                            "score": 10,
                            "author": "toki_tan"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Was this the one that they found out the dad also did things to her and the mom knew? Also wasn’t this in Missouri? Yeah I hope she found a new family, a new name, and got a lot of therapy.",
                    "score": 75,
                    "author": "lokimn17"
                },
                {
                    "level": 1,
                    "comment": "Is this Florida or even below them?",
                    "score": 16,
                    "author": "NYCMarine"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Guess they never heard of DNA.  Hope that poor girl gets a better home.",
            "score": 1431,
            "author": "Jaded_Pearl1996",
            "replies": [
                {
                    "level": 1,
                    "comment": "This story is 3 years old. I’m hoping she’s nowhere near these monsters anymore.",
                    "score": 242,
                    "author": "Risquechilli",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You mean living in Missouti?",
                            "score": 11,
                            "author": "LaPyramideBastille"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Does it help in cases like these?",
                    "score": 112,
                    "author": "gotnotendies",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Those are the states that are gonna ban DNA next, let alone knowing what it is.",
                            "score": -128,
                            "author": "ImportantDoubt6434",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Once is too many times.... but 100 are you fucking kidding me 🤮",
            "score": 145,
            "author": "VealOfFortune",
            "replies": [
                {
                    "level": 1,
                    "comment": "And the fact he kept count wtf",
                    "score": 12,
                    "author": "manor2003"
                }
            ]
        },
        {
            "level": 0,
            "comment": "“Had sex with his sister” the word you’re looking for is raped. He raped his 11-year-old sister about 100 times.",
            "score": 2954,
            "author": "MashedPotajoe",
            "replies": [
                {
                    "level": 1,
                    "comment": "Make that 9 or 10. She was 11 when she gave birth...",
                    "score": 107,
                    "author": "Magdalan"
                },
                {
                    "level": 1,
                    "comment": "Yes THANK YOU.   It’s infuriating the way headlines often minimize these situations.",
                    "score": 919,
                    "author": "cruisin5268d",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I believe it is bc they don't want to be sued, like how they add 'allegedly raped his11 year old sister'",
                            "score": 301,
                            "author": "manmadeofhonor",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The issue is that instead of saying (allegedly) “raped” the headlines often state “had sex.”  By very nature of her age she was raped, she can’t consent with that age difference.   Also in most US states someone of that age can’t consent period.   \n\nThis is a common theme with young girls.   See also:  referring to a pre-teen as a “young woman”. Nah, she’s a freaking child.  \n\nBy using “had sex” and “young woman” it downplays the severity.  “11 year old girl raped 100 times” has a significant shock value *as it should* in this case.",
                                    "score": 545,
                                    "author": "cruisin5268d",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "this is the right answer. they play these same sort of games with semantics when police kill someone. They’ll say “the suspect died during a routine traffic stop” instead of “the victim was killed by police during a routine traffic stop”",
                                            "score": 188,
                                            "author": "MechanicalBengal",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "This headline is merely relating what the suspect told police. So the media should just make something up to assuage your personal moral outrage about the alleged crime? I don’t care how heinous an alleged crime might be, the media should not peddle in bullshit.\n\nEdit: I am astounded how many people lack a basic understanding that police often coerce false confessions and that we shouldn’t be trying people in the media. There’s a very good reason confessions often get thrown out of court by dubious judges. We should not try people through the media. Young people and the mentally ill are some of the most susceptible to being coerced by unscrupulous police. Please don’t conflate having journalistic integrity and a hope for a blind justice system as me being an apologist for allegedly horrible crimes. Obviously I want any person who rapes someone to go to prison for a loooong time. I just want to make sure we don’t convict innocent people. And, lastly, the headline is merely restating what the suspect told police. That is inflammatory enough. It would be morally questionable to use more inciting language. These are all basic premises that society should respect in order to have as blind a justice system as possible.",
                                                    "score": -72,
                                                    "author": "koushakandystore",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Your placement of dubious is quite suspect.",
                                                            "score": 7,
                                                            "author": "foxjohnc87",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "That’s alright. If you are good with the mindless masses running society based on emotional hysteria then all the power to ya’ll.",
                                                                    "score": 0,
                                                                    "author": "koushakandystore",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Feel free to preach elsewhere. For your information, I certainly do not recall saying any such thing. If I did, please enlighten me.\n\nIt seems to be that my reply went right over the top of your head, so I'll make it clear. \n\nHere is your comment:\n\n&gt;There’s a very good reason confessions often get thrown out of court by dubious judges.\n\nYou have phrased it in such a way to imply that the judges themselves were questionable, not the confessions.",
                                                                            "score": 2,
                                                                            "author": "foxjohnc87",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "you’re saying an 11 year old girl wasn’t raped over 100 times? should I ask where you work as a youth pastor, or would that be inappropriate at this juncture",
                                                            "score": 68,
                                                            "author": "MechanicalBengal",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Read the text carefully. The boy told the police he had sex with his sister 100 times. The headline is repeating what the suspect told police. I guess you think it’s okay for the media to put spin against a person not yet convicted? Sorry, but as heinous as this alleged crime is the media still have to presume innocence. And the media shouldn’t be using sensational language to assuage reader moral outrage. Geez\n\nEdit: I am astounded how many people lack a basic understanding that police often coerce false confessions and that we shouldn’t be trying people in the media. There’s a very good reason confessions often get thrown out of court by dubious judges. We should not try people through the media. Young people and the mentally ill are some of the most susceptible to being coerced by unscrupulous police. Please don’t conflate having journalistic integrity and a hope for a blind justice system as me being an apologist for allegedly horrible crimes. Obviously I want any person who rapes someone to go to prison for a loooong time. I just want to make sure we don’t convict innocent people. And, lastly, the headline is merely restating what the suspect told police. That is inflammatory enough. It would be morally questionable to use more inciting language. These are all basic premises that society should respect in order to have as blind a justice system as possible.",
                                            "score": -55,
                                            "author": "koushakandystore",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It’s not sensational language. It is literally the legal truth.",
                                                    "score": 56,
                                                    "author": "johnsgrove",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "What is the legal truth? The person is only alleged until convicted. There is a VERY good reason for that. Our justice system fails to function effectively if people are tried in the media. This is a basic premise that any person of at least teenage years should understand. As far as this headline it’s merely a restating of what the suspect told the police. Do not conflate journalistic integrity with being an apologist for ALLEGED criminal behavior. And it IS ALLEGED until there is a conviction, regardless of whether or not the suspect confessed to police. You are aware that cops often coerce confessions right? Good grief. I MUST be on a raft with the masses.",
                                                            "score": 2,
                                                            "author": "koushakandystore"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I get your point about it being a quote from the 17 year old where he told police that he \"had sex with his sister 100 times\" but I don't see the point of presuming innocence when the quote is him confessing to raping an 11 year old. It would obviously be different in a case where the suspect was claiming to be innocent and there was a question of whether he did it or not. But he has literally confessed to raping her in this one so there isn't a question about whether or not he's guilty here.",
                                                    "score": 27,
                                                    "author": "StraightG0lden",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Please tell me what the spin the media put on in this instance when the accused admitted to fucking his sister who again was 11-years-old? The only spin i see is trying to diminish how heinous the crime is",
                                                    "score": 18,
                                                    "author": "MashedPotajoe",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "But they won’t because it’s not defamation",
                                    "score": 7,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Not until it's proven in a court of law",
                                            "score": 5,
                                            "author": "manmadeofhonor"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It's weird because they usually almost exclusively do that \"had sex with\" when the perpetrator is a woman - maybe they did it this time because he's a minor.",
                            "score": 41,
                            "author": "IDrinkMyOwnSemen",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It sounds like they might be using the wording that he used while talking to police?",
                                    "score": 41,
                                    "author": "Probablyprofanity",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That's the way I took it.",
                                            "score": 16,
                                            "author": "Accomplished_Note_81"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "That's what it is",
                                            "score": 3,
                                            "author": "hylasmaliki"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I’ve certainly seen it also in cases where a female teacher was reported for “having sex” with a student.",
                                    "score": 16,
                                    "author": "cruisin5268d"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's because they are quoting what the boy himself, said.",
                    "score": 38,
                    "author": "Xx_SwordWords_xX"
                },
                {
                    "level": 1,
                    "comment": "I just got stuck on “sex with sister”. I know my brothers. I cannot imagine having sex with any of them. Made me puke in my mouth a little!",
                    "score": 22,
                    "author": "Erthgoddss",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I believe they worded it more like a quote, just without the quotation marks. Otherwise, I completely agree.",
                    "score": 8,
                    "author": "No_Ad_4881"
                },
                {
                    "level": 1,
                    "comment": "it probably started at around 9 too",
                    "score": 3,
                    "author": "basch152",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "First, I completely agree with what you are saying and he definitely raped her. Should be noted though that they are paraphrasing what the brother said and he probably didn’t say he raped her. \n\nHorrible situation all in all.",
                    "score": 3,
                    "author": "RepresentativeFill26"
                },
                {
                    "level": 1,
                    "comment": "Yes! It always infuriates me that they don't say it for what it is. I can understand having to say allegedly until after a trial, but at least don't try to make it sound as if it is consensual.",
                    "score": 8,
                    "author": "ArtEclectic"
                },
                {
                    "level": 1,
                    "comment": "Hear hear! I know it’s just wording, but it’s really significant and important not to mince words in cases such as this.",
                    "score": 5,
                    "author": "forgetyourhorse"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 448,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;If my son did something like this, he’d be going away for a long time\n\nTrust that if my son did something like this I'd also be going away for a long time too because he'd be lucky if he was left alive after I'm done with him. 🤬",
                    "score": 121,
                    "author": "mrsdoubleu",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s the thing. If your son did something like this, you are more than likely a reason, if not THE reason. The child’s parents forced her to give birth in their bathtub and are also being charged. This is learned behavior. The father is also a sexual predator.",
                            "score": 2,
                            "author": "MarionberryIll5030"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Going away to live on a farm.",
                    "score": 12,
                    "author": "Praescribo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If that were my son I would’ve went insane",
            "score": 916,
            "author": "megayogurtslinger",
            "replies": [
                {
                    "level": 1,
                    "comment": "I fully agree. I don’t know how I’d ever be able to look at my son again, let alone share a living space.",
                    "score": 393,
                    "author": "novaleenationstate",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's unforgivable, and the only thing you can do is immediately and fully cooperate with law enforcement.",
                            "score": 169,
                            "author": "S-Archer",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Exactly. You need to immediately decide who you are going to align yourself with. If you choose anyone other than the victim, you were probably part of the problem.",
                                    "score": 54,
                                    "author": "forgetyourhorse",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I’d choose my 11-year-old, without a doubt. But I think another hard part to deal with would be the baby. \n\nIt would be my grandchild, but it would also be a living reminder of the trauma my child went through and the horrible thing my other child did. I’d either have to raise it as my own, which would be a huge challenge, or go with adoption. I don’t see any other decent alternatives.",
                                            "score": 4,
                                            "author": "novaleenationstate",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Not just share a living space but provide for him",
                            "score": 55,
                            "author": "SarixInTheHouse",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And the child too.",
                                    "score": 17,
                                    "author": "Swimming_Twist3781",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "not the child's fault both of them are completely innocent the 11 year old couldn't consent because of her age and all children are born innocent.\n\nhas a parent I'd kick him out and do my best to raise the child as my own last thing an 11 year old needs is that kind of responsibility.",
                                            "score": 21,
                                            "author": "UcDat",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I agree, I just meant that the newborn and the 11 child should not be blamed. They are victims.",
                                                    "score": 3,
                                                    "author": "Swimming_Twist3781"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "No this is one of the times where its ok to take em out back and finish em off.",
                            "score": 14,
                            "author": "CuriousOdity12345"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "If it happened 100 times, they knew and condoned it",
                    "score": 44,
                    "author": "westymama",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I could never ever ever EVER do that to my daughter it’s just sick",
                            "score": 5,
                            "author": "megayogurtslinger"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It’s good to hear that. Because unfortunately it seems all too common that these situations happen because the family tries to protect the perpetrator.",
                    "score": 135,
                    "author": "Seaboats",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I mean, come on guys, he has such a bright future ahead of him! /s",
                            "score": 2,
                            "author": "Myu_The_Weirdo",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "If that were my son I think there'd be a SEVERE need for some introspection. Namely, how the hell are you not aware of your 10 year old daughter being raped under your own roof by your own son? I refuse to believe that father wasn't enabling this behavior, if not participating himself. Fucking VIIIILE creature.",
                    "score": 133,
                    "author": "VealOfFortune",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 54,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Exactly, I wouldn’t be able to even call him my son.",
                            "score": 8,
                            "author": "megayogurtslinger"
                        },
                        {
                            "level": 2,
                            "comment": "May be his parents are having sex with their siblings",
                            "score": 20,
                            "author": "MaharaHsl",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "that or they knew about it. why else would the dad try and cover it up. fucked up situation all around regardless",
                                    "score": 13,
                                    "author": "skoopitypoop227"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Sadly, there may have been a lot of other bad stuff going on in that house. I’m guessing that anybody who cared enough to call the cops had that idea beaten out of them years ago. Sometimes this type of abuse is generational. I hope it’s not that bad. It may be.",
                    "score": 11,
                    "author": "forgetyourhorse"
                },
                {
                    "level": 1,
                    "comment": "My son and my husband would be in jail because my daughter was raped and they tried to cover it up. My daughter would be in foster care and I would be in jail. That is how this would go down if this happened to me. I would skip happily through the yard because justice would have been served properly.",
                    "score": 30,
                    "author": "Disastrous_Flower667",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Same, impulse would be to end him myself but I wouldn’t be able to do that.\n\n\nI would make it my personal duty that he experiences hell on earth and never sees the outside of a jail cell.",
                    "score": 6,
                    "author": "mooofasa1"
                }
            ]
        },
        {
            "level": 0,
            "comment": " I'm going out on a limb but I have to guess there are no \"father of the year\" candidates in that family.",
            "score": 332,
            "author": "Local_Sugar8108",
            "replies": [
                {
                    "level": 1,
                    "comment": "What about *worst* father of the year?",
                    "score": 68,
                    "author": "ProfessionalTax6386",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Most rapist pedophile father of the year",
                            "score": 44,
                            "author": "manmadeofhonor"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Brother of the year is still on the table then?",
                    "score": -3,
                    "author": "Date_Snape"
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": -22,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’ll never understand how someone can look at an actual child, and be attracted. It’s incomprehensible.",
            "score": 460,
            "author": "One-Pepper-6993",
            "replies": [
                {
                    "level": 1,
                    "comment": "Neglect or abuse is usually a cause, sadly. More than likely something that happened to them when they were children.",
                    "score": 123,
                    "author": "Four_Skyn_Tim"
                },
                {
                    "level": 1,
                    "comment": "Probably one of the only crimes that I would say unconditionally are punished by death sentence.",
                    "score": 67,
                    "author": "Medium-Tap698",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": -151,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Being attracted to children is not a crime.  Raping them is.  They stated death should be the penalty *for that crime*.  \n\n&gt;Most known pedophiles haven't done harm yet and they get a treatment of some sort that helps with the hormone. \n\nOK this is not true at all.  *Most known pedophiles* have done harm.  That is how they become known.  \n\n&gt;and they get a treatment of some sort that helps with the hormone. \n\nYou don't know what you are talking about.  There are treatments like Depo.  But you completely made up that \"most\" of them voluntarily ask for treatment before doing harm.",
                                    "score": 49,
                                    "author": "Laurenann7094"
                                },
                                {
                                    "level": 3,
                                    "comment": "He raped his 11 year old sister 100 times, that should warrant at least life in prison without parole while the guards announce his crime to general population",
                                    "score": 63,
                                    "author": "PunchyCat2004",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "“Hear Hear! Scoundrels of A Unit..”",
                                            "score": 3,
                                            "author": "KrylonMaestro"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt; XD\n\nDid you really begin this with a laughing emoticon? \n\nTf is the matter with you? Nice 'evolution'.",
                                    "score": 71,
                                    "author": "ChooglinOnDown"
                                },
                                {
                                    "level": 3,
                                    "comment": "i dont advocate the death of people who live with intrusive thoughts and are actively staying away, but the MOMENT they offend, i lose all sympathy. don't be a fucking idiot, the original comment was about the crime of offending anyways. funny how your first defense was to jump in to defend pedophiles.",
                                    "score": 18,
                                    "author": "oizyzz",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Stop while you're ahead you're showing yourself",
                                    "score": 60,
                                    "author": "chrisphucker_mlem",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Seriously. “Most known pedophiles haven’t done harm yet?” What the hell does that mean?",
                                            "score": 36,
                                            "author": "Left_Debt_8770",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Says the pedophile...........",
                                    "score": 11,
                                    "author": "ARWren85"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I heard in a movie that it’s sometimes not even about sexual attraction. I guess some of these guys just need to feel like they have absolute power over someone. Like, maybe they’ve always felt “less than“ all their life. Then they go and try to find somebody they can feel “greater than”.\n\nIt’s really upsetting, confusing, and difficult to understand. However, I’ve always thought that that’s actually a good sign. Most of us can’t understand it because we aren’t crazy. It seems repulsive to us because we’re not sick. It’s probably best to leave this to the experts who have the stomach for chasing these bastards down.",
                    "score": 7,
                    "author": "forgetyourhorse",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "It's not incomprehensible it's a disease and not a choice you can literally look it up",
                    "score": -59,
                    "author": "G14DomLoliFurryTrapX",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Whether it’s a disease or not, it is a choice to act on it and abuse kids",
                            "score": 38,
                            "author": "tttt11112"
                        },
                        {
                            "level": 2,
                            "comment": "Assaulting children is a choice. Coming from a childhood of sexual abuse myself, it is no excuse to continue the cycle. Sick thoughts are one thing that are deserving of immediate therapy. Stripping a child of their innocence however absolutely deserves the death penalty, full stop.",
                            "score": 43,
                            "author": "hallie-moorthy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I never said the act was justifiable, and that's not what the first comment is referring to. I said the sexual attraction towards children was not a choice and that pedophiles are people with a condition that forces them to either become a monster or to never have sexual pleasure. These people need help and not hate.",
                                    "score": -43,
                                    "author": "G14DomLoliFurryTrapX",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "If someones a pyromaniac, he will burn down your house or never be happy in his life..\n\nHe burns down your house, with your kids inside..\n\nHe is happy and mentally sick...\n\nDo you hate him?",
                                            "score": 6,
                                            "author": "Infectedx13",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I'm not a psychiatrist but I'm pretty sure pyromania doesn't cause the person to have a desire as basic as having sex when it comes to wanting to set fire to stuff. Also yeah I'd hate him, I never said I was justifying the act, I said people who are born that way need help and not hate exactly so that they don't end up harming anyone or themselves.",
                                                    "score": -3,
                                                    "author": "G14DomLoliFurryTrapX",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "And no one said the hate will fix them, but it's a completely normal and understandable action",
                                                            "score": 3,
                                                            "author": "Infectedx13",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I'm saying they don't deserve hate before they have harmed anyone. No one deserves hate simply for being born with a horrible condition.",
                                                                    "score": 4,
                                                                    "author": "G14DomLoliFurryTrapX"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 2,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I'm not a pedophile myself. I'm simply someone who's tired of seeing hate towards one of the least lucky people in the world. People who are born with an attraction towards children and haven't harmed anyone deserve help and not hate.",
                                                    "score": 1,
                                                    "author": "G14DomLoliFurryTrapX",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Pedophiles ARE THE disease",
                            "score": 11,
                            "author": "Not2daydear",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": -4,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I graduated university to become a therapist recently. Part of the course is undergoing therapy yourself to make sure you are psychologically fit to tend to the needs of others. We had to do both one on one sessions with a practicing therapist and a weekly group sessions the entire class\n\nOne of the girls ended up being kicked out during the third year after she decided to drop on the entire class during a group session that she was very happily in a long term sexual relationship with her brother. \n\nNeedless to say, this did not go down well with the professor who broke the cardinal rule of never ending or leaving a session before it was time to. Everyone was sent home and there were emergency meetings the rest of the day with the appropriate staff. \n\nThe girl in question was never back in class. The professor later said that as soon as this particular girl said what she said, some previous odd and off colour statements suddenly clicked and he realised that both her kids were fathered by her brother. If this had been pretty much anyone else in the class, we would have probably stayed and worked through it as a therapist would have to IRL, but since kids were involved he had to take immediate action.",
            "score": 127,
            "author": "SookHe",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ummm JFC that’s wild. How exactly did she phrase that particular info drop? Just out of the blue she was like “me and my bro be fuckin and we in love” ?",
                    "score": 71,
                    "author": "Prestigious_Owl_6623",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Weird choice of words in your quote.",
                            "score": 14,
                            "author": "kitten1218"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "How old were they both? Because wtf",
                    "score": 9,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "Wow! I can only guess the reaction the rest of the class had\n\nWhat happens in those cases? Are the kids taken away?",
                    "score": 8,
                    "author": "gamz1990"
                },
                {
                    "level": 1,
                    "comment": "To get to 3rd year, she must have known the repercussions of her admission. She's probably relieved to have it out in the open. Might be thinking that the only way to end it is to tell people she knew would take action.",
                    "score": 2,
                    "author": "HellsArmy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "To be honest, she was such a complete nutter to the point where nobody was willing to be her clients during practice sessions. She completely lacked any sense of self awareness, had no social skills and always had a cloud of drama following her everywhere she went. Her, along with about 5-6 other students would have done more damage to clients than good and fortunately they all ended up being weeded out by the end, hers just being the most dramatic.",
                            "score": 5,
                            "author": "SookHe"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "TF wrong with ppl and the parents knew . Poor girl never had a chance or life . Sad",
            "score": 45,
            "author": "PrimePatience"
        },
        {
            "level": 0,
            "comment": "If my son had done that I would have gone to prison on a murder charge.",
            "score": 238,
            "author": "GoodishBean",
            "replies": [
                {
                    "level": 1,
                    "comment": "Honestly, it might be the better of 2 evils. You brought an evil into this world so it rests on you to take it out even if you’re put behind bars. I’d rather take myself out for even letting it get that far because I wouldn’t be able to sleep.",
                    "score": 37,
                    "author": "mooofasa1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wise words.",
                            "score": 3,
                            "author": "GoodishBean"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Can we neuter those two? They don’t deserve having functional testicles.",
            "score": 91,
            "author": "RavynArcadia",
            "replies": [
                {
                    "level": 1,
                    "comment": "Just get rid of the whole package",
                    "score": 17,
                    "author": "mooofasa1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Nah. You gotta have something down there to kick with steel toed boots.",
                            "score": 9,
                            "author": "RavynArcadia",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The testicles are what hurt more than the shaft, if you kick it, just saying. Perhaps chemical castration is better",
                                    "score": 5,
                                    "author": "LocalH"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Geez…Fuuck. 11yr old kid, let that digest for a minute.",
            "score": 24,
            "author": "Franknstein26"
        },
        {
            "level": 0,
            "comment": "JFC - that poor young girl",
            "score": 214,
            "author": "AdministrativeYak859",
            "replies": [
                {
                    "level": 1,
                    "comment": "Right? That poor baby (the 10 year old girl being raped) likely never even started her period. She was probably pregnant the first time she ovulated. This is horrifically sad.",
                    "score": 63,
                    "author": "LizzieBell07",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What an awful days to have eyes, I didn't even know it was possible for a girl to get pregnant prior to at least going through some puberty changes such as ovulation. I kind of wish I didn't know that :/ i'm just imagining the turmoil that must put on their body and the permanent damage, when they don't even have the structures in place to go through a safe/healthy pregnancy yet.",
                            "score": 15,
                            "author": "YourEyesAreBleeding",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Some Girls are getting periods even younger than 10 these days. \nSchools (in Australia at least) had to change the year they taught puberty and sex Ed as girls were frequently getting their periods younger.",
                                    "score": 13,
                                    "author": "devilsonlyadvocate",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "If you look up average age of first period/menarche over time, its wild how much it has dropped in just a century. It used to be around 14 with girls commonly enough getting their first period at 16 and even as late as 19. Now it's considered out of the norm for a girl to make it to 15 without a period. It's even becoming pretty common for it to start around 9 years old. It makes sense that schools have to shift their sex ed from middle school to late elementary school now",
                                            "score": 16,
                                            "author": "wonderlandfriend",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Oh yeah. I only have a son but when he was in early primary school I was shocked all the parents that told me their daughters started their periods. The parents were also pretty shocked. The girls didn’t even have breasts really starting to grow. \n\nMy friends and I all had boobs first then periods.",
                                                    "score": 6,
                                                    "author": "devilsonlyadvocate",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yup! It's kind of concerning, especially if the trend continues to go down. Same here, or at the very least  we already started developing boobs. It shifted a lot in just a couple decades. I'm on the youngest end of millinials and got my first period at 12. Most people from my end of the generation started between 11-13. I talked to some of the older end of gen z, and  quite a few started at 9 or 10. We're only 4 year apart!",
                                                            "score": 7,
                                                            "author": "wonderlandfriend",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I’m in my 40s and got mine at 14. There was about two girls in school that got it as early as 11/12. Now that age is the older end. \n\nI feel awful how young girls now are having to navigate periods at school.",
                                                                    "score": 5,
                                                                    "author": "devilsonlyadvocate",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Seriously\n\nPreteens and teens are still very young, but there's a world of difference between the cognitive and emotional development of a 9 year old and an 11 year old. It's already a traumatic experience, but elementary school kids are still playing imagination games and often don't even know what a period *is*.",
                                                                            "score": 4,
                                                                            "author": "wonderlandfriend"
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "wow. i'm in my early 20s, got my first period at 12 at the end of 6th grade. i remember feeling insecure about not developing as fast as the other girls because most of my friends had already gotten theirs by that point. i didn't know that the average age of girls' first periods was getting lower at all. very interesting and concerning.",
                                                                            "score": 2,
                                                                            "author": "boogboo"
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Can I ask why the ages are getting lower?",
                                                                    "score": 4,
                                                                    "author": "YeetFacee123",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I'm not really sure tbh \n\n I've read some theories that it could have to do with hormones we use for animals and/or different body fat percentages activating the pituitary gland to release the hormones to start menstruating sooner \n\n\nBut that's just things I've read in passing so I'd look for research to know for sure",
                                                                            "score": 6,
                                                                            "author": "wonderlandfriend",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "A literal child. Not even a goddamn teenager yet. It's verbiage like this that allows people not to feel guilty raping kids. This was NOT a young woman.",
                    "score": 201,
                    "author": "wekoronshei",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "she wasn’t even a pre teen yet, literally a child who was robbed of her innocence . she’ll more than likely need a lot of mental health counseling to fully process being sexually assaulted by those who were supposed to protect her",
                            "score": 110,
                            "author": "Fredotorreto"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Woman? That’s a fucking child",
                    "score": 67,
                    "author": "pokemaninthemirror"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Everyone except that poor girl should be in jail for life",
            "score": 125,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I wonder how he even got caught? In a lot of cases, this type of thing goes unknown when the whole family is covering it up like that. It's a huge issue in the Amish, for example. I know the brother confessed, but I wonder if there were birth defects which led the medical staff to question if it was a case of incest, and have him questioned in the first place.\n\nPoor girl, i can't imagine being pregnant for 9 months at that age and giving birth without even receiving medical care. Hopefully she's able to move on and live a happy life in the future.",
            "score": 19,
            "author": "YourEyesAreBleeding",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I had this idea as a kid 30 years ago that we should send all sexual predators/chimo’s/rapists/anyone that hurts a child to the islands the US used for atomic testing back in the 1940’s , the Bikini Atoll. Just sent there with zero ability to leave… ever. A shipping container of food dropped in once a year and they can figure out the rest. \n\nThey need removed from society. Forever.\nThat son needs to be just removed from other people. \nHe’s old enough to know better. He’s broken. Send them to a nuke island full of radiation.",
            "score": 125,
            "author": "Nighthawkmf",
            "replies": [
                {
                    "level": 1,
                    "comment": "They'll need representation, can we send both houses of Congress with them?",
                    "score": 20,
                    "author": "LuckyTheLurker"
                },
                {
                    "level": 1,
                    "comment": "If you did that, they might end up reproducing and you'd have an island full of sexual predators and children (who would likely become a commodity on the island).\n\nI say continue the nuclear testing after putting them there.",
                    "score": 14,
                    "author": "YourEyesAreBleeding",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "chemical castration",
                            "score": 9,
                            "author": "oizyzz"
                        },
                        {
                            "level": 2,
                            "comment": "One island for woman and one for men.  No reproduction.",
                            "score": 11,
                            "author": "Miss-Chinaski"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "We just need to dust off the electric chairs",
                    "score": 19,
                    "author": "BeastSupremo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That’s absolutely insane. Hell yes they should be charged. How in Gods name could that be allowed to happen. Then to try to cover it up in such a way. Unbelievable. The saddest part is that this story goes even deeper than is being told. Molestation and incest must be rampant in that family, not to mention the emotional and psychological abuse that must be going on. That poor girls life and the lives of any snd all of the other children involved is destroyed. The parents should be prosecuted to the fullest extent and the children given the help that they need. Before you read this and pass any judgement on me for saying any or all of that, know this, I have survived 13 years of emotional, psychical, mental, and sexual abuse at the hands of my father, and not just me, but my brothers and sisters as well. My father was an absolute monster in the worst possible way. So, I think I know a thing or two about this kind of thing. My father pretended to be a good man. Went to church every Sunday, helped out the neighbors and to the outside world was a good man. But to his family he was a violent, abusive, angry, monster that raped his children then would threaten to kill them and would often times beat them into such a way that we were absolutely terrified of him. Even my mother was beaten and abused by him. Pieces of garbage like them do not deserve to live. They do not deserve to draw breath. People like this are inhuman monsters. And should be treated as such. I have no doubt in my mind that this little girls father was no better than mine. And people like them deserve nothing less than the death penalty because that’s exactly what they give their victims. They kill everything that they can be and leave a darkness of self doubt, insecurities and fear in their wake.",
            "score": 13,
            "author": "Anxious-Park-2851"
        },
        {
            "level": 0,
            "comment": "100 times 100 god damn times  \n\n\nJust let it sink in 100 bloody times",
            "score": 14,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "So when people say “it must be God’s will” when an infertile couple miscarries or can’t get pregnant, I think of stories like this and call bullshit on that theory. No god I’ve ever believed in would think a brother raping his 11-year-old sister would be better and more deserving recipients of a baby than a loving, adult, non-abusive couple trying desperately to add to their family.",
            "score": 28,
            "author": "1yogamama1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Honestly, most of the time when people say “it’s God’s will“ It’s because they don’t know what else to say, but they feel the need to say something. That phrase can be really upsetting for people who are actually dealing with tragedy. The people who say it would be better off just solemnly nodding their heads and keeping their mouths shut.",
                    "score": 15,
                    "author": "forgetyourhorse",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "this is exactly it. people also don’t understand that not everything is designed to glorify God. some things are just terrible because some people are terrible",
                            "score": 2,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "    The 17 year old boy said he had sex \n    with his sister 100 times\n\nHere. I fixed it for you. \n\nThe 17 year old boy said he RAPED his sister 100 times. \n\nGood Lord.",
            "score": 5,
            "author": "GuardMost8477"
        },
        {
            "level": 0,
            "comment": "This is absolutely sickening.  But how did no one notice that this young girl was pregnant?  I get how there are some stories of young women/adults giving birth and no one knew because they barely showed, but at 11, don’t tell me there wouldn’t be changes in physical appearance, eating habits, mannerisms, etc.  And the father was complicit in the original lie, meaning he likely knew about the incest on some level, so was ANYONE looking out for this child?  \n\nAnd the whole “innocent until proven otherwise” ballocks won’t fly here.  The brother admitted to the act(s), and the father admitted to lying about the baby’s origins, so BET he gets some nasty charges too.",
            "score": 4,
            "author": "Ginger_Welsh_Cookie"
        },
        {
            "level": 0,
            "comment": "Bloody monster raped her. It wasn't consensual sex. People are just trying to downplay the trauma.",
            "score": 2,
            "author": "Summer-Time9746"
        },
        {
            "level": 0,
            "comment": "If this were my son, they'd never find what's left of him, and if they did, he'd be impossible to identify the remains with anything other than DNA. \n\nThat poor girl. There's no way the parents didn't know what was going on. This was ABUSE all the way around. The poor child didn't have anyone on her side.",
            "score": 9,
            "author": "zzzrecruit"
        },
        {
            "level": 0,
            "comment": "That’s pretty sad. Imagine how broken or fucked up kid was that to do that to his own baby sister.",
            "score": 8,
            "author": "Donkey_Tamer_"
        },
        {
            "level": 0,
            "comment": "definition of parents not present",
            "score": 3,
            "author": "lowkeyf1sh"
        },
        {
            "level": 0,
            "comment": "So.....not a drag queen induced sex crime? Man for being such a danger, you dont hear about them all that often in these cases.  Certainly not as much as clergy and adult family members",
            "score": 104,
            "author": "adamempathy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Man. I get it. Drag queens are not inherently pedophiles. But the type of people who believe they are look at comments like these and scoff. Youre only preaching to your own base.",
                    "score": 44,
                    "author": "SadisticBuddhist"
                },
                {
                    "level": 1,
                    "comment": "Why do drag queens have to be in every discussion now? Weird comment. Seems like politics consume your life",
                    "score": 34,
                    "author": "Sammmmmmmmmmmmmmm",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's just the hot topic right now.",
                            "score": 6,
                            "author": "Spoonloops"
                        },
                        {
                            "level": 2,
                            "comment": "Becuase politicans all over are pretending they're a threat to kids as a distraction while they ignore things like this.",
                            "score": 6,
                            "author": "Technicolor_Reindeer",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What exactly can a politician do about a situation like this?",
                                    "score": 6,
                                    "author": "Sammmmmmmmmmmmmmm"
                                },
                                {
                                    "level": 3,
                                    "comment": "I mean...why are you guys soooo insistent on having kids be allowed to be in drag shows at all? why make this a hill you're willing to die on? Seems weird from my perspective.",
                                    "score": 2,
                                    "author": "SufferinBPD_AyyyLMAO",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Nobody is forcing kids to go to drag shows this is the choice of the parents for better or worse. Yet somehow the drag queens get blamed.  So yeah leave the damn drag queens alone. Also there is nothing sexual about drag queens reading books to children at libraries yet we have morons showing up and disrupting them forcing the libraries to cancel story time for the kids.",
                                            "score": 5,
                                            "author": "TwilightontheMoon",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "For someone with \"empathy\" in your name it's pretty tasteless to comment on someone's tragic situation to project your own politics. I'm surprised you're getting upvotes",
                    "score": -10,
                    "author": "cptomgipwndu",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Just pointing out the blatant hypocrisy, it's not like I'm saying it to her.  Also, it's not politics.  It's straight observable facts .",
                            "score": 12,
                            "author": "adamempathy"
                        },
                        {
                            "level": 2,
                            "comment": "The fact that you think it is political speaks volumes",
                            "score": -1,
                            "author": "Technicolor_Reindeer",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I don't think it's politics... I know it is",
                                    "score": -6,
                                    "author": "cptomgipwndu"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It's reddit and drag queens are the flavor of the month.\n\nGive it a week or two, they'll forget about it or move on to the next thing.",
                            "score": -29,
                            "author": "Rumplestilskin9",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah we're the ones preoccupied with it.  That's it",
                                    "score": 6,
                                    "author": "adamempathy"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This ain’t about American politics stop making everything political",
                    "score": -18,
                    "author": "CryingCookieyoshi",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's the point, the fact that you think it is political speaks volumes",
                            "score": 10,
                            "author": "adamempathy",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I don't think drag queens are pedophiles and I know the clergy have along history of sex abuse. Knowing that I still don't see why it's okay/important to have adult content performers teaching children. Not to mention drag queens portray exaggerated outdated and often times offensive woman stereotypes. Why is everything all of a sudden a justification for drag queens to be around children.",
                    "score": -31,
                    "author": "woo1324",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Drag story time is literally just people in over eccentric makeup and a wig reading to children. There’s no “ adult content” being performed.",
                            "score": 7,
                            "author": "Outrageous_Bee6966"
                        },
                        {
                            "level": 2,
                            "comment": "You’ve clearly never seen a drag story time if you think it contains any “adult content”",
                            "score": 19,
                            "author": "nalyddoctor",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "There are plenty of trans pedophiles.  That is not the topic of this post.  Try to keep up.",
                    "score": -13,
                    "author": "Laurenann7094",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Seeing as how you don’t know the difference between drag queens and trans folk you should probably keep quiet.",
                            "score": 1,
                            "author": "TwilightontheMoon"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I hope whatever is hurtling towards earth doesn't miss this time thanks to stories like this.",
            "score": 6,
            "author": "Bella14LV"
        },
        {
            "level": 0,
            "comment": "There's no names attached to the story but does anyone have any news links that might appear related that could give more context?",
            "score": 4,
            "author": "No-Chocolate-6828",
            "replies": []
        },
        {
            "level": 0,
            "comment": "We will pay for his housing until criminals do better control over what we can’t by law, and they will get more time for removing him",
            "score": 2,
            "author": "CityBrave4773"
        },
        {
            "level": 0,
            "comment": "This happened 2 years ago.  I found a few news articles on it.  It was in Missouri and apparently the dad was here illegally. \n\nIt's a very sad and disturbing story. Juat imagine the little girl and psychological damage she's suffering. Not only that but also if she keeps the baby how people will react to the incest. \n\nWhat a huge mess and such a sad story for her and the child.",
            "score": 2,
            "author": "brian97cobra"
        },
        {
            "level": 0,
            "comment": "Correction “he raped his sister about 100 times”",
            "score": 2,
            "author": "Physical_Witness_922"
        },
        {
            "level": 0,
            "comment": "Hope that girl and that baby find a good home.",
            "score": 2,
            "author": "Richy_777"
        },
        {
            "level": 0,
            "comment": "“Had sex with”? Really?! No dude you raped your sister over 100 times. It’s only sex when it’s consensual.",
            "score": 2,
            "author": "azacealla"
        },
        {
            "level": 0,
            "comment": "This happens more than people think. Happened in my family, the baby is now 13 and has very bad developmental problems.",
            "score": 2,
            "author": "FanChanel40"
        },
        {
            "level": 0,
            "comment": "I used to work with the mom of the two of them. She was super nice at work. Pretty shocking to see this.",
            "score": 3,
            "author": "chriss1111"
        },
        {
            "level": 0,
            "comment": "2 more for the GOP workforce program",
            "score": 3,
            "author": "Moobob66"
        },
        {
            "level": 0,
            "comment": "Must have happened in a Red State.",
            "score": -18,
            "author": "eheyburn",
            "replies": [
                {
                    "level": 1,
                    "comment": "Pedophilia doesn't discriminate based on politics or geographical location, these people exist in all walks of life and in all positions of power. \n\nAdditionally, there's a saying I heard once which stuck with me, \"Not everyone who goes to church is a rapist, but rapists always go to church,\" and the meaning of that saying is that people who commit these heinous acts are often seen as positive role models, stand up members of your community, and as normal/respectable people before their crimes are discovered.",
                    "score": 9,
                    "author": "YourEyesAreBleeding"
                }
            ]
        },
        {
            "level": 0,
            "comment": "and people ask what's wrong with exposing kids to sex, porn and degeneracy.",
            "score": -23,
            "author": "Proud_Bookkeeper_248"
        },
        {
            "level": 0,
            "comment": "I wonder if he was a great big 4chan enjoyer?",
            "score": -50,
            "author": "wild_neuroses",
            "replies": [
                {
                    "level": 1,
                    "comment": "You know damn well 4chan is strong within this household",
                    "score": 9,
                    "author": "Far_Design333"
                },
                {
                    "level": 1,
                    "comment": "Even most 4Chan users aren’t that depraved",
                    "score": 1,
                    "author": "No_Biscotti_7110",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Are you sure about that?",
                            "score": 1,
                            "author": "CryingCookieyoshi"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Think about the psyche of a pre teen who is introduce to adult film sites that promote incest, force, and other crazy genres. Which has happened In the last decades or so. Statistically, cases like this will rise due to the direct impact of these sites . Kids can barely differentiate reality vs internet already .",
            "score": -44,
            "author": "AppointmentNearby965",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was raped for many years as a child by my older teen brother. The internet didn't exist yet at the time. \n\n\nShould I blame \"pOrn sites\" or should I continue to blame abusive and neglectful parenting and my psychopath of a brother?\n\nEdit: The poster I replied to has edited their comment BTW.",
                    "score": 34,
                    "author": "StarFaerie",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Firstly, I’m sorry that happened to you and I pray you find healing. As far as your question goes. No you shouldn’t blame the sites , you should blame everyone around you that allowed that to happen. What your failing to see is that I stated , statistically speaking , due to these sites and being exposed to incest as a normality at a young age could ignite a spark for someone to do that to a family member . Especially those that have lack of parenting and sexual education.",
                            "score": -30,
                            "author": "AppointmentNearby965",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Maybe don't use your pornhound account to moralize over this?",
                    "score": 6,
                    "author": "fatherfrank1"
                },
                {
                    "level": 1,
                    "comment": "Downvoted for being right",
                    "score": -28,
                    "author": "CryingCookieyoshi",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "So did this child get medical attention before , during and after giving birth?\n\nDid her father try to prevent her receiving medical help by lying as to where the baby came from ?",
            "score": 0,
            "author": "Wheres_that_to"
        }
    ]
}