{
    "id": "127yo0t",
    "score": 9576,
    "title": "Really, you couldn’t even use 4 blocks?",
    "author": "TheCamiloCano",
    "date": 1680295468.0,
    "url": "https://www.reddit.com/r/iamatotalpieceofshit/comments/127yo0t",
    "media_urls": [
        "https://i.redd.it/1m2yjlxkz4ra1.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\nPlease note that we will ban you if a post or comment breaks any of our rules. **Be especially mindful of the following**:\n\n**Rule 1: Do not post or ask for identifying information, including first and last names and social media usernames.** Public figures are **not** exempt. We remove all external links to prevent accidental posting of identifying information.\n\n**Rule 2: Do not post violent comments, and do not glorify violence, per TOS.** We can't take responsibility for how angry a post makes you, you need to do that. Telling us \"it was a joke bro\" is not an excuse.\n\n**Rule 7: Do not link to or post screenshots of reddit posts, reddit comments, reddit personal messages, reddit profiles, etc.** We cannot allow you to use this subreddit to harass other people on reddit. \n\n**Rule 8: No bigotry, no racism or race baiting.** It is hard to believe that we even need a rule like this. \n\n**Our rules are zero tolerance. You will be banned for breaking them.**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/iamatotalpieceofshit) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Only needed 1 to save their jack for next time.",
            "score": 979,
            "author": "JoeBoredom",
            "replies": [
                {
                    "level": 1,
                    "comment": "Why use many block when one block do trick?",
                    "score": 337,
                    "author": "Heisenbread77",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Listen, Kevin…",
                            "score": 68,
                            "author": "ninthandfirst",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Rims no pay, extra money, see world.",
                                    "score": 62,
                                    "author": "TheCamiloCano",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "And the chop shop will be happy.",
                                            "score": 9,
                                            "author": "MadLaamaDisease",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "They give you more if you return your cinder blocks",
                                                    "score": 3,
                                                    "author": "KroniKIX",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It runs starts and stops. 2g obo need gone asap",
                                                            "score": 2,
                                                            "author": "TheOtherDenham"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They used two- there’s one on each side",
                    "score": 7,
                    "author": "ksixnine"
                },
                {
                    "level": 1,
                    "comment": "Rental fleet master tech here.\n\nI have gone out on our lot, taken wheels off a car, and headed to the field to put them on the same model that had theirs stolen a few times. Always get a tow truck to tow it back just in case, though. Usually have to replace rotor shields and sometimes rotors too though.",
                    "score": 3,
                    "author": "mrford86"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This way you only need to jack up one end of the car.",
            "score": 339,
            "author": "dirtyhairymess",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's genius,  sucks their brains are being wasted on crime.",
                    "score": 126,
                    "author": "coocoocachoo699",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "How so?",
                    "score": 8,
                    "author": "Aviyan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Jack the front up enough to get the block where it is, then when you take the front tires off and drop the jack it pivots to this position and the rears can be removed. I think.",
                            "score": 80,
                            "author": "mtdewelf",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yep. You think right. Picture a teeter-totter.",
                                    "score": 33,
                                    "author": "jackspratt88",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Engine heavy",
                                            "score": 7,
                                            "author": "Independent_Sky_517",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I just realised you call see-saws teeter-totter's in America and I'm not sure which one sounds more stupid",
                                            "score": 4,
                                            "author": "The_Mayfair_Man",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It's probably a regional thing. I'm from the south and we say see-saw. I've always thought teeter- totter sounds stupid too, until I just saw them both in writing. They're both pretty stupid",
                                                    "score": 3,
                                                    "author": "Square_Sink7318",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I'm Canadian, I have no idea what my American cousins would call it. And yep, actually typing it out made me realize what a weird name it was, but I've used it all my life so guess I'm just used to it.",
                                                    "score": 1,
                                                    "author": "jackspratt88"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I have always called them by both names",
                                                    "score": 1,
                                                    "author": "19961997199819992000"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I haven't heard teeter-totter in decades as a noun, I've heard see-saw. Teeter-totter is more commonly used to describe what something precariously balanced is doing.",
                                                    "score": 1,
                                                    "author": "ebrum2010"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "That is the most dickest of dick moves.",
                                    "score": 5,
                                    "author": "jballs"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Business expenses low. Pass on savings to end user.",
            "score": 231,
            "author": "workitloud",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, why double or quadruple your enterprise's consumables expenses.",
                    "score": 29,
                    "author": "lred1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Cinder blocks don't grow on trees. Thank God...",
                            "score": 17,
                            "author": "Amazing-Ad-669",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Damn inflation",
                                    "score": 3,
                                    "author": "Booze-o-tron",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "No need to worry with no tires to inflate",
                                            "score": 0,
                                            "author": "Amazing-Ad-669"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I recently redid my floors and needed to glue some pieces over night. Had a couple of cinder blocks laying around from the previous owner. Could only glue a piece at a time because I only had 2 and where the heck am I suppose to get more experience our state does not even use them in construction. It's not like it's a 2x4.",
                            "score": 2,
                            "author": "Tyrannyofshould"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Really is no honor among thieves",
            "score": 307,
            "author": "Prestigious_Badger36",
            "replies": [
                {
                    "level": 1,
                    "comment": "Never was.",
                    "score": 25,
                    "author": "BrownGhost10",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "**\"among\"** thieves.\n\nThieves being honourable *with their own kind*.\n\nThat expression was never about honourable thieves in general.\n\nJust that in many places, in certain times, there was a code of conduct between criminals (and running afoul of it would get you punished; essentially a second set of laws that applied inside the criminal, sometimes generally the unprivileged, parts of society).\n\nSo you'd expect them to stick together, but that never meant outsiders were to expect honourable thieves. \n\nThe general population was always fair game.",
                            "score": 54,
                            "author": "BrainOnLoan",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Succinct philology! Unless the owner of the blue car was also a thief, my phraseology wasn't precise.",
                                    "score": 9,
                                    "author": "Prestigious_Badger36"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Assuming the car owners were also connected to the criminal world than the phrase would work",
                    "score": 4,
                    "author": "jyrihenrik"
                },
                {
                    "level": 1,
                    "comment": "Speaking of which: The new DnD movie, Honor Among Thieves, with Chris Pine and High Grant just came out, and it's ridiculously good. I was legitimately shocked at how much I *enjoyed* that movie.\n\nGo see it, people.",
                    "score": -2,
                    "author": "Mister_Bloodvessel",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I, too, enjoyed Dungeons and Dragons: Honor Among Thieves, produced by Paramount Pictures, which stars a squad of unlikely adventurers on a quest to retrieve a lost relic. I particularly enjoyed how critically acclaimed directors Jonathan Goldstein and John Francis Daley bring the legendary roleplaying game to life in a hilarious and action packed adventure, now playing only in theaters! \n\n\n*$0.32 has been deposited into your account*",
                            "score": 13,
                            "author": "pokelord13",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I fucking *wish*. \n\nNo, it's genuinely good.",
                                    "score": 2,
                                    "author": "Mister_Bloodvessel"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not in this economy",
            "score": 58,
            "author": "Seipher187"
        },
        {
            "level": 0,
            "comment": "4 blocks? In this economy?",
            "score": 59,
            "author": "GaryTheDamnSnail"
        },
        {
            "level": 0,
            "comment": "Wow. They even took the lug nuts.",
            "score": 122,
            "author": "mike-manley",
            "replies": [
                {
                    "level": 1,
                    "comment": "Full set of lug nuts is $30-50.",
                    "score": 71,
                    "author": "dontcrashandburn",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If these rims were nice enough to steal I’m assuming they had wheel lock lugs which can simply be smashed through with a socket wrench and hammer. Also I think you can just buy any key for any car online which is fucked and makes stealing so much easier",
                            "score": 3,
                            "author": "Smathers",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Per tire or per car?",
                            "score": 14,
                            "author": "CyptidProductions",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Whole car. But you already took them off might as well keep 'em.",
                                    "score": 48,
                                    "author": "dontcrashandburn"
                                },
                                {
                                    "level": 3,
                                    "comment": "Per tire for a Toyota tundra",
                                    "score": 12,
                                    "author": "tbst",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah dude, my landcruiser lugs cost a fortune",
                                            "score": 6,
                                            "author": "itsvuksfault",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Just get them from a pick and pull.  Super easy quick and much cheaper. Plus who cares they're lug nuts",
                                                    "score": 9,
                                                    "author": "Winter_Eternal",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Just went to one of these for the first time, called u-pullit here in buffalo, ny. Luckily got the parts for my hyundai, stupid tiktok challenge. The parts are backlogged till june, u-pullit was like 90% cheaper, lucked out there was a compatible hyundai in the lot, 2 hour drive for parts though but still a huge win",
                                                            "score": 1,
                                                            "author": "ledgeitpro"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Wheel locks are like an $80 option on a Tundra - they can't be that expensive...",
                                            "score": 1,
                                            "author": "vahntitrio"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I mean, factory rims are pretty pricy. Probably exceeds the insurance deductible (especially because comprehensive usually has a very low deductible). Probably doesn’t make much of a difference to OP. I’d be more worried about body damage from the block. That’s a lot harder to fix perfectly.",
                            "score": 2,
                            "author": "squaredistrict2213"
                        },
                        {
                            "level": 2,
                            "comment": "People are down that bad?",
                            "score": 1,
                            "author": "AlaskanIceWater"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I mean, yeah? You have to remove them to take the wheel off. You think they are going to put them back on?",
                    "score": 36,
                    "author": "TangerineRough6318",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Surprised they didn't leave them on the ground.",
                            "score": 32,
                            "author": "mike-manley",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I guess that's a fair point",
                                    "score": 16,
                                    "author": "TangerineRough6318"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I swear I remember reading a story or seeing a picture where someone’s wheels were stolen like this, but the thief put on shitty rims so they could still drive it. Basically swapped the good ones with steelies.",
                            "score": 4,
                            "author": "squaredistrict2213",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's kind of nice...sort of.",
                                    "score": 1,
                                    "author": "TangerineRough6318"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "If you frequent the stealership that you constantly talk bad about online I'll give you a set of take off lugs",
                    "score": 1,
                    "author": "busch_chugger"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If it’s a repo they’re lucky they’re off the ground.",
            "score": 56,
            "author": "rcmp_informant",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 86,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "People that wanna show off rims they can't afford\n\nIt's more common than you may think",
                            "score": 54,
                            "author": "NeverGrace",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I worked at a shitty little ghetto shop way back when and it was more common to have the rims cost more than the car than not.  Financial wizards, lemme tell you.  But hey.  Long as you baller",
                                    "score": 18,
                                    "author": "Winter_Eternal",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "When you in the car, you can't even see them spin.",
                                            "score": 5,
                                            "author": "user_bits",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "In this case, I'm going to say the rims were stock. 10th Gen Accord Sport rims already look amazing from the factory, and that is why they are some of the most stolen wheels",
                                    "score": 9,
                                    "author": "neubourn",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Can confirm, buddy of mine had his stolen recently",
                                            "score": 3,
                                            "author": "deafkore"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I have the Accord Touring. Same rims but without the black bits. An accord sport was parked outside my house, next to my car. I woke up and his rims were gone, mine were untouched. They reaaaaly like the sport rims.",
                                            "score": 1,
                                            "author": "ilovecollardgreens"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Some truck tires go into the multiple thousands before they even touch the wheel.\n\n3-5k is not unheard of and any wheel/tire place will definitely finance that out at 25% apr",
                            "score": 16,
                            "author": "graphitewolf",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This. Esp if you have 10 new Michelins and you hate paying for em.\n\n\nAlso you leave your truck somewhere dumb unattended",
                                    "score": 7,
                                    "author": "rcmp_informant"
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 17,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Expensive wheels agreed. Tires? I mean if you need tires and you don't have the money then and there I get it. Discount tire here in the US finances both and I think it's interest free for a period of time not sure. The alternative is used and some people don't trust used. I've had used when I was broke. Had good luck with them but I get it.",
                                            "score": 9,
                                            "author": "killj0y1"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "People pay interest on televisions and iphones. That level of stupid is very common.",
                            "score": 2,
                            "author": "hhhater666"
                        },
                        {
                            "level": 2,
                            "comment": "RentAWheel is still going in my city.\n\nNissan Altimas in the parking lot year round.",
                            "score": 2,
                            "author": "SGTSHOOTnMISS"
                        },
                        {
                            "level": 2,
                            "comment": "Ever see $2000 rims on an $800 car? That’s how.",
                            "score": 2,
                            "author": "FrostyDub"
                        },
                        {
                            "level": 2,
                            "comment": "of course they do, they just hear $100/mo or whatever it costs (no idea) and know they can pay that (until they do something dumb).",
                            "score": 1,
                            "author": "CHEEZE_BAGS"
                        },
                        {
                            "level": 2,
                            "comment": "Ever go to one of those rent to own places that charge like $4500 for a $400 fridge? They do rims too.",
                            "score": 1,
                            "author": "squaredistrict2213"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "In the meantime, how are your brakes and rotors?",
            "score": 12,
            "author": "Upstairs-Injury9660"
        },
        {
            "level": 0,
            "comment": "Jackers of all trades.....",
            "score": 7,
            "author": "BUNNGYMAN"
        },
        {
            "level": 0,
            "comment": "At least the catalytic converter is safe, if not already gone.",
            "score": 6,
            "author": "Commercial-Health-19",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Times are tough all over.",
            "score": 6,
            "author": "MrAbadeer"
        },
        {
            "level": 0,
            "comment": "Teeter totter technique",
            "score": 5,
            "author": "Bunkymids"
        },
        {
            "level": 0,
            "comment": "You’re asking for too much.",
            "score": 9,
            "author": "hhtran16"
        },
        {
            "level": 0,
            "comment": "Someone stole them.",
            "score": 12,
            "author": "happycamperii"
        },
        {
            "level": 0,
            "comment": "Can't afford it",
            "score": 3,
            "author": "isorithm666"
        },
        {
            "level": 0,
            "comment": "Times are tough for everyone",
            "score": 3,
            "author": "Dead_Puppets"
        },
        {
            "level": 0,
            "comment": "Cement blocks are heavy bro",
            "score": 2,
            "author": "bmd33zy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Seriously. Where i live they just use some cheap wood.",
                    "score": 4,
                    "author": "Dektarey"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Rotors are rusted, car hasn’t been driven in a minute.",
            "score": 2,
            "author": "hutraider",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This is why wheel locks are standard with honda",
            "score": 3,
            "author": "BOSBoatMan",
            "replies": [
                {
                    "level": 1,
                    "comment": "They’re unfortunately not thought.   You have to buy them as accessories.",
                    "score": 8,
                    "author": "NCSUGrad2012",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m in Boston. Went through three (possible) purchases in the past three days. All three dealers put on there and all stated it was not optional. \n\nI asked why on the third and last, and he showed me a picture of the car on their lot just that morning, same thing - car on cinder blocks and third that has gotten knocked off on their lot that month. Yes, cameras everywhere. This is a well to do town in a very visible location. \n\nBefore anybody goes saying i got ripped off/unsold - I can assure you that is not the case",
                            "score": 3,
                            "author": "BOSBoatMan",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I don’t doubt what you’re saying, however they’re still not standard equipment. They’re dealer added OEM accessories that the specific dealerships you went to aren’t willing to take off. Some dealers charge a fair price, others mark them up by several hundred bucks. Sounds like you got a fair price which is always nice\n\nI just bought a new Honda and wasn’t made to get wheel locks, but was made to get all weather mats, trunk liner and mud guards. Thankfully at fair price",
                                    "score": 2,
                                    "author": "-a-user-has-no-name-"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That looks like an Accord though.",
                    "score": -3,
                    "author": "cantthinkofadamnthin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A Honda accord?",
                            "score": 7,
                            "author": "CosmicCyrolator",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Don't put any faith in wheel locks. People think they're a deterrent but it quite literally takes thieves all of two extra seconds to get them off.",
                    "score": 1,
                    "author": "PurpleK00lA1d"
                }
            ]
        },
        {
            "level": 0,
            "comment": "They just wanted to show you that your rotors need replaced dawg. SMH I bet you didn’t even leave a tip /s",
            "score": 0,
            "author": "Cheefnuggs"
        },
        {
            "level": 0,
            "comment": "B.S. look at the rust on the rotors.. car's been sitting a while like that",
            "score": -14,
            "author": "DamRamNation",
            "replies": [
                {
                    "level": 1,
                    "comment": "Car may have been sitting there, sure. But disks rust like that with or without the wheels on.",
                    "score": 15,
                    "author": "havok0159",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Facts. I got a brand new car last year and the disks are already showing spots of rust. I take pretty good care of my car and I can't figure it out.",
                            "score": 6,
                            "author": "hubricht",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Discs aren't stainless. The metal there made of just rusts. A bit of firm braking will remove any surface rust. That's why they only paint the edges of rotors.  You can just start to see a very fine bit of rust on discs after work if you drive through a puddle when parking before work. That could have just been sitting there for one day in Florida",
                                    "score": 7,
                                    "author": "TheGreatNico",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "It's bare metal. If there's any moisture in the air and/or salt on the road it can happen really quickly.",
                                    "score": 2,
                                    "author": "killj0y1"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My fellow r-word, they're gonna rust if there's any bit of rain involved. \n\nMy daily driver mustang has rusted ugly looking discs and it's only a 2019 with 20k miles. \n\nStupid ass.",
                    "score": 0,
                    "author": "MisterKrayzie"
                },
                {
                    "level": 1,
                    "comment": "Yes OP just pulled all their wheels off and dropped their car on the ground all for imaginary points \n\nLol at these braindead takes",
                    "score": 0,
                    "author": "truffleboffin"
                },
                {
                    "level": 1,
                    "comment": "This will happen overnight where I live",
                    "score": 1,
                    "author": "G18Curse"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yo blocks are expensive man",
            "score": 1,
            "author": "Astronopolis"
        },
        {
            "level": 0,
            "comment": "Inflation so bad robbers cant afford 4 cinderblocks",
            "score": 1,
            "author": "ListenHereIvan"
        },
        {
            "level": 0,
            "comment": "They’ll be able to afford 4 now.",
            "score": 1,
            "author": "100yearswar"
        },
        {
            "level": 0,
            "comment": "4 concrete blocks?! In this economy?",
            "score": 1,
            "author": "Hawkmoon_"
        },
        {
            "level": 0,
            "comment": "The economy is getting to us all. Cuts had to be made.",
            "score": 1,
            "author": "PoorMansCornCob"
        },
        {
            "level": 0,
            "comment": "I would at least use 4 blocks. Because I care",
            "score": 1,
            "author": "scary-and"
        },
        {
            "level": 0,
            "comment": "Who has four blocks in this economy?",
            "score": 1,
            "author": "ImportanceBig4448"
        },
        {
            "level": 0,
            "comment": "They did but the next guy stole those as well",
            "score": 1,
            "author": "KonataYumi"
        },
        {
            "level": 0,
            "comment": "You got got",
            "score": 1,
            "author": "ssgodss"
        },
        {
            "level": 0,
            "comment": "I learned my lessons on the streets! Or the playground. Teeter, totter rules.",
            "score": 1,
            "author": "ImmediateShirt6663"
        },
        {
            "level": 0,
            "comment": "They said no",
            "score": 1,
            "author": "DiirtCobaiin"
        },
        {
            "level": 0,
            "comment": "Inflation is fucking with erryone",
            "score": 1,
            "author": "Revolverkiller"
        },
        {
            "level": 0,
            "comment": "New Tesla update require subscription for wheels smh",
            "score": 1,
            "author": "larzast"
        },
        {
            "level": 0,
            "comment": "Fucking inflation is getting everybody.",
            "score": 1,
            "author": "HighExplosiveLight"
        },
        {
            "level": 0,
            "comment": "Hate to say it. It’s easier with 2",
            "score": 1,
            "author": "Educational-Spread41"
        },
        {
            "level": 0,
            "comment": "Not in this economy",
            "score": 1,
            "author": "jayter24"
        },
        {
            "level": 0,
            "comment": "Why the hell are your rotors brown? Must've been there a long while.",
            "score": 1,
            "author": "illestprodigy"
        },
        {
            "level": 0,
            "comment": "4 blocks? In this economy?!",
            "score": 1,
            "author": "stinger_"
        },
        {
            "level": 0,
            "comment": "They probably were hungry and had to eat the wheels and the other block 😢",
            "score": 1,
            "author": "LadrilloDeMadera"
        },
        {
            "level": 0,
            "comment": "You expect thieves to fucking care? Lol",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Tire less cars! The future is now old man!",
            "score": 1,
            "author": "Argg0"
        },
        {
            "level": 0,
            "comment": "Hey its expensive for concrete blocks thease days they gotta ame money some how",
            "score": 1,
            "author": "TheIndigestibles"
        },
        {
            "level": 0,
            "comment": "Live around sparkling wiggles I see.",
            "score": 1,
            "author": "Sasquatch_actual"
        },
        {
            "level": 0,
            "comment": "This is why audis come with lock bolts.",
            "score": 1,
            "author": "SirHenryy"
        },
        {
            "level": 0,
            "comment": "Four blocks? In this economy?",
            "score": 1,
            "author": "DarkPangolin"
        },
        {
            "level": 0,
            "comment": "Mf you gettin robbed. They’re not here to help you…",
            "score": 1,
            "author": "Yeah_I_Said_lt"
        },
        {
            "level": 0,
            "comment": "They made you a teeter-totter.",
            "score": 1,
            "author": "adamquinncastillo"
        },
        {
            "level": 0,
            "comment": "4 blocks!?! In THIS economy!? Cmon!",
            "score": 1,
            "author": "NicSandsLabshoes"
        },
        {
            "level": 0,
            "comment": "Because inflation.  Blocks are more expensive and harder to steal too",
            "score": 1,
            "author": "jaraxel_arabani"
        },
        {
            "level": 0,
            "comment": "This is probably Florida, because Chicago and California would actually use for cinder blocks to lift your vehicle.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "In this economy?!",
            "score": 1,
            "author": "PeninsulamCattus"
        },
        {
            "level": 0,
            "comment": "When a slump block achieves fulcrum block status",
            "score": 1,
            "author": "Nacho_Beardre"
        },
        {
            "level": 0,
            "comment": "Not in this economy.",
            "score": 1,
            "author": "CervantesX"
        },
        {
            "level": 0,
            "comment": "times are tough for all of us man. we all gotta make sacrifices.",
            "score": 1,
            "author": "vhisic"
        },
        {
            "level": 0,
            "comment": "Inflation is hitting everyone hard man.",
            "score": 1,
            "author": "Mr_Yokai"
        },
        {
            "level": 0,
            "comment": "In this economy, even blocks cost more!",
            "score": 1,
            "author": "crinklecrumpet"
        },
        {
            "level": 0,
            "comment": "Times are tough and blocks are heavy. Even criminals are cutting back on business expenses.",
            "score": 1,
            "author": "Subject-Home-6530"
        },
        {
            "level": 0,
            "comment": "…this complex looks like it could afford locked garages *and* a security detail, you’re overpaying for sure",
            "score": 1,
            "author": "aBlatantAsshole"
        },
        {
            "level": 0,
            "comment": "...they're thieves\n\nwhy would they.",
            "score": 1,
            "author": "ProJoe"
        },
        {
            "level": 0,
            "comment": "Man, when I was a kid, teeter totters were just a 2x6 with handle bars. These kids are spoiled!",
            "score": 1,
            "author": "Medical_Way_907"
        },
        {
            "level": 0,
            "comment": "I didn't realise this is something that actually happened, I just remember seeing cars on cinderblocks in the movies of my childhood, have never seen it happen for real until now... \n\nI mean I guess... You know... Whatever isn't bolted to the ground will get stolen by someone, somewhere.",
            "score": 1,
            "author": "__Just_For_Porn__"
        },
        {
            "level": 0,
            "comment": "They left my then brand new 09 Si on plastic milk crates. Can't you even politely rob someone?",
            "score": 1,
            "author": "ProofRedditB4Posting"
        },
        {
            "level": 0,
            "comment": "Not in this economy",
            "score": 1,
            "author": "cgelz"
        },
        {
            "level": 0,
            "comment": "Gotta get those lug nut locks.\n\nSure they may not stop them but it will slow them down enough.\n\nThis is why I drive with bald tires.",
            "score": 1,
            "author": "flimspringfield"
        },
        {
            "level": 0,
            "comment": "Not with the price of blocks in this economy",
            "score": 1,
            "author": "Wooden_Suit_6679"
        },
        {
            "level": 0,
            "comment": "USA is such a nightmare country to live in. The stress for ordinary citizens must be incredible",
            "score": 1,
            "author": "holyshyeet"
        },
        {
            "level": 0,
            "comment": "How much money do you even get for tires? Seems like a lot of work and risk for little payoff",
            "score": 1,
            "author": "insufficientpuns7734"
        },
        {
            "level": 0,
            "comment": "This looks like the work of gypsies. Next time just put a circle of books around your car and it will be safe.",
            "score": 1,
            "author": "Incellius_Maximus"
        },
        {
            "level": 0,
            "comment": "Inflation affects everyone",
            "score": 1,
            "author": "olympus999"
        },
        {
            "level": 0,
            "comment": "There’s a shortage of building supplies…",
            "score": 1,
            "author": "yy98755"
        },
        {
            "level": 0,
            "comment": "4 blocks, in this economy?!?!",
            "score": 1,
            "author": "GeeISuppose"
        },
        {
            "level": 0,
            "comment": "I worry about this all the time. Do lock nut really work?",
            "score": 1,
            "author": "gwizz006"
        },
        {
            "level": 0,
            "comment": "This is exactly how they did me.",
            "score": 1,
            "author": "CarlFeathers"
        },
        {
            "level": 0,
            "comment": "gotta save money when you're stealing",
            "score": 1,
            "author": "Ckinggaming5"
        },
        {
            "level": 0,
            "comment": "This in Missouri?",
            "score": 1,
            "author": "RedsInABox"
        },
        {
            "level": 0,
            "comment": "Ill use no blocks next time if you keep complaining",
            "score": 1,
            "author": "lickmybrian"
        },
        {
            "level": 0,
            "comment": "Thieves’ lives are like car tires; they’re replaceable if you lose them.",
            "score": 1,
            "author": "MrJackHass"
        },
        {
            "level": 0,
            "comment": "Well let's be honest - those people don't even fucking care in the first place",
            "score": 1,
            "author": "MariaaanieX"
        }
    ]
}