{
    "id": "12jsg1p",
    "score": 18476,
    "title": "British vandals destroy vegetable patch for the needy and sow it with salt",
    "author": "penguinopusredux",
    "date": 1681318737.0,
    "url": "https://www.reddit.com/r/iamatotalpieceofshit/comments/12jsg1p",
    "media_urls": [
        "https://i.redd.it/6pk3cd12ihta1.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\nPlease note that we will ban you if a post or comment breaks any of our rules. **Be especially mindful of the following**:\n\n**Rule 1: Do not post or ask for identifying information, including first and last names and social media usernames.** Public figures are **not** exempt. We remove all external links to prevent accidental posting of identifying information.\n\n**Rule 2: Do not post violent comments, and do not glorify violence, per TOS.** We can't take responsibility for how angry a post makes you, you need to do that. Telling us \"it was a joke bro\" is not an excuse.\n\n**Rule 7: Do not link to or post screenshots of reddit posts, reddit comments, reddit personal messages, reddit profiles, etc.** We cannot allow you to use this subreddit to harass other people on reddit. \n\n**Rule 8: No bigotry, no racism or race baiting.** It is hard to believe that we even need a rule like this. \n\n**Our rules are zero tolerance. You will be banned for breaking them.**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/iamatotalpieceofshit) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "I read the article, and there was so much salt on this land that she could taste it in the air. She stated that everything she had grown had died, and she couldn’t re-plant either because everything just kept dying. But apparently people are giving her tips on how to unsalt as much as possible, and she’s even had a few offers from farmers and such in the area to come and help her through the process.",
            "score": 1131,
            "author": "MithosYggdrasill1992",
            "replies": [
                {
                    "level": 1,
                    "comment": "With the 100 fucking thousand British money she got I bet she can buy enough dirt to fix the problem \n\nGlad I clicked to find out if the scumbags were caught, they weren't but she got ONE HUNDRED FUCKING THOUSAND BRITISH MONEY \n\nJesus christ, hope she buys herself something nice,  poor British lady was so distraught",
                    "score": 622,
                    "author": "DarkandDanker",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "'British money' lol",
                            "score": 529,
                            "author": "Strbrst",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm not using \"dollars\" this week.\n\nIt's now \"20 US money\" or \"1500 Japan money\"\n\nI think I'm still gonna use \"Canadian pesos\" though.",
                                    "score": 264,
                                    "author": "xSARGEx117x",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That seems fair, they do feel like pesos up here.",
                                            "score": 52,
                                            "author": "JayteeFromXbox"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I’m going one stop further and calling it us money instead of U.S. money.",
                                            "score": 35,
                                            "author": "WarlockyGoodness",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "More like “they money” than “us money”",
                                                    "score": 6,
                                                    "author": "Grimaldehyde"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt;£133,936 raised of £4,000 goal\n\nBuy a tractor, scrape off the top layer, put in new dirt!",
                            "score": 52,
                            "author": "Man_Bear_Beaver",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Get a used tractor semi decent tractor, scrape the top layer, put in new dirt and still have 120k left for cocaine",
                                    "score": 14,
                                    "author": "based____af",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You are *grossly* misinformed on how expensive even used tractors are.",
                                            "score": 12,
                                            "author": "strigonian",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Someone has now removed the top six inches of top soil (some “expert”) and the local garden centre has said they’ll donate the equivalent top soil to her.\n\nIt’s awful and I really felt for her. At the same time I like how many have been prepared to donate, advise and replace for her. \n\nNot quite the same but my partner took her car to the local mechanic and asked for them to give it a once over and to change the tyres as she was giving it to a friend who was having a tough time but had got a job after a long long search. When she went to collect they’d put four tyres on and changed the brake pads, windshield wipers etc and charged her £30. Since they reckoned if GF was paying it forward they would too. The next day the guy that’ll drive to your house to clean your car inside and out said he’d seen Mr C (the mechanic) and he’d mentioned about the car - since Mr C was prepared to help out, so was he, provided she could hand over the keys at lunchtime? He waxed it and everything. By the time Friend got that car, it was like half the village had decided to wish him luck in his new job. \n\nTo salt the ground of this woman who’s clearly Good People took one, maybe two wankers. Raising £200,000, taking the mechanry to remove the topsoil and donates more has likely taken a thousand Good People.  The odds are still in our favour.",
                                    "score": 10,
                                    "author": "Unhappy-Professor-88",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;  The odds are still in our favour.\n\nThis so freaking much, it's crazy how much we the people can do when everyone pitches in a few dollars to people who do good, not some mega charity, the people in your community who are making that effort.\n\nIt's very much like unions, everyone sees unions these days as going  on strike for more pay but it's so much more than that, like I understand a small mom and pop shop that has 4 employees not having a union but hard workers working at a place that is making $1M+ year fucking right.\n\nThere's good in this world, we could do better but at least we have the good.",
                                            "score": 3,
                                            "author": "Man_Bear_Beaver"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "they're called pounds, mate",
                            "score": 188,
                            "author": "throughcracker",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Brit Bucks, if you will.",
                                    "score": 29,
                                    "author": "Incognit0ErgoSum",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm sorry, I won't",
                                            "score": 11,
                                            "author": "throughcracker",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Listen it's good she got the British money but I will not hear this British propaganda \n\nPounds are what you use to weigh our severely obese American citizens",
                                    "score": 249,
                                    "author": "DarkandDanker",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I thought that was stones?",
                                            "score": 46,
                                            "author": "Server_Administrator",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "No that's what comes out of our American penises cuss we eat too much red meat! 🥩 💯 😤",
                                                    "score": 133,
                                                    "author": "DarkandDanker",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I love your energy rn",
                                                            "score": 50,
                                                            "author": "xx69chaosmage69xx",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Would you describe it as, dark and dank?",
                                                                    "score": 12,
                                                                    "author": "Humante",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Based on your username are you perhaps a dark and darker enjoyer?",
                                                            "score": 4,
                                                            "author": "Endersbane2004",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "God fucking right I am, made 30 stupid fucking memes for a month for the damn game and it Better come out tomorrow",
                                                                    "score": 3,
                                                                    "author": "DarkandDanker",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "It's from the sodie pops but Im with you",
                                                            "score": 3,
                                                            "author": "Smegmatron3030"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "They couldn't find stones heavy enough anymore.",
                                                    "score": 6,
                                                    "author": "1singleduck"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "\"British money\" bruh you made my night",
                                            "score": 12,
                                            "author": "pm_me_dice_pics"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "This comment actually made me laugh out loud",
                                            "score": 4,
                                            "author": "Raze321"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Let them eat British Vandals. 🍰",
                            "score": 7,
                            "author": "velvetrevolting"
                        },
                        {
                            "level": 2,
                            "comment": "One of the things she needs to buy with that money is security cameras for her next patch.",
                            "score": 8,
                            "author": "Aboxofphotons"
                        },
                        {
                            "level": 2,
                            "comment": "Almost 200k british money now",
                            "score": 3,
                            "author": "bolero629",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 34,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There's a two year wait, or longer, on many allotments. Good luck finding a spare one!",
                            "score": 54,
                            "author": "FriendlyBudgie"
                        },
                        {
                            "level": 2,
                            "comment": "She’s transformed her garden into a growing space. It’s not a council-owned allotment.",
                            "score": 16,
                            "author": "Smooth_Lynx5784",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I'm guessing she doesn't want to just up and move elsewhere so it becomes someone else's problem.\n\nFixing it will certainly cost money.",
                            "score": 20,
                            "author": "Gaz_Of_Naz"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Her Go Fund Me has raised over 70000 UK pounds, goal was 4000. I hope those people who donated have helped restore some of her faith in humanity.\n\nEdit: now at 181K",
            "score": 2626,
            "author": "nms_Rozz",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's encouraging, and a kick in the balls for the scumbags.",
                    "score": 1027,
                    "author": "penguinopusredux",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Instinct tells me  that only Teens would do this.\nBut  to salt the earth? That has shifty neighbor energy",
                            "score": 839,
                            "author": "JamesinaLake",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I agree!  My yard is a garden and some neighbours hate it. They just want a grassy lawn. I could see a couple dosing that if they were brave enough.  The bitterness they’ve got already!",
                                    "score": 425,
                                    "author": "Ginrob",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Anyone salts my yard they're gonna be looking at a giant patch of dirt for the remainder of their time living there.",
                                            "score": 281,
                                            "author": "Downfallenx",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I am an adult and feel a little ashamed I had no idea salting a garden was like kryptonite for plant growth - although it makes sense because I figure it changes the water reaching the plants into literal salt water.\n\nIt makes me wonder why calling someone \"salt of the earth\" is such a nice compliment",
                                                    "score": 168,
                                                    "author": "SonofAMamaJama",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Salt of the earth is very different than \"salting the earth\". In places where salt was harder to come by, e.g. inland areas with only fresh water, salt had to be mined. Salt is crucial and valuable, and was even more valuable even several hundreds of years ago.",
                                                            "score": 184,
                                                            "author": "Mister_Bloodvessel",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "If you ever want to get into a rabbit hole of salt, I recommend researching how native Americans use to create salt away from the ocean. Its incredibly impressive",
                                                                    "score": 87,
                                                                    "author": "redditsold6",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Definitely curious. Can you give me a brief summary?",
                                                                            "score": 17,
                                                                            "author": "Mister_Bloodvessel",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "[deleted]",
                                                                                    "score": 42,
                                                                                    "author": "[deleted]",
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "It's way better to read, and there are many different methods depending on the region. The most interesting, in my opinion, was creating salt ash. They would take large amounts of salt tolerant vegetation,dry the leaves , and burn them to create a salt ash they could eat.",
                                                                                    "score": 19,
                                                                                    "author": "redditsold6",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Monguls used it to prevent resettlement of particularly pesky neighbors",
                                                            "score": 52,
                                                            "author": "InsufficientClone",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Carthage knows a thing or two about it as well.",
                                                                    "score": 44,
                                                                    "author": "SparkJaa",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "`Ceterum (autem) censeo Carthaginem esse delendam.`",
                                                                            "score": 15,
                                                                            "author": "HWGA_Exandria",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Thank God I'm better at google than Latin class.",
                                                                                    "score": 18,
                                                                                    "author": "SparkJaa",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Salt of the earth is a rare resource in ancient times. Its literally just salt, but salt has at times, especially during famine and war, been worth more than gold.",
                                                            "score": 22,
                                                            "author": "Quizzelbuck"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "When that phrase originated, salt was precious and valuable",
                                                            "score": 16,
                                                            "author": "bandalooper"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "The Roman's paid their soldiers in salt. They got a \"salary\". Which they of course needed to live. We kept the term and hand out useless cloth rectangles.",
                                                            "score": 31,
                                                            "author": "ZenPoet",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "When you think about it, that makes the salting of Carthage the ancient equivalent of drowning to enemies in a quintillion dollars just so they can never rebuild \n\nOr in another sense, technically killin them with hyperinflation",
                                                                    "score": 22,
                                                                    "author": "Square-Pipe7679",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Yeah, Carthage is no longer believed to have been salted. The earliest texts that claim as much only go back to 1863, it was just taught as fact for 120 years until scholars bothered to check their sources. There was ancient salting of the earth, but it was ceremonial.  \n\n\nPalestrina was totally salted by order of Pope Boniface VIII in 1299, though.",
                                                                            "score": 21,
                                                                            "author": "Mysterious-Text-2005",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Well shoot, that’s another thing to add to the list of mis-lessons I was taught as a kid",
                                                                                    "score": 7,
                                                                                    "author": "Square-Pipe7679"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Yeah and they resold that salt, the salt functioned as currency. That's why it had similar value as useless cloth bits.",
                                                                    "score": 4,
                                                                    "author": "LukaCola"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "The history of money is interesting. We did used to use Barley initially",
                                                                    "score": 3,
                                                                    "author": "b1tchlasagna"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Is having their own grassy lawn not enough? They demand that yours should also be a grassy lawn?",
                                            "score": 37,
                                            "author": "GenericFatGuy",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Welcome to HOAs!",
                                                    "score": 30,
                                                    "author": "xwhiteknight10x",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 17,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "How weird and stupid some people are. I hope your garden continues to flourish.",
                                                            "score": 7,
                                                            "author": "Vast-Grass-6216"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I’m ruining the neighbourhood",
                                                    "score": 5,
                                                    "author": "Ginrob"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "If they salt your veggie garden, just throw some snail food and wreck theirs.",
                                            "score": 8,
                                            "author": "Lazren32"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I went away for a weekend and my neighbor took all my vegetables. I had them on camera and the joke of it is our houses are over $1M each.",
                                            "score": 6,
                                            "author": "darthjeffrey",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That’s equal parts awful and hilarious. I have had a few things go missing but we usually post signs to help themselves when we are over run by tomatoes or zucchini.",
                                                    "score": 3,
                                                    "author": "Ginrob"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Salting the earth is beyond teenager vandalism, way too much effort.",
                                    "score": 67,
                                    "author": "SasparillaTango",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The kind of people who would do something like this would not be intelligent enough in their teenage years to know that salt ruins fertile soil\n\nwhoever did it, did it intentionally and with reason",
                                            "score": 27,
                                            "author": "IlIIlIl"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Agreed. Shitty teenagers vandalize things because they think it’s fun. Fucking up a bunch of crops could be considered “fun”. Lugging a bunch of salt with you and then spreading it around a patch of dirt would not.",
                                            "score": 12,
                                            "author": "Dewut"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Religious bigot who dislikes that it is helping those not pulling themselves up by their own bootstraps. Living in TN for years I met many of them randomly.... And they would openly tell you about those who don't deserve help, etc...",
                                    "score": 16,
                                    "author": "SpiderHack"
                                },
                                {
                                    "level": 3,
                                    "comment": "Harlow, Essex district grocery store managers in racoon masks",
                                    "score": 11,
                                    "author": "Jaegernaut-"
                                },
                                {
                                    "level": 3,
                                    "comment": "This can be a much deeper thought, but sometimes this can be a collective to sabotage free food. Cancel the free food, some will resort to other means, indirectly increasing chances that some will be forced to buy at stores.",
                                    "score": 12,
                                    "author": "digbenis"
                                },
                                {
                                    "level": 3,
                                    "comment": "It makes me wonder if it was a shitty neighbor with his teen child and a teen/child friend of their child, and he told the teams to mess it up as much as they could, and then he went behind and salted the Earth just for good measure. Because he’s salty and grumpy.\n\n** Please note, I am using he as a general term not assuming that the person or persons who did this were all male. **\n\nEdit/ typos",
                                    "score": 32,
                                    "author": "MithosYggdrasill1992",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;Because he's salty and grumpy.\n\nThere's a time and a place for puns",
                                            "score": 11,
                                            "author": "NightTime2727",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I apologize, you’re right. I didn’t even notice it until you mentioned it, because I am almost always using puns.",
                                                    "score": 5,
                                                    "author": "MithosYggdrasill1992"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Salting the earth is not actively known though is it? I mean I only really know it because I studied some Roman history and understand it from the fall of Carthage.\n\nAlso its hell of a lot of salt they used , I think it was like 5KG.\n\nThat's a lot of effort for teenagers. They would have just ripped up the veggies and pissed on the soil.",
                                    "score": 28,
                                    "author": "galenwolf",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ironically piss would help it",
                                            "score": 15,
                                            "author": "LiftEngineerUK"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "should have known the roman legion would be terrible neighbors",
                                    "score": 5,
                                    "author": "Alarid",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Nah, jealous people and/or cops.",
                                    "score": 3,
                                    "author": "Revolutionary-Ad4588"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt;That's encouraging, and a kick in the balls for the scumbags.\n\nSay no more , and now more people would want to voluntaire with her or others people and organizations",
                            "score": 9,
                            "author": "pbx1123"
                        },
                        {
                            "level": 2,
                            "comment": "Something tells me that chavvy little bastards don't keep up to date with go fund me pages.",
                            "score": 104,
                            "author": "Specialist-Guitar-93",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "chavvy little bastards wouldnt know to salt the earth so the soil is tainted. its more likely some other jealous allotment owner with a plot on the same allotment thats done this.",
                                    "score": 172,
                                    "author": "Asrealasrealcanbe",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Agreed this reeks of bitter neighbor not random vandals.",
                                            "score": 87,
                                            "author": "sunbear2525",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Vandals, yet another tribe the Romans fought. \n\nDon't know if you meant the pun.",
                                                    "score": 9,
                                                    "author": "Specialist-Guitar-93",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Okay, but lets not blame the Goths.",
                                                            "score": 3,
                                                            "author": "Middle-Example6618",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "What do a bunch of morbid kids, wearing black and too much lace, and listening to old Bauhaus records have to do with anything?",
                                                                    "score": 3,
                                                                    "author": "tinteoj"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "It did cross my mind tbh. Doubt many of them are reading about Romes salting of Carthage in the second Carthaginian wars.",
                                            "score": 46,
                                            "author": "Specialist-Guitar-93"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Probably thinks the people she's feeding should either \"get jobs\" or starve but they'd settle for them just not coming around for free produce.",
                                            "score": 21,
                                            "author": "Crom_Committee"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I dunno, I think people here are underestimating that bit of trivia. It's like sugar in an engine - even if you've never done it, you likely know it's a form of absolute destruction.",
                                            "score": 7,
                                            "author": "LukaCola",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I think it's less about whether teenagers know this bit of trivia and more to do with the idea that chavs aren't in it for the long war - they'll trash the garden because they're bored and unimaginative, but salting the earth to stop her growing anything ever again is a bit too far for an opportunistic raid. This has to be someone with motive.",
                                                    "score": 5,
                                                    "author": "ThyRosen",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "A restaurant owner perhaps?",
                                            "score": 13,
                                            "author": "DarthBalls1976",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Naahz this is pensioner levels of hate",
                                                    "score": 29,
                                                    "author": "sizzler",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Love how those who are already set hate it when people who need help receive it.",
                                                            "score": 7,
                                                            "author": "futureGAcandidate"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I doubt it. Now they can just do it again. Takes far less effort to ruin something than to rebuild",
                            "score": 8,
                            "author": "ImmutableInscrutable",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well, maybe she can get some cameras with a little bit of the money raised just in case? Then next time we can see their faces 🤷‍♀️",
                                    "score": 8,
                                    "author": "ResetReefer"
                                },
                                {
                                    "level": 3,
                                    "comment": "Not if she installs very visible security cams everywhere with some of the money raised.\n\nPost all faces captured to Facebook and get a free face recognition.",
                                    "score": 7,
                                    "author": "hospitallers"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Good, they can use the money to install security cameras, and make a live feed",
                    "score": 25,
                    "author": "HalfandHoff"
                },
                {
                    "level": 1,
                    "comment": "Example how something terrible can work out for good. Glad to hear",
                    "score": 18,
                    "author": "BunchesOfCrunches"
                },
                {
                    "level": 1,
                    "comment": "Hopefully enough to rebuild the soil. \n\nTakes a special kind of stupid hatred to salt a garden feeding a community.\n\nSomeone on the TikTok repost thread was griping about how they could see sabotage happening and how they wouldn't like 1,700 homeless folks on their yard.\n\nWhich is... Again, stupid and hateful.",
                    "score": 15,
                    "author": "bunyanthem"
                },
                {
                    "level": 1,
                    "comment": "Wow thats really great. When I first saw the video of her crying i almost started crying myself. Snd when she ended it with (paraphrasing here)\"you havent beaten me, I'll find a way\" i did start.",
                    "score": 5,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is so fucking spiteful. This is why we can’t have nice things",
            "score": 832,
            "author": "Twitch791",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have heard of the metaphor used referencing barbaric ancient conquests, but for someone to do this now is a first.   \n\n\nYoud think they would need to buy a lot of salt to do this though, and people buying several pounds of salt at a store should be easy to track unless it came from a commercial outfit.",
                    "score": 312,
                    "author": "ClappedOutLlama",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Salt used for roads and paths would do the trick",
                            "score": 133,
                            "author": "sunbear2525"
                        },
                        {
                            "level": 2,
                            "comment": "You can buy 50 lb bags of salt from any feed store and no one will think twice about it.  I used to purchase it by the pallet.",
                            "score": 125,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Same here, I live in Oregon and we had to get salt for the roads. It cost like four or five bucks for the bag. It’s not expensive.",
                                    "score": 46,
                                    "author": "MithosYggdrasill1992",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "In a lot of areas in the UK, there are big bins of the stuff on the sides of the road for public use. You can literally grab bucketfuls for free.",
                                            "score": 39,
                                            "author": "TheAngryBad",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Woah! Didn’t know that!",
                                                    "score": 6,
                                                    "author": "MithosYggdrasill1992",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I don’t know about the UK, but here in Pennsylvania you can buy 20-50 lb bags of salt from practically every retail option you could find. Gas stations, feed stores, corner markets, convenience stores, big box stores, hardware stores, farmer’s markets, auto shops, etc. I work in a *beer distributor* of all places and we sell bags of salt in the winter. It’s not a controlled or noticeable substance.",
                            "score": 16,
                            "author": "Hatweed",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Pool supply shops sell 20kg bags of salt",
                            "score": 12,
                            "author": "SpadfaTurds"
                        },
                        {
                            "level": 2,
                            "comment": "You watch too much tv",
                            "score": 17,
                            "author": "ImmutableInscrutable",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Surely anyone who watches that much TV must be easy to track?",
                                    "score": 8,
                                    "author": "fueelin",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Not just for barbaric conquests, but to wipe a place off the map. It ensures that no one can live there by destroying the capacity to grow any food at all.",
                            "score": 7,
                            "author": "JohnTG4",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "And clearly premeditated. You don't just have that much salt lying around.",
                    "score": 110,
                    "author": "penguinopusredux",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You might if you have a well, or otherwise have to treat your own water. Or if you live somewhere that gets a lot of snow but not a lot of snow-removal service. Salt's not that weird of a thing to have in quantity. \n\n\nRegardless, there's almost no way you could categorize something this cruel and spiteful as anything but premeditated. Nobody's just *carrying around* their large supply of salt, when they come upon an allotment garden and decide, on a whim, \"You know what? I'm going to salt this fucking earth!\"",
                            "score": 25,
                            "author": "OvergrownPath",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Idk, man. I used to have British friends and they once asked me if we play “Dig Up the Neighbor’s Yard,” a “game” in which you dig up the neighbor’s yard while they’re on vacation.\n\nSo, this might just be British people’s idea of a prank.",
                            "score": 7,
                            "author": "Ok-Emotion-1131",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "First time I’ve ever heard of that, think they might have been pulling your pisser, unless of course you’re doing the pisser pulling? (We also don’t call them ‘yards’)",
                                    "score": 9,
                                    "author": "Round_Explanation_63",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Its reverse psychology really, theyve now made a tons of money to do good. \n\n\nBrb, im going to \"raise some money\" for the local charity",
                    "score": 4,
                    "author": "Ghost_of_Laika"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is one of the single most revolting things I've ever had the displeasure to witness.",
            "score": 425,
            "author": "Tutes013",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 80,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I thought fistpleasure was something completely different.",
                            "score": 46,
                            "author": "dickbob124",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "According to a Tool song it is.",
                                    "score": 16,
                                    "author": "DarthBalls1976",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Easily one of the best Tool songs too, Stinkfist goes harder than any song has the right to",
                                            "score": 5,
                                            "author": "martydidnothingwrong"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "My definition of yours? Being Tool it could be either... Or both.",
                                            "score": 6,
                                            "author": "dickbob124"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What's wrong with people? Why? I hear things like this and I'm just completely dumbfounded. I don't want to understand.",
            "score": 234,
            "author": "noneya-818",
            "replies": [
                {
                    "level": 1,
                    "comment": "never underestimate the pettiness of some people. they probably werent even thinking in the grand scope of things on how this would look to other people and its probably spurned by jealousy.",
                    "score": 88,
                    "author": "Asrealasrealcanbe"
                },
                {
                    "level": 1,
                    "comment": "People HATE the poor",
                    "score": 15,
                    "author": "IPressB",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Everyone is saying it's probably teenagers but this sounds like the work of a miserable old person to me. \n\nThey're usually the ones moaning about new housing going up in a field near them, wouldn't be surprised if they live nearby and can see her garden from their window and just don't like looking at it.",
                    "score": 12,
                    "author": "YouMadeMeDoItReddit_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Completely agree. Teenagers will go and kick all the plants and pull up anything growing, but they're not going to go to the effort of salting the earth. \n\nThis has massive spiteful neighbour energy.",
                            "score": 6,
                            "author": "LostTheGameOfThrones"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Weird…I wonder what their motive was.  I can see someone ripping out all the crops, but to salt the ground, as well?  Someone must have really hated her or really hated what she was trying to accomplish.",
            "score": 250,
            "author": "VioletteFMR",
            "replies": [
                {
                    "level": 1,
                    "comment": "Silly question from me. I have no skill with growing anything.\n\nBut can anything be done to reverse the salting process? Laying fresh soil? Or will it take some time for things to rejuvinate?",
                    "score": 24,
                    "author": "TheTempleChef",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "To add onto sun bears comment, they have to dig deeper than the salt lakes down into, because if it rain at all that salt soaks deeper in. If there’s any salt left in the immediate dirt it can cause issues with crops, either not growing at all, or dying quickly after sprouting.",
                            "score": 28,
                            "author": "MithosYggdrasill1992",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "You have to dig out the old soil and replace it with fresh.",
                            "score": 35,
                            "author": "sunbear2525",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Better get on it, then.",
                                    "score": 3,
                                    "author": "wafflesareforever"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I read some some gardeners talking about this and suggesting using gypsum can detoxify the soil.\n\nI don't know how much that would cost. It might be easier to just dig up the soil and lay new top-soil.",
                            "score": 7,
                            "author": "galenwolf"
                        },
                        {
                            "level": 2,
                            "comment": "You can “rinse” the earth but it takes a prohibitive amount of water, it’s like 6” of water cover to lower the salinity 40% or so.\n\nEdit: assuming sandy loam and no plowpan of course.",
                            "score": 4,
                            "author": "SuspiciouslyLime"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They probably hate poor people",
                    "score": 235,
                    "author": "potato_skin4206996",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 101,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "never underestimate the ability of the poor working class to hate others of the poor working class",
                                    "score": 69,
                                    "author": "The_Almighty_Demoham",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Crabs in a barrel. It's why I don't live by the sea",
                                            "score": 17,
                                            "author": "[deleted]"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Affluent..? in Harlow? You havin' a laugh? It's a dump.",
                                    "score": 32,
                                    "author": "Doranael",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Sad but some people really think \"*Poor people smell, they make the place look untidy, they do crime, if people would just let them starve/freeze the problem would be over*\" \n\n-entitled a-holes who had life handed to them.",
                            "score": 5,
                            "author": "lemons_of_doubt",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Local council, because she's making them look bad",
                    "score": 6,
                    "author": "Zzzaltwitch",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Growing crops to feed hundreds... That's gotta be a lotta crops and a lot of space. How much money when into putting enough salt on he land to make it unusable. It sounds like sabotage form someone with possible money to just toss around.",
                    "score": 11,
                    "author": "eve-nlie0LE15",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "She’s removing the incentive of poor people to work hard! /s",
                    "score": 12,
                    "author": "Akasto_"
                },
                {
                    "level": 1,
                    "comment": "The kind of person who isn't going to let anyone out shine their flowers they planted.",
                    "score": 14,
                    "author": "thatlastrock"
                },
                {
                    "level": 1,
                    "comment": "Sometimes people are legitimately just evil and that's all the motivation they need. Whoever did this did it because they're pond scum, that's it.",
                    "score": 8,
                    "author": "mightyneonfraa"
                },
                {
                    "level": 1,
                    "comment": "I would put money on Brexiters who saw the allotment as feeding the minorities they want out of the country",
                    "score": 54,
                    "author": "dolfan4life2",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Either that or someone who makes a tidy profit from selling stuff from their own allotment.",
                            "score": 16,
                            "author": "Morganelefay",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Lol I highly doubt that",
                                    "score": 10,
                                    "author": "ImmutableInscrutable"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Carthago delenda est",
            "score": 25,
            "author": "tysonstone"
        },
        {
            "level": 0,
            "comment": "My dad has MS and had his benefits cut because he managed to answer the front door himself. I hope no one at the benefits office reads this article and decides that if she can grow vegetables she can work. \n\nAlso, MS can be incredibly debilitating. The fact that this lady is doing something to help her community when she is likely fatigued and in pain most of the time makes her a hero.",
            "score": 69,
            "author": "vicki5150",
            "replies": [
                {
                    "level": 1,
                    "comment": "MS and lupus together. Having both complicates the already difficult treatment for both diseases. I live with some difficult autoimmune diseases and can’t begin to imagine how difficult having MS and lupus together could be.",
                    "score": 10,
                    "author": "Jubguy3"
                },
                {
                    "level": 1,
                    "comment": "If he’d have not answered they’d have called him lazy instead. Fucking state of this country",
                    "score": 23,
                    "author": "LiftEngineerUK"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Some people just want to watch the world starve.",
            "score": 104,
            "author": "muffledvoice"
        },
        {
            "level": 0,
            "comment": "Probably has a neighbor who hates people on any kind of welfare. Glad people are helping her, hopefully she actually gets that money. Been a lot of gofundme scammers when stories get big",
            "score": 19,
            "author": "Why_Is_Toby_In_Jail",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, the attitude towards people on benefits here is disgusting. People like my parents believe lots of people on benefits are gaming the system, but if you look online, the number of fraudulent claims are a very small minority.",
                    "score": 13,
                    "author": "Inkyyy98",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "People that attitude make me sad. I would rather have a few leeches and a lot of people who need it get help than nothing for anyone.",
                            "score": 3,
                            "author": "Why_Is_Toby_In_Jail",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Saw her post on TikTok\nWas super sad",
            "score": 17,
            "author": "ucario",
            "replies": [
                {
                    "level": 1,
                    "comment": "Now I am going to go find it, thank you for letting me know that there is one! I’m sure it won’t be too hard to find on Google ❤️\n\nI’m gonna go find it and share it, I have some friends over across the pond in the UK, and maybe they don’t know already",
                    "score": 6,
                    "author": "MithosYggdrasill1992",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "That’s just unnecessarily evil. I don’t understand why people are urged to be needlessly cruel.",
            "score": 17,
            "author": "LookyLooLeo"
        },
        {
            "level": 0,
            "comment": "You really have to have a lot of hate in your heart to commit an act like this. There's no gain in it other than kicking others who are already down.",
            "score": 14,
            "author": "Jerry__Boner"
        },
        {
            "level": 0,
            "comment": "This is a 30 second walk from me. I've been watching the work going into the allotment and the amount of produce that is offered up FOR FREE to anyone. This is clearly the work of someone who's bitter and jealous and for some reason thinks it's wrong.",
            "score": 13,
            "author": "KingQuagaar"
        },
        {
            "level": 0,
            "comment": "Is there a grocery store nearby with significantly diminished produce sales? Some pissed off food market or a commercial farmer?\n\n\nWouldn't surprise me if that was the case.",
            "score": 111,
            "author": "XeLLoTAth777",
            "replies": [
                {
                    "level": 1,
                    "comment": "My guess is some people mad at her for \"feeding the animals\". I knew someone who thought like that.",
                    "score": 34,
                    "author": "Yabebiri"
                },
                {
                    "level": 1,
                    "comment": "That was my first thought too.",
                    "score": 17,
                    "author": "fenderguitar83",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I think this is the most plausible answer.",
                    "score": 8,
                    "author": "YeetusTheMediocre",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You think the most plausible answer is a supermarket owner came to salt the crops of a woman in an allotment because she gave out free vegetables?",
                            "score": 16,
                            "author": "Anglan",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "When I read the article I thought about the quantity of salt needed to do this.  This wasn’t teenagers with a tub of saxa.  There’s been more than a few crimes committed under the cloak of vandalism.  Probably not a supermarket, but I wonder if there’s a property developer looking for convenient plots of land.",
                                    "score": 4,
                                    "author": "shiveringcactusAE"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Someone didn't like looking at it or her intent. Time to take the money, dig out the sowed either, and build that garden twice as big!",
            "score": 13,
            "author": "Odd-Discipline-4306"
        },
        {
            "level": 0,
            "comment": "She needs to put security cameras on the allotment",
            "score": 11,
            "author": "kazza64",
            "replies": [
                {
                    "level": 1,
                    "comment": "Agreed, although that's probably the first thing the scumbags would go after.",
                    "score": 10,
                    "author": "penguinopusredux",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "That goes far beyond simple vandalism IMO.",
            "score": 9,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "That salting the earth part makes me think its personal.",
            "score": 65,
            "author": "Tijai"
        },
        {
            "level": 0,
            "comment": "They were not the salt of the earth",
            "score": 19,
            "author": "DRAGONSLAYAAAA",
            "replies": [
                {
                    "level": 1,
                    "comment": "Take my poor man’s gold\n\n🏅",
                    "score": 5,
                    "author": "MithosYggdrasill1992"
                }
            ]
        },
        {
            "level": 0,
            "comment": "god humans suck.... gene pool real shallow and needs to be drained",
            "score": 24,
            "author": "Weak-Cancel1230"
        },
        {
            "level": 0,
            "comment": "Theres no way this is just random",
            "score": 5,
            "author": "brunettewondie"
        },
        {
            "level": 0,
            "comment": "I feel like this was either someone close by who hates her or some kind of company who didnt like what she was doing.",
            "score": 5,
            "author": "Wdrussell1"
        },
        {
            "level": 0,
            "comment": "Hmmm most mindless vandals probably would think of salting the ground. There must be more to this. I wonder would warrant such an act of cuntary",
            "score": 5,
            "author": "Dithering_fights"
        },
        {
            "level": 0,
            "comment": "I guess it is safe to say they are not the salt of the earth.",
            "score": 3,
            "author": "Gus_Harrington"
        },
        {
            "level": 0,
            "comment": "I understand if you don't want to help the needy and respect that because it is your choice but to ruin somebody else's efforts to help is just plain evil.",
            "score": 6,
            "author": "Gus_Harrington"
        },
        {
            "level": 0,
            "comment": "Thank god the Mirror specified that these were *cruel* vandals, because otherwise I thought they sounded like lovely chaps",
            "score": 4,
            "author": "Seraphaestus"
        },
        {
            "level": 0,
            "comment": "I believe that is what the Romans did to Carthage, not what the Vandals did to Rome.",
            "score": 4,
            "author": "cruiserflyer"
        },
        {
            "level": 0,
            "comment": "Bet my arsehole it was some teens and tweens who did it. Thinking it made them look cool or something. \"Living that thug life\" or something similar, throwing up gang signs that they barely understand. Proper little Ali G looking piss-packets",
            "score": 3,
            "author": "SoupmanBob",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Ah, Harlow. Say no more.",
            "score": 4,
            "author": "ThatOldClapTrap"
        },
        {
            "level": 0,
            "comment": "This should be a crime. Charge them the amount of her produce x whatever year she dies, or can no longer garden.",
            "score": 22,
            "author": "ZereneTrulee",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well, it is a crime. But not one that is easily solvable.",
                    "score": 21,
                    "author": "Fluggernuffin"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Salting the earth doesn’t work very well to kill plants, unless you use a LOT of salt. Even then, you would have to keep coming back and putting more down. Soil salinization is a thing, but it’s usually not the result of dumping a large amount of salt down once. Salting the earth is more of a symbolic thing.",
            "score": 19,
            "author": "linuxgeekmama",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s more to prevent things growing again. Dumping salt on the surface isn’t going to affect the root system unless dug and watered in. Trying to grow something newly planted in salted soil is going to burn/destroy the roots and ultimately kill the plant",
                    "score": 13,
                    "author": "SpadfaTurds",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you do it right away after the salt is put there, yes. But the UK has a pretty rainy climate, so the salt won’t stick around forever.",
                            "score": 5,
                            "author": "linuxgeekmama"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah it really isn’t going to do much damage if they’ve sprinkled it once and left. I’ve been using salt to try and kill a patch of weeds coming through gravel and after 18 months the buggers are still peeking through.",
                    "score": 12,
                    "author": "Gmd88"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ok, I need to write this down: “Salt of the earth: good”; “salting the earth: bad”.",
            "score": 3,
            "author": "greymalken"
        },
        {
            "level": 0,
            "comment": "Title was read with normal words until they decided to CAPITALIZE one for no apparent reason.",
            "score": 3,
            "author": "CaptainPickcard"
        },
        {
            "level": 0,
            "comment": "There are some crimes worthy of being sterilized",
            "score": 23,
            "author": "A_Rabid_Orange",
            "replies": [
                {
                    "level": 1,
                    "comment": "An eye for an eye, fertility for fertility.",
                    "score": 9,
                    "author": "mai_tai87"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 7,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I can promise you, that the people who did it, are probably those Jackasses that are Anti homeless and talk about how Free handouts are bad for people, it sounds like those type of Jackasses.",
            "score": 7,
            "author": "pervylegendz"
        },
        {
            "level": 0,
            "comment": "That seems less teenage assholery and more absolutely pos neighbors concerned about traffic or property values. Kids aren't going to salt the earth.",
            "score": 5,
            "author": "Anastrace",
            "replies": [
                {
                    "level": 1,
                    "comment": "At first the randomness feels like a kid because they’re impulsive. But I agree with you. A kid is more likely to smash. Like smashing the gourds and chucking them about with their friends. Salting feels more personal. There’s planning. Intent. There’s effort. Caution. Waiting. Patience. Salting itself is acquired knowledge. \n\nI would put my bets on a quiet man, maybe older than middle age. I could see a woman too, however. Also older. Someone who keeps to themselves. Someone who window watches. I would bet they’re near by. They might interact with the owner. Someone who does this enjoys that sort of kick out of running a layered deception. \n\nWhat a miserable human.",
                    "score": 5,
                    "author": "rebelliousbug"
                }
            ]
        }
    ]
}