{
    "id": "133v6u2",
    "score": 38357,
    "title": "Federal officials are offering up to $20,000 for information regarding an incident on April 3 where a boater appeared to charge sea lions swimming in the Columbia River near Hayden Island Portland, Oregon.",
    "author": "dannybluey",
    "date": 1682869303.0,
    "url": "https://www.reddit.com/r/iamatotalpieceofshit/comments/133v6u2",
    "media_urls": [
        "https://v.redd.it/r0grl73g23xa1"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Same kind of guy who floors it when he sees a racoon walking across the road",
            "score": 5158,
            "author": "ericmeme2020",
            "replies": [
                {
                    "level": 1,
                    "comment": "Took a ride with a guy who had this kind of mentality once, he floored when he saw a dog, I asked what's up with that, he said \"so the dog doesn't have time to think about crossing the street\" and laughed. He also didn't respect pedestrians and cyclists. It is as if going slower or stopping for people in smaller vehicles/ on foot or for animals was somehow humiliating for him, as if being a decent human being was hurtful to his ego*.",
                    "score": 1315,
                    "author": "LoreChano",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It catches up to them when they hit something doing 80mph. I hit a coyote in my Volkswagen gti (not on purpose) cost like $1500 in parts alone.",
                            "score": 221,
                            "author": "happisock",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Nowadays, yeah.\n\nHad a teacher in highschool who told a story about he and his brother playing a game called \"roadkill\" where different things were worth different points in a 80's Cutlass, which was like cast iron.  They stopped after they ran over what they thought was a deer in the road ahead, and ended up being a dead lot lizard from a nearby truck stop they decapitated.\n\nHe was a POS too, ended up leaving his wife and 2 kids to date an underage student.",
                                    "score": 203,
                                    "author": "CARLEtheCamry",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "jesus christ dude",
                                            "score": 87,
                                            "author": "thirstyross",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "For the uninitiated... Lot lizard is slang for truck stop whore.",
                                            "score": 132,
                                            "author": "veryloudmonstercat",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Thanks. Was about to Google that on a work laptop…",
                                                    "score": 46,
                                                    "author": "thedutchrep"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Lets be better and say shes a truck stop sex worker.",
                                                    "score": 19,
                                                    "author": "Halvus_I",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I agree, don't dehumanize sex workers.",
                                                            "score": 8,
                                                            "author": "veryloudmonstercat"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Thank you. (England here, we don’t have any lizards whatsoever) ✌🏻💙🇬🇧",
                                                    "score": 9,
                                                    "author": "DameGinger",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Ummmm, yes we do. Like 12+ wild species.",
                                                            "score": 5,
                                                            "author": "RooDoubleYou",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Yup, because we needed to dehumanize some people just a little bit more.",
                                                    "score": 23,
                                                    "author": "zepplin2225",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "We used to play that game and made up points for almost everything. Birds in flight were 100 points. Grandparents with a walker were 1 point. Thats just for an idea on how we \"scored points\". But we never actually played the game for real. It was more a verbal thing when we saw someone crossing the street we would yell out \"10 points!\" But never actaully even try to hit them.",
                                            "score": 8,
                                            "author": "Late-Ad-4624"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "It's more expensive, but if you can afford it and you live in an area teeming with wildlife, comprehensive vehicle insurance is worth it. My wife and I have unfortunately hit 4 deer in a span of 6 years and it's not a dime out of pocket to get the car fixed. And as an \"act of god\" your rates are not affected.",
                                    "score": 34,
                                    "author": "MechEJD",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That's a good point. I got an earful from family about just having the basic insurance. I got fed up with it and sold it to someone for like $300 a year later. Got a corolla (the dealership wouldn't even buy the VW. Guy, who bought the car, though, had hit a deer and totaled his pickup.  So I got to help someone out. Dudes still driving that car.",
                                            "score": 7,
                                            "author": "happisock"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Nah, they got a buddy who does body work and they'll just trade half the raccoon meat for the job.",
                                    "score": 3,
                                    "author": "Functionally_Drunk",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 282,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Tell that one of these days people are going to do something, and the day is getting closer each day.",
                                    "score": 61,
                                    "author": "twoscoop",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 65,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Carrying a rock isnt illegal... but what you do with it...",
                                                    "score": 27,
                                                    "author": "twoscoop"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "They’ll turn into a victim too the moment anyone checks them…\n\nCowards, always.",
                                                    "score": 30,
                                                    "author": "yoyoma125"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I read a story years ago about a guy like that, he was well known for taking out some of the local dog population. Well one day he went after a dog like usual, but when he ran it over the dog’s rib popped his tire and I believe he ended up dying from the crash.",
                            "score": 56,
                            "author": "noclownpornforyou",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "My father in law is like this. Now he is seemingly trying to kill himself in his older age with unhealthy habits.",
                            "score": 20,
                            "author": "Diarrhea_Sprinkler",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Offer him more…",
                                    "score": 10,
                                    "author": "BullyBumble"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Sounds like a complete psycho",
                            "score": 50,
                            "author": "Etchbath",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "That’s a psychopath right there. You are probably lucky to be alive.",
                            "score": 47,
                            "author": "yukumizu",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not just a psychopath, something like 1 in 10 people have a significant degree of psychopathy and they would never do something like this - this is pure malevolance.",
                                    "score": 43,
                                    "author": "SquidwardWoodward",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "They just want an excuse to kill something",
                            "score": 14,
                            "author": "Karsvolcanospace"
                        },
                        {
                            "level": 2,
                            "comment": "I'm glad you didn't refer to him as your \"friend\". I would have dropped him like a bad habit.",
                            "score": 13,
                            "author": "CaptPolybius"
                        },
                        {
                            "level": 2,
                            "comment": "I had a dog that got hit by a car as a kid.  The thoughts of somebody doing it on purpose wracked my brain.",
                            "score": 7,
                            "author": "Highlander198116"
                        },
                        {
                            "level": 2,
                            "comment": "I bet this guys in your story also complains about high gas prices.",
                            "score": 5,
                            "author": "bigtinygiant"
                        },
                        {
                            "level": 2,
                            "comment": "That guy is messed up. Sadly tho, at least where I live in Ontario, if you cause an accident or damage your vehicle by trying to avoid an animal your insurance does not cover you unless you hit the animal. That’s not to say you have to accelerate into the animal but it makes it difficult to safely avoid them. I always do my best, especially if I’m driving alone to allow animals to cross the street but unfortunately In busy traffic you don’t have that freedom to slow down/stop. Thankfully I’ve never hit an animal but I’ve seen many people like the one you mentioned who feel the need to accelerate into animals. \n\nOne of my biggest pet peeve’s with driving is watching people use the bike lane to avoid traffic when trying to turn right. Ive seen a handful of cyclists get hit because of this",
                            "score": 11,
                            "author": "larson_5"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "When I was 15 I was walking somewhere and saw a car swerve to hit a possum. This is USA in the 90s, everyone inexplicably hated them. I yelled at them and ran to see if I could help the very flat opossum, while they went up a block and had to stop at a red light. An OLD - guys, ancient. You would not have expected this - lady carrying shopping bags set them carefully on the ground, rummaged in one, and pulled out a glass bottle filled with red(sauce?) and threw it at their windshield as they pulled into the intersection. Red liquid exploded over the car, the kids in it got out and started yelling at the lady. She picked up her bags and kept walking. I went and walked behind her for half a block. Not thinking I was protecting her or anything, more wanting to just be on her side. The kids didn't follow, got back in the car, drove away. I never got closer to her than half a block and to this day wish I'd talked to her. She was so absurdly casual about it. I didn't see the windshield but I hope dearly that it was cracked. Possum did not make it, but I have forever since been adamant about being nice to them lest an ancient woman of will cross your path.",
                    "score": 74,
                    "author": "wesbug",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s awful but I did audibly laugh at your description of the “very flat opossum”.",
                            "score": 6,
                            "author": "ChawulsBawkley"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Bruh, same kind of guy who floors it when he sees a cyclist approaching an intersection.\n\nHappened to me 1 month ago, he even looked at me like a mad man haha.\n\nFragile insecure losers.",
                    "score": 830,
                    "author": "Inevermuck",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Also attempted murderers.",
                            "score": 258,
                            "author": "orange4boy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm actually more likely to incur this on my longboard then on my bike.\n\nOn my bike I'm a commuter but on a skateboard I'm a punk apparently.",
                                    "score": 106,
                                    "author": "Imkindaalrightiguess",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "How dare you enjoy the public pavement.",
                                            "score": 55,
                                            "author": "r0b0c0d",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I was on the highway in a merging lane with my blinker on yesterday and it looked like this truck was leaving a space open for me so I started to merge and as I merged he sped up. Then he goes into the exit lane on the right of me and gets in front of me cutting me off and almost hitting my car and almost running me into the left lane and construction barriers there. I get over to the left to get out from behind him so he doesn't try to break check me and he then rolls down his window and stays at my pace to try to confront me.\n\nYou know I'm in a merging lane, my blinker has BEEN on and you leave space for me to merge in my tiny car while you're in a truck wtf did you think I was going to do??? I honestly assume dude was on his phone not paying attention accidentally left a gap and hit the gas as I merged thinking I cut him off. \n\nLike wtf is wrong with some people. I had JUST dropped my 5 yo off at his dad's too. I'm just glad he wasnt in the car. \n\nSome drivers are way too easily triggered to be driving",
                            "score": 99,
                            "author": "JustAPlesantPeach",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I can already imagine these \"accidents\" causing death and bodily harm as we speak. You just got lucky.",
                                    "score": 13,
                                    "author": "Interesting-Dog-1224"
                                },
                                {
                                    "level": 3,
                                    "comment": "Time to get a dashcam.",
                                    "score": 10,
                                    "author": "darkmex25"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt; Fragile insecure losers.\n\nSpeaking of... the mods shadow removed my prior reply because I mentioned that constant attacks on my life (cars attempting to hit bikes/peds is classed as assault with a deadly weapon and attempted homocide in my area) by such losers are why I exercise a certain constitutionally guaranteed right in accordance with all state and federal laws whilst bicycling.",
                            "score": 15,
                            "author": "fazedncrazed"
                        },
                        {
                            "level": 2,
                            "comment": "And the rolls coal. Total shrimp d energy.",
                            "score": 16,
                            "author": "beer_bukkake",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Total whistle dick.",
                                    "score": 9,
                                    "author": "46thAndTABBY"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "My theory is that people who get mad at bicycles and go as far as swerving or rolling coal at them, are basically dogs that cannot understand what a bicycle is and respond with aggression.",
                            "score": 76,
                            "author": "VIcanada250",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "To them it’s a symbol of the left. Only bisexual wine-drinking communists who believe the climate change hoax ride bicycles.",
                                    "score": 74,
                                    "author": "OkayRuin",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You are correct.",
                                            "score": 21,
                                            "author": "spudzilla"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I am so bike-curious",
                                            "score": 7,
                                            "author": "canned_soup"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'd be worried about his guns and views on noisy neighbours.",
                    "score": 34,
                    "author": "Sovrin1",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Same guy who rides your ass on the highway with his brights on even though the lane is clear to go around.",
                    "score": 4,
                    "author": "Ketsueki_Junk"
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 19,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Your dad is a fucking loser, dude.",
                            "score": 28,
                            "author": "whysoYahooSerious",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I have some nihilistic views but that guys dad is the type of person that will probably benefit society when they die.  Granted we are all responsible for many animal deaths, even vegans, but the world could do with less people and some don't really deserve the precious gift of life as a modern human.",
                                    "score": 9,
                                    "author": "speedledee"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 14,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I'd have put my dad in his fucking place if he was like that.",
                            "score": 18,
                            "author": "Taizunz"
                        },
                        {
                            "level": 2,
                            "comment": "I hate your dad.",
                            "score": 13,
                            "author": "BilboBagginkins"
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 7,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I once started a new job landscaping. one morning driving to the house saw a momma duck and her babies crossing and he floored trying to see how many little ones he could hit. Everybody in the truck stopped fucking with him after haha.",
                    "score": 56,
                    "author": "LostandWandering-",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Zero bull shot Id have harmed him. If he wants to go to the police that’s great, he’d be famous for why he was attacked",
                            "score": 58,
                            "author": "Robinhood-is-a-scam",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah I’m not gonna lie I probably would’ve if he would’ve actually hit them.",
                                    "score": 23,
                                    "author": "LostandWandering-"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yeah as a journeyman crew lead, that would have me making you to drive to the most remote location I can think of, make you unload the truck by yourself, then leave your ass on the side of the gravel road 2 hours from civilization.",
                            "score": 32,
                            "author": "AwkwardChuckle"
                        },
                        {
                            "level": 2,
                            "comment": "I don't get why anyone would do that. Did he end up hitting the ducks?",
                            "score": 20,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah some people are honestly just sick. Fortunately he didn’t, but I stopped working with him after that, he seemed pretty normal but that was a huge red flag.",
                                    "score": 43,
                                    "author": "LostandWandering-",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "What the hell, I'm not exactly one to slam on the brakes or swerve if I see a critter for safety reasons but speeding up or even aiming for them is psychotic.",
                            "score": 3,
                            "author": "xDarkCrisis666x"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I almost crash while dodging a bird on the road",
                    "score": 14,
                    "author": "tRfalcore"
                },
                {
                    "level": 1,
                    "comment": "\"See that family of ducks crossing the road? Haha, watch this, it's gonna be hilarious!!\"",
                    "score": 7,
                    "author": "Different-Estate747"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Did they find the culprit?",
            "score": 1562,
            "author": "Lonely_Funny9987",
            "replies": [
                {
                    "level": 1,
                    "comment": "The boat is a Hewescraft 180 or 200 about 2016 vintage.  Shouldn't be too hard to find in the area.",
                    "score": 230,
                    "author": "TechnoBuns",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Serious q: are boats not registered in the US?\n\nWould have expected a number on the side or some other identifying mark\n\nI used to sail yachts here in the UK and every boat has a clearly readable ‘sail number’ on the sail, for smaller boats there’s a number on the hull I believe",
                            "score": 74,
                            "author": "yungheezy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There should be a number on the front of the hull, I think the problem here is it's not really readable at this distance. You can kind of see that it does have a number it's just not legible at this distance/zoom/potato camera.",
                                    "score": 25,
                                    "author": "MEatRHIT",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I am working under a (possibly naive) assumption that Reddit has destroyed the original image quality",
                                            "score": 5,
                                            "author": "yungheezy"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 60,
                                    "author": "[deleted]",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "They are. And cameras at launches are pretty common. Idk how no one’s seen the registration numbers or can’t freeze frame and zoom.",
                                    "score": 15,
                                    "author": "HalcyonEnder",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "They are. There is a number toward the bow just below the rub rail. Pretty hard to see with the lighting. Someone with some great *COMPUTER SKILLS* and equipment may be able to **ENHANCE** it and clean it up to see it though.\n\nWith approximately 2:09 left on the video you can see it on the top edge of the dark blue stripe on the front 1/3 of the boat.\n\nEdit: Noted.",
                                    "score": 6,
                                    "author": "81dank",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "From an article:\n\n&gt; The boat is described as a 19 to 20-foot aluminum Hewescraft Pro-V Sea Runner with a dark blue stripe. The boat has a soft top with an aluminum Barewest Fish &amp; Wake Tower and is powered by a Yamaha outboard motor.",
                            "score": 149,
                            "author": "46thAndTABBY"
                        },
                        {
                            "level": 2,
                            "comment": "Let me me know when we catch him so I can type “We did it Reddit!”",
                            "score": 9,
                            "author": "Mono_831"
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 75,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Wait...Reddit not jumping the gun to pin some crime on a random that did nothing wrong? I don't even recognize this place anymore...",
                                    "score": 38,
                                    "author": "46thAndTABBY",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "My bad, went ahead and swatted them, almost made an oopsie there.",
                                            "score": 23,
                                            "author": "flyingwolf",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "My faith in Reddit has been restored.",
                                                    "score": 15,
                                                    "author": "46thAndTABBY",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "\"I'm doing my part!\"\n\nTHE MORE YOU KNOW 彡☆",
                                                            "score": 12,
                                                            "author": "flyingwolf"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "THAT GUY IN THE BOAT IS THE BOSTON BOMBER!!!",
                                            "score": 8,
                                            "author": "PoutineMeInCoach",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "$20k coming your way!",
                                    "score": 23,
                                    "author": "ramses0",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Send it to NOAH",
                                    "score": 4,
                                    "author": "SquatchiNomad"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's a matter of time unless he never boats again.",
                    "score": 913,
                    "author": "Inevermuck",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Some 4 chan thread will expose his whole family’s information probably",
                            "score": 751,
                            "author": "Major_Blackbird",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's been like a month.",
                                    "score": 82,
                                    "author": "suitology",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "This is the first I’ve heard of it. Has it been posted there yet?",
                                            "score": 75,
                                            "author": "ghosttrainhobo",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "They found the location of a flag by studying planes flying past, they'll find this guy.",
                                            "score": 13,
                                            "author": "1singleduck",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "They found the location of that flag inside a basement as well. Nuts.",
                                                    "score": 6,
                                                    "author": "FlyingDragoon",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "hahah hopefully.",
                                    "score": 88,
                                    "author": "Inevermuck"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Not yet, no. It's been in the local news.",
                    "score": 32,
                    "author": "A_Drusas"
                },
                {
                    "level": 1,
                    "comment": "They just announced the reward yesterday. He'll be caught. He likely did this to protect his fishing since it's pretty rare that sea lions go this far up the Columbia. This is about 60 River miles from the ocean.",
                    "score": 47,
                    "author": "Suck_Me_Dry666",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "\"protect his fishing\" \n\nMy God, some people do not deserve to be alive.",
                            "score": 60,
                            "author": "FWIWGFYS",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Before the marine mammal protection act, I’ve heard it was fairly common for fishermen to shoot seals.",
                                    "score": 9,
                                    "author": "determania",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "May his boat get stolen and vandalized by crackheads, and may every animal he meets bites his fucking pathetic face off.",
            "score": 163,
            "author": "Lexadour",
            "replies": [
                {
                    "level": 1,
                    "comment": "May his boat hit a rock and may his body never be recovered 🙏😿",
                    "score": 5,
                    "author": "titty-titty_bangbang"
                }
            ]
        },
        {
            "level": 0,
            "comment": "i lived in a place with sea lions and surfing, and sea lions are just total sea puppies. when you're surfing they'll swim upto you and check you out then just swim off. 10+ years i've been in the area and i've never seen or heard anyone gettiing harmed by a sea lion.\n\nthat dude would be chased off where i lived",
            "score": 1783,
            "author": "iminsert",
            "replies": [
                {
                    "level": 1,
                    "comment": "I swam up within 50 ft of them and they just kind of stare at you.  They can be dangerous if you threaten them but if you don't threaten them they don't easily feel threatened.",
                    "score": 399,
                    "author": "didntstopgotitgotit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I came within 5 feet of a bunch while kayaking in Howe sound, didn't notice them sunning themselves as I came around the side of Pam Rock. \n\nThey flipped my kayak jumping into the water and I was sure they'd attack me but nope, after the scramble into the water they calmed down and just swam around me while I bailed my kayak, they bumped me a few times but they weren't aggressive at all.",
                            "score": 219,
                            "author": "zexando",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "they're really curious animals! with the aforementioned surfing bit, it's not uncommon for surfers to be bumped or scared by sea lions, but never \"attacked\", it's at most someone is paddle boarding and \\*bonk\\* to the board.   \n\n\ni've done surf photogrpahy so i'd be in the water with a camera and i've felt one brush up against me. i totally have a steve irwin mentality towards them cause they've been so chill from my exp",
                                    "score": 118,
                                    "author": "iminsert",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Now I just imagine their heads fold or like squish back into their body like a fat seal when they bonk something :D",
                                            "score": 15,
                                            "author": "AGAW07",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I was anchored out in Center Bay, Gambier Island last night. Had a few of them start swimming all around my boat. A school of Eulachon/candlefish tried to take refuge under me. The sea lions herded them into a bait ball and had dinner.",
                                    "score": 15,
                                    "author": "millijuna",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Sea Lions are defensive when they are resting on land/docks. In the US people generally dissuade Sea Lions from lounging on docks where there’s people. In Ecuador I have seen that Sea Lions are given the right of way on land and people generally just walk around them giving them an adequate space. We were advised not to get to close as they can bite. However in the water they are playful and curious of people. Our guides had no worries of Sea Lions attack. They are dogs of the Sea",
                    "score": 57,
                    "author": "VanceAstrooooooovic",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "totally, i'm sure there are attacks, but they're sorta like deer you know? they'll come to you if they care, but if not then leave them alone.",
                            "score": 7,
                            "author": "iminsert"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My friends sang happy birthday to me on the warf where the sea lions like to hang out and they all clapped and barked along with them. They're absolute animal Chads",
                    "score": 21,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "I was getting my scientific diver certification off Catalina. There were a couple dives near a rookery there and those elephant seals would constantly come and visit underwater. They’d love to come up and scope us out, and spin and swim circles around us. Sea puppies indeed.",
                    "score": 10,
                    "author": "Butthole_Alamo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "they're super chill, ik you can hear horror stories, but it's kinda like sharks where it's like:\nokay, sure. there's been a couple attacks. but if you think about the massive account of them there is, the amount of attacks there was been is tiny. i think proportionally you're more likely to be attacked by a dog",
                            "score": 10,
                            "author": "iminsert"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "i wouldn’t trust the breeding males but the rest of them are sea doggos for sure",
                    "score": 27,
                    "author": "fajord",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "As a san francisco native, this isn't entirely true. Males can be kinda dangerous when territorial. There's docks off pier 39 that were seceded to sea lions years ago because people kept getting chased and attacked. They started to hang out for the fish and relative safety from the sharks, which do include the occasional great white. Then they decided to stay. They're a tourist attraction now.",
                    "score": 12,
                    "author": "Bwomper",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I get the impression that this guy would also be chased off if people could've gotten to him.",
                    "score": 5,
                    "author": "DPSOnly"
                },
                {
                    "level": 1,
                    "comment": "Wild guess here… Sea lions like to eat fish. This fisherman feels threatened. Hopefully law enforcement and karma catch up with this prick.",
                    "score": 3,
                    "author": "solarsuitedbastard",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "What a tragically pathetic person",
            "score": 946,
            "author": "activ8d_my_Trap_card",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This is a salmon fisherman who is mad at animals eating their natural diet, so he can't catch as many with his $100,000 worth of fishing gear\n\nedit: and I don't mean a commercial fisherman, just some entitled yuppie",
            "score": 753,
            "author": "DullBoyJack",
            "replies": [
                {
                    "level": 1,
                    "comment": "Seals eating fish was referred to as “poaching” in an article I read about this. Like, wtf?? I guess they’re not entitled to the fish, and we have sole ownership of them.",
                    "score": 149,
                    "author": "strokekaraoke",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Those guys, probably: \"we need to make the seals pay for a fishing license just like us!\"",
                            "score": 55,
                            "author": "DullBoyJack"
                        },
                        {
                            "level": 2,
                            "comment": "I bet they dont have hunting permits and they absolutely refuse to try the vegan options.",
                            "score": 15,
                            "author": "Your_RunescapeGF"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I work on a salmonoid project as wildlife biologist in the PNW and I can tell you there are some absolute cretins out there sports angling.\n\nWeirdly, we can't really do anything about it as a state agency, and folks are getting much more aggressive and dangerous. I'm seeing college kids risking their lives working in remote places interviewing aggressive anglers without receiving a livable wage. Oh and the racism? Borderline psychotic. \n\nThey'll blame anything from native tribal members allowed to take as much fish as they need (we have a federal treaty with native tribes that allow them to sustenance fish, not just sports fish) to sea lions doing what they've been doing since 7 - 30 million years ago. \n\nI absolutely hate this anti-government, far-right bullshit culture wars nonsense treating anything the government does as an act of oppression... I'd love to see these types of folks drink riverwater or mercury-infused well water instead of government funded purified water. See how long it takes dysentery and crapping out your own intestines until you change your mind, duck-dynasty-neck-bearding  looking ass. \n\nThanks for coming to my TEDxRant, the guy being interviewed in the video has my respect though, we need more anglers like him.",
                    "score": 267,
                    "author": "watcherofworld",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "As a PNW angler who believes in sustainability, thanks for the work you do. It blows my mind how much hate these chuds spew about the tribes \"taking *their* fish.\" Like wtf, dude. Habitat destruction and pollution play a far bigger role in declining returns than any managed tribal quota ever could, but they don't want to talk about that.",
                            "score": 105,
                            "author": "DullBoyJack",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 60,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm thankful the Yurok are looking out for our best interests better than the feds do.",
                                            "score": 26,
                                            "author": "SquatchiNomad",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Super excited about the upcoming dam removal they’re running.",
                                            "score": 11,
                                            "author": "lewisiarediviva",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I used to go fishing on Lake Copco every summer back in the late 80s / early 90s. I had a lot of good times there. That said, it will be fantastic to see those dams come out. I want to make one last trip out to see the lake, even though it's nothing like it used to be. Agricultural runoff and the resulting algae blooms have ruined it. It's long past time for the dams to go.",
                                                    "score": 5,
                                                    "author": "DullBoyJack"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Up in Washington, the tribes run a ton of salmon hatcheries. On the whole they are a massive net positive on salmon in the PNW.",
                                            "score": 7,
                                            "author": "DullBoyJack"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Probably because they're the ones destroying habitats and polluting.",
                                    "score": 7,
                                    "author": "nastynewtons"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "This is partly why I quit federal service. Bc at a point I was mentally ready to defend myself while working a bs paying temp job, while my sups would refuse to provide support then having the nerve to blame you for shitty ppls' behavior. Those in charge within federal agencies are those same people but do a good job at hiding it. \nPredominantly white and assimilated people who are too immature to realize &amp; admit they're the problem. Fucking punks man.",
                            "score": 19,
                            "author": "SquatchiNomad"
                        },
                        {
                            "level": 2,
                            "comment": "&gt;\t I’d love to see these types of folks drink riverwater or mercury-infused well water instead of government funded purified water. See how long it takes dysentery and crapping out your own intestines until you change your mind, duck-dynasty-neck-bearding  looking ass.\n\n\nYou can just go out to East Palenstine, Ohio. Perfect case study.",
                            "score": 8,
                            "author": "LazyPiece2"
                        },
                        {
                            "level": 2,
                            "comment": "These same guys also refuse to believe the dams on the Columbia/Snake have no impact on salmon populations, and it's entirely the sea lions fault.",
                            "score": 6,
                            "author": "Bennyboy1337",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "And guess who they will blame if the rivers and oceans are overfished and their livelyhood is gone. Yep its the government fault. Damn if they do, damn if they dont.",
                            "score": 19,
                            "author": "KnownMonk",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I thought salmon season was cancelled this year.",
                    "score": 13,
                    "author": "seamus_mc",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "For ocean salmon, river angling is still open on the columbia (restrictions do apply to certain zones, though).",
                            "score": 17,
                            "author": "watcherofworld",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Gotcha, thanks for the heads up.",
                                    "score": 5,
                                    "author": "seamus_mc"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I lived further down the Oregon coast and a lot of the casual fishermen had a real hatred of seals for stealing \"their\" salmon.",
                    "score": 7,
                    "author": "ArmouredWankball"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I bet this jerk purposely hits dogs and cats in the road.",
            "score": 172,
            "author": "AppleNerdyGirl",
            "replies": [
                {
                    "level": 1,
                    "comment": "Probably even when their not in the road, too.",
                    "score": 39,
                    "author": "SadAtProgramming"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What a fuckin weirdo",
            "score": 523,
            "author": "ortseamle",
            "replies": [
                {
                    "level": 1,
                    "comment": "As a weirdo, we don’t accept him. He’s a psycopath",
                    "score": 245,
                    "author": "sempi-moon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 53,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This man isn't weird, he gets off on hurting other living things for no purpose. He is evil.",
                    "score": 39,
                    "author": "JobsInvolvingDragons",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Zoom in on the mf. Let me see the boat name, the face the gait anything. Fucking zoom",
            "score": 31,
            "author": "JustHereFriends",
            "replies": [
                {
                    "level": 1,
                    "comment": "The registration number would be good enough.",
                    "score": 10,
                    "author": "PigFarmer1",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Revoke fishing and boating licenses for life",
            "score": 139,
            "author": "Thisisthewaymando187",
            "replies": [
                {
                    "level": 1,
                    "comment": "Impound boat, destroy it, deny owner future boating registration for life in State of Oregon.",
                    "score": 40,
                    "author": "Akronica",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Don't destroy the boat.  Give it to researchers.",
                            "score": 16,
                            "author": "JohnOliverismysexgod",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That's the least of his worries. If the feds are not just trying to find you, but are offering a reward... oof. \n\nThey are planning on making an example of this guy, and the feds have A LOT of time and resources to do so.",
                    "score": 9,
                    "author": "TrineonX",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Most states don't have boating licenses. There are classes you can take, but they're only a requirement for juvenile drivers.",
                    "score": 22,
                    "author": "Artisanal_Shitposter",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oregon does require a \"boating education card\" for all ages.",
                            "score": 12,
                            "author": "MrDurden32",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I feel if a grown adult with the mental faculties to obtain a boating license does something like this objectively, they represent a clear and present danger to society.",
            "score": 78,
            "author": "JobsInvolvingDragons",
            "replies": [
                {
                    "level": 1,
                    "comment": "Just FYI, there is no such thing as a boating license. You'll hear people call a boaters' education card a license, but it's not. It's just a safety course. You also don't need one before you buy a boat, just within a few months of buying one.\n\nEdit: Since the person I replied to was apparently very confused, my point, aside from pointing out that there is no licensing for boating, is that we should have more robust (actual) licensing for boating.",
                    "score": 16,
                    "author": "A_Drusas",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It depends on the state, call it a safety card/license, whatever you want but you cant drive a boat in many states without it. I have had to get it in a few states even though i now have a captains license that would cover places i would likely be.",
                            "score": 13,
                            "author": "seamus_mc",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "&gt; Just FYI, there is no such thing as a boating license\n\nSpongebob lied to me!",
                            "score": 5,
                            "author": "BlazingFist"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is where sea lions can get food.\nHumans have more options. \nI hope they catch him and throw the book at him",
            "score": 144,
            "author": "flobaby1",
            "replies": []
        },
        {
            "level": 0,
            "comment": "You're lucky enough to be on a boat with beautiful surroundings like that, and you try to run over some sea lions for kicks?",
            "score": 21,
            "author": "Potential-Extreme411"
        },
        {
            "level": 0,
            "comment": "I hope that prick has his boat taken and does jail time. Portlanders will find that piece of garbage in no time.",
            "score": 15,
            "author": "Wooden_Suit_6679"
        },
        {
            "level": 0,
            "comment": "Clearly someone who struggles to find their own penis",
            "score": 637,
            "author": "Mookius",
            "replies": [
                {
                    "level": 1,
                    "comment": "Why are you obsessed with their penis?",
                    "score": 8,
                    "author": "Luci_Noir"
                },
                {
                    "level": 1,
                    "comment": "Loads of dudes with small dicks are great people that don’t hit seals with boats. Lots of dudes who do awful things have massive dicks, and it doesn’t validate their actions anymore than it is evidence to someone with a small dick.\n\nIt’s, as another comment said, a pretty outdated insult.",
                    "score": 31,
                    "author": "The_Hoopla",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Using anyone's physical or mental factors they can't control as an insult is so lame. There are hundreds of things people do that give ways to insult and make fun of them. sadly most people who perpetuate this trash are too unfunny and unintelligent to actually come up with something to say so they fall back on the same three or four lines.",
                            "score": 13,
                            "author": "dun198",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It also weirdly justifies the actions of guys with big members.\n\n“What, you’re totally wrong you idiot. I drive a lifted F-150 and have a 8” dick.”\n\nAs if the size of his dick made the former okay.",
                                    "score": 8,
                                    "author": "The_Hoopla"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "He's jealous because the sea lions are better endowed than him.",
                    "score": 76,
                    "author": "Slobbadobbavich",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "GET YOUR HANDS OFF MY PENIS!!!!",
                    "score": 19,
                    "author": "click_here_for_luck",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Best video ever,and btw I mean the \" get your hands off my penis\" video not this that trying to hurt animals.",
                            "score": 6,
                            "author": "Valuable-Inspector67",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "You know your judo",
                            "score": 5,
                            "author": "FowledUp"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This insult feels so dated these days.",
                    "score": 23,
                    "author": "Alandrus_sun",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It says a lot about the commenter really. Glad to see people calling it out these days.",
                            "score": 12,
                            "author": "Luci_Noir"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’ve seen people go out of their way to kill animals crossing the road. We all know the type of person this pos represents.",
            "score": 13,
            "author": "Ok4940"
        },
        {
            "level": 0,
            "comment": "I hope he gets bold enough to charge lions on a motorbike. I would pay to see that.",
            "score": 37,
            "author": "ChiefKrunchy",
            "replies": [
                {
                    "level": 1,
                    "comment": "I hope he gets bold enough to get within 100ft of a Canadian goose.",
                    "score": 3,
                    "author": "46thAndTABBY",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's so obvious that people commenting this stuff just haven't spent any time around geese... you can walk right beside them and unless you're intentionally fucking with them all they do is sorta stare at you. I've lived around swarms of them my entire life. They're a long duck you can trample over not some warrior bird.",
                            "score": 3,
                            "author": "Time_Astronaut",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 88,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 10,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Fishermen hate sea lions. They are very good at taking fish and crabs from fishermen. They destroy fishing equipment. I’m personally fascinated by sea lions. I once went crabbing in a canoe with a friend on the Columbia river. We were using frozen turkey legs as bait. A sea lion started following us and taking our bait and crabs. I started throwing turkey legs to the sea lion. My friend got so mad at me🤣. I didn’t care. Then he said wait until that vicious thing gets in this canoe. At that point I realized it was a bad idea. I don’t know if they actually attack people in canoes, but it was eating frozen turkey legs like they were cookies. I’m pretty sure it would have won any conflict with two guys in a canoe",
            "score": 21,
            "author": "btrc74",
            "replies": [
                {
                    "level": 1,
                    "comment": "That is not a fisherman. He might occasionally fish but no fisherman in their right mind would use a bay boat with a wakeboard rack to fish off of. It would be so prohibitively inconvenient that it wouldnt be worth it to anyone.",
                    "score": 10,
                    "author": "Car-Facts",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Eh, it'd definitely do damage, watch the teeth, but a sea lion on \"land\" ain't anywhere near as problematic as finding yourself in the water with a pissed off sea lion. Like if you're ever in the water with a sea lion just voluntarily give them your turkey leg or you're gonna lose.",
                    "score": 3,
                    "author": "46thAndTABBY",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I live and actively fish on the columbia. This mentality is super fucking common, most guides have wrist rockets or paintball guns to shoot at them because they scare away the salmon",
            "score": 6,
            "author": "x-_-x-_-x-_-x"
        },
        {
            "level": 0,
            "comment": "Find that mfer. Now.",
            "score": 33,
            "author": "MLVCounter",
            "replies": [
                {
                    "level": 1,
                    "comment": "They filmed another guy doing it *while* they were filming. \n\nI’m surprised they didnt call cops or film closeups of the other guy",
                    "score": 17,
                    "author": "IMakeStuffUppp"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm in favor of bringing back keel hauling for certain offenses.",
            "score": 5,
            "author": "Artisanal_Shitposter",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Freeze. Enhance. \n\nCome on, boaters. Someone knows this prick, and snitches don't get stitches. That's a myth.",
            "score": 40,
            "author": "newleafkratom",
            "replies": [
                {
                    "level": 1,
                    "comment": "The article I read said:\n\n&gt; The boat is described as a 19 to 20-foot aluminum Hewescraft Pro-V Sea Runner with a dark blue stripe. The boat has a soft top with an aluminum Barewest Fish &amp; Wake Tower and is powered by a Yamaha outboard motor.",
                    "score": 12,
                    "author": "46thAndTABBY",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "What a tiny loser. I hope he gets federally charged",
            "score": 4,
            "author": "Doglovincatlady"
        },
        {
            "level": 0,
            "comment": "What a fucking piece of trash. Throw this person in prison.",
            "score": 5,
            "author": "Digital-Exploration"
        },
        {
            "level": 0,
            "comment": "there are honestly a lot of bored, soulless mother fuckers that live in the PNW \n\nsource: was born &amp; raised",
            "score": 4,
            "author": "techno_slut666"
        },
        {
            "level": 0,
            "comment": "I hope they catch this psychopath. Someone on a local lake near where I live intentionally ran his boat over a family of swans. People figured out who he was and he did time. It was his dads boat and his legal career was pretty much over after all of the news coverage.",
            "score": 4,
            "author": "VapingC"
        },
        {
            "level": 0,
            "comment": "I wonder how old he was when his mother and father left him because this is parentless behavior",
            "score": 28,
            "author": "Shadow_knight10",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nah. \n\nThis is parents-never-told-him-no-and-yelled-at-people-who-did behavior.",
                    "score": 27,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not enough. Should be jail. Sick behavior.",
            "score": 101,
            "author": "Single_Raspberry9539",
            "replies": [
                {
                    "level": 1,
                    "comment": "What isn't enough? By the sounds of it they haven't even found the guy yet, hence the offer of a reward for information",
                    "score": 52,
                    "author": "MuddlinThrough",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Are you a bot?",
                    "score": 18,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sea lions are universally loathed by fisherman communities because of their over population and penchant for salmon destruction. I expect this would possibly be someone from one of those communities.",
            "score": 14,
            "author": "Egmonster",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I don't understand the level of mental insufficiency that causes this sort of toddler-ass behavior as an adult. I literally cannot comprehend how anyone can be so stupid and shitty.",
            "score": 15,
            "author": "ArgonGryphon",
            "replies": [
                {
                    "level": 1,
                    "comment": "According to some people on this thread it’s all good because sea lions “destroy” (eat) the salmon that should be for the fishermen and the fishermen alone. Also, apparently, some think the sea lions are overpopulated so this is acceptable to do. Humans really are the worst species on the planet.",
                    "score": 7,
                    "author": "OpethJewel"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Netflix’s new show….Don’t F*^k With Sea Lions",
            "score": 7,
            "author": "F_I_N_E_"
        },
        {
            "level": 0,
            "comment": "What a dick...",
            "score": 3,
            "author": "Apprehensive_Fix_151",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This is cowardice in full form. Or he's 12. Still cowardly either way.",
            "score": 3,
            "author": "Skullpuck"
        },
        {
            "level": 0,
            "comment": "I need an update on this!",
            "score": 3,
            "author": "Digital-Exploration"
        },
        {
            "level": 0,
            "comment": "Is there a higher quality video anywhere? If someone can get the registration numbers that would be a big step.",
            "score": 3,
            "author": "bnemmie"
        },
        {
            "level": 0,
            "comment": "A fisherman. I bet his excuse is, “They’re eating my fish.”",
            "score": 3,
            "author": "tcorey2336"
        }
    ]
}