{
    "id": "13aw624",
    "score": 48121,
    "title": "Handler for TSA explosives detection working dog qt Detroit Metropolitan Airport.",
    "author": "Surveyor_of_Land_AZ",
    "date": 1683478751.0,
    "url": "https://www.reddit.com/r/iamatotalpieceofshit/comments/13aw624",
    "media_urls": [
        "https://v.redd.it/76efybj2xfya1"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\nPlease note that we will ban you if a post or comment breaks any of our rules. **Be especially mindful of the following**:\n\n**Rule 1: Do not post or ask for identifying information, including first and last names and social media usernames.** Public figures are **not** exempt. We remove all external links to prevent accidental posting of identifying information.\n\n**Rule 2: Do not post violent comments, and do not glorify violence, per TOS.** We can't take responsibility for how angry a post makes you, you need to do that. Telling us \"it was a joke bro\" is not an excuse.\n\n**Rule 7: Do not link to or post screenshots of reddit posts, reddit comments, reddit personal messages, reddit profiles, etc.** We cannot allow you to use this subreddit to harass other people on reddit. \n\n**Rule 8: No bigotry, no racism or race baiting.** It is hard to believe that we even need a rule like this. \n\n**Our rules are zero tolerance. You will be banned for breaking them.**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/iamatotalpieceofshit) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Update \n\n\n“Video showing a TSA explosive detection canine handler aggressively pulling a dog working in a Detroit Metropolitan Airport (DTW) terminal was shared with local leadership this morning,” TSA said in a statement to Local 4. “The behavior displayed by this handler is unacceptable and not within the high standards we hold our officers to.”\nTSA also said the employee has been removed from handling duties pending the completion of an investigation.\nAs for the dog the handler was pulling, TSA directed officials at DTW to take the dog to a veterinarian immediately for a wellness exam.\n\n\nCopyright 2023 by WDIV ClickOnDetroit - All rights reserved.",
            "score": 5800,
            "author": "strangesmagic",
            "replies": [
                {
                    "level": 1,
                    "comment": "Now he has to go to the vet for a checkup? This dog needs a fuckin vacation",
                    "score": 3198,
                    "author": "diraq_delta",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And a checkup",
                            "score": 776,
                            "author": "King_Skywhale",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "and some treats",
                                    "score": 574,
                                    "author": "qervem",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "And a raise, maybe even a lawsuit?",
                                            "score": 83,
                                            "author": "PimpmasterMcGooby"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "And a pat on the head bc hes a good boy",
                                            "score": 487,
                                            "author": "SapphicPancakes",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Don’t forget the Milkbones",
                                                    "score": 30,
                                                    "author": "Fleabag609",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 141,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "How is that dog gonna pull his fat ass? Dog will get even more hurt",
                                                            "score": 32,
                                                            "author": "Dickwraith101",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "As if that good boy has the capability to reciprocate such nastiness",
                                                            "score": 11,
                                                            "author": "lmaytulane"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "And a belly rub",
                                                    "score": 22,
                                                    "author": "Zandandido"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "He deserves all the pets",
                                                    "score": 11,
                                                    "author": "xLabGuyx"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I'm now imagining this dog going through airport security to some Hawaiian vacation with another handler, only to lock eyes with this handler working desk duty with a (even more) depressed look on his face.",
                            "score": 42,
                            "author": "clangan524",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "It's a good thing the dog is going to the vet. They can assess for any injuries, such as sprains.",
                            "score": 113,
                            "author": "roo_kitty",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It’s more important for the check up to check for anything else. If this is how he treats the dog in public then who knows how badly he treats it in private",
                                    "score": 122,
                                    "author": "evanschris",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I gave a simple example of an injury that could occur from the abuse in the video because the person above seemed sad that the dog now has to have a veterinary experience as well, which can be unpleasant. Of course they will be looking for other possible injuries that could be occurring off of video, however I did not list any such injuries as that is purely speculation.",
                                            "score": 36,
                                            "author": "roo_kitty"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Depending on how hard he jerked the leash, the dog could have had his trachea damaged. Mind you, it’s much more of an issue for little dogs (my one chihuahua has a collapsed trachea), but it’s a case of better safe than sorry.",
                            "score": 18,
                            "author": "mrs-monroe",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "idk about your dog, but mine likes going to the vet",
                            "score": 6,
                            "author": "ThunderingRimuru",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I scrolled through the comments just for this. Kisses.",
                    "score": 140,
                    "author": "schwipples",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "&gt; Relieved of his handling duties pending the completion of an invesigation.\n\nWhy does there even need to be an investigation with something as clear as this with video evidence to back? I know for a fact there’s on-site cameras over that area as well that they can pull if they question the legitimacy.\n\nThis is as open/shut of a case as it gets to fire somebody for unbecoming conduct.",
                    "score": 286,
                    "author": "TacticoolBreadstick",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There’s an investigation because this action could result in criminal charges. I don’t know about this specific position but in some the dog is legally an employee and this scum is committing battery.",
                            "score": 274,
                            "author": "AlmostAThrow",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And they might check for more occurrences, witness statements, camera footage etc.",
                                    "score": 51,
                                    "author": "Korashy"
                                },
                                {
                                    "level": 3,
                                    "comment": "This is exactly it. If just this video happened it’s a good chance dude will just be fired and things will move along. The issue is who knows what else he has done and he was already walking the line of animal abuse jerking that poor dog around by its neck when it clearly didn’t need to be. That’s what he did in public on the 10 seconds we have on video. Who knows what else he was doing. Hell, if he was part of arresting someone with that dog will that arrest still hold up in court? You could argue that he clearly wasn’t a competent k9 handler",
                                    "score": 20,
                                    "author": "Pristine-Ad-469"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Do you have a link to that?",
                    "score": 83,
                    "author": "photoguy9813",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The mods are idiots and delete posts with links to news articles. Going to block this subreddit after this.",
                            "score": 175,
                            "author": "ISO_8601",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's because they have extreme views, they use the contents of the inner comments as a bullshit excuse to only have content that aligns with how they feel",
                                    "score": 7,
                                    "author": "No-Rip3705"
                                },
                                {
                                    "level": 3,
                                    "comment": "Al of reddit is stupid",
                                    "score": 19,
                                    "author": "qierotomaragua",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s bad enough he’s being a total D bag to the dog, but he’s getting all up in people faces for no reason at all. Dudes on a total power trip or he’s having a really bad day and taking it out on everyone he can.",
            "score": 10895,
            "author": "Nerd_Man420",
            "replies": [
                {
                    "level": 1,
                    "comment": "Imagine having the job of walking some sweet dog around and then being all grumpy and mean about it.",
                    "score": 4749,
                    "author": "screedor",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Especially a dog whose fully trained to heel perfectly on turns if you'd JUST GIVE IT A GODDAMN SECOND MOTHER FUCKER!\n\nI feel better now.",
                            "score": 1070,
                            "author": "hairlessgoatanus",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 162,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Short answer: The dog is trained better than he is.",
                                            "score": 101,
                                            "author": "FlighingHigh",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "That dog probably has 20x the amount of training time compared to the handler",
                                    "score": 26,
                                    "author": "jazzfruit"
                                },
                                {
                                    "level": 3,
                                    "comment": "Look at him, he is an athlete in his prime, the Dog is to slow and just cannot keep up with this Alpha beast.\n\n/S",
                                    "score": 14,
                                    "author": "weltvonalex",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "My dream job would be walking that dog around all day.  And then I would take him home and we’d have treats and play fetch and he’d lay up next to me on the couch while we watched our favourite shows. Then we would wake up the next day and be super happy because we get to do it all over again.",
                            "score": 1323,
                            "author": "Gdayyall72",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Climate controlled dog walking is a dream. Imagine not having to touch grass while walking a dog.",
                                    "score": 25,
                                    "author": "Patchumz"
                                },
                                {
                                    "level": 3,
                                    "comment": "I actually work at a dog daycare that houses TSA dogs, unfortunately they don't go home with their owners till they retire. Also you're not supposed to give them any love bc it's used as a reward when they find something....*Buuuut*...We may still pet them a bit",
                                    "score": 28,
                                    "author": "LimeWizard",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "I just discovered horses because my daughter is talking riding lessons.  While she learns, I brush, give whither scritches, head rubs, all the while thinking that this animal, if so inclined, could kill me.\n\nIf my job was to take care of them it would be awesome.",
                                    "score": 423,
                                    "author": "Ghost_of_Till",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I love horses so much, their smell, their velvety noses, their energy. I find them very soul nourishing.",
                                            "score": 16,
                                            "author": "aethelredisready",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "If only it paid literally anything to do it 🥲",
                                            "score": 119,
                                            "author": "xparapluiex",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 78,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "And they can get little girls to pay THEM to take care of the horses",
                                                            "score": 43,
                                                            "author": "Yesuhuhyes"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Same.\n\nMy second dream job is to be the person firing this guy.",
                                    "score": 72,
                                    "author": "lesChaps",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "That sounds like my husband and dog's life.",
                                    "score": 15,
                                    "author": "Karen125"
                                },
                                {
                                    "level": 3,
                                    "comment": "I’ve seen these dogs in training at the airport before and usually they get a break where the handler lets them play with a toy for a few minutes. The handler was adamant about not interacting with the dog but was more than happy to stay in the area and let us watch them play with the dog for its break. You could tell the handler loved the dog but understood the importance of making sure the dog was focused to do it’s job. This video just makes me sad.",
                                    "score": 33,
                                    "author": "Reddit_User_Loser"
                                },
                                {
                                    "level": 3,
                                    "comment": "You sound like the right person for it; make your dream a reality.",
                                    "score": 29,
                                    "author": "CajuNerd"
                                },
                                {
                                    "level": 3,
                                    "comment": "You need a dog in your life!",
                                    "score": 48,
                                    "author": "ashashlondon",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "That job exists you know.  Pet sitting and dog walking can pay the bills.",
                                    "score": 15,
                                    "author": "didntstopgotitgotit"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "He’s far too untrained to be legitimately called a handler.  \n\nIf the dog was having problems staying in the proper position, you start with turns that have the dog on the inside, then move to turns where the dog must go further around the outside.  You encourage the dog before the wide turns and get them mentally ready to pick up the pace. \n\nThis person doesn’t know the first thing about training or handling.",
                            "score": 165,
                            "author": "ithappenedone234",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Also it's a bomb detection dog. When's the last time someone brought a bomb into the airport?\n\nThis dude literally has no function.",
                            "score": 116,
                            "author": "Corgi_Koala",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That just makes it the fucking best job. I walk this dog and let kids pet him and talk to people about the reasons he is a particular good boy. We are bomb hunting and so far we haven't had to work yet.",
                                    "score": 64,
                                    "author": "screedor",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You can't pet a lot of working dogs :/ even says no petting on the harness most of the time",
                                            "score": 53,
                                            "author": "Archer007",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yea, it messes with their conditioning and training. Then again so does dragging it around by a leash like a sack of potatoes.",
                                                    "score": 85,
                                                    "author": "LuMo096",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "When I was at the Philadelphia Airport last year I saw a working dog being walked around. I didn't even bother to look at the writing on its harness because I was sure it said no petting, but luckily my girlfriend read it. It said \"please pet me\"! Her name is Copper and she's a therapy dog with the PHL Wagging Tails Brigade and just walks around the airport looking for some love from strangers. The person caring for her even gave us a little playing card with info about her on it, it was so cute and definitely made our travels brighter.\n\nBut yeah, pretty much every other kind of working dog you can't pet and you're not even supposed to talk to them or try to interact with them.",
                                                    "score": 60,
                                                    "author": "PicturesquePremortal",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I absolutely abhor PHL, hands down the worse airport experience I’ve had every time I’m there (but it’s local to my elderly grandparents so I suck it up). Gonna look for therapy dogs next time I’m there!",
                                                            "score": 5,
                                                            "author": "norrina",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "That's probably why the dogs exist.",
                                                                    "score": 9,
                                                                    "author": "Trueloveis4u"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I must keep an eye out for one of these dogs when I fly out of Philly next week!",
                                                            "score": 5,
                                                            "author": "Blaze0511"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Like a month ago.......",
                                    "score": 6,
                                    "author": "BakaSamasenpai"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt; Dudes on a total power trip or he’s having a really bad day and taking it out on everyone he can.\n\nWell yeah, he's TSA.\n\nThey aren't all like that, but generally you don't apply for a job yelling at people for doing what the sign they just walked past told them to do because you're kind.",
                    "score": 391,
                    "author": "DimitriV",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Who would have thought that giving people less training than mall cops and awarding them with federal authority was a bad idea?",
                            "score": 231,
                            "author": "Nevermind04",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Last time I flew they were directing people around and through the x-ray machines really weirdly to the point where one agent was telling someone to walk in front of me while the other agent was telling me to walk forward, and started raising their voice when I didn’t immediately move. I calmly told them their instructions were contradictory and one of them got absolutely furious. I just didn’t say anything else, followed all their instructions, and walked away. Some of them really let the “power” go to their head.",
                            "score": 42,
                            "author": "plcg1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I got yelled at for taking my laptop out of my carry-on, which their posted sign specifically said to do.  And I assume they would've yelled at me if I hadn't done it.",
                                    "score": 28,
                                    "author": "DimitriV",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "They would have! A while back, I was super tired while going through security and completely blanked on pulling my laptop out of my backpack. They then made a big deal out of pulling me off to the side, searching my bag, opening up my laptop, and swobbing it for explosives residue.",
                                            "score": 20,
                                            "author": "popojo24",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Some x-ray machines require that and some don't, but it's always our fault for not knowing which it is today.  Or in my case, for actually reading their sign and doing what it said.\n\nIt's like TSA officers make up rules with mental coin flips.",
                                                    "score": 14,
                                                    "author": "DimitriV"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah power tripping and intimidation. Lots of wannabe cops out there. Lots of actual cops are the same.  Being a bully to everyone around u is a show of littleness of pride in yourself and character.",
                    "score": 64,
                    "author": "golgiiguy",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "At 40 seconds he decides to very abruptly jerk on the dog's leash, turn around and walk behind the blonde woman so he can check out her ass, you can see him looking at her ass. I don't think he's having a bad day, I think he's just a psycho.",
                    "score": 96,
                    "author": "DootBopper",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Was going to write a similar comment but there’s no need. You’ve summed it up very well.",
                    "score": 12,
                    "author": "CliffyGiro"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Don't think the dog will form much of a bond being treated so badly.",
            "score": 5847,
            "author": "4004-698-763",
            "replies": [
                {
                    "level": 1,
                    "comment": "He needs fired",
                    "score": 2267,
                    "author": "Complex-Situation",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "With any luck someone will pick up on the uneasiness the dog has around this guy. As forgiving as dogs can be it might take time before it's obvious. Hopefully it doesn't go far and the guys is fired. Dog deserves so much more than that crap.",
                            "score": 628,
                            "author": "4004-698-763",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "With any luck more people that work there will see the video and get this piece of trash out of there",
                                    "score": 287,
                                    "author": "Tkinney44",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 27,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I mean in terms of most monitored and surveiled areas possible an airport is pretty high up there so I doubt he’ll keep his job for long",
                                                    "score": 34,
                                                    "author": "Skyms101"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Nobody is going to need to pick up on anything. This dude is probably *already* fired.",
                                    "score": 41,
                                    "author": "Ghost_of_Till",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I have no faith in that. I’m certain he’s still working AND still treating the dog the same way.",
                                            "score": 58,
                                            "author": "MBSMD",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I've seen this guy dozens of times and he's either A. Being a dick, B. Talking about non-sense with a coworker who looks annoyed, or C. Asleep in a chair.\n\nHe must be a nepotism hire because he's always there and does nothing right.  He should've been fired years ago.",
                            "score": 97,
                            "author": "ZombieDracula"
                        },
                        {
                            "level": 2,
                            "comment": "Local news is reporting that he has been relieved of his duties.\n\nEdit to add: I'm hearing that the dog has been taken to a vet to assess any injuries.",
                            "score": 1089,
                            "author": "FREESARCASM_plustax",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Relieved of his DOG HANDLING duties, not fired, at least from the article I saw",
                                    "score": 414,
                                    "author": "DillionM",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Oh good.. he can now go on be a prick to passengers at screenings",
                                            "score": 198,
                                            "author": "hazed-and-dazed",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Better me than the dog.",
                                                    "score": 29,
                                                    "author": "Wrong_Laugh6933",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Well he needs to get fired cuz if he is a Dick to a dog he will 100% be a dick to humans.",
                                                            "score": 8,
                                                            "author": "johanebrown",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Yea once a story like this gets traction the guy isn’t keeping his job. People hate animal abusers more than they hate child abusers.",
                                    "score": 346,
                                    "author": "KatBoySlim",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Relieved of duties is not the same as fired. They'll just move him to some non-animal handling position.",
                                            "score": 31,
                                            "author": "SeriousGoofball",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "No lies detected",
                                            "score": 44,
                                            "author": "HGIGIU"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Quote from an article:\n\n“TSA also said the employee has been removed from handling duties pending the completion of an investigation.\n\nAs for the dog the handler was pulling, TSA directed officials at DTW to take the dog to a veterinarian immediately for a wellness exam.”",
                            "score": 75,
                            "author": "Tomatotaco4me"
                        },
                        {
                            "level": 2,
                            "comment": "I agree completely. How could he have passed training. Should definitely be fired.",
                            "score": 19,
                            "author": "OldyMcOldFace",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "The dog needs to be fired, and given a good and loving home, where they can be the bestest dog ever.",
                            "score": 57,
                            "author": "JWLane",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I hope that guy is not the main bonder for the dog because he doesn’t look like he communicates with dogs at all.",
                    "score": 162,
                    "author": "conjectureandhearsay",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Only thing that guy can bond with is his momma cuz they both so fat they have their own gravitational fields.",
                            "score": 68,
                            "author": "dasgudshit",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I saw your mom staring at a carton of orange juice at the grocery store. I was like \"what are you doing?\" She responded with \"it says concentrate.\"",
                                    "score": 13,
                                    "author": "goingnorthwest",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "I hear his mom is also a bit of a slut",
                                    "score": 21,
                                    "author": "conjectureandhearsay",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I dunnoooo sounds a bit like... conjectureandhearsay.",
                                            "score": 8,
                                            "author": "insertadjective",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "He keeps dragging him around like that the dog is going to be a stress ball wondering what it’s doing wrong and essentially be useless. TSA workers are the fucken worst.",
                    "score": 24,
                    "author": "ThroughTheHalls",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I doubt the dog is actually doing what they're trained to to with that handler. Either that dog is extremely overheated for being inside with air conditioning, or extremely stressed out by being tossed around like a sack of potatoes every other moment but either way he's not focused on his job.",
                    "score": 17,
                    "author": "Runaway_Angel",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "If he acts this way in public imagine how he trats that dog (and others) when no one is watching.",
                    "score": 33,
                    "author": "mtrayno1",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Just googled it, Dog has already pledged allegiance to Al-Qaeda.",
                    "score": 62,
                    "author": "DO4DGaming",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "He is just pissed off with the dog for enjoying a bit of excise and cannot get his head around it, this becomes a bellend to said dog!",
                    "score": 5,
                    "author": "Used-Professor",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Please tell me you’ve sent a copy of this to the head of airport security and the local chapter of the humane society.",
            "score": 4556,
            "author": "pbandnv1",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 2736,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Good on you for sending them in! Hope he gets fired, what a dick.",
                            "score": 951,
                            "author": "Zestyy95",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What did the comment say",
                                    "score": 47,
                                    "author": "nametakenfuck",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Basically said they sent in the video to the TSA.\n\nI assume it was removed because they posted a link. The link was to a  local news story which said:\n\n\"TSA also said the employee has been removed from handling duties pending the completion of an investigation.\n\nAs for the dog the handler was pulling, TSA directed officials at DTW to take the dog to a veterinarian immediately for a wellness exam.\"",
                                            "score": 174,
                                            "author": "circumvention23",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Classic reddit mods trying to hide truth and justice",
                                                    "score": 113,
                                                    "author": "TurboSexaphonic",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Thank god the TSA took all the right moves here ^(are words I never thought I would say in my entire life)",
                                                    "score": 7,
                                                    "author": "HaloSidewinder",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "We must get this bum fired. Send it everywhere",
                                    "score": 109,
                                    "author": "MrMcSpanky94",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Post to twitter and tag the airport and TSA. This is fucking appalling",
                            "score": 213,
                            "author": "pammy_poovey",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This! Definitely call out the agency. This is unacceptable",
                                    "score": 63,
                                    "author": "chickwithwit23",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Please will you update if this gets covered and if we see what happens. I'd appreciate it.\n\nWhat a disgusting horrible cruel person. The poor dog.",
                            "score": 327,
                            "author": "Alone-Day1429",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Omg. I audibly gasped seeing him swing that sweet pup around. What a foul example of a human.",
                                    "score": 37,
                                    "author": "TheHaydnPorter"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Thank you for reporting him. It’s disgusting.",
                            "score": 147,
                            "author": "fishinglife777"
                        },
                        {
                            "level": 2,
                            "comment": "Keep us updated!",
                            "score": 14,
                            "author": "Codename_Noir_"
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 126,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Don't forget the fact that this psychopath is getting paid to make our flights safe and look for dangerous substances. Torturing the poor dog aside,  he's obviously not doing his job either.",
                                    "score": 28,
                                    "author": "oveis86",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt; this psychopath is getting paid to make our flights safe\n\nIn my opinion the TSA is more security theater than security.",
                                            "score": 9,
                                            "author": "DimitriV",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You’re a saint.",
                            "score": 31,
                            "author": "qqhap101"
                        },
                        {
                            "level": 2,
                            "comment": "Thank you for bring awareness and contacting the appropriate people. I hope he faces the appropriate consequences.",
                            "score": 7,
                            "author": "No_Cow_8796"
                        },
                        {
                            "level": 2,
                            "comment": "Put his ass on bye bye job",
                            "score": 12,
                            "author": "Ok_Effect5032",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Send it to the Federal Security Director's office for DTW. I'm sure they'd take an interest. This is unacceptable.",
                    "score": 638,
                    "author": "HungryMorlock",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 246,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 16,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "He's been relieved of handler duties pending an investigation and the doggo was taken to the vet for a wellness check.",
                    "score": 274,
                    "author": "Billytaku",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sorry, I'm not doubting you, but have you got a source for this? I couldn't find anything on TSA's twitter.",
                            "score": 123,
                            "author": "EaLordOfTheDepths-",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The automod is removing links but it’s the first news story. Clickondetroit has an article. \n\n&gt; “TSA also said the employee has been removed from handling duties pending the completion of an investigation.\n&gt;As for the dog the handler was pulling, TSA directed officials at DTW to take the dog to a veterinarian immediately for a wellness exam.”",
                                    "score": 242,
                                    "author": "For_All_Humanity",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thank you so much for posting this! That's honestly a great outcome. I hope the guy is never allowed to work around animals again.",
                                            "score": 73,
                                            "author": "EaLordOfTheDepths-",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Removed from handling duties, but not his role. It's a good outcome for the dog, but this guy has anger issues and either needs to take classes or be fired.",
                                                    "score": 50,
                                                    "author": "FourthBar_NorthStar",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I wouldn’t trust him to be a baggage handler.",
                                                    "score": 19,
                                                    "author": "Megdogg00",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I want to believe. Do you have an article?",
                            "score": 18,
                            "author": "iumesh",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "When he gets all hostile to the dude that he almost walked in front of- ugh he’s angry and taking it out on his poor dog and other people!",
            "score": 203,
            "author": "Moon-Desu",
            "replies": [
                {
                    "level": 1,
                    "comment": "He’s a trash human. Just imagine what he does when he’s not on the job.",
                    "score": 26,
                    "author": "piquedinhighschool",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Probably a domestic abuser",
                            "score": 6,
                            "author": "spatchi14",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "People trying to justify this as training, this is not training. He is clearly mad at the puppy for something and punishing him",
            "score": 2232,
            "author": "Illustrious_Nothing9",
            "replies": [
                {
                    "level": 1,
                    "comment": "Guy is probably mad at life and takes it out on the good boy just trying to do its job.",
                    "score": 896,
                    "author": "bonkersforbogeys",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "THIS! Now why doesn’t anyone get in his face and say “fetch your fucking supervisor!” ?",
                            "score": 164,
                            "author": "youreadumbmf35",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Because they all know who he works for , and those people can stop you from flying real quick.",
                                    "score": 99,
                                    "author": "Damizel"
                                },
                                {
                                    "level": 3,
                                    "comment": "Is that really that much of a mystery?",
                                    "score": 9,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "If that dog was trained to sniff bombs, it was trained to heel. \n\nClearly the dog does heel but the guy yanks the leash really hard and sends the dog flying.",
                    "score": 23,
                    "author": "altergeeko"
                },
                {
                    "level": 1,
                    "comment": "Its the very old, outdated, Kohler method of teaching a dog heeling from the 60s. Extremely popular amount law enforcement and military canine training to this day. The idea of it is to quickly change directions every time the dog walks ahead of you. The dog will reach the end of the leash and be jerked around until the dog eventually learns that walking too far from the handler results in discomfort. \n\nAnd like... it works, *technically.* When you do it correctly. A harness isn't going to achieve it because it doesn't cause the level of discomfort a collar would. (You'd use a prong collar for this.) This method relies on positive punishment, something the dog finds uncomfortable applied to reduce a behaviour. \n\nBut you could also shove treats into the dogs face every time he looks at you and stays close to you and get the same response with a lot less struggle. Not to mention this dog isn't even pulling and forging ahead? There's nothing to train here?",
                    "score": 203,
                    "author": "ILackACleverPun",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I get that this is a thing but feel like this explanation is giving this dude too much credit. If that's what he is doing he looks like he's doing a bad job to me. Almost looks like the dog thinks it play. Not saying he isn't training, I certainly would be bad at it. just that I would imagine that it would be less sloppy looking.",
                            "score": 24,
                            "author": "enomele",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I think he ate all the Scooby snacks.",
                            "score": 8,
                            "author": "MarkXIX"
                        },
                        {
                            "level": 2,
                            "comment": "Yeah, this. That being said, if he is attempting to train, it should be known to any professional in dog handling that there are better methods to do even this kind of training. When we used it on our husky, we used a self-tightening collar and she got mild tugs on the collar before a turn so if she was behaving she wouldn't feel any discomfort at all. That way when we wanted her to turn with her regular leash the same light tugs notified her to watch for a turn without any discomfort. But she was an exceptional case because she was a terrible walker and treats just weren't working. She was smart enough to only do what you wanted when she saw you had a treat, so she was just gaming us",
                            "score": 52,
                            "author": "randomuser2444",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "He is obviously mad he has to walk. He appears to be more of a sitting man to me.",
                    "score": 61,
                    "author": "Lurker1234567789",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "She is trying so hard to please, you keep seeing her look back, like, “Ready to turn?  I’m gonna do it right for you!”  And hen he yanks her around anyway.  Hope he’s fired.",
            "score": 308,
            "author": "HubbaBekah",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 35,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "This broke my heart. You're totally right, the dog is trying it's best to do what it thinks the human wants. He's yanking the poor thing in every direction. I'm glad to see the sweet dog has been removed from that shit bag of a handler. Hopefully gets a good new home.",
                    "score": 11,
                    "author": "Anonymously_Boring",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "What a horrible person!  That poor dog.  I’m glad you’re sending this video to the right authorities. Thank you",
            "score": 482,
            "author": "MurphyCaper",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I deal with TSA pretty frequently for my job and let me tell you each and everyone of them is completely braindead.",
            "score": 799,
            "author": "jrvanvoo",
            "replies": [
                {
                    "level": 1,
                    "comment": "My aunt was actively addicted to meth when she was a tsa agent. Even brought it past security a few times. Not a great look for the institution.",
                    "score": 101,
                    "author": "Admiral_Sarcasm",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "One of the entire justifications for the creation of the TSA was to provide jobs to people who wouldn’t otherwise be able to find work…",
                    "score": 57,
                    "author": "Slam_Burgerthroat",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "The TSA is a jobs program.",
                    "score": 89,
                    "author": "Ericisbalanced",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They are protecting us from Richard Reid, in case he finishes his 3 life sentences + 110 years ...",
                            "score": 10,
                            "author": "lesChaps"
                        },
                        {
                            "level": 2,
                            "comment": "But the TSA has saved so many lives!",
                            "score": 6,
                            "author": "mar4c"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Many years ago at one point they were advertising TSA jobs on gas station pumps and pizza boxes.\n\nTells you all you need to know.",
                    "score": 28,
                    "author": "___Art_Vandelay___"
                }
            ]
        },
        {
            "level": 0,
            "comment": "He needs to be fired and maybe charged for animal cruelty. So fucking wrong.",
            "score": 676,
            "author": "Kind_Nebula6900",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 202,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The dog is in a vest so pulling locks on the collar bones rather than on the neck. Not that it makes what the guy is doing any better, but fortunately there shouldn't be any permanent damage done to the dog.",
                            "score": 31,
                            "author": "ragganerator",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I hope the next time I see this video is on the byebyejob sub...",
            "score": 239,
            "author": "TheRealMylo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hopefully. OP sent it to the tsa and news.",
                    "score": 25,
                    "author": "thedutchrep",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 34,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Animal abuser in public? What does he do in private?",
            "score": 86,
            "author": "Chuck_MoreAss",
            "replies": []
        },
        {
            "level": 0,
            "comment": "The poor pup looks so confused yet it's little stubby keeps wagging and he keeps looking up to the handler for direction and praise. We've had 2 GSP, they're so loyal and loving. This is so sad",
            "score": 232,
            "author": "TokenOpalMooStinks",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's a stress wag, tense and quick. A happy tail is relaxed and sweeping.",
                    "score": 106,
                    "author": "Nixie9",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes exactly. That plus the panting and glancing up means she is stressed and doesn’t know what to do to avoid this unpredictable person yanking on her. This is not training. This is a person with an anger and empathy problem who wants to push someone around.",
                            "score": 68,
                            "author": "SolitaryForager",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Just lost my GSP at 16 a year ago and this makes my blood boil. Those dogs are smart as hell, loyal, and relentlessly hardworking. \n\nThis guy should be leashed and dragged.",
                    "score": 28,
                    "author": "GrapeScotch",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Complete POS",
            "score": 85,
            "author": "KungFoosballFist"
        },
        {
            "level": 0,
            "comment": "Thanks for posting this!! My original vid was locked for comments, but to update anyone who hasn’t seen it, WDIV reported that TSA released a statement that the handler was relieved of his duties as a handler pending investigation. Should be more local news sharing this later today as well!",
            "score": 82,
            "author": "ProfessionalEye3568",
            "replies": [
                {
                    "level": 1,
                    "comment": "It sucks you caught that behavior from a “professional agent”, but I’m glad you did and stopped any possible future abuse.",
                    "score": 7,
                    "author": "yeah_yeah_therabbit"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 23,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have sent the video (along with others) to TSA, Wayne County airport commission,  and several local news agencies.",
                    "score": 52,
                    "author": "Surveyor_of_Land_AZ",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I've already seen it on the local news so the word is getting out.",
                            "score": 15,
                            "author": "AppleNippleMonkey"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I sent it to local news stations in Detroit, Detroit Airport, and the Detroit Humane Association",
                    "score": 8,
                    "author": "_tomato_paste_"
                }
            ]
        },
        {
            "level": 0,
            "comment": "you can see that passersby are noticing how he treats the poor dog. i wont be surprised if he reacts in a hostile manner if someone intervenes and questions why he’s abusing the dog.",
            "score": 24,
            "author": "trenta_nueve",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Slight rant: \nTrainer and bomb handler here.  He's aggressively and incorrectly trying to train the dog to heel.   The first rule of training is to take a step back and let yourself decompress, training has no benefit when the handler is upset, you make mistakes and create bad habits.  He's also using a harness when it should be a collar.  Also you shouldn't be training this while actively working the dog there's a time and place for that.  These dogs have a limit to how long they can effectively work and these places that employ dogs always overwork them, especially new dogs that don't have the energy to work all day yet.  But in my opinion TSA handlers are bottom of the barrel with few exceptions, no one wants to work for them but that's how you get your foot in the door in an incredibly hard to get into job field.",
            "score": 22,
            "author": "Awesomedeer2",
            "replies": []
        },
        {
            "level": 0,
            "comment": "He's being pissy because he can't keep up with the dog.",
            "score": 55,
            "author": "lego_tintin",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Update us please",
            "score": 50,
            "author": "Naturrensing25",
            "replies": []
        },
        {
            "level": 0,
            "comment": "The dude is built like the Musinex Booger and probably has the personality of it",
            "score": 14,
            "author": "ihateredditmodzz"
        },
        {
            "level": 0,
            "comment": "Why does the TSA seem to employ so many scumbags?",
            "score": 69,
            "author": "Theechoofme",
            "replies": [
                {
                    "level": 1,
                    "comment": "Because they are just wannabe cops.  So think of the worst cop you know of, and tsa is less pickey.",
                    "score": 45,
                    "author": "BethyW",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 14,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I worked with those dogs a lot during my time with tsa. They're all sweethearts. It's so hard to get into that program and I can't believe that after 3 years of waiting (what I saw a lot) he treats the dog like that.",
            "score": 11,
            "author": "bulb127"
        },
        {
            "level": 0,
            "comment": "Feel so sad for that pup. 😢",
            "score": 66,
            "author": "PoppaPelly",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I wanna rip that leash from his hand and take the bby home so bad",
            "score": 37,
            "author": "Gevvem",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Oh I’m definitely here for the update. Nothing about this is “training.” That dude probably hits that poor dog",
            "score": 39,
            "author": "Topaz_Scarab29",
            "replies": [
                {
                    "level": 1,
                    "comment": "Local news is reporting that he has been relieved of his duties.",
                    "score": 22,
                    "author": "FREESARCASM_plustax",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "All those steps in a day and dude still has a belly?",
            "score": 21,
            "author": "nick4tical",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm on my feet ALL day in a factory, I'm bigger than he is. No amount of exercise helps if you take in more calories than you burn.",
                    "score": 28,
                    "author": "DeylanQuel",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Truth. I have a cousin who fits that description \n\nBut like factory work will absolutely shred you if all you do is eat decently",
                            "score": 4,
                            "author": "truffleboffin"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Get him fired.",
            "score": 8,
            "author": "Parrotflies-"
        },
        {
            "level": 0,
            "comment": "Meal team six out here",
            "score": 8,
            "author": "OnlyMath"
        },
        {
            "level": 0,
            "comment": "Fire hiss ass. That’s ridiculous.",
            "score": 8,
            "author": "Missing_Space_Cadet"
        },
        {
            "level": 0,
            "comment": "Apparently a Detroit news station just posted an article that the TSA are looking into it and that they don't condone what he is doing.",
            "score": 8,
            "author": "milescaswell"
        },
        {
            "level": 0,
            "comment": "That poor dog keeps looking at him for instructions but instead he’s just getting thrown around by his neck. Dude needs to be fired for abuse.",
            "score": 9,
            "author": "Jazzlike-Ad2199"
        },
        {
            "level": 0,
            "comment": "Abuse to animals has a strong correlation to psychopathic tendencies.",
            "score": 27,
            "author": "downloweast",
            "replies": []
        },
        {
            "level": 0,
            "comment": "A friend of ours has 3 GSPs and they’re all the sweetest dogs, amazing with other dogs and even kids. I hate to see dogs with such a naturally sweet disposition treated like this.",
            "score": 36,
            "author": "FZ-09Fazer",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 37,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "He Shouldn’t be allowed anywhere near a dog",
            "score": 5,
            "author": "Grizzled222"
        },
        {
            "level": 0,
            "comment": "please someone ID the fucker and report him",
            "score": 5,
            "author": "plzdntbanbro"
        },
        {
            "level": 0,
            "comment": "I’m not from America but if I saw that I’m recording it, then confronting him whilst still recording. Is animal cruelty like that a crime in America? Dude needs arrested never mind fired.",
            "score": 6,
            "author": "Fresh-Honeydew7104"
        },
        {
            "level": 0,
            "comment": "He’s a fucking cop, what do you expect. Only 40% of their wives don’t get beaten.",
            "score": 5,
            "author": "Ok-Housing1458",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This guy needs to lose his job as an animal handler immediately.",
            "score": 5,
            "author": "Cheensly"
        }
    ]
}