{
    "id": "13cunxi",
    "score": 3550,
    "title": "Louisiana man shoots girl in the head for playing hide and seek in his yard.",
    "author": "moby323",
    "date": 1683645086.0,
    "url": "https://www.reddit.com/r/iamatotalpieceofshit/comments/13cunxi",
    "media_urls": [
        "https://i.imgur.com/AQkubkB.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\nPlease note that we will ban you if a post or comment breaks any of our rules. **Be especially mindful of the following**:\n\n**Rule 1: Do not post or ask for identifying information, including first and last names and social media usernames.** Public figures are **not** exempt. We remove all external links to prevent accidental posting of identifying information.\n\n**Rule 2: Do not post violent comments, and do not glorify violence, per TOS.** We can't take responsibility for how angry a post makes you, you need to do that. Telling us \"it was a joke bro\" is not an excuse.\n\n**Rule 7: Do not link to or post screenshots of reddit posts, reddit comments, reddit personal messages, reddit profiles, etc.** We cannot allow you to use this subreddit to harass other people on reddit. \n\n**Rule 8: No bigotry, no racism or race baiting.** It is hard to believe that we even need a rule like this. \n\n**Our rules are zero tolerance. You will be banned for breaking them.**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/iamatotalpieceofshit) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "“Kids need to play outside more”",
            "score": 928,
            "author": "_ilovelamp_",
            "replies": [
                {
                    "level": 1,
                    "comment": "Shoulda picked a better hiding spot",
                    "score": 150,
                    "author": "Phantomcelestialdex",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Redditors when an actual fucking child is murdered in cold blood",
                            "score": 14,
                            "author": "slademore44",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "She's not dead..",
                                    "score": 4,
                                    "author": "Simple-Industry2869"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I'm fucking going to hell.... take your upvote and go",
                            "score": 40,
                            "author": "Slikrain"
                        },
                        {
                            "level": 2,
                            "comment": "Where is this from?? I can hear it, I remember the tone, but I can't remember the *context* and it's driving me insane",
                            "score": 2,
                            "author": "ChocoBananza"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I had a neighbor point a rifle at me and threaten to shoot me in the face when I was 10 years old for sneaking into his yard to pet his friendly hunting hounds. It was incredibly stupid of me but damn I was a kid and liked puppies. It makes me so sad that kids are actually dying like this. It’s sickening.",
            "score": 405,
            "author": "embarrassmyself",
            "replies": [
                {
                    "level": 1,
                    "comment": "My neighbor was walking past my yard, and my dog was outside with my young daughter. The dog barked at the man, *from inside our fenced yard.* Neighbor pulls out a pistol and tells my 14-year-old daughter that if the dog moves before he walks on, he’ll shoot it. She was terrified. We called the cops, of course, and they said there was nothing they could do because he hadn’t hurt her or the dog.",
                    "score": 60,
                    "author": "mohugz",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wtf is wrong with American police systems 😭",
                            "score": 43,
                            "author": "OmniAeternalis_97",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "**Are you serious?**",
                                    "score": 8,
                                    "author": "LSARefugee",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I’d be strapped to the fucking roots of my hair and waiting on my porch for his next walk.",
                            "score": 18,
                            "author": "TheOGPotatoPredator",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "We live in a fairly rural area, just outside of a small college town. We’re on six acres, he owns 9 acres. It’s not like he didn’t have plenty of room…he also put up game cameras all over his property. Not for wildlife, but to catch anybody who trespassed on his land. He wears nothing but camouflage and always goes armed. He once called the cops on my kids (aged 14 and 10) for riding an ATV too close to the property line. They told my husband, “Don’t worry, your kids aren’t in trouble, we know this guy’s crazy.” This was before the pistol brandishing. \n\nLike, what would he have to do to actually get a response? Shoot a kid? I guess this is why we see these horrible crimes on the news…because the police can’t or won’t intervene until the crazy guy goes waaaayyy over the line.",
                                    "score": 14,
                                    "author": "mohugz"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "That still counts as assault with a deadly weapon. Should have mentioned he threatened your daughter and not the dog",
                            "score": 3,
                            "author": "Mindless-Ad-266"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Kids shouldn’t be trespassing but there’s no excuse for threatening to harm them for it, let alone actually harming them.",
                    "score": 118,
                    "author": "FlowerFaerie13",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Cop show logic, where shooting at the back of a fleeing purse grabber is acceptable, has a lot to answer for. There is a huge disconnect between the idea of \"punishments to fit a crime\" and \"stopping a crime with a gun\".",
                            "score": 50,
                            "author": "Shenko-wolf"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Kids shouldn’t be shot full stop. I live in the uk and I’m so glad I don’t deal with guns. The uk is pretty safe. Get a few mugging with knives but no where as bad as me worrying I might be shot by police or some random guy",
                    "score": 10,
                    "author": "Deedumsbun",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "2nd amedment doing gods work amiright or amiright ? \nThis comment was made by superior eu free healtcare and almost nonexistant school shooting gang.",
                    "score": 4,
                    "author": "finghz"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have a 6 year old daughter.  This makes me want to throw up imagining the child's poor parents.",
            "score": 91,
            "author": "astrongineer",
            "replies": [
                {
                    "level": 1,
                    "comment": "If some dude shot my Lil sister for playing in the yard, he wouldn't be making it to the police station al[redacted]ve",
                    "score": 37,
                    "author": "Imesseduponmyname",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I would make my life mission to make him pay for killing my daughter",
                            "score": 13,
                            "author": "Mooblegum"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "These old guys shooting at random people are all starting to look the same.",
            "score": 922,
            "author": "Shiloh77777",
            "replies": [
                {
                    "level": 1,
                    "comment": "For real. I legit thought it was the dude from NY that shot the girl that pulled into his driveway.",
                    "score": 197,
                    "author": "GruntFuck",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Don't forget the other psycho that shot a girl and her parents, a week, maybe two weeks ago? Fucking bizarre trend with these losers right now.",
                            "score": 145,
                            "author": "gothigy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Don’t forget the guy who shot the kid cause he was at the wrong house trying to pick up his brother",
                                    "score": 117,
                                    "author": "EyedLady",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "His two brothers? The twins?",
                                            "score": 22,
                                            "author": "GruntFuck"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Or the guy that shot the black kid that rang his bell mistakenly because he was black .   They basically are all the same dudes .     Angry , ignorant, aggrieved old white guys .      Ya know, our nations patriots.",
                            "score": 50,
                            "author": "Potential_Reading116",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "A kid rang a doorbell and the guys answer was to shoot him????? Either ask what he wants or call the police???v",
                                    "score": 2,
                                    "author": "Deedumsbun",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah. 16 year old black kid rang the bell thinking he was at the right house to pick up his brothers, dude claimed he was \"scared to death\" thinking the boy was trying to break in the house and shot him through the LOCKED glass door. The boy survived.",
                                            "score": 4,
                                            "author": "StrawberryPuree",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "He rang my doorbell and was standing there peacefully how was I supposed to know he wasn’t a threat? HE WAS EVEN SMILING MENACINGLY!",
                                                    "score": 4,
                                                    "author": "musicenjoyer25",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This dude is 58?! Rough!",
                    "score": 32,
                    "author": "saxwe",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Would have thought 69-70...",
                            "score": 13,
                            "author": "Jumpin-Jebus"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That’s because they are",
                    "score": 104,
                    "author": "thatonepingu",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Just missing a certain hat and flag in their pics.",
                            "score": 33,
                            "author": "FriedEggScrambled",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "they probably make them take off the hat before taking their mugshot",
                                    "score": 16,
                                    "author": "snack-dad"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Fox news viewers?\n\nThere's a very real problem with the extremism right wing pundits have pushed. This has been decades in the making, and here we are.",
                    "score": 31,
                    "author": "HealthyBox5",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not only extremism, but also blatant and ongoing fear mongering. Without excusing obviously malignant actions of people who ultimately have their own agency over themselves, news stations running exaggerated narratives of increasing crime rates in suburban areas while overrunning stories of specific fringe instances with unique circumstances while conveniently leaving out unique circumstances have driven people who already have certain biases and bigotries into paranoid-delusion levels of fear. These same news outlets do not offer any solutions but that's probably because the NRA or similar groups gives the network too much money for them to be suggesting the most obvious solution which is against their benefactor interests, and when you couple that with the increase in gun ownership during the pandemic (once again spurred by fear mongering, both in forms of pushing narratives of \"dangerous rioters\" to people living in urban communities who have likely never had to deal with a protest in their life, as well as fear built around the idea of strengthening gun control (which clearly never came) leading to more fema camp conspiracy bullshit and people with fomo simply wanting to buy a gun \"while they still can\") and this is the only natural conclusion to what has essentially been stochastic terrorism conducted by news outlets, with some particularly partisan outlets being far more guilty than others, though no hands are clean of blood here.",
                            "score": 15,
                            "author": "stevski11"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Same ignorant inbred genes",
                    "score": 5,
                    "author": "Wanna_Runn"
                },
                {
                    "level": 1,
                    "comment": "That only because beard, age, skin color, and obesity.",
                    "score": 7,
                    "author": "DontToewsMeBro2"
                },
                {
                    "level": 1,
                    "comment": "The good news is most of them will be dead soon",
                    "score": 3,
                    "author": "W4ingro1995",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah but how many people will they take with them?",
                            "score": 4,
                            "author": "Puzzled-Caterpillar4"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's almost like if there were patterns that give away some hints on how someone might behave.\n\nE.g. blue haired individuals are more prone to fit in the leftist woke category",
                    "score": -9,
                    "author": "Spidergollem"
                }
            ]
        },
        {
            "level": 0,
            "comment": "“You meddling kids”",
            "score": 61,
            "author": "z-BajaBlast",
            "replies": [
                {
                    "level": 1,
                    "comment": "I would have gotten away with it if the other six year old didn't get away",
                    "score": 23,
                    "author": "Mrfroggyleggs101"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I remember in the summer all the kids in the neighborhood would play Manhunt at night. We’d be in people’s yards, bushes, trees, under their decks… sometimes we’d even play in bigger neighborhoods with other kids and no idea whose yards we were in. Nobody every even yelled at us, nvm shot at us. \n\nThis was like the noughties … not even 1950. What happened?",
            "score": 252,
            "author": "kalemeh8",
            "replies": [
                {
                    "level": 1,
                    "comment": "I grew up in the 90s. This was legit. \"Don't come home til the street lights come on.\" And even then, we probably wouldn't. Our parents had no idea where we were, but we were never in fear for our lives",
                    "score": 87,
                    "author": "dengar_hennessy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I distinctly remember getting locked out of the house on the weekends as a kid. \"Go play outside! Come home when the streetlights come on!\" Get thirsty? There's the hose! Gotta pee? Go in the bushes! \n\nI remember wandering the neighborhood a lot as a kid but never felt like there was much danger in doing that.",
                            "score": 41,
                            "author": "TranscendentalRug"
                        },
                        {
                            "level": 2,
                            "comment": "Nostalgia! It makes me really sad to think those are memories of a bygone culture/society. I know not every kid grew up like this but, now I feel like none do.",
                            "score": 14,
                            "author": "kalemeh8",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "It was 10pm and our parents didn’t know where we were.",
                            "score": 2,
                            "author": "Emergency-Practice37"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I used to play a game called yard hopping where we just ran in a straight line through a few blocks worth of back yards. I think we got yelled at one time.",
                    "score": 46,
                    "author": "cant_pass_CAPTCHA"
                },
                {
                    "level": 1,
                    "comment": "I grew up in the early 2000s and wandered all over my city, sometimes even at night. I never felt the slightest hint of danger or had any threatening interactions.",
                    "score": 8,
                    "author": "FlowerFaerie13"
                },
                {
                    "level": 1,
                    "comment": "Same. Usually some of the more athletic and probably a bit drunk dads would even join in. Got chased up a tree by a neighborhood “Florida man” but it was hilariously fun.",
                    "score": 4,
                    "author": "Kunundrum85"
                },
                {
                    "level": 1,
                    "comment": "Media is exclusively targeting the stupid right now. They are making them angry. Weaponizing them against those that threaten billion dollar corporations. America will implode in a civil war before this people give their guns up.",
                    "score": 32,
                    "author": "IRoyalClown",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Same, I grew up in Houston, Tx, where many in the city would call a “rough” neighborhood. We would play until the streets came on, wander around downtown and take the bus back home. Now I can’t even think about what would happen to kids if they did this now. Shits fucked all the way around.",
                    "score": 2,
                    "author": "Devidevilman"
                },
                {
                    "level": 1,
                    "comment": "Covid along with lack of good mental health and medical care.",
                    "score": 3,
                    "author": "SurfingOverConcrete"
                }
            ]
        },
        {
            "level": 0,
            "comment": "From dealing with hundreds of these kinds of guys, who make guns their personality, I can tell you this. They are ALL itching for someone to give them a reason to draw their fucking weapon. They fantasize and make up scenarios where they get to shoot someone and end up the hero.\n\nI've had the same action hero, defending myself/property fantasy story told to me by so many different people. It's always the same.",
            "score": 348,
            "author": "spectac-1",
            "replies": [
                {
                    "level": 1,
                    "comment": "My Nextdoor is full of them. If my son wants to play outside, we go to the neighborhood park. There are too many itchy trigger fingers to risk him going too close to the wrong house to get a runaway ball.",
                    "score": 11,
                    "author": "SilentSerel"
                },
                {
                    "level": 1,
                    "comment": "I know tons. Its scary.",
                    "score": 62,
                    "author": "PoppaDaClutch"
                },
                {
                    "level": 1,
                    "comment": "Yup, I worked several jobs between HS and college and by far I got bitched at the most by old white guys at Cabela’s.",
                    "score": 14,
                    "author": "markymark1324"
                },
                {
                    "level": 1,
                    "comment": "Like that guy who got away with shooting some dude who threw a bucket of popcorn at him.",
                    "score": 19,
                    "author": "rdldr1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It was a retired pig and they were able to prove the shooting victim had touched or pushed this 'poor, old guy'.",
                            "score": 3,
                            "author": "Scrat_66"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Pretty sure most people have those fantasy warrior day dreams but significantly less people want to commit to it in anyway.",
                    "score": 35,
                    "author": "jankyspankybank",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "We call them intrusive thoughts they call it Monday",
                            "score": 29,
                            "author": "DarkCosmosDragon"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Not trying to sound hard but I'd pull this guy's organs out of his body while he watched and then broadcast it on as many media sites as I could as a lesson to others if that was my daughter. I wouldn't wanna live after losing a child like that.",
                    "score": 3,
                    "author": "hopefulworldview",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Everyone has that kind of daydream. It’s engrained in our culture to want to be the action hero. \n\nThe problem is when people can no longer differentiate between reality and fiction. The reason all of these dudes who are shooting children and people ringing doorbells look alike is because QAnon, the far right, and media sources have been cramming the idea that they’re under attack down their throats and ramping up ideology and hatred for the last eight years. When you get sucked into all the conspiracy crap these groups spout you’re an insider, a warrior, and you’re the only one who can identify the deep state and the people trying to replace you (IE anyone who isn’t white and on your side). Which scares you, which causes you to view everyone and everything with suspicion, which means guns and shooting anything that moves",
                    "score": 18,
                    "author": "One-Permission-1811",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This. My best friend starting telling me that the Earth is flat. I laughed because I thought he was joking. But, he legit was pissed that he “was being lied to”. I asked him “who’s lying to you”, and his response was basically the illuminati and the government.\n\nBut, what’s funny is, when you start asking the right questions, their story unravels before their own eyes.\nWhich was my follow-up “Let’s pretend you’re right. What are any of these people gaining by making you believe the world is round?”\n\nHe only listened because he’s my best friend. It’s just crazy how angry he would get over something so ridiculous.",
                            "score": 9,
                            "author": "IH4v3Nothing2Say"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Don't get me wrong, I don't like having kids playing on my property either. But, as a sane person, I simply ask them \"hey, can you not play on my property? Thank you\", not fucking shoot them",
            "score": 31,
            "author": "Niskara"
        },
        {
            "level": 0,
            "comment": "I mean, if he was really in fear, he could have just locked his doors, call 911, and have the cops shoot her instead",
            "score": 58,
            "author": "Jomega6",
            "replies": [
                {
                    "level": 1,
                    "comment": "Riiiight ?!   But then that’s not nearly as much fun.",
                    "score": 10,
                    "author": "FickleSpend2133"
                },
                {
                    "level": 1,
                    "comment": "\"Leaving the door closed and locked\" is the correct response in 99% of these alleged \"self defence\" scenarios. The problem is that this doesn't allow you to be the action hero of your own movie that years of immersion in gun culture demands.",
                    "score": 2,
                    "author": "Shenko-wolf"
                },
                {
                    "level": 1,
                    "comment": "Or fired a warning shot, in the air. 🤷",
                    "score": -13,
                    "author": "ManicPotato5150",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yea so the bullet can come back down and hit someone or go through someone's roof",
                            "score": 16,
                            "author": "chknbone4u",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Apparently the girl was running away when he fired",
                            "score": 8,
                            "author": "Dustyage",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes, it's all over the news here in Louisiana. This State sux! Can't even drive on the interstate without people shooting at your cars here. Now those damn airguns they have are out of control. My brother in-law was walking around our neighborhood, exercising, right before school time and a car passed, on their way to high school, and shot at him. A few hit him in the back. I'm sure it's bad everywhere, but here in Baton Rouge, you chance your life, going to a Dr appointment, shopping, driving on the interstate etc. This entire world is going to crap",
                                    "score": 2,
                                    "author": "ManicPotato5150",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yeah, but then the threat would have gotten away, and you might accidentally hit something important, like your favorite lamp post from a block away",
                            "score": 12,
                            "author": "Jomega6",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Another proof that guns are just some kind of toys for psychos like that guy, itching to pull the trigger for any dumb reason. It was never about protection.",
            "score": 14,
            "author": "Foreign_Emphasis_470"
        },
        {
            "level": 0,
            "comment": "Another old white guy shooting an innocent person because they felt like it?",
            "score": 238,
            "author": "HG21Reaper",
            "replies": [
                {
                    "level": 1,
                    "comment": "He will probably claim he was in fear for his life.",
                    "score": 122,
                    "author": "Go_Gators_4Ever",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "“I was threatened”",
                            "score": 54,
                            "author": "Gravastarlol3",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "\"The Civil War came to my doorstep.\"",
                                    "score": 21,
                                    "author": "rdldr1",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "\"She had a crazed look in her eye!\"",
                                            "score": 14,
                                            "author": "AshamedofMyFarts",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "“They were yelling and doing Antifa signals”",
                                                    "score": 11,
                                                    "author": "rdldr1",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "And that’s why we have “ stand your ground laws “       If you don’t get this is sarcasm then maybe Reddit isn’t for you.                         For instance u/similar whatever has no understanding of the sarcasm concept",
                                                            "score": 1,
                                                            "author": "Potential_Reading116",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "We will watch your career with great interest.",
                                                                    "score": 3,
                                                                    "author": "rdldr1"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Have you seen what 6 year old kids can do if left alone?  I would be afraid too /s\n\nSARCASM.  \n\nSeriously, if a kid is running away, why even shoot?\n\nIf kid, in general, why shoot?\n\nJust...why shoot?  No way he could of felt threatened by a 6 year old",
                            "score": 19,
                            "author": "LittleTay",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "could have felt threatened",
                                    "score": -1,
                                    "author": "TheEarthIsFlatnt",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm pretty sure a 6 year old is small enough to punt.",
                                            "score": 2,
                                            "author": "FixedKarma",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "These kinds of people are actively looking for a reason to shoot someone",
                    "score": 28,
                    "author": "IMBadAtUserNames77"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": -26,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "These people are racists, they bring race into everything. But only against one side, of course.",
                            "score": -13,
                            "author": "the_nightslasher"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s okay!! She might have had a concealed carry!! \n\nThe solution to this is obvious: more guns.",
            "score": 19,
            "author": "BlackKnight6660",
            "replies": [
                {
                    "level": 1,
                    "comment": "I mean, just get your kid that brand new JR-15 (somehow an actual thing), so they can defend themselves from bad people with guns!",
                    "score": 3,
                    "author": "JoshZeKiller"
                }
            ]
        },
        {
            "level": 0,
            "comment": "All these tactical timmies look the same",
            "score": 43,
            "author": "Rotogen",
            "replies": [
                {
                    "level": 1,
                    "comment": "Tactical timmies🤣 love this and will using this from now on. Ty",
                    "score": 6,
                    "author": "thefistiecuffs"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is this the weather guy that was threatening to shoot kids for ringing his doorbell?",
            "score": 8,
            "author": "Jomega6"
        },
        {
            "level": 0,
            "comment": "First off teach people to stay off other peoples property because of people like this and second I hope this guy gets the whole ass book thrown at him.",
            "score": 174,
            "author": "thatonepingu",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s sad that this has to be the case. No where is safe in America anymore, and I dream of the day that we can move forward through life without being required to teach potential victims how to not be victims",
                    "score": 74,
                    "author": "DameonRaye",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I agree completely",
                            "score": 16,
                            "author": "thatonepingu"
                        },
                        {
                            "level": 2,
                            "comment": "Agreed, its dumb that people think it’s justifiable to shoot someone for simply being on your property.\n\nI can understand self defence if someone is actively trying to break into your house, or if you are outside and they are charging at you.\n\nBut fucking kids running around hiding behind trees, someone walking up to your door to ring your doorbell, someone pulling up on your driveway, are in no way even close to justified and its insane that people are okay with it.",
                            "score": 20,
                            "author": "Wajina_Sloth"
                        },
                        {
                            "level": 2,
                            "comment": "&gt;No where is safe in America anymore,\n\nHasn't been for 23 years",
                            "score": 9,
                            "author": "MediocreDungeonMastr"
                        },
                        {
                            "level": 2,
                            "comment": "Lol it was never safe here. I hate when people say “anymore” like this country was ever a safe haven",
                            "score": -5,
                            "author": "cbreezy456"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "First off don't shoot kids... secondly maybe teach the kids to stay away from the crazies of the neighborhood",
                    "score": 16,
                    "author": "cant_pass_CAPTCHA",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Obviously don’t shoot anyone. Kids aren’t special. Just don’t hurt anyone.",
                            "score": 9,
                            "author": "thatonepingu",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Kids are special though.  They're innocent and need protecting.",
                                    "score": 4,
                                    "author": "astrongineer",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "No? They are human like the rest of us. Nobody should be harmed",
                                            "score": 10,
                                            "author": "thatonepingu"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You just popped out the vagina fully grown, hih?",
                    "score": -83,
                    "author": "Alittlemoorecheese",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What does that even mean? I said the kid isn’t at fault.",
                            "score": 42,
                            "author": "thatonepingu"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "this is getting ridicules",
            "score": 33,
            "author": "aintshockedbyyou"
        },
        {
            "level": 0,
            "comment": "I bet he has posted why don't kids play outside anymore on a bunch of boomer Facebook groups too",
            "score": 30,
            "author": "A-Sentient-Beard"
        },
        {
            "level": 0,
            "comment": "Perfect. Another good guy with a gun.",
            "score": 15,
            "author": "Some-Resist-5813"
        },
        {
            "level": 0,
            "comment": "And this, my dear Americans, is the Reason, why most Western Countrys won't allow everyone to own a Gun. You simply can't trust average People with that.",
            "score": 19,
            "author": "Hefty-Window-1003"
        },
        {
            "level": 0,
            "comment": "I once hid from my mom because I felt like it in the neighbour's yard, I was found by my neighbor and told to go home because my mom was yelling for me, which I promptly did. No anger at being on their property or anything just \"your mom is looking for you.\"\n\nThat's how that should be handled, not with a bullet but with fucking words, the prevalence of guns in America is a plague on that nation.",
            "score": 5,
            "author": "FixedKarma"
        },
        {
            "level": 0,
            "comment": "USA 🇺🇲 USA 🇺🇲 USA 🇺🇲",
            "score": 96,
            "author": "KingKongoguy",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's amazing what a primitive, uncivilized place it is, isn't it?",
                    "score": 1,
                    "author": "MrSoul4470"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Unless I'm wrong didn't this same man shoot some other people for the same reason of them being near his home???",
            "score": 4,
            "author": "Psyren98",
            "replies": [
                {
                    "level": 1,
                    "comment": "~~Nah, they all look the same~~ well actually idk, probably not, but they still all look the same",
                    "score": 3,
                    "author": "Imesseduponmyname"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Home of the brave",
            "score": 6,
            "author": "HymanisMyMan"
        },
        {
            "level": 0,
            "comment": "Looks like she thought she lived in a place of freedom.",
            "score": 32,
            "author": "Amehvafan",
            "replies": []
        },
        {
            "level": 0,
            "comment": "America needs their guns y'all. What a joke of a country.",
            "score": 74,
            "author": "Leland_Gaunt87",
            "replies": [
                {
                    "level": 1,
                    "comment": "It seems that they shoot children just for sport",
                    "score": 27,
                    "author": "Long-Significance871",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The smaller they are, the harder it is to hit. Hunting normal humans is boring.",
                            "score": 9,
                            "author": "Personal-Bowl7522",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Fear is the American culture. Something similar will probably happen again this week or next. I’m confident the only thing that’ll change America is WW3",
            "score": 22,
            "author": "foreignkingx",
            "replies": [
                {
                    "level": 1,
                    "comment": "Your absolutely right, fear is everywhere in America. Media, politics, neighborhoods, schools , public spaces.. .fear is literally everywhere.. :( America's too split and hating/fearing itself  to come together and actually make solutions as a united country.",
                    "score": 8,
                    "author": "eve-nlie0LE15"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wait the guy who shot the jogger is out of prison?",
            "score": 3,
            "author": "Single_Raspberry9539"
        },
        {
            "level": 0,
            "comment": "Maximum sentence for this POS please",
            "score": 3,
            "author": "HistoryBuffLakeland"
        },
        {
            "level": 0,
            "comment": "He's definitely pro-life.",
            "score": 3,
            "author": "edogfu"
        },
        {
            "level": 0,
            "comment": "She was hiding something",
            "score": 22,
            "author": "VR_Neewb"
        },
        {
            "level": 0,
            "comment": "And people still think gun control isn’t a problem where it is? These fucking psychos who don’t understand when guns are appropriate get to have them, and so many people still don’t see the issue.",
            "score": 5,
            "author": "Gl0bophobia"
        },
        {
            "level": 0,
            "comment": "clearly she wasnt hidden well enough",
            "score": 11,
            "author": "PLANT_NATIVE_TREES",
            "replies": [
                {
                    "level": 1,
                    "comment": "I bet the man cheated and didn’t count to ten tho",
                    "score": -8,
                    "author": "Jomega6",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lmao how did your joke get blasted but the other one didn't? 😂",
                            "score": 3,
                            "author": "Imesseduponmyname",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I must’ve pulled the short straw lol… either that, or this sub is full of people who cheat during hide-and-seek smh",
                                    "score": 2,
                                    "author": "Jomega6"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Having fun?! Not on my watch!",
            "score": 2,
            "author": "Ok-Tune2152"
        },
        {
            "level": 0,
            "comment": "Queue “the price of freedom” mantra about guns",
            "score": 2,
            "author": "possible_bot"
        },
        {
            "level": 0,
            "comment": "Takes \"get off my lawn\" to a whole new extreme",
            "score": 2,
            "author": "Lazy_Elevator4606"
        },
        {
            "level": 0,
            "comment": "So… murder.",
            "score": 2,
            "author": "I_say_upliftingstuff"
        },
        {
            "level": 0,
            "comment": "Those dang trans people shooting kids, amirite?",
            "score": 2,
            "author": "KlockB"
        },
        {
            "level": 0,
            "comment": "Just think about the fact that there are people whose first thought after reading such a headline is \"she shouldnt have been trespassing then\".",
            "score": 2,
            "author": "RomanvanZon"
        },
        {
            "level": 0,
            "comment": "No one cares. His rights are more important than someone's life. That line was drawn in the sand years ago.",
            "score": 4,
            "author": "Ausramm"
        },
        {
            "level": 0,
            "comment": "America, isn’t it great!! /s just in case.",
            "score": 8,
            "author": "Browneyedgirl63"
        },
        {
            "level": 0,
            "comment": "You guys really need to make gun harder to own. No way to get risk of guns, that is next to imposible, but it still easy to own a gun in the US today, no matter how much shooting, how many nut job prove that certain people shouldn't have gun, US law is still the exactly the same, no change in the system. You though they gonna make change the moment a kid got hurt, not dead :HURT. I dont know how many developed country other than US where you could get shot for walking on the street.",
            "score": 2,
            "author": "badstone69"
        },
        {
            "level": 0,
            "comment": "Guns make us safer 🇺🇲🇺🇲🦅🦅🔫🔫\nWe stand against tyranny with our god given rights 🇺🇲🇺🇲🦅🦅🔫🔫",
            "score": 2,
            "author": "Puzzleheaded-Way7745"
        },
        {
            "level": 0,
            "comment": "To the people coming here saying \"typical America\" and \"get rid of guns you idiots.\" Let me ask you something.\n\nWhat was stopping this man from grabbing a knife a slitting this poor girl's throat? Bashing her head in with a brick. This isn't a gun problem. This is a disconnection with our humanity. When you see nothing but fear being preached from everywhere you lose your value for human life. Stop giving in to the fear that guns are the problem and look in the mirror and realize it's the people that are the problem.",
            "score": -133,
            "author": "AzraelChaosEater",
            "replies": [
                {
                    "level": 1,
                    "comment": "“Well if they’re going to kill kids anyway, might as well make it easier for them!”\n\nI get what you’re trying to say here, but it doesn’t work that way.  Crime happens more often when the means of doing so are easier and more convenient.  A good guy with a gun can’t unkill a child.",
                    "score": 10,
                    "author": "Jomega6"
                },
                {
                    "level": 1,
                    "comment": "So if it's the people who are the problem, why let them have something as lethal as a gun? You can't even trust them with a knife.",
                    "score": 79,
                    "author": "InsomniaSpecial",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Poor enforcement is how",
                            "score": 6,
                            "author": "Parsnip_Forsaken"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "There's a huge difference between shooting at a small figure with pigtails in the distance at night versus holding a child in a bruising grip and then bashing their head in with a brick while staring into their eyes. \n\nAre people the problem? Absolutely. But why do they have access to weapons with such murder potential? \n\nAs an example: a kid at my brother's school wanted to kill his bully. He stabbed the boy in the throat with a pen. The kid lived. He had researched how to get his hands on guns in Germany, made a plan of action, list of bullies to punish and tried to get into the local shooting club's security safe the day before according to CCTV footage. He could not gain access to a firearm so he decided to do it with a pen. That kid would have shot up the school, but because there is no access to guns he only stabbed one kid.\n\nSee the difference that guns make?",
                    "score": 47,
                    "author": "Merileopardi"
                },
                {
                    "level": 1,
                    "comment": "What’s stopping him from slitting a girls throat is that’s it’s a visceral act. These garbage bags who shoot children ringing their doorbell or playing in their lawn are cowards with an inflated sense of superiority (because of the guns). If he had to chase down his victims there wouldn’t be any.\n\nYou’re right that it’s a disconnect from humanity, I would argue however that it’s reinforced by the fact that he didn’t have to get near anybody to take their life. If he had used a brick or a knife to kill someone we wouldn’t ban bricks or knives, but the thing is…bricks and (most) knives weren’t invented as a way to kill something. Firearms were literally invented for the exact purpose he used it for. Why don’t we start by limiting or taking away his access to that kind of power (like every other country on the planet)?",
                    "score": 26,
                    "author": "randomfunnythings"
                },
                {
                    "level": 1,
                    "comment": "“People gonna be crazy anyway, might as well make it easy for them to kill others.”\n\nThat’s your argument rephrased.",
                    "score": 31,
                    "author": "Molenium"
                },
                {
                    "level": 1,
                    "comment": "What an inane take. The stats on deaths by gunfire in the USA should be *continuously* embarrassing to you. \n\nThe mindset that it’s the person, not the tool, is a convenient way to avoid responsibility to do anything about it. \n\nUtter moral cowardice.",
                    "score": 8,
                    "author": "dkromd30"
                },
                {
                    "level": 1,
                    "comment": "This was by far the worst gun argument I’ve seen in awhile. You gotta be joking.",
                    "score": 20,
                    "author": "foreignkingx"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": -7,
            "author": "[deleted]",
            "replies": []
        }
    ]
}