{
    "id": "dhfmlq",
    "score": 124525,
    "title": "Last night a complete piece of shit burned down my friends racing pigeon loft. There were almost 2000 racing pigeons in there that were being prepared for the final race tomorrow. 4 dogs also lost their lives.",
    "author": "FantasyFlyer3",
    "date": 1570996653.0,
    "url": "https://www.reddit.com/r/iamatotalpieceofshit/comments/dhfmlq",
    "media_urls": [
        "https://imgur.com/uST2M8H"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "**Reminder: Do not ask for personal information, suggest someone should be doxxed, link to or comment with personal information, openly solicit personal information, or contact the people featured here. Don't even wax poetic about wanting to post identifying information. You will be banned.**\n\n**Do not encourage, glorify, or incite violence.**\n\nFor example: \"Kill yourself\", \"It wouldn't be so bad if we killed all the pedophiles\", \"This guy needs to die\", \"I hope this guy gets stabbed to death with a rusty screwdriver\", etc.\n\n**ALL PERSONALLY IDENTIFYING INFORMATION MUST BE CENSORED.**\n\nFailure to follow the rules of this sub will result in a permanent ban.\n      \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/iamatotalpieceofshit) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Burning racing animals alive the day before a big race.  \n\nMy suggestion is to share this story with local media outlets.  This has the makings of a \"whodunnit\" that'll get people talking.  Someone knows something, and maybe if it makes the news the police will get a few tips.",
            "score": 12017,
            "author": "PinkPearMartini",
            "replies": [
                {
                    "level": 1,
                    "comment": "Start with the winners of tomorrow's race.",
                    "score": 4155,
                    "author": "chrisrobweeks",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A real life Inspector Crouseau!",
                            "score": 1280,
                            "author": "Studdabaker",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Start with the closest neighbor who has a tree branch over the driveway.",
                                    "score": 507,
                                    "author": "sungoddaily",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "A good investigation would pursue both possibilities.",
                                            "score": 81,
                                            "author": "NiceSuggestion",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Took me a second.... yes",
                                            "score": 13,
                                            "author": "[deleted]"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I think you mean Clouseau. Or is this another Berenstein/Berenstain situation?",
                                    "score": 112,
                                    "author": "OraDr8",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Not even funny i had to go imdb it to make sure it hadnt switched",
                                            "score": 34,
                                            "author": "Got2Go"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "You're thinking of Jacques Clouseau, the oceanographer",
                                            "score": 9,
                                            "author": "OldWolf2",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "No, that's \"Cousteau.\" You're thinking of Jean Cocteau.",
                                                    "score": 11,
                                                    "author": "elgarraz"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I would like to buy a Dyamburger.",
                                    "score": 6,
                                    "author": "ShoMeUrNoobs"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Also angry neighbors. My dad used to keep racing pigeons and it started feuds with one or two neighbors who complained about pigeons shitting on their roof. One neighbor shot a few dead. The feud went on for years.",
                            "score": 114,
                            "author": "mcpickledick",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Out of curiosity, what did your dad tell them? Did he offer to clean their roofs? Or did he tell them “tough shit”? (No pun intended)\n\nNot that it justifies shooting them (or burning down a barn for that matter), but I can certainly understand why one’d be pissed; I’d probably be furious... not sure what the law is for this sort of thing, maybe your dad had every right to raise birds and have them shit all over the neighbors houses, but not sure you could call this a feud, especially if it went on for years with zero recourse",
                                    "score": 51,
                                    "author": "N64-4Life",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I live in a house on Earth. That house has a roof. Birds shit on my roof all the time... Who gives a fuck? That's why you have a roof... So the birds don't shit on your head.",
                                            "score": 70,
                                            "author": "Slummish",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Unless you live in an area where you are supposed to keep your garden and roofs reasonably clean. People can be fined for not keeping up with their garden and houses. If someone raises a ton of pigeons that forces a home owner to have it cleaned a lot more often than they would have if their neighbor did not raised birds, well, I can see the resentment.",
                                                    "score": 30,
                                                    "author": "Hekantis",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "People who raise pigeons don't let millions of pigeons just fly around a neighborhood all at once all of the time... They live in hutches and when ONE is released at a time, it flies away. They don't circle your neighbors' homes and shit on them.",
                                                            "score": 32,
                                                            "author": "Slummish",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Depends on how you keep them though. My bro has around 20 and they are let out all together some days and sit on the garage for a while before coming in again. Thats 20 birds pooping on that roof. I can get why a neighbor would rather not to have that happen to their roof. I probably don't have to point out that those birds aren't winning any awards either but its a fun hobby non the less. In my neighborhood is straight out forbidden to keep \"outdoor birds\" or even feed the wild ones.",
                                                                    "score": 13,
                                                                    "author": "Hekantis",
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "If you have 2000 birds they are not being released one at a time. And if they are for racing they dont sit in hutches all day long, they need practice and exercise.",
                                                                    "score": 6,
                                                                    "author": "meripor2",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Or the BMW dealership next door",
                            "score": 44,
                            "author": "63426",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Or the guys in trenchcoats and fedoras, who placed a huge bet on the winner",
                            "score": 7,
                            "author": "pease_pudding"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Post it on 4chan and they'll hunt down whoever did it within weeks lmao",
                    "score": 30,
                    "author": "RiotIsBored"
                },
                {
                    "level": 1,
                    "comment": "I sense a game of CLUE coming on.",
                    "score": 73,
                    "author": "frigginnathan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m getting a clue. Oh yeah a big old throbbing clue is coming I can feel it.",
                            "score": 41,
                            "author": "wwbrettww",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh wow, now you're giving me a clue",
                                    "score": 15,
                                    "author": "memy02",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm getting a *raging* clue right now..",
                                            "score": 8,
                                            "author": "DragonflyGrrl"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Well, we know 2/3 things. It was someone in the pigeon loft with the fire.",
                            "score": 12,
                            "author": "TaylorSA93",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "No Palomine",
                    "score": 45,
                    "author": "keto401",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Big brain time",
                    "score": 364,
                    "author": "PM_ME_FISH_PIC",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": ".... and the name of podcast will be called “The Fowl Fire”. Let’s get someone from This American Life down there!",
                    "score": 10,
                    "author": "_Gin_And_Jews_",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is there alot of money to be won or lost in the world of racing pigeons? ( not being sarcastic, just didnt know there was such a thing )",
            "score": 7575,
            "author": "xxrambo45xx",
            "replies": [
                {
                    "level": 1,
                    "comment": "According to a newspaper article that was posted further down this was what is called a “one loft race“. This guy’s friend didn’t own all 2 thousand pigeons. He actually raises pigeons as babies and trains them to race back to this loft. \n\nPigeon fancier’s/racers from all over the country or the world send this guy baby pigeons from their best breeding stock. And then this individual raises them till race day.￼ He starts out flying them 25 miles away for a couple weeks and 50 miles away for a couple weeks and then 100 miles away, etc. etc. (I don’t know the exact distance is but something like that). He posts the times and how all the pigeons are doing on his website and the owners can see how everything is going. People lose birds during training, some guys don’t even make it to the race day because the babies don’t come back from the  training flights. ( ever been to New York City, or any big city, and see pigeons everywhere and a few of them have bands around their legs. Those might be racing pigeons that didn’t make their way back to the loft and decided to slum it up in the city) ￼It’s really neat how this works. \n\nWhen this ￼guy said his friend makes his livelihood from this he wasn’t kidding. This is a full-time job. This guy has been raising and training those pigeons for, most likely, months.￼ Very sad for everyone involved.",
                    "score": 590,
                    "author": "Naptownfellow",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wait, so you’re saying even pigeons will leave everything behind and try to make it in the Big Apple? Wow.",
                            "score": 155,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And like all wide eyed midwesterners of the last decade they wind up on a Brooklyn rooftop confused as to why they’re following the instructions of a strange puerto rican man who keeps feeding them powder.\n\nSource: lived in a building surrounded by buildings that had pigeon coops and coke heads from Ohio.",
                                    "score": 42,
                                    "author": "Convergecult15"
                                },
                                {
                                    "level": 3,
                                    "comment": "If you can make it there or you can make it anywhere",
                                    "score": 28,
                                    "author": "Naptownfellow",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The only time I’ve ever seen a racing pigeon up close, my youngest was out drawing with chalk in the driveway, it was right around sunset. \n\nThis pigeon landed and walked right up to him which scared him a little. We noticed it had a band on its leg. So we set up a little box with a towel in it and the pigeon laid there overnight and then left in the morning.",
                            "score": 13,
                            "author": "ChippyVonMaker",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Chances are it was tired and needed to rest. It wasn’t scared of people and you were the first “people” it came across. He probably flew home(to the coop) the next day. \n\nMy old boss was super into this. He did one loft races all the time. He even won a pickup truck. That’s why I know a fair amount. He talked about it non stop. Bird show up 2-3 days later sometimes. Not exactly good racers if they do that. If you look at the history of racing pigeons they saved tons of lives in the war. They used them for communication. I’ll see if I can find the link. One got his leg shot off and even got a medal.\n\nEdit:\nHere is one. Not the one that was shot though. \n\nhttps://www.worldwar1centennial.org/index.php/communicate/press-media/wwi-centennial-news/1210-cher-ami-the-pigeon-that-saved-the-lost-battalion.html\n\n\nEdit 2\n\nIt was Cheri Ami \n\nHere is a great article. https://www.telegraph.co.uk/history/world-war-one/10566025/Honoured-the-WW1-pigeons-who-earned-their-wings.html",
                                    "score": 4,
                                    "author": "Naptownfellow",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Big races cost big money to enter but the payouts are big too. Tomorrows race was supposed to pay the winner $500k",
                    "score": 8791,
                    "author": "FantasyFlyer3",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "With that money at stake I'd vote sabotage",
                            "score": 7286,
                            "author": "xxrambo45xx",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Seems obviously so. If not, it's one hell of coincidence.",
                                    "score": 3603,
                                    "author": "socellatus",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 3657,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Getting downvotes for the truth.",
                                                    "score": 1136,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 972,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "PETA bots. Nobody actually supports peta anymore. I honestly don’t even know how they still function.",
                                                                    "score": 585,
                                                                    "author": "intoxicated-browsing",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "PETA's latest 990s show they're still receiving millions of dollars every year in donations, so it seems they do actually have quite a bit of support.",
                                                                            "score": 277,
                                                                            "author": "oxidadapanda",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "That could be like five rich people.",
                                                                                    "score": 322,
                                                                                    "author": "technofederalist",
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "They’re a name that’s floating around that’s associated with animal rights. If someone wants to help some animals, but doesn’t want to put in the effort of finding a decent organization, PETA is an easy one to write a check too.",
                                                                                    "score": 102,
                                                                                    "author": "MahNameJeff420",
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Because a lot of people are still very ignorant about peta and think it's a noble organization comprised of gentle animal lovers",
                                                                                    "score": 13,
                                                                                    "author": "former_Democrat"
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "yeah but it's more likely theyre being funded by people who hate animals these days",
                                                                                    "score": 50,
                                                                                    "author": "humblegeniuslegend",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "People who barely know what PETA is, but don't actually know what PETA have been doing. I reckon alot of people could still be in that group.",
                                                                            "score": 8,
                                                                            "author": "SoSo-7"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 98,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "**P**igeon **E**ntering **T**he **A**fterlife ?",
                                                    "score": 73,
                                                    "author": "SpermWhale",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Peta are a bunch of dinguses but burning down an animal enclosure with the animals inside isn't their MO. They would definitely release them all (and the pigeons would just come back the next day).",
                                                    "score": 28,
                                                    "author": "ashok36",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 1141,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Too soon.",
                                            "score": 320,
                                            "author": "RetroSpock",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 212,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "100% agree, great pun tho",
                                                            "score": 70,
                                                            "author": "ONLY_COMMENTS_ON_GW"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah, not coo^o^^o^^^o",
                                                    "score": 41,
                                                    "author": "Juno_Malone"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "The perpetrators were real chicken to set fire and fly the coup like that.",
                                                    "score": 54,
                                                    "author": "Whattowritenow",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I hope whoever it was gets pidgeon holed.",
                                                            "score": 22,
                                                            "author": "NeedzRehab",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "They'll need an expert in Bird Law to defend them",
                                                                    "score": 23,
                                                                    "author": "Whattowritenow",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Holy shit, a half million dollars?! I'd be livid.",
                            "score": 254,
                            "author": "SexceptableIncredibl",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "On top of that, good pigeons can be sold for insane amounts.\n\nOne of my neighbours races pigeons and he won a national race of ~15k pigeons competing. Total prize pool was six figures, he sold his pigeon for an undisclosed amount, but more than the total prize pool was in the first place.\n\nSo let's say prize pool was €100k, €50k for the winner and he sold his one for €100k. That means the actual winnings was 3x the first place prize money.\n\nIf you extrapolate that to this race... Literally over a million dollars.",
                                    "score": 158,
                                    "author": "BC1721",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I need to get me some pigeons. Shit....",
                                            "score": 19,
                                            "author": "SexceptableIncredibl",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 25,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Why does he have 2000 pigeons? How do they pick which ones to use in the race? Genuinely curious about how this all works.",
                            "score": 86,
                            "author": "crazygoattoe",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They aren't his pigeons. He hosts a pretty impressive one loft race called the Hoosier Classic. People, including my dad, send him their most promising babies along with a hefty entry fee. He trains them all together and then they compete in a series of races with a total pot of $1 million. Typically the winners sell for hundreds or even thousands. My dad is pretty bummed to lose his 4 that were there but I can't imagine the greater loss. This wasn't an accident.",
                                    "score": 228,
                                    "author": "curatedlurking23",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Mike Tyson would be interested.\n\nThat being said it sucks fucking ass that someone would do this.  With that much talent in one area I'm sure the fire is not a coincidence and more like arson.",
                                            "score": 26,
                                            "author": "flimspringfield"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "They usually send them all off. They are banded on their foot, so the one who makes it home first can be ID'd",
                                    "score": 48,
                                    "author": "[deleted]"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Were they insured at least?",
                            "score": 54,
                            "author": "mF7403",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's an amusing situation to imagine, without context.\n\n\"Hello, yes, I'd like to insure my pigeon.\"",
                                    "score": 43,
                                    "author": "BlazzGuy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "\"Hello, yes, I'd like to insure my pigeon.\"\n\n-Bert",
                                            "score": 37,
                                            "author": "verdatum",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Dude I’d start looking at the list of competitors that signed up tomorrow for that race. No way this isn’t all connected it’s too coincidental",
                            "score": 28,
                            "author": "swag4JBieber69",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The race is a one loft race. All of the entrants were in the loft so there won't be one, just a lot of really disappointed people going back home empty handed.",
                                    "score": 27,
                                    "author": "curatedlurking23",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I wonder, was the organiser the owner of the loft? Or were they someone external? If the owner isn't the organiser, I'd be looking at the one who no longer has to pay out $500k tomorrow as my first suspect.",
                                            "score": 18,
                                            "author": "batfiend",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "OP, I really hope your friend has insurance.",
                            "score": 20,
                            "author": "PimemtoCheese",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Very much so. Each pidgeon alone can be worth thousands so the physical damage is immense. That's before if they're are custom breeds he has worked and bred to perfection too.",
                    "score": 53,
                    "author": "shadowhunter742"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 73,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was once staying at a hotel and there was a pigeon racing convention going on in their big convention hall.  I snuck in and sat in the back and watched for like an hour as they auctioned pigeons. It was the day before they were going to let them all go to race back to Texas, and we were in San Diego.  Some of these pigeons were selling for $10k-15k.  The auctioneer even had the typical super speedy voice.\n\nIt blew my mind that there was such a hobby.   These guys are super serious about it.",
                            "score": 14,
                            "author": "HitMePat"
                        },
                        {
                            "level": 2,
                            "comment": "Ive known about since the 90s because of Mike Tyson",
                            "score": 13,
                            "author": "IRHABI313"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yea but from the post I am assuming that OP was housing all the pigeons that were going to race, meaning the race wont take place at all. I understand killing off the competition, but in this case it sounds like no money is going to be paid out since there will be no race.\n\nAlso, this is animal cruelty. Whoever did this is looking at 2,000 counts of this charge in addition to arson plus any other charges that can be brought again them. This person is literally facing life in prison.",
                    "score": 32,
                    "author": "Afeazo",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Oh no :-( \n\nDoes he have any clue who did this? Is there security cameras footage of the area surrounding his structure?\n\nCould it have been a rival breeder?",
            "score": 4653,
            "author": "Pho_de_bimos",
            "replies": [
                {
                    "level": 1,
                    "comment": "As of now nobody has any idea. Security footage is being looked at but even of they see somebody it probably wouldnt let you know too much because they could have walked there across the big fields that are all around his house",
                    "score": 4088,
                    "author": "FantasyFlyer3",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "People are the worst.",
                            "score": 1308,
                            "author": "Pi11r0113r",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There are really some scummy people out there. In the summer of 2007 and 2017 the houses I lived in both burned down due to arson. The first time apparently was gang related towards the teens of the landlord upstairs. And the second time was evidently an old tenant who hated my neighbor in the other suite.\n\n\nPlanning on getting house fire insurance in 2027.",
                                    "score": 23,
                                    "author": "Krobelux"
                                },
                                {
                                    "level": 3,
                                    "comment": "Fuck people \n\nEveryday on this hellhole earth makes me want to leave\n\nThe only things keeping me around are the good bros and bubble tea.\n\nEdit: made sure I got bubble tea today after making this comment, Taro flavour with pearls and blueberry popping pearls. Did not disappoint.",
                                    "score": 781,
                                    "author": "kluger19",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "This just in bubble tea banned in your local area",
                                            "score": 14,
                                            "author": "Syreeta5036"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "And dogs. Dogs are the best people",
                                            "score": 315,
                                            "author": "thepluralofmooses",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I’m allergic :(",
                                                    "score": 48,
                                                    "author": "JJroks543",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "They still love you though. No worries.",
                                                            "score": 24,
                                                            "author": "[deleted]"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Wholesome doggo keanu chungus 100",
                                                    "score": 95,
                                                    "author": "TheRealCEOofRacism",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Not the dog my parents have here.",
                                                    "score": 17,
                                                    "author": "PKMNTrainerMark",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Chai tea is pretty good too",
                                            "score": 6,
                                            "author": "ReturnToTheCage",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "If he was taking place in some sort of competition this can have something to do with it. Maybe someone who was counting on winning it or maybe had gambled on someone else?\n\nI hope they catch the fucks who did it.",
                            "score": 29,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "If they catch the guy who did it, please give an update.",
                            "score": 46,
                            "author": "SNAKEKINGYO",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "&gt;As of now nobody has any idea.\n\nWhat makes you so sure it was a person who started the fire and that it didn’t start naturally, electrical fire, etc.?",
                            "score": 42,
                            "author": "AmidoBlack",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The entire loft went up in flames at once. It did not start in one section and spread",
                                    "score": 46,
                                    "author": "FantasyFlyer3",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Aerosolized feces could spontaneously combust. I’m sure the Arson investigators are all over the property already, though to make sure!",
                                            "score": 30,
                                            "author": "d0nu7",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "if that's the case, it still belongs in this sub\n\nnature being the total piece of shit on this one, of course.",
                                                    "score": 18,
                                                    "author": "hoxxxxx",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "The shit was the total piece of shit.",
                                                            "score": 11,
                                                            "author": "scungillipig",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 13,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Arson is a felony, the people who did this are goin to PRISON!",
                            "score": 21,
                            "author": "NewAgeDerpDerp",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'm gonna get downvoted for this but this is suspiciously the perfect time to file an insurance claim. right before a race is when the animals are valued at their highest",
                    "score": 16,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "God fucking damn it why does the worst and most negative option always make the most sense",
                            "score": 7,
                            "author": "shaxxmedaddy",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wtf? I hope they catch the pos who did this and hold them responsible for not only the arson and structure damage but also all those animals they killed",
            "score": 3577,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Those birds were his lively hood. It was how he made money and provided for his wife and kids. The battle just begun, we all have our fingers crossed",
                    "score": 3537,
                    "author": "FantasyFlyer3",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wow man that is extremely fucked up they should open a gofundme or at least a place where folks can donate to them. I have a family too and that makes me sick. I can’t imagine how him and his wife must feel right now.",
                            "score": 1231,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 502,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Sometimes I think that insurances don't exist and goFundMe is the new insurance.",
                                            "score": 581,
                                            "author": "Lasket",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "In some cases this is correct",
                                                    "score": 241,
                                                    "author": "DutchDroopy",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "In all cases that's unfortunate, but I remember reading somewhere that the history of insurance has similarities to community funding sources like go fund me. I read that communities of merchants would pool a small portion of their money for the purposes of compensating each other should a shipment of goods be lost in transit.",
                                                            "score": 115,
                                                            "author": "PsyrusTheGreat",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "That’s essentially what insurance is.  People pay money into it and get compensated when appropriate",
                                                                    "score": 70,
                                                                    "author": "KvToXic",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "It should be noted that basically anything can be insured, JLo had her ass insured at least for a while",
                                                                            "score": 32,
                                                                            "author": "Jrook",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Taylor's swift's legs I believe are insured.",
                                                                                    "score": 17,
                                                                                    "author": "Succulentsucking69",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "And for a long time now it’s mostly been “People pay money into it, and then have to fight for months or years to get properly compensated because insurance company thinks compensation isn’t appropriate for that situation”",
                                                                            "score": 24,
                                                                            "author": "[deleted]"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "No sane person would bet the livelihood of his family on the kindness of strangers.",
                                                    "score": 15,
                                                    "author": "GrEeKiNnOvaTiOn",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Doesn’t bring the birds or dogs back though.  😥",
                                            "score": 63,
                                            "author": "AmongSheep"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Just looked racing pigeons up one has sold for over a million dollars! He must have insurance on them. \n\n[Buisness Insider video if anyone is interested. ](https://youtu.be/zl—sl_Q8to)",
                                            "score": 33,
                                            "author": "TreeMonster",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The problem is that insurance only does so much. Your stock / breed / bloodline is gone. You need to start new. If a race horse breeder or high end cattle farmer lose all their animals, barely any amount of money can salvage that. Same here. The amount of damage done far outweighs the value of the pigeons and even some on top, it'll take a long time until he is at the level he was again. If he ever gets back to that level. Some things just can't be fixed.",
                                                    "score": 41,
                                                    "author": "afito",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "This is one of those things that you never really get back to where you were. It’s not just because it’s difficult, but often times people are so devastated they don’t want to put themselves into a position to lose something they were that attached to.",
                                                            "score": 18,
                                                            "author": "deewheredohisfeetgo"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Insurance can take a long time to get settlement money. They need help while they work with insurance. That's why people do gofundmes.",
                                            "score": 55,
                                            "author": "jaxxly",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Did he have insurance? Is there a way to ascribe value to racing birds?\n\n\nEdit: birds aren’t cheap, especially fully grown and trained ones. As long as he has insurance he should come out with 7-8 figures. Cross post this to r/legaladvice  and see what you can get going bro. \n\n\nSorry about your friends loss",
                            "score": 82,
                            "author": "Dem827",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I mean there's definitely horse insurance, so I'd imagine you could find someone to do it.",
                                    "score": 35,
                                    "author": "TruckADuck42",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt;Cross post this to /r/legaladvice and see what you can get going bro.\n\nWhat are legal advice going to do? He either had insurance, in which case the advice is speak to them, or he didnt. If he was looking to persue criminal damages in a civil suit then the advice is go hire a lawyer. There really isn’t anything that sub can do or help with in this case.",
                                    "score": 23,
                                    "author": "TiltingAtTurbines",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Plus if this was arson, the dude who didn't isn't going to be able to cover the cost of 2k birds unless this is particularly remarkable. \n\n\nSomeone else in the thread said a racing pigeon goes for several hundred thousand dollars",
                                            "score": 13,
                                            "author": "Jrook",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "If it is that much and he didn't have insurance then that's irresponsible as *fuck*.",
                                                    "score": 18,
                                                    "author": "Bloodyfinger"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "This is so fucking wrong. My prayers and good thoughts their way!",
                            "score": 36,
                            "author": "chrisdental02"
                        },
                        {
                            "level": 2,
                            "comment": "Hopefully he has pigeon insurance",
                            "score": 31,
                            "author": "confused_n_disturbed",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Closest thing might be Aflac",
                                    "score": 23,
                                    "author": "qwertybuttz",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Unfortunately his Geico only covers racing lizards",
                                            "score": 6,
                                            "author": "Holein5"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Do they know who did it or why?",
            "score": 795,
            "author": "TTdriver",
            "replies": [
                {
                    "level": 1,
                    "comment": "Guarantee it will have been some little bastards with no hoper parents.",
                    "score": 511,
                    "author": "vegan_zombie_brainz",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Or a vile competitor.",
                            "score": 298,
                            "author": "imbalancedMortician",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "But it seems like there was a big cash prize at stake, so tbh it was less likely a juvenile delinquent and more likely a saboteur",
                            "score": 135,
                            "author": "RamenTheory",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yup. Timing is way too suspect.",
                                    "score": 45,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "My money is on an out of touch baby boomer that's used to winning because they've been handed everything in life.",
                            "score": 37,
                            "author": "Kurayamino",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Could be sabotage, op's friends pigeons were good and the winner of the race would've gotten 500k",
                    "score": 33,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 52,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That was my next follow up but op never replied again or I missed it.",
                            "score": 20,
                            "author": "TTdriver",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 14,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That’s not even just being a piece of shit, that’s just fucking evil.",
            "score": 480,
            "author": "Aelspeth87",
            "replies": [
                {
                    "level": 1,
                    "comment": "Felony easy",
                    "score": 83,
                    "author": "knots32",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I am extremely touched by this...my grandpa, who died this year, was a pigeon race champion. My grandma still has all the medals and cups...that hurts so much to see that someone ruined someone else's life and made a slaughter.\n\nAll my support to you and your friend.",
            "score": 1407,
            "author": "Akanekumo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sorry for your loss... :-(\n\nI was honestly half expecting a shittymorph to appear out of your comment, though.",
                    "score": 230,
                    "author": "TA-PSTGuy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A what?",
                            "score": 42,
                            "author": "PKMNTrainerMark",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "i think its when a comment deteriorates into something fucked up. like how fucked up it was that my dad beat me with jumper cables for the past 28 years.\n\n(an example)",
                                    "score": 97,
                                    "author": "Zpalq",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Man for a second I got excited cause I thought you were the jumper cable guy",
                                            "score": 38,
                                            "author": "SolarStorm2950",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "sorry, just referencing him. he would have a much smoother transition than i did.",
                                                    "score": 23,
                                                    "author": "Zpalq"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "The jumper cable guy? Theres a guy known for this?",
                                                    "score": 6,
                                                    "author": "Gatekeeper-Andy",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "You're not correct.  Shittymorph was a user that would comment with relevant stories that ended when some wrestler threw a dude off hell in a cell plummeting 17 or so feet through the announcer's table.",
                                            "score": 28,
                                            "author": "ICantThinkOfAnythin",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; Shittymorph ~~was~~ is a user\n\nhe's not gone",
                                                    "score": 10,
                                                    "author": "mstarrbrannigan",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "No he ends every comment with and in 1996 undertaker threw mankind off a hell in the cell \nOr something close",
                                            "score": 7,
                                            "author": "knucklesx23",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "The hell in a cell guy?",
                                    "score": 8,
                                    "author": "Tamany_AlThor",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Your grandpa was a pigeon?",
                    "score": 27,
                    "author": "JusticeFitzgerald",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Fastest one of them all too",
                            "score": 11,
                            "author": "Lanthemandragoran"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That’s really cruel. I hope they’re able to find whoever did it.",
            "score": 138,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Let's hope karma is an actual thing and that POS gets what he deserves.",
            "score": 226,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Let's pray to Rng that it is..",
                    "score": 10,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It was horrible to burn down the building purposefully, but to burn animals alive is seriously sick.",
            "score": 206,
            "author": "cocopuffhead",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Damn, sick people with no purpose in life",
            "score": 206,
            "author": "alinfota96",
            "replies": [
                {
                    "level": 1,
                    "comment": "Or a sabotage, OP said the prize in this particular race was 500k",
                    "score": 128,
                    "author": "AleCoats",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Reminds me of the gymnast who had her legs broken before the Olympics",
                            "score": 27,
                            "author": "thatdude858",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Are you thinking of Nancy Kerrigan the figure skater? Her opponent Tanya Harding had her taken out. It was seriously fucked up.",
                                    "score": 31,
                                    "author": "s0c1a7w0rk3r",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "When mike Tyson hears about this he might just kill the guy",
            "score": 198,
            "author": "WillTheGrimreaper",
            "replies": [
                {
                    "level": 1,
                    "comment": "This was my first thought too! If they catch them, then the judgment should be one round, not head gear, no gloves fist fight against Tyson!",
                    "score": 62,
                    "author": "BobbyDiglar",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A young Tyson beat the shit out of someone when he watched them kill a pigeon. Imagine someone who killed many of them",
                            "score": 68,
                            "author": "WillTheGrimreaper",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 27,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You dont fuck with his pigeons",
                                            "score": 14,
                                            "author": "WillTheGrimreaper"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "A modern trial by combat",
                            "score": 13,
                            "author": "HistorianGray"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "(Edit: Different story from)3 years ago\n\nhttps://www.theguardian.com/world/2016/may/13/arson-in-the-pigeon-lofts-spate-of-attacks-leaves-fanciers-baffled",
            "score": 55,
            "author": "TheL0nePonderer",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm from the northeast (england) where pigeon fancying is very popular. My grandad kept pigeons for longer than I've been alive. Arson attacks on pigeon crees are rife, jealousy is key and I would say it is other pigeon men doing it.",
                    "score": 37,
                    "author": "Carl_steveo",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I hate everyone",
            "score": 277,
            "author": "wOkEmAAss",
            "replies": [
                {
                    "level": 1,
                    "comment": "I hate you as well",
                    "score": 92,
                    "author": "YOURMOM37",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I hate both of you. AND myself.",
                            "score": 70,
                            "author": "escapist11",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well, I love all 3 of you. You didn’t, I assume, kill the pigeons.",
                                    "score": 41,
                                    "author": "Naptownfellow",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "And I love you random citizen",
                                            "score": 13,
                                            "author": "wOkEmAAss"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I certainly did not",
                                            "score": 9,
                                            "author": "escapist11"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I think you are all amazing.",
                                    "score": 6,
                                    "author": "spiciernoodles"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "As a firefighter this makes me very sad. Any life lost to a fire is one too many.",
            "score": 78,
            "author": "jfa_16",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Was there something unnatural about the fire (Smell of lighting fluid, irregular fire patterns, large gaps, footprints)?  \n\n\nI just want to know what the definitive proof of vandalism was.",
            "score": 30,
            "author": "It_is_not_that_hard",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I'm so sorry for your friends loss. The sport of Pigeon Racing is often mocked, yet they forget what saved 17,000 lives (potentially more) during the war.",
            "score": 108,
            "author": "PsillyGecko",
            "replies": [
                {
                    "level": 1,
                    "comment": "Very true! \n\nI had the pleasure of seeing \"John Silver\" at the Air Force museum in Dayton. \n\nhttps://www.atlasobscura.com/places/stumpy-john-silver-2\n\n[Another amazing pigeon from WWI, Cher Ami.](\nhttps://www.worldwar1centennial.org/index.php/communicate/press-media/wwi-centennial-news/1210-cher-ami-the-pigeon-that-saved-the-lost-battalion.html)",
                    "score": 26,
                    "author": "-GreenHeron-",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "It looks like the hell the person that set that fire is going to. I hope everyone is able to recover ok.",
            "score": 33,
            "author": "BigDaddyMD2020"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 77,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I found a news post talking about this tragedy and there is no mention of foul play, so I think assuming it was arson is jumping to conclusions at this point.  \n[https://www.pipa.be/nl/newsandarticles/news/hoosier-classic-one-loft-race-tragedy](https://www.pipa.be/nl/newsandarticles/news/hoosier-classic-one-loft-race-tragedy)",
                    "score": 39,
                    "author": "KenMerritt",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "This is my question.  How does he know it was arson?  \n\nwas there any wiring?  Could be lots of stuff\n\nPeople always jump to foul play because they want to blame somebody.  Sometimes bad things and accidents just happen.  I hope OP places an update once an investigation is done\n\n*fowl play",
                    "score": 44,
                    "author": "cmcewen",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Crazy how far I had to scroll to find this question.",
                    "score": 29,
                    "author": "IGFanaan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Reactionism is a helluva drug.",
                            "score": 14,
                            "author": "Manburpigx",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Yeah like wtf. How can they already know it was arson? Literally impossible to tell until an investigation regarding the source is conducted",
                            "score": 10,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "If it was just a pigeon loft with no one living there idk there are many things that can start fires",
                    "score": 25,
                    "author": "AleCoats",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If it's a colder environment I could see there being heating lamps.  OP made reference to still checking to see if they see anyone on camera, so I'm thinking he's jumping to conclusions.",
                            "score": 24,
                            "author": "Granlundo64",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "A pile of pigeon poop alone could start a fire.",
                                    "score": 11,
                                    "author": "Holos620",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "When I saw this I instinctually downvoted because that sucks so bad, then my brain clicked on again. Sucks though :'(",
            "score": 35,
            "author": "Mollusc6"
        },
        {
            "level": 0,
            "comment": "Wtf?!?! This was obviously some salty mofo that lost a lot of money being involved in this or some competing company losing money because of this place..... but who knows, now a days people are mad crazy going on human killing sprees for fun.....  I wish God pressed the reset button already.....",
            "score": 40,
            "author": "BienMacho69",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Sounds like you need somebody well-versed in bird law for this.",
            "score": 26,
            "author": "smellslikefeetinhere",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am well versed.\n\nBurning 2000 birds alive is def illegal.\n\nUnless it was an accident of some sort.  In which case it’s just sad.  But could also implicate the owner if safety precautions were not taken",
                    "score": 20,
                    "author": "cmcewen",
                    "replies": []
                }
            ]
        }
    ]
}