{
    "id": "dqt1qx",
    "score": 68752,
    "title": "Students pointing a gun to his distracted teacher",
    "author": "rafa6571",
    "date": 1572740679.0,
    "url": "https://www.reddit.com/r/iamatotalpieceofshit/comments/dqt1qx",
    "media_urls": [
        "https://v.redd.it/s92uankz7dw31"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "**Reminder: Do not ask for personal information, suggest someone should be doxxed, link to or comment with personal information, openly solicit personal information, or contact the people featured here. Don't even wax poetic about wanting to post identifying information. You will be banned.**\n\n**Do not encourage, glorify, or incite violence.**\n\nFor example: \"Kill yourself\", \"It wouldn't be so bad if we killed all the pedophiles\", \"This guy needs to die\", \"I hope this guy gets stabbed to death with a rusty screwdriver\", etc.\n\n**ALL PERSONALLY IDENTIFYING INFORMATION MUST BE CENSORED.**\n\nFailure to follow the rules of this sub will result in a permanent ban.\n      \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/iamatotalpieceofshit) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Jfc i know something had to happen with the\nkid afterwards. why was everyone so chill about it??",
            "score": 7227,
            "author": "DemApplesAndShit",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;\\[The dude that pointed the gun and 3 others\\] will be allowed to finish out the current school year, but they have been banned from attending the school in 2020.    \n\n\n[https://www.dailymail.co.uk/news/article-7631065/Terrifying-moment-student-17-Catholic-school-Argentina-points-replica-gun-teacher.html](https://www.dailymail.co.uk/news/article-7631065/Terrifying-moment-student-17-Catholic-school-Argentina-points-replica-gun-teacher.html)",
                    "score": 5055,
                    "author": "GaGmBr",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "As an Argentinian the video instantly reminded me of private catholic school jackasses but I didn’t think it was that because of the gun, now that I know it was a plastic gun it makes complete sense. \n\nThese fuckers could never get their hands on a real gun. They’re entitled mommas boys who have never stepped out of their comfort zones.",
                            "score": 2664,
                            "author": "TheIAP88",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah there's nothing inherently masculine about a young guy being able to find a real gun. More a sign of government incompetence.",
                                    "score": 968,
                                    "author": "Kristaps_Porchingis",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I can attest to this. I legally bought a 9mm subcompact pistol on my own when I was 18 here in the states. Sold it for a profit (also legally) cause I realized it served no purpose for me but to feel cool.",
                                            "score": 442,
                                            "author": "spicygrow",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That's some spicy personal grow.",
                                                    "score": 362,
                                                    "author": "wambman",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "This is what I look for in a man. I'm also a straight man.",
                                                            "score": 118,
                                                            "author": "Forger10169",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "How did you buy a handgun at 18? You get it from an individual?",
                                                    "score": 14,
                                                    "author": "THEogDONKEYPUNCH",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Or he turned 18 before 1996.",
                                                            "score": 5,
                                                            "author": "VIIIMan"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Weird because federal law says you gotta be 21 to buy a handgun so whatever you did it wasn't legal. Otherwise if it was from family members, that's the gross misconduct that needs to be cracked down on general when it comes to gun control",
                                                    "score": 80,
                                                    "author": "Zephead223",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Exactly. I met dudes in the juvenile system who did the same thing. That’s why they were there. Most of them are probably dead or in real prison now. Shit is not cool or funny.",
                                                            "score": 16,
                                                            "author": "Jabroni-Tony1"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "it is legal to purchase a handgun at 18 as long as it's thru a private sale",
                                                            "score": 21,
                                                            "author": "ImAlwaysLosing",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Depends heavily on state.",
                                                                    "score": 6,
                                                                    "author": "Meih_Notyou"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "You became an arms dealer at age 18.",
                                                    "score": 26,
                                                    "author": "Justinformation",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "In America you can be anything!",
                                                            "score": 7,
                                                            "author": "ButaneLilly",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "The american dream",
                                                            "score": 3,
                                                            "author": "GaGmBr"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Me acuerdo de eso, son re mami estos chabones",
                                    "score": 6,
                                    "author": "gabetoloco2"
                                },
                                {
                                    "level": 3,
                                    "comment": "Pretty sure it’s pretty easy to get a gun. I mean, atleast in America. I’d go to weed dealers all the time and eventually one would show me some of his illegal guns for sale. Especially when I was carrying zips. Idk I see it easier to get a gun illegally more than legally in America. I’d think it’d be the same. \n\nYes, down vote me... I know, election season is coming up and people don’t like reality.",
                                    "score": 96,
                                    "author": "WolfofLawlStreet",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 23,
                                            "author": "[deleted]",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Here's the crazy part that makes it even worse.... IT IS NOT ILLEGAL FOR YOUR DRUG DEALER TO SELL YOU GUNS ON THE DL. Private sales are not regulated or require registration.\n\nIn America the only illegal gun sale is from a licensed gun seller like a sports store or pawn shop to someone without going through some minor red tape.\n\nPerson to person? No way to track and completely legal regardless if that person would be denied at a licensed shop.",
                                            "score": 21,
                                            "author": "Polywannacrackher",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "\"minor red tape\"\n\nYou mean an FBI background check",
                                                    "score": 14,
                                                    "author": "THEogDONKEYPUNCH",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "That doesn't sound as good in his narrative.",
                                                            "score": 7,
                                                            "author": "nomad2585",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "It is minor. There's several levels to \"FBI bg check.\" It's not like the bg check when you're trying to get hired at Area 51, where they have people out to talk or call to people who have known you for decades. With the gun bg, in most cases you're in and out with your purchase with just a slight delay.  That's minor red tape.",
                                                            "score": 3,
                                                            "author": "[deleted]"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "If you get denied at a gun shop for failing your FBI background check and someone else sells you a gun that's a felony",
                                                    "score": 3,
                                                    "author": "Fisherlin",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Not true. You're not allowed to deal guns as a private seller - you can sell personal property but if you're specifically buying things to sell or trade you're a dealer. Also, it's illegal to sell guns to someone you suspect is a felon.\n\nYou can say enforcement is difficult here, sure, but your whole point is that this is legally fine and that's not true.",
                                                    "score": 3,
                                                    "author": "SenorBeef",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Don't replica guns have an orange tip?",
                            "score": 13,
                            "author": "ClowxReed",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No\n\nOlder ones defiently don't I had one that my dad had as a kid and it 100% does not have an orange tip\n\nAlso this was Argentina probably dont require them to have it",
                                    "score": 16,
                                    "author": "[deleted]",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "In the US, yes, but in other countries, it's not obligatory, as in Europe, for example, it's not as easy to get a real gun.",
                                    "score": 3,
                                    "author": "seby1607"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It was plastic. \n\nKinda changes things.",
                            "score": 402,
                            "author": "Imthejuggernautbitch",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Still not a joke.",
                                    "score": 848,
                                    "author": "2meterrichard",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It is a joke. Just not funny and frankly really creepy.",
                                            "score": 382,
                                            "author": "Toasty_Jones",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Everyone is so sensitive about guns and schools I really don't know why /s",
                                                    "score": 232,
                                                    "author": "Treeloot009",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 54,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "The behavior doesn't start to become more excusable when you're in a country that doesn't have as many mass shootings.",
                                                                    "score": 24,
                                                                    "author": "[deleted]",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 12,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Nah. How tf would another student know it wasn’t real",
                                                    "score": 18,
                                                    "author": "SimplyCmplctd",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "If you watched the video, you would see that he has been standing there taking with his friend. He did not hide the gun while he was taking with them. They knew it was fake.",
                                                            "score": 19,
                                                            "author": "joesb",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "This is in Argentina. The sensitivities around guns that you have in the US are cultural ones, not universal.\n\nMost of the world would consider how sensitive you are to plastic guns in the US to be extreme.",
                                            "score": 41,
                                            "author": "furtivepigmyso",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Most of the world doesn't have a problem with school shootings, but fuck us I guess.",
                                                    "score": 42,
                                                    "author": "ThisIsFlight",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Missing the point a bit, I'm not saying you in the US shouldn't worry so much about plastic guns, that's for you guys to decide. I'm saying you can't assume the rules that make sense in your culture should apply universally. In most first world countries the chance a plastic gun will be mistaken for real is extremely low.",
                                                            "score": 23,
                                                            "author": "furtivepigmyso",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[deleted]",
                                                                    "score": 5,
                                                                    "author": "[deleted]",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I knew this would turn into a fuck America thread somehow..somehow Americans are so gun crazy yet so sensitive to guns",
                                                    "score": 10,
                                                    "author": "blh1003",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Leave it to reddit to make a situation in Argentina into America bashing\n\nCan you share some statistics on the world's thoughts on plastic guns by country, showing the US is an extreme outlier? Let's see statistics for Swaziland, Peru, and Denmark for comparison sakes.",
                                                    "score": 16,
                                                    "author": "senatorsoot",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "That's not the problem. The problem is the other person may not know it's fake",
                                                    "score": 6,
                                                    "author": "FlyingRep",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "You won't hear \"students suspended for painting a gun\" in most other countries, but using a mock gun in that way (or even just bringing one to school) is still worth anywhere from a school suspension to a criminal offense in most.",
                                                    "score": 3,
                                                    "author": "Roflkopt3r"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I mean it’s a huge difference tho",
                                            "score": 13,
                                            "author": "lemongrenade",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Lol try pointing an all black, plastic gun at someone in public. Tell me how that works out for you.",
                                    "score": 32,
                                    "author": "Radical-Penguin",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Not until he decides to do that in public again and someone with a real gun steps in and caps him.",
                                    "score": 29,
                                    "author": "NWbySW",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It’s plastic\n\nSomeone posted the link before. They’re not coming back next school year",
                    "score": 46,
                    "author": "Imthejuggernautbitch",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Kid: \"Some of you are alright, don't come to school tomorrow.\"\n\nSchool: \"I see your bet, and raise you 364.\"",
                            "score": 19,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I don't want to google, but what's \"jfc\"? Pretty please...",
                    "score": 231,
                    "author": "PrisAustin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Jersey Fried Chicken",
                            "score": 390,
                            "author": "PM_ME_UR_INFOHAZARDS",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Jentucky Fried Chicken",
                                    "score": 144,
                                    "author": "Conmebosta",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Janky Fried Children. \n\n7/9",
                                            "score": 54,
                                            "author": "momojabada",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I don't know why I laughed at that as hard as I did...",
                                            "score": 18,
                                            "author": "Steve_78_OH",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Its funny, but I didnt knew either, and trying to come out with a joke I came up with \"jesus fucking christ\"\n\n Then I was like \"... wait\"",
                                    "score": 9,
                                    "author": "simonbleu"
                                },
                                {
                                    "level": 3,
                                    "comment": "The worst kind.",
                                    "score": 3,
                                    "author": "howie_rules",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Jesus Fucking Christ",
                            "score": 201,
                            "author": "bruhvevo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ohh. Cool",
                                    "score": 16,
                                    "author": "PrisAustin",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Incest ain't cool",
                                            "score": 10,
                                            "author": "TheCuntHunter6969",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 65,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "It definitely means Jersey friend chicken",
                            "score": 55,
                            "author": "Slightly_Handy"
                        },
                        {
                            "level": 2,
                            "comment": "Just folded clothes",
                            "score": 40,
                            "author": "JohnStamossi",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Junk flapping constantly",
                            "score": 16,
                            "author": "Siempre_Liso"
                        },
                        {
                            "level": 2,
                            "comment": "Jesus's Fun Club",
                            "score": 27,
                            "author": "xdylanthehumanx",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Jesus’ Furry Club",
                                    "score": 9,
                                    "author": "PlentyOfCauliflower"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Jof fucking course",
                            "score": 12,
                            "author": "NoVa_Dragoon",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "It means jesus fucking christ",
                            "score": 17,
                            "author": "BREAD_LOUIS",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Jesus Fucking Chickens",
                            "score": 6,
                            "author": "EchoSp3ctre",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Jimmy's Cock Torture",
                            "score": 17,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Juicy fat cock",
                            "score": 3,
                            "author": "Prophet_Muhammad_phd"
                        },
                        {
                            "level": 2,
                            "comment": "Just For Children",
                            "score": 3,
                            "author": "ErmahgerdMerker"
                        },
                        {
                            "level": 2,
                            "comment": "National Dyslexics Assocation",
                            "score": 3,
                            "author": "MisogynisticBumsplat",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "They're all joking, it stands for John from Carolina. He's introducing himself",
                            "score": 3,
                            "author": "ForHonorKilledShugo"
                        },
                        {
                            "level": 2,
                            "comment": "\"Just for clarification\" or \"Jesus fucking christ\". The latter in this case",
                            "score": 8,
                            "author": "Cohibaluxe"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I feel bad upvoting in this sub",
            "score": 1764,
            "author": "xeneize93",
            "replies": [
                {
                    "level": 1,
                    "comment": "I just try and think of it as agreeing with the sub name.",
                    "score": 476,
                    "author": "ActiveRegent",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I literally just had this whole conversation in my head",
                            "score": 158,
                            "author": "cloud9flyerr",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Upvoting it will get it more out there for the pieces of shit they are. do it.",
                    "score": 34,
                    "author": "AnonymousReddit321"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What is wrong with this world",
            "score": 7664,
            "author": "jallen79to60",
            "replies": [
                {
                    "level": 1,
                    "comment": "They're shitheads but at least that was not a real gun..",
                    "score": 3577,
                    "author": "just-anothrr-furry",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lookin at your username, why are you being such a degenerate ?",
                            "score": 2509,
                            "author": "indonesianfurrycum",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Had me in the first half not gonna lie",
                                    "score": 1174,
                                    "author": "gayteenagernaltbhsmz",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Your username had me for the second half...\n\nWhat’s the story there bud?",
                                            "score": 464,
                                            "author": "HoobidyMcBoobidy",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Just commenting to say that I fucking love your user name. Boobs make the world go round.",
                                                    "score": 221,
                                                    "author": "BallisticHabit",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I believe in two things: the First Amendment and boobs.",
                                                            "score": 114,
                                                            "author": "RogerStormzy",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "There should be a day every year where we celebrate the magnificence of the boob. We need a catchy name for it though....",
                                                                    "score": 50,
                                                                    "author": "BallisticHabit",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "The Chestival",
                                                                            "score": 41,
                                                                            "author": "harrypottermcgee",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Yes the celebration of chestival shall be held on boobsgiving day. Now what can the date be to contain the most boobs's",
                                                                                    "score": 7,
                                                                                    "author": "notyours101"
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Boobpendance day???",
                                                                            "score": 32,
                                                                            "author": "theamericanweasel",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "In’tit’endance day",
                                                                                    "score": 23,
                                                                                    "author": "TheEyeGuy13",
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "All nipples day?",
                                                                                    "score": 20,
                                                                                    "author": "BallisticHabit",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Like that penis festival in Japan?",
                                                                            "score": 16,
                                                                            "author": "DashLeJoker",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Huh, TIL there exists a penis festival.",
                                                                                    "score": 17,
                                                                                    "author": "BallisticHabit",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "that’s technically three things",
                                                                    "score": 3,
                                                                    "author": "you-a-buggaboo",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Just stopping in to say I love your username. I'm a fan of boobies as everyone should be.",
                                                    "score": 3,
                                                    "author": "fistofwrath"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Whats wrong with that? You got a problem with me?",
                                    "score": 53,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It's ALWAYS a real and loaded gun.",
                            "score": 119,
                            "author": "TellmeNinetails",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Isn't this basic gun safety? Why are you getting downvoted bruh",
                                    "score": 52,
                                    "author": "ultracat123",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 22,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That depends on the context. In a robbery, for instance, you'll get an armed charge even if the gun is fake, if it was reasonable to believe it was real at the time. In California, brandishing does carry different penalties.",
                                                    "score": 10,
                                                    "author": "Miserable_Smoke",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Because toy guns aren't real?",
                                            "score": 5,
                                            "author": "--_-Deadpool-_--"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Still not funny and I hope this kid and his laughing pointer buddy got expelled and imprisoned. This is **never** a fucking joke. This kid should take the medal for shithead of the year.",
                            "score": 76,
                            "author": "Christmas-Pickle",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Expelled is reasonable. Imprisoned is not.",
                                    "score": 70,
                                    "author": "Joyrock",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 42,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Because the best thing for society is to ensure the guy can never work or progress his life.  He definitely cannot be taught the error in his ways.  As you know, people stay exactly as they are in their teen years through their whole lives.  Instead of rehabilitating him, we should instead give up and ensure the only way he can feed himself is through welfare or crime.  And we know this because he made an extremely dumb choice as a joke.",
                                    "score": 38,
                                    "author": "pikaras",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 201,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 156,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Seriously. I would be fine with expulsion over this.\n\nI hope you're safe and happy in all your time &lt;3",
                                    "score": 47,
                                    "author": "Joyrock",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I would be happy with prison time. Given recent history, any gun, real or toy, should be illegal on school grounds.\n\nStudents are fully aware of how bad it is, and these days pushing that particular boundary should be harshly punished, with appropriate time given for discussion about why it's wrong and psychological tests.",
                                            "score": 14,
                                            "author": "FountainsOfFluids",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "As a fellow teacher that has experienced some worrying student behavior, I applaud you for standing by your students and your job.  Thanks for sharing! Hope you’re safe and well!",
                                    "score": 18,
                                    "author": "Syddderrrs",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "I feel bad it has to be that way for you (and agree about the top sentence). In england if we hear someone shouting in a school corridor, we just think 'who's shouting/arguing'? and we'll only be quiet because we want to overhear more of what's going on, not because we think we might get shot or something.",
                                    "score": 9,
                                    "author": "Pygmy_Turtle",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "My school was locked down twice back when i was in 10th grade. The first time we were locked down for 2 hours and people had to pee in a cup that the teacher had. Turns out it was someone pranking the school and calling a bomb threat in the music class.",
                                    "score": 3,
                                    "author": "blazefreak"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Dont know about you but I'm not desensitized in the slightest to this. I'm a 2a advocate and enjoy firearms, and the 4 rules have been pounded into my head so hard that I physically cringed watching this. \n\nThis is unacceptable and that kid is not responsible **at all**.",
                            "score": 23,
                            "author": "pm_me_ur_gaming_pc",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What are the 4 rules?",
                                    "score": 4,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Treat every gun as if it's loaded\n\nBe sure of your target and what's behind it\n\nDont point it at something you do not intend to destroy\n\nDo not put your finger on the trigger until you are ready to shoot\n\nThese are set in stone and should **never** be broken. Never, and that's an absolute.",
                                            "score": 12,
                                            "author": "pm_me_ur_gaming_pc",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "1.\tThe gun is always loaded.\n2.\t Never point a gun at something you don’t want destroyed\n3.\tknow what is beyond your target\n4.\tNEVER put your finger on the trigger unless your ready to fire.\n\nSource: CHL/CCW, and big gun advocate",
                                            "score": 23,
                                            "author": "Eylsii"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "A few years ago there were no active shooter drills..\n\nI didn't even learn about them until I was working at a school and was told that my crew could not even leave our work zone because that day there was an \"active shooter drill\" at the school.\n\n(yes, in case you don't have kids in the United States public school system, they actually have yearly drills where the entire school acts out what to do when a shooter should come into the building) \n\nI peered out the blinds and saw a fucking battalion of police practically in swat gear and one of them, who was suppose to be the shooter, in padded armor because he was going to be shot at. (with rubber bullets.) he may have just been padded because there were also dogs. Someone else may be able to educate on why he was padded please don't quote me one this. \n\nBut this is the reality kids live with in The US now.\n\nThey have to be constantly thinking about this shit.\n\nSo the obvious conclusion is that someone makes a parody of it to cope with the sheer insanity. That kid is coping with the fact that school shootings are a thing and he has to make a joke about it.\n\nThat's my take\n\nHere's Joe with the weather",
                            "score": 49,
                            "author": "bravoredditbravo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 17,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 5,
                                            "author": "[deleted]",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Serious question, doesn't that type of drill just teach a potential shooter exactly how everyone plans to escape?",
                                            "score": 7,
                                            "author": "throwaway246782",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I was gonna ask that too. And if it's hard to find that can make things difficult for the police...",
                                                    "score": 5,
                                                    "author": "Pygmy_Turtle"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "If the guy works in a mall or other public area, then a shooter would almost certainly not be an employee.",
                                                    "score": 3,
                                                    "author": "Kingofearth23"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "If it's a disgruntled coworker, yes.  If it's a random third-party person, then no.\n\nSo, it depends on what their exact threat model is.",
                                                    "score": 3,
                                                    "author": "mxzf"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "This is in Argentina.",
                                    "score": 8,
                                    "author": "[deleted]",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "We have had active shooter drills for more than a decade. My school did a \"shelter in place\" drill once per year.",
                                    "score": 3,
                                    "author": "[deleted]",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Some of the Hunger Games kids were porfessionals from District 1.\n\nYou can make anything normal.",
                                    "score": 5,
                                    "author": "thisimpetus"
                                },
                                {
                                    "level": 3,
                                    "comment": "It gonna rain!",
                                    "score": 3,
                                    "author": "batteriesnotrequired"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I think too many people are not associated well enough with the concept of death. They don't understand how serious and how fast it takes you, yet always goes slowly enough that you'll watch the person die a horribly agonizing death that they can't be saved from. Because for most of us we live in a world of peace, we don't get to see this face to face, for better and worse.",
                            "score": 7,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Will somebody please get these cutleries out my knees",
                    "score": 11,
                    "author": "OnionKnightOnTheSun",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Why are we still paying so much for sneakers? What are your overheads?",
                            "score": 4,
                            "author": "dancepantz",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "...turns out he's dead",
                                    "score": 3,
                                    "author": "cacarson7",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "'Is it just me, or is it getting crazier out there?'",
                    "score": 15,
                    "author": "Accidental_Edge"
                },
                {
                    "level": 1,
                    "comment": "Reality check. The world has always been full of good and bad people. We just have immediate access to see a lot of what the bad people are doing now.",
                    "score": 11,
                    "author": "GrrreatFrostedFlakes",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Argentina. Was supposed to be a joke with a toy gun. Still not good though.",
                    "score": 3,
                    "author": "La_Lanterne_Rouge",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "This one is going to grow up to be a Supreme Court Judge nominee in the U.S., and this video will surface, and he'll still get appointed.",
                    "score": 28,
                    "author": "saint_davidsonian",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Only if he really, really likes beer.",
                            "score": 15,
                            "author": "Steve_78_OH",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I know it s a laugh line but honestly as someone who has dealt and suffered from alcoholism in my family that line of questioning was [so out of fucking line](https://youtu.be/qsVtXJtl7lw)\n\nEdit; I realized quickly I didn’t mean the line of questioning, Klobuchar was on solid ground. His response had me ready to break shit",
                                    "score": 5,
                                    "author": "imbillypardy"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "First Argentina national as a SCOTUS Justice?",
                            "score": 5,
                            "author": "CapitalistVenezuelan"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hopefully this kid gets arrested and expelled.",
            "score": 972,
            "author": "mrduckmd1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nope. \n\nhttps://www.google.com/amp/s/www.dailymail.co.uk/news/article-7631065/amp/Terrifying-moment-student-17-Catholic-school-Argentina-points-replica-gun-teacher.html",
                    "score": 507,
                    "author": "aaronmicook",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ok, well at least it was a fake plastic gun.",
                            "score": 437,
                            "author": "dont_dox_me_again",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Everyone can stow their rage now",
                                    "score": 62,
                                    "author": "Imthejuggernautbitch",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "what the fuck am I going to be mad about now",
                                            "score": 50,
                                            "author": "DankeyKang11",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You can’t see your own forehead",
                                                    "score": 27,
                                                    "author": "SherwinAlva",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "At least he will be banned from his school after the current school year.",
                            "score": 103,
                            "author": "atomrofl",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "“Or maybe your a little nervous that the side of your pistol says “replica” whilst mine says... Desert Eagle point 5 0”",
                            "score": 17,
                            "author": "SquareSaltine15",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 83,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "here in Argentina robbery is way higher than in USA so the collective trauma is from nonstop robbery and people getting killed but they will still do this shit\n\nedit spelling",
                                    "score": 55,
                                    "author": "quercuscrobur",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I think it's the feeling of the area you're in. In schools, events, and public areas you can feel the tension and unease if there is a loud bang/pop.",
                                            "score": 15,
                                            "author": "whiteflagwaiver",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "These kids are private catholic school jackasses. \n\nUnos tinchos de ese calibre nunca tendrían eso en mente.",
                                            "score": 9,
                                            "author": "TheIAP88",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Tinchos would be Brad in English?",
                                                    "score": 4,
                                                    "author": "SubotaiKhan",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Tinchos is a weird a Argentinian phenomenon word but I think Brad encompasses pretty well. \n\nAlso, your response made my day, thank you.",
                                                            "score": 3,
                                                            "author": "TheIAP88",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "No estoy de acuerdo. Son los pendejos con guita los que se creen intocables y andan haciendo esas pelotudeces.\n\n En el otro extremo tenes los...digamos turros par no generar confusiones idiomaticasm que directamente van a vos con un objetivo. Honestamente no se con quien confiaria mas mi vida. Por un lado tenes alguien nervioso que quiere irse con la guita antes que venga la policia, por el otro tenes a un pibe jugando a ser el \"malo\" y que tranquilamente podria gatillear a su mejor amigo y matarlo sin darse cuenta porque asi de pelotudos son",
                                                    "score": 3,
                                                    "author": "simonbleu",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "you’d be surprised at how much violence there is in latin america, at least i think the more rural areas",
                                    "score": 15,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I hope the same. He could have caused a tragedy if the gun was charged with someone that was only trying to teach him.",
                    "score": 23,
                    "author": "rafa6571",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It was a plastic gun...",
                            "score": 11,
                            "author": "TheIAP88",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think he means that if the teacher saw it, thought it was real, and defended himself with potentially deadly force.",
                                    "score": 7,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This happened in Argentina. It was a fake gun, the students were trying to \"Prank\" a beloved teacher. The four guys were expelled from the school, their fathers apologized, the teacher was 'Shocked' but understood this was just teenagers making bad decisions.   \n\n\nThis is a pretty rare sight, given that you need to be 18+ and go through plenty of  psychological and technical test to even be able to buy a gun here.\n\nEdit: To clarify, they are effectively expelled. The law here states that they need to finish this year course before that happens.",
            "score": 211,
            "author": "ErgoMachina",
            "replies": [
                {
                    "level": 1,
                    "comment": "American ptsd with gun violence is being projected way too hard in this thread.",
                    "score": 71,
                    "author": "BigBroSlim",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Kids bad for making edgy joke. Why didn’t they have the foresight before making a stupid joke? Smh. Expel these idiots counselor.",
                            "score": 20,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah it’s a joke. They apparently like this teacher. Not even a real gun. What a shit thread.",
                                    "score": 3,
                                    "author": "Cageweek"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ray, I told you already no five seven in class",
            "score": 212,
            "author": "indonesianfurrycum",
            "replies": [
                {
                    "level": 1,
                    "comment": "In this house we use the CZ",
                    "score": 39,
                    "author": "SlabOfSteak",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "str8 gangster... what a tool",
            "score": 67,
            "author": "johnnyprozac"
        },
        {
            "level": 0,
            "comment": "why can i just tell this isnt the US? the kids and teacher aren’t very different looking, i can’t really pin anything on the classroom. the act of pointing a gun at the teacher could happen here too. yet for some reason i just know for sure this ain’t the US",
            "score": 83,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "The ceiling, they don't have those tiles",
                    "score": 63,
                    "author": "Tactical_Tac0",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wtf that’s actually it",
                            "score": 38,
                            "author": "pieandpadthai"
                        },
                        {
                            "level": 2,
                            "comment": "Wtf why is this so weird",
                            "score": 12,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "If it was the US he would've been tackled by someone",
                    "score": 13,
                    "author": "TheBungulo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If it was the US it would've been a real gun.",
                            "score": 33,
                            "author": "HCBot"
                        },
                        {
                            "level": 2,
                            "comment": "Yeah he would've been tackled by one of us hero Redditors duh",
                            "score": 6,
                            "author": "productivenef",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It is Argentina",
                    "score": 12,
                    "author": "d_nt_",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "It’s the AC unit too, I’ve never seen a public building in the US with one of those wall ACs",
                    "score": 8,
                    "author": "agremeister",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "because everyone is thin and has dark hair.",
                    "score": 12,
                    "author": "kkokk"
                }
            ]
        },
        {
            "level": 0,
            "comment": "if only where was a sub like r/kidsarefuckingstupid but for teens",
            "score": 9,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Teens are kids",
                    "score": 7,
                    "author": "PoopiDoopii",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "These kids are fucking stupid. I'm not getting into the whole this generation compared to my generation shit but I am pointing out that I see more morally reprehensible behavior that is not justifiable in any era whatsoever. Like what happened to just putting bunny ears on people. Why do these levels need to be reached now just to get a laugh?",
            "score": 175,
            "author": "KaitoSeishin",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;These kids are fucking stupid. I'm not getting into the whole this generation compared to my generation shit but I am pointing out that I see more morally reprehensible behavior that is not justifiable in any era whatsoever.\n\nWhat a stunningly dumb connection you're trying to make. The means to record and distribute video is more ubiquitous today than it ever has been - of course you are seeing this more.",
                    "score": 30,
                    "author": "RaddestOfComrades",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you for your comment. You saved me some precious seconds of my life.",
                            "score": 4,
                            "author": "happylauft3r"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Its all for show, and you'll find them babbling like infants when confronted and reprimanded for their actions.\n\nTheir identity seems to lie with how much others approve of them, which would be perfect if we were in the beginnings of a totalitarian government.",
                    "score": 61,
                    "author": "CanadianStatement",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I kind of think there’s just more video evidence of bad behavior than when you were young, and not necessarily more of it. Kids still used to throw rocks at cars in the 80s. And my mom was held down by her classmates in high school and forced to sniff glue, which is so fucked up to me.",
                    "score": 26,
                    "author": "deathtoboogers"
                },
                {
                    "level": 1,
                    "comment": "Nah. Social standards have changed and kids are still kids, that's all",
                    "score": 32,
                    "author": "OctopusPudding",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I’ve had more people point guns at me from older generations than younger generations.",
                    "score": 18,
                    "author": "JustMadeThisNameUp",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Kids aren't just competing to one-up within their circle of friends any more, but with the entire world via social media.",
                    "score": 28,
                    "author": "CounterStreet",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah I saw kids running a pole behind kids and taking out the back of their knees to rap music.. looking at the fact that someone could hit the back of their heads on hard ground or come down bad and twist their backs or dislocate something... all these things actually can result in injury but they don’t care they just want likes and tik tok viral views",
                            "score": 8,
                            "author": "usedbarnacle71",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You didn't see this shit in \"your generation\" because people didn't have HD cameras in their pockets 24/7. You think this type of shit happens on a daily basis, or even remotely frequently? Fuck no. When was the last time you saw this happen in person? Never. \n\nIf you had a microphone on you 24/7 you'd eventually be recorded saying something stupid (and in this case we don't even need a microphone, because your comment is already dumb enough to quality). The same logic applies with humanity. It's not that hard to understand, old man.",
                    "score": 5,
                    "author": "KoTDS_Apex",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Annnnnnnnnnnd that's how you get banned from school.",
            "score": 6,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Guessing Russia?",
            "score": 11,
            "author": "Iluvbeers",
            "replies": [
                {
                    "level": 1,
                    "comment": "Argentina... Catholic School",
                    "score": 26,
                    "author": "mibisalig",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Fucking wild either way.",
                            "score": 6,
                            "author": "Iluvbeers"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wat country? doesn’t look like America",
            "score": 8,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "i goddamn hope that's an airsoft pistol",
            "score": 9,
            "author": "BurnmaNeeGrow",
            "replies": []
        },
        {
            "level": 0,
            "comment": "For his neutral special, Joker uses a gun.",
            "score": 3,
            "author": "Carnival-Master-Mind"
        },
        {
            "level": 0,
            "comment": "You can tell this isn't from a USA school since he didn't actually start shooting.",
            "score": 3,
            "author": "papaCoDy1990"
        }
    ]
}