{
    "id": "ei3t7m",
    "score": 81460,
    "title": "How degenerate and inhuman do you have to be to do something like this?!",
    "author": "Layth36",
    "date": 1577804043.0,
    "url": "https://www.reddit.com/r/iamatotalpieceofshit/comments/ei3t7m",
    "media_urls": [
        "https://v.redd.it/zn522psyfz741"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "**Reminder: Do not ask for personal information, suggest someone should be doxxed, link to or comment with personal information, openly solicit personal information, or contact the people featured here. Don't even wax poetic about wanting to post identifying information. You will be banned.**\n\n**Do not encourage, glorify, or incite violence.**\n\nFor example: \"Kill yourself\", \"It wouldn't be so bad if we killed all the pedophiles\", \"This guy needs to die\", \"I hope this guy gets stabbed to death with a rusty screwdriver\", etc.\n\n**ALL PERSONALLY IDENTIFYING INFORMATION MUST BE CENSORED.**\n\nFailure to follow the rules of this sub will result in a permanent ban.\n      \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/iamatotalpieceofshit) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "The damn internet has ruined me a long time ago, but this shit fucking got me.",
            "score": 2925,
            "author": "kjjx22",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same bro... I've seen some fucked up shit but this...",
                    "score": 635,
                    "author": "Goliath_Gamer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Makes me sad to think what if no one came by, this poor baby would have starved to death and died in the worst way. So fuckin cruel",
                            "score": 206,
                            "author": "Lofde_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There's certainly a special place in hell for whoever did this.",
                                    "score": 95,
                                    "author": "Goliath_Gamer"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 95,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The baby was found and they can get help for it. I suppose that's something to take away from this.",
                            "score": 111,
                            "author": "KrazyKatz3",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's some /r/UpliftingNews mentality\n\nedit: I meant this in a more cynical way, as in most of the posts in Uplifting News are the result of cruelty or injustice. Like \"This 4-year-old sold cookies under the rain for weeks to help pay for his daddy's spinal surgery, because his insurance won't cover it and he needs to get back to work =)\"",
                                    "score": 42,
                                    "author": "cacahuate_",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Sometimes you have to think of the positive or all the horrible shit people do will bury you emotionally.",
                                            "score": 10,
                                            "author": "Blackstar1401"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "No matter how much you've seen. You kept your soul.",
                    "score": 35,
                    "author": "Will-U-Be-My-Friend"
                },
                {
                    "level": 1,
                    "comment": "I’m out. I can’t take this today. This has totally annihilated me and I used to be subbed to watch people die for years.",
                    "score": 26,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 6414,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I hope every country does that. I've seen this type of cases several times before and it's one of the most disgraceful and inhuman thing to see imo.",
                    "score": 2052,
                    "author": "HijackyJay",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Abdul Sattar Edhi (late) opened many shelters in Pakistan with \"baby swings\" where people can leave babies. The orphans that grow up there put his name as their \"dad\" on their ID cards.",
                            "score": 148,
                            "author": "TerryLovesThrowaways",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's very touching. Closest thing I can think of in the US is the [Dave Thomas Foundation for Adoption](https://en.wikipedia.org/wiki/Dave_Thomas_Foundation_for_Adoption) (yes, the guy who founded the Wendy's hamburger chain). They do a lot of good work, and also collect a lot of data on attitudes toward adoption, even if some of it has been scrubbed from the Internet in recent years due to modern sensibilities. Not directly related to 'baby boxes', just mentioning it because I've heard that they do very good work.",
                                    "score": 64,
                                    "author": "Wouff_Hong",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "“Ma’am, This is a Wendy’s”",
                                            "score": 11,
                                            "author": "ricardoconqueso"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Lithuania does it. We even call them the same.",
                            "score": 593,
                            "author": "Adrue",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ukraine too. \"Vikno zhitya\"",
                                    "score": 283,
                                    "author": "anovergy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Same in Germany. The idea isn't new, been around since the 13th century in one form or another, maybe longer. The first real hatch was built 1198 for the Ospedale di Santo Spirito in Rome.",
                                            "score": 235,
                                            "author": "zhokar85",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 108,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "The baby klapper",
                                                            "score": 91,
                                                            "author": "InfiniteParticles",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Brap brap pew pew",
                                                                    "score": 53,
                                                                    "author": "trashdrive",
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "https://youtu.be/TCIVgQqwR7w",
                                                                    "score": 5,
                                                                    "author": "BasilTheTimeLord",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Czechia too with Babybox.",
                                            "score": 70,
                                            "author": "Amic58",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Canadian here. I believe a few of our organizations are also picking up this Life Window",
                                                    "score": 51,
                                                    "author": "Smooth_Pelican",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I've heard of a few in the USA too.",
                                                            "score": 23,
                                                            "author": "FaeryLynne",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "From what I understand in the USA you can surrender your children at any time. Charges can be brought up but usually if it's a hardship case they'll just be glad the kids are safe. You can also transfer guardianship of you have a family member or friend that can take them. For newborns I've always heard you can drop them off at the hospital or manned fire station. I luckily have never needed to know this info well and it does vary by state as always.",
                                                                    "score": 16,
                                                                    "author": "whyamilikethis1089",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I just found out from my wife who is from Latvia that they do it too.",
                                    "score": 40,
                                    "author": "Squeezitgirdle",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "America has this but at firestations unless that's a myth I was always told...",
                            "score": 171,
                            "author": "W3NTZ",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It varies from state to state in the US. Here is how it works in SC. \n\nDaniel’s Law is a law designed to provide a safe haven for abandoned babies. Named for an infant boy who survived after being buried in a landfill soon after his birth, Daniel’s Law is intended to save babies by providing a safe haven for them.\n\nThe law allows for an unharmed infant, up to 60 days old, to be left in the care of an employee or staff member of a “safe haven” without fear of prosecution to the parents. A safe haven is defined as any of the following facilities: hospital or hospital outpatient facility, law enforcement agencies, fire stations, emergency medical services (EMS) stations or a house of worship during the time the church or synagogue is staffed. Hospitals are the preferred safe haven, followed by EMS services if a hospital is not close by. It is completely confidential. The person leaving the child does not have to reveal his or her identity. However he or she may be asked to provide medical information for any personnel who may treat the child.\n\nOnce the child is in the care of a safe haven, the Department of Social Services will be contacted and will then have legal custody over the child. DSS will then immediately pursue family court action to free the child for adoption.\n\nDaniel’s Law is not intended to hurt or punish anyone.  It is to help ensure that babies have safe haven in the event that his or her parents cannot care for them.\n\nIf you are pregnant and confused or frightened about what to do with your baby or know someone who is pregnant and in crisis, please contact the Department of Social Services, your local health department or your local hospital.\n\nThis information is brought to you by SCHA in collaboration with the Children’s Committee of the South Carolina Bar.",
                                    "score": 324,
                                    "author": "Jyiiga",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "In CA, we have pretty much the same thing that is just called a safe haven law, I’m not sure of the exact name. But yes, please don’t just leave your child out in a dumpster and if u need to, leave it with people that know how to handle the situation and can give that child the life they deserve.",
                                            "score": 55,
                                            "author": "Not_Yant",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Here it's only 72 hours after birth though.",
                                                    "score": 24,
                                                    "author": "PotahtoSuave",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "\"Sorry. By the looks of this baby, it's been 80 hours since birth. Next!\"",
                                                            "score": 46,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Sorry honey it's for a party. NEXT!!!",
                                                                    "score": 16,
                                                                    "author": "InfiniteParticles"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "That's nowhere near enough time to test one out.",
                                                            "score": 22,
                                                            "author": "FederalObjective",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "That's a 60 day return policy",
                                            "score": 115,
                                            "author": "Zaddy13",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Don't even need the receipt.",
                                                    "score": 58,
                                                    "author": "JamesBuffalkill",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Every state has a safe-haven as of 2008",
                                            "score": 18,
                                            "author": "blakjak66"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "You can leave a child less than 30 days old at a hospital, fire station, or police department with no questions asked in Ohio. Source: ED RN",
                                    "score": 30,
                                    "author": "Littlegreensled",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "In TN it's only three days. Which is fucked.\n\nAt least, that's what the woman at the health department told me.",
                                            "score": 28,
                                            "author": "Choclategum"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "In Indiana there are nine Safe Haven Baby Boxes, most at fire stations and recently one installed at a hospital. Five babies have been saved by these since 2009.",
                                    "score": 18,
                                    "author": "SoVeryKerry"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I wished China did that when the One Child Policy was still in effect. Everytime I read about baby girls being abandoned because they weren't baby boys made me so sad.",
                            "score": 51,
                            "author": "FrostyJannaStorm",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 39,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "In the US quite a few states have this program at fire stations and a few other locations. It desperately needs to be a more widespread program.",
                            "score": 9,
                            "author": "DogsandDumbells"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 105,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hospitals, police stations and fire stations, if left there, no penalty to the mother in the states",
                            "score": 154,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No penalty up until 6 months of age. Safe haven laws.",
                                    "score": 83,
                                    "author": "Crispynipps",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Nebraska's wasn't written well and someone flew there from out of state to drop off a 14 year old [link](https://www.cnn.com/2008/US/11/14/nebraska.safe.haven/index.html)",
                                            "score": 39,
                                            "author": "TheLastOneWasTooLong",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Wtf man, imagine going on a family trip to Nebraska your junior year or high school and then being legally dropped off and never seeing your family again",
                                                    "score": 47,
                                                    "author": "Crispynipps",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "That’s more freshman year, but yeah still fucked.",
                                                            "score": 21,
                                                            "author": "Imfrank123",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "In the article they dropped off a 14 yo and 17 yo.",
                                                                    "score": 19,
                                                                    "author": "Crispynipps",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Oh shit, I guess my usual policy of never reading the article and just commenting failed me again.",
                                                                            "score": 17,
                                                                            "author": "Imfrank123",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "&gt;\"Please don't bring your teenager to Nebraska,\" Gov. Dave Heineman said.\n\nThis is my new favorite quote to take completely out of context.",
                                                    "score": 30,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "As with most laws in the US, it varies state to state.",
                                            "score": 31,
                                            "author": "newtlong",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 14,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "In Texas it's any place with a \"Safe Place\" sign as well. So this will include gas stations and YMCAs too.",
                                    "score": 17,
                                    "author": "aksthem1",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 34,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I think the whole point is then you have to interact with people, and you feel disgusting. Which make people resort to the dumpster.",
                            "score": 17,
                            "author": "Homemadeduck102",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That's great. Nevermind what state the mother is in, the baby should be the #1 priority. As much as we can hate on the horrible people who do things like in this video to their babies, we really need solutions.",
                    "score": 62,
                    "author": "psychodogcat"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 186,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "some countries imprison women for murder for abortions / miscarriage",
                            "score": 23,
                            "author": "SuddenWriting",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I support this so hard.  Helps with our birth rate decline AND supports women's health.  Lets do it!",
                    "score": 26,
                    "author": "Milkslinger",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Watched on mute. Thought it was going to be kittens. Holy shit was not prepared for this.",
            "score": 18265,
            "author": "Courwes",
            "replies": [
                {
                    "level": 1,
                    "comment": "Me too!!!! I unmuted it near the end and thought I’d hear kitty or puppy cries...then it sounded like a goat...and then they opened the bag and I was like\nHoly Fuck.",
                    "score": 6564,
                    "author": "noodle_snoodle",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Exactly. \"Be a goat be a goat please dear God be a goat. Fucking hell.\"",
                            "score": 2855,
                            "author": "RedditorsAreHorrific",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I did the same and caught party of the leg and started to going please be a dog please be a dog please be a dog. Please don’t be dead. I was on the verge of hyperventilating when I saw the baby moving and crying. I was on mute the whole time so I couldn’t hear it. Ever since my daughter was born I lose it on these things because I can always see her face there fear and anger always rise up quickly at the thought of that. Not that I didn’t get upset about it before but now it is almost irrational how I am affected by these things.",
                                    "score": 1156,
                                    "author": "gbusy80",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Same.  Since I became a parent, I react much more viscerally to these types of things or news reports about children being injured or dying.  Knife to my heart.",
                                            "score": 457,
                                            "author": "cait1284",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 232,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "That was Luther for me, seeing the mum die whilst screaming that she wanted to see her baby again broke me.",
                                                            "score": 71,
                                                            "author": "Gingersnapandabrew",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "The butterflies episode... Way to bring back heavy feels...",
                                                            "score": 43,
                                                            "author": "vinegarZombie"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I'm no parent but I remember an episode of Cold Case when a woman tried to take a baby away from her mother for whatever reason and the mother bashed her head with a big rock and killed her.\n\nIt just makes me very afraid of what I'd do and the implications of those actions to keep my potential kid from harm",
                                                            "score": 35,
                                                            "author": "wholesome_cream",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Just so you know, there is NOTHING you won't do to protect your child, if you are even a decent parent. Ive been enraged over things I never thought would care about since having kids. Its primal.",
                                                                    "score": 21,
                                                                    "author": "oldWashcloth",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "My 2yo just walked in and said \"Hi, mommy\" as I watched the bag rip open and I had to give her all of the hugs.  God this shit kills me.",
                                                    "score": 74,
                                                    "author": "firefly183",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Literally just hugged the fuck out of my littles.",
                                                            "score": 35,
                                                            "author": "JustCleanUpYourShit",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I know. Having kids makes us much more sensitive to the mistreatment of children. So much so that I have to actively calm myself down in order to not fly off in a rage at every other post found on Reddit.\n\nE: to those replying to say that not having kids doesn't mean you don't also feel the way I just described. That's very definitely not the case. Of course *anyone* can feel that way. Just like some parents care less for their children than they do their clothes or cars. \n\nI was just anecdotally saying that once ***I***  had kids, ***I***  became much more sensitive to the suffering of children and have to moderate my feelings when on the internet in order to maintain my own mental health.",
                                                    "score": 105,
                                                    "author": "Vitruvius702",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Its straight up anger and fury on my end.  I cannot imagine the heartless bastard that did this, but if I ever met them and *knew* they were responsible, idk if I could control myself.  \n\nIt's a kid.  He didn't ask to be born. It's not his fault he's here, either.  Some fuckin people...",
                                                    "score": 26,
                                                    "author": "jjohnisme",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I mean, technically it still was since it was a kid...",
                                    "score": 22,
                                    "author": "[deleted]",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Either way, it would still have been a kid, and equally as fucked up.",
                                    "score": 41,
                                    "author": "markedVI",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You have got to be shitting me!!!!! What kind of person would do that? Wow good guy rescued the baby. I still can’t believe it.",
                    "score": 233,
                    "author": "gwgos1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How did the baby survive correct me if I'm dumb but how long before it suffocated in the black bag",
                            "score": 113,
                            "author": "Mesmeric_45",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It didn’t look too airtight. So air flow would have been lower, but it wouldn’t have been completely cut off. I don’t know how long the baby would have survived with that little airflow, but I think starvation or more trash might have done something first.",
                                    "score": 132,
                                    "author": "Turdlock",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Same here, was expecting puppies or kittens. Then the crying babies face!  I'm so glad they found it before it was too late!",
                    "score": 108,
                    "author": "TheHrethgir",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wonder what happened to it? Hopefully they brought it to a hospital",
                            "score": 28,
                            "author": "javoss88",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Same here dude, and would've been mortified if it was kittens/puppies. But this, this is just a step above...there are some truly fucked up people in this world",
                    "score": 166,
                    "author": "IconicMB",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Ditto. \n\nI was ‘hoping’ alive puppies and that shocked me.",
                    "score": 119,
                    "author": "Supersymm3try",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think we all purposely had it on mute so we didn't hear kitten or puppy cries.\n\nBut jfc I can't imagine having the mind it takes to do this to a human baby. Or any baby, really, but you can literally drop your baby off at a hospital and people do this wtf",
                            "score": 122,
                            "author": "acctforsadchildhood",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Desperate people make desperate horrible decisions. It doesn’t excuse it but maybe explains it? \n\nLike people in the grips of addiction or people who might be murdered for having a baby out of wedlock.",
                                    "score": 77,
                                    "author": "Supersymm3try",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "True. Also, these people aren’t in America. You can’t assume that you could just drop the baby off anywhere.",
                                            "score": 56,
                                            "author": "503503503",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "At least for the Unite States, there's no reason for this as all 50 states have some sort of safe haven law and have had one in place since 2008 which decriminalizes child abandonment. It has helped cut down on these types of cases here in the US. Abroad, not so much. If other countries would implement some sort of similar method to protect innocents, maybe we'd see less of this in the world.",
                                            "score": 31,
                                            "author": "aftiggerintel",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Yeah, I definitely know I did some desperate stuff when I was in my heyday of addiction, but I'm sure I'd never do *this*\n\nA teenager (15) dumped her baby (that died) in a lot exactly one year ago today, a literal block from where I lived at the time here in Philly. I would change the way I walked for the remainder of my time living there. I would've taken it in a heartbeat, not that I'm winning the lottery for best person to find a baby, but it tore me the fuck up tbh.",
                                            "score": 14,
                                            "author": "acctforsadchildhood",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah I get what you are saying, Ive been down pretty far with some pretty hardcore addictions and although I stole money from my family, which is scummy and some people would never do that, I never mugged anyone, hurt anyone or sold any part of myself. \n\nLike you say, nothing to be proud of exactly but I don’t think id stoop this low either. Although since me having a kid was never a danger as Im male, who knows what id have done had I fallen pregnant while heavily addicted.",
                                                    "score": 6,
                                                    "author": "Supersymm3try",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I was realllly hoping (is that the right word?) it would be kittens. Then I realized a bag of kittens would look way more rambunctious from the outside.",
                    "score": 36,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "My speakers are broken and I didn't have my Bluetooth headphones on, so I thought the same thing HOLY FUCK I almost fell from my chair",
                    "score": 83,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I thought it was gonna be dog not a baby",
                    "score": 15,
                    "author": "miles-robbins"
                },
                {
                    "level": 1,
                    "comment": "Same.  Expected to see some furriness when he ripped the bag open O.o",
                    "score": 7,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Please say the baby is ok :(",
            "score": 3432,
            "author": "FearlessChannel",
            "replies": [
                {
                    "level": 1,
                    "comment": "The ambulance took him and cared for him, but that's the last thing we know till now. Although I hope he's alive and well.  \n\nEdit: The authorities didn't release any official statements so far, if they do I will update this comment.",
                    "score": 3909,
                    "author": "Layth36",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "May I have some context please?",
                            "score": 503,
                            "author": "3bdulla-melee",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Baby was crying in dumpster. Investigated dumpster. They find a baby in bag in the dumpster",
                                    "score": 1187,
                                    "author": "riksauce",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Explain like I'm 5 please.",
                                            "score": 397,
                                            "author": "Dodototo",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "*noise coming from garbage* \n\nBystanders: hmm, let me check. \n\n*opens bag* human baby inside.",
                                                    "score": 364,
                                                    "author": "-hol-up-",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Can you please explain like im 4?",
                                                            "score": 43,
                                                            "author": "Astronaut-bear",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Gaga noise in trash, check and bb in there",
                                                                    "score": 65,
                                                                    "author": "Haitor98",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Can you please explain it like I’m 3?",
                                                                            "score": 30,
                                                                            "author": "CrimsonNumbers",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Baby go wee wee, human look, baby inside the bin",
                                                                                    "score": 37,
                                                                                    "author": "THA_REAL_JOKE",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 849,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Horrible situation. But this got me. I’m going to hell.",
                                                            "score": 222,
                                                            "author": "anontrev",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I needed that after this post and now I'm going back to the memes.",
                                                            "score": 20,
                                                            "author": "svullenballe"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Spongebob me lad! I've found another edit-lubbin motherfucker! Let's pop a couple-a caps in this fool, me boy! Agahagagaga!",
                                                            "score": 6,
                                                            "author": "Captain_Arzt"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "At the moment that baby sounded healthy. Couldn’t really hear any rasp in its lungs.",
                    "score": 142,
                    "author": "MoDude210",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Probably not a smoker then",
                            "score": 76,
                            "author": "DC38x",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "In this absolutely terrible and grim post, you made me stupid-laugh for long enough to remember that there are many good people in the world to combat these atrocities",
                                    "score": 15,
                                    "author": "willisbar"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "the baby is ok :(",
                    "score": 167,
                    "author": "wtph",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "unfortunately this is very  common in my country, a couple has non marital sex. a pregnancy happens. they are ashamed of the baby because they are a \"bastard\" and they throw them in the trash in a plastic bag hoping the baby would suffocate. thankfully they don't (most of the times).",
            "score": 157,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Whew, I'm a bastard, feeling thankful today to have been adopted from not a dumpster.",
                    "score": 48,
                    "author": "FixatedOnYourBeauty",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "My grandma found a baby in the trashcan too and she ended adopting her. And now she's married and even had a baby too \n \nEdit 1: Her parents tried to find her, but she refused to go with them \n \nEdit 2: When she were a kid, my uncles were bullying her, because \"she's not part of the family\" or something like that.  \n  \nAnd right now my grandma is old and had mental illness (not sure which), so she kinda crazy right now, once she refused to take the medicine, because she said that it contains poison. \nShe has like 9 kids and or they can take care of her or they don't want to take care of her, so the entire family is arguing about that. (my mom will go to China to visit her soon, btw)  \n \nBTW: when my grandma adopted her, i wasn't born yet so everything I'm saying is for what i hear from my parents.",
            "score": 1843,
            "author": "LJChao3473",
            "replies": [
                {
                    "level": 1,
                    "comment": "Super dark story incoming. My great uncle was a janitor in the '60s and found my newborn aunt in an incinerator. She was clearly biracial and abandoned. He and his wife adopted her and she survived the burns. She actually became a lawyer and is now a totally awesome person. And yeah this was the US.",
                    "score": 35,
                    "author": "hotdog_park",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Congratulations to your grandma on her wedding and baba!",
                    "score": 255,
                    "author": "melonysnicketts",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks, but when she were a kid, my uncles were bullying her, because \"she's not part of the family\" or something like that.  \n  \nAnd right now my grandma is old and had mental illness (not sure which), so she kinda crazy right now, once she refused to take the medicine, because she said that it contains poison. \nShe has like 9 kids and or they can take care of her or they don't want to take care of her, so the entire family is arguing about that. (my mom will go to China to visit her soon, btw)",
                            "score": 38,
                            "author": "LJChao3473"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Please tell you're grandma that she is the greatest person in the world!",
                    "score": 46,
                    "author": "Ultramemo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Don't worry, my mom is always tell to her good things about her every time she's sad/depressed",
                            "score": 10,
                            "author": "LJChao3473",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Happens a lot in India and the babies are generally girls. Parents abandon girl child on the road/ dustbin for dying. \nHeartless and inhumane of course but unfortunately the truth.",
            "score": 1554,
            "author": "madam_curious",
            "replies": [
                {
                    "level": 1,
                    "comment": "Let's hope they have the guilt of reincarnating into a maggot on their mind.",
                    "score": 565,
                    "author": "yuze_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sadly, they think their \"god\" is on their side, and that these babies were born as girls for their sins in their past lives. Absolutely disgusting mindset.",
                            "score": 438,
                            "author": "IWillStealYourToes",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Imo, religion is a major source of conflict and problems worldwide.",
                                    "score": 268,
                                    "author": "reyean",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Not only religion. China has equally horrible female infanticide to the point where they have human trafficking for young women/girls from other poorer southeast asian countries. It's cultural misogyny, ignorance and refusal to acknowledge women as humans deserving of the same rights and opportunities.",
                                            "score": 141,
                                            "author": "neerdowell1963",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It’s also because of their limit on how many children they can have and that a boy can continue the family name while a girl would not (in China, a girl can pass on the name in America)",
                                                    "score": 41,
                                                    "author": "SnekySpider",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "And now they have the problem of too many boys and not enough girls, so many men will be able to marry/ have kids to pass on their “legacy”",
                                                    "score": 9,
                                                    "author": "Fey_fox"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "You're wrong. Religion is an *excuse* for conflict and problems worldwide. People are horrible and feel better if it can be explained away for \"the greater good\", \"to get into heaven\", or with a simple \"We are all sinners\" and \"all sin is equal\".\n\nReligion can be an amazing thing that can help people through anxiety and grief. When you start using it to hurt others is when you cross a line. \n\nI'm not religious and never will be just because of that.",
                                            "score": 17,
                                            "author": "RockStarState",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 7,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Happens in Pakistan too. Mostly illegitimate child. But luckily we have a charity named \"Eidhi\" that picks them up. They even started putting baby cots besides common dump points in Karachi with big heading saying something like \"please put the child in the cot instead of throwing\". Eidhi has multiple adoption homes all across Pakistan. They also provide free ambulance service and shelter to women who escape torture.",
                    "score": 47,
                    "author": "eddey1999",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I dunno if this is true BUT I heard that some hospitals in the UK started charging for ultrasounds because a big minority of Asian families would abort the child simply if they found out she was female.\n\nA nurse at a London hospital told me this, although she said it's not the case in her hospital.",
                    "score": 17,
                    "author": "Princescyther",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well in India they are not allowed to tell you the sex of the fetus while it's in the womb. Only after it's born the parents know it.",
                            "score": 5,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This happens in a lot of poor countries. I was in Malawi this summer and we helped out at some 'crisis nurseries,' which are basically orphanages for children under about 2 years old. They take care of kids who were abandoned (there was one kid who had been left in a pig trough, and another that had been found inside a pit latrine) or whose family are unable to provide for an infant. A lot of times there, the child is wanted, and they would be able to provide for the child once they're a bit older, but the parents can't take care of an infant because they can't afford infant necessities or they can't take care of an infant's needs while they're still working on their farm.\n\nWhat the crisis nursery does that I think is really cool is that they don't just take the child from the parents permanently. They try to work with the parents and other family to see if they'll be able to take the child back when they're a bit older and don't require quite so much direct care and such. Or, if something happened to the mother (like she died in childbirth, which is unfortunately common), often the family will want to keep the child but can't afford to buy formula, so they'll let the nursery raise the child just until they're off formula. So they really make an effort to keep the children with their families or in their communities rather than completely raising them in an orphanage or sending them with families abroad (though they will adopt them out to unrelated families if there's no familial/community option). I just thought it was awesome because I had never heard of any orphanage like that. And the kids there have it a lot better than many children who are raised by their families in villages; they try to feed them as much as they can and help with their development however they can because they know they can't really guarantee things when they've returned to their families. And it also provides work opportunities for local unmarried/widowed women who work as the nannies. It was a really cool idea. Not a perfect solution, of course, but a solution that's helping at least a little.",
                    "score": 57,
                    "author": "ennuithereyet",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "One of my cousins (adopted from China) was left under a park bench covered in newspaper.",
                    "score": 9,
                    "author": "ArtEclectic"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is baby ok. God knows how long he or she was in there",
            "score": 717,
            "author": "sncjw30",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not too long if it was still breathing in a closed garbage bag.",
                    "score": 334,
                    "author": "Neuchacho",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's my one question about the video: shouldn't that baby be dead?  That bag was knotted.  Unless the people recording the video literally watched the bag get dumped I don't see how that baby could have lasted long.\n\nInternet searches for adult and suffocation give minutes before shutdown (and also is a weird rabbit hole of suicide).  I'm sure a baby consumes far less oxygen, but still, I can't imagine it could go for hours.",
                            "score": 173,
                            "author": "Nogster",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;Internet searches for adult and suffocation\n\nI'd say the chance that you're wrongfully convicted of a crime just went up significantly.",
                                    "score": 204,
                                    "author": "IncredibleHamTube",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I would say this video is BS and staged.  That baby is either Aquaman, the Op saw it happen and decided to record as they went, or I am missing something.\n\nI have 3 boys and when they were younger I was terrified of them choking on a plastic bag, my work badge collar, etc.  The number of babies that die by suffocation or strangulation is absurd.  It’s something like 1 in a 1000 in developed countries.",
                                            "score": 38,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Unfortunately some people will fake videos like this but usually with small animals or dogs. There’s whole channels on YouTube that all they upload is videos of “saving” the same set of dogs over and over again. This is the first time I’ve ever seen someone use a child for this though. I don’t know which ones worse, this or the kid actually being abandoned like that. If you want to watch a video exposing channels like this then check out [Paymoneywubby](https://youtu.be/_mvVQCl8fIg) on youtube",
                                    "score": 63,
                                    "author": "LockwoodE3",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Realistically, probably a 'she'",
                    "score": 235,
                    "author": "baghdad_ass_up",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s hard truth",
                            "score": 58,
                            "author": "Uhhhhhh_Idk"
                        },
                        {
                            "level": 2,
                            "comment": "OP refers the baby as a he.",
                            "score": 18,
                            "author": "Nibelungen342"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Oh shit. I thought it was a goat at first.",
            "score": 221,
            "author": "Only-here-for-sound",
            "replies": [
                {
                    "level": 1,
                    "comment": "That sound of sheer terror emanating from a human that young is not something you’ll forget soon. \n\nDid sound like a goat though.",
                    "score": 70,
                    "author": "WintertimeFriends"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 41,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was abandoned in the dumpster as a newborn! I'm 17 and come from China, so I suspect it had something to do with me being a girl and/or the One Child Policy. \n\nI am turning out pretty well and I couldn't be happier with having been abandoned. I was adopted into a kind and supportive family in the US who was financially stable and ready to have a child! I don't even have any memories from the dumpster or orphanage, and the scars have healed very well. I hope the same happens for the child in the video :)",
            "score": 1151,
            "author": "IAMA_doughball",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm so sorry your life started like that but so happy that you found a family that loves you.",
                    "score": 247,
                    "author": "mmonzeob"
                },
                {
                    "level": 1,
                    "comment": "You are a miracle baby!\n\nMy wife's uncle adopted two abandoned girls from China because of fertility issues.  Both daughters are now in college, got great grades and were student athletes.  How anyone could think they were disposable is beyond me.\n\nThese two girls make our country a better place, and it's sounds like you are doing the same.",
                    "score": 152,
                    "author": "Le_Updoot_Army",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A coworker of mine who already had five kids of his own ended up adopting three girls from China who have medical issues. One was expected not to live long so he and his wife wanted to give her as much of a life as she could have. It's been about five years since the last one was adopted and they are thriving.",
                            "score": 27,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I had a friend at university who had a similar story.  She was left in a dumpster near a US army base in South Korea, and was adopted by an American family. \n\nShe was definitely of half-European ancestry, so she figured that her Korean mother had had an affair with an American GI stationed in Korea. \n\nShe told herself that her mother had chosen that particular dumpster so that the US would take her baby - because she would be shamed, she couldn't keep her child, but she wanted her baby to have the best possible chance in life.  Thus the dumpster next to the US Army compound. \n\nWhat an awful decision to have to make.",
                    "score": 56,
                    "author": "hrafnkat",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "there is a complex legacy of half-korean adoptees in the US! \n\nthis NYT video does a good job of talking about it. the relevant clip is only about a minute long (6:48-8:00)\n[i was Adopted from Korea- heres what it was like ](https://youtu.be/xeIC1detnD8)",
                            "score": 7,
                            "author": "IAMA_doughball",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Oh my fucking God... That was a gut punch",
            "score": 49,
            "author": "Taco_Bacon",
            "replies": []
        },
        {
            "level": 0,
            "comment": "To people saying why the person taking the baby is being slow and not rush it and it's a setup. Well if it's a baby the last thing you'd want is for them to rush it, it's a newborn, you have to be calm and delicate when you carry them, obviously the dude is being careful as he doesn't want to harm the baby, a few seconds of being safe is better than 1 second of hurting the baby.",
            "score": 443,
            "author": "Layth36",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think also a very natural human reaction of being kinda nervous to open it in case it’s gruesome... it’s a kinda traumatic thing irl I’d imagine",
                    "score": 166,
                    "author": "Pantalaimon_II",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah if the baby was severly hurt or even in the brink of death and i found it it would scar me for life",
                            "score": 18,
                            "author": "Deninja2002",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Someone left a *very* lifelike decomposed baby corpse prop on the street earlier this year--so lifelike that it even fooled the cops and the coroner on scene. Eventually they did realize it was a doll, so the news posted photos of it, and even knowing it was fake, it still traumatized me. I'd link it here but I don't want to ever see it again, nor do I want to google it and look through the other awful cases that involved real babies.  Just a sad little curled up decomposing baby on the ground. It's burned into my memory. If I saw the real deal, I have no doubts I would be traumatized for life.",
                                    "score": 17,
                                    "author": "FTThrowAway123",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "There are so many safe drop off points now that this just makes no sense.",
            "score": 418,
            "author": "glensueand",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well this is somewhere in The Middle East . There’s no telling what support there is for unwanted children.",
                    "score": 334,
                    "author": "Courwes",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 307,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Saudi. I will bet this was some maid(slave) imported from SE Asia who was raped by her employer(owner). I've heard that story from Filipinos who managed to escape several times now.",
                            "score": 139,
                            "author": "ffca",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No if it was a maid they wouldn't bother getting rid of the baby as no one gives a fuck about maids or their \"honor\".  This is %100 a baby out of wedlock. Sadly this is not uncommon, having sex before marriage is illegal and culturally SUPER SUPER SUPER unacceptable. The girl's immediate family probably knew and helped her hide her pregnancy, and get rid of the baby once born.",
                                    "score": 91,
                                    "author": "Aziz_Q3",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Drop off points? Can you explain like I'm 5. I'm guessing it's a place where you can return your item after getting second thoughts",
                    "score": 30,
                    "author": "outlawbruce",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "In California they’re called [Safe Surrender Sites. ](https://www.cdss.ca.gov/inforesources/safely-surrendered-baby/surrender-sites) If you don’t want your baby or feel that you can’t care for it, you can surrender them at one of these locations (usually a fire station, hospital, or police station) without being charged with child abandonment. They become a ward of the state, AKA a foster child.",
                            "score": 82,
                            "author": "LadyGuillotine",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "It's basically a church, hospital, firestation were you can drop off an unwanted child with no questions asked. Some states have them with age restrictions of the child being given up",
                            "score": 33,
                            "author": "thanto13",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 32,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What the absolute fuck? I was expecting a puppy or something (which, I mean, isn't any better) but holy fucking shit like fuck what the fuck",
            "score": 80,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I was hoping for the best of the worst and thinking it may have been an animal.   Makes me want to vomit.",
            "score": 127,
            "author": "suzeeq88",
            "replies": []
        },
        {
            "level": 0,
            "comment": "The fact that this was filmed leads me to believe its set up. If I found a crying garbage bag my first thought wouldn’t be to get my phone out and slowly and calmly open the bag while being sure to get the whole process on video. I hope that child is alive and well but I’m not very optimistic.",
            "score": 1479,
            "author": "BallouThaBear",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not sure how real this particular video is...but [this](https://www.insider.com/footage-shows-newborn-found-in-a-plastic-bag-in-woods-2019-6) is not.",
                    "score": 201,
                    "author": "uglykimmy524",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What do you mean? The one in the link is a fake story?",
                            "score": 76,
                            "author": "psychodogcat",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No, no. Sorry, if it wasn't clear. The one I linked to is definitely real. Happened in Cumming, GA this past June. They were referring to the baby as Baby India. I was just saying that I wasn't sure how credible the original story was, but that it definitely happens and is recorded.",
                                    "score": 121,
                                    "author": "uglykimmy524",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 13,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 107,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s what I was thinking. If I heard what I thought was a baby in a dumpster I actually would think to film it just to cover my ass. Who knows what kind of questioning I would go through if I call 911 and I have a random baby with me. They would probably think I kidnapped it.",
                            "score": 30,
                            "author": "finishyourbeer",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You are just salty that it never occurred to you to close a small baby in a garbage bag and put it in a dumpster for internet points",
                    "score": 693,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What if we put the person who filmed this in a garbage bag and lit it on fire for internet points?",
                            "score": 100,
                            "author": "BallouThaBear",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "There is a whole YouTube channel that gets millions of views.   Videos of them rescuing tortured animals.  Turns out, they torture them and set up the videos of the rescue.",
                    "score": 25,
                    "author": "cmdrDROC",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Paymoneywubby exposed them",
                            "score": 10,
                            "author": "i_love_puppies12"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's not fake, the police and the ambulance arrived at the site, I saw a picture of it on a youtube video but I'm on phone so I can't link it right now. I'll update this comment as soon as I'm able to link the screenshot.  \n\nFinally got the link..  \nhttps://ibb.co/n0t7TCN  \n\nI never used that sharing website before so I hope it works out. Couldn't use imgur as I don't have the app on my phone.  \n\nThe picture was released 3 days ago so the same day this incident happened, in case you're thinking the picture is from a different accident.  \n\nI tried to find a news article about it and I found some but they're all in arabic because it happened in Saudi Arabia.  \n\nSo I'll say what I said in another comment again, the guy is being slow because he wants to be careful since he's about to grab a newborn covered in a trash bag out of a freaking dumpster. You don't want him to slip and drop the baby and hurt him/her. And the other guy started filming probably because it only takes 1 person to grab the baby and it's good he filmed it as it can be used as evidance against whoever done that horrible thing to the baby if they find them, which I hope they will.",
                    "score": 552,
                    "author": "Layth36",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Ok so are you saying that op stuffed a baby in a trash bag and a dumpster for some karma?",
                    "score": 25,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s literally what he is implying, if not OP then someone else. Pretty heavy thing to accuse someone of tbh, idk how some Redditors can be so fuckin’ dense and dissociated to not consider how fucked their assumptions are.",
                            "score": 37,
                            "author": "pankakke_",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "this happens a lot in 3rd world countries.",
                    "score": 20,
                    "author": "Tychus07",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Eh, I mean,  for what it's worth someone would still be a total piece of shit if it was set up.  Possibly more so in fact, imho",
                    "score": 9,
                    "author": "acetominaphin",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I can see it being real, nowadays if you stumble on a news event everybody whips out their phones and videos it pretty instinctively.",
                    "score": 13,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The Gang Finds a Dumpster Baby.",
            "score": 66,
            "author": "Zachb30",
            "replies": [
                {
                    "level": 1,
                    "comment": "Holy shit. There’s a baby in this dumpster.",
                    "score": 12,
                    "author": "buellster92",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Either way you look at it who ever put the baby in a bag was a total piece of shit. This is in the middle east where they have real problems. I doubt anybody staged this for reddit clout...",
            "score": 83,
            "author": "gbarghachie",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I’ve seen a lot of messed up shit but if this is real that makes me sick to my stomach.",
            "score": 29,
            "author": "ddub1776",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This hurt so much to see.",
            "score": 11,
            "author": "moregoo"
        },
        {
            "level": 0,
            "comment": "I worked in a court House for a summer. They had a case like this. Woman for the second time didn't notice pregnancy, throw the baby in a dumpster. I was shocked and didn't understand how someone could do something like that. \n\nThen I read her psychological profile. Abused at 5, given to social services, abused at 9 by social services, ran away at 11, homelessness, prostitution, drugs. Pregnant at 17. Alone, desperate. \n\nWhat she did was horrible. What was done to her was too.",
            "score": 11,
            "author": "musland",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Honestly? Because the penalty could be death by stoning for having a baby out of wedlock. Even if you got raped or anything like that.",
            "score": 28,
            "author": "ArgonGryphon",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yup the girl or women was probably desperate",
                    "score": 19,
                    "author": "bluecup212",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And everyone pointing out safe haven laws, it’s pretty obvious this isn’t America or a country likely to have that option.",
                            "score": 16,
                            "author": "ArgonGryphon"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What an ear of the guy making the discovery!",
            "score": 9,
            "author": "genusbender"
        },
        {
            "level": 0,
            "comment": "Are you fucking kidding me",
            "score": 17,
            "author": "lordsofaking",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Jesus fucking Christ",
            "score": 8,
            "author": "TheyCensoredMyMain",
            "replies": []
        }
    ]
}