{
    "id": "fzbnxn",
    "score": 93619,
    "title": "He spent 20 years breeding a super-bee that could survive attacks from mites that kill millions of bees worldwide.",
    "author": "ReasonsForReason",
    "date": 1586627662.0,
    "url": "https://www.reddit.com/r/iamatotalpieceofshit/comments/fzbnxn",
    "media_urls": [
        "https://i.redd.it/vee9j0b498s41.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "**Reminder: Do not ask for personal information, suggest someone should be doxxed, link to or comment with personal information, openly solicit personal information, or contact the people featured here. Don't even wax poetic about wanting to post identifying information. You will be banned.**\n\n**Do not encourage, glorify, or incite violence.**\n\nFor example: \"Kill yourself\", \"It wouldn't be so bad if we killed all the pedophiles\", \"This guy needs to die\", \"I hope this guy gets stabbed to death with a rusty screwdriver\", etc.\n\nAll glorification, advocacy, or suggestions of violence, EVEN IN JEST, will be permanently banned, no exceptions, and no possibility of leniency. \n\n**ALL PERSONALLY IDENTIFYING INFORMATION MUST BE CENSORED.**\n\nFailure to follow the rules of this sub will result in a permanent ban.\n      \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/iamatotalpieceofshit) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Who the fuck does this?",
            "score": 7582,
            "author": "Mama_Comic",
            "replies": [
                {
                    "level": 1,
                    "comment": "A total piece of shit.",
                    "score": 5672,
                    "author": "ReasonsForReason",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "^m I ^te SIS",
                            "score": 1225,
                            "author": "AFew10_9TooMany",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "But what reasons do they do this for really? I’ve heard of many cases where beekeepers’ work is destroyed and it’s terrible 😞",
                                    "score": 958,
                                    "author": "Sxilla",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Most likely from competitors. There is some money in organic honey. There has been many cases in the past where businesses will destroy each others hives in order to secure their hold in the market. It's awful.",
                                            "score": 1038,
                                            "author": "Celestial_Light_",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "And they catch and steal the bees too.",
                                                    "score": 443,
                                                    "author": "whereshoney",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "That is also true. Its sad because the bees end up suffering the most (in the long run). Each hive can have around 50,000 bees in the summer time. That's a lot of bees that have been destroyed. Especially since a lot of species are endangered and this deals a massive hit to their numbers overall. \n\nThe man will also suffer because its a blow to both his finances and livelihood. Hopefully he'll recover and rebuild. \n\n(Edited since some people don't understand the contexts)",
                                                            "score": 328,
                                                            "author": "Celestial_Light_",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I dunno, I kinda feel like bees that live a couple months with a brain smaller than a rice grain have less capacity for suffering than something that can look in a mirror and see 50 years of history, hopes, and aspirations.",
                                                                    "score": 177,
                                                                    "author": "CreationBlues",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "The queens live 3-5 years. There's one per hive, and she's the only one that lays eggs. Each hive is basically a five year investment, plus the investment of each hive before it if you're breeding for a specific trait like he was.",
                                                                            "score": 127,
                                                                            "author": "Lutrinae_Rex",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "You’re telling me I have worse commitment issues than a fucking bee.\nMan my therapist is going to love hearing this fun new fact about me.",
                                                                                    "score": 89,
                                                                                    "author": "zacharyblaise",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "You'd be surprised at how similar pain and other lesser emotions exist in lower life forms. Check out the studies they did with Crawdads and anxiety.\n\nhttps://www.nytimes.com/2014/06/13/science/even-crayfish-can-get-anxious.html",
                                                                            "score": 99,
                                                                            "author": "crystalshipsdripping",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Oh don't tell me that. I just ate the fuck out of some crawfish.",
                                                                                    "score": 47,
                                                                                    "author": "JiMyeong",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Bitch I will sting you.",
                                                                            "score": 5,
                                                                            "author": "bertiebees"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "As crazy as this sounds it’s true. I used to be into aquariums and frequented a local aquarium store where I got to know the owner. He told me some of the most outrageous stories of catching people poisoning his tanks to kill specific types of fish that were known to generate good reliable income. He was able to trace the activities back to a pet store distributor that he was not buying his inventory from. He decided to go online rather than have a brick and mortar and deal with the pet store mafia.",
                                                    "score": 10,
                                                    "author": "exquisitefarts"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Guess you should have some good guard dogs if you have bee hives. These people should go to jail for decades",
                                                    "score": 6,
                                                    "author": "argusromblei"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Yup... came back from Christmas holidays last year and my hives were destroyed by people too, tried to save the bees but discovered last week that the Queens were indeed as I aspected dead and only some workers were still left (so lost my hives too)\n\nIt happend to another friended beekeeper too, 2 years ago 🙁",
                                            "score": 96,
                                            "author": "MrSeniorMustache",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Do you think it was vandalism or intentional sabotage ?",
                                                    "score": 23,
                                                    "author": "RedPillAlphaBigCock",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Just vandalism I guess, to have some “fun”",
                                                            "score": 6,
                                                            "author": "MrSeniorMustache",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "That bitch. Carole Buzzkin!",
                                                    "score": 38,
                                                    "author": "zeus15king",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "competition or someone on meth who became fixated on bees",
                                            "score": 22,
                                            "author": "ILoveWildlife",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I just want to imagine a dude with a crowbar being “persuaded” by a mite to destroy the bee hives",
                                    "score": 17,
                                    "author": "Fellowearthling16",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Mites?\n\nIsis?\n\nMitosis?",
                                    "score": 30,
                                    "author": "Tastypies",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "That's an insult to total pieces of shit...\n\nThese fucks are somehow worse.",
                            "score": 38,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Considering the impact bees have on the planet as a whole, I'd be perfectly fine with these shits being charged with domestic terrorism",
                                    "score": 40,
                                    "author": "LazlowK",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My understanding is that beekeeping can be a pretty cut throat bussiness. I live in FL and both sides of my family keep hives and a few have done so on a large scale selling to candy companies and the government as well as renting to ppl who need pollinators. It's not uncommon to have your bees poisoned or otherwise destroyed by other keepers not happy about the potential drop in price of bulk honey.",
                    "score": 218,
                    "author": "KaosEngine",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Cant wait to watch Honey King next year on Netflix.",
                            "score": 195,
                            "author": "The_Golden_Warthog",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "the beeking",
                                    "score": 48,
                                    "author": "Lars0",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "\"King of Sting\", come on are you even TRYING?",
                                            "score": 53,
                                            "author": "Guy_On_R_Collapse",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Making a Pollinator",
                                                    "score": 12,
                                                    "author": "OsiyoMotherFuckers",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I feel like Queen Bee would be the best",
                                            "score": 6,
                                            "author": "FunnOnABunn"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Purely anecdotal but I had a friend in college who now keeps bees, and she's likewise said it can be \"dramatic.\" I've never heard anything about poisoning or destroying bees, but she's said there's a lot of \"bee drama\" over space in farmer's markets, who's selling to local restaurants, allegations of plagiarism, undercutting, etc.",
                            "score": 6,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Skyrim thieves guild.",
                    "score": 45,
                    "author": "Darth_Hobbit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I felt so bad about torching the beehives every time.",
                            "score": 20,
                            "author": "froz3ncat"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Most likely a rival bee keeper, it happens with chicken farms, imagine your fucking co-worker burning your cubicle to stop you from working.",
                    "score": 99,
                    "author": "iYellAtPuppys",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's more like if it was a peer from a rival company, but yeah. There are instances of cutthroat practices in nearly every industry.",
                            "score": 64,
                            "author": "tellmeimbig"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Clearly it was Monsanto. They probably stole the queens and torched the evidence.",
                    "score": 86,
                    "author": "Educational-Painting",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm so sad that I can't completely dismiss the idea.",
                            "score": 59,
                            "author": "ButaneLilly",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Monsanto no longer exists. All hail Bayer",
                            "score": 16,
                            "author": "Panwall",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Same company, different name\n\nfun fact: if you use the old monsanto emails it still goes through to Bayer.",
                                    "score": 13,
                                    "author": "eaglenotbeagle"
                                },
                                {
                                    "level": 3,
                                    "comment": "You mean Zyklon B-ayer?",
                                    "score": 11,
                                    "author": "MattcVI"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Just want to let everyone know that Monsanto is now Bayer.",
                            "score": 10,
                            "author": "PM_ME_UR_BOATHULL"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Obviously the mites",
                    "score": 99,
                    "author": "ARealFool",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "big mites was behind the hit job",
                            "score": 51,
                            "author": "Swissboy362",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Mite/11 was an inside job",
                                    "score": 26,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Conspiracy theory, someone stole the bees and ranksacked the rest to make money selling the super bees, or some random asshat",
                    "score": 19,
                    "author": "GodOfAscension",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Or someone looking to sabotage the food production of our country.\n\nWhat if the mites were introduced? Do we know how they spread?\n\nThis guy wanted to circumvent the mite's destruction, and unbeknownst to us it was foiling the master plan of thinning our herd through food scarcity.",
                            "score": 9,
                            "author": "ChamberedEcho",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "His competition.",
                    "score": 25,
                    "author": "PhantomDeuce",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Winnie the fucking Pooh",
                    "score": 9,
                    "author": "spookyspooky",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "That bitch Carol fucking Baskins",
                    "score": 97,
                    "author": "Mr_ValuJet",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Monsanto agents slash government agencies",
                    "score": 6,
                    "author": "sitdownstandup"
                },
                {
                    "level": 1,
                    "comment": "People that are angry at existence and have become bitter about their own lives to the point of needing to unleash their negative emotions on to others.",
                    "score": 5,
                    "author": "SentientRidge",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Some good news:\n\n- The arsonists would have likely smelled of smoke and been stung. Alot.\n\n- A fundraiser has raised £24k so far for the poor guy.\n\n\nEdit: Here is the [fundraising page ](https://uk.gofundme.com/f/help-replace-89yearold-beekeeper039s-setup)",
            "score": 1222,
            "author": "ReasonsForReason",
            "replies": [
                {
                    "level": 1,
                    "comment": "Those two facts make me want to hurt the people who did this just a little less",
                    "score": 1022,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "what did he say?",
                            "score": 428,
                            "author": "DigletDigler",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They said something about the fundraiser for the guy having already reached 24k and something else my goldfish brain already forgot",
                                    "score": 1131,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It’s OK don’t hurt yourself. You did your best.",
                                            "score": 977,
                                            "author": "worms9",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Just Bee yourself",
                                                    "score": 892,
                                                    "author": "ThisIsYourMormont",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "For that pun you deserve a hive five",
                                                            "score": 285,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I was about to reply with \n“hive five\nFTFY”\nThen I realized the truth",
                                                                    "score": 69,
                                                                    "author": "Wassup_Bois",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "No need to wax poetic, it's just a simple pun.",
                                                                            "score": 16,
                                                                            "author": "Scientolojesus",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "On it’s way honey",
                                                                    "score": 15,
                                                                    "author": "themightyabj"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Yeah, right!",
                                                            "score": 8,
                                                            "author": "Thuryn"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 151,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I've kept bees for years.\n\nIt would be very easy to walk up to a hive, plug them and light them on fire and then walk away without being stung.",
                                            "score": 151,
                                            "author": "JasonDragonbourne",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I’m assuming whoever decided it was a good idea to light them on fire had no idea how to plug them.",
                                                    "score": 39,
                                                    "author": "MPT1313",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Unfortunately you wouldn't even need to plug them.\n\nA standard langstroth hive would go up in flames very quickly with a little propellant and a match.\n\nEuropean honey bees are remarkably docile. So docile in fact that I usually inspect my hives without a suit. I simply walk out to the hive, take the top off, crack a frame out for inspection and as long as I don't breath on them then they tend to ignore me.",
                                                            "score": 79,
                                                            "author": "JasonDragonbourne",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "&gt;as long as I don't breath on them\n\nWhat happens if you breath on bees?",
                                                                    "score": 40,
                                                                    "author": "AltAccountWhoDis",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "They become instantly agitated and aggressive when they notice Co2.\n\nThis is conjecture on my behalf, but it appears to be an evolved response to the presence of a large organism interested in harming the hive.\n\nI can take a hive apart, holding a frame with a hundred bees holding on to it inches from my face without so much as a question; but the moment I breathe on them they launch themselves outwards in an enraged frenzy.",
                                                                            "score": 88,
                                                                            "author": "JasonDragonbourne",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Huh, TIL.  An excellent fact to know.  \n\nHow does this transfer over to just bumping into a random wild bee though?  Not that I see many anymore.",
                                                                                    "score": 47,
                                                                                    "author": "herbmaster47",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "TIL European Honey Bees are germaphobes",
                                                                    "score": 10,
                                                                    "author": "billytheid",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "They really are.\n\nThey even have guards that monitor the entrance of the hive, and if a drone comes back acting oddly(say from being intoxicated off from partially fermented pollen) then they'll reject their entrance and kick them out of the hive until they're acceptable to come back in.\n\nI'd be lying if I haven't deliberately fed a few bees some fermented nectar only to laugh at them being repeatedly kicked out of the entrance of a hive.(in good natured fun of course, they were fine at the end of the day)",
                                                                            "score": 25,
                                                                            "author": "JasonDragonbourne",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Bee Bouncers are nicer then human bouncers.  Oh what a world",
                                                                                    "score": 18,
                                                                                    "author": "billytheid"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Here's the whole comment:\n\nSome good news:\n• The arsonists would have likely smelled of smoke and been stung. Alot.\n• A fundraiser has raised £24k so far for the poor guy",
                                    "score": 35,
                                    "author": "Ptlthg",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "I want to know too",
                                    "score": 28,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Doesn’t smoke calm bees down and make them less likely to sting?",
                    "score": 83,
                    "author": "kenchan1014",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "To a certain degree, yes. This is due to the bees thinking there is a fire so they'll gorge on the honey in the hive before flying. They become more docile because they're full of food.\n\n- I used to be a beekeeper",
                            "score": 144,
                            "author": "Celestial_Light_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Is it any type of smoke or select kinds with the right properties? I've been on tours of several beekeepers' operations and they all swore by cherry wood smoke.",
                                    "score": 35,
                                    "author": "_Ov3rpowered_",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Some have their favourites. It depends on the region. You want wood which lights easy and produces enough smoke to relax the bees but not thick, black bellowing smoke. You want to relax them, not suffocate them. I never put smoke inside the hive. Only puff it around the outside and near the entrance. You don't need much.",
                                            "score": 36,
                                            "author": "Celestial_Light_"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I did wonder that. Maybe lots of direct smoke or a specific kind makes them pass out (knowledge based on Bee Movie) but article says the smell makes them angry. Watched Twin Murders movie on Netflix the other day, that said gasoline also makes them attack. But I would like an expert to weigh in. I seem to just like films with bees in them.",
                            "score": 35,
                            "author": "ReasonsForReason",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Smoke from cellulose (wood, cotton, pine needles) triggers a behavior where bees fill up with honey and prepare to abandon the hive.  They are much less likely to sting when smoke is appropriately used.  Several strong smells trigger stinging behavior.  The smell of ripe bananas, many petroleum products, many perfumes, and human breath are triggers.\n\nIn this case, the bees were probably burned late in the evening by someone tossing gas onto the hives, shed, and equipment.  Beehives at this time of year catch fire readily and burn rapidly.  Whoever did this probably did not get stung or if they did, only a few times.\n\nSource: beekeeper for 50 years.",
                                    "score": 37,
                                    "author": "Exturbinary",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt; Several strong smells trigger stinging behavior. The smell of ripe bananas,\n\nLol, that’s both fascinating and hilarious to picture. I wonder why they behave that way?",
                                            "score": 8,
                                            "author": "call_of_the_while",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The smell of bananas matches the scent of the bees alarm pheromone.",
                                                    "score": 14,
                                                    "author": "Mrcloudy",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Noooo let me believe they at least got stung mercilessly!\n\n(But thank you for your knowledge.)",
                                            "score": 9,
                                            "author": "ReasonsForReason"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Did he not have it insured as as well?",
                    "score": 15,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I wonder what his feet smell like",
            "score": 3926,
            "author": "BeautyDuwang",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s exactly what I was thinking!",
                    "score": 698,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Is your carbon monoxide detector working?",
                            "score": 232,
                            "author": "Timmytanks40",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My landlord left me a note and said not to worry about it",
                                    "score": 144,
                                    "author": "jasongill",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Jokes on him, I can't pay rent if I'm dead",
                                            "score": 48,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "But your estate can!",
                                                    "score": 12,
                                                    "author": "imgonnabutteryobread",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "NGL it's weird that we have this parasite in all our lives and we just accept that they're necessary",
                                                            "score": 5,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Unless you can scrounge up enough for a down payment on a house. In the meantime, you can continue letting the leech suck $20k/year.",
                                                                    "score": 3,
                                                                    "author": "imgonnabutteryobread"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "And I for one welcome our new insect overloads.",
                            "score": 8,
                            "author": "billytheid"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Stung with me, if you want to live",
                    "score": 116,
                    "author": "aerostotle"
                },
                {
                    "level": 1,
                    "comment": "Except - if super bees took over the world, we'd be swimming in fresh fruit, wouldn't have to scramble to find alternate pollination methods for multitudes of critical crops, and occasionally we'd get stung.",
                    "score": 167,
                    "author": "xyzTheWorst",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "We're all born in fallout-esque vaults and wear beekeeping suits to protect ourselves as we scavenge for supplies",
                            "score": 86,
                            "author": "HanSolo1519",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The fruit would be so good itd be worth it tho",
                                    "score": 47,
                                    "author": "Mragftw",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Fruit good enough for Cazador overlords 🤔",
                                            "score": 18,
                                            "author": "Wingedwing",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Could be something like how Africanized (aka killer bees) got started. Someone was trying to breed bees better suited for tropical climates by interbreeding European and African honeybees but then they got out and mixed with the local bee population to make a bee variety that was super agressive and would swarm(abandon their home) a ton. Now Africanized bees have spread to the USA and I'm sure some time traveling beekeeper would love to get rid of them.",
                            "score": 19,
                            "author": "ShpadoinkleSam",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "You're choosing to interpret \"took over\" pretty nicely.",
                            "score": 11,
                            "author": "OhMaGoshNess",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Maybe they keep us as slaves, but they still give us plenty of fruit.",
                                    "score": 7,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "lookup how killer bees came to bee.",
                    "score": 12,
                    "author": "Ahlruin"
                },
                {
                    "level": 1,
                    "comment": "I would be okay with a future being a bee subject.",
                    "score": 6,
                    "author": "eatthebunnytoo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The mites paid someone clearly",
            "score": 1588,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "you mite be right",
                    "score": 432,
                    "author": "aerostotle",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They got to you didnt they",
                            "score": 85,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They mite be giants",
                                    "score": 35,
                                    "author": "timeexterminator",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Well if that’s the case then that really ticks me off",
                            "score": 19,
                            "author": "TristanLennon"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 22,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "You never know it mite be an inside job",
                    "score": 13,
                    "author": "melancholy_wrath"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So basically they not only destroyed a person’s life work but also destroyed what could’ve been the salvation of the bee species",
            "score": 770,
            "author": "Prometheushunter2",
            "replies": [
                {
                    "level": 1,
                    "comment": "And thus humanity, we won't survive without bees.",
                    "score": 297,
                    "author": "MarkoHighlander",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "To be fair if one beekeeper proved it's possible then scientists around the world can replicate it.",
                            "score": 120,
                            "author": "fbjesjs",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I mean the beekeeper himself must be a scientist and is probably highly skilled on the subject. Scientists can't just suddenly become experts on topics and replicate things.",
                                    "score": 159,
                                    "author": "HNDRERER",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "He's not the only beekeeper and bee scientist in the world, and he's got his notes still...",
                                            "score": 56,
                                            "author": "fbjesjs",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It still took him 20 years though and that was breeding those specific bees. The work was in the bees and their DNA that are dead now, and that's not so easy to replicate. I can't imagine that this work could be replicated in anything under half the time he's spent on it.",
                                                    "score": 93,
                                                    "author": "HNDRERER",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "It's not just about the knowledge or intelligence though. Not that I'm an expert but with these things you have to breed certain types of bees for generations to get the traits you want, so by killing the bees you've eliminated several to many generations of advancement. Even if knowledge is retained or passed along to others, there is a practical bottleneck through the breeding process.",
                                    "score": 8,
                                    "author": "Cthepo"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Not really. The problem with bees isn't the mites. It's mostly humans basically abusing them and a shit ton of pesticides in our environment and on our fields.  \n\n\nWild bees in an untouched environment tend to do pretty damn fine but the amount of wild fields with all kinds of plants on them has been reduced because of our farming habits. Now obviously the bees could pollinate the plants we grow but we also use pesticides on them and that kills the bees. Also large areas with all the plants in blossom at the same time means the bees really struggle throughout the rest of the year.  \n\n\nAnd bees we keep for honey? Well they struggle with mites. But not because those mites are something new or the bees don't know how to take care of them but research seems to suggest it is because they are constantly stressed out. Normally bees clean each other and kill those mites but bees of which the honey is taken regularly seem to do this way less than bees from which the honey is taken less frequently.  \n\n\nWe don't need some super bee. We need to reconsider what we humans are doing to the bees.",
                    "score": 33,
                    "author": "Nozinger",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The optimal way to handle it would probably be to both try and lessen the amount of stress we put on domestic bees while also trying to make hardier bees that are more resistant to various complications domestic bees suffer from. Give it both barrels",
                            "score": 10,
                            "author": "Prometheushunter2"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "thank god there’s a fundraiser for him.",
            "score": 1054,
            "author": "UndeadRetical",
            "replies": [
                {
                    "level": 1,
                    "comment": "The fundraiser is a great gesture but I can't help but feel that the emotional damage of loosing your life's work is greater than any sum of money could provide. I hope that maybe a few bees escaped and he can find them out in the wild and reclaim some progress",
                    "score": 1109,
                    "author": "Beardrac",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I recently lost all of my code for a big project I was working on, I didn't keep backups. It was months worth of code, and was incredibly stupid of me not to keep safe. I was depressed for like two weeks before I started to work on it again, and the lost progress still pains me when I work on it.",
                            "score": 157,
                            "author": "Kaisogen",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Been there, done that. Follow 321 religiously now. Always keep at least three copies, in two different mediums and at least one copy offsite.",
                                    "score": 70,
                                    "author": "Hewlett-PackHard",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Was it because of no vc system in place? Or just a local vc that failed with no backup?",
                                    "score": 7,
                                    "author": "drunkforlife",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Basically something went wrong with the filesystem and for some reason a bunch of the folders in my home directory were corrupted. I ended up having to backup my data and restore my OS, so I have no idea what it was. I didn't have a VC set up anyways, but now I have it synced to a private github repo, so that'll be helpful in the future.",
                                            "score": 6,
                                            "author": "Kaisogen"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 114,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 71,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "He was breeding a super bee, it takes years of selective breeding to get those traits. He wont get this back",
                                            "score": 67,
                                            "author": "2Turnt4MySwag",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "If what he was breeding was truly mite resistant it would have been huge for the beekeeping industry. Varroa mites are the death knell for colonies so anything that could help mitigate that threat is welcome.",
                                                    "score": 41,
                                                    "author": "citadel1992",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "This was big honey’s doing",
                                                    "score": 8,
                                                    "author": "Motionshaker"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It may not be lost, some bees may have escaped and if a young queen escaped there is a chance\n  \nBut this is a life lesson, dont put ALL your research in the same area.",
                            "score": 175,
                            "author": "Random_Link_Roulette",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Bees dont' swarm during fires. The best hope is that there's a wild colony nearby or two that swarmed off of one of the hives, and that a swarm trap can capture one and recover a lot of the work that way.",
                                    "score": 142,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "So if their nest is on fire they just do the fire room dog?",
                                            "score": 18,
                                            "author": "Nebresto",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Don't they use smoke to collect honey normally? I would assume the smoke from a fire has the same effect on them. I also don't know what I'm talking about.",
                                                    "score": 12,
                                                    "author": "PineapplePZA",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Another guy somewhere in this thread said that smoke makes them eat honey, which in turn makes them more docile. But just thinking, forest fires happen, you'd think bees would do something to try to survive.\n\nI, too, have no idea what I'm talking about.",
                                                            "score": 5,
                                                            "author": "Nebresto",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "OK so here's how it works.\n\nOnce a queen is laying, she cannot fly- her body is simply too big. She needs to stop producing fertilized eggs and shrink back down first. This takes days to weeks, not minutes, so is not a possible response to fire.\n\nA colony needs baby larvae or fertilized eggs to make a new queen.\n\nThese are also stuck in the colony and unable to leave.\n\nWithout a queen or larvae, workers cannot reproduce. If the queen and brood die, it doesn't matter how many workers live. So the workers defend and protect their hive to the last, because if they don't, they have no future anyway, and no purpose in existing.\n\nThe smoke disables them detecting their alarm pheromones (the banana-smelling one caused by stings) and has them go into survival mode- store honey in their crops, get to the brood, and start fanning to blow out the smoke and vent the heat.\n\nCovering the alarm pheromone and focusing on protecting brood from fire over protecting territory from other creatures are the two big ones for beekeepers. Them gorging on nectar that they'll swallow and regurgitate multiple times as part of the honey making process anyway isn't important.\n\nBut as a result, this means that colonies can't flee fires unless they have an unmated queen and no laying queen or brood. And no bee yard should have a box that has a fresh swarm in it with no brood unless they just captured it, and they wouldn't be putting wild-caught swarms in with a breeding program.\n\nUnfortunately, unless one of these colonies threw a swarm and that swarm survived nearby, this project is screwed. :C",
                                                                    "score": 15,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Damn, bees got it rough.",
                                                                            "score": 4,
                                                                            "author": "Nebresto",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "They're basically tiny robots, to be entirely honest. Provide them an environment with certain amounts of constrained space and you can get them to consistently build the same wax structures the same way. Most of beekeeping is exploiting the \"programming\" they use for survival.\n\nThey build wax combs from tiny secretions gathered off of their bodies, little flakes of wax. Even when just placing them down, the bees automatically make them into hexagons of fairly consistent size, even though it's being made on bare wood.\n\nThey will build this nest out and down until they reach a wall or floor, then start constructing another one. They don't care about things like a big picture or efficient use of space. They drop a few wax flakes, follow instructions that say \"If &lt;Home&gt;, add wax to nest.\" then they find a point that needs wax. If they are too close to an object they won't apply the wax. So by providing them a starting strip to build down from, we can control the combs they build- or we can even provide a full sized wax sheet for them to just build cells off of without having to construct the back of the cells themselves.\n\nWe use smoke to prevent them from getting too sting happy during inspection and harvest, exploiting the \"brood defense\" programming.\n\nWe exploit the fact that instead of killing off all the workers and drones and hibernating for the winter, the Queen and colony all have to live through the winter. They store flower nectar as fuel to get them through, and they don't store pollen anywhere near as much since they aren't going to be making babies during the winter and don't need the proteins.\n\nJust so happens that this stored flower nectar is kept in such a way that it's not only safe to eat, but high in calories and requires no extra effort to preserve beyond sticking it in a container that keeps water out.\n\nI'm done stonedrambling about my favorite bugs now though, check out 628dirtrooster, jpthebeeman, schawee, or any other Youtube beekeepers if you wanna know more. Personally, I'm a huge fan of videos of cutouts as well as maintenance and deciding on how to do splits and prevent swarming.",
                                                                                    "score": 12,
                                                                                    "author": "[deleted]",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "This isn’t a life lesson at all.",
                                    "score": 72,
                                    "author": "38474739294747392038",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "100% you should always have backups. In this case he should’ve been sharing queens. One natural disaster could’ve wiped out all his research as well. Chances are he has friends in the community that he has given queens to and he should be able to recover.",
                                            "score": 69,
                                            "author": "TexasTechGuy"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Kinda is, it's the importance of back ups. You shouldn't store all your important files in one place, same for your bees.",
                                            "score": 28,
                                            "author": "946789987649",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You can’t pay for 20 years of work. It’s also the mental damage of 20 years work down the drain. I can’t imagine the pain.",
                    "score": 26,
                    "author": "Nickthen00b"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That makes me so fucking angry!",
            "score": 484,
            "author": "ItsRastas",
            "replies": [
                {
                    "level": 1,
                    "comment": "My best guess is that the arsonist just fucking hates bees and lives near this guy. How dare he create a home for these those vile creatures! Or something like that.\n\nIn other news, my phone just auto corrected my typo \"ducking\" to \"fucking.\" I guess that shows which word I use more frequently...",
                    "score": 171,
                    "author": "gravity_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'd love to help this guy with ALL his problems",
                            "score": 21,
                            "author": "DaFetacheeseugh"
                        },
                        {
                            "level": 2,
                            "comment": "Nah, this is financially motivated",
                            "score": 4,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Do you know or just a hunch? I guess that could be the case too",
                                    "score": 3,
                                    "author": "gravity_",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I cry for him. Unfathomable loss.",
            "score": 120,
            "author": "nocathos"
        },
        {
            "level": 0,
            "comment": "There's a certain corporation out there that would really like to monopolize the entire food industry, including pollination.",
            "score": 427,
            "author": "HiddenCowLevel",
            "replies": [
                {
                    "level": 1,
                    "comment": "if you look at the removed comments you will see that corporations name",
                    "score": 144,
                    "author": "keeppointing",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm not American, so I'm going to guess. Is it Monsanto?",
                            "score": 107,
                            "author": "PirkhanMan",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "FYI, you can replace the r in a reddit link with a c and it will show you the removed comments.",
                                    "score": 73,
                                    "author": "keeppointing",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Really? Teach me wise one, for I have tried and failed.",
                                            "score": 31,
                                            "author": "BluxyPlaguey",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Try removing everything before reddit.com (ie https and www.), it should work",
                                                    "score": 14,
                                                    "author": "Iihatepineapplepizza"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "c eddit, not reddit /c",
                                                    "score": 13,
                                                    "author": "mavhun",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Can you just say it?",
                    "score": 32,
                    "author": "crampedstyl",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I assume he's referring to Monsanto",
                            "score": 44,
                            "author": "ItsTheNuge",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "So, targeted hit maybe? Conspiracy theory in motion?",
                    "score": 23,
                    "author": "Buggeroni58",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They are very powerful and quite evil tbh",
                            "score": 12,
                            "author": "robotbird123"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Crimes like these should count as crimes against humanity.",
            "score": 545,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well when hive collapse kicks in and people are starving to death - it will be.",
                    "score": 121,
                    "author": "karatebullfightr",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No it won't. Environmental issues will never be prosecuted as harshly as they should be. \n\n\nWe'll be drinking literal fracking runoff and dying by the 1000s and nothing will be done.",
                            "score": 31,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Billionaires gotta billionaire.",
                                    "score": 5,
                                    "author": "Burnham113"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Terrorism, and a threat to public heath. Crimes against humanity for sure",
                    "score": 146,
                    "author": "LordNelson27",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Next up: fireproof bees",
            "score": 106,
            "author": "someguy00004",
            "replies": [
                {
                    "level": 1,
                    "comment": "That sounds like a recipe for a horror movie in the 80s.",
                    "score": 35,
                    "author": "AwfulAim",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Its not quite as terrible a recipe as my attempt at bee shark hybrids.",
                            "score": 11,
                            "author": "crazyabe111",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Barks or shees?",
                                    "score": 5,
                                    "author": "Haithere32",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I prefer \"Buzz kills\"",
                                            "score": 9,
                                            "author": "hendergle"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I hope those monsters are arrested.",
            "score": 106,
            "author": "ItStillIsntLupus"
        },
        {
            "level": 0,
            "comment": "Let’s hope the punishment fits the crime.",
            "score": 144,
            "author": "Heezneez3",
            "replies": [
                {
                    "level": 1,
                    "comment": "beat, and then burned alive?",
                    "score": 98,
                    "author": "Mr_InTheCloset",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And someone must stuck a pinecone in his ass and rip it out like a beyblade cord.",
                            "score": 55,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Graphic but fitting",
                                    "score": 15,
                                    "author": "tbl44"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Usually i dont condone violence but usually i condone violence",
                            "score": 9,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Covered in bees.",
                            "score": 8,
                            "author": "Poutine-Poulet-Bacon",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "How could it? What possible punishment could be enough?",
                    "score": 5,
                    "author": "ComradeCatgirl",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Monsanto no longer goes by that name. They are a Bayer company.",
            "score": 15,
            "author": "TheRealSlimLorax",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I almost wanna delete this sub because its makes me so sad people suck man ! I hope he gets some justice and some bees back",
            "score": 57,
            "author": "bogusbigotry",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Isn’t that a literal crime against humanity, since if bees go extinct, humans have less than a decade to live?",
            "score": 29,
            "author": "android_728",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Oh man, I sincerely hope karma bites them... or rather stings them severely",
            "score": 36,
            "author": "SwtIndica",
            "replies": [
                {
                    "level": 1,
                    "comment": "They may end up like that one teacher who was killed by mutant super bees on the X Files",
                    "score": 6,
                    "author": "Good_Ol_Weeb",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "3rd generation beekeeper here. Breeding for mite resistant hygienic is industry standard. I'ts not as though this beekeeper had a miracle bee breed to save the industry. but it's still awful. I feel bad for this guy, he spend years of selective breeding to create a gene strain for himself to help combat Varroa mites in his colonies. My heart goes out to my fellow beekeeper.",
            "score": 7,
            "author": "Osee"
        },
        {
            "level": 0,
            "comment": "I swear, this makes my blood boil. God I wish I could do something for this guy, not to mention the poor bees. Mites suck, I know nothing about bee's but mites killed 2 of my mice, favorites nonetheless. To think this guy was doing something so kind to help the planet, and someone could do this??? Terrible excuses for human beings.",
            "score": 28,
            "author": "Penelopeep25"
        },
        {
            "level": 0,
            "comment": "Imagine contributing to the long term fall of humanity",
            "score": 9,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "My eyes filled with tears for this man. I know a local bee keeper and she takes care of them like her babies",
            "score": 9,
            "author": "WilliamStorm"
        },
        {
            "level": 0,
            "comment": "I am a beekeeper. Can confirm, mites are a butthole and a half to deal with.",
            "score": 7,
            "author": "lemortede3",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I’m about to commit a war crime",
            "score": 6,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "We need to help him",
            "score": 6,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "In my opinion, this should be up there as a very heavy crime. Destroying someone's life ambition and years of hard work is honestly life shattering.",
            "score": 5,
            "author": "ItzPrizmah"
        },
        {
            "level": 0,
            "comment": "Is there anyone who can arrange a go fund me for this guy?",
            "score": 5,
            "author": "Oddelbo",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I keep bees. I also keep heavy duty bear traps and barbed wire snares on the trails leading to my bee hives for this very reason. Walk through brambles or lose a foot, you aren’t touching my babies without some pain\n\nEdit this is fucking sad though. I would spit on the person who did this",
            "score": 6,
            "author": "CarbonBasedHombre"
        },
        {
            "level": 0,
            "comment": "That was literally humanities best hope for survival with bees and its all gone.\n\n\n**FUCK**",
            "score": 12,
            "author": "James_moist",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Just when I think people in a civilized society couldn't disappoint me any further😔",
            "score": 9,
            "author": "buddy8665"
        },
        {
            "level": 0,
            "comment": "If I remember correctly a GoFundMe quickly raised enough money to start him up again. I guess that was the silver lining to a crummy situation.",
            "score": 9,
            "author": "kachowlmq",
            "replies": []
        },
        {
            "level": 0,
            "comment": "If I was the police, I would have beaten him until his head was swollen.",
            "score": 11,
            "author": "ZiOnIsNeXtLeBrOn",
            "replies": [
                {
                    "level": 1,
                    "comment": "After a fair trial, right?",
                    "score": 7,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Why? He just got his beehives destroyed, now you want to beat the poor old man?!",
                    "score": 5,
                    "author": "ha2noveltyusernames",
                    "replies": []
                }
            ]
        }
    ]
}