{
    "id": "myy6ek",
    "score": 167612,
    "title": "Cop plants crack on crime scene and gets mad when he knows he's being recorded",
    "author": "_deathrowe_",
    "date": 1619445215.0,
    "url": "https://www.reddit.com/r/iamatotalpieceofshit/comments/myy6ek",
    "media_urls": [
        "https://v.redd.it/bsjp5ewfwiv61"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "**Reminder: Do not ask for personal information, suggest someone should be doxxed, link to or comment with personal information, openly solicit personal information, or contact the people featured here. Don't even wax poetic about wanting to post identifying information. You will be banned.**\n\n**Do not encourage, glorify, or incite violence.**\n\nFor example: \"Kill yourself\", \"It wouldn't be so bad if we killed all the pedophiles\", \"This guy needs to die\", \"I hope this guy gets stabbed to death with a rusty screwdriver\", etc.\n\nAll glorification, advocacy, or suggestions of violence, EVEN IN JEST, will be permanently banned, no exceptions, and no possibility of leniency. \n\n**ANY INFORMATION THAT CAN BE USED TO IDENTIFY SOMEONE MUST BE CENSORED.**\n\n**DO NOT POST SCREENSHOTS OF REDDIT CONTENT. DO NOT POST REDDIT DRAMA THAT YOU ARE INVOLVED IN.**\n\nThis subreddit is not here to help you win your reddit fight or to bring justice to someone who said something you disagree with. You will be banned if you post screenshots of anything that can be found on Reddit from the information in the screenshot or from comments in your user history. We are not your personal army. \n\nFailure to follow the rules of this sub will result in a permanent ban.\n      \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/iamatotalpieceofshit) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "\"you have nothing to fear if you have nothing to hide\"",
            "score": 11559,
            "author": "Detective-E",
            "replies": [
                {
                    "level": 1,
                    "comment": "As the imperial inquisition says, “innocence proves nothing”",
                    "score": 2054,
                    "author": "worldmaker012",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If they were innocent the Emperor will know his own, enact Exterminatus.",
                            "score": 431,
                            "author": "Soad1x",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ave Imperator!",
                                    "score": 48,
                                    "author": "FeralCunt",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "For the glory of the Imperium!",
                                            "score": 16,
                                            "author": "darkaura019",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Better a hundred innocent dies than one heretic escapes punishment.",
                            "score": 237,
                            "author": "Swesteel",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well if they are truly as innocent as they claim, surely the God Emperor would have save their souls no? Only a heretic would die in the hand of the righteous.",
                                    "score": 94,
                                    "author": "Donut_Police",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "\"law and order\"",
                    "score": 1653,
                    "author": "HeavensCriedBlood",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "*dun dun*",
                            "score": 503,
                            "author": "potentpotab1es",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Nah nah nah nah naaaaah",
                                    "score": 128,
                                    "author": "DevinCampbell",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "**dun dunnnn**",
                                            "score": 44,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Nah nah nah nah naaaaaaah naaaaaaah",
                                                    "score": 22,
                                                    "author": "IDontFeel24YearsOld",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Dun duunnn",
                                                            "score": 17,
                                                            "author": "HANDRONICE",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;Cheery was aware that Commander Vimes didn't like the phrase 'The innocent have nothing to fear', believing the innocent had everything to fear, mostly from the guilty but in the longer term even more from those who say things like 'The innocent have nothing to fear'.” \n\nTerry Pratchett, *Snuff*",
                    "score": 301,
                    "author": "kandoras",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Terry Pratchett did not fuck around",
                            "score": 53,
                            "author": "Linzorz"
                        },
                        {
                            "level": 2,
                            "comment": "I swear Sir Terry was the greatest social commentator of the 20th/21st century.",
                            "score": 32,
                            "author": "bainardgray",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Man, I haven't read any Pratchett, but every single quote I see from his books is pure gold. He's definitely on my list now. If anyone has a good recommendation for a book to start out with, please let me know!",
                            "score": 33,
                            "author": "CthulhuShoes",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Start at \"Men at arms\" and then read the rest of the \"watch\" series. \"Men at arms\" is the second in the series but you don't need the first to understand what is going on and the first one is a bit weak.\n\nThe \"watch\" series is one of the best pieces of literature I have ever read. It follows the lives of a group of police officers in a fantasy world and covers topics of racism, power abuse, personal responsibility and justice. Can't recommend it enough.",
                                    "score": 27,
                                    "author": "P-K-One",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "\"“Vimes closed his eyes, and thought about cigar smoke and flowing drink and laconic voices. There were people who’d steal money from people. Fair enough. That was just theft. But there were people who, with one easy word, would steal the humanity from people. That was something else.” \n\n“So many crimes are solved by a happy accident—by the random stopping of a car, by an overhead remark, by someone of the right nationality happening to be within five miles of the scene of the crime without an alibi…”\n\nMen At Arms is so good.",
                                            "score": 11,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "All cops need to go to the Vimes Training School",
                            "score": 22,
                            "author": "the_spinetingler",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Question is, why does he have crack",
            "score": 8209,
            "author": "cupofsalt123",
            "replies": [
                {
                    "level": 1,
                    "comment": "Just sprinkle some crack on him Johnson",
                    "score": 4329,
                    "author": "Hudchrist",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Open and shut case!",
                            "score": 899,
                            "author": "iamluciferscousin667",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "\"This *** hung pictures of his family all over the house..\"",
                            "score": 710,
                            "author": "ADMINlSTRAT0R",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I saw it once before when I was a rookie.",
                                    "score": 287,
                                    "author": "unshifted",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "All these years of thinking he was exaggerating. Very wrong",
                            "score": 115,
                            "author": "Sergnb",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "***'Only Thing That Stops A Bad Guy With Crack Is A Good Guy With Crack'***",
                    "score": 697,
                    "author": "TokoyoEU",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you, I chuckled at this pretty hard.",
                            "score": 51,
                            "author": "occamschevyblazer",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's part of the standard equipment for police cars in low income neighborhoods. Just like all their tasers have been replaced with more guns. /s",
                    "score": 2319,
                    "author": "moon307",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sorry I forgot I had a taser",
                            "score": 417,
                            "author": "Pickled_Kagura",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's okay. To counteract this mistake in the future we will replace your taser with another gun. So you can dial wield guns like Neo, or a sick anime protagonist. Either way, if you have two guns, you MUST be the hero. Pew pew!",
                                    "score": 174,
                                    "author": "FeralDrood",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You know when white kids get pulled over and the cops find drugs and confiscate them but let the kids off with a warning?\n\nThose drugs don't go into evidence. There would be questions. \n\n\"Where did these come from? Why didn't you arrest them?\"\n\nThe answer is that either A. The cops do the drugs or B. The cops plant the drugs on someone to get an arrest or bump up a misdemeanor to a felony.\n\nMy uncle was a sheriff deputy and used to love telling stories about how they'd add a couple grams of whatever they had handy to the amount someone was picked up with in order to bump up the charges. Simple possession becomes intent to distribute. A misdemeanor pot charge with 30 days and a fine becomes a felony with 5-10 years.\n\nIt's fucked.",
                    "score": 1587,
                    "author": "ashok36",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The small town in Tennessee where I grew up was notorious for similar practices.  They'd bust people with drugs then give those drugs to known dealers (one of them being the sheriff's fuck up son) to put them back into circulation.  The sheriff himself was suspected of selling out of his own police car.  He'd park in a empty paint store parking lot across from the movie store I worked and have a dozen+ cars pull up to him over the course of an hour, none staying for more than a minute or two.\n\nSome years later, after being busted yet again for meth (and others), the son was escorted to the county line and told if he ever came back, he'd go to jail.\n\nSmall towns in the south can be (and often are) absolute shitholes.",
                            "score": 400,
                            "author": "weefa",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The large city where I grew up used to do a very similar thing. Cops in some areas especially where I grew up used to shake down drug dealers, take all their drugs and cash, give the drugs to there contacts to sell for them and keep the cash. Everyone thought the people that got picked up and relieved of their drugs and cash were snitches because they would be back on the streets in a matter of hours.",
                                    "score": 43,
                                    "author": "Sir_Earl_Jeffries",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt;The answer is that either A. The cops do the drugs or B. The cops plant the drugs on someone to get an arrest or bump up a misdemeanor to a felony.\n\nAlso option C. The cops sell the drugs to their drug dealer friends who turn them for an even bigger profit. \n\nSource: a new cop who was trying to impress me by bragging about the things he would get to do once he was no longer a rookie.",
                            "score": 221,
                            "author": "Picture_Day_Jessica",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "D The cops give the drugs to the underaged girls they like to party with. Source: Small Southern town.",
                                    "score": 128,
                                    "author": "cream_uncrudded",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Followed by E. The cops have \"consensual sex\" with the underage girls in the back of their cruisers.",
                                            "score": 53,
                                            "author": "LordFrogberry",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Could you kindly record your uncle talking about that and have anyone he ever arrested and jailed on a drugs charge released? Thanks",
                            "score": 282,
                            "author": "DontPoopInThere",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "For real though. These aren't some fish tales from ol' racist uncle Ted. He's a criminal who ruined people's actual lives!",
                                    "score": 177,
                                    "author": "xeromage",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Aw man imagine if we could get all cop families to narc like that.  Call it a protest movement to get people on board.  Media will have a field day.",
                                    "score": 124,
                                    "author": "Eruharn",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;imagine if we could get all cop families to narc like that.\n\nI'm enjoying the irony of the word *narc* being used in this context.",
                                            "score": 78,
                                            "author": "BentGadget",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 33,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "White guy here, can confirm. I’ve been let off by cops on three separate incidents when caught with cannabis. Each time they took my stash (one time a half ounce of Sweet Island Skunk!!) and told me to stay out of trouble.\n\nMost I ever got was a paraphernalia ticket, and that was because I tried to run from the cop in my truck, instead of just taking the L when caught speeding.\n\nThe system is so broken and racist to its core.",
                            "score": 213,
                            "author": "PorqueNoLosDose",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The same reason they carry, and I'm quoting the police academy instructor here, \"throwdown weapons\". The lesson was, wink wink, nod nod, you definitely *shouldn't* carry a random gun around with you in case you need to justify a shooting.",
                    "score": 141,
                    "author": "ExtraLeave",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It was a horrifying day in law school when our Civil Rights Actions professor started talking nonchalantly about how to cope with dropper weapons and drugs--not because it's something that people involved with the justice system have to deal with, but because it's *so common and ordinary* that legal academics consider it *as a matter of course.*\n\nPolice corruption is endemic enough that we have to devote time to it in American law schools teaching people how to interact with it. So in addition to spending time in that class talking about sophisticated legal questions involving the development of qualified immunity, Fourth Amendment jurisprudence and the exclusionary rule, and what constitutes a violation of the right to confrontation, we also got to talk about the prevalence of dropper weapons in the trunks of the Chicago PD's cruisers and the fact that from time to time a client is just going to be up the river with a deck stacked against him, and that's just part of private practice.",
                            "score": 178,
                            "author": "xhieron",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What are your thoughts on law school for prospective law students? What's the job market like? Does the world need more lawyers, or should we look elsewhere to make our mark (and money)?",
                                    "score": 25,
                                    "author": "GreatQuestion",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 61,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "To signal planned intent to the court",
                    "score": 92,
                    "author": "lordheart",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’ve seen this clip before, but I never realized until now that you can hear the cop yelling **Your phone is evidence!** Hilarious.",
            "score": 16559,
            "author": "PersonMcHuman",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thats why you livestream it rather than just record it",
                    "score": 8762,
                    "author": "Flyingbluejay",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I agree, live stream it. Also, don't tell the cops they're being recorded, let them incriminate themselves further.\n\nIf she hadn't told him it was being recorded, the cop might have gone, \"Look, I found crack just laying right here!\" after handling it. His pretending to have just found it after planting it is stronger evidence than him fiddling with it in the grass.",
                            "score": 4785,
                            "author": "IAmJustAnotherFool",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I feel your sentiment, but as mentioned, the person recording didn't tell the cop. Plus, stopping the cop is pretty important. Reversing the crack charge, even with footage of the plant, is very difficult and even then, the cop probably won't see consequences. But the man absolutely will. Fuck, that's enough reason (according to cops and the system that let's them get away with it) to say that the man on the ground was \"resisting and likely high on crack so I had to shoot him.\" \n\nHold cops accountable, yes, but save that dude's ass first",
                                    "score": 2311,
                                    "author": "jojogogo6868",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "but if you scroll down further on this thread, you see the recorder's strategy of \"pointing it out\" didn't work; the cops still claimed the drug belonged to the arrested guy and the cops were cleared of any wrongdoing.",
                                            "score": 746,
                                            "author": "PG2009",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The guy probably plead guilty before he ever knew that the tape existed. For those of you who have never been in the American court system here's what they do: they'll say you can plead guilty, I will let you go with time served, or you can plead not guilty sit in jail for another 6 months waiting for trial and then we'll put you in jail for ten years after we convict you. \n\nAlmost everyone pleads guilty regardless of whether they did anything, somewhere near 85%.",
                                                    "score": 646,
                                                    "author": "KarmicComic12334",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Can attest this is true.\n\nOnce I was on the way back from the texas/Mexico border area, a town called me eagle pass. I had spent about 8 months down there on a job and me and a co-worker were heading back to Houston. Co-worker was driving, and speeding a little so a state trooper lit us up.\n\nThe driver, my co-worker, was Hispanic in ethnicity but born in America. Had a Texan accent. I'm a white male and was about twenty at the time. I'm guessing the state trooper saw us and thought \"Drugs\" because he immediately asked to search the vehicle. We had all of our belongings we took on the road with us, but nothing illegal and it was a company vehicle so we consented to the search.\n\nHe found no drugs, but I had a pair of novelty nunchucks in on of my bags, because I was twenty year old male and I guess at the time thought I was a ninja? I don't know. However the officer arrested me on charges of Unlawful carrying of a weapon claiming the nunchucks were a club. I bailed put a couple days later and spoke to a lawyer. Lawyer told me since I crossed county lines I was considered traveling in which case it was legal to carry the weapon I had on me in Texas. Told me to reset my court date and we would get it dismissed. I come into court (keep in mind I spoke to my bondsman the evening before to ensure them I was showing up) and was informed my bondsman had revoked my bail.\n\nThe prosecution told me I could plea guilty and take a year of unsupervised probation and a small fine or go back to jail and have to bond back out (which I had neither money or time for after the first bond and lawyer retainer). So I plead guilty, ultimately the unsupervised probation wasn't really an issue. I didn't get in trouble again but I now have that charge on my record, and has cost me a coupen jobs I've applied for since then.",
                                                            "score": 356,
                                                            "author": "CobaltCam",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "The fact that this happened in Texas, where I would guess something approaching 50% of the population keeps multiple guns locked in their trucks 24/7, is really wild.",
                                                                    "score": 239,
                                                                    "author": "BashClassy",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "There was a mossberg maverick 12 gauge in the truck too, but they didn't care about that?",
                                                                            "score": 47,
                                                                            "author": "CobaltCam",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "“That shotgun is pretty sweet and totally fine, but nunchucks!? You sick fuck!” - Highway Patrolman (probably)",
                                                                                    "score": 48,
                                                                                    "author": "[deleted]",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "The police dept investigated themselves and, amazingly, found they did nothing wrong.",
                                                            "score": 363,
                                                            "author": "PG2009",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "My officers carry out their investigations to the letter of the law. The letter.",
                                                                    "score": 71,
                                                                    "author": "seanyseanerson",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "This investigation brought to you by the letter R.  Racism",
                                                                            "score": 99,
                                                                            "author": "Loqubs",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "yup, they're big on letting you know, \"if you don't plead guilty and make us waste time having a trial for you we will find a way to hit you with the MAXIMUM sentence.\"\n\nor you can plead guilty do a much reduced sentence and not worry. it's fucked because most of the time the lawyer will push for a plea as well for quicker money.",
                                                            "score": 73,
                                                            "author": "Kodyak",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "When I was an intern a lawyer straight up told me \"they come at you with everything they've got if you exercise your rights and try to fight charges against you.\" And I've found that seems to be true, unfortunately.",
                                                                    "score": 53,
                                                                    "author": "[deleted]"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "You need a better lawyer. \n\nI've hired a lawyer two times in my life, and he crushed it both times. The first time, he turned three felony charges into a disorderly conduct and $300 fine without me even having to show up to court. The second time, he got a lawsuit against me tossed in literally under five minutes, on a paperwork technicality. That dude was excellent.",
                                                                    "score": 30,
                                                                    "author": "freeLouie",
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Not just in Texas, Washington state too. When I was in my early 20’s, I was in addiction and a cop stopped me at a gas pump and said that I was caught on camera stealing from a beauty supply store. I know everyone says they’re innocent, I promise I was. I supplied my drug habit by blowing through money that was saved for me when I was a kid. Anyways, long story short my public pretender told me that I needed to plead guilty and take the deal or I could go to jail for 30 days or more if just one person on the jury doesn’t believe me. I said no. I was very adamant that I wanted to go to trial because I did nothing wrong. In the end, the charges were dismissed and I didn’t hear of it again. I’ll be honest though I was afraid of being sick in jail. I was afraid of it all but I kept telling myself that I did nothing wrong and that there is no proof that could say otherwise. I know this kind of thing doesn’t always happen for everyone but I do agree that they hate when you want to go to trial and will do any and everything to scare you out of doing it. It’s pretty shitty.",
                                                                    "score": 13,
                                                                    "author": "neonn_piee"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Hell, a judge actually straight told my dad, in open court, \"Look, if you just plead guilty, it'll go easier for everyone\"\n\nMy dad was totally innocent and refused to let it go. After getting an expensive lawyer (thanks to my grandmother) the charges were dropped. \n\nMy dad was a passenger in a car. The owner of the car was driving with the owner's young son in the backseat.  Owner of the car started driving like a maniac. My dad called me from the passenger seat freaking out. The car crashed (didn't hit anyone else, thankfully). Owner got out, got son out. My dad's door wouldn't open, so he got out the drivers side.  \n\nCops showed up and called the camera operators.  \"older male (my dad) got out of the drivers side\".  My dad got arrested and charged with all kinds of things like DUI and endangering a minor.  Owner of the car was charged (and convicted) of obstruction for repeatedly trying to confess to actually driving and crashing. Video evidence was \"lost\"\n\nHe's white, but was wearing his biker clothes. Our state SERIOUSLY hates bikers. Almost as bad as they hate Native Americans. He was asked which club he rides with repeatedly. He doesn't ride with a club and hasn't in 30 years, but they didn't believe him.  The vest he was wearing still had the hole in it where the patch was ripped off (he was kicked out of the Outlaws for not following their rules, which I find hilarious)",
                                                            "score": 46,
                                                            "author": "cindyscrazy",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "&gt; kick out of the Outlaws for not following their rules\n\nYou’d think they’d make him de facto king",
                                                                    "score": 11,
                                                                    "author": "[deleted]"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Its actually more like 92% now.",
                                                            "score": 11,
                                                            "author": "phire_con"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "If she didn’t tell him, the cop would have continued planting the drug. Sure there would be evidence, but it’s not like anything would happen to the cop in court, and it’s very possible the drug charges still would have stuck. Better to stop it before it hits the broken system.",
                                    "score": 654,
                                    "author": "Zehdari",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Cop should be convicted for possession; clear and simple case right there.",
                                            "score": 90,
                                            "author": "Frannoham",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "With the intent to distribute...",
                                                    "score": 64,
                                                    "author": "FigMcLargeHuge"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I agree with both your post and the post you're replying to!\n\nGoddamit.",
                                            "score": 213,
                                            "author": "Games_sans_frontiers",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Damned if you do, damned if you don’t. The system isn’t even broken at this point, it’s cleverly designed to be oppressive",
                                                    "score": 105,
                                                    "author": "qunelarch",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Conflict theory. The theory that laws are created for the rich against the poor. That $200 fine for a specific ticket means nothing to those in power vs the over policed low income areas.",
                                                            "score": 30,
                                                            "author": "morbidhoagie",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 35,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I mean personally that cop looks like hed in unlawfyl possession of a controlled substance. He clearly had the intent to distribute it. He was tampering with evidence. And by claiming the witnesses phone was evidence he could qlmost get slapped with obstruction of justice. \n\nNot that he will though. He has a get out of jail free badge.",
                                            "score": 97,
                                            "author": "A_Poopish_Fart",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Here in france, they want to make it more difficult to share videos of police online and it's a shame because some cases only get attention this way. There is corruption in the police that needs to be shared",
                                                    "score": 37,
                                                    "author": "testing1838291",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "All around the world. Fuck the police. Something has got to give. Civilians are the majority, not the pigs.",
                                                            "score": 29,
                                                            "author": "Cumfart_420",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I’m pretty sure they doubled down and said it was the suspects drugs after this video was releases",
                                            "score": 19,
                                            "author": "how_do_i_name",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "If she didn't tell him her husband (or brother or whoever) would have gone to jail and there would be a whole months or years long legal process to deal with.  I seriously doubt these people have the time or money to deal with that bullshit.",
                                    "score": 35,
                                    "author": "45th_username"
                                },
                                {
                                    "level": 3,
                                    "comment": "To be fair, the person who said that wasn’t the one that was recording it was the person being framed and having their rights trampled over. A lot of people aren’t thinking it’s ok to go to jail and lose my job the evidence will come out and show I’m being wronged they just want to stop being wronged before their life gets ruined",
                                    "score": 140,
                                    "author": "Strick63",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Even with this they'll probably still arrest him for resisting arrest for calling out their bullshit.",
                                            "score": 19,
                                            "author": "Karmanoid"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The ACLU has apps for just this purpose.",
                            "score": 248,
                            "author": "HobbitPorno",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 48,
                                    "author": "[deleted]",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Does anyone know of one that works outside the USA?",
                                    "score": 50,
                                    "author": "idzero",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 11,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Well technically it is evidence",
                    "score": 1649,
                    "author": "UtkaMotion",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "True, it is evidence. For the cammer to send to the FBI...",
                            "score": 846,
                            "author": "scut_furkus",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 259,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Or it is for the case he thinks it's for and that's why he's so desperate to grab it...",
                                            "score": 90,
                                            "author": "scut_furkus",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The video is but the phone itself is not. In any case dude needs a warrant and can’t just snatch it.",
                            "score": 90,
                            "author": "SauceOfTheBoss",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I bet he was *so* excited when he first learned that loophole. Cops shout legal excuses like they're magic spells that make the consequences of their actions disappear.",
                    "score": 311,
                    "author": "VegasBonheur",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "STOP RESISTING   \n\n\n\\*literally just sitting there\\*",
                            "score": 184,
                            "author": "Joe_Jeep",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They’ve said it to people that were friggen *unconcious* before.  \n\nYou can’t get much more unresistant than that...",
                                    "score": 99,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Isn't that ostensibly why Chauvin kept \"restraining\" Floyd long after he was already dead? He thought the corpse was resisting.\n\n(At least, that would be the *charitable* interpretation of events. The other interpretation, maybe more likely, is that he just felt like killing a dude that day).",
                                            "score": 47,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Evidence that the cop is in possession of an illegal substance",
                    "score": 38,
                    "author": "groenteman",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Can y’all imagine how pervasive this was before cellphones?",
            "score": 2663,
            "author": "iloveyou77777",
            "replies": [
                {
                    "level": 1,
                    "comment": "NWA was rapping about this shit in the 80’s!",
                    "score": 989,
                    "author": "Donkey_Kahn",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Honestly I think it's a big issue that much of white America does not grasp. \nThe police killings and planting of evidence barely even scratches the surface of how often this happens and how many decades this has been going on for.\n\nWe've only just started to see how wide spread this truly is. \n\nOf course black people have always been saying this.",
                            "score": 418,
                            "author": "JessicaAnnW",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, I'm pretty incredibly grateful to the Internet for making this shit undeniable and blatant to people like me who have never lived it. It's not so much a matter of disbelief before, but just that video and all feels so much more damn real. It hits different.",
                                    "score": 22,
                                    "author": "AeonAigis"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The public statement when Floyd was first murdered by Chauvin should be felt in the pit of the stomach of every compassionate and logical human being in this country.\n\nThe system of policing we have here will literally cover up blatant murder if left to its own devices and self-imposed controls. It's never been more clear that independent, 3rd party oversight is required to make sure police are held accountable the same as literally anyone else over the course of their job.\n\nThe companies who make hummus are under more fucking scrutiny and regulations than police.",
                    "score": 158,
                    "author": "Neuchacho",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is why recording cops is so important. If people didn't record them and document their every single move and action, Chauvin would probably be free today",
                            "score": 45,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Shit, I bet $10 shit like this happened a century ago as well.",
                    "score": 253,
                    "author": "-Bobinsox-",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You ever read To Kill a Mockingbird? They didn't even need to be this creative a century ago.",
                            "score": 212,
                            "author": "ShawshankException",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "\"I seen that black ****** yonder ruttin' on my Mayella!\"\n\n\"Well, I've heard enough. Warm up the electric chair!\"\n\nIt's basically \"sprinkle some false accusations on him\" instead of crack.\n\nplus ça change, plus c'est la même chose",
                                    "score": 145,
                                    "author": "Falcrist",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 40,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Anyone have any updates on this “cop”",
            "score": 7044,
            "author": "Yankeeboy7",
            "replies": [
                {
                    "level": 1,
                    "comment": "Here's all I could find regarding this case.  Not posting in link form because it's getting hidden for some reason..\n\ncomplex DOT com/life/2020/03/louisiana-police-investigating-video-that-allegedly-shows-cop-planting-drugs\n\n&gt;\"It has been alleged by third parties that evidence on the scene was planted by one of our deputies. Our on-scene deputies have been interviewed in this matter and gave reasonable explanations to the actions depicted in the video.\"\n\n&gt;The sheriff's office says the bag in question was collected as evidence, but tested negative for narcotics. Authorities also claim that the suspect bit a deputy during the investigation. The deputy was reportedly treated at a hospital and has since been released.\n\nSo basically the cops realized they got caught, decided to say the baggie wasn't narcotics after all, and charged the dude with resisting arrest and assault of an officer. Gee, wonder why the guy was agitated  /s\n\nEdit: the Twitter link shared by another commenter seems to suggest there was plenty of evidence to get this guy for drug dealing. But also, consider the fact that the source is the police department",
                    "score": 3765,
                    "author": "KilgorrreTrout",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wow, a baton rouge officer was arrested a couple weeks ago for stealing drugs that were evidence... Nearly 650 drug cases were dropped as a result. JPSO shouldn't get out of this so easily.",
                            "score": 598,
                            "author": "laralye",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "&gt;Authorities also claim that the suspect bit a deputy during the investigation.\n\nMy brother (who is schizophrenic and an addict) was being arrested at night via a no-knock warrant. They basically kicked in the door and grabbed him in the middle of the night. He woke up with strangers on top of him and went on a rampage. One of the cops tried to put him in a chokehold but caught his arm above his chin scrapping it against his teeth. My brother (who was a criminal) served three years in prison for assaulting a federal agent. They couldn't get him for stealing or buying the meth (which he did) so they got him on something else. It's what I think of when I see this. They photo every scrape or bruise they get from throwing themselves on people and use that to drive up the charges.",
                            "score": 207,
                            "author": "ghost_406",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This gets me so mad. Cops these days are like soccer players flopping around to get their team an advantage. Except instead of a beating the other team in a game they ruin people's lives.\n\nYou could sneeze and get a resisting arrest and assault on an officer charge. Unless someone is recording you are going to pay for a crime you didn't commit. There is no justice anymore.",
                                    "score": 129,
                                    "author": "AlwaysFianchetto",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Its idiotic to expect people to wake up with people onto of them and just lay there quietly... like what am I supposed to do? Let them kill me? What if it's an actual bad guy(although even if it was the situation wouldn't have changed)",
                                            "score": 29,
                                            "author": "Whats-Up_Bitches",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Anyone who breaks into your house and attacks you is a bad guy. Especially when your paying them to do it ..",
                                                    "score": 20,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt; and gave reasonable explanations to the actions depicted in the video.\n\nWhat is the reasonable explanation for taking supposedly seized drug evidence and placing it on the ground, then picking it back up from the ground?",
                            "score": 74,
                            "author": "tomdarch",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I shit you not, there was a different one a few years ago and the explanation was \"I was just recreating how I found it for my bodycam.\"",
                                    "score": 45,
                                    "author": "RockFourFour",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Love that the article says “allegedly”. Nah. It’s not alleged. It happened. It was a thing that happened and not alleged.",
                            "score": 397,
                            "author": "Chester2707",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's allegedly from a legal standpoint I'd imagine. With the whole \"innocent until proven guilty in a court of law\".",
                                    "score": 95,
                                    "author": "Presterium",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 338,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I looked at the link. To sum it up for others, each of the policemen claimed that the drugs were removed from the suspect’s pocket. They searched his phone and found texts that indicated his intentions to meet someone for a drug deal. They obtained his confession, and tested the pills which came back positive for methamphetamine. The officers claim that the video is missing context and conveys misinformation.\n\nTl;dr- the police investigated themselves, and found that they were free of wrongdoing.",
                            "score": 748,
                            "author": "Philosophfries",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "From what I have always seen growing up, what cops do with things they take off you is put it on their car hood. Clearly showing you that what they take is all on display. I have never seen a cop, hold on to drug for too long. Most importantly, I have never seen them place drugs on the fucking ground randomly for no reason at all. All of the text, and other circumstantial evidences good and all. But what the fuck was the cop doing with the meth in the clip? Was he having a stroke? It’s insane that when you question a cops actions, and they report “it’s okay, because bad guy” as a society we are saying unethical behavior is condoned for the betterment of society. Which we all should know, is not the case. We need to hold them to a higher standard than the rest of our society, just because it is a tough job. With a cop living in the culture that is at the worst part of our communities, their mental health is susceptible to a skewed moral view. Not to mention, the incentives to create or commit crime themselves with a inflated sense of superiority. Not only, should we police the police because it’s the right thing to do for them, but because moral character is a standard for upholding what little trust most of us still have in the justices system. If we can’t trust those who uphold the law then the moral decay is going to spread throughout our nation. There is strong evidence that this has already taken place, when it is common place to defend a politician’s criminal behavior depending on which side of the aisle you lean.",
                                    "score": 24,
                                    "author": "weekendWarri0r",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Meanwhile, in the world of common sense:\n\nWhere are the texts?\n\nPockets are fine.\n\nStill doesn't explain why the fuck you need to quickly look around, drop the shit on the ground, pick it up slowly like you happened to find it, and then turned to tell the others what you found. Moreover, that shift to approaching the camera, stance, and clear aggressive behavior is almost identical to when you catch a kid doing something they shouldn't be: Either massive denial and tears, or a startled angry.\n\nAlso, I seem to remember as a kid twirling around, rolling down hills, and generally being a small piece of chaos incarnate. Apparently pocket failure is incredibly high around Police.",
                                    "score": 108,
                                    "author": "Phylar",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Horrible job acting. Oh look at me searching the grass so hard, can't find anything,  OH WOW LOOK AT THIS MARBLE SIZED ROCK OF METH I KEPT OVERLOOKING!",
                                            "score": 44,
                                            "author": "crackyJsquirrel",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "GOSH, IT MUST HAVE FALLEN OUT OF HIS POCKET GIVEN THAT I JUST PICKED IT UP FROM WHERE HIS WAIST WAS MOMENTS AGO.  WHAT AN AMAZING COINCIDENCE!",
                                                    "score": 10,
                                                    "author": "tomdarch",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Bystanders: \"we're recording!\"\n\nOption A: launch self at bystanders in a furious panic\n\nOption B: \"good. We'll need to get a copy of that for evidence\"",
                                            "score": 28,
                                            "author": "DreddPirateBob4Ever"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Any body cam evidence?",
                                    "score": 209,
                                    "author": "Bunker-babyboi",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "thats a good one",
                                            "score": 242,
                                            "author": "Turence",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "No body cams as far as I can see in the video. \n\nThis dude needs a good lawyer, a good lawyer could make this into \n'reasonable doubt' fairly easily, assuming the jury isn't just racism incarnate. \n\nI don't know all the details but the last line of the statement says:\n&gt;\"Sheriff Joseph Lopino offers his tanks to the suspect, Mr. Griffin, for owning up to his mistakes in light of the spread of false information via social media platforms throughout the day\"\n\nThat reads to me like he either \n\n1. Took a plea deal (because the SO knew they fucked up)\n\n2. Made a confession (potentially under duress)\n\n3. STUPIDLY talked about the case on social media. \n\n\nIMO, no one should be imprisoned for any simple drug charge like this. Even if it was his Meth, I'd rather he be free rather than exacerbating the issues (poverty, lack of economic opportunities, etc) that led him to (allegedly) deal in the first place.",
                                            "score": 156,
                                            "author": "OdinTheHugger",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "For those too lazy or cant find it. \n\n&gt;We investigated ourselves and found no wrong doing. \n\nNo, I'm not joking. They interviewed the officers who said they found it on the suspect and basically called it a day. No question or answer in said post on why the cop was aggressive and insistent on the video, no questioning or answers on why he placed it on the ground, nothing.  \n\nEdit: I cant post the link here, however I can message you. Just ask and you shall receive (soon) I am a busy person so please be patient.",
                            "score": 3886,
                            "author": "corbear007",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What a POS...",
                                    "score": 997,
                                    "author": "WTAF2021",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "All you need to go full Judge Dread is a badge and a little baggie of drugs.",
                                            "score": 463,
                                            "author": "Fauster",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "judge dredd actually follows the law and wouldn't plant drug on someone",
                                                    "score": 202,
                                                    "author": "omgwtfidk89",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Exactly, Judge Dredd might support and be a member of a dystopian police state, but at least he obsessively follows his own rules",
                                                            "score": 127,
                                                            "author": "Not-Alpharious",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "And he spectacularly puts down his own when they're clearly out of line. \n\nMaybe we need a Judge Dredd for pigs like those in the video.",
                                                                    "score": 81,
                                                                    "author": "antipatriot88",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[removed]",
                                                                            "score": 32,
                                                                            "author": "[deleted]",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Remember when they fired over a hundred rounds into a vehicle just because it looked kinda like dormers (it didnt, and wasn't)",
                                                                                    "score": 29,
                                                                                    "author": "CoupClutzClan",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Dredd may be a fascist in practice, but there are so few judges that one can't really call Mega City One a police state.",
                                                                    "score": 10,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Considering the fucked up situation that that movie’s world is in that’s like a blessing for them lmfao.",
                                                                            "score": 12,
                                                                            "author": "[deleted]",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "He doesn't follow the law...\n\nHe **IS** the law.",
                                                            "score": 72,
                                                            "author": "Hadtarespond",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Dredd was a fascist but he also utterly believed in The Law. He would never stitch someone up as that is unjust, illegal and generally a cowardly dick trick. He'd chase you, shoot you in the leg, handcuff you to a lamppost for a few hours and all for dropping litter but he would never, ever, plant drugs.\n\nThat's the most horrifying thing about Dredd; for Megacity One he's probably the best solution. He can be trusted, if hated, and will die to protect the innocent. He's never racist, sexist or anythingelseist because he doesn't care what petty foibles you have: as long as you aren't some messed-up sugar junkie or ciminal jay-walker you're free to do whatever you like. Break the law and it's off to the Cubes with you.",
                                                    "score": 74,
                                                    "author": "DreddPirateBob4Ever",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Don’t forget your knees and guns.",
                                                    "score": 56,
                                                    "author": "jpatricks",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "The link is already gone so I appreciate this.",
                                    "score": 86,
                                    "author": "sackoftrees",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "\"Hey, are you willing to tell on yourselves and get in trouble, which you can completely avoid by lying? No? Okay then.\"",
                                    "score": 81,
                                    "author": "[deleted]"
                                },
                                {
                                    "level": 3,
                                    "comment": "This is when you would need a police for the police, which would handle this. This is feces from bulls",
                                    "score": 17,
                                    "author": "Wexzuz",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That's called the office of 'internal affairs'.\n\nThey investigate cop accusations and report to a different boss to keep things 'honest'.\n\nIt hasn't worked out too well thus far.",
                                            "score": 17,
                                            "author": "Atmic",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "This makes my blood boil.",
                                    "score": 13,
                                    "author": "ReadThemanuals"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "that is the most maddening thing i’ve read all day, it comes off so flippant",
                            "score": 92,
                            "author": "possible-spatula",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Basically a statement by police saying it was taken from his pocket before the video starts, and a later phone search revealed he made plans via text to sell the pills in question. \nResponses remain doubtful due to the suspicious behaviour of the officers on the scene.",
                            "score": 109,
                            "author": "Fybarious",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "He was promoted and everyone at the presinct hoisted him on his shoulders for a job well done. Probably.",
                    "score": 902,
                    "author": "DoctorDeeeerp",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I thought I read somewhere that he got a \"get out of DUI\" card from the mayor, and I think the force gave his wife an honorary pension as well.",
                            "score": 206,
                            "author": "PhilipLiptonSchrute",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This could be intense satire, or legit reality, and both are equally plausible.",
                                    "score": 67,
                                    "author": "northshore12",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sometimes I misplace my car keys, sometimes officers misplace their crack. Good to see it was returned to its rightful owner /s",
            "score": 1167,
            "author": "DarkSageX",
            "replies": [
                {
                    "level": 1,
                    "comment": "sometimes they misplace their tazers too",
                    "score": 124,
                    "author": "chimpboy1000",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And sometimes they misplace their bullets.",
                            "score": 49,
                            "author": "escapistwit",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 1001,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "open and shut case",
                    "score": 182,
                    "author": "GingerSky"
                },
                {
                    "level": 1,
                    "comment": "I came for this reply.\n\nOpen and Shut Case Johnson!",
                    "score": 40,
                    "author": "VernonP007",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "You hate to see this. Reminds of something similar that happened in Kentucky I think. A cop had planted meth on dozens and dozens of people and got caught finally. The guy was basically trying to ruin people’s lives.",
            "score": 392,
            "author": "DaleGribble692",
            "replies": [
                {
                    "level": 1,
                    "comment": "What happens pretty often is they try to get the “big” drug dealers, but they don’t carry or distribute drugs themselves. So they pocket some drugs from other small time arrests and plant them on the big drug dealers. \n\nIt’s ridiculous. \n\nIf we could decriminalize drugs, you wouldn’t see all of these resources wasted on busting drug dealers and instead spent on rehab for drug users and education for dealers. \n\nIt’s seriously upsetting to see this pipeline continuing when everyone involved could use help. Instead they’re throwing them all in prison to make money for people who already have too much money. Government included.",
                    "score": 146,
                    "author": "Olealicat",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thank god she recorded but the mistake she made was telling those crooked cops about it. She could've been mysteriously killed herself and the phone will never see the light of day unless she was live streaming.",
            "score": 1968,
            "author": "MafiaMurderBag",
            "replies": [
                {
                    "level": 1,
                    "comment": "that's why everyone needs to stream this shit rather than record.",
                    "score": 829,
                    "author": "Deadboy90",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Exactly, that's how we saw what happened to Castille. Wouldnt be a story if not for her live stream of the shooting.",
                            "score": 408,
                            "author": "MafiaMurderBag",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;Castille\n\nI'm out of the look, care to elaborate?",
                                    "score": 128,
                                    "author": "Trolleitor",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "He was a guy in Minnesota, a great guy by all accounts. Got pulled over for some BS traffic stop and he told the officer he had a gun. He was a legal conceal carry owner. Cop got scared and shot him. Girlfriend was already streaming on fb live because she was scared they would get harassed or worse during a BS stop because of race. She was correct. He died. Cop found not guilty.",
                                            "score": 407,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 129,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "The child consoling the mother afterwards is one of the saddest things you'll ever see/hear.",
                                                            "score": 51,
                                                            "author": "John_T_Conover",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[deleted]",
                                                                    "score": 42,
                                                                    "author": "[deleted]",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 175,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Busy laundering Russian oligarch money",
                                                            "score": 146,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "The NRA worked with Republicans to get open carry outlawed in California because black people started open carrying.",
                                                            "score": 67,
                                                            "author": "BigbySamMelody",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I cannot for the life of me find the damn video but I remember watching one of a black off duty cop who got pulled over and was concealed carrying and told the officer about it. The on duty cop was real sketchy and the black off duty cop even said this is why people are scared of them.",
                                                                    "score": 46,
                                                                    "author": "[deleted]"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Cop was not found not guilty, he was acquitted... Kind of the same but a bit worse.",
                                                    "score": 36,
                                                    "author": "wagsyman",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "ohyeah, you're right. it was a grand jury acquittal, no?",
                                                            "score": 20,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 200,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "This means that carrying a gun is effectively illegal.\n\nIf you can be shot just for stating that you have a concealed weapon - **which you must do when carrying and interacting with the police** - then that means it's effectively illegal. That's something made very clear in the class to get a concealed permit: turn your overhead light on, hands on the steering wheel, and inform the officer you have a concealed firearm.\n\nThe guy did everything right, still got shot, and the officer was considered to be justified in that shooting.\n\n&amp;nbsp;\n\nIf you're looking for a real \"they're coming for your guns\" incident, this is it.",
                                                    "score": 122,
                                                    "author": "Catshit-Dogfart",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Not only illegal, an immediate extrajudicial death sentence.",
                                                            "score": 64,
                                                            "author": "Jameseesall",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt;This means carrying a gun is effectively illegal\n\nIt's worse than that. It means that carrying a gun is in a state of indeterminacy that lets individual officers decide on the spot who does and does not have  civil rights. White kid travels across state lines to shoot anti-police brutality protestors? Was allowed to walk past police lines after killing 2 people and wounding a third, had his hands on his gun. Black adult with a concealed carry permit fulfilling his legal obligation to inform the officer that he's carrying? He has to die. He might have been reaching for a gun. Stalk, assault and murder a black child walking through the wrong neighborhood with some skittles and a can of tea? Why, you're just defending yourself. You're a woman of color and your abusive ex comes onto your property in violation of a restraining order, and you fire a warning shot that hurts no  one? Aggravated assault with a deadly weapon, you're going to jail for a minimum of 20 years. Anything can be legal or illegal depending on who's doing it. There are at least 2 justice systems in America.",
                                                            "score": 37,
                                                            "author": "reverendsteveii",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "There are no justice systems in America, sorry but there ain't two.  There are punitive systems in America which claim to be justice, but I've never seen it.",
                                                                    "score": 21,
                                                                    "author": "BallgaggingYou"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "My brain, no my existence is tired of processing these kinds of stories.",
                                                            "score": 17,
                                                            "author": "jerryscheese",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "holy fuck",
                                                    "score": 31,
                                                    "author": "redditusernumber456",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "There's apparently a portion of the livestream where the mother is yelling hysterically because Castile had just been shot and was taking his last breaths within arms reach of her inside the car.\n\nYou can then hear her 4 year old daughter in the back seat pleading with her to calm down because she doesnt want her mom to get \"shooted\" too.\n\nI have never watched that video and don't want to, but it's out there.",
                                                            "score": 53,
                                                            "author": "iShark",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[removed]",
                                                                    "score": 18,
                                                                    "author": "[deleted]",
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "It’s worth watching the video just to help understand the level of fear and bullshit black people have to deal with when it comes to police in the US. The guy did everything right and the cop still murdered him. \n\nWhen all you see are clips from Cops or observer camera angles you don’t really understand how ridiculous it really is; being in the car with the victim is a whole different level.",
                                                                    "score": 13,
                                                                    "author": "m_ttl_ng",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Some cops have started playing copyrighted music if they think they're being filmed to counteract this.",
                            "score": 79,
                            "author": "Machomuk89",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That doesn't really work, just mute it and let people see the cops actions.  If anything, without the words this looks even worse for the cop in this particular situation.",
                                    "score": 55,
                                    "author": "[deleted]"
                                },
                                {
                                    "level": 3,
                                    "comment": "Getting assaulted by police with \"Living On A Prayer\" blaring in the background is peak America",
                                    "score": 58,
                                    "author": "ChasingTheNines",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "\"Nobody wants to get their ass beat to a soundtrack: 'WE'RE NOT GONNA TAKE IT!'\"",
                                            "score": 9,
                                            "author": "chaincj"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Nah, that just prevents you from monetizing the video, you can still upload it to many places. And I think it's a clever way to counter those who just harass people (not only cops) on camera for clout.",
                                    "score": 17,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "At the very least, record to an SD card if your phone has one. Easily recovered even if it's smashed.",
                    "score": 19,
                    "author": "Alex_2259",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The naacp or someone like that has an app that automatically records to their cloud servers and can be set to notify people of your choosing as to the interaction. \n\nThis can be extremely valuable if someone is stalking you as well as having their face and knowing they are being live stream recorded may make them find easier prey and help the cops find them.",
                            "score": 22,
                            "author": "Admirable_Flower_469",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It’s the aclu the app is called mobile justice",
                                    "score": 14,
                                    "author": "dreadlocks1221",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "John Lang vs. Fresno PD",
                    "score": 18,
                    "author": "DivineSwine_",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm so glad they got this on film.",
            "score": 510,
            "author": "iBeenie",
            "replies": [
                {
                    "level": 1,
                    "comment": "Why? It made no difference and cop got away with it.",
                    "score": 297,
                    "author": "zaphod_beeble_bro",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Could be useful if people start holding them accountable",
                            "score": 108,
                            "author": "TheLeafyOne2",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "why do they do this? do they get a bonus for catching someone with drugs, or is it purely to ruin someones life?",
            "score": 97,
            "author": "thescronchofdeath",
            "replies": [
                {
                    "level": 1,
                    "comment": "No bonus. Just a god complex and racism.",
                    "score": 88,
                    "author": "Santos23_",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "That guy is the Tyron Biggoms of cops",
            "score": 85,
            "author": "mjb5866"
        },
        {
            "level": 0,
            "comment": "Never heard a song called “Fuck Tha Fire Department”. Just saying.",
            "score": 15,
            "author": "jzaczyk"
        },
        {
            "level": 0,
            "comment": "Johnson, just sprinkle some crack on him and lets get out here",
            "score": 50,
            "author": "hacksaw187",
            "replies": []
        }
    ]
}