{
    "id": "nx6olq",
    "score": 72049,
    "title": "If you’re a parent and let your kids make a mess like this then you’re a piece of sh**",
    "author": "dillonconnerty",
    "date": 1623383680.0,
    "url": "https://www.reddit.com/r/iamatotalpieceofshit/comments/nx6olq",
    "media_urls": [
        "https://i.redd.it/k486t54m7k471.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "**Reminder: Do not ask for personal information, suggest someone should be doxxed, link to or comment with personal information, openly solicit personal information, or contact the people featured here. Don't even wax poetic about wanting to post identifying information. You will be banned.**\n\n**Do not encourage, glorify, or incite violence.**\n\nFor example: \"Kill yourself\", \"It wouldn't be so bad if we killed all the pedophiles\", \"This guy needs to die\", \"I hope this guy gets stabbed to death with a rusty screwdriver\", etc.\n\nAll glorification, advocacy, or suggestions of violence, EVEN IN JEST, will be permanently banned, no exceptions, and no possibility of leniency. \n\n**ANY INFORMATION THAT CAN BE USED TO IDENTIFY SOMEONE MUST BE CENSORED.**\n\n**DO NOT POST SCREENSHOTS OF REDDIT CONTENT. DO NOT POST REDDIT DRAMA THAT YOU ARE INVOLVED IN.**\n\nThis subreddit is not here to help you win your reddit fight or to bring justice to someone who said something you disagree with. You will be banned if you post screenshots of anything that can be found on Reddit from the information in the screenshot or from comments in your user history. We are not your personal army. \n\nFailure to follow the rules of this sub will result in a permanent ban.\n      \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/iamatotalpieceofshit) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "You should see these people's homes. I go into people's homes for a living and I see these kinds of people in their natural habitat. It's as bad as you think it is.",
            "score": 1763,
            "author": "Generic_Male_3",
            "replies": [
                {
                    "level": 1,
                    "comment": "When I switched to residential plumbing the work wasn't the part I wasn't prepared for, its the way some people live. It's absolutely heartbreaking walking into someone's house and seeing worse than a pig stie and realizing they raise kids in the filth.",
                    "score": 642,
                    "author": "Azcards115",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Could only imagine how the bathrooms look.  Honestly, are there times where you've had to wear masks not related to COVID?",
                            "score": 210,
                            "author": "built_2_fight",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Definitely, I try to be as safe as possible. There have also been a few times where after I'm done at the job I go home and change cloths and take a shower before going to the next job.",
                                    "score": 205,
                                    "author": "Azcards115",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I would love to see an AMA from yourself or others in your field relating to the craziest/weirdest and grossest things you’ve come across. I’ll have to look if one exists already. But over 10 years ago at my old job, the women bathroom flooded in our “new building”. The building was new to our business but not a brand new building. The plumber that came in to fix everything was pulling used tampons and PADS!!! out of the pipes.  Even though that waste was more than likely from the people before us, all of us women had to get a crash course on what not to flush down the toilets. I have MAD respect for what you do!",
                                            "score": 75,
                                            "author": "drummerevy5",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Not plumbing but just as bad. My husband used to install flooring.  Tile and shit like that, it was backbreaking for him, hell on the knees.  One day, I got a call from him saying he was going to be late.  He had to work in some welfare housing in the area doing install.  Poor guy came home with his clothes in a bag because  of all the bedbugs. Right into the trash. They all had to hose off outside.   It just kept happening.  Inevitably, we had our own breakout in our house.  Nightmare.\n\nThen the restaurants in the area.  You would never want to eat at any of the places he'd tell stories about.  There was a local Chinese buffet that closed for health violations. We had been warned off the place, but he'd tell stories about the remodel and the food that wouldn't get cleaned up off the floor, ancient chicken bones in the grout. Bugs.\n\nEdit just recalled:  the Absolute Worst was after he became a letter carrier.  He was delivering in an apartment building, and delivered a package to the door of one residence.  Unclothed toddler maybe 3 or 4?year old answered the door, covered in food and poop, house smelled like shit, was just this kid and a younger one alone.  He had to wait for over 2 hours for the the cops to come to make sure the kids were safe so he could leave. No one was charged with anything.  He had to keep delivering to this place like nothing happened.  Broke his heart.\n\nUpdate:  Hubby corrected me, it was closer to four hours.",
                                                    "score": 80,
                                                    "author": "Kitten_Sharts",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Fuck bedbugs. If I found genie in a bottle I'd wish every single bedbug, and eggs, on our planet were to magically teleport to the nearest star and burn the fuck up. They should all be destroyed.",
                                                            "score": 44,
                                                            "author": "WatchRare",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I genuinely feel like we don’t do enough to eliminate that scourge. We accidentally make animals go extinct all the time, come on humanity!",
                                                                    "score": 24,
                                                                    "author": "25violets",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "It's never an accident when an animal goes extinct,  things have to be done to fuck the environment up on our part first",
                                                                            "score": 10,
                                                                            "author": "Orenmir2002",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "That and fleas. That shit will drive the calmest person insane. I’m an extremely patient non confrontational person but a flea infestation had me wearing white socks to lure them in so I could kill them with my bare hands with CRAZY eyes, followed by frustrated crying",
                                                                    "score": 17,
                                                                    "author": "roochmcgooch",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Been a paramedic for 20 years an seen all manner of homes. \n\nLady with many (8-10) small dogs in a single wide trailer. She's was wheelchair bound and the animals all pissed and shit throughout the home. There was also all kinds if trash everywhere. You could smell it from the outside with the door closed. There were also so many fleas and roaches that the floor would move as you walked from all the bugs. \n\nBeen in homes where you had to dodge holes and soft spots in the floor lest you fall through. \n\nOnce watched numerous large roaches crawl from one hole in the walls out another. \n\nMoved a piece of furniture once to get access to get the stretcher to a patient and found the desiccated corpse of a rat under it. \n\nPeople are disgusting.",
                                                    "score": 39,
                                                    "author": "Haywoodjablowme1029",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "We had these two brothers that were repeat customers, weekly calls for chest pain kind of guys. Both morbidly obese and both wards of the state because of disability due to obesity. Lived in government housing. They would shit and piss in five gallon buckets and then lid them when they got full. House was full of junk food and trash. Their sister would come take care them every day. The paramedics would get mad at her for allowing them to continue living like that. I like to tell that story to people who have never done paramedic or EMT work then say that was a 2 out of 10 on the grossness fucked up things I’ve seen scale. Want to hear about level 10?",
                                                            "score": 26,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[deleted]",
                                                                    "score": 17,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "One time a guy had injured himself, crackhead, methhead, something drugs. Well he had gotten into a knife fight with someone or some shit, wasn’t clear. But he had his wound all wrapped up in this fucking gross fluid soaked bandage. The smell was straight corpse. So the paramedic goes to unwrap this bandage and he gets it off and this necrotic rotten flesh from this guys arm just falls off onto the floor and the Paramedics boots. I’m getting gagged just writing this remembering it. You could see bone and tendon. Oh that fucking smell was sickening. The guy died like two hours later at the hospital he was so sceptic. Even the doctors at the ER were amazed at how this guy was even alive. But seeing rotten human flesh fall off of a living mans arm was the level ten on fucked up shit I had to witness in my life. I’ve also witnessed a human being hit by a semi truck aftermath. Head over here, guys over here, legs over here. Living in filth ? Probably the home covered in dog shit and carpet infested with fleas and bedbugs, rotting food in the refrigerator. Those places were just falling apart and it sucked if we had to go in to get the patient cause they couldn’t come outside. Keep in mind those homes like that would often have several adults living there, all three collecting welfare and social security or something.",
                                                                            "score": 19,
                                                                            "author": "[deleted]",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "[deleted]",
                                                                                    "score": 9,
                                                                                    "author": "[deleted]",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Mental health is no joke, sorry for that awful experience, feel so bad for those dogs and of course the lady. No winners there.",
                                                            "score": 19,
                                                            "author": "JustABoyAndHisBlob"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I do residential HVAC as an apprentice and one house we went too was so bad the boss didn't make me go in. He straight up said I don't get paid enough to go in there. I looked through the door, and roaches were falling from the ceiling. There were maggots on piles of rotten food all over the house. The children were sitting on the couch eating something rotten and roaches crawled on them. The children weren't even bothered by the roaches on them they acted like they weren't even there. \n\nAfter bossman was done he went straight home and stripped in the front yard while his wife sprayed him with garden hose.  That's the worst one I've seen but there's many like it I've been too. Having roaches fall into your hair is an unsettling experience. Another one is when you hand the person the bill and a roach crawls from their arm across the bill onto your hand. Took just about all the composure I had not to flip my shit.",
                                            "score": 25,
                                            "author": "TheOGClyde",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Just reading this made me want to boil myself for several hours.",
                                                    "score": 20,
                                                    "author": "Final-Law",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Please tell me one you called child protective services after this home visit.",
                                                    "score": 12,
                                                    "author": "Fraxinus2018",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I was hoping the sentence read, “after boss man was done and went straight to the police or cps...” but then I remember how many people witnessed my childhood neglect and said nothing",
                                                            "score": 21,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "When I did my EMT requirements it was the same. We would have to go into homes to get people and see it all. I don’t know if you agree but the poorer they were the dirtier and grosser they were in a lot of the cases. Rich people were generally very clean and pleasant inside.I know that isn’t always true just what I experienced. I think there is probably a better correlation to be made of stress to giving a fuck about how clean your home is. Wealthy people are probably under less stress than those who are crippling poor.",
                            "score": 51,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Also rich people can afford a maid. I've known some sloppier well-off people and they were only neat and clean because they had a maid. A dude my husband knew in college was  from an extremely wealthy family, and had had maids his entire life. Dude was absolutely disgusting when left to his own devices.",
                                    "score": 108,
                                    "author": "DieSchadenfreude",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Going to college (a cheap state school too) and realizing most of my roommates had maids growing up was insane. It also explained why they all thought our apartment would clean itself…",
                                            "score": 44,
                                            "author": "heckyeahan",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "That and they can afford to throw things away since if they need it later they can just buy a new one.",
                                            "score": 41,
                                            "author": "mrkramer1990",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Had a friend that refused to wash his clothes. He would instead, wear something once, throw it in a bag, bring the bag to goodwill at the end of the month and just buy all new clothes on his way back home.\n\nHe spent more on clothes every month than he did on food and rent.",
                                                    "score": 13,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "My husband is disabled, and we decided to foster with the intent to adopt. We couldn't ever have kids on our own. While going through the process, one of the steps is a home study. They come, walk through the house tell you what needs to change. We ended up with 3 different home studies. Each social worker that came through our home wanted to know if we made money on the side. Because we were at poverty income on our application but the house doesn't \"show as poor\". I always asked what does poor look like? I like a clean space. And cleaning supplies are not that expensive.",
                                            "score": 6,
                                            "author": "LissaMS2"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "When you work 2-3 jobs and are a single parent, it's hard to find the time to clean your house - and almost impossible to get your kids to do it when you can't be there to enforce it. \n\nI had a few friends growing up who lived in absolute wrecks - but I couldn't really blame the moms for it. They were never home - barely scraping by with the multiple jobs they had. The only time I ever saw them was if I happen to catch them coming home or leaving for work, having only been home for 4 hours, needing to get sleep and a shower during that time. \n\nAmerican wages are pretty great, y'all.",
                                    "score": 46,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Honestly, most of my friends homes growing up were pretty messy, and the only ones that were clean were the ones who were more “well off” because they could afford for one parent to stay home. I was honestly probably poorer than all of my friends (foster kid living with grandma and uncle) but my house was the cleanest of ALL my friends. But that’s because my uncle had insane OCD and gave my brothers and me extensive chores and cleaning lists. Lol",
                                            "score": 8,
                                            "author": "BJMkrtychyan"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt; When you work 2-3 jobs and are a single parent\n\nIt's never advisable to have more jobs than children",
                                            "score": 4,
                                            "author": "thymeraser",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Wealthy people pay other people to clean.",
                                    "score": 10,
                                    "author": "BOtto2016",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "I definitely have noticed that. But st the same time a lot of the well off people where I live pay to have someone clean their house.(my co-workers wife cleans a lot of their homes). It really is an unfortunate situation all around",
                                    "score": 15,
                                    "author": "Azcards115"
                                },
                                {
                                    "level": 3,
                                    "comment": "I live in an area where the filthy rich and people on food stamps live next door to each other. Some of the grossest homes I've been in have been in rich people's homes and the poorer people had the cleanest. It's not always the case, so I tend to not correlate wealth with cleanliness or poverty with filth.",
                                    "score": 17,
                                    "author": "Generic_Male_3"
                                },
                                {
                                    "level": 3,
                                    "comment": "Mental illness usually translates into a lack of meaningful education and a life of poverty and addiction. Both of those present a lack of motivation towards hygiene and general cleanliness. Often times they want to be clean but they're just too overwhelmed, broke, embarassed to ask for help, or defeated entirely. If you took those rich people and gave them a dose of generational trauma and poverty and a smidge of mental illness, their homes wouldn't always be so nice.",
                                    "score": 24,
                                    "author": "CaroleFnBaskin",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "My home was at its worst when I was depressed.\n\nI looked perfectly fine on the outside, clean and all, but I had no energy to clean my home and would just sleep 12h a day.",
                                            "score": 11,
                                            "author": "Blue_Moon_Lake",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Wealthy people also have the freedom of time and the ability to pay for help, so even if they don’t clean it themselves it gets cleaned by someone else.",
                                    "score": 14,
                                    "author": "underthetootsierolls",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I painted vacant apartments. Walls would be caked with nicotine stains. Animal feces on the carpet. Absolute filth. But at least they put the the plastic plugs in the outlets so their kids didn't electrocute themselves...",
                    "score": 65,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Nah, those came with the place and they couldn’t be assed to take them out.",
                            "score": 7,
                            "author": "Feeling_Sundae4147"
                        },
                        {
                            "level": 2,
                            "comment": "Probably had to after the kids tried to shove their jello into them.",
                            "score": 13,
                            "author": "garchoo",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "In my experience the people who are rudest outside are the cleanest in their home. But I am sure it varies.",
                    "score": 18,
                    "author": "KayItaly",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Yup, I worked in construction for about 10 years. It’s crazy how some people live. Even been in mansions that were absolutely filthy. Only difference is their mess is spread out over a larger area.",
                    "score": 12,
                    "author": "Anthony780"
                },
                {
                    "level": 1,
                    "comment": "Oh god I feel this. I’m a nanny and the way some people live is truly disgusting. I told the parents I had to keep their child at my house bc of reasons.. but it’s their house. Mine is super clean at all times and I couldn’t handle being in theirs for 9+ hours a day. I would lose my mind..",
                    "score": 5,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I just can't understand that. My house is messy and not very organized because I have a toddler constantly pulling stuff out and moving it around. But its not DIRTY. I don't get that. It may not be ridiculously clean because of my priorities, but no one walks into my house and thinks \"this place is nasty.\" I feel like there is something else going on when people have houses like that.",
                            "score": 6,
                            "author": "frogsgoribbit737",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yup, same here. It honestly blows my mind and disgusts me how some people live lol they reside in literal filth and I just can't understand it.",
                    "score": 23,
                    "author": "ActivexGen",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Many of my friends as a kid had homes like these. In every case parents were alcoholics and/or drug addicts.",
                            "score": 13,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Reminds me of that episode \"Peekaboo\" from Breaking Bad :(",
                                    "score": 5,
                                    "author": "agentofmidgard"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 21,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Reminds of when I worked at a restaurant where they served sticky white rice. A couple ordered some for their toddler to eat but he decided to throw it all over the floor. The parents then decided to let their toddler walk around the restaurant without noticing that the kid had sticky rice stuck to his shoes and hands. He spread that shit all over the floor and on some tables. I told them to keep their child at the table and they got all huffy about it and loudly claimed when I dropped of their check they wouldn't be tipping due to a poor experience. I do not miss my serving job at all.",
            "score": 577,
            "author": "Reasonable-Issue5082",
            "replies": [
                {
                    "level": 1,
                    "comment": "We were at a restaurant once and this woman left her three kids alone while she went to get the food. The son literally started pouring the sugar from the sugar shaker into his mouth. A waiter took it away from him and the kid just went to another table, grabbed another sugar shaker and emptied it onto the table. When the staff told him to stop his sisters, who couldn’t have been older than 12 or 13, started screaming obscenities at them and made a huge scene. The mother came back and, when told what was going on, decided to scream at the staff for having the temerity to tell her kids how to act before stomping out with all the food.\n\nSome people are just horrendous and have no business breeding or being parents.",
                    "score": 128,
                    "author": "jtweezy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That almost sounds like it was premeditated. I worked with a couple that would go to restaurants and “find” something wrong with their food every time we went out to eat, no shame in their game at all. They would even try to help me “find something wrong” with my food as well. It was so embarrassing, I stopped going to lunch with them. They did at least tip though.",
                            "score": 52,
                            "author": "PineSand",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Was it to get a discount or free food or something? Or was it some weird thing where they had to put people down for no reason?",
                                    "score": 19,
                                    "author": "DEAN112358",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "They do it to get free food/discount.",
                                            "score": 15,
                                            "author": "PineSand"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I think most people do it for both free/discount and to put people down. I mean if youre wanting to lie about the quality to just get it for free, youre probably in a mental state that the only thing that makes you feel even marginally more important is by putting minimum wage service staff down.",
                                            "score": 4,
                                            "author": "JC1515"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "We went to a Mexican restaurant with my one year old last week (first time she's eaten in a restaurant ever) and she got rice all over the table, me, her dad, and the booth, mostly because they didn't have any booster seats available so she had to be in the booth with us. \n\nBut even then, maybe 3 grains of rice fell on the floor. It wasn't hard to sweep the rice into a napkin or to make sure she stayed contained and then we cleaned what we could on the table and left $20 on an $80 bill to make up for the mess. The table behind us with 3 kids and a big mess only left $2 tip.\n\n Don't give your kid rice if you're not willing to clean the mess, I can guarantee that kid wouldn't be allowed to do that at home.",
                    "score": 82,
                    "author": "ktheway",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I worked at Panda Express for a while and yeah basically get your kid noodles if they don't have the dexterity to eat properly yet.  It's not their fault, kids just don't have the control of their bodies or the awareness of the mess they are making.  It's the parents fault every time.",
                            "score": 53,
                            "author": "Deathbydragonfire",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "When I worked in Taco Bell, this was a normal site. Fast food taught me how to hide my rage behind a smile.",
            "score": 460,
            "author": "drc30665",
            "replies": [
                {
                    "level": 1,
                    "comment": "Once found a full diaper on a tray when cleaning a cafeteria table. People are fucking disgusting.",
                    "score": 187,
                    "author": "squadoodles",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Happened to me at a sit down restaurant. They put it in a happy meal box and left it on the table. There wasn’t a McDonalds near us.",
                            "score": 66,
                            "author": "Mrchristopherrr",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The only person thats a happy meal for is the diaper chewing lady on my strange addiction.",
                                    "score": 17,
                                    "author": "EmEmPeriwinkle",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Ugh I used to push carts at a store and people would leave dirty diapers in carts all the time. We even had trash cans inside the cart corrals.",
                            "score": 6,
                            "author": "butterbean8686"
                        },
                        {
                            "level": 2,
                            "comment": "I found a poopy diaper in the tank of a toilet a few years ago. Trying to fix the toilet as it wasn't flushing, opened the top of the back tank, sure enough some schmuck left a poopy diaper in there to soak up the water and keep the toilet from functioning. Still mad at that guy.",
                            "score": 4,
                            "author": "DongTongs"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Wax pens help",
                    "score": 80,
                    "author": "Hobo_Helper_hot",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Most people call them “crayons”; I always carry some on me for therapeutic emergency drawing in times like this. Still have trouble keeping the colors inside the lines though :/",
                            "score": 13,
                            "author": "IDrinkWhiskE",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I filled mine with acetone, I now call it a \"permanent marker\".",
                                    "score": 9,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Worked there like 15 years ago. Ran out of beef once and had to stand on the counter to get everyone's attention due to their indignant rage.\n\nEdit - to be fair the mcdonalds I ordered from like 5 hrs before this comment was \"out of\" everything but chicken and fish - which was clearly just an effect of them cleaning up an hour early to try and get out fast lol.",
                    "score": 41,
                    "author": "Lanthemandragoran",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I once went to a KFC that had supposedly *run out of chicken*. I just died laughing on the spot and walked out and went somewhere else.",
                            "score": 21,
                            "author": "58king",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It does happen. They usually get their chicken order 3 times a week and if the manager messed up their projection or if there was some crazy occurrence like a super hot day that drove everyone to want fried chicken that day, it can happen. It shouldn't but it does.",
                                    "score": 17,
                                    "author": "wkd_cpl",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It happened in the UK a while back IIRC due to either Brexit issues or some other chicken shortage. Next to every KFC in the country didn’t have chicken",
                                            "score": 5,
                                            "author": "TheMasterAtSomething"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah, and that is why I am not made for service industry. I can't do that, not for an eternity.",
                    "score": 18,
                    "author": "Anoubis_Ra",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No one is, but many of us have to or at least had too for much longer than we ever wanted to.",
                            "score": 16,
                            "author": "Bobguy64",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Same. I did it for three years and then stopped to lay tile with my girlfriends dad for slightly less money just to try it out. Did it for about 6 months, missed the money serving tables, went back, and made it all of two weeks before I went back to the tile. \n\nOne of my last tables ever tipped me a cent. I was supposed to finish that weekend out but when I walked out the door I never came back. Fuck food service, the shut that you endure just on the hopes that some rude stranger will have mercy on you is degrading af.",
                            "score": 4,
                            "author": "turtletitan8196"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "As a parent of a food throwing 10 month old, clean up after your kids. It only takes a few extra minutes. We always, always clean up after our son. \n\n\n***Edit: thanks for the awards! Side note, he doesn’t purposely throw his food. He is only trying to figure out how to feed himself things drop/get thrown to the floor. It is all part of it. 😊💜",
            "score": 2529,
            "author": "thedarkestsnowwhite",
            "replies": [
                {
                    "level": 1,
                    "comment": "THANK YOU!",
                    "score": 612,
                    "author": "dillonconnerty",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’ve worked in customer service, it drove me CRAZY when people did this. My partner and I always make sure we clean up. It’s okay to be a messy kid, just clean it up!! 😊",
                            "score": 372,
                            "author": "thedarkestsnowwhite",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My husband and I are the same way. We have both worked in restaurants, and we always neatly stack our plates with silverware on top to make it easier for the busboy. I cannot imagine leaving a mess. I would probably die of shame.",
                                    "score": 174,
                                    "author": "BadgerHooker",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Same. I haven't been to a restaurant with my son yet because he was born during the pandemic and we just haven't been out to eat again, but that's always what I did, too, because I also worked in service at one point. I can't imagine not picking up after my kid. Or letting him make such a mess in the first place! He's only 14 months and he's never made such a mess at the dinner table.",
                                            "score": 51,
                                            "author": "Nyx_Shadowspawn",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Even if a customer with a child did leave a mess, any frustration I had at it would instantly fade away if there was some sort of clear attempt to make clean up easier in anyway.\n\n\n\nSometimes kids can be fussy and sometimes the parent has had a long day too, I consider it part of the service to tidy up after the meal but there's obviously a limit to what is reasonable and what is obvious lack of respect.",
                                                    "score": 79,
                                                    "author": "thatguyned",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 23,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "No waiters going to expect you to crawl under the table to clean, that's just silly. Ideally if you've had a child with you that's thrown food all over the joint the simple act of just stacking up your plates near the edge of the table when you leave alleviates the frustration of cleaning it. Half of the shittiness is having to pick through other people's half chewed food and sloppiness just to get to the plates and get them out of the way before clearing the trash and then wiping down the surface.\n\n\n\nThat little act making the clean up just a tiny bit easier saves a lot of time for the server clearing tables and is really no stress on the customers themselves. Is not just about showing the staff respect, it's about not going into a business and acting like you own the place because you spent maybe $80 on a small family dinner.\n\n\n\nKeep in mind waitstaff generally work gloveless for the sake of grip on plates and speed on service.",
                                                                    "score": 9,
                                                                    "author": "thatguyned"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Literally this. Best mindset here.",
                                                            "score": 19,
                                                            "author": "killahore"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Right on. This is almost unavoidable in the food service industry. Not on the server or restaurant, but when dealing with people who have kids that they just let act a fool. Alot of them feel that it's the restaurants job to deal with this, but leaving an exceptional mess like this for \"someone else to pick up\" is pretty trashy. Your kid made the mess, teach your kid responsibility and respect by not doing this and showing them that taking the responsibility to clean up after yourself, isn't so fun when you have to do it. I was raised to treat the CEO of of a company, with the same respect as the janitor. Nobody should act as though anyone else is beneath them. People are all humans who deserve proper respect. You wouldn't walk in your bosses office and just start using their things or leaving a mess in there, just like you don't just walk through the janitors freshly mopped floors. Respecting other people's hard work and property is a huge sign of a person good character. This attitude of \"equality\" led me into a very quick progression throughout my time in the Army. By treating people in a hierarchy, with the same respect, and only using position to accomplish work together, I was able to lead soldiers that not only would listen and follow me, but respect me as leader.",
                                                            "score": 7,
                                                            "author": "patricky6"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "When it’s just my bf and myself going out to eat, senior citizens, I do things like I do at home, stack plates, put napkins, butter and jelly wrappers on top plate. Silverware on top.  It is only common courtesy to treat others as you handle things at home.",
                                            "score": 4,
                                            "author": "DenGen92158"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I honestly think the world would be a better place if everyone had to work  year in customer service, like a national service that just makes everyone a little nicer going forward.\n\nI also have food throwing kids and there isn't much you can do to stop them sometimes and the mess in this pic looks familiar, but the 5 minutes it takes to pile it all up to make it easier to clear and pick the food off the floor into a plate on the table means I'd never leave it looking like this.",
                                    "score": 36,
                                    "author": "Mfcarusio",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt; I honestly think the world would be a better place if everyone had to work year in customer service, like a national service that just makes everyone a little nicer going forward.\n\nActually a pretty good idea...",
                                            "score": 9,
                                            "author": "Odys",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Ehhhh without getting paid starvation wages and having to eat ramen to survive you’re not really getting the service experience. Now if everyone had to actually LIVE like a service worker for a year then I think you’re on to something. If they get to go back to anything comfortable at the end of the day they aren’t really experiencing the life tho.",
                                            "score": 7,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "It’s clear to good people like you, but just to clarify for others I know will stop reading at, “Its OK to be a messy kid,” and assume that that is a free pass.\n\nIt’s OK to be a messy kid if they are learning how to be a human and are new at it.\n\nIt’s not OK to be messy because their parents raised them not to care about other people and treat staff like servants.",
                                    "score": 50,
                                    "author": "anjowoq",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 23,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That doesn’t sound adorable at all.",
                                                    "score": 11,
                                                    "author": "passionatepumpkin",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "And let me guess. They didn't tip?",
                                                    "score": 6,
                                                    "author": "CapnHDawg",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 4,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I bet they didn’t even tip lmao",
                            "score": 35,
                            "author": "SubbyTex",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's funny how when I was a server I was able to tell nearly instantly who's gonna tip and who isn't and 99% of the time people with kids never tipped. One time someone actually changed their babies diaper on the table and left the diaper for me to clean up and didn't even tip",
                                    "score": 49,
                                    "author": "PeeB4uGoToBed",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Doesn’t literally EVERYONE tip?  Only place where I didn’t get tips was restaurant where 1/2 the people thought the breakfast was supposed to be free since restaurant was in a hotel",
                                            "score": 13,
                                            "author": "Spikerulestheworld",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Tips are not guaranteed. I'll never work a tip based job again because no matter how hard you work to please customers and make their experience great, there's people out there who won't tip no matter what",
                                                    "score": 28,
                                                    "author": "PeeB4uGoToBed",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "LoL but the other day plenty of Redditors tried to convince everyone that tip based jobs are the best because you get so much money, and everyone is so generous, so we shouldn't have guaranteed minimum/livable wage for people of the service industry!!!",
                                                            "score": 16,
                                                            "author": "zb0t1",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Tip based jobs can definitely be better than hourly or salary based but I'm still not risking that chance. It all depends on the job type and restaurant type. The one I worked at was one of those fast sit down hibachi places where you can be in and out in like 10 minutes. We also did shit tons of hand rolled sushi which got more tips than the hibachi menu. I'd have been lucky to leave a Friday or Saturday night with $15 in tips",
                                                                    "score": 12,
                                                                    "author": "PeeB4uGoToBed",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "No they did... Bill came to 89.74 and they gave 90 and proudly said keep the change..",
                                    "score": 20,
                                    "author": "HisNameWas_HARAMBE",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "We tried and the waiter said it’s easier if they clean up. They say parents make things worse by trying to help and push food into the rug. That was my experience.",
                    "score": 183,
                    "author": "steasey",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I agree with that statement. In my opinion you just apologize and leave a big tip, then be on your way.",
                            "score": 22,
                            "author": "pigpaydirt",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Yep same experience here. I always made sure to tip the fuck out of my waiter if my kid left a mess. Thankfully they’re a little older now lol",
                            "score": 13,
                            "author": "meanbad"
                        },
                        {
                            "level": 2,
                            "comment": "It is way easier. They just come by with a bucket and sweep everything off the table into the bucket. Then they will run one of those non electric sweepers over the mess under the table. It is literally not a big deal.",
                            "score": 5,
                            "author": "CatBoyTrip",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Same here actually. Just made up for it with a really big tip. People act like these messes only happen to bad parents. Not the case at all. Most of reddit is young and has no idea what it's like to have kids",
                            "score": 4,
                            "author": "Warren_Haynes"
                        },
                        {
                            "level": 2,
                            "comment": "honestly, i find that reddit is pretty unkind and unforgiving to parents. \n\n\"They should have been on their hands and knees cleaning spaghetti off the ground without cleaning equipment...\"\n\"They should tip 50% everytime they sit down at a restaurant (maybe the wealthy ones?)...\"\n\"If they cant tip 50% they shouldnt ever visit restaurants...\"\n\"They should clean up the plates unlike any other customer is expected to... \"\n\nAt a certain point you have to realize you are asking too much to justify your first impression of someone. Just hope they apologized and did what they could, and dont try to rally a bunch of internet people against them...",
                            "score": 195,
                            "author": "mikiekwoods",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 73,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 31,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Oh my god, yes! My daughter is now 2, and despite limited eating-out opportunities during the last year+, I'm literally on my knees cleaning up anything she drops before we leave.  I get second-hand embarrassment when I see a table left like this.  Things like that are literally why we can't have nice things",
                    "score": 117,
                    "author": "Codazzle",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "We do the same thing and the sever is always like \"ah you don't have to do that\".\n\nWe be like \"yes, yes we do\"",
                            "score": 60,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The subtext is \"ah you don't have to do that (but you should)\"",
                                    "score": 12,
                                    "author": "UncleSnowstorm"
                                },
                                {
                                    "level": 3,
                                    "comment": "The look on their faces when you ask for a wet rag lol",
                                    "score": 5,
                                    "author": "boomboy8511",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Always carry wet wipes.",
                                            "score": 4,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I don’t even have kids and I all but bus my own table. I ain’t trying to make people work harder than they have to on my account.",
                    "score": 18,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 11,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What the fuck is wrong with your mom? In what world do retail workers \"get paid to do nothing all day?\" \n\nFuck, the corporation I worked at allowed for *zero* extra hours for stuff like refolding and cleaning, because those weren't \"expected\" duties. So every customer that made a mess meant we got further and further behind on our other tasks, until everyone is running around like headless chickens all stressed out trying to recover.",
                                    "score": 7,
                                    "author": "Amelaclya1",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I actually get embarrassed when my 2 year old drops food on the ground and make sure I clean up everything off the floor. But I also wipe the table and stack the plates and silverware so maybe I'm a little OCD 🙊",
                    "score": 35,
                    "author": "Paradisnuts",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "i used to wet wipe the table too and stack everything. i don't feel so weird. \n\nthe staff at one cafe used to tell me to leave it everytime. just feels disrespectful.",
                            "score": 16,
                            "author": "GlassGuava886"
                        },
                        {
                            "level": 2,
                            "comment": "We do the same thing!! I just feel that is the most polite thing to do.",
                            "score": 17,
                            "author": "thedarkestsnowwhite",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Does tipping the ever living hell out of the ticket make up for it?  My nephew did this once (special needs, he doesn't know better, and sometimes you just can't get the situation under control if he's being challenging). I was treating them to dinner and I felt pretty horrible about the mess, so I left more than 50% on a giant ticket hoping the waitstaff would at least take that as an apology and make it worth their trouble.\n\nFWIW, we did our best to keep the table situation under control but the floor was a bit of a mess.",
            "score": 1015,
            "author": "SoftcoreScorn",
            "replies": [
                {
                    "level": 1,
                    "comment": "I used to wait tables at a family diner style restaurant. Every Monday night these two guys with about five kids under the age of 7 would come in and sit in a booth. They gave their wives a night off each week and they were hilarious and friendly. They’d always let their kids get the chocolate chip pancakes with extra chocolate chips on the side, which would always end up all over the floor beside pieces of every type of food that was ordered. I loved serving them since they made the night so much more fun, were friendly and polite, and even though they left a huge mess they were always my best tip of the night. Made it so much easier to smile and clean up chocolate chips and French fries with a giant tip in my pocket.",
                    "score": 685,
                    "author": "hart1487",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah although I always feel embarrassed about it, when you go to a restaurant with toddlers, this is pretty much the guaranteed end result. Kids around age 1-2 are all in a phase where half their food ends up on the floor every meal. You don’t have a broom and dust pan so you can’t really clean up the floor. A lot of times the kids are way beyond their attention span at that point so hanging out to clean up is worse as they can’t sit still and they start to scream/cry. Best thing you can really do as a parent is leave a generous tip and bounce.",
                            "score": 202,
                            "author": "carlinwasright",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah I’m not sure why people are assuming that whoever is cleaning up the mess in the photo doesn’t have a broom and dust pan.",
                                    "score": 52,
                                    "author": "a_hockey_chick",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "This is a pretty big mess, but it's honestly not that bad given it was obviously multiple small children. Is it annoying? Yeah. Is it a big deal to sweep some shit up? No, not really. \n\nI bussed tables for years, and imo people all over this thread are overreacting. But, Reddit is on a very anti-kid kick right now so I'm not shocked lol.",
                                            "score": 14,
                                            "author": "AnotherDrZoidberg",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Bussers do, for sure. \n\nParents don't.  Granted, moms tend to have bags of holding that seem to keep everything you'd ever need, but I've still never seen a mom with a dustpan and brush (edit: in the bag).  Unfortunately the bag of holding seems to lose its magic properties when equipped by a dad.",
                                            "score": 32,
                                            "author": "JasonDJ",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That last part is very true. I love my husband dearly and he’s an amazing father but he has no clue how to operate The Bag, despite it only having 2 pockets.",
                                                    "score": 4,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Because OP is a whiney twat. It's a mess, but not more than a 2 minute cleanup, at most. \n\nI've been there before, in the place of the parent, I left a generous tip and apologized.",
                                            "score": 8,
                                            "author": "EelTeamNine"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "This is me. I try to do what I reasonably can on the table and try to keep the boy's food off the floor. We always leave a good tip. We are always polite and apologetic. \n\nThe staff has the proper tools to clean up. If I am responsible for digging loose fries or penne from under the booth with a napkin, as some reddit users are suggesting I am, then I'm just not interested. Besides, the time it takes me to clean while parenting is 5x what it would be childless with a towel and broom. Doing it myself slows the pace they can turn a table.\n\nTiming matters too. We avoid all busy times and never wait. It makes things easier and the kids eat early anyhow. If we skipped it and grabbed takeout, that is ~$25 in tips that are just gone since the table will remain idle. I would imagine most waitstaff would prefer we are there vs. not. In pre-plague times we had a few favorite spots with regular servers. While I realize staff has to be nice, I feel like I have super good relationships with a few. Always seemed happy to see us and the kids, well beyond what would be expected. If we are out of line, these guys are good at faking it!",
                                    "score": 35,
                                    "author": "ShonuffofCtown",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Lol if someone even left me a 30 percent tip, I wouldn’t even notice that I was cleaning up a messy table. You’re a damn saint if you’re leaving 50. I’m following you out to your car and giving you an OTPHJ.",
                    "score": 55,
                    "author": "optimusfiner",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "lmao what percent for a UTPHJ",
                            "score": 14,
                            "author": "RWARRRRRR",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "20 percent. They really want to give people HJs.",
                                    "score": 10,
                                    "author": "thebestjoeever",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They definitely appreciated that tip, attitude goes a long way too, bonus points when you’re not a patronizing dick. \n\nWe can tell when people are making an effort to keep kids under control as opposed to letting the spawn go apeshit.",
                    "score": 360,
                    "author": "OnlyBetterFromHere",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I talked about this with a friend the other day. You just can't get angry at a crying kid, what you get angry about is if the kid's parents just don't give a shit. If I'm on a plane and want to sleep I will most likely get annoying if a kid is crying near me, but I won't get angry like I would if the kid behind me was kicking the seat with the parents ignoring it.",
                            "score": 37,
                            "author": "Cahootie"
                        },
                        {
                            "level": 2,
                            "comment": "I can never grasp how people treat servers like shit, yes their job is to clean up your table, but that doesn't make them less of a person.\n\nI can't go to a restaurant without saying please and thank you in every interaction, I can't even imagine being as rude as I've seen some people.",
                            "score": 95,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And who thinks just because \"it's their job\" means they should go out of their way to make their job harder? The only people who get this kind of treatment are service workers.",
                                    "score": 23,
                                    "author": "Amelaclya1",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "As a bartender, if you leave me 50 percent. Make whatever fucking mess you want. \n\nI guess as long as you spend 50 bucks. This looks like 100 or so. Id be stoked to clean that for 50 bucks.",
                    "score": 134,
                    "author": "sumalumadingdng",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Just don't puke on the fucking bar when it's busy.  50% tip isn't even close to worth having to clean that up mid shift.  I've had it happen, and usually when people are that drunk, they don't tip.",
                            "score": 21,
                            "author": "WhizBangPissPiece",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Dude I’d clean that shit up for like 10 bucks lol",
                            "score": 32,
                            "author": "connmart71",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'm a server and I also grew up being the oldest of many kids. I know that most parents are going through a lot anyway so I don't really mind cleaning up these sorts of messes. I spend all day cleaning up after adults who make big messes and act worse than children. If I see that a table is struggling to control their children I have nothing but empathy. I was a child and I've been a nanny numerous times. Kids aren't robots and neither are their parents or guardians. I tend to be amazed by the size of the mess, but I'm never angry about the size of the mess.",
                    "score": 70,
                    "author": "pupoksestra",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I have kids and I really try to clean up after them but they’re always going to be messier than adults and I hope servers are somewhat understanding of that. However once I was at one of those frozen yogurt places where you get your own yogurt and toppings and then pay by weight, and I saw a young woman let her baby smear frozen yogurt over literally every inch of a high chair the baby could reach - and then leave. The mess she left was absurd. The baby was doing this intentionally, the caretaker was letting the baby make the mess, and then did nothing to even clean it a little.",
                            "score": 13,
                            "author": "publicface11"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "In my experience, the general consensus is if you tip well enough, feel free to make a mess. \n\nMost of this isn't even that bad, honestly. \n\nUnless the server was slammed and without any support staff, doesn't look like there was any prebussing done. You can't expect the diners to take their dishes to the pit themselves. \n\nThe high chair mess looks like mostly shredded cheese, which really can't be cleaned up without a sweeper of some sort. \n\nAll in all, this looks like 5 people and a baby ate at a restaurant.",
                    "score": 72,
                    "author": "MimonFishbaum",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Seriously, as a an ex waiter this is a 2-3 minute cleanup with a broom honestly",
                            "score": 29,
                            "author": "newfire9102",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "As a server, this is definitely a quick sweep up and wipe down, that's expected with children. \n\nThe giant problem I see, is that the check was dropped and it looks like the server didn't do ANY pre-bussing. No one should be paying their check, surrounded by garbage. (Unless, they requested the plates be left)",
                                    "score": 10,
                                    "author": "alyssajones22"
                                },
                                {
                                    "level": 3,
                                    "comment": "Yeah it's not terrible.",
                                    "score": 10,
                                    "author": "MimonFishbaum"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt; The high chair mess looks like mostly shredded cheese, which really can't be cleaned up without a sweeper of some sort.\n\nNah bro that's lo mein and bean sprouts.  Possibly shrimp lo mein -- that looks like a tiny shrimp at 3 o'clock.\n\nThere's some shredded cabbage as if from a springroll under the seat as well.\n\nLooks like they also gave the kid goldfish because he didn't like the noods.  The goldfish seemed to do the trick, with only one fish caught-and-released.",
                            "score": 6,
                            "author": "JasonDJ",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 4,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 7,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I used to work as a barback and busser. It’s usually the person that brought you the water and your food that’s most likely to be cleaning the mess… not many people tip bussers, we got a cut from the server’s and bartender’s tips for the day. However if a patron tipped us, we got to keep it. If you ever make a mess the busser is going to have to clean it and probably won’t see much of that tip so make sure you tip em as well.",
                    "score": 19,
                    "author": "Punkrockpariah",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "People who leave a table like that probably litter and get mad when someone doesn't throw trash away in their house.",
            "score": 585,
            "author": "ZimZimster",
            "replies": [
                {
                    "level": 1,
                    "comment": "Their home probably looks like that too tbh",
                    "score": 221,
                    "author": "IntergalacticShell",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And they still mad if you move their mess a millimeter.",
                            "score": 63,
                            "author": "Cauhs"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "And they also get mad when you tell them to control their children, and they act like they know better...\n\nIf their children have no boundaries, they are crappy at parenting",
                    "score": 10,
                    "author": "silentloler"
                }
            ]
        },
        {
            "level": 0,
            "comment": "BuT SoMeoNeS PaiD To CleAn It Up!",
            "score": 266,
            "author": "Im_Dealing_Memes",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah then we are yelled at for taking too long to clean up this monstrosity",
                    "score": 75,
                    "author": "J0rdanLe0",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Those managers need to fuck themselves and clean it themselves while the employees time them",
                            "score": 22,
                            "author": "TidyWhip",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I usually wipe my utensils with tissue before leaving the restaurant so people don't have to touch something that went inside my mouth.",
                            "score": 5,
                            "author": "_DEDSEC_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Your hands are probably a lot dirtier than the inside of your mouth.",
                                    "score": 7,
                                    "author": "shogunreaper",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Something I believe but can't prove: people do this on purpose to separate themselves from the working class (though they themselves are almost certainly working class). We eat here, you serve us. We're the moneyed gentry; you're the peasants. Clean that shit up. *snaps fingers.",
                    "score": 25,
                    "author": "soulcaptain",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "People that get shit on all day want to shit on the person below them.",
                            "score": 12,
                            "author": "thismatters"
                        },
                        {
                            "level": 2,
                            "comment": "This is spot on. First job when I was 16 was in a restaurant (Noodles &amp; Company) and one day during a lunch rush I had two tables in particular: one with a woman and her two small children, and the other with three middle-aged guys in suits. I rolled my eyes and prepared myself for the terrible mess that the woman and her kids would leave. Went back into the kitchen to clean some dishes and help the cooks. \n\n15 minutes later it comes time to bus the tables and the woman had cleaned and stacked everything as best she could. Meanwhile, those men in snappy suits had left the worst mess that they possibly could have. Drink spilled, food all over the place (and ground into the carpet), and like 20 napkins crumpled and littering the table, chairs, and floor. \n\nI'm guessing that woman has worked retail or restaurants before, and knows it's shitty to leave a complete mess for someone. Fuck those guys, though. \n\nEver since that job, I always tidy up everything and stack plates. I'll get on the floor and clean up any food my own young children have managed to grind into the carpet. It's just rude to leave a catastrophe for someone to deal with.",
                            "score": 6,
                            "author": "Pav09"
                        },
                        {
                            "level": 2,
                            "comment": "Sunday’s were always the worst, they get out of church and feel more holy than thou.",
                            "score": 5,
                            "author": "SoftwareKitten",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "When I was waiting tables, there were these parents that let their little bastard open up all of the sugar, sweet&amp;low, and equal on the table so he could drive his matchbox car in the \"snow.\"",
            "score": 59,
            "author": "strangebru",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don't agree with OP's judgement, but this, here, is piece of shit level.",
                    "score": 4,
                    "author": "EelTeamNine"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Or, at least tip heavily to make up for it. As long as someone tipped me enough for service, I was cool with it. But, do this shit and leave no tip? Better run!",
            "score": 12,
            "author": "SFlibtard"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 11,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "If that’s intentional with no thought towards others, sure, fuck that person but usually it’s just people being burnt out.  Like, Nah man, I’ve been in food service for nearly 20 years and I ALWAYS tell parents who apologized for the mess, “ hey that’s why you go out, to not worry about the mess.  You do enough of that at home”. Don’t get me wrong I always complained and joked about the ‘blast radius’ the kids obtained, but I never held I’ll will towards the parents unless they were also shitty people aka ‘Karen’s’ nowadays.  Kids are fucking hard man and I could always tell when people felt bad about the mess.  No worries, that’s literally my job.",
            "score": 149,
            "author": "MelatoninJunkie",
            "replies": [
                {
                    "level": 1,
                    "comment": "There are two high chairs plus two kids meals here.  They probably create this same scene no matter where they eat, despite best efforts.  I am not sure what people expect, but going to the back, borrowing cleaning equipment while 4 kids quietly stand there without further messing and bothering people doesn’t sound realistic.  This restaurant provides high chairs and kids meals, which isn’t an invitation to create a huge mess, but is an invitation to have children in the establishment.  I can assure you the meal was more tiring an frustrating for the parents than just making spaghetti at home, but you need to take your kids out from time to time to give them experiences and help keep them learning.",
                    "score": 43,
                    "author": "IWasTheFirstUpvote",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes! I looked that table and was like yep. That’s what kids do. Denny’s it looks like. It looks like a two minute cleanup job at most.",
                            "score": 19,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I've tried cleaning up after my kids and some places won't let you borrow the broom or dustpan.  I'm guessing most of these commenters don't have little kids",
                            "score": 6,
                            "author": "a_mammal",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Right. They literally will not let you clean up. I mean, I'm not getting on my hands and knees for that.",
                                    "score": 4,
                                    "author": "TacoNomad"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I'm someone that stacks my plates at restaurants and cleans stuff if it gets on the table / floor.\n\nThe table here really doesn't look that bad or time consuming to clean up.",
                            "score": 5,
                            "author": "mtarascio",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thank you so much for this :-).\n\nIt's even worse when you *have* to go out with a baby/young toddler because that friend/relatives just *has* to eat out. And then you get to feel bad about the mess, not eat anything (or at least not taste it) and are more tired then before....bloody brilliant.\n\nBig respect for the workers but as a parent I hated going out with babies too.",
                    "score": 10,
                    "author": "KayItaly",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "People on reddit are idiots. As a father it looks like they have a messy infant/toddler so some of the mess is forgivable. Looking at the amount of napkins used and the effort to put their trash on plates signifies that they made an effort to clean up after themselves. Still a shitload of mess but not as awful as people are making it out to be.",
                    "score": 18,
                    "author": "K1NGMOJO",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Can't believe I had to scroll so far down to see a comment like this. It's not THAT big of a mess. And besides, the workers have the tools to clean the mess up quickly. \n\nA broom will take care of it in a minute. If the parents were to clean it up they would be on their hands and knees with napkins for 10 minutes.",
                    "score": 45,
                    "author": "danc4498",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;\tCan’t believe I had to scroll so far down to see a comment like this.\n\nReddit is usually pretty anti kid/parent so I’m not surprised that comment was lower, hell I thought I’d have to scroll more for it. \n\nAll we have here is a picture we have no idea how apologetic the parents were or what kind of tip they left cause of the mess.",
                            "score": 6,
                            "author": "Tasty_Chick3n"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Come now... you're getting in the way of all the people who've never had kids circle jerking about the fact that every parent alive is horrible.\n\nSource: Worst parent in history whose twins have definitely left a disaster like this before that I pointlessly tried to clean up as the children were exploding.",
                    "score": 4,
                    "author": "WeDidItGuyz"
                }
            ]
        },
        {
            "level": 0,
            "comment": "And then they leave you $2 tip on a $100 bill.",
            "score": 8,
            "author": "flufffyrice"
        },
        {
            "level": 0,
            "comment": "I'll one up you.\n\nI was helping out bussing tables at my server job a few years back and actually witnessed a parent change their child's diaper on the table before leaving. This table's mess looked quite similar to this, except they left me the gift of their kids shitty diap on top.\n\nI'm now a mother and cringe at the thought of leaving a restaurant like this, let alone changing a diaper anywhere but the car.\n\nI can't even begin to explain how common this is and it only gets worse when you work in a town where the 1% live.",
            "score": 46,
            "author": "klanies",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'll second that, I've seen it.  Middle of a Saturday night dinner service, bare ass baby and a dirty diaper on the table.  I was managing, so I had to go explain to fucking adults why the tables around them were disgusted with their behavior.  Mom tried to pull the \"I need to talk to the manager NOW\" card, and I politely informed her that I was indeed the manager, and that if it happened again, I'd kick them out.\n\nShe still could not grasp why changing a fucking diaper full of shit next to someone eating was disgusting. Men's, women's, and unisex bathrooms all had changing tables.\n\nI hate people.  Anyone that wants to hate people as well, may I suggest a decade in the industry?",
                    "score": 26,
                    "author": "WhizBangPissPiece",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lady, if you needed to take a shit, would you do it here at the table into a bag, or would you go to the restroom?  Same deal with the kid,  dealing with shit happens in the restrooms.  Nobody wants to see or smell your shit or the kid's.",
                            "score": 6,
                            "author": "worldspawn00"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Former server here—I’ve seen this way too often. And one time these people even left the loaded diaper behind in the booth for me to clean up. And, of course, they were shit tippers. People are fucking disgusting, and I feel bad that those children are being raised by animals.",
                    "score": 12,
                    "author": "hiimnormal11"
                },
                {
                    "level": 1,
                    "comment": "Yeah, I've also had to throw away a used diaper someone left on the table even though 1. there were changing rooms a few meters away, and 2. there were several trash cans for them to throw the diaper away in themselves if it absolutely had to be changed at the table.",
                    "score": 5,
                    "author": "squadoodles"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Haha my wife and I are totally opposite of this. Before we leave we pick up anything our toddler has flung on table and try to wipe down everything with wet naps. We get weird looks from other patrons",
            "score": 89,
            "author": "Prestigious_Garden17",
            "replies": []
        },
        {
            "level": 0,
            "comment": "My kids are 16 months apart. I rarely went out because being a single parent with two toddlers means there’s going to be a mess. I would do my best to keep them from making one, clean up as best I could going along, but small children (3 and 4) are not exactly neat eaters. There was always a mess on the floor like that. I tipped well (didn’t go out if I couldn’t afford a good tip), and would always apologize to the waitstaff I knew was stuck cleaning it up.\n\nSmall children are just messy. I hope they tipped well.",
            "score": 127,
            "author": "MiseryMiss",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I’m a server. This is normal and doesn’t really faze us anymore. I’m not gonna hand my table a broom before they go and say hey, trash can’s over there, thanks. It is what it is. Server could have maybe prebussed more plates off the table, but when it’s this bad it is easier to just grab a bus bin and chuck it all in there in one go, trash and all. \n\nFor fun, if you get an especially dirty table thanks to a group of kids, you show it off to your coworkers while they’re eating, “Hey, go check out 42, it’s destroyed.”\n\nUnless your kiddo drew on the table, carved their name into it (we have a “Daryl” carved into table 22) puked, shit, or smeared something (or any of the above) into the carpet, parents do not worry, apologize, or feel the need to overtip. This is a part of our job at the end of the day. Your kid isn’t the first one to make this mess and probably won’t be the last one tonight. As long as you’re polite and your kids aren’t constantly screaming, we are not bothered by the mess!",
            "score": 22,
            "author": "LilNightingale",
            "replies": [
                {
                    "level": 1,
                    "comment": "I analyzed the shit out of this picture. The floor is rough but it's common with any highchair child. I don't think the table is that bad. It has the illusion of being bad, and there is some weird shit going on.. but I think the quantity of napkins make it look worse than it is. I see evidence that the people at this table tried to help a little (that napkin front and center has a ton of shit in it, like the parents cleaned up some other messes that are no longer seen).\n\nWhat I agree most with, is it really comes down to the parents attitude and how they engaged with the waiters.\n\nBUT ON THE MODERN SOCIAL INTERNET, INSTANT PITCHFORKS AND ASSUME THE WORST!",
                    "score": 6,
                    "author": "rxrx",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have a now 2 year old and I used to get in trouble with staff for going and finding their brooms to sweep. Still never stopped me from trying everytime.",
            "score": 36,
            "author": "Sleepyweasel-jr",
            "replies": []
        },
        {
            "level": 0,
            "comment": "one time, a family of 7 came in 30 minutes from closing and stayed for nearly an hour and a half. then we had to stay and clean up the mess they let their kids make. We closed at 10 and we left at nearly 1.",
            "score": 5,
            "author": "jupiter-calllisto",
            "replies": []
        },
        {
            "level": 0,
            "comment": "All depends on how that tip looks",
            "score": 9,
            "author": "ballhernia",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I worked as a waiter for years and had a family of 6 come in. Middle aged parents, 3 kids under 6 and a teenager. They made a colossal mess like this and as they left and left a £5 tip the dad slapped me on the shoulder while laughing and said \"looks like we've given you some work to keep you busy\", the teenage son stole the tip as he got up and then saw him give it back to his dad when they got outside. \n\nI managed to get the last laugh as they were refused a table and barred the next time they came in.",
            "score": 40,
            "author": "Independent-Ninja-65",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wtf was the point of them tipping in the first place",
                    "score": 19,
                    "author": "hiimnormal11",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I mean, they almost definitely just made up the story. It makes no sense.",
                            "score": 21,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I work as a server and this never bothers me. I've got kids and I know what kind of mess they make, so I can relate. Also, this mess will take a handful of seconds to clean up, so its not that much trouble. \n\nThis is about shaming people, this kind of after dinner mess isn't out of the ordinary.",
            "score": 23,
            "author": "clamsmasher",
            "replies": [
                {
                    "level": 1,
                    "comment": "Genuine question: don’t they give you brooms and scoops for this kind of thing?  Everyone in this thread is saying of course they would clean up after their kid but I’m guessing it’s a lot easier for the staff to do it since they have the right tools.  Unless someone is bringing a broom with them to dinner, or they ask to borrow the cleaning supplies or something?\n\nIDK this is why I’d never have kids I guess.",
                    "score": 7,
                    "author": "Keljhan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, brooms and a dustpan on a long handle. It takes like three swipes to push all that mess in to the dustpan, and you don't even have to bend over.\n\nSame with spills, when someone accidentally spills their drink, then they try and clean it with napkins and apologize the whole time. I've got towels on my waist and a mop around the corner, it takes me a few seconds to clean up a spill and I'm doing it all day. But people get embarrassed or something and feel like they have to take care of it themselves. It's my job, I'm the server, I feel like that's the whole point when you go out to eat.\n\nI guess its just different perceptions. My job is to clean up messes like that, and I don't think the mess in the pic is a big deal. Other people do, I guess people are different.",
                            "score": 10,
                            "author": "clamsmasher",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think it probably depends on the employer too.  If the servers are treated well then a mild inconvenience doesn’t disrupt their work, but if it’s totally cutthroat and awful to work already the added stress is probably brutal.",
                                    "score": 4,
                                    "author": "Keljhan"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "No way man, the staff would definitely prefer it if you grind the food into the carpet by trying to clean it up with a napkin on your hands and knees for 30 minutes while your toddlers run around unsupervised and preventing them from turning the table over to new paying customers.",
                            "score": 6,
                            "author": "rmslashusr"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I hate this shit. I'm a host at Applebee's and Sunday mornings are the fucking worst. There's so many kids in there that we run out of boosters and highchairs. Then there's always a fucking mess. I hate especially on the corner booth because that thing is impossible to clean. And all the kids break their crayons up into small pieces and scatter them everywhere. Thank God we are currently out of crayons.",
            "score": 18,
            "author": "bobby-spanks",
            "replies": [
                {
                    "level": 1,
                    "comment": "The Sunday after church crowd is always the worst.  The most demanding mother fuckers, and maybe you'll get lucky and get a fake $20 bill with a Bible verse on it.",
                    "score": 17,
                    "author": "WhizBangPissPiece",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's always the tables with high chairs.",
            "score": 40,
            "author": "timetraveleryyz",
            "replies": []
        }
    ]
}